[{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"I wonder when was the last time Donald had his eyes checked? He sure seems to be lacking any perceptive abilities whatsoever!…maybe it’s a mental issue?, I don’t know. I’m not one to judge too quickly but it sures seems to me that Donald is just another ‘Moron’ who is seeking attention any way he can. He definitely does not take the time to study something before remarking on it.\nI just try to  ignore people like him, people who walk around ignorant as can be, that is ;-).\nR\n\n","date":"December 3, 2011 at 11:09 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5202","author":"Ron","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"It seems that any “expert” can have a few minutes of Fame if he publishes an opinion on the Shroud of Turin. I wonder why that is?\n\n","date":"December 3, 2011 at 3:57 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5205","author":"AnnieCee","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"Hope you guys don’t mind if I defend myself a bit here….. nice site \nFirst, the picture I used was from wiki, in the public domain, they say so at the bottom of their site, the one you use here is mine, did you ask me if you could use it?  , don’t forget to send me either an apology or $5000 bucks for using my “very expensive” work which took effort to produce and post for my readers, not yours.  I check for copyright on all the pictures on my site, so should you. :-(\nFive minutes is a lot of work you know, you shouldn’t steal from me in that manner, I thought you guys were Christians, that is hard to believe considering how much you insult me here.\nI rather take the money but if you can’t afford it then just give $5 to charity and then come on over to my site and leave there a nice apologetic comment, kiss butt and all that.\nNah, I’m just kidding you guys, I’m an Aussie and we always stir, don’t let it bother you  :-)\nSecond, I did nothing to the picture, I took the one from wiki, opened it with Photo Editor and then clicked on the “Negative Effect”, I didn’t colour it in any way, it is an exact job as that which was done by scientists in the past. you can do it yourselves if you wish.\nSecondly, I am blind, that is why I zoomed it. but I did nothing else so ….\nCan you see the sword or not? already I have had hundreds of emails from others telling me they do. personally I wish they didn’t as I am religious, I believe in God and Jesus and wish it were a picture of Jesus but it isn’t; I have a lot more evidence on this but why post it, I only posted enough to generate discussion and no more..\nI certainly never expected to be libeled as well by been called a “Moron” online .. considering I am a scientist I take offense to that too .. maybe … nah, I’ll let that one slide.\nThankfully I would never breach God’s trust by worshiping a piece of rug and turning it into a religion icon which just happens to be against the second commandment. Those of you who do, do so at the risk of your own souls, not mine.\nhave a nice day, thanks for the write-up, gave me lots of hits   :-)\n\n","date":"December 4, 2011 at 5:39 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5217","author":"Donald","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"One more thing,  should have mentioned this … I am an expert on computers, I am in fact a computer scientist and an engineer. The Shroud is not a fake, I still maintain that it is not the image of Jesus;  but the shroud itself is not and cannot and has never been a fake.\nI don’t know who or what made the imprint on the cloth, as well you know I have my own theories on that but science demands that I tell the truth … it is impossible for this to be a fake just as it is impossible for anyone to have somehow photographically faked the image because there is more than enough proof that that same image was already there back in 1300 AD.\nA wonderful scientific mystery, I shall look into it some more.  :-)\n\n","date":"December 4, 2011 at 5:57 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5218","author":"Donald","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"I’m back  :-)\nHere’s a link for you, I made the picture much bigger without losing resolution, it’s what us “experts” do .. \nhttp://wisdomblogsdotcom1.wordpress.com/2011/12/04/the-shroud-of-turin-part-ii/\nNow you can really pick on me :-)\n\n","date":"December 4, 2011 at 7:24 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5219","author":"Donald","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"Wow, you guys are swift to judgement!  I agree that Donald’s ideas are a bit crazy and, after repeated appeals from me, he says he is now watching the programme.\nAlthough I am grateful for the free publicity, I would like to hope that, before leaping to conclusions about me, people will actually read the History page of my blog and follow the link to my old Falsifiable Theology page on Blogger.  However, if you can’t be bothered to do that (because you prefer to leap to conclusions about people) then, for the record, I am no religious nutcase:  My position is one of a reformed sceptic.\n\n","date":"December 4, 2011 at 8:37 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5221","author":"Martin_Lack","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"Donald, along with many other amature and/or zealous shroud enthusiasts suffers from pareidolia. That is, picking a pattern out of random information. Examples include clouds that look like elephants, or the island of Great Britain (my favorite to pick out on a spring day). We see many times what we want to see. Donald is no worse than the guys who say they found coins in the image’s eyes. As the main article mentioned, what Donald thinks of as swords and armor are simply creases, burn marks, water damage, natural graining and the light areas that show the separation of the legs.\n Also, the width and mass of the body seems to be the same. Wouldn’t armor significantly expand the size of the image? Unless it was skin tight (like modern athletic “armor”), We should not fault Donald, but he should not be so affended when after making bold assertions to the world, the world makes them right back.\nAnd to poor Martin, you are a long time blogger. You know the world is full of the impulsive and half informed. Humans are savages and internet discourse proves it. If you don’t like it, get out of the kitchen.\n\n","date":"December 4, 2011 at 10:33 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5222","author":"royalcanadian2011","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"You do not need to apologise to me, or take pity on me, but, thanks all the same.\n\n","date":"December 4, 2011 at 4:47 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5229","author":"Martin_Lack","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"Donald, something must have been lost in translation from American to Australian. In America a moron is someone who is perceptive, bright and very intelligent. I’m sure that is what Ron meant. \nAs for my criticism of how you see what you do, you need to do some research. Don Lynn at the Jet Propulsion Lab (JPL) along with other image analysts studied the images for months. There is no sword image there (yes, I see something that looks like a sword made up of banding lines, creases, dirt, etc.. Nor really are there any confirmed things some people see like flowers, a broom, dice, teeth, coins, nails, etc. I see what looks like flowers, but I see how they are formed by anomolies. Forensic pathologists such as Robert Bucklin and Fred Zugabe have studied the image using large scales hi-res life-size images. This is the front side and backside of a man on the shroud. It may not be Jesus, as you say, but it is a naked man who appears to be crucified. I can cite dozens upon dozens of peer-reviewed scientific journals for you. \nAs humans, we have a very natural ability to see images in random patterns. Frequently, people see patterns with which they are most familiar. Faces are common and hence people often see images of Jesus or Mary on tortillas and grilled cheese sandwiches, in wood grain, in patterns of smudges of all sorts. I see what I am certain is a pareidolia of a sword. That is the word many shroud researchers use: pareidolia. Search this blog (upper right hand corner) for pareidolia.\nMartin, I will take the time to read some of your blog. We are not rushing to judgment. This blog gets over 1500 or more pageviews per day, mainly on the home page. There are two or three posts per day. We just look rushed. \nBy the way, I like the documentary you recommend because I appear in it. But I don’t agree with some of the things other researchers who also appear have to say. That is the way it is in shroud research. Later today, I hope to present a list (put together by Joe Marino) listing over 2000 primary researchers in the last century, most still active and most legitimate scientists in academia. \nDonald, I don’t worship the shroud. I have never met anyone who does. I merely want to know what it is, very carefully. \nDonald, I can probably arrange to get you gigs and gigs of some high-res full-color, large-size images for serious study. Let me know if I should pursue it.\n\n","date":"December 4, 2011 at 10:44 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5223","author":"episcopalian","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"No need to apologise to me.  My complaints were a little tongue-in-cheek anyway.  I was merely seeking to defend Donald in order to give him time to apologise for being so silly (which he has now done) :-)\n\n","date":"December 4, 2011 at 4:49 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5230","author":"Martin_Lack","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"“Donald, something must have been lost in translation from American to Australian. In America a moron is someone who is perceptive, bright and very intelligent. I’m sure that is what Ron meant. ”\nA wonderful and well written apology that leaves me feeling that I should somehow be a moron …  what choice do I have but to accept it, well done.  :-)\nNo need for the larger images thanks, last night I managed to find a way to expand the image without losing resolution although I shall not be pursuing any further studies on it, there are things there I did not like and shall never mention again. personally I wish I had never looked at the thing. I am sorry I did.\nonce again, nice site :-)\n\n","date":"December 4, 2011 at 4:38 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5228","author":"Donald","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"It would be fun if Donald could tell us how all the real blood stains (forensically accurate decals from clotted wounds) could have appeared on a knight metallic armor !!!  Really, I’ve never read a hypothesis so off-track…  Sorry.\n\n","date":"December 4, 2011 at 7:03 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5235","author":"Yannick Clément","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"Yannick – That I know of, no research has been done on the “armoured” side of the shroud, however even though I am no expert in the field of chemistry, I do know that it would be impossible for anyone to claim the stuff on the shroud is blood.\nAccording to the little research I’ve done, the stuff they found is not blood as such but  only porphyrins, a type of colored compound which may not only be found on blood but also  chlorophyll, and many other natural products, nobody has ever claimed it to be actual blood except religious fanatics, no expert has ever said “Yes, it is definitely blood”.\nin fact, any test on porphyrins which is more than 100 years old will always yield an AB positive blood type even if it isn’t real blood because the stuff is organic and contains a chemistry which is also known to be a part of the same chemistry as blood.\nThis is well known in police forensics, did you know that?\nSeveral claims have been made about the blood and many claims have been made about DNA testing but only a fool would accept them as conclusive, no claim has ever been confirmed (or denied), in fact the apparent blood appears to be so old that the DNA is badly fragmented. \nDr. Andrew Merriwether has said that “… anyone can walk in off the street and amplify DNA from anything. The hard part is not to amplify what you don’t want and only amplify what you want (endogenous DNA vs contamination).” It is doubtful that good DNA analyses can be obtained from the Shroud.\nAs for what you guys think of what I see or don’t see, I don’t care, my opinion has been accepted by many in the past, including courts, so frankly I rather tend to think that here on this site I am only up against a bunch of religious contraries who would do and say anything to justify their beliefs even if that means not believing a truth when it is put in front of them.\nI am not so blind yet that I cannot tell a sword from a broomstick, already hundreds of others have emailed me to tell me that they too see the sword and the light shinning of it; so thankfully I can now claim to be one of many, not just the only one.\nAlso I might add that with regards the blood, when looking at the “hair” on the image with the face, (which is not really his hair, but some kind of a hood) the “blood” streaks down “towards”  his face.\nHow can this be when everybody knows that first everybody knows that at that time Jesus was dead and his heart was not pumping and Jesus body was laid to rest in a prone position and then washed clean. there should be no blood whatsoever; If anything the streak should be towards one side or another of his face, not towards the chin. Again forensics will tell you this is wrong, it cannot be.\nAnd frankly, that is only one streak, why is the rest on top of the hair/hood? there are no other signs of cuts or abrasion to the head at all, not one.\nthen there is the thoracic cavity … what a joke that is … please, that is really a laugh.\nHere is a link to an over-expanded view of the face and body, please mark the blood streaks for me and show me cause to believe that is his hair and not a hood. I could tell you why I know it is not hair, a question of both gravity and the prone position of the body but I’ll wait for your answer first.\nhttp://wisdomblogsdotcom1.files.wordpress.com/2011/12/shroudofturinextralarge.jpg?w=1000&h=1927\nalso .. the bodies are not the same .. the image with the face has wider hips, I checked and measured it. why don’t you do the same before replying, just make sure you use the original negative.. my zooms are of different size.    :-)\n\n","date":"December 4, 2011 at 7:38 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5236","author":"Donald","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"I think you should read the book “The doctor at calvary” written by doctor Pierre Barbet, a frenchman.  He wrote his book in 1949 and he didn’t need to wait for any chemical test to KNOW that the blood stains on the cloth are mirror images decals that came from humid blood clots.  He saw the Shroud in person in Turin in 1933 and saw it in a public showing outside the cathedral.  With the sunlight, he automatically recognized authentic blood stains.  Later, he made a lot of researches with the photos of Enrie (from 1931) and was totally convinced that it was real blood stains.  Later, history proved that he was completely right !  Adler, Heller, Baima Bollone, Zugibe, Bucklin, etc.  All those medical and blood experts were convinced that it was real blood stains.  Adler and Heller made chemical test that proved that the blood stains contains real blood material coming from real blood (from a human or an ape – their tests couldn’t be more precise).  The same year, those results were confirmed by Baima Bollone own chemical research (he was even able to specified that the blood was clearly human).  And later on, there was even some DNA tests on blood samples coming from the Shroud proving once more that the blood is human and even male.  So, all those data make it clear that the blood stains on the Shroud are real blood stains and that it is human.  I think you should consider another hypothesis to explain the Shroud (bloody and body) images…\n\n","date":"December 4, 2011 at 9:33 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5237","author":"Yannick Clément","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"Yannick you just fouled up my statement. I was certainly sure you’d come back with much more vigor then that. ;-)\nR,\n\n","date":"December 4, 2011 at 9:36 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5239","author":"Ron","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"I don’t understand exactly what you meen by “fouled up” but I can say that I force myself to stay polite in regard of the comments made by Donald.  It’s evident that M. Donald don’t know much about the Shroud and I forgive him his false statements because of that…  I found you a bit too much nasty Ron ! ;-)  \nSome people just don’t have the knowledge you and I have about the subject (and I don’t even pretend that you and I are specialist of the Shroud).  Donald is stupid ?  I wouldn’t say that.  What I can say is that he need to read much more on the subject.  Here’s a friendly suggestion for all the Donald of the world who don’t know much about the Shroud :  Go to this page (http://shroud.com/library.htm#papers) and read as much scientific paper as you can.  Also, you can read the book published by Ray Rogers (A chemist’s perspective on the Shroud of Turin) and the one by Alan Adler (The Orphaned Manuscript).  I also highly recommand the reading of Pierre Barbet’s book “A doctor at calvary”.  \nAnother friendly advice :  Maybe you should read more on the subject before making comments about the Shroud…  I just think it would be nice if you could read more on the subject.\n\n","date":"December 4, 2011 at 10:11 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5241","author":"Yannick Clément","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"OMG listen to this guy, please people tell me he is joking about everything, please. Dan thanks, but I and my statements need no defending. I stand by my previous statement. This guy comes out here saying the’s a scientist, that his opinion is so highly judged it’s been accepted by courts. Yet he admits to doing “little research” and makes comments like; “Yannick-THAT I KNOW OF no research has been done on the “armoured” side of the Shroud”. LMAO, armoured side? That’s the DORSAL side and it has definitely been studied thoroughly, but you would know that if you had done even a tad of friggen RESEARCH! I could go on for ever here cutting up your rediculous statements, but I don’t have the patience. I’m sure our good friend Yannick will be here soon to rip a piece out of you~ get ready for a long read….\n…..a Scientist…lol.\nBy the way here’s the definition (according to the freedictionary) of Moron; 1. A foolish or Stupid person.  2. (Psycology) a person having an intelligence of between 50 and 70, able to work under supervision.\nR.\n\n","date":"December 4, 2011 at 9:33 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5238","author":"Ron","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"\nYannick Clément :I don’t understand exactly what you meen by “fouled up” but I can say that I force myself to stay polite in regard of the comments made by Donald. It’s evident that M. Donald don’t know much about the Shroud and I forgive him his false statements because of that… I found you a bit too much nasty Ron ! ;-)\nSome people just don’t have the knowledge you and I have about the subject (and I don’t even pretend that you and I are specialist of the Shroud). Donald is stupid ? I wouldn’t say that. What I can say is that he need to read much more on the subject. Here’s a friendly suggestion for all the Donald of the world who don’t know much about the Shroud : Go to this page (http://shroud.com/library.htm#papers) and read as much scientific paper as you can. Also, you can read the book published by Ray Rogers (A chemist’s perspective on the Shroud of Turin) and the one by Alan Adler (The Orphaned Manuscript). I also highly recommand the reading of Pierre Barbet’s book “A doctor at calvary”.\nAnother friendly advice : Maybe you should read more on the subject before making comments about the Shroud… I just think it would be nice if you could read more on the subject.\n\nYannick Clément :I don’t understand exactly what you meen by “fouled up” but I can say that I force myself to stay polite in regard of the comments made by Donald. It’s evident that M. Donald don’t know much about the Shroud and I forgive him his false statements because of that… I found you a bit too much nasty Ron ! ;-)\nSome people just don’t have the knowledge you and I have about the subject (and I don’t even pretend that you and I are specialist of the Shroud). Donald is stupid ? I wouldn’t say that. What I can say is that he need to read much more on the subject. Here’s a friendly suggestion for all the Donald of the world who don’t know much about the Shroud : Go to this page (http://shroud.com/library.htm#papers) and read as much scientific paper as you can. Also, you can read the book published by Ray Rogers (A chemist’s perspective on the Shroud of Turin) and the one by Alan Adler (The Orphaned Manuscript). I also highly recommand the reading of Pierre Barbet’s book “A doctor at calvary”.\nAnother friendly advice : Maybe you should read more on the subject before making comments about the Shroud… I just think it would be nice if you could read more on the subject.\nI think, I was as polite as I could be under the circumstances. I take offense when people start spewing crap all over the Internet and especially on topics as important as the Shroud, without doing any legitimate research!…I have no patience for that my friend, as I’ve come across it far to often. Trying to get them to research the topic usually falls on deaf ears also.\nIf someone who speaks on a topic without any knowledge on the topic but feigns to be knowledgeable, then one comes off as a moron to me. I’m sorry if that seems impolite but thats my view. As for your friendly advice; Keep it.  I have a strong sense that I have probably studied and read far more then you ever have when it comes to the Shroud. I’ve accumulated approx 20 years of study on the Shroud, so please don’t get too snarky.\nR.\n\n","date":"December 4, 2011 at 10:59 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5242","author":"Ron","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"Read again my post.  The friendly advice was for Donald !  Don’t be so upset for anything ! ;-)\n\n","date":"December 5, 2011 at 9:34 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5253","author":"Yannick Clément","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"Actually judging by what little research I’ve done it has become obvious to me that nobody has ever proven there is true blood on the cloth.\nAs an example .. “And later on, there was even some DNA tests on blood samples coming from the Shroud proving once more that the blood is human and even male. ”\nSo what were previous tests done on, toilet paper? Dr. Andrew Merriwether  clearly stated it, “NO DNA test is possible on such an old piece of rug” … I did not say this, but somebody who tested the shroud sure did.\nBut regardless, considering the history of the thing it is not only more than likely that the whole thing is a fraud (although I do not dispute that the image is authentic) and still …\nI notice that you guys like to change the subject quite a bit; you haven’t answered a single question I put to you yet, what are you, mindless fools or something? … \nSo I shall ask a positive question here, … have any of you ever done any tests on the shroud yourself or is it possible that you, like many others, are all nothing but complete stupid fools who are willing to believe any bullshit you are told and remain mindless donkeys praying to a old rug?\n(just a bit of self defense here seeing as how you ignorant idiots like to show your complete lack of education by insulting complete strangers)\nI’d call you dickheads but that would be too rude, so stuff your vigour, I’ve come to the conclusion that you are nothing but morons yourselves, you’d have to be to rely on the things you mention. \nhave a nice day.\n\n","date":"December 5, 2011 at 12:37 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5243","author":"Donald","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"You see folks, the true Donald comes out and may I say no different from the countless mindless people who leave similar comments all over the Internet. Check out most Shroud videos on Youtube you’ll see what I mean. They ask senseless questions make complete unfounded remarks, they lie thru their teeth and then get all messed-up when people call them out. I had Donald pegged from the start…Donald please take your rhetoric somewhere else if your not interested in finding the truth!….and in finding the truth I mean do some ‘real’ honest research on your own, you’ve been directed to some start-up reading. \nR.\n\n","date":"December 5, 2011 at 1:53 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5244","author":"Ron","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"I am interested in finding the truth, what I was not prepared for was the number of insults you and your colleague have thrown my way .. let’s see, what were they … moron, ignorant, lier, suffers from pareidolia and so on and not only that, you even say that you have to “force” yourself to be polite.\nWell, it is more than obvious that you have to force yourselves, else your total lack of civility you have to offer might shine right through you, you have clearly shown that you have no ability to conduct a proper debate without resorting to insults. no brain fools is what you are.\nInsults  which were clearly designed not only to not have to answer any questions I put to you, but also designed to get me angry and throw it all right back at you so that then you could say … : I had you pegged” … \nmate, you are not a fool, you are actually quite smart for an idiot.\nQuite frankly fellows, with the type of debate you put on,  in the world of science you wouldn’t amount to the DNA of a slug. You are as useless as debating an issue as  teats on a bull and quite frankly not even worth the bother of another return from me.\nHow on earth the owner of this site allows you to diminish his reputation with your insults and innuendos is beyond me;  rude, arrogant, ingrates ..  I doubt if there is a single IQ point between the lot of you.\nYou call yourselves Christians? you wouldn’t know the meaning of the word.\n\n","date":"December 5, 2011 at 2:58 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5245","author":"Donald","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"I think you’re just misinformed, that’s it.  No need to start a war here.\n\n","date":"December 5, 2011 at 11:22 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5254","author":"Yannick Clément","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"In all that ranting and raving, Donald, you have merely demonstrated that you are equally capable of slinging insults and talking out of your bottom.  Scientists have studied the shroud in extra-ordinary detail for decades now and, the most incredible thing is that they can tell you what the image is not, but they cannot tell you what it actually is…  I therefore think the shroud – unlike any number of little pieces of wood claimed to be from the Cross and secreted away in Roman Catholic churches all over Europe – is a truly remarkable artifact; and I am more than happy to be respectful of anyone who considers it to be the “smoking gun” of the Resurrection because the one thing it clearly is not is a medieval fake or a painting by Leonardo da Vinci.\n\n","date":"December 5, 2011 at 6:35 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5248","author":"Martin_Lack","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"Yeah, but unlike them I enjoyed it, so it goes to prove a point, scientists are the equivalent of a redhead, these lot are all brunettes :-)\n\n","date":"December 5, 2011 at 6:52 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5250","author":"Donald","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"I thought you said you are an Engineer?  What hair colour is that (or are you “a baldy“)? :-)\n\n","date":"December 5, 2011 at 7:36 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5252","author":"Martin_Lack","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"First I became an electronics engineer, Martin, then with the advent of computers I went back to school to learn programming but somehow ended up a computer scientist.\nSomewhere after that I became a professional BS artist blogger :-)\nRight or wrong, I am glad I stirred debate, it’s what blogging is all about.\nPS: normally I have long black curly locks to show off my “extreme handsomeness”  :-)   but like many Aussies, because of the extreme heat I shave it all off once a year, always at the beginning of spring.\n\n","date":"December 6, 2011 at 10:40 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5288","author":"Donald","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"Donald is right to a certain extent. In old days (in late Antiquity and in the Middle Ages) POETS, STORY TELLERS & even MYSTICS used to describe the Shroud Man Image in terms of knights, magic objects and the like. Matter of pareidoliac facts, in primary vizualisation, you can even see all the Grail scene objects on the Shroud. For instance, IF YOU JUST WANT TO SEE THE VISION OF THE GRAIL CHALICE OF BLOOD, just look at the Shroud face upside down and the grail chalice of blood will appear to your (now) initiated eyes. 15 years ago, I proceeded to the archaeology of the Grail Imaginary. IT DOES WORK with the Turin Shroud! For instance, do you know the name of Guinever (Arthur’s wife) play with the two old Breton words “guin” and “bara” to mean wine and bread that is the blood and body of Christ?\n\n","date":"December 6, 2011 at 11:13 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5270","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"Max, don’t take it badly but I can’t help myself here…  If you can see “the vision of the Grail chalice of blood” by lookin’ at the Shroud upside down, I’m not surprised that you also see coins inscriptions over the eyes ! ;-)\nIt reminds me of Whanger who claim that he could even saw the crown of thorns (or even 2 crowns if I remember correctly) on the Shroud !!!\nMaybe I’m dumb but the only thing I can see on the Shroud is the image of a DEAD man who laid down naked in this cloth and who was beaten, scourged and crucified exactly like the gospel accounts told us about Jesus of Nazareth.  \nA nude dead man.  Nothing else.  Maybe I’m dumb or really blind ! ;-)\n\n","date":"December 6, 2011 at 11:44 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5271","author":"Yannick Clément","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"I wish You could see with other eyes than just yours. It would help you to see what others (poets, story-tellers, mystics) in the past have seen . It would even help you to understand the apocalyptic visions in John’s Revelation. Don’t you forget the Turin Shroud used to work (and actually still works) first and foremost on man’s imagination as an out-of-size Rorschach. When it comes to Progess in Science, “Imagination is more important than knowledge” (Albert Einstein). Ignorance is a lack of imagination.\n\n","date":"December 6, 2011 at 1:41 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5272","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"Whan it comes to theTuriShroud, I still can discriminate between a falsely positive and a falsely negative pareidolia. Can you Yannick?\n\n","date":"December 6, 2011 at 1:44 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5273","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"Don’t you mistake the vision of the Grail Chalice of Blood with a real object, PLEASE!\n\n","date":"December 6, 2011 at 1:47 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5274","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"Can’t you see,, in the very vertical axis of the Shroud Man face, the shape of a chalice made of his blood? Is your imaginative faculty out of order?\n\n","date":"December 6, 2011 at 1:51 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5275","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"I eanthe Shroud Man face seen upside down…\n\n","date":"December 6, 2011 at 1:52 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5276","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"I mean the Shroud Man face seen upside down…\n\n","date":"December 6, 2011 at 1:52 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5277","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"I must be too much rationalist.  And I like it that way ! ;-)\n\n","date":"December 6, 2011 at 1:57 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5278","author":"Yannick Clément","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"In English, the word “Grail” is techniquely meaninglful in old French as “woven wire”. It does refer to one of the Shroud reliquaries (the one used in both Edessa and Constantinopoli).\n\n","date":"December 6, 2011 at 2:22 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5279","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"Yannick, if you cherish your lack of imagination, it’s up to you but you’re definitley not a true Scientist as Albert (Einstein) was. With you Yannick, there woud be no possible Relativity and you would have had Albert sent to the nuts’ house…\n\n","date":"December 6, 2011 at 2:37 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5281","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"Cold Reason as an Absolute God ruling over one’s life, what a nightmare!\n\n","date":"December 6, 2011 at 2:39 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5282","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"Reason without Imagination is just Madness!\n\n","date":"December 6, 2011 at 2:42 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5283","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"Are you afraid of your own agination, Yannck?\n\n","date":"December 6, 2011 at 2:46 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5284","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"What about poetry in Science? Ever heard of Hubert Reeves?\n\n","date":"December 6, 2011 at 2:51 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5285","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"Actually Yannick, you just think yourself a rationalist which you are NOT!\n\n","date":"December 6, 2011 at 3:01 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5286","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"In his blog Donald, a Christian Jew, writes: “If I had the cloth in my hands I’d burn it to the ground just to help them return to sanity and the sanctuary of the true God, Why anyone would venerate any object that had anything to do with the murder of Jesus is beyond me, it is the same as venerating a piece of the cross of maybe even the spear that pierced him .. all objects involved in his murder”.\nThe Turin Shroud is, FIRST & FOREMOST, a “non-written” or fifth Gospel for many Christians all through the world. Donald, would you burn the 4 Gospels too just because they are  “shed innocent blood relations”?\n\n","date":"December 7, 2011 at 7:56 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5298","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor","post":"The first people to preciously keep the Shroud of Rabbi Yeshua were… Christian Jews…\n\n","date":"December 7, 2011 at 8:06 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","id":"comment-5299","author":"Max Patrick Hamon","site":"shroudstory"}]
