[{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Complete failure, Collin!","date":"November 15, 2013 at 6:59 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51415","author":"O.K.","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"No you’ve lost me, OK. How is Colin’s image a failure, precisely?\n\n","date":"November 15, 2013 at 7:24 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51419","author":"Hugh Farey","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Who has eyes, let he look.\nFirst look on his left image, which Colin himself admits it is too hot, too dark. and definetly not smooth and continuous. \nNext look on second, “superficial” image. Is it Jesus, or Superman while flying, with his cape?\n\n","date":"November 15, 2013 at 7:29 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51420","author":"O.K.","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Correction: 90% failure. But some might think there’s a lot more scope for that stubbornly non-complying 10% to grow at the expense of the 90% than vice versa…;-)\n\n","date":"November 17, 2013 at 2:42 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51691","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"It’s not immediately obvious to this amateur pyrographist how one makes a scientifically rigorous comparison between the embedded 3D information in two images that are centuries apart in age. But one has to try, so this is what I did. \nFirst I took my optimized ImageJ settings from the crucifix above and applied them the Durante2002 dorsal image on Shroudscope. There was some 3D enhancement  of the Shroud image, as expected, but of rather inferior quality. So I decided to do it the other way round – to optimize on the Shroud image and then apply those settings to the crucifix scorch. The result came as a pleasant surprise – the 3D enhanced images were virtually identical to the ones displayed above. In other words, there’s no reason for thinking that the characteristics of the model scorch are qualitatively different from those of the Shroud.\nThe next thing to do will be to repeat the exercise on the frontal images of both Shroud and crucifix, which will be a lot more demanding an exercise, given the high relief on the brass which will make it virtually impossible to capture all the detail. But then I’ve always maintained that if the Shroud image were a contact scorch from a metal or ceramic template it would need to have shallow contours, i.e. bas relief, and it’s maybe worth remembering that Luigi Garlaschelli was forced to resort to bas relief in his frottage (powder rubbing)  procedure, finding the face/head too difficult to imprint off his live volunteer.\n\n","date":"November 15, 2013 at 7:59 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51423","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"We’ve been through all this before haven’t we? Didn’t Thibault show that a contact scorch like this just doesn’t have the same microscopic properties as the Shroud.\nAs for the 3D, it looks to me like the crease in the fabric resulting from the heat has given rise to much of the 3D you can see there. Also, there’s far more of the image missing compared to the Shroud. I’d also like to see how superficial those feet scorches are. Do you have any microscopic images Colin?\nHugh, am I right in recalling you dismissed the scorch theory not long back. If so, does this experiment convince you otherwise?\n\n","date":"November 15, 2013 at 8:02 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51424","author":"ChrisB","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Hi Chris. I have been excoriated here once or twice for taking what seems a good coherent and rational experiment, and denying the unassailability of its conclusions by pointing out a contrary detail that negates them. The irritating 610nm spike on the reflectance spectrum of the blood, for instance, simply cannot be swept aside as irrelevant, however compelling the vast majority of blood identification tests have been.\nSomething similar is true of the scorch hypothesis. In spite of OK’s protestations that Colin’s images are not identical to the shroud, a simple scorch demonstrates almost all the characteristics required of the shroud image. It’s 3D quality and “negative” affect are extremely similar, and there is no pigmentation other than degraded flax fibres. The STURP team regularly described the image as resembling a scorch. Which it does. Nevertheless, there are two inconvenient details which contra-indicate, and until they are resolved, the scorch hypothesis cannot be said to have been confirmed.\nFirstly, the shroud image does not penetrate the cloth. If I want to achieve this, I have to brush a very hot spatula very quickly over the surface of cloth. I have not managed to achieve it using a bas relief. Some interesting experiments have been carried out using different materials (china and brass), different substrates (cloth, wood and snow) different temperatures and different contact times, but every time, if I can see the image on one side, I can also see it on the other.\nThe other problem is UV fluorescence. The whole of the shroud fluoresces slightly, but the image appears dark. Although this is easy to achieve if the scorch is dark enough to be described as “brown” it appears that most photographs of the shroud are deceptive, and that the image is best described as “yellow”. If however, I produce a yellow scorch (usually by reducing the temperature of the bas relief), then I find it fluoresces brightly.\nAs I hope anyone who has read this far will see, I am as willing to recognise discrepancies with non-authenticity image-formation claims as I am for pro-authenticity claims.\n\n","date":"November 15, 2013 at 9:47 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51445","author":"Hugh Farey","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Cloth pressure followed by slight pressure release is the key to account for the Turin Shroud volumetric encoding NOT scorch per se.\n\n","date":"November 15, 2013 at 8:32 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51427","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Typo: slight and GRADUAL pressure release\n\n","date":"November 15, 2013 at 9:18 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51438","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Methinks we’ll have to wait for ages before Mr CB could be able to touch up his alleged replica with blood and fool a medical examiner worth his salt…\n\n","date":"November 15, 2013 at 8:37 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51428","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Scientifically speaking, can Mr CB tell us how he can discriminate between a barbecued (Jacques-de-Molay-like) Knight Templar and a barbecued Christ?\n\n","date":"November 15, 2013 at 8:50 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51429","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Mr CB alleged replica is just to impress the gullible (see Dan’s “I’m impressed”; the word “seduced” would fit better here).\n\n","date":"November 15, 2013 at 8:55 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51430","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Dan, will you have a glass of “red English wine” with your wife to-night and bring the dream to life?\n\n","date":"November 15, 2013 at 9:01 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51431","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"So does this experiment leave us with this rather interesting conclusion: the Shroud image was created by a scorch? What then is the source of the scorching – what types of heat can produce this scorch? Which ones can be eliminated – for example, could electricity running through a corpse produce such a scorch?\nJust trying to summarize for myself what we can take away from this experiment.\n\n","date":"November 15, 2013 at 9:09 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51433","author":"David Goulet","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"This is the roll the Holy Shroud plays in my belief that our purpose in life is to serve God in this world to be with Him in the next:\n1) Jewish Prophet\nJesus was a Jewish prophet who had a band of intimate followers. After being crucified, his followers disbanded in fear and disappointment. Soon after, they renewed their fellowship and began to preach that Jesus is alive in a new life with God. His followers swore up and down that Jesus appeared to them after he died. His followers went on to found the Catholic Church, which gave us Western civilization. When the Church lost its influence in the 18th century, the horrors of the 19th and 20th century followed.\n2) Proof of God’s Existence\nJewish people are unique because the Hebrew Bible was the first book of narrative history. Also, they gave God the name “Yahweh,” which can be translated “I am who am.” This name was explained in the 13th century by Thomas Aquinas and is consistent with the cosmological argument for God’s existence. Most non-believers  don’t understand the cosmological argument. They think, for example, that human beings are collections of molecules, rather than embodied spirits. They disingenuously ask, “Who made God”?\n3) Shroud of Turin\nAccording to the gospels, Jesus was buried in a separate tomb with a linen burial cloth. Also, the Resurrection occurred three days after the crucifixion and produced an empty tomb. The gospels also say that Jesus was beaten, made to wear a “crown of thorns,” and stabbed in the side while on the cross. The Shroud of Turin, which is currently owned by the Catholic Church, tells the same story with a mysterious life-size image of a crucifixion victim on the 14 foot long piece of cloth. Many non-believers admit that a crucified victim was used to create the image, but there is no explanation of how the image was created.\n4) The Big Bang\nThere are many other relevant historical facts. For example, in the 1960s it was determined that the universe began to exist 13.7 billion years ago. This is another sign that the Bible was inspired by God because the Bible says God created the universe from nothing.\n\n","date":"November 15, 2013 at 9:17 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51437","author":"David Roemer","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Interesting image that can look a bit like the Shroud, BUT…  WHERE ARE THE BLOOD AND SERUM STAINS???????????\nIf someone pretend to replicate the Shroud, he MUST replicate not only the body image but the blood and serum stains and I really don’t know how Colin will manage to do that. ;-)\nI’ll say it again and again:  The evidence coming from the blood and serum stains alone is enough to reject any form of man made forgery concerning the Shroud image, including the use of a scorch technique. PERIOD.\n\n","date":"November 15, 2013 at 9:33 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51440","author":"Anonymous","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Ah! See my reply to Chris above….\n\n","date":"November 15, 2013 at 9:48 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51446","author":"Hugh Farey","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"I see it and was disappointed that you still put the “bizarre spectal properties” of the bloodstains again on the table to try to deny the fact that there is real bloodstains on the Shroud.  This is like using only the C14 result to dismiss the Shroud’s authenticity while forgetting all the others data that all point in favor of authenticity.  The blood on the Shroud is blood BUT IT IS NO ORDINARY BLOOD!  When are you going to understand this?  It is exudates of highly traumatized blood clots that include a high level of bilirubin, which not only have influenced the visible color of the stains (redder than normal aged blood) but most probably also the spectral properties of it.  And think about that: because of the fact that the Shroud’s blood is no ordinary blood, if the spectral properties of the Shroud’s bloodstains would end up being normal, that’s when we would have some reasons to be doubtful!  But since the spectral properties as well as the visible color of the blood and as well as the chemistry of the blood are all extraordinary versus the idea of a normal blood that would have stained the cloth in liquid form, I don’t see any problem at all with the fact that the spectral properties of the blood on the Shroud seem to be abnormal.  Not at all and I think you should feel the same.\n\n","date":"November 15, 2013 at 11:54 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51467","author":"Anonymous","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"I quite understand your thinking that a mysterious spike in the reflectance spectrum of the shroud blood ought to be dismissed out of hand, and also the radiocarbon dating. Lots of people do. But please don’t ask me to do the same. You see, I’m one of those “true scientists” you keep going on about, and unlike those who feel that science’s job is to add a veneer of logic to blind faith, “true scientists”, such as St Augustine of Hippo, St Thomas Aquinas and the late Pope Benedict XVI, believe that the truth is revealed by reason, not the other way round.\nIf you have any explanation at all for the 610nm spike, I should be very grateful to hear it. If not, then it must remain a problem you must solve if you wish to claim that the stains are irrefutably blood.\n\n","date":"November 15, 2013 at 1:07 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51479","author":"Hugh Farey","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Ho I forget one important point :  If Colin is crazy enough to think he can replicate the blood and serum stains that are on the Shroud in a so perfect manner that he could fool every medical and forensic experts, I remember him that first, he must create a new image because we know for a FACT that the blood and serum stains were on the cloth BEFORE the formation of the image. \nIf someone (Colin or anyone else) pretend to be serious about repoducing the Shroud, he TAKE INTO ACCOUNT  EVERY DATA coming from the Shroud and replicate all of those PERFECTLY.  Or else, I’m sorry to disappoint you but you cannot pretend to any kind of success and surely, you cannot use words like « replicate » or « reproduction » or something of the same nature because your work is not.\n\n","date":"November 15, 2013 at 9:40 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51443","author":"Anonymous","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Is that you Yannick?\n\n","date":"November 15, 2013 at 10:28 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51449","author":"ChrisB","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"No it is the Phantom of Yannick! ;-)\n\n","date":"November 15, 2013 at 11:46 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51463","author":"Anonymous","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"“We know for a FACT…” Wrong. You personally might know for a fact (or FACT), but others of us are less dogmatic. Remember the 610nm spike. We cannot claim that the blood is irrefutable, any more than we can claim the scorch is irrefutable, until that awkward little niggle has been explained. You must, to use the wise words of… yourself, in the post above, TAKE INTO ACCOUNT EVERY DATA. That includes the anomalistic blood spectrum  just as much as it includes the fluorescent scorch.\n\n","date":"November 15, 2013 at 11:47 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51464","author":"Hugh Farey","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Colin, Ian Wilson did mention “scorch”, or more precisely, a scorch-like image, in his first (1978) book on the Shroud, however in his last book “The Shroud. The 2000-year-old mystery solved” he brought the topic up to date with the experiments made by Allen,Garlaschelli and so on. All, repeat, all,  the data contained in the relic should be addressed before a really convincing theory on how the image may have been produced can be proposed.\n\n","date":"November 15, 2013 at 10:28 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51450","author":"Louis","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nLouis :All, repeat, all, the data contained in the relic should be addressed before a really convincing theory on how the image may have been produced can be proposed.\nWe don’t see that in pro-authenticity image theories. A UV laser induced coloration of flax but with no other image characteristics whatsoever gets worldwide headlines.  Corona Discharge leaves much to be desired. The Maillard Reaction/Diffusion-of-Something proposals don’t work so far and maybe never will. And despite Antonacci’s claims that his Historically Consistent Method fits the bill, it doesn’t. What has Colin done differently?  Every pro-authenticity and every skeptical proposal has come up short. In the final analysis, I quite sure, Colin’s scorch theory will too.\n\n","date":"November 15, 2013 at 11:07 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51454","author":"Dan","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Back to basic.\nWhat were the conclusions of the STURP, notably which mechanism had been excluded ?\nWhy did Ray Rogers re-consider his position concerning a diffusion mechanism ?\nWhy did Ray Rogers, a leading expert in thermal analyst, exclude a scorch hypothesis ?\nThe answers are still valid.\n\n","date":"November 15, 2013 at 11:24 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51461","author":"anoxie","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Agreed, Dan. That is roughly also what IW says in his book, which has a very balanced approach and is therefore on right track. It is fair to consider what Colin is proposing, but does he have to be told that in attacking the pro-authenticity camp his artillery should be heavier if something convincing is to be demonstrated?\n\n","date":"November 15, 2013 at 11:39 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51462","author":"Louis","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Remind us, anoxie, why did Rogers exclude the scorch hypothesis?\n\n","date":"November 15, 2013 at 11:50 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51466","author":"Hugh Farey","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Of course he did!  Read this paper please: http://holyshroudguild.org/uploads/2/7/1/7/2717873/2013-01-10-yannick-clment-reflections-on-ray-rogers-shroud-work.pdf\nUse the “research engine” with the word “scorch” and you see a ton of quotes in Rogers’ writing where he completely put aside this particular hypothesis.\nAnd remember that he check this very close because, at first, he thought that the Shroud image could well have been created that way.  But after a long analysis of all the pertinent data, he came to the conclusion that we must definately reject this hypothesis.  Note that he don’t even used the “bloodstains” argument like I do to dismiss this particular hypothesis, which is very telling…\n\n","date":"November 15, 2013 at 12:26 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51470","author":"Anonymous","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Complement:  very telling that the Shroud image is certainly not the product of a scorch.  (that’s what I meant)\n\n","date":"November 15, 2013 at 12:28 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51471","author":"Anonymous","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Some folk here seem to be labouring under the misapprehension that I set out one Thursday afternoon to provide a complete solution to the Shroud enigma, with all loose ends neatly tied up. In fact the experiment was prompted by this comment from David Goulet:\n“If anyone is doing another heated statue experiment, I’d be interested in seeing the result when using a statue with a minimum of three levels of contact – approximating the three levels of the body in the Shroud (top hand, bottom hand, lower trunk). Spatulas and coins are a good start but an object with more detailed 3D would be very helpful.”\nThat’s when I remembered having bought a brass crucifix a year ago, with some challenging in-the-round 3D that I had not got round to testing thinking it would be a “difficult” subject. It wasn’t actually, though I found I needed to use lots of backing cloth and a club hammer to press down into those accommodating and yielding layers.\nI’m sorry the dorsal image could be mistaken for Superman, but when you come to think of it …oh, never mind… \nThose with simplistic ideas about blood/image relationships might do well to ponder on the implications of Alan Adler’s claim for some bloodstains being out of stereoregister with body image (thus blood rivulets on “hair” for example) and if thinking his orthogonally-projected radiation is nonsensical, then what price the alternative of orthogonally- projected ammonia molecules needed in a more ‘naturalistic’ Rogers’ scenario? I personally dismiss both radiation and ammonia, but that leaves a lot of other possibilities open to experimentation and hypothesis-testing, shrugging off the dogmatists who say I’m wasting my time. It’s my time to waste – not theirs.\nThe first essential in attempting to understand the Shroud image is to begin by shelving or dumping a lot of the comfortable mantras and dogmas, taking stock of the “hard” evidence, of which there is not a great deal, whether in relation to image or that peculiar “blood”.\n\n","date":"November 15, 2013 at 11:10 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51457","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"I feel what the crucifix scorch experiment showed, as Hugh pointed out as well, is that you can replicate some of the more interesting/unique properties of the Shroud – i.e. the 3D properties, the photo-negative. This neither proves nor disproves authenticity. What it does prove is that what we have long be told are  properties ‘unique to the Shroud’  are not necessarily so. No one had bothered to question these assumptions until Colin’s simple experiments with some modern tools we all now have access too. Hats off to him for taking that intiative. Don’t shoot the messenger.\n\n","date":"November 15, 2013 at 12:36 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51473","author":"David Goulet","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Regarding the uniqueness of the Shroud, you must look at the whole picture David, which include the blood and serum stains (most of them coming from exudates of highly traumatized blood).  It’s only when you consider the presence of the Shroud body image AND the blood and serum stains together on one single piece of cloth that was certainly used at one point in its history to covered the dead body of a crucified man that it’s alright to say that the Shroud is unique in the world…  Always keep in mind this advice:  Always remember the whole picture given by all the data when you analyze one specific property of the Shroud…  It’s very important to do so.\n\n","date":"November 15, 2013 at 12:48 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51476","author":"Anonymous","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Important additional note :  IT’S NOT BECAUSE THE SHROUD IS UNIQUE IN THE WORLD THAT THIS RELIC CAN BE USED TO BACK-UP THE IDEA THAT IT MUST BE DIRECTLY RELATED WITH JESUS RESURRECTION!\n\n","date":"November 15, 2013 at 12:59 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51477","author":"Anonymous","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nAnonymous :Regarding the uniqueness of the Shroud, you must look at the whole picture David, which include the blood and serum stains (most of them coming from exudates of highly traumatized blood). It’s only when you consider the presence of the Shroud body image AND the blood and serum stains together on one single piece of cloth that was certainly used at one point in its history to covered the dead body of a crucified man that it’s alright to say that the Shroud is unique in the world… Always keep in mind this advice: Always remember the whole picture given by all the data when you analyze one specific property of the Shroud… It’s very important to do so.\nI agree Phantom. I am not convinced of the scorch forgery theory because of the overall picture. But some sites, not this one, do claim that the Shroud must be authentic because of the 3D properties or the photo negative image. They claim there’s no other such example in the world. Well that was true because no one had tried (and the technology was not previously accessible to the average person). It’s not quite true now.\nI also agree that can not be used as a proof of Resurrection. The Shroud, to me, has always been a sign. Signs are not proofs.\n\n","date":"November 15, 2013 at 1:09 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51480","author":"David Goulet","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nHugh Farey :You see, I’m one of those “true scientists” you keep going on about, and unlike those who feel that science’s job is to add a veneer of logic to blind faith, “true scientists”, such as St Augustine of Hippo, St Thomas Aquinas and the late Pope Benedict XVI, believe that the truth is revealed by reason, not the other way round.\nPope Emeritus Benedict is still alive, isn’t he?\n\n","date":"November 15, 2013 at 1:16 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51483","author":"David Goulet","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Ah! Silly me. I meant he was lately Pope, not that he was lately alive. My apologies to His Holiness…\n\n","date":"November 15, 2013 at 1:22 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51484","author":"Hugh Farey","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Science, faith, reason,logic, truth… There is a good book to read, “Return to the Centre”, by Dom Bede Griffiths, whom the late English Cardinal George Basil Hume called “one of the greatest mystics of our time”.\nhttp://www.bedegriffiths.com/articles/2009/9/19/return-to-the-center.html\nNo one need agree 100% with what he wrote, in fact I myself publicly differed with him in Letters to the Editor published in a weekly, yet he did raise some excellent points about the quest for God and the limitations in many of the quests.\n\n","date":"November 15, 2013 at 2:14 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51490","author":"Louis","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nHugh Farey :\n“We know for a FACT…” Wrong. You personally might know for a fact (or FACT), but others of us are less dogmatic. Remember the 610nm spike. We cannot claim that the blood is irrefutable, any more than we can claim the scorch is irrefutable, until that awkward little niggle has been explained. You must, to use the wise words of… yourself, in the post above, TAKE INTO ACCOUNT EVERY DATA. That includes the anomalistic blood spectrum  just as much as it includes the fluorescent scorch.\n\n610 nm spike noted, what is your take on the immunological evidence-tip the scale towards the possibility that it’s blood?\n\n","date":"November 15, 2013 at 1:35 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51485","author":"Kelly Kearse","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"To be honest I think we’ve got a mixture of all sorts of things, one of which may well be blood. I don’t know enough about the immunological evidence to assess its significance, and look forward to the publication on shroud.com of Baima Bollone’s article in Shroud Spectrum 13. I will specifically want to know where he got his blood from, and what controls he carried out on non-blood. It may well turn out that his findings are (scientifically at least) uncontentious, and that we can consider the typing as confirmed.\n\n","date":"November 15, 2013 at 2:00 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51486","author":"Hugh Farey","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"I want to say to Hugh and anyone else that the most compelling evidence that the blood on the Shroud is real blood is the simple fact that almost every medical and forensic expert who have analyzed the Shroud closely have all conclude that it is blood (especially while taking into account the presence of serum around most stains) and that the blood flows are perfectly consistent with someone who died in the vertical position of crucifixion and who was transferred to a tomb and laid in the Shroud in an horizontal position.  To me, all this speak truth much louder than anything else.  No forger could have succeed to artifically formed those bloodstains…  These could not have come from anything else than a real crucified corpse.\n\n","date":"November 15, 2013 at 2:01 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51487","author":"Anonymous","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"That’s fine, Anonymous; your convictions do you credit. In detail (sorry), almost nothing you adduce is at all convincing to me.\nAll the medical experts, from Barbet to Zugibe, were not working with actual shroud samples, and could not carry out chemical tests on the blood. The more modern ones were working with photographs. The serum stains which some people claim surround every injury are simply not there. the blood flow from the wrist could not have occurred as the wrist was jammed against the cross, nor have emerged later as the blood had drained from the hand.\nTo you, all this speaks truth. To me, it speaks uncertainty.\n\n","date":"November 15, 2013 at 2:14 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51491","author":"Hugh Farey","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Your disbelief of what is as obvious as the nose in anyone’s face is discouraging Hugh and I don’t have any more time to lose trying to show you all the solid data that PROVE (yes, prove) the blood is blood.\nAnd I really don’t know how you can deny the FACT that there are serum stains around most stains.  This FACT was first described by Barbet and it has been confirmed by Miller and Pellicori UV analyses.\n\n","date":"November 15, 2013 at 4:27 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51503","author":"Anonymous","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Serum stains: their presence has also been scientifically confirmed by Adler’s chemical analyses.  I don’t know why you still want to deny obvious facts like that, which are the most solid and compelling evidences that the Shroud is a real burial cloth of a real crucified man.\n\n","date":"November 15, 2013 at 4:28 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51504","author":"Anonymous","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Now we are back to the scorch hypothesis?  Does anything ever die? I think Thibault Heimburger did a good job dealing with this issue.    https://shroudofturin.files.wordpress.com/2012/10/scorch-paper-en.pdf\n\n","date":"November 15, 2013 at 2:06 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51489","author":"Russ Breault","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Yes, but we are told that a modern day contact scorch does not match the microscopic appearance of Shroud fibres, yet so far I have yet to see a true photomicrograph of Shroud fibres (the x35 or x50 photos in those Mark Evans photographs only allow one to see the  threads in reasonable detail, but not the individual fibres in close-up. Indeed, in the paper you cite, we are really told very little about the microscopic character of the individual image fibres of the Shroud except that they are uniformly  pale yellow, with no burnt bits, and those yellow fibres can be adjacent to non-yellowed (the well-known half-tone effect)\nBut there is the crucial observation that scorched fibres are brittle, and putting that together with the evidence from Fanti et al elsewhere that Shroud image fibres fracture more easily than non-image fibres, there is an alternative explanation for the uniformly yellow fibres and the so-called half-tone effect, namely that we are now seeing only those very lightly scorched fibres (regardless of scorching mechanism) that have survived to this day without breaking and falling off. One can hardly expect the modern day experimentalist to reproduce image-forming mechanisms AND  the effect of centuries of ageing and disintegration.\nWhat’s needed, as I’ve said on numerous previous occasions, are high magnification, high HD photomicrographs, especially those from scanning electron microscopy, ones that allow us to see the surface of individual Shroud image fibres in close-up, as well as those that carry “blood” or whatever that red stuff is on the Shroud described improbably as a narrative-friendly  “serum exudate of contracted blood clots” (one marvels they still look so red).  We really can’t have this term “microscopic properties” routinely deployed as a debating point when all we have are views that are scarcely better, if at all,  than those one could get simply by looking through a hand lens.\n\n","date":"November 15, 2013 at 2:35 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51492","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Colin,\nI will post some of the 32 ME photographs the next week-end (including clear cloth, image, scorch, blood etc.).\nNow it seems you want to see individual fibers of the TS image in close-up.\nThere is the high-resolution contrast phase picture\nprovided by Rogers, (Dan, can you show it again ?). The best one.\nThere are also the pictures from Fanti in our paper about superficiality… \n”  Indeed, in the paper you cite [My paper], we are really told very little about the microscopic character of the individual image fibres of the Shroud except that they are uniformly pale yellow, with no burnt bits, and those yellow fibres can be adjacent to non-yellowed (the well-known half-tone effect)”\nThe half-tone effect has nothing to do with the observed fact that “yellow fibers” can be adjacent to non-yellowed fibers.\nThe half-tone effects actually means that the color density of a given image area depends only on the numbers of yellowed fibers in a given image area and does not depend on the color of the individual fibers. All the image fibers have the same yellowish color (+/- 10%).\n“But there is the crucial observation that scorched fibres are brittle, and putting that together with the evidence from Fanti et al elsewhere that Shroud image fibres fracture more easily than non-image fibres, there is an alternative explanation for the uniformly yellow fibres and the so-called half-tone effect, namely that we are now seeing only those very lightly scorched fibres (regardless of scorching mechanism) that have survived to this day without breaking and falling off. One can hardly expect the modern day experimentalist to reproduce image-forming mechanisms AND the effect of centuries of ageing and disintegration.”\nThat’s true. We have to think about the result of ageing and disintegration.\nI don’t think that ageing and disintegration can explain the TS image properties.\nWe have to work.\nBut if you write: ” One can hardly expect the modern day experimentalist to reproduce image-forming mechanisms AND the effect of centuries of ageing and disintegration.”\nthen you close the door.\n\n","date":"November 15, 2013 at 7:27 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51525","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"I admire the persistence and ingenuity that went into this experiment, which is very convincing of…something.  Surely a medieval forger, had he existed, would have used a similar approach to develop his technique.  I can hear his patron (Geoffrey de Charney?) now: “You need HOW much more linen?  What happened to the six bolts I paid for last month? Do you know how much this stuff COSTS?” \nExcept, you know…in French.\n\n","date":"November 15, 2013 at 2:37 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51493","author":"Jeffrey Liss","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nHugh Farey :\nThat’s fine, Anonymous; your convictions do you credit. In detail (sorry), almost nothing you adduce is at all convincing to me.\nAll the medical experts, from Barbet to Zugibe, were not working with actual shroud samples, and could not carry out chemical tests on the blood…the blood flow from the wrist could not have occurred as the wrist was jammed against the cross, nor have emerged later as the blood had drained from the hand.\nTo you, all this speaks truth. To me, it speaks uncertainty.\n\nNot medically trained myself, nor have I ever seen a nail driven through someone’s wrist into a cross in person, but the “wrist jammed against the cross” preventing some blood flow.  Is this an absolute?  As a crucifixion victim struggles to breathe and pushes upward, could there not be some degree of movement/stress at the area? Is a given that a roman soldier would pound until he acheived an undisturbable vaccum seal? Zugibe did use Shroud photographs in his studies, true, but he also had significant first hand experience with wounds.  If so implausible, wouldn’t this have raised suspicion in his eyes at the get go?  I am fine with uncertainty, just asking.\nps any thoughts as to what 610 might be?\n\n","date":"November 15, 2013 at 2:45 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51495","author":"Kelly Kearse","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Myrrh and aloe? I’ve read that Baima-Bollone used some threads with blood mixed with spices for spectroscopic comparisons.\n\n","date":"November 15, 2013 at 2:56 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51496","author":"O.K.","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"For a number of live crucifixions, look up “Philippines crucifixion” on youtube. Observe the almost complete lack of bleeding.\nYes, I’m sure there could be leeway between the back of the wrist and the cross, but I don’t think there would be no smudging at all. An undisturbable vacuum seal is, in my opinion, improbable.\nZugibe did indeed notice that the blood flow on the back of the hand was implausible. He thought there would be a mass of blood all over the back of the hand, that the hand was then washed, and that the blood flow was subsequent to that. He illustrates his point with a photo of a tiny dribble emerging from a dead arm. He denies that the shape of the flow had anything to do with the angle of the arm on the cross. I do not find his little dribble convincing.\nAs to 610nm, I’m still searching. No blood derivative produces it, nor any pigment I can find. It was, however measured from blood at four different sites around the shroud, and therefore not a one-off experimental glitch.\n\n","date":"November 15, 2013 at 7:11 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51520","author":"Hugh Farey","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nO.K. :\nMyrrh and aloe? I’ve read that Baima-Bollone used some threads with blood mixed with spices for spectroscopic comparisons.\n\nBB reported the presence of myrrh & aloe using immunological methods; Rogers looked for their chemical signature and reported their absence.\n\n","date":"November 15, 2013 at 4:05 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51500","author":"Kelly Kearse","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"But BB had whole threads at his disposal, while Rogers had only fibers form the sticky tapes.\n\n","date":"November 15, 2013 at 4:12 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51501","author":"O.K.","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nO.K. :\nBut BB had whole threads at his disposal, while Rogers had only fibers form the sticky tapes.\n\nSure-different techniques, different materials-these type of things are best sorted out splitting the (same) sample & sorting them out side by side.\n\n","date":"November 15, 2013 at 4:20 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51502","author":"Kelly Kearse","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"I would say this is a pretty good job of falsifying the shroud. He produced the negative image and the 3D effect. The blood is not that hard to duplicate. If these properties have been duplicated then it’s no longer “miraculous”. I wonder if this shuts down Isabel Piczek’s claim of a event horizin taking place.\n\n","date":"November 15, 2013 at 5:24 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51509","author":"Anonymous2","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nHugh Farey :\nRemind us, anoxie, why did Rogers exclude the scorch hypothesis?\n\nThere are several reasons.\nBut, one of the most important can be found in his book:\n“”A chemist’s perspective…”\nP.32,\nFig.VI-1: “A LIGHTLY scorched fiber. The medulla shows DARKER coloration than the rest of the fiber”\nFig VI-2: An UNUSUALLY DEEPLY colored image fiber: the medulla is completely colorless”\nLook, at the pictures.\n\n","date":"November 15, 2013 at 5:57 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51514","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Revisiting my own photos of scorched fibres, I do not find that the lumen (why does Rogers consistently call it the medulla I wonder?) is always darkened. Even in his own micrograph, presumably chosen carefully to illustrate his point, there is hardly any darkening of the lumen visible. Had the fragment that does appear darkened been photographed at X200 (like the image fibre next to it) it may not have shown any dark middle at all. This is not an important reason to exclude the scorch hypothesis. The fluorescence thing, I think, is the true cruncher.\n\n","date":"November 15, 2013 at 7:30 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51527","author":"Hugh Farey","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nThibault HEIMBURGER :\nColin,\nI will post some of the 32 ME photographs the next week-end (including clear cloth, image, scorch, blood etc.).\nNow it seems you want to see individual fibers of the TS image in close-up.\nThere is the high-resolution contrast phase picture\nprovided by Rogers, (Dan, can you show it again ?). The best one.\nThere are also the pictures from Fanti in our paper about superficiality…\n”  Indeed, in the paper you cite [My paper], we are really told very little about the microscopic character of the individual image fibres of the Shroud except that they are uniformly pale yellow, with no burnt bits, and those yellow fibres can be adjacent to non-yellowed (the well-known half-tone effect)”\nThe half-tone effect has nothing to do with the observed fact that “yellow fibers” can be adjacent to non-yellowed fibers.\nThe half-tone effects actually means that the color density of a given image area depends only on the numbers of yellowed fibers in a given image area and does not depend on the color of the individual fibers. All the image fibers have the same yellowish color (+/- 10%).\n“But there is the crucial observation that scorched fibres are brittle, and putting that together with the evidence from Fanti et al elsewhere that Shroud image fibres fracture more easily than non-image fibres, there is an alternative explanation for the uniformly yellow fibres and the so-called half-tone effect, namely that we are now seeing only those very lightly scorched fibres (regardless of scorching mechanism) that have survived to this day without breaking and falling off. One can hardly expect the modern day experimentalist to reproduce image-forming mechanisms AND the effect of centuries of ageing and disintegration.”\nThat’s true. We have to think about the result of ageing and disintegration.\nI don’t think that ageing and disintegration can explain the TS image properties.\nWe have to work.\nBut if you write: ” One can hardly expect the modern day experimentalist to reproduce image-forming mechanisms AND the effect of centuries of ageing and disintegration.”\nthen you close the door.\n\nThank you for the response. First reaction – I don’t see any discrepancy between my shorthand description of the half-tone effect and yours, and I certainly don’t dispute anything in your version. We are both agreed that imaging at the fibre level operates on an all-or-nothing basis, with no intermediate degrees of coloration at the fibre level, so that degrees of coloration at the thread or fabric level are due entirely to differences in ratio of coloured to uncoloured fibres, It’s analogous to a digital as distinct from analogue audio recording.\n\n","date":"November 15, 2013 at 7:38 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51529","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nHugh Farey :\nFor a number of live crucifixions, look up “Philippines crucifixion” on youtube. Observe the almost complete lack of bleeding.\nYes, I’m sure there could be leeway between the back of the wrist and the cross, but I don’t think there would be no smudging at all. An undisturbable vacuum seal is, in my opinion, improbable.\nZugibe did indeed notice that the blood flow on the back of the hand was implausible. He thought there would be a mass of blood all over the back of the hand, that the hand was then washed, and that the blood flow was subsequent to that. He illustrates his point with a photo of a tiny dribble emerging from a dead arm. He denies that the shape of the flow had anything to do with the angle of the arm on the cross. I do not find his little dribble convincing.\nAs to 610nm, I’m still searching. No blood derivative produces it, nor any pigment I can find. It was, however measured from blood at four different sites around the shroud, and therefore not a one-off experimental glitch.\n\nI’ve seen the P crucifixion footage in the past, but there are some differences-a lot of those guys take it in the mid-palm & for at least the ones I watched, no one saw it through ’til the end-there’s also the matter of the prior suffering & shock, could this influence bleeding and/or coagulation to some extent?  Would the degree of sweat & dehydration affect blood flow on the skin-granted! those guys are pretty tough! but I  am not so sure it’s the same, somewhat like a reenactment or approximation of a full scale war on the battlefield.\nBTW, what’s your opinion of the accuracy of the side wound and the foot puncture?  The negative of the foot wound enhances the detail present there, difficult to discern with just the light image, at least for me.\nKeep searching for the 610\n\n","date":"November 15, 2013 at 7:48 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51531","author":"Kelly Kearse","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"The ! were unintentional-it’s an iPad thing\n\n","date":"November 15, 2013 at 7:50 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51532","author":"Kelly Kearse","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nAnonymous2 :\nI would say this is a pretty good job of falsifying the shroud. He produced the negative image and the 3D effect. The blood is not that hard to duplicate. If these properties have\nbeen duplicated then it’s no longer “miraculous”. I wonder if this shuts down Isabel Piczek’s claim of a event horizin taking place.\n\nPretty good job I would agree, pretty great job, no-but who’s to say where it goes until the fine details are compared in parallel.  I support this type of pro-active, original experimentation-it’s much more positive & meaningful than attaching personal slurs to the competence of anyone involved in any type of Shroud research, to try to attack the science through the back door. \nThe blood may not be that hard to duplicate, then again it might be-easier said than done though, I’d guess. I don’t believe anyone’s really tackled that one.  Plus, I think it’s much easier in hindsight, working off of detailed positive & negative images-what was the forger looking at?  There’s also the issue of getting the colors to match & persist over time.\n\n","date":"November 15, 2013 at 8:12 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51534","author":"Kelly Kearse","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"I notice that with most of the modern experiments the first scorch attempt is too hot and the image is very dark. I think we underestimate how hot the metal gets. But this darker scorch is actually a better image if your goal is a clear image of a dead Christ. I would think a forger would prefer a darker scorch for this reason. As you note, he isn’t working backwards, trying to match the image to meet some unknown (to him) effects. He’d already be working in a novel medium and a faint scorch would be less impressive than a darker, clear one to his intended audience. But I’m not a medieval artist so what do I know.\n\n","date":"November 15, 2013 at 11:06 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51546","author":"David Goulet","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Quote: “The blood is not that hard to duplicate.”\nLet me laugh at this one!  No one has ever come close to deplicate the blood and serum stains on the Shroud (not even Garlaschelli, Allen or Nickell) and you know why?  Simply because it takes a real tortured corpse (yes, a dead body – because there are both pre and post-mortem bloodstains) to replicate all these blood and serum stains and not only that, it takes a bloody corpse that must be covered with clotted wounds and not with fresh blood that would still be in a liquid state.\nAlso, people always forget that it is a fact that the blood and serum stains were on the cloth before the image.  Consequently, the only possible scenario involving a man made forgery for the image is one that involve a forger who would have artificially created (with a scorch technique or something else) the body images (back and front) with a real bloodstained burial cloth of a real crucified man.  And our hypothetical forger would have been so genius that he would have succeed to create perfect body images (forensically speaking) while being able (we don’t know by what miracle) to not distrurb or damage at all the blood and serum stains on the cloth!  \nThis is so ridiculous as a hypothesis that I don’t understand some people still believe the Shroud can be the product of a man made forgery… The answer to the Shroud image formation must lie in some form of interaction (most probably natural) between the corpse of a real crucified man and the surface of his real burial cloth.  Period.  There’s no other rational possibility than this one and, by the way, that’s one of the main conclusion of STURP’s final report about the Shroud.\n\n","date":"November 16, 2013 at 7:11 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51659","author":"Anomymous","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"“…our hypothetical forger would have been so genius that he would have succeed to create perfect body images (forensically speaking) while being able (we don’t know by what miracle) to not distrurb or damage at all the blood and serum stains on the cloth! …”\nPerfect body images, you say? No body image can be described as “perfect” unless you have the original subject for comparison.\nAs for blood, do you regard the blood trails as perfect too? What about the rivulets in the hair? Since when has blood from scalp wounds flowed down the surface of hair as if on glass?\nDo I sense another reference to miraculous events? I thought your naturalistic theories for image formation did not require miracles. So why do you admit miracles to explain blood but not image?\nAnd if miracles are part of your narrative, if only for blood, what gives you the right to sit in judgement on any scientific hypothesizing on image-formation mechanisms that do not require miracles, especially when you constantly invoke bloodstains which by your reckoning DO involve miracles?\nYour repeated dogma on blood v image is internally inconsistent, self-contradictory and TOTALLY unscientific. Kindly change the record (and try to find one that is not cracked).\n\n","date":"November 16, 2013 at 7:28 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51662","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"In the case of the Shroud, when I use the word “perfect” is in the sense of “looking authentic” or, if you will, “looking real”.  So much in fact that almost every medical or forensic experts were convinced, just like the ENTIRE STURP team, that these images must have been formed by an interaction between the cloth and a real crucified corpse.  And it’s the same thing for the blood and serum stains.\n\n","date":"November 16, 2013 at 8:25 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51667","author":"Anomymous","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Ys, it’s certainly true that the Philippine crucifixions are far from snuff videos, thank goodness, and I rather doubt that there are any good videos of people being crucified to death on the internet, especially ones who have been badly beaten up beforehand. However, we have to start from somewhere. Would a badly beaten up man bleed more or less? Shock, I understand, is typified by very low blood pressure, but may encourage coagulopathy.\nThe side wound. Blood coming out of a cut on a upright person dribbles downwards; it does not zig-zag. If the ‘bloodstains’ coming from the ‘wound’ on the side are real, they must be postmortem, with the body propped up or slumped forwards. So what has happened to all the blood that emerged from the wound while it was still on the cross. Washed off?\nAs for the foot, it seems completely covered, which is what I would expect from an injury at the lower end of the body. This time not washed off, perhaps. It’s all rather inconsistent.\n\n","date":"November 15, 2013 at 8:16 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51535","author":"Hugh Farey","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"“It’s all rather inconsistent.”\nWhat’s also inconsistent is the imaging of wounds as distinct from blood. Some folk claim to see wounds under the blood sites, forgetting that one is not supposed to see a body image of any kind, including lacerations, punctures etc, under a bloodstain (” blood first” dogma). Yet we have all that amazing morphology with the scourge wounds, what with that Fanti /Faccini paper listing the different kinds of scourge marks and their dumbbell lead endings – all said to be blood imaging only. One could be forgiven for thinking they were at least hybrid images – partly body image/partly blood, but no, that’s heretical thinking to imagine that any kind of body image could be under a blood stain assisting with interpretation.\nIncidentally, thank you Hugh for reminding me that there’s another macroscopic criterion for body images that has to be met – namely no reverse-side scorching (though do we have anywhere an obverse side view of what is normally not visible due to that Holland cloth etc?).\nI’ve decided to break with my present technique of pressing down into linen, since that drives hot pyrolysis gases through the interstices of the weave, and may be the reason for the reverse side discoloration. I’ll try sitting the crucifix on a pedestal arrangement, draping fabric over the top, then tamping up and down,comparing dry and moist tampers.One could argue that the latter  drill is more technician-friendly, with less risk of burned fingers, and would arguably be as good if not better at imprinting finer detail. Once can also monitor the scorching, stopping as soon as there are signs of upper (reverse) side scorching.\n\n","date":"November 15, 2013 at 9:55 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51543","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nHugh Farey :\nYs, it’s certainly true that the Philippine crucifixions are far from snuff videos, thank goodness, and I rather doubt that there are any good videos of people being crucified to\ndeath on the internet, especially ones who have been badly beaten up beforehand. However, we have to start from somewhere. Would a badly beaten up man bleed more or less? Shock, I understand, is typified by very low blood pressure, but may encourage coagulopathy.\nStarting from somewhere, of course, but the variables seem many, even when trying to piece together the crucifixion & burial details in of itself.  A\nThe side wound. Blood coming out of a cut on a upright person dribbles downwards; it does not zig-zag. If the ‘bloodstains’ coming from the ‘wound’ on the side are real, they must be postmortem, with the body propped up or slumped forwards. So what has happened to all the blood that emerged from the wound while it was still on the cross. Washed off?\nI would side with postmortem :) perhaps as the body slumped forward, a certain amount dripped off-postmortem, it would not be actively pumping through the circulatory system, so would it be a lot?  \nAs for the foot, it seems completely covered, which is what I would expect from an injury at the lower end of the body. This time not washed off, perhaps. It’s all rather inconsistent.\n\nScourge wounds, convincing?   in comparison, minor wounds on calves, convincing?\nBelt of blood along lower back?\nAnswer as time or interest permits, this is not an interrogation, just interested in your thoughts.\n\n","date":"November 15, 2013 at 8:38 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51536","author":"Kelly Kearse","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Some of my first comments were included in the block quote, mixed among your response-they can be located in the spaces-I’ll get this down one day-I would have made a terrible forger\n\n","date":"November 15, 2013 at 8:40 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51537","author":"Kelly Kearse","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"This is # 62 above, with just my comments:\nStarting from somewhere, of course, but the variables seem many, even when trying to piece together the crucifixion & burial details in of itself.\nI would side with postmortem :) perhaps as the body slumped forward, a certain amount dripped off-postmortem, it would not be actively pumping through the circulatory system, so would it be a lot?  \nScourge wounds, convincing?   in comparison, minor wounds on calves, convincing?\nBelt of blood along lower back?\nAnswer as time or interest permits, this is not an interrogation, just interested in your thoughts.\n\n","date":"November 15, 2013 at 8:44 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51539","author":"Kelly Kearse","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Colin, to get a more gradual 3-D effect you would need a bigger 3-D form.\n\n","date":"November 16, 2013 at 1:02 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51559","author":"Mimus","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"While you may find this hard to believe, Mimus, my own objective is not to reproduce the Shroud image in its entirety – which would simply attract a barrage of criticism that it lacked this or that detail. \nWhat interests me, with a chemical and biochemical background, is the  nature of the image layer at the molecular level – scarcely looked at by STURP – and the likely manner in which it was acquired, especially input energy,  as to make it so superficial.  The frustrating, indeed irritating thing, is to be told that contact scorches (obviously more consistent with forgery – but that’s simply the way the science goes for me) fail to meet microscopic criteria, yet so far I’ve seen or been shown no photomicrographs that tell one what has to be achieved. \nIt’s all words, words, words, and no images, except x50 photos in pdfs with labelled pointers that are vastly bigger than the fibres, leaving one none the wiser as to what they are supposed to show, Thibault Heimburger says he can help out. Let’s hope that is the case. Without HD photographs at the fibre level, it’s simply not possible to make progress with the chemical modelling.The large scale reproduction I leave to others.\n\n","date":"November 16, 2013 at 3:10 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51561","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Colin, I understand that you do not intend to reproduce a large-scale model: that would be way to premature to do so and a complete waste of effort. What I meant is rather that: (1) it is difficult, or even close to impossible, to get a “nice” 3D effect using a small 3D model. The task appears simpler by doubling the size of the 3D model as there will be more vertical height, therefore more gradation from the scorching; (2) do you have some clear 100x or 200x photographs of the linen fibers of your experiments (hopefully taken with a microscope with possibly different lighting conditions)?; (3) don’t you get a gradual amount of dehydration (and potentially of colors) of the fibers depending on the distance from the model to the cloth? \nAnd, by the way, “Anonymous” is clearly Yannick Clement.\n\n","date":"November 16, 2013 at 6:49 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51657","author":"Mimus","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nChrisB :\nWe’ve been through all this before haven’t we? Didn’t Thibault show that a contact scorch like this just doesn’t have the same microscopic properties as the Shroud.\nAs for the 3D, it looks to me like the crease in the fabric resulting from the heat has given rise to much of the 3D you can see there. Also, there’s far more of the image missing compared to the Shroud. I’d also like to see how superficial those feet scorches are. Do you have any microscopic images Colin?\nHugh, am I right in recalling you dismissed the scorch theory not long back. If so, does this experiment convince you otherwise?\n\nChris: I am still trying to determine precisely what these microscopic properties are that one is supposed to be reproducing. So far, it seems to be the half-tone effect that is meant, which simply means a mix of fibres with either a particular hue and intensity of yellow or  white uncoloured with no in-betweens. But how much of that is a direct result of imprinting, and how much a result of subsequent ageing, with a few surviving weakly pigmented fibres? \nIt may sound like a cop-out, and Thibault seemed to indicate as much yesterday, but age and deterioration are the one certainty we have in this world of ours. The physicists call it entropy, and it’s a vastly important concept (like the driving force for ALL chemical reactions) . I’m sorry that it’s not easily testable, if at all, but that’s the nature of the problem – we are dealing with an exceedingly old piece of fabric, but one thing seems fairly obvious – the image seen in the 15th century, say, was a lot more intense than the one we see today, or it would surely not have attracted hundreds, thousands of viewers, many of whom died in a crush I believe on one occasion.\nAs for the entire thing being a result of creasing, all I can say is this. Press a hot template into fabric, and do the same to a sheet of smooth white paper alongside. You will get the same 3D enhancement in either. Creases play little or no part when one is dealing with scorch images, even the faintest.\nYes, there is image missing, because of flexure at the knees. But I was not attempting to imprint everything – merely trying to see what would imprint by pressing down into an underlay of cloth. Next week, I shall reverse the geometry and try imprinting from above with a tamper to get as much of  the template in contact with fabric. The advantage of the new heavy brass template is that it holds its heat for much longer than previous smaller templates.\nThe image of the feet is not superficial, because I was holding the cloth manually against the soles for some time. However, I am presently starting to look in detail at the whole issue of superficiality, especially the reverse-side scorching that is said to exclude contact scorching from “relevant science”. Some of my fainter images from the crucifix show essentially no reverse-side scorching, and when they do, the coloration is confined to the deeper parts of the weave, with crown threads unaffected. It maybe that imprinting with fabric on top, allowing pyrolysis gases to escape more easily into the air, combined with damp tamping, could greatly reduce the “inadmissible” reverse-side scorching, especially as one can see and monitor scorching on that side with the new geometry. We shall see.\nMicroscopic images? No I don’t have any just yet.But let’s first be seeing the ones on which descriptions like “discontinuities” and “striations” are based and held up as “impossible” to achieve by any known means, except uv laser beams, corona discharges etc. Ordinary thermal energy, presented in a range of ways,  should not be prematurely ruled out until thoroughly-tested.The answer may be as much in the technology as the science, with the added uncertainty of ageing effects always the untestable factor that has to be considered.\n\n","date":"November 16, 2013 at 10:43 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51616","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Are the wounds convincing? Well, yes and no. Superficially they’re excellent, but, as I have said, once one begins to probe the details, one is left with more and more difficulties that militate against authenticity (although heaven knows, they don’t necessarily support the forgery hypothesis either). For instance, the ranks of even the most determined authenticitists are split between the “washed” and the “unwashed” (referring to the body, of course, not the people!). Setting aside those who think the shroud is a forgery, or who don’t think the blood is blood at all, I believe that few people doubt that the scourging would have left the body drenched with blood, and that the rivulets of blood down the arms, at least, were made while the body hung on the cross. In order to produce those neat little dumbbells, the body would have had to be washed – but then, why not wash off the rivulets down the arms or on the brows? Or the body was not washed, in which case how did those delicate little patterns extrude themselves through the matted blood over the back? Various semi-scientists have tied themselves in knots attempting to account for this phenomenon, more or less unsuccessfully. They are clot retraction patterns, they are serum exudates, they are haemolytic derivatives and all sorts of odd variations, most of which can explain some aspects of the shroud bloodstains, but fail when applied to others.\nHere’s a simple experiment. Get a teat pipette of red liquid and attempt to replicate (or produce anything at all resembling) the blood belt, by some kind of natural flow. Most so-called observers have assumed that the blood flowed from the sides and pooled in the middle, when this is clearly not the case. Matthias carried out some experiments on himself, dripping wine from a putative spear-thrust while lying on the floor (https://shroudstory.com/2013/07/03/a-book-review-of-joe-nickells-the-science-of-miracles/), but he does not say how far it trickled under his back, or whether he repeated the experiment lying on his side. My experience is that blood does not zig-zag, it just drips or trickles downwards.\nConvincing? Well, yes and no…\n\n","date":"November 16, 2013 at 3:40 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51645","author":"Hugh Farey","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"For instance, the ranks of even the most determined authenticitists are split between the “washed” and the “unwashed” (referring to the body, of course, not the people!)\nWhy entirely washed? Anointing with spices isn’t enought to disturb the scourge wounds?\nWell, perhaps this item was in use:\nhttp://en.wikipedia.org/wiki/Basilica_of_the_Holy_Blood#Relic_of_the_Precious_Blood\n\n","date":"November 16, 2013 at 4:09 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51648","author":"O.K.","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nHugh Farey :\nAre the wounds convincing? Well, yes and no. Superficially they’re excellent, but, as I have said, once one begins to probe the details, one is left with more and more difficulties that militate against authenticity (although heaven knows, they don’t necessarily support the forgery hypothesis either). For instance, the ranks of even the most determined authenticitists are split between the “washed” and the “unwashed” (referring to the body, of course, not the people!). Setting aside those who think the shroud is a forgery, or who don’t think the blood is blood at all, I believe that few people doubt that the scourging would have left the body drenched with blood, and that the rivulets of blood down the arms, at least, were made while the body hung on the cross. In order to produce those neat little dumbbells, the body would have had to be washed – but then, why not wash off the rivulets down the arms or on the brows? Or the body was not washed, in which case how did those delicate little patterns extrude themselves through the matted blood over the back? Various semi-scientists have tied themselves in knots attempting to account for this phenomenon, more or less unsuccessfully. They are clot retraction patterns, they are serum exudates, they are haemolytic derivatives and all sorts of odd variations, most of which can explain some aspects of the shroud bloodstains, but fail when applied to others.\nHere’s a simple experiment. Get a teat pipette of red liquid and attempt to replicate (or produce anything at all resembling) the blood belt, by some kind of natural flow. Most so-called observers have assumed that the blood flowed from the sides and pooled in the middle, when this is clearly not the case. Matthias carried out some experiments on himself, dripping wine from a putative spear-thrust while lying on the floor (https://shroudstory.com/2013/07/03/a-book-review-of-joe-nickells-the-science-of-miracles/), but he does not say how far it trickled under his back, or whether he repeated the experiment lying on his side. My experience is that blood does not zig-zag, it just drips or trickles downwards.\nConvincing? Well, yes and no…\n\nGot it-the washed vs. unwashed has always been a bit of a conundrum for me, I guess I would favor speed-washed-I appreciate your response\n\n","date":"November 16, 2013 at 4:07 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51647","author":"Kelly Kearse","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Some comments: \nHugh (# 56): ” Revisiting my own photos of scorched fibres, I do not find that the lumen (why does Rogers consistently call it the medulla I wonder?) is always darkened. Even in his own micrograph, presumably chosen carefully to illustrate his point, there is hardly any darkening of the lumen visible. Had the fragment that does appear darkened been photographed at X200 (like the image fibre next to it) it may not have shown any dark middle at all. This is not an important reason to exclude the scorch hypothesis. The fluorescence thing, I think, is the true cruncher.”\nRogers wrote: ” When viewed in parallel light under a microscope, a scorched fiber (Fig VI-I) is colored through its entire diameter, and the medulla (..)usually appears to be darker than the mass of the fiber as a result of reactions at its surface and its shorter radius of curvature. The medullas of image fibers do not show any coloration or charring (figure VI-2). Image-fiber medullas are usually clean and colorless”.\nThe fact that Rogers compared LIGHTLY scorched fibers with an UNUSUALLY DEEPLY COLORED IMAGE FIBER is the main point.\nNo doubt that Rogers did look carefully at the samples he had. The figures in his book are only shown as an example of his observations performed on many fibers from the Shroud. \nThe term “usually” is important. You wrote that the lumen in your own scorch experiments are not always darkened. What is the difference between “usually” (Rogers) and “not always” (you)?\nIt should be interesting to look at your own experiments.\nWhere did you find scorched fibers without darkened lumen ?\nColin (#45): “But there is the crucial observation that scorched fibres are brittle, and putting that together with the evidence from Fanti et al elsewhere that Shroud image fibres fracture more easily than non-image fibres, there is an alternative explanation for the uniformly yellow fibres and the so-called half-tone effect, namely that we are now seeing only those very lightly scorched fibres (regardless of scorching mechanism) that have survived to this day without breaking and falling off. One can hardly expect the modern day experimentalist to reproduce image-forming mechanisms AND the effect of centuries of ageing and disintegration.”\nYes, no doubt that scorched fibers are brittle.\nHowever, the burned and scorched fibers from the 1532 fire do not show any kind of disintegration (you will see that tomorrow).\nMoreover, I don’t think that the pilgrims and the Authorities could be fooled by a scorch imprint. This has been never described. The famous (controversial) D’ Arcis ” memorandum” does suggest a “paint” (but it is not a paint) not a scorch.\n\n","date":"November 16, 2013 at 6:03 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51654","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Why wouldn’t pilgrims be fooled by a scorch? It was not a known method of image creation at that time was it? This is why I’d have thought a darker scorch would have been preferred by a forger — why create such a light scorch that would be difficult for people to see?\n\n","date":"November 16, 2013 at 6:20 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51656","author":"David Goulet","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Quite. I’d go further, and say i do not understand Thibault’s aversion to the idea of the image being a superficial scorch, since that does not exclude authenticity. STURP described the chemical nature of the image layer essentially as a scorch, even if not using that precise term, i.e. as carbohydrate that had undergone chemical dehydration, oxidation etc. The various radiation hypothesis all envisage some reaction with linen carbohydrates that do not require the presence of other chemicals except those in air, so why not describe the discoloration as a radiation scorch?\nMaybe it’s the idea of a contact scorch that Thibault objects to, i.e. from a hot inanimate template as might be used by a medieval forger,  but who’s to say that the chemical changes are not dissimilar to that produced by any other scorched-on imprint obtained by a completely different mechanism that is more compatible with authenticity.\nWe’re constantly told that the image characteristics (extreme superficiality, encoded 3D information, lack of fluorescence) are impossible to achieve by any known method, Is that really science calling the shots on the acceptable narrative, or is the accepted narrative attempting to call the shots on the science?  I know what I think (especially after confirming what others before me have discovered, namely that there is no mystery regarding 3D). \nIt’s that “inimitable” superficiality that is my next objective for study, knowing that ultra-thin surface layers that profoundly alter behaviour are commonplace in chemistry (like a 2nm thick oxide film that protects the otherwise highly corrodible aluminium). Is the image layer really as superficial as claimed, given that image fibres are easier to fracture than non-image. Why should a 200nm thick layer weaken the entire fibre? \nWhat about the hemicelluloses that are in the core of the fibre, admixed with crystalline cellulose. Might they not be susceptible to pyrolysis too, as well as the PCW hemicelluloses? Surely any information of pyrolysis of linen carbohydrates (“scorching”), regardless of how achieved, is better than no information at all. Do we really have to accept STURP’s “scorch in all but name”  conclusion as the last word on the subject? Why has the term “scorch” become a pejorative one, given it makes no assumptions about mechanism? Maybe Tjhibault’s objection is aimed solely at contact scorches, with zero air gap. If so, he should say so, and bring the generic term “scorch” back in from the cold.\n\n","date":"November 16, 2013 at 6:52 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51658","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"“However, the burned and scorched fibers from the 1532 fire do not show any kind of disintegration (you will see that tomorrow).”\nI look forward to seeing your evidence tomorrow, Thibault (provided it’s not one of those magisterial PDFs that invite no comment ;-)\n\n","date":"November 16, 2013 at 6:18 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51655","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nMimus :\nColin, I understand that you do not intend to reproduce a large-scale model: that would be way to premature to do so and a complete waste of effort. What I meant is rather that: (1) it is difficult, or even close to impossible, to get a “nice” 3D effect using a small 3D model. The task appears simpler by doubling the size of the 3D model as there will be more vertical height, therefore more gradation from the scorching; (2) do you have some clear 100x or 200x photographs of the linen fibers of your experiments (hopefully taken with a microscope with possibly different lighting conditions)?; (3) don’t you get a gradual amount of dehydration (and potentially of colors) of the fibers depending on the distance from the model to the cloth?\nAnd, by the way, “Anonymous” is clearly Yannick Clement.\n\nQuickie response (with a second instalment tomorrow): I get the impression that 3D, inferior v superior, is your chief concern re modelling. I’d disagree. Take the Durante 2002 “as is” image from Shroud Scope, and upload to ImageJ. Look at the effect of light/dark inversion (as per Secondo Pia) and then 3D enhancement of that image. It’s that first step that takes the breath away. The 3D enhancement is just icing on the cake, but is actually unremarkable, now we know that ordinary photographs and drawings also respond to 3D-enhancement in ImageJ.\nI wouldn’t blame anyone who thought that the sepia pseudo-negative Shroud image had unique properties, transforming to that iconic photograph-like representation of the popular image of Jesus of Nazareth, but that may also be seen to be more illusion than reality when one takes more mundane negative images (including heat scorches) though the same procedure, producing luminous and ghostly end-results with a near photo-like quality. Nope, I don’t expect to convince anyone – it’s something that has to be discovered for oneself.\n\n","date":"November 16, 2013 at 7:12 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51660","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\ncolinsberry :\nQuite.  Why has the term “scorch” become a pejorative one, given it makes no assumptions about mechanism? Maybe Tjhibault’s objection is aimed solely at contact scorches, with zero air gap. If so, he should say so, and bring the generic term “scorch” back in from the cold.\n\nAgreed. Even Prof Fanti’s corolla discharge theory is a ‘scorch’ theory. Is it a heated metal scorch, a bio-chemical scorch, bio-electrical, radiation,etc? Mattingly’s theory is the only other theory I find plausible that isn’t a scorch theory.\nI’d also say that if the Shroud is a forgery I don’t see how it could be anything but a scorch.\n\n","date":"November 16, 2013 at 7:45 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51663","author":"David Goulet","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"David, any transfer process that can “scorch” the linen fiber imply automatically a high amount of energy, which, because of its high intensity, cannot produce a discontinuous distribution of colored fibers like it has been noted in the image area of the Shroud.  So, here’s my advice to you: forget about Corona discharge or UV light or any other burst of high energetic radiation has a possible solution for the Shroud image.  It is simply scientifically impossible for such energetic processes to produced a discontinuous distribution of colored fibers like we see on the Shroud. \nAnd again, for the same reason I just mentioned and also because of the evidence of the bloodtains, you can also completely forget the idea of a forgery made with a scorch technique.\nI repeat myself but I can’t shut up about that: the answer for the Shroud image formation must have something to do with a natural process coming from the corpse that was enshrouded for less than 48 hours Inside that cloth.  The solution cannot be found outside of this…\n\n","date":"November 16, 2013 at 10:59 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51674","author":"Anomymous","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"A biochemical scorch would not require a high energy discharge. I’ve read the rebuttals to the scorch theory and I agree there are significant problems with it. All I was suggesting above is that if the Shroud is authentic there could be a range of possible causes for the image formation. However if it’s a forgery the image formation is likely a scorch – because all other known alternatives have been eliminated while this one alone remains plausible.\nYou don’t have to repeat the blood issues for my benefit. I’ve read your paper. And the others it was based on.\nYou may feel Colin’s scorch experiment was a waste of time. But he did demonstrate that the 3d properties, the photo negative attributes, can be replicated. The ease with which he did it was thanks to dogged curiosity and modern technical tools the STURP-era team could only dream of. He dispelled the long held perception that the Shroud alone could have these properties (and thus MUST be authentic).\nThere may be other properties that still remain unique. But if Colin had listened to you and not bothered with his experiment, we’d have one less new observation about the Shroud to consider.\nFeel free to keep reminding me about those bloodstains and I’ll keep reminding you that insights can always be found where we least expect them.\n\n","date":"November 16, 2013 at 11:22 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51678","author":"David Goulet","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"You seem very certain on the answer.\nI think the jury is still out in a big way.\nMy own belief is that the image was caused – somehow, and I’m not suggesting radiation – by the resurrection. I find it bizarre that Christians who believe in a supernatural event – the resurrection – cannot consider that this supernatural event  might have caused the image we see on the shroud. I’ve never heard one good answer why belief in the resurrection and belief that the resurrection caused the image are incompatible, unless one was to argue that the carbon dating is right and the shroud was created in the 1300s. \nIf one accepts the resurrection, as a supernatural event outside of human understanding, then I don’t understand why one cannot accept that that event created an image on the shroud outside of human understanding.\n\n","date":"November 16, 2013 at 11:33 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51681","author":"Matthias","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"I must write again the last sentence with an important addition: the answer for the Shroud image formation must have something to do with a natural AND VERY MILD process coming from the corpse that was enshrouded for less than 48 hours Inside that cloth. The solution cannot be found outside of this…  All the data coming from the Shroud (and particularly the fact that the blood and serum stains outside the immediate vicinity of the 1532 fire holes were not disturbed or damaged by the image formation process, along with the discontinuous aspect and extreme superficiality of the image) points in direction of a mild process, which have all the chances in the world to have been natural.  Nature is very surprising at times!\n\n","date":"November 16, 2013 at 11:04 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51676","author":"Anomymous","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Very well could be. A biochemical ‘scorch’ could be such a thing. I’m thinking of something like the effect poison ivy has on our skin. In a sense the ivy ‘scorches’ us — in a natural and mild way (compared to sulfuric acid or liquid nitrogen). Could the cocktail of spices, aloes, putrific gases acted liked poison ivy on the linen? It’s a poor example, as I’m no scientist but you get the idea.\nI do favour a natural image formation theory — but there’s more than one on the table.\n\n","date":"November 16, 2013 at 11:31 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51680","author":"David Goulet","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nDavid Goulet :\n\ncolinsberry :\nQuite.  Why has the term “scorch” become a pejorative one, given it makes no assumptions about mechanism? Maybe Tjhibault’s objection is aimed solely at contact scorches, with zero air gap. If so, he should say so, and bring the generic term “scorch” back in from the cold.\n\nAgreed. Even Prof Fanti’s corolla discharge theory is a ‘scorch’ theory. Is it a heated metal scorch, a bio-chemical scorch, bio-electrical, radiation,etc? Mattingly’s theory is the only other theory I find plausible that isn’t a scorch theory.\nI’d also say that if the Shroud is a forgery I don’t see how it could be anything but a scorch.\n\nWell said that man.\n“I’d also say that if the Shroud is a forgery I don’t see how it could be anything but a scorch.”\n99% in agreement. But it might be a composite “painting” (well, frottage actually) if Luigi Garlaschelli’s model is looked at closely. He used ochre pigment, wet or dry, to get an impression of the 3D subject (volunteer or bas relief), and then baked the coated linen in an oven. The linen under the pigment scorched (“aged artificially”) at a faster rate than the uncoated linen. Initially the image was composite (scorch plus adhering pigment) but Garlaschelli reckons the pigment then flaked off, leaving just the underlying discoloration to intrigue and perplex subsequent generations right through to 16th November 2013.\n\n","date":"November 16, 2013 at 7:54 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51664","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nAnomymous :\nIn the case of the Shroud, when I use the word “perfect” is in the sense of “looking authentic” or, if you will, “looking real”.  So much in fact that almost every medical or forensic experts were convinced, just like the ENTIRE STURP team, that these images must have been formed by an interaction between the cloth and a real crucified corpse.  And it’s the same thing for the blood and serum stains.\n\nYou haven’t answered my question.\n Repeat:..    “if miracles are part of your narrative, if only for blood, what gives you the right to sit in judgement on any scientific hypothesizing on image-formation mechanisms that do not require miracles, especially when you constantly invoke bloodstains which by your reckoning DO involve miracles?”\n\n","date":"November 17, 2013 at 2:32 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51690","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"David – I always respect your views.\nYou say you favor a natural formation theory. Presumably you don’t favor a supernatural theory?\nAre you a Christian? I sensed you were. The reason is, if you are – and don’t favor a supernatural theory – why not?\n\n","date":"November 17, 2013 at 5:11 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51698","author":"Matthias","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Intended for discussion only – a possible classification of miraculous inputs into the Shroud image on a 1-10 scale, listed in order of increasing supernatural intervention (with my own highly subjective scores attached):\n1. Imprinting by electromagnetic radiation other than thermal infrared. \nReminder: First law of photochemistry: for radiation to produce a chemical reaction it has first to be absorbed. But high quality bleached linen is transparent to, or reflects, most of the radiation that falls on it (unless coated with an opaque sensitizer).  Shorter wavelengths (excimer laser uv etc) would be absorbed by air en route.\n A Category 4 miracle\n2. Imprints of scourge marks  (lead pellets etc) caused by blood alone (we are told) despite a degree of morphological detail that is not seen in other types of wound (where blood alone IS the only unambiguous evidence for a skin lesion).\nA Category 4 miracle\nBlood rivulets in hair (if requiring orthogonal projection of radiation to sustain argument that they were really on side of subject’s face, but ended up out of stereo-register ).\nA Category 5 miracle\n3. Undisturbed blood clots after Shroud vacated.\n A Category 6 miracle\n4. Bloodstains being claimed to be not whole blood, but a serum exudate of blood clots, impling that soluble haemoglobin has escaped from lysed red blood cells but strangely not potassium.\nA Category 7 miracle\n5. Imaging by radiation with no lens or photographic emulsion, if one has to invoke some kind of orthogonal projection onto fabric of collimated rays. Radiation does not self-collimate.\n A Category 10 miracle\nNo claims are made that this listing is complete or accurately scored. Suggestions for further additions or amendments welcome.\n\n","date":"November 17, 2013 at 6:13 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51702","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"PS: Apols for the glitch in numbering.\n\n","date":"November 17, 2013 at 6:18 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51703","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Suggestion for addtion : miraculous disparition of pigments.\n\ncolinsberry :\nBut it might be a composite “painting” (well, frottage actually) if Luigi Garlaschelli’s model is looked at closely.","date":"November 17, 2013 at 6:54 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51706","author":"anoxie","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Interesting list Colin. But not really relevant to my own point.\nMy point is that the resurrection is beyond physical laws, therefore the image was created in ways beyond our understanding of natural laws.\nSo taking my point a step further, this will mean that if the shroud image was created by the resurrection then we will never no how the image was created because we will never be able to rationalise what or how the resurrection occurred.\nMy belief – and it is only a mere belief! – is that Jesus’s body dematerialized, before rematerializing in  spiritual form before the witnesses – and this is the resurrection. Now in the act of dematerializing, an image was formed on the Shroud. According to my belief, we’ll never be able to explain how this occurred. I don’t buy into the ‘resurrecton radiation” theory for example – it’s an example of trying to apply physical laws to a supernatural event.\nI realize scientists will find this all most unsatisfactory. And I am more than happy for a naturalistic theory to disprove what I’ve outlined above. It wouldn’t affect my faith.\n\n","date":"November 17, 2013 at 7:31 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51709","author":"Matthias","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Thanks Matthias. I am a Christian (Catholic). I do not rule out a supernatural theory, it’s just that it’s hard to explore supernatural theories, so I tend to start with the natural. I agree with your post below that a supernatural event could trigger natural effects. I also like the theory that the Shroud image is the product of a series of natural factors that all lined up just right to produce the image — that serendipity being the ‘miracle’.\n\n","date":"November 17, 2013 at 10:01 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51739","author":"David Goulet","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nanoxie :\nSuggestion for addtion : miraculous disparition of pigments.\n\ncolinsberry :\nBut it might be a composite “painting” (well, frottage actually) if Luigi Garlaschelli’s model is looked at closely.Ah, but aren’t we forgetting something, anoxie. Walter McCrone DID find traces of iron oxide. Who’s to say they weren’t the last adhering remnants of Garlaschelli’s  postulated red ochre (iron oxide”), as distinct from the less-than-persuasive suggestion that they were acquired from dank pools from retting of flax stems?\n\n","date":"November 17, 2013 at 7:00 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51707","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\ncolinsberry :\n A Category 6 miracle\n4. Bloodstains being claimed to be not whole blood, but a serum exudate of blood clots, impling that soluble haemoglobin has escaped from lysed red blood cells but strangely not potassium.\n\nHemoglobin escape but not potassium, I’m puzzled there myself.  You have always maintained that Adler was out of his league, maybe he was stretching on this one.  What I am wondering is are you?\nForget the Shroud.  Forget Adler and these diffusion enigmas.  I’d like to focus on potassium in aged blood.  Everyone from high school upwards knows that potassium is in fresh blood. This is aged blood, 700-2,000 years old.There is a difference.\nCan you produce a few scientific journal references that demonstrate potassium is used in the forensic evaluation of bloodstains, that it is a marker included for the scientific verification of blood stains, the older the bloodstains the better, but I’ll look at anything.  I’ve searched and I’ve been unsuccessful.  I would be interested in reading them, to see that this is truly a valid point.\nI’m not interested in a long response spiked with counter argument after counter argument, or some deflection to another topic-been there, done that   I’m just looking for references-I can read-I can decide for myself.  References-scientific articles that have nothing whatsoever to do with the Shroud.  Articles about potassium in fresh blood do not qualify, they should focus on potassium in bloodstains.\n\n","date":"November 17, 2013 at 7:39 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51711","author":"Kelly Kearse","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"I’d like to oblige, but can’t, Kelly. But then I do not automatically look to the literature in order to form a view. I work from scientific first principles, at least initially. \nIf you put a spot of blood on linen, and leave it for centuries, you may end up with little more than iron oxide from the haemoglobin, and ALL the cations plus counter-ions (carbonates etc) of original blood, since they are involatile. \nNo, I have never claimed they are specific markers for blood stains, since they are a marker for virtually any living tissue (and blood, we are told is a tissue). But they are obligatory non-specific markers for any once-living tissue. They have to be there, no matter how ancient the tissue, unless washed away. But washing that removed the cations (sodium, potassium, magnesium etc) would surely have smudged the bloodstains and/or washed away lot more besides, like the specific blood markers which we are told did test positive (albumin, ABO marker etc), unless, that is,  one tries to import a host of qualifying assumptions about solubility etc. \nSorry to be so obstinate (not dogmatic, just obstinate) but potassium cannot be swept under the carpet. There is no carpet.\n\n","date":"November 17, 2013 at 8:17 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51718","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Everyone from med school knows potassium is mainly intracellular.\nWhat was the sensitivity for potassium ?\nWhich articles are you referring to ?\n\n","date":"November 17, 2013 at 10:56 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51748","author":"anoxie","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Further to my point above…\nI guess a supernatural trigger could have led to image formation created by natural laws.\nI described the supernatural experience my wife and I had last week when dishes in one of the cupboards started shaking and rattling for 7 or 8 seconds, then we found out next day our close friend in NZ passed away about that time.\nAssuming that really was a supernatural event and my wife and I weren’t deluded (and we were 100% sober!), you could see that as a supernatural event triggering an event obeying natural laws ie. dishes rattle, hitting each other and making noise – which we experience through our hearing.\nSo pulling this back to the Shroud. As I say I don’t buy the radiation theories. But what if the pre-resurrected physical body of Christ heated up as part of the process, to a level that could leave an image?\nThis is where I need you Colin and / or the other scientists…could a very hot body potentially create the kind of image we see on the Shroud, or does it depend on the object being hot and hard (eg metallic)???\n Put aside any aspersions to the supernatural just for a moment – thoughts?\n\n","date":"November 17, 2013 at 7:51 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51713","author":"Matthias","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"You’re in Australia, I believe Matthias. Not SE Austalia by any chance (Victoria etc)?\nMap and chart of this month’s seismic activity in your part of the world:\nhttp://www.ga.gov.au/earthquakes/initRecentQuakes.do\n\n","date":"November 17, 2013 at 8:26 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51721","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Adelaide. No matches. I looked at this data last week to consider rational explanations\n\n","date":"November 17, 2013 at 8:57 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51725","author":"matthias","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nMatthias :\nInteresting list Colin. But not really relevant to my own point.\nMy point is that the resurrection is beyond physical laws, therefore the image was created in ways beyond our understanding of natural laws.\nSo taking my point a step further, this will mean that if the shroud image was created by the resurrection then we will never no how the image was created because we will never be able to rationalise what or how the resurrection occurred.\nMy belief – and it is only a mere belief! – is that Jesus’s body dematerialized, before rematerializing in  spiritual form before the witnesses – and this is the resurrection. Now in the act of dematerializing, an image was formed on the Shroud. According to my belief, we’ll never be able to explain how this occurred. I don’t buy into the ‘resurrecton radiation” theory for example – it’s an example of trying to apply physical laws to a supernatural event.\nI realize scientists will find this all most unsatisfactory. And I am more than happy for a naturalistic theory to disprove what I’ve outlined above. It wouldn’t affect my faith.\n\nI have no problem with any of that, Matthias. My interest is not in debunking Christian belief, or, more hesitantly, with miraculous accounts of how the “real” burial Shroud came into being. My beef is with the scientists of questionable objectivity (I’m not allowed to call them pseudo-scientists) who either claim that conventional science backs up the Shroud’s authenticity, or who attempt to blend science and magic to explain the Resurrection and image-imprinting as a supernatural flash of radiation, and then rush to their excimer lasers, corona discharge generators, medical X-rays etc etc in search of “supporting evidence”. \nIf it’s any comfort (probably not), I too once wavered towards authenticity when reading the Sunday Times Magazine account of Rolfe’s Silent Witness, late 1970s. Rapid unwavering occurred in 1988 (radiocarbon dating), followed by indignation in November 2011 (ENEA’s pulsed uv excimer laser beams, especially the authors’ conclusion that they hoped their out-of-hours superficial scorching of linen would stimulate philosophical and theological debate). That was the day the icy-cold sub-Arctic Sibelius-like music (of objective dispassionate science) died for me…\n\n","date":"November 17, 2013 at 7:57 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51714","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\ncolinsberry :\n\nMatthias :\nInteresting list Colin. But not really relevant to my own point.\nMy point is that the resurrection is beyond physical laws, therefore the image was created in ways beyond our understanding of natural laws.\nSo taking my point a step further, this will mean that if the shroud image was created by the resurrection then we will never no how the image was created because we will never be able to rationalise what or how the resurrection occurred.\nMy belief – and it is only a mere belief! – is that Jesus’s body dematerialized, before rematerializing in  spiritual form before the witnesses – and this is the resurrection. Now in the act of dematerializing, an image was formed on the Shroud. According to my belief, we’ll never be able to explain how this occurred. I don’t buy into the ‘resurrecton radiation” theory for example – it’s an example of trying to apply physical laws to a supernatural event.\nI realize scientists will find this all most unsatisfactory. And I am more than happy for a naturalistic theory to disprove what I’ve outlined above. It wouldn’t affect my faith.\n\nI have no problem with any of that, Matthias. My interest is not in debunking Christian belief, or, more hesitantly, with miraculous accounts of how the “real” burial Shroud came into being. My beef is with the scientists of questionable objectivity (I’m not allowed to call them pseudo-scientists) who either claim that conventional science backs up the Shroud’s authenticity, or who attempt to blend science and magic to explain the Resurrection and image-imprinting as a supernatural flash of radiation, and then rush to their excimer lasers, corona discharge generators, medical X-rays etc etc in search of “supporting evidence”.\nIf it’s any comfort (probably not), I too once wavered towards authenticity when reading the Sunday Times Magazine account of Rolfe’s Silent Witness, late 1970s. Rapid unwavering occurred in 1988 (radiocarbon dating), followed by indignation in November 2011 (ENEA’s pulsed uv excimer laser beams, especially the authors’ conclusion that they hoped their out-of-hours superficial scorching of linen would stimulate philosophical and theological debate). That was the day the icy-cold sub-Arctic Sibelius-like music (of objective dispassionate science) died for me…\n\nColin, \nIf the authors of the 1988 & 2011 fully retracted their papers, would that influence your waiver?  You’ve always struck me as an independent thinker, did the 2011 really rock your boat that much scientifically, or did it strike more of a personal chord?\nI have always considered myself a scientist who happens to be a Christian and a Christian who happens to be scientist.  I don’t think it’s fair to be disqualified because of one’s personal beliefs-the same argument could be used against an atheist-I don’t think that’s right.  I’m not trying to tell you what to do, but it might be more accurate to refer to certain data as “pseudoscience”, rather than the wholesale personal trashing of someone as a “pseudo scientist”.  Even Linus Pauling slipped in the DNA hunt, you yourself pointed that out not too long ago.\n\n","date":"November 17, 2013 at 8:24 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51719","author":"Kelly Kearse","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Re: blood, I don’t rule out the possibility that some stains are authentic, and some were added.The possibility that some of the blood stains may not be authentic (ie. they were added) hardly impacts on the case for authenticity\n\n","date":"November 17, 2013 at 8:25 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51720","author":"Matthias","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"I think this is a very good hypothesis. I could see someone wanting to ‘touch up’ the image with a blood stain or two to enhance it for the pilgrims or for personal ego. I recall seeing an interview with Mel Gibson talking about his cameo in the Passion movie. It was his hand portraying the Roman soldier who drives the nail into Jesus’ wrist. He did this as a personal ‘confession’ – showing how he too was a sinner crucifying Christ. Might some holder of the Shroud added his own blood to the Shroud as a pious act?\nSo much has happened to that piece of cloth that we can only try to guess working backwards — it’s a monster of a forensics process.\n\n","date":"November 17, 2013 at 9:44 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51733","author":"David Goulet","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"“If the authors of the 1988 & 2011 fully retracted their papers, would that influence your waiver?”\nProbably, if had happened promptly. But I had been following the debate on Tom Chivers’ blog on the Daily Telegraph, and after his first posting, Di Lazzaro contacted him and asked to be allowed to clarify, and from memory that served only to irritate still further. What;s more, the same gentleman was invited to trash my scorching ideas by presenting his own ad hoc experiments with a heated coin, claiming it would be impossible to get a superficial scorch. I pointed out that his coin as either too hot or held too long against the cloth (it was the latter as I recall from his few words of description) and he could not be bothered to respond to my critique of his rumbustious MO, so there’s no love lost there.\nBut I quickly discovered that ENEA scientists are just the tip of the iceberg of what I call theoscience. Sorry, science is science. There is no such thing as theoscience, which I still not dare refer to here as pseudoscience. Remember: we are seeing science being used to support and indeed actively promote an anything-is-possible-in- a- magical universe – if you-you-look-(or listen)- hard- enough agenda – but is that simply about Shroud authenticity, or is it an attempt to debase and discredit science and scientific method, to promote other hidden agendas- confirming fears that agenda-driven science, like statistics, can be used to prove anything? Look at the professional sites that attack so-called pseudo-skeptics, then look for the underlying agenda. \n The early part of the 21st century is seeing a full-scale assault on science and the scientific method. In passing, I’m also a veteran of internet forums on climate-change science too, and regularly get slung off a particular site by cabals of astroturfing denialists. Want to hear why we are seeing all the storm damage and flash-flooding?  I presented a case some 3-4 years ago – citing Santer, BD et alon rising atmospheric water vapour over oceans- but most has been wiped from the record, and the loathsome James Delingpole is still allowed to spew his anti-science venom on the Telegraph’s site.\n\n","date":"November 17, 2013 at 8:54 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51723","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\ncolinsberry :\nI’d like to oblige, but can’t, Kelly. But then I do not automatically look to the literature in order to form a view. I work from scientific first principles, at least initially.\nIf you put a spot of blood on linen, and leave it for centuries, you may end up with little more than iron oxide from the haemoglobin, and ALL the cations plus counter-ions (carbonates etc) of original blood, since they are involatile.\nNo, I have never claimed they are specific markers for blood stains, since they are a marker for virtually any living tissue (and blood, we are told is a tissue). But they are obligatory non-specific markers for any once-living tissue. They have to be there, no matter how ancient the tissue, unless washed away. But washing that removed the cations (sodium, potassium, magnesium etc) would surely have smudged the bloodstains and/or washed away lot more besides, like the specific blood markers which we are told did test positive (albumin, ABO marker etc), unless, that is,  one tries to import a host of qualifying assumptions about solubility etc.\nSorry to be so obstinate (not dogmatic, just obstinate) but potassium cannot be swept under the carpet. There is no carpet.\n\nIf it’s valid to use potassium as an indicator that suspected dried bloodstains are, in fact, composed of real blood, then there will be references to it in the literature, pure & simple.  Therefore, its lack of detection cannot be used to support the view that such dried bloodstains do not consist of real blood.\nWork from scientific principles, initially, give me a break-what is the literature based on?\n\n","date":"November 17, 2013 at 8:57 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51724","author":"Kelly Kearse","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Sorry, you have completely lost me there, Kelly. What about the buzz of science, the Star Trek factor (to boldly go – splitting one’s infinitives – where no man has gone before etc etc? There cannot be a literature on potassium in relation to ancient bloodstains unless or until someone flags it up as an issue. It  would seem that task has fallen to me, if, as you suggest, there is no existing literature. I don’t claim to be coming from a popular starting point. But I’m in good company. \n“I come from Des Moines. Somebody had to” (Bill Bryson)\n\n","date":"November 17, 2013 at 9:15 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51730","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nDavid Goulet :\nWhy wouldn’t pilgrims be fooled by a scorch? It was not a known method of image creation at that time was it? This is why I’d have thought a darker scorch would have been\npreferred by a forger — why create such a light scorch that would be difficult for people to see?\n\nLet me explain in detail my thoughts.\nWhat follows must be read in the context of a medieval forgery made either by a “simple” scorch technique or a more complex one, like the “composite painting”\nIt has been claimed that the image was more visible in the middle-ages than now. There is no historical proof of that (to my knowledge) but it is a direct consequence of these hypotheses.\nThen we are told that the heavily scorched fibers found in the inevitable “hot points” (brown areas) flaked off over the time, leaving only the lightly yellowish monochromatic colored fibers we see today. Incidentally, it would be a miracle (I can explain why, but later).\nConsequently, those “hot spots” that can be seen with the naked eyes must have been present in the middle-ages. In other words, anybody looking carefully at the image would have recognized in some areas the typical signature of a scorch. Perhaps not the pilgrims but certainly the bishops and other “authorities” who looked at it through the centuries.\nTo my knowledge, the possibility for the image being a scorch was never suggested until the modern ages. Think about that. Our ancestors were not stupid and they certainly knew what a scorched fabric is.\nTherefore, it seems much more probable that if the image is a scorch, it did not look like a scorch also in the middle-ages.\n” why create such a light scorch that would be difficult for people to see?”\nBecause it’s the only way to create a “true relic”. A ghostly faint image is much more convincing than a dark scorch.\nAnd the image was as visible for the pilgrims in the middle-ages as it is now. I don’t see the problem.\n\n","date":"November 17, 2013 at 9:02 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51727","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"A fair point. If a forger came up with the idea of creating a scorch image, it is reasonable to assume that others of his time could deduce it was a scorch once presented with it – especially if it was darker at the time. As you said the average pilgrim might not have had access to it, nor the scientific background. But the clergy would have, so too the the artists who were commissioned to paint icons based on it. That no one until the modern era even referred to it as ‘a scorch-like’ image is something to consider.\n\n","date":"November 17, 2013 at 9:54 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51736","author":"David Goulet","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"There was some discussion (I can’t find it just now) suggesting that all the blood on the shroud comes from haemolysed cells, whose contents emerged onto the shroud, but whose walls did not, remaining in the body. The potassium, it was theorised, remained in the cells. What justification, if any, there is for this explanation, I don’t know.\nAs for consideration of occurrences “beyond physical laws,” this was thoroughly covered at https://shroudstory.com/2013/08/30/of-inexplicable-explanations/, and surely does not need re-iterating.\n\n","date":"November 17, 2013 at 9:21 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51731","author":"Hugh Farey","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"There are two distinct reasons for thinking that potassium would not stay for long inside RBCs, Hugh, once removed from the bloodstream. \nFirst, as I expect you know, it requires a continuous expenditure of energy to maintain high K+/high Mg++ inside living metabolically-active cells, and high Na+/high Ca++ outside. The ATP-dependent ion pumps maintain that differential concentration which in turn creates the electrical PD across the cell membrane, needed for life processes. If blood leaves the bloodstream, then it becomes cut off from its source of glucose for glycolysis and ATP generation. When the ion pumps stop working, diffusion down concentration gradients takes place, so potassium leaks out, and sodium leaks in to take its place etc etc thus equalising concentrations inside and out.  So one can be fairly certain that old blood would quickly result in a high K+ in surrounding plasma (or serum after clotting).\nThe second argument is much simpler. If something has happened to compromise the integrity of the RBC membrane, such that there is haemolysis, i.e. escape of soluble haemoglobin into the surrounding plasma/serum, then you can be virtually 100% certain that a tiny cation like potassium, even with its hydration shell,  will exit along with a macromolecule like haemoglobin.\n\n","date":"November 17, 2013 at 9:46 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51735","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Are you saying you don’t think the bloodstains on the Shroud are real? Or just that they did not come from the body itself? Just trying to clarify as this  potasium discussion is way over my head.\n\n","date":"November 17, 2013 at 10:05 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51740","author":"David Goulet","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"“Forensic Pathology for Police, Death Investigators, Attorneys and Forensic Scientists” says:\n“During life, normal cell mechanisms keep a majority of potassium molecules confined inside of cells, and sodium and chloride molecules confined to the extra-cellular fluid. After death, these mechanisms stop, and potassium escapes from the cells, while sodium and chloride enter the cells, until equilibrium exists.” And later: “Potassium levels within the blood begin to increase rapidly immediately after death.”\nIf this means anything at all with respect to the shroud, it is that the blood showing low potassium levels was not the result of post-mortem extracellular serum seepage, but occurred before death as a normal consequence of injury.\n\n","date":"November 17, 2013 at 9:46 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51734","author":"Hugh Farey","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Potassium “molecules”? Don’t you just love police manuals? It reminds me of the time the local fire brigade did an inspection of our organic solvent storage cabinets, looking for illicitly-stored “petrol”. They weren’t interested in our hexane, diethyl ether, acetone etc. They just wanted to be certain we weren’t storing “petrol” on the premises (a scientific research institute!).\nSnap as regards the science of extravasation or post-mortem changes in Na/K distribution in blood between the intra-and extracellular space.\n\n","date":"November 17, 2013 at 9:55 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51737","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"And…\nat http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2561112/, we find:  “For example, the ratio of potassium concentration inside and outside cells in life is about 40 : 1, maintained by Na+-K+ ATPase. After death, when there is no further renewal of the energy supply and when the integrity of cell membranes is lost, cell walls become freely permeable to potassium ions, and the concentration inside and outside cells tends to equilibrate. In consequence, serum potassium concentration rises from about 3.5 mmol l−1 prior to death to 18 mmol l−1 at 1 h, and 25 mmol l−1 at 24 h after death. Concentrations above approximately 8 mmol l−1 in life are commonly fatal, but clearly the existence of lethal concentrations before death cannot be inferred from finding them post mortem.”\nIt appears that if the blood stains are indeed an exudate, there should be about 7 times as much potassium in them as is found in normal blood, not the vanishingly low amount actually found. If anyone is to claim otherwise, they must account for the disappearance of the potassium.\n\n","date":"November 17, 2013 at 10:05 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51741","author":"Hugh Farey","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Hugh, same question I asked Colin above. Are you suggesting that the bloodstains are not blood, or rather that they could not have come from the corpse itself?\n\n","date":"November 17, 2013 at 10:15 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51742","author":"David Goulet","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nDavid Goulet :\nAre you saying you don’t think the bloodstains on the Shroud are real? Or just that they did not come from the body itself? Just trying to clarify as this  potasium discussion is way over my head.\n\nIt’s the Adlers etc who say it’s not real blood, David, or at any rate, not whole blood. Having found no red cells worth speaking of, and confronted with a small difficulty re chronology, clotting and liquidity, they claim it is a “serum exudate of retracted blood clots”. So how reliable are the claims that the red stains on the Shroud are real blood when its description as “serum exudate” is narrative-dependent? If it’s serum, then where’s the potassium, why is the porphyrin spectrum atypical, where’s the hard evidence that bilirubin was there contributing to the anomalous spectrum, why the high level of 4-hydroxyproline etc etc.?\nI have stated my hunch, namely that the stains were applied using non-clotting semi-digested blood from a medicinal leech. I don’t say the hypothesis is easy to test, after so long a passage of time, but it is testable in principle. I strongly suspect that the hydroxyproline is animal-derived (as connective tissue collagen)  and it may even have been leech collagen that accompanied the extruded blood.\n\n","date":"November 17, 2013 at 10:17 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51743","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Would you say that the leech theory is, currently, the only theory that is plausible – if the Shroud is a forgery?\n\n","date":"November 17, 2013 at 10:30 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51745","author":"David Goulet","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"The leech theory came about  when Alan Adler and others were ridiculing the idea of medieval forgery, pointing out all kinds of practical difficulties that would face the medieval forger if attempting to simulate blood (correction – Shroud “blood” – a subtle but important distinction). One of the difficulties listed was the immediate clotting tendency of any blood drawn from a volunteer. My first solution was to imagine blood from curative medieval “bleeding” being placed in a woven bag, and extruded through the pores so as to strain off clots as they formed. It was then I remembered the other method of draining off some blood – using the medicinal leech. Semi-digested blood, harvested from a leech, would not clot – since the first thing the leech does when sucking nblood is secrete a powerful anticoagulant – hirudin.\nSo in answer to your question  David – no, leech blood is not obligatory – just convenient in practice – but might in passing help explain some of those anomalies (absence of whole red cells, absence of potassium, the allegedly permanent red colour of the blood, the atypical porphyrin spectrum, the hydroxyproline marker for collagen etc).\n\n","date":"November 17, 2013 at 10:57 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51749","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Sorry, I was busy Googling when David’s and Colin’s replies were posted. Yes, David, the lack of potassium (if true, and if it cannot be accounted for otherwise) precludes the possibility of the stains being a post mortem blood exudate, and seems to preclude the possibility that the redness is erythrocyte derived. Over to Kelly – given those two conditions, does that compromise the blood typing process, or can typing be done on serum alone?\nAs for the molecules, Colin, I had to go back to the book to check, but molecules it is.\n\n","date":"November 17, 2013 at 10:20 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51744","author":"Hugh Farey","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Do you concur with Colin’s leech hypothesis? If it’s not blood, then what other possibility is there?\n\n","date":"November 17, 2013 at 10:32 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51747","author":"David Goulet","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\ncolinsberry :\nQuite. I’d go further, and say i do not understand Thibault’s aversion to the idea of the image being a superficial scorch, since that does not exclude authenticity. STURP described\nthe chemical nature of the image layer essentially as a scorch, even if not using that precise term, i.e. as carbohydrate that had undergone chemical dehydration, oxidation etc. The various radiation hypothesis all envisage some reaction with linen carbohydrates that do not require the presence of other chemicals except those in air, so why not describe the discoloration as a radiation scorch?\nMaybe it’s the idea of a contact scorch that Thibault objects to, i.e. from a hot inanimate template as might be used by a medieval forger,  but who’s to say that the chemical changes are not dissimilar to that produced by any other scorched-on imprint obtained by a completely different mechanism that is more compatible with authenticity.\nI have no “aversion” to the idea of a superficial scorch. I just want to study it (like you Colin) but with experiments, since it is the only image-formation mechanism that is testable (more or less) easily.\nSorry Colin, ”  STURP described the chemical nature of the image layer essentially as a scorch, even if not using that precise term (..)” is misleading and you know that the STURP excluded the scorch hypothesis.\nYou should have written: “the STURP described the chemical nature of the image layer as essentially SIMILAR to a scorch..” But the chemistry of the image is also consistent with the effect of a weak acid etc..\nAnything that produces a superficial dehydration of the surface of the fibers can work, in theory.\nYes, it is the idea of a contact scorch I object to.\nIt seems that you agree that there are at least some problems with a contact scorch imprint.\nSo that now you are insisting on other mechanisms involving heat transfer.\nRadiation (energy transferred from a hot object through electromagnetic waves, mostly infra-red) or convection (energy transferred through the kinetic energy of the heated molecules of air).\nThe problem is that there is no way to obtain any color on a modern linen through a 3-4 millimeters layer of air. Read again carefully my poor pdf: page 3 (preliminary experiment), Fig.1, samples 1 and 2. . I used a metal hotplate having in its center a rounded small 3 to 4\nmillimeters deep depression. The temperature (not measured) was everywhere the same at the surface of the plate, including the depression. I applied firmly the linen on the plate.\nIs there a better way to test the effects of radiation and convection ?\nI concluded: “One can conclude that even with a temperature and contact time much higher than that used by the alleged forger, a true contact is necessary to obtain a color: radiant energy through air does not work.”\nI repeat: a contact( even a light one) is absolutely necessary to obtain even a faint discoloration.\nMaybe convection and or radiation could be a small part of the mechanism of fibers discoloration in contact areas when a hot template is applied on a linen: but what does it change?\nThere must be a contact and the overall result is always problematic.\nI have now to work on the ME images pdf. Sorry, but I think that I will add some short comments (Am I allowed to do that ;-) ?\nI’ll send it to Dan in the next hours.\n\n","date":"November 17, 2013 at 10:31 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51746","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Going back through this site’s archives, I came across this graphic,Thibault, from February 2102.:\nhttps://shroudofturin.files.wordpress.com/2012/02/image_thumb14.png?w=251&h=410\nI suppose I should be asking Dan in the first instance where he came by it, and if he’s reading this perhaps he could say. Suffice it to say it’s at the level of magnification and reasonable resolution I’ve been hankering after for months now. Provenance?\nDo you recognize it,Thibault?  If so, how would you interpret it?  Does it display any of the microscopic features that we scorchers (contact scorchers that is, zero air gap) have to reproduce if to stand any chance of being taken seriously?\n\n","date":"November 17, 2013 at 1:37 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51767","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Unfortunately Colin this picture is NOT from the Shroud, as I thought many years ago.\nIt comes from one of the Fanti’s experiments (with laser or corona discharge, I don’t remember).\nDan can explain that better than me, if he wants.\nPS: I have just sent the ME pdf to Dan.\nI hope that you (and everybody) will enjoy it;\nA good start for interesting discussions ?\n\n","date":"November 17, 2013 at 5:01 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51785","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nanoxie :\nEveryone from med school knows potassium is mainly intracellular.\nWhat was the sensitivity for potassium ?\nWhich articles are you referring to ?\n\nI’m a bit tied up right now, anoxie, but here’s the obvious starting point – a 3 page pdf summary from Alan D Adler himself with the reference in the penultimate paragraph to the blood being “very low in potassium”.  \nhttp://freepages.religions.rootsweb.ancestry.com/~wmeacham/adler.pdf\nI’ll leave you to take it from there. Happy googlin’\n\n","date":"November 17, 2013 at 11:09 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51750","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Ok, thank you, need to go back to the source article.\n\n","date":"November 17, 2013 at 4:48 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51782","author":"anoxie","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Ok. Blood “very low in potassium” , in Adler ´s paragraph, seems to be blood exudates vs whole blood.\n\n","date":"November 17, 2013 at 6:02 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51807","author":"anoxie","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"The fact that most bloodstains on the Shroud are made of exudates of moistened (or re-moistened) blood clots instead of whole blood in liquid form explain why certain properties of it are somewhat different than what can be normally expect…  Again, that’s one reason why I wrote this other comment today: https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/#comment-51783\nPeople very often forget this crucial aspect of the Shroud blood… but not Adler, nor Barbet!!!\n\n","date":"November 17, 2013 at 6:12 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51811","author":"Anomymous","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nHugh Farey :\nAnd…\nat http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2561112/, we find:  “For example, the ratio of potassium concentration inside and outside cells in life is about 40 : 1, maintained by Na+-K+ ATPase. After death, when there is no further renewal of the energy supply and when the integrity of cell membranes is lost, cell walls become freely permeable to potassium ions, and the concentration inside and outside cells tends to equilibrate. In consequence, serum potassium concentration rises from about 3.5 mmol l−1 prior to death to 18 mmol l−1 at 1 h, and 25 mmol l−1 at 24 h after death. Concentrations above approximately 8 mmol l−1 in life are commonly fatal, but clearly the existence of lethal concentrations before death cannot be inferred from finding them post mortem.”\nIt appears that if the blood stains are indeed an exudate, there should be about 7 times as much potassium in them as is found in normal blood, not the vanishingly low amount actually found. If anyone is to claim otherwise, they must account for the disappearance of the potassium.\n\nShould be, could be, just looking for references where this is actually used diagnostically to evaluate aged bloodstains, dried on a cloth, not arguments, numbers about inside/outside cells, etc.\n\n","date":"November 17, 2013 at 11:13 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51751","author":"Kelly Kearse","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"I’m still puzzled as to why you expect to find an existing literature on potassium in relation to shroud “blood”, Kelly, when it’s just one of a host of blood constituents that could or should be there without necessarily being specific markers for blood. If potassium why not cholesterol and other lipids, why not blood clotting factors, why not amino acids, fat- or water-soluble vitamins etc etc.You seem to be saying that if there’s no existing literature then it’s unimportant, trivial, irrelevant etc. That’s not how I see research at all – one plays one’s own hunches first, based on first principles, and after some initial probings, one is then better equipped to explore the existing literature.\nIt was STURP’s Alan D Adler who first made me aware of the potassium deficit. Am I supposed to ignore that because there’s  possibly no supporting archive on ancient blood and potassium? Why on earth would I want to do that? What’s the point of being a scientist if it’s not to add to archives – as distinct from merely consulting them?  Sorry, but I feel there’s a growing tetchiness on your part to any attempt to draw attention to the unsatisfactory basis for claims that the blood on the Shroud is real human blood. The mere fact that it is described as a “serum exudate” means it is not real wholeblood. It’s at best incomplete blood. It is real serum, perhaps, but even then there is the peculiar deficit of potassium. One is entitled to flag up the deficits, surely? Or does one only report the positive results. Adler to his credit reported on what was there, but also what was not – at least not as much as he was expecting. Quantification? Don’t get me started. What did he mean by “extraordinary” amounts of bilirubin? How many millimoles or even old fashioned mg per litre? We are not told. at least not in his summaries. I saw one mention of it being high relative to ‘methemoglobin’, but since there was no figure given for that either, I was none the wiser.\n\n","date":"November 17, 2013 at 11:44 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51755","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nHugh Farey :\n“Forensic Pathology for Police, Death Investigators, Attorneys and Forensic Scientists” says:\n“During life, normal cell mechanisms keep a majority of potassium molecules confined inside of cells, and sodium and chloride molecules confined to the extra-cellular fluid. After death, these mechanisms stop, and potassium escapes from the cells, while sodium and chloride enter the cells, until equilibrium exists.” And later: “Potassium levels within the blood begin to increase rapidly immediately after death.”\nIf this means anything at all with respect to the shroud, it is that the blood showing low potassium levels was not the result of post-mortem extracellular serum seepage, but occurred before death as a normal consequence of injury.\n\nGreat, here’s a manual-is this in reference to evaluating the body to determine relative time of death?  Diagnostics of bloodstains, particularly aged ones, those are the references I’m requesting\n\n","date":"November 17, 2013 at 11:19 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51752","author":"Kelly Kearse","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"At the risk of repeating myself, can you envisage an ancient blood stain that does not contain potassium , or the other physiological cations of fresh blood? If so, where does it go, given it’s non volatile, i.e. salt-like?  Why the need for literature back-up with something so fundamental as the difference between organic and inorganic chemistry, where the carbon skeleton of the first may finally degrade to gaseous CO2, but any sodium, potassium, magnesium, calcium etc gets left in situ, waiting if need be for future analysts to arrive, armed with their atomic absorption or emission spectrophotometers?\n\n","date":"November 17, 2013 at 11:51 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51756","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nHugh Farey :\nSorry, I was busy Googling when David’s and Colin’s replies were posted. Yes, David, the lack of potassium (if true, and if it cannot be accounted for otherwise) precludes the\npossibility of the stains being a post mortem blood exudate, and seems to preclude the possibility that the redness is erythrocyte derived. Over to Kelly – given those two conditions, does that compromise the blood typing process, or can typing be done on serum alone?\nAs for the molecules, Colin, I had to go back to the book to check, but molecules it is.\n\nFrom the NIH blood homepage: “Each human RBC expresses about 2 million ABO blood group antigens. Other blood cells, such as T cells, B cells, and platelets, have ABO blood group antigens that have been adsorbed from the plasma. In individuals who are “secretors”, a soluble form of the ABO blood group antigens is found in saliva and in all bodily fluids except for the cerebrospinal fluid. ”\nThe serum alone/exudate issue is one that I, personally, have always taken with a grain of salt-I don’t know if it must be all or none; others have described what appear to be red blood cells (reinflated ghosts) in the bloodstains-I don’t believe Adler always describes it as totally devoid of such (even membrane fragments), but suggests a predominance.\nI’m interested in the K+ here\n\n","date":"November 17, 2013 at 12:12 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51757","author":"Kelly Kearse","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\ncolinsberry :\nAt the risk of repeating myself, can you envisage an ancient blood stain that does not contain potassium , or the other physiological cations of fresh blood? If so, where does it go,\ngiven it’s non volatile, i.e. salt-like?  Why the need for literature back-up with something so fundamental as the difference between organic and inorganic chemistry, where the carbon skeleton of the first may finally degrade to gaseous CO2, but any sodium, potassium, magnesium, calcium etc gets left in situ, waiting if need be for future analysts to arrive, armed with their atomic absorption or emission spectrophotometers?\n\nCounterarguments, etc.  Looking for references-if it’s “so fundamental” they must be easy to find.  It’s easier to just say # 98, than try to keep justifying it.  #98 is the scientific equivalent of no mas, no mas.  I need literature back up because according to Google scholar I am not certain I can go by your expertise as a blood analyst-I certainly don’t trust my own, and want objective data either way, non-Shroud related\n\n","date":"November 17, 2013 at 12:17 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51758","author":"Kelly Kearse","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"This is getting absurd, Kelly. If you continue in this vein, there can be no useful debate. When have I ever claimed to have expertise as a blood analyst, or indeed in anything as regards the Shroud? All I claim is a thorough grounding in the fundamental underpinning sciences. The underpinning science says that blood cannot just lose its mineral constituents. They remain behind after everything else has gone. You do not need literature citations to back up what is plain common sense. This may be my last word to you for a time if you persist in your present style of carping criticism, of accusing me of introducing irrelevancies when it is you doing that, not me. I am trying to home in and focus on the crucial issues.\n\n","date":"November 17, 2013 at 12:34 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51762","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\ncolinsberry :\nThis is getting absurd, Kelly. If you continue in this vein, there can be no useful debate. When have I ever claimed to have expertise as a blood analyst, or indeed in anything as\nregards the Shroud? All I claim is a thorough grounding in the fundamental underpinning sciences. The underpinning science says that blood cannot just lose its mineral constituents. They remain behind after everything else has gone. You do not need literature citations to back up what is plain common sense. This may be my last word to you for a time if you persist in your present style of carping criticism, of accusing me of introducing irrelevancies when it is you doing that, not me. I am trying to home in and focus on the crucial issues.\n\nColin,\nI don’t consider it such an irrelevancy-the subject has come up before & it was listed as a postulate in the miracle list.  I have always found it interesting that potassium (or the lack thereof) in bloodstains, is referred to as a useful, primary diagnostic-I am not a blood “expert” but have been unable to find references to this in other literature on bloodstains, that is not related to the Shroud.  In communicating with those who know about such forensic tests, potassium was not on the radar.  If common sense and built on such solid scientific underpinnings, why isn’t it routinely tested for in evaluation of dried, aged bloodstains-could it be related to the limit of detection or simply that it’s not a reliable indicator?  If it were, it would be routinely used in the laboratory to investigate the identity of what may be blood soaked into a fabric.  So, then I don’t believe it is especially important to cite this as a weakness in the scientific studies.  \nIt is okay if it is the last word to me for a time-these arguments become like trying to patch an old tire, again & again.  I, too, want to focus on crucial things, which blogging back & forth, ping pong style takes time away from.   Certainly, as a scientist you can understand my request for a reference in the literature-in addition to asking those who work in the area, it’s where I typically go.  So, let’s part on good terms-consider this a digital handshake.  Take care & good luck with the heating experiments.\n\n","date":"November 17, 2013 at 2:12 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51769","author":"Kelly Kearse","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Would you expect the blood to be different if the donor didn’t have a human father?\n\n","date":"November 17, 2013 at 2:13 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51770","author":"ChrisB","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"First prove the Shroud is authentic, and you then have a means of distinguishing how similar or how different the blood is from that of a normal man. \nWhat you can’t do is set up a team called STURP to investigate authenticity using scientific procedures, and then, as soon as its researchers run up against one of more anomalies  (especially post 88) switch to saying – oh, that’s because our man was like no other man living or dead.\nSTURP was either there to establish authenticity, or, allowing itself to assume authenticity, could then proceed to tell us something about Jesus, based on the traces he left behind. \nYou cannot chop and change between those two, and claim you are being scientific.\n\n","date":"November 17, 2013 at 2:41 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51774","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"So if its not blood, what is it? If the Shroud is authentic I can see why there might be problems with finding all the typical forensic blood factors — i.e. age of the blood, we don’t know what the Shroud has been exposed to in those undocumented periods and how this might have affected the blood, as we do not know the image formation process we do not know if that process affected the blood.\nAlso how many people have had access to the blood samples from the Shroud? Were those blood samples all taken from one spot or from multiple spots? Are we relying simply on too few studies that may have missed something? Is Adler’s work definitive?\nIf the Shroud is a forgery why have we not been able to have more clarity on what the blood consists of. Colin’s leech theory appears to the only current theory that has a ghost of a chance of meeting the parameters and it has some obvious challenges.\nAnd, Kelly, there’s nothing absurd in trying to find literature that touches on the subject. It’s where I’d start too, before heading for the final frontier and planting a Federation flag on a planet — only to discover that the Klingons had been there last week.\n\n","date":"November 17, 2013 at 2:49 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51775","author":"David Goulet","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Regarding blood and potassium: \nIn my “paper” : http://www.shroud.com/pdfs/thibault%20final%2001.pdf\nI wrote:\n“SEM/EDX data from dried blood residues were studied by Dixon and al\n(T.R. Dixon, A.V. Samudra and al. A Scanning Electron Microscope Study of Dried Blood. Journal of Forensic Science, Oct.1976, Vol. 21, N°4, 797-803).\n.\nIn particular, samples of blood smears, crusts and dried blood on cloth (up to 7 years old) and\ngraphite were analyzed after subtraction of the spectra generated by the substrate.\nWe must remember that the peak heights in the qualitative EDXRA spectra can not be directly\nrelated to the actual amounts of the measured species.\nAll the blood spectra showed a characteristic pattern: Chlorine (Cl), Sulphur (S) and\nPotassium (K) peaks predominate in nearly the same ratio.\nBlood on cloth gave the following results, in % (rounded): Cl: 22-27, S: 12-22, K: 11-23, Si:\n7-17, Ca: 5-14, P: 0.4-13, Al: 1-9, Na: 0-5, Mg: 1-3, Fe: 0-2. \nAlthough the data are presented differently (% vs. peaks heights), the comparison with the\nEDXRA data of the 10 “blood” shards on the Shroud is interesting:\n– For the 3 major peaks of real blood: Cl on Shroud is consistent with blood, S is present but\nthe actual peak count on the Shroud is unknown (see vermilion Hg/S chapter below) and the\nvery small peak of K seems not compatible with K in whole blood. However, Adler gives a\npossible explanation for this fact (see below).\n– The counts for Si and Al relative to Cl in the Shroud “blood” shards are not inconsistent\nwith the relative percentages of the same elements in real blood. Therefore, one can not\neliminate blood on the basis of their presence in the “blood” shards on the Shroud as it has\nbeen claimed.\n– Ca is also found in blood at a level roughly consistent with what is found in the Shroud\n“blood”, and the small excess could come from the calcium bound to the cellulose.\n– The iron peak height of whole blood in EDXRA spectra is surprisingly low: there is much\nmore Fe in the Shroud red shards than expected for whole blood. \nYes, there is a problem with potassium….in whole blood.\n\n","date":"November 17, 2013 at 5:23 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51792","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nThibault HEIMBURGER :\nUnfortunately Colin this picture is NOT from the Shroud, as I thought many years ago.\nIt comes from one of the Fanti’s experiments (with laser or corona discharge, I don’t remember).\nDan can explain that better than me, if he wants.\nPS: I have just sent the ME pdf to Dan.\nI hope that you (and everybody) will enjoy it;\nA good start for interesting discussions ?\n\nThanks Thibault.  Would you happen to know whether there are pictures of the Shroud  taken at a similar high level of magnification?\n\n","date":"November 17, 2013 at 5:29 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51794","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"You’ll see those pictures “at a similar level of magnification” in my forthcoming pdf.\nGood night !\n\n","date":"November 17, 2013 at 5:49 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51802","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"I will post it first thing in the morning.\n\n","date":"November 17, 2013 at 5:52 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51803","author":"Dan","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Thibault say: “Yes, there is a problem with potassium….in whole blood.”\nThat’s PRECISELY why I wrote this new comment of mine regarding Barrie’s interview (see: https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/#comment-51783) and what he said versus the nature of the blood on the Shroud, which is NO ORDINARY BLOOD!\n\n","date":"November 17, 2013 at 5:36 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51796","author":"Anomymous","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"More Mode 2 magic (not science). Your model, or rather narrative, has no predictive utility. Repeat: it ain’t science, so if this never-ending spiel is directed at science and sceptical Mode 1 scientists, then kindly change the record. You are repetitive, tedious and boring.\n\n","date":"November 17, 2013 at 5:57 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51806","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Ordinary blood mean that the blood would present all the properties of whole blood that would have stained the cloth while in liquid form.  On the Shroud, the reality is very different for the vast majority of the bloodstains and that’s precisely where the most definitive piece of evidence in favor of authenticity is hidding… But when people (like you obviously) don’t want to see the evidence, they will always deny what is obvious.\n\n","date":"November 17, 2013 at 6:07 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51809","author":"Anomymous","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Yannick Clément, I presume? What’s happened, Dan blocked your account? If so, I would like to appeal to Dan, to allow for your return to the forum.\n\n","date":"November 17, 2013 at 6:04 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51808","author":"O.K.","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"If Dan would have done something as mean as this (blocking the account of a blogger who contributed to elevate the level of some debates related to the Shroud, that would be a total shame!!!  I repeat: I’m not Yannick, I’m his phantom.  I’ll let you figure out what this could mean…\n\n","date":"November 17, 2013 at 6:09 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51810","author":"Anomymous","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"\nAnomymous :\nOrdinary blood mean that the blood would present all the properties of whole blood that would have stained the cloth while in liquid form.  On the Shroud, the reality is very different for the vast majority of the bloodstains and that’s precisely where the most definitive piece of evidence in favor of authenticity is hidding… But when people (like you obviously) don’t want to see the evidence, they will always deny what is obvious.Anomymous :\nOrdinary blood mean that the blood would present all the properties of whole blood that would have stained the cloth while in liquid form.  On the Shroud, the reality is very different for the vast majority of the bloodstains and that’s precisely where the most definitive piece of evidence in favor of authenticity is hidding… But when people (like you obviously) don’t want to see the evidence, they will always deny what is obvious.\n\nI repeat. You are confusing model with fact. There may be more than one model that fits a given set of facts. You cannot “marry” a particular model, taking it as your lifelong  partner. There is no place for holy matrimony in science. Serial monogamy or even polygamy is permitted however. Have you considered a trial separation (for starters)?\n\n","date":"November 17, 2013 at 6:14 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51813","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"I’m still stumped on this blood debate. If it is not blood, what is it? Colin, didn’t you come to your leech theory because you deduced that the stains were blood (as opposed to paint or other matter) — and you needed to explain how that blood got onto the linen? The leeches provided the blood, albeit a ‘processed’ blood that more closely fit the parameters.\nIs there at least agreement that the stains are human (primate) blood? But we just aren’t certain if it got there on its own or with someone else’s help.\n\n","date":"November 17, 2013 at 10:53 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51839","author":"David Goulet","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"This answer may be more than you bargained for, David. I did try addressing the details of “blood” specifically to start with, but found my current thinking re “Mode 1” v “Mode 2” behaviour, as seen in the yo-yo behaviour of a certain contributor to this site (who shall remain anonymous) had produced a crystallization, so to speak, of a growing hunch as to the reasons for the derailment of Sindonology as a branch of science (as distinct from theology). So strap yourself in, take a deep breath, here we go.\nThere are two ways in which a research project like STURP could have been set up, what I now call Mode 1 and Mode 2.\nMode 1 makes no assumptions whatsoever about “authenticity”. Indeed, in an ideal world, one would have given the Shroud, or samples thereof to a group of scientists in a non-Judaeo-Christian part of the world, say Shinto Japanese, and asked them to collect as much information as possible, stating only that there may be human material on the fabric, and that the combination may be very old, possibly centuries.\nThen there’s the opposite approach, which I call Mode 2, which at its most extreme is to assume the Shroud’s authenticity, and to regard the project as an opportunity to learn as much as possible about the Jewish founder of Christianity from the remnants on the cloth. In that scenario, anything anomalous, far from being seen as a challenge to authenticity, is regarded as a (heaven-sent?)  opportunity to distinguish between an ordinary man and an extraordinary one. In Mode 2, no finding is allowed to challenge authenticity. Any and all findings must be interpreted so as to fit the narrative.\nSadly with STURP one sees a initial attempt to operate in Mode 1 in the collection of data, but then a rapid recourse to Mode 2 when anomalies are encountered. One sees commendable Mode 1 behaviour with Raymond N. Rogers in the way he initially designed his sticky-tape samplers to apply even pressure to the Shroud, and his description of the coloured coating on image fibres, and its retention as “ghosts” in the adhesive when the fibre is pulled out from the adhesive. But as soon as Rogers alluded to Pliny and ancient linen manufacture, imputing that thin image layer of linen fibres was starch and/or saponins, and making no systematic attempt to prove the presence of an even receptive starch or saponins (far less show how it could act as reducing sugar in Maillard chemistry without extensive degradation) he was moving from Mode 1 to Mode 2 behaviour, and forfeiting his claim to scientific objectivity. No “non-Christian” group, before or after 1988, would have had grounds to suspect that the linen was 2000 years old, far less that it had origins in Palestine.\nThe same can be said for Alan D Adler. He too wasted little time in making the switch from Mode 1 to Mode 2 behaviour. He noted the absence of red blood cells in the stains, but the presence of red pigment with some but not all the spectral properties of oxidized and degraded haemoglobin. He immediately tried to fit that to the biblical narrative, killing two stones if you like, resurrecting previous “narrative-friendly” claims that the stains were not whole blood imprints (difficult to explain) but a serum exudates from blood clots (which conveniently gets round problems of chronology due to clotting and wet-imprinting). Then, to dispel any lingering doubts as to his abandonment of scientific objectivity, he hit on the idea that the atypical spectrum was due to an “extraordinary” amount of bilirubin that had been produced in response to the trauma of crucifixion, and even that the oxidized haem was also an exotic species, unknown it seems to anyone but Alan D Adler, also a response to trauma. How much bilirubin precisely? An “extraordinary” amount. How measured? Apparently from spectral (dubiously-specific uv fluorescence) and chemical properties (non-specific diazo-reactivity) properties, but with no attempt to isolate and fingerprint the bilirubin molecule (which is notoriously unstable in ordinary daylight – and it’s nothing to do with ultraviolet as commonly imagined, but the blue component of the visible spectrum).\nSo if you ask, very properly and scientifically what is the status of the blood studies on the Shroud, one has to go back through those paragraphs above, strip out the Mode 2 narrative-embellishing material until you are back to core Mode 1 science. \nThe first task is to have made available, free of charge, all published material on the STURP findings to accredited researchers, indeed preferably anyone and everyone, but one has to start somewhere in disentangling Mode 1 fact from the Mode 2 narrative-friendly fancy, \nThe entanglement should never have happened in the first place, needless to say. There was a clear failure of management at the very top. Having said that, I have no issue with the STURP summary. It was the later researches and publishing of personal memoirs that led to the increasing blurring of the distinction between science and Christian theology.\n\n","date":"November 18, 2013 at 4:42 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51856","author":"colinsberry","site":"shroudstory"},{"title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?","post":"Coming back to my hypothesis… I reckon some of the blood marks could be authentic eg. scourge marks, maybe side wound – and some may be later ‘touch ups’ to try and build a ‘more convincing’ relic. For example, I’ve always thought the forearm and hair blood marks look possibly too good to be true.\nI think the feet wounds are quite convincing, and make little if any sense as an artistic intervention, where you wouldn’t expect the flow off to the side of the sole of the foot.\nAs for that bloody marking across the lower back…to me that’s really mysterious. It’s not what you would expect from a ‘relic maker’ yet not readily explained in terms of the ‘authentic case’. I had hypothesized, based on putting myself in a lying position and trickling liquid substance down the underside of the forearms and obtaining subsequent flow across the lower back that it might come from forearm flows… but if the forearm blood flows are ‘additions’ then that theory flies out the door!\n\n","date":"November 18, 2013 at 3:45 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","id":"comment-51851","author":"Matthias","site":"shroudstory"}]
