[{"title":"Where’s the Evidence, Colin?","post":"It is obvious that if Colin Berry wants to be taken seriously about this he should publish a peer-reviewed paper first. Only then can he begin to really contest Paolo di Lazzaro. \nLouis\n\n","date":"September 8, 2012 at 11:10 am","url":"https://shroudstory.com/2012/09/08/wheres-the-evidence-colin/","cat":"image_theory","id":"comment-16015","author":"Louis","site":"shroudstory"},{"title":"Where’s the Evidence, Colin?","post":"Yes a faint image is not the same as a superficial image.\nIt is easy to show that without any sophisticated mean.\nToday I did it in my kitchen :-).\nJust take a 3 millimeter thick linen sheet. The thickness, similar to that of the Turin Shroud, is important.\nPut it down flat on a hotplate with a 3-4 mm deep depression in the center of the plate.\nThe temperature is the same on the entire surface including the depression.\nThe results : \n1) Even with the fainter (yellowish) discoloration of the heated side, there is a very faint (although visible) discoloration of the back side\n2) if you cut the sheet in a colored area, you see that the section of the threads is colored\n3) 1)+2) shows beyond any doubt that a superficial image can not be obtained with even a very light scorch. \nBut there is something which was very amazing (at least for me) :\nit is impossible to get an even faint discoloration of the heated side in the area that is just above the 3-4 mm depression of the heated plate : the linen remains white even if the temperature is high enough to give a strong brown discoloration of the surrounding areas in contact with the hot plate. In other words, the radiant energy of the heat is unable to color the linen even at a distance of 3-4 millimeters of the source.\nThis is very important. Why ?\nBecause it is absolutely impossible (in the context of the Shroud) to have a perfect contact everywhere, particularly in the face area. If one uses a statue or even a bas-relief, there will be necessarily some (even small) non contact areas, i.e. some non colored areas. A life-size bas relief has nothing to do with small coins.\nI’ll try to provide soon my photographs and if possible the results of microscopy observations.\n\n","date":"September 8, 2012 at 1:45 pm","url":"https://shroudstory.com/2012/09/08/wheres-the-evidence-colin/","cat":"image_theory","id":"comment-16017","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Where’s the Evidence, Colin?","post":"It is well known fact that Dr Jackson et al. confirmed way back in the early 80’s, that scourching a linen to conform to the body features and superficiality is literally impossible. They came to this conclusion through a series of ‘controlled, repeatable experiments’. Why the scorch method of image production is still being brought-up is a mystery to me. It’s been beaten to death, already!\nR\n\n","date":"September 8, 2012 at 9:10 pm","url":"https://shroudstory.com/2012/09/08/wheres-the-evidence-colin/","cat":"image_theory","id":"comment-16028","author":"Ron","site":"shroudstory"},{"title":"Where’s the Evidence, Colin?","post":"Ron,\nWould you please give me the exact references of Jackson’s work ?\nThank you in advance.\nT.\n\n","date":"September 9, 2012 at 6:29 am","url":"https://shroudstory.com/2012/09/08/wheres-the-evidence-colin/","cat":"image_theory","id":"comment-16050","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Where’s the Evidence, Colin?","post":"I agree.  Colin Berry should not be given much attention.\n\n","date":"September 8, 2012 at 2:38 pm","url":"https://shroudstory.com/2012/09/08/wheres-the-evidence-colin/","cat":"image_theory","id":"comment-16021","author":"Tony","site":"shroudstory"},{"title":"Where’s the Evidence, Colin?","post":"I didn’t know they had electric hot plates in medieval times :-) Ouch!\nBut seriously! If you can’t get an image without contact, even using a bas relief, then how can you get 3D encoded information from a scorch?\n\n","date":"September 8, 2012 at 10:48 pm","url":"https://shroudstory.com/2012/09/08/wheres-the-evidence-colin/","cat":"image_theory","id":"comment-16032","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Where’s the Evidence, Colin?","post":"The scorch theory should be discountable by examining the range in grey-scale values. The Shroud should have a greater range in grey-scale values compared to a scorch, which would presumably have more uniform values.\n\n","date":"September 9, 2012 at 2:34 pm","url":"https://shroudstory.com/2012/09/08/wheres-the-evidence-colin/","cat":"image_theory","id":"comment-16061","author":"ChrisB","site":"shroudstory"},{"title":"Where’s the Evidence, Colin?","post":"\nThibault HEIMBURGER :Ron,\nWould you please give me the exact references of Jackson’s work ?Thank you in advance.T.\nThibault at the moment I cannot. But this has been stated by Dr Jackson ‘himself’ in several documentaries, including the BBC documentary; ‘Material Evidence’, produced by David Rolfe. I would suggest you email or write Dr Jackson to attain all pertinent info.\nThank-you,\nR\n\n","date":"September 9, 2012 at 3:15 pm","url":"https://shroudstory.com/2012/09/08/wheres-the-evidence-colin/","cat":"image_theory","id":"comment-16064","author":"Ron","site":"shroudstory"},{"title":"Where’s the Evidence, Colin?","post":"I followed up the leads on Colin B’s site, and arrived back at this site for posting dated March 4, 2012 “John Jackson on Colin Berry’s “highly misleading” comments” which includes exchange Jackson/Berry and with other comments.\nhttps://shroudstory.com/2012/03/04/john-jackson-on-colin-berrys-highly-misleading-comments/ \nPosting includes: “First, the  description of my using “tin man” statues by Mr. Berry is highly misleading.  What I did, as discussed in detail in the Journal of Applied Optics 1984, was to first intentionally encode three-dimensional geometric information into a bas relief model. (Etc)”   Hope reference to Applied Optics Journal 1984  this helps.\n\n","date":"September 9, 2012 at 7:30 pm","url":"https://shroudstory.com/2012/09/08/wheres-the-evidence-colin/","cat":"image_theory","id":"comment-16072","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Where’s the Evidence, Colin?","post":"Thanks for the reference and link Dave. I cannot believe I somehow missed that posting by Dr Jackson, or guess maybe I forgot about it…I really need to start taking notes of what I read and where I read it.\nThanks again,\nRon\n\n","date":"September 9, 2012 at 11:39 pm","url":"https://shroudstory.com/2012/09/08/wheres-the-evidence-colin/","cat":"image_theory","id":"comment-16077","author":"Ron","site":"shroudstory"},{"title":"Where’s the Evidence, Colin?","post":"Ron, I keep a MS Word scratch pad in my Shroud folder with titles of papers, & their URLs, sometimes a brief summary of notes, and just keep updating it.  Just this year I’m up to 14 pages already.  If it’s a really good paper on the net, pdf or mht I download it and save it. It sure helps me with my postings, else there’s be more time-wasting than there is already.\n\n","date":"September 10, 2012 at 5:48 am","url":"https://shroudstory.com/2012/09/08/wheres-the-evidence-colin/","cat":"image_theory","id":"comment-16088","author":"daveb of wellington nz","site":"shroudstory"}]
