[{"title":"Which type of flour is better for modelling the Man on the Turin Shroud? Aristocratic fine white wheat or monkish rye wholemeal?","post":"Tomorrow’s experiments?\nThe immediate aim is to get some more detailed data on the final faint ghostly image after washing.\nTwo variants of existing methodology will be tested. The first will be to pre-bake linen at different temperatures up to a max of 220 degrees to produce some yellowing, then imprint white flour onto that baked linen, and repeat the oven-roasting. One expects to see the initial bold Maillard product, but will there still be a ghost image after washing? What if the pre-roasting has oxidized or otherwise chemically altered linen components (lignin? hemicelluloses?) that are needed to get the ghost image?\nI will also substitute cotton for linen. Cotton, being seed hairs, not phloem bast fibres, is said to be purer than linen, having less of the non-cellulosic polysaccharides (hemicelluloses, pectins etc). Will there still be a final ghost image with cotton.?\nI may also pre-treat linen and cotton with domestic bleach (sodium hypochlorite) to see if there’s still a ghost image finally.\n","date":"January 5, 2016 at 11:35 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/04/which-type-of-flour-is-better-for-modelling-the-man-on-the-turin-shroud-aristocratic-fine-white-wheat-or-monkish-rye-wholemeal/","cat":"contact_imprint","id":"comment-6663","author":"Colin Berry","site":"colinberry"},{"title":"Which type of flour is better for modelling the Man on the Turin Shroud? Aristocratic fine white wheat or monkish rye wholemeal?","post":"Here’s a screen grab from my sciencebuzz site from back in October 2014 that show the white flour imprinting technique was being tentatively explored even when using horse brasses and crucifixes as inanimate metal templates instead of my own hand.\n\nThe images were very satisfactory, as can be seen above. But there was a snag. They brushed off the linen too easily.Why? Because i was imprinting onto DRY, not wet linen.  One lives and one learns about the right and wrong way to do things. See the latest addition to this posting for further details from that long and winding memory lane that brought us to the present.\n","date":"January 5, 2016 at 10:21 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/04/which-type-of-flour-is-better-for-modelling-the-man-on-the-turin-shroud-aristocratic-fine-white-wheat-or-monkish-rye-wholemeal/","cat":"contact_imprint","id":"comment-6661","author":"Colin Berry","site":"colinberry"},{"title":"Which type of flour is better for modelling the Man on the Turin Shroud? Aristocratic fine white wheat or monkish rye wholemeal?","post":"Have done that crucial experiment today with the corn starch aka cornflour in the UK, and added three photographs to the end of this posting. Here’s one of them that shows the predicted result was obtained.\nhttps://shroudofturinwithoutallthehype.files.wordpress.com/2016/01/dsc02046.jpg?w=640&h=480\nIt  doesn’t prove conclusively that the bold imprints I am seeing are exclusively due to Maillard browning (protein/reducing sugar interaction) but can be seen as supportive evidence.\nIt still leaves unanswered the question as to the nature of the  resistant ‘ghost’ image that remains after soap/water washing. Is that much fainter image also a Maillard reaction product formed by reaction between the added carbohydrates and protein of flour, or does it have an entirely explanation, maybe involvingone or more of the components of linen?\nNaturally, our putative medieval artisans, working away in Lirey or elsewhere, would not have been bothered about such things. All they needed was a faint sepia-tone image on linen that could be displayed to visiting pilgrims, claiming it to be a seriously age-degraded 1350 year old sweat imprint, with added bloodstains in all the correct biblical locations to complete the illusion… Look, no brush marks, no sign of artists’ pigments, and indeed a self-evident IMPRINT, like a muddy footprint on a marble floor, entirely different in character from a mundane painting.\n","date":"January 5, 2016 at 9:10 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/04/which-type-of-flour-is-better-for-modelling-the-man-on-the-turin-shroud-aristocratic-fine-white-wheat-or-monkish-rye-wholemeal/","cat":"contact_imprint","id":"comment-6660","author":"Colin Berry","site":"colinberry"},{"title":"Which type of flour is better for modelling the Man on the Turin Shroud? Aristocratic fine white wheat or monkish rye wholemeal?","post":"Have been looking back through my published posts, not only here but my neglected sciencebuzz site, and find that I had been imprinting with flours as far back as October 2014.\nhttp://colinb-sciencebuzz.blogspot.co.uk/2014/10/modelling-shroud-of-turin-image-with.html\nThat was before I was imprinting off my own flesh-and-blood hand, and was imprinting off brass bas relief or 3D templates as an alternative to hot scorching. The technique was very similar to the current one, i.e. to smear the metal template with vegetable oil, then dust with flour, then imprint onto linen (dry, not wet as currently)  then oven-bake.\nThere were some very promising results ( bas relief templates) and some ghastly ones (3D brass crucifix) and it was disconcerting to find that even the good images off the shallow-relief horse brasses could be brushed off (in retrospect, a result of imprinting onto DRY linen).\nBut there’s an important detail, namely that an image of sorts was obtained using “cornflour”, better described as corn starch, despite the latter having scarcely any protein, and thus unlikely to generate a Maillard browning reaction – though a simple caramelization reaction of sugars was possible to explain the final image. Caramelization of sugars does not need protein or other amine  functional groups. It’s a sugar-only reaction (maybe atmospheric oxygen too).\nWhy mention it now? Maybe it’s premature to be talking about Maillard reactions. Maybe caramelization is a better description. Tomorrow I shall try imprinting off my hand using that low-protein corn starch, not because it’s relevant to medieval France (it’s not, being a New World product), but to see whether the imprinting mechanism proposed with solid “flour” as dry powder and heat, albeit onto wet linen,  can work with carbohydrates alone – indicative of caramelization – independent of proteins.if it’s caramelization alone, then the final attenuated image after washing may still be described fairly as a “scorch”, that much maligned description where sindonology is concerned.\nReminder: this site is not a bound collection of fait accompli pdfs. It’s a running day-by-day, week-by-week log of a (hopefully progressive) learning curve.\n","date":"January 4, 2016 at 6:14 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/04/which-type-of-flour-is-better-for-modelling-the-man-on-the-turin-shroud-aristocratic-fine-white-wheat-or-monkish-rye-wholemeal/","cat":"contact_imprint","id":"comment-6654","author":"Colin Berry","site":"colinberry"}]
