[{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"“I’m more inclined to think the image is miraculous in ways that we have never even imagined,”\nYES!! I like that statement very much. \nWhat did Jesus tell the Rich Young Ruler? He said, “Go, sell all you have, give to the poor, and you will have treasure in heaven.”  But how many Christians actually BELIEVE it, and live it? We are so very EARTH-bound in our thinking.  \nI don’t have much of anything of this earth. Not by choice, it’s just worked out that way, but as a result I look forward to heaven far more than most because earth has none of my treasures, not even a family of my own.  Sometimes I resent it, but other times I realize I’m very privileged to understand more about heaven than most people do. I’ve made a concerted EFFORT to store up treasure in heaven, because there’s very little else that I can do anyway. \nAnd I’m convinced that Christians don’t think about heaven ENOUGH. If we did we’d live differently. We’d change our way of living. We’d become far more compassionate and extremely LESS materialistic. \nHeaven is not LESS than earth. Heaven is not EQUAL to earth. Heaven is FAR more in every way.  Heaven is where Jesus came from, and He  could do miracles and miracles and miracles. There was nobody, EVER, like Jesus Christ. \nJesus said that He would raise HIMSELF from the dead. Jesus was not a victim, He voluntarily went through the awful ordeal on Good Friday. And I think his agony in Gethsemane was NOT because he was about to be subjected to it… No, his agony was because he didn’t know if he could control himself against such blasphemy or the onslaught of demons that he would be given over to. Apparently this ordeal he faced was worse than the temptations that satan put him through, 3 years earlier. \nJames Tissot had something interesting to reveal  in his art books “The Life of our Lord and Savior Jesus Christ.” (published 1899.) When Judas brought the Roman Soldiers to the Garden and betrayed the Christ, we know that Jesus stepped forward and knocked all the soldiers down with his power. That’s in the scriptures. BUT, Tissot said that the soldiers had intended to arrest Christ AND all his disciples: that’s why there were so many of them! However, Jesus did not allow it. Jesus only allowed the soldiers to arrest Himself.  \nAnd when the disciples started to fight back, Jesus healed the man that Peter wounded and put a stop to what Peter was doing. So then the disciples scattered in confusion and the soldiers returned to Jerusalem with only Jesus, because that is all that Jesus allowed them to do. \nI realized Tissot was absolutely right. What power, what CONTROL Jesus had over that situation! He was not a victim. He was LORD! Even as they arrested Him, Christ easily sorted things out and took control. \nSo, if we have FAILED to see even that much in the scriptures, how much else have we failed to see about the entire Passion?  There was POWER at work here which we simply can’t wrap our heads around.   \nWhatever happened to that Shroud is not likely to EVER be explained in natural terms.\nThat’s my opinion anyway.\n\n","date":"February 8, 2012 at 9:02 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8046","author":"AnnieCee","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Bravo. I think we are getting close. Right now we are dealing with theory that fills the gap of known facts. This is the point to paraphrase Teilhard de Chardin science and religion mergers.\nOne fact that as impressed me is the thinness of the image. According to Ray Rogers it is only the coloration of the outer wall of single cells. ANY photograph  process would have required an emulsion of some kind which would be far thicker.\nUltimately the answer, I believe, will be found at the quantum level. Isabel Picsek was right. “The Shroud of Turin is the future of science.”\n\n","date":"February 8, 2012 at 9:06 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8047","author":"John Klotz","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"“One fact that as impressed me is the thinness of the image. According to Ray Rogers it is only the coloration of the outer wall of single cells. ANY photograph process would have required an emulsion of some kind which would be far thicker.”\nWho said anything about photography? A scorched-on image, from something in intimate contact, is not photography, but more akin to “branding” (contact scorching).\nOK, so the scorch is confined to a single cell wall thickness, say 200nm. But our medieval ancestors were highly adept at applying that same thickness of material on the end of a brush to surfaces make them reflective and very attractive with it. I refer of course to illuminated manuscripts, gilding etc., using manually-applied gold leaf, typical thickness 200nm – the same as a plant cell wall…\nLet’s not get hung up on 200nm. It’s just a number… The thickness of the natural oxide film on aluminium is just 10nm – but sufficient to totally alter its properties, making it seem like an unreactive metal. Smear on some mercury – to lift that film – and you see the true reactivity of aluminium – it will literally corrode and disintegrate before your eyes…\n\n","date":"February 8, 2012 at 10:33 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8050","author":"sciencebod","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"The reason I mentioned photography is that we already know it was not painted and we have  claims it was a camera obscura etc. none of which makes sense. \nThe only thing that makes sense is that it was a process we do not yet understand but we may be getting close.\nOf course, I have little time to debate with anybody who refuses to recognize the irrelevance of the blown carbon dating or relevance of  the evidence for the existence of the Shroud in Constantinople at the turn of the last milenium. \nThe Shroud speaks for itself, or as we pain in the neck lawyers might say, res ipsa loquitor.\n\n","date":"February 8, 2012 at 11:19 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8051","author":"John Klotz","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"REGARDING THIS COMMENT\nSciencebod, it would be great if you could provide a solid reference on the typical depth of medieval paintings. 200nm seems to me a very thin layer to be obtaned with a medieval brush, but if you provide serious evidence I could admit that. However let me draw your attention to two additional aspects:\n1. No directionality has been detected on the image which makes impossible the conventional use of a brush. Please, in this paper (*) you will find the results -among other things- of a Fast Fourier Transform analysis of the image which clearly indicates the lack of a preferential directionality, as could be expected from a more or less skilful artist using a very special brush.\n2. As it has been widely reported, the 3D effect is obtained by changing the fraction of coloured fibers by unit area, and all the coloured fibers have the same (more or less) intensity. Please note, that this would imply a medieval artist capable of colouring a linen fiber by fiber.\nREGARDING YOUR PREVIOUS COMMENTS:\nI do hope that you continue writing in this blog and that your next goodbyes to this blog, like the previous ones, are not definitive :-). Also, you can believe me that it is not necessary to mention your CV because, in this blog, you are not dealing with a bunch of illiterates. Out of the level of the discussions we are having here in the last times, I understand that behind most posts and comments there is a truly scientific mind. If you are so familiar with the scientific world, you will have noticed that some of the discussions (OK, in some other cases definitively not!) compare well (types of arguments, extensive use of references, respecftul exchange of opinions, many “I don’t know, I am not sure 100%” and acceptance of limitations…)with discussions in the academia.\nI think that your worst mistake has been to approach this subject as you were dealing with believers in astrology, extraterrestrial minds, tarots Mayan calendars and this sort of things. Most probably a clever and rational mind like yours has in previous ocassions been able to discover the fraud in a couple of days with 2-3 easy experiments.\nHowever, this is not the case. I am not completely sure either whether it is the original burial cloth of Jesus or not, but I think that there is enough evidence to state that whatever the image formation mechanism is, it is very complex.\nI hope that you join the discussions and contribute to identify the weak points on what in my opinion, is a truly scientific challenge. I don`t know if the promoter intended it so from the beginning, but this blog has become a very serious forum of discussion, whose full relevance and projection we will only be able to  correctly appreciate in the forthcoming years.\n(*) Marion, Opt. Eng. 37(8) 2308-2313 (August 1998).In the field of Optics in 1998 there were 47 journals and Optical Engineering was in position #24.\n\n","date":"February 8, 2012 at 5:20 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8070","author":"Gabriel","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"I think normally gold leaf is applied to a surface that is first covered with size (animal skin glue). So any fiddly details that have to done (eg illuminated lettering) is usually done by brushwork of the size glue and when dried to a suitable level of tackiness, the gold leaf is laid down and any excess not adhering to the size underneath is brushed off easily. The point being is that the size is not particularly thin, even if the gold leaf is. However one could argue that size might be diluted down very thin, so when it dries it becomes a thin layer. Which leads on to what I remember of Ray Roger’s theory that about the image layer (forgive me if my memory serves me wrong and please correct if you know better):\n1)the linen material was washed in some liquid for softening (cant remember exactly the reason), and left to dry.\n2)the water dries from both the front and back surfaces of the sheet, transporting the solute material (within the water solvent), to the upper most parts of the threads where evaporation is greatest, and slowly leaving the solute residing on the top creasts of the threads. This explains the thinnest of the image layer and its apparent appearance mainly on the creasts of the upper most sub-fibres. Apparently this layer can be removed by scraping or adhering to tape.\n3)Ray then proposed another theory regarding the image formation onto this thin layer by the Maillard reaction caused by vapour given off by a decomposing body (which apparently heats up causing some sort of convention current) within a very still air cavity. This seemed a bit more wacky to me as it didnt seem to have the necessary resolution, but then I remember from my josh stick days that whilst studying in a very still room, I was astonished to see a thin vertical line of smoke extend at least 20 cm from the burning stick before turbulence set in. Ray apparently have done some tests on a heated hand manikin and got encouraging results before he pass away. 4) the vapour also permeated through the cloth and again was able the react (less strongly), with the solute material again residing on the thread crests of the other side of the cloth (hence explaining the faint other image). 5)though I dont think this explains the bottom image ( as the convection currents work in wrong direction) unless that is all due to surface contact. Nice enough theory…worth further investigation to see if it has any more mileage\n\n","date":"February 8, 2012 at 6:52 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8072","author":"ArtScience","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"@jk\nMore fancy footwork. I too have little time to debate with those who engage in fancy footwork…\nSee my earlier comment on “XYZ denialism”.\n\n","date":"February 8, 2012 at 11:46 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8052","author":"sciencebod","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Yup, I tend to agree with you Dan. I don’t think the Shroud was a side-effect of the resurrection, but that the image was formed as a deliberate miracle of its own, sort of like the changing of water into wine, such that no theory that tries to explain it as a “side-effect” or “byproduct” of something else, even if that something else is another miracle, can explain all of the salient properties of the result.\n\n","date":"February 8, 2012 at 12:07 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8054","author":"The Deuce","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"I do not know what caused the image on the shroud but I know it shows the Passion of Christ. I am inclined to suspect that the image was a product of a natural phenomenon as yet not understood (also, didn’t Rogers rule out a scorch?). I am inclined to believe that the shroud does not show the Resurrection but I am in awe of the fact that we have an artifact from the most famous execution in all Man’s history documenting it. The fact that you have such tangible evidence from this historical event should make anyone pause to reflect what the probabilities are that we would have such an object from such a time. Is there a message that comes with such an improbable object even if it was formed naturally?\nOne thing is clear, the cloth once wrapped a Body and that Body is now no longer wrapped in it. His followers testify that He walked out of the tomb under His own power and ascended to heaven before their very eyes. They were not afraid of death to spread that information. They had more than the gift of Faith, they knew what awaited them after this life.\n\n","date":"February 8, 2012 at 12:47 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8055","author":"Chris","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"In the hypothesis the Shroud is rabbi Yeshua’s, a providential event such as the recording of his body-and-blood image on the long linen cloth shall not be mistaken for a supernatural phenomenon!\n\n","date":"February 8, 2012 at 1:54 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8056","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"correction: “shall no be mistaken for THE RESULT OF a supernatural phenomenon”.\n\n","date":"February 8, 2012 at 2:00 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8058","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"What will you say then about the Jospice mattress?\n\n","date":"February 8, 2012 at 1:57 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8057","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"After reading much on this after Helmut’s urging it became abundantly clear to me that the mattress image was most likely a contact image made by blood highly influenced by the cocktail of chemicals administered to the patient. For lack of a better phrase it seems to be a fused stain. This was evident to me by the fact that in image area scrapings blood constituents were detected on the fibers while non image area scrapings did not show any blood constituents on the fibers. The mattress image in my understanding is not comparable to the shroud image because it does not have the same physical and chemical properties. \nWhat is also implied by what I read about the mattress image was that the person need not have been alive when the image on the mattress was formed. I found that interesting because Helmut does believe that a live body is what was needed to make the shroud image. I find the unsmeared state of blood stains on the shroud to be evidence against this as I believe Helmut held forth that Jesus’ crucifixion survival would have been uncovered rather quickly while preparing Him for burial. And at that point Jesus would have been secreted away for recovery. I would think that the shroud would look highly smeared would that have been the case and in that case that Jesus survived in the tomb for any length of time the shroud would have been soaked with far more blood than we see. Either way, the mattress image is irrelevant.\n\n","date":"February 8, 2012 at 2:53 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8061","author":"Chris","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Chris you wrote: “the mattress image is irrelevant”? Is it really? Shall I remind you it is a 3D superficial image like that of the Shroud? Shall I remind you this is still an unexplained mystery like that of the Shroud image?\n\n","date":"February 8, 2012 at 3:36 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8065","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Correction: “a 3D encoded superficial image”\n\n","date":"February 8, 2012 at 3:42 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8066","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Although I don’t subscribe with Helmut’s hypothesis, I did read many cases of people buried alive presenting all the signs of the rigor mortis.\n\n","date":"February 8, 2012 at 3:55 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8068","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Correction: “AlthoughI don’t subscibe TO Helmut’s hypothesis”\n\n","date":"February 8, 2012 at 3:56 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8069","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Dan, will you also say Mr Les made “a quantum leap” on his mattres?\n\n","date":"February 8, 2012 at 2:15 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8059","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"(it was just for the sake of humouring you)\n\n","date":"February 8, 2012 at 2:28 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8060","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Steve wrote: “2) the blood clots which were adhering to both the body and the cloth are unbroken”.\nHow can he be so sure remoistened blood clots were STILL adhering to the soaked interior linen cloth (ie the Sroud) AFTER a possible drying up during the burial ritual?\n\n","date":"February 8, 2012 at 3:14 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8062","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Cannot a linen soaked with a watery solution gradually loosen from a wounded body through heating and evaporation?\n\n","date":"February 8, 2012 at 3:19 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8063","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"@Gabriel\nJust a quick response to the first part of your comment, since I think I have been misunderstood. The reason for my mentioning gold leaf, leaf please note – i.e. gold hammered out  – was to point out that whilst 200nm is extraordinary thin, it is a thickness that can still be handled, eg  picking it up on the end of a brush, applying it to illuminate a manuscript etc.  I have never suggested that the Shroud image was painted, being satisfied there is no compelling evidence for traces of pigments. What I find impossible to comprehend is the rejection of scorching on the most trifling of objections, chief among which, and apposite to this comment is the superficiality of the image, and its thickness being that approximating to single plant primary cell wall. If a 200nm thickness of gold, representing a few hundred gold atoms, is sufficient to make a surface reflective, why should anyone be surprised that a similar thickness of scorched carbohydrate is able to absorb a little of the blue component of white light, sufficient to give a faint yellow or brown coloration? There is absolutely no doubt in my mind that the Shroud image IS a scorch, and elsewhere I have detailed how I think it was produced by thermal imprinting from a heated 3D or semi 3D object relying on heat conduction (not radiation) where cloth is forced to make contact under applied pressure into a sand bed with hot metal. Such a process is able to explain why scorching is so highly localised, and can also explain other features – the creasing of the cloth at the chin and top of the head, the “over long” neck, which is due to thermal printing off the underside of the chin as well as the neck, making the latter seem as much as 10 cm longer than was really the case.\nI believe John Jackson was 90% of the way to a correct answer when he did his experiments with a hot statue and showed that the scorch image had “encoded 3D information”. I have merely added the sand bed to make the system more ‘technician-friendly’ – ensuring rapid and fairly complete apposition of cloth to hot metal around all the important contours to get a detailed imprint. Thermal imprinting can even provide an answer to the “double image”  problem- recalling the fainter image on the opposite side of the linen but not the intermediate cellulose fibres, but I shall save that for another day, after posting it first to my own site. I wish Raymond Rogers were still around to see it. I’d be interested to hear his response.\n\n","date":"February 8, 2012 at 6:28 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8071","author":"sciencebod","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"A  lot of experiments (including ENEA`s) have obtained partial results reproducing only some of the aspects of the image. Several types of scorching have been one of the most widely used attempts (Garlaschelli et al.).\nI would like to know which the results of your experiment are at fiber level. I mean, are you able to colour one fiber and not the next, while providing at a certain distance a 3D effect attributable ONLY to the density of affected fibers by unit area?If with your method you could obtain that, you would be  making an important contribution to the identification of the mechanism involved.\n\n","date":"February 8, 2012 at 7:37 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8073","author":"Gabriel","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"1. Colin is persisting with his scorch theory, although I understand that the ENEA team have ruled that one out.  I think he has yet to answer the question put by Dan (I paraphrase), “Can he or anyone else deliver a scorch mark that only penetrates the fibres by 200nm?” I can’t see how anyone before the 14th c would have the operational control to produce such a thin image.  We have never heard of a 14th c industry in generating scorched images.  If anyone had discovered such a method, they would have become medieval millionares .  But the Shroud is unique, and there’s nothing else like it, only painted copies!\n2. Any metal model, to produce a scorched image, would have to be life-size, and realistic, contrary to all other art forms of the time, and it would have to be of a crufixion victim in death, with all the features of the Shroud image. It would surely be a memorable object, but there’s no record of any such statue in all of art history.\n3.  Colin says the image would need to be by conduction and not radiation.  If it was by scorching, this would probably be true.  To scorch the image by radiating heat, it would need to be IR, but IR radiation has too long a wave length and would penetrate the fibres.  So it would have to be UV for 200nm penetration as ENEA found.  But Newton didn’t discover the light spectrum until the 17th c, and discovery of IR & UV came much later.\n4.  The model for the Shroud had to be human, a crucifixion victim and dead.  Corruption around the body orifices commences within 40 hours of death.  But there’s no sign of corruption apparent on the image.  Therefore the image was formed not more than 2 days after death and the body then removed.\n5. The identity of the crucifixion victim can only be Rabbi Yeshua (Jesus), as no other crucifixion victim was made to wear a crown of thorns, (mocking claims to be “King of the Jews”) apparent from the images of blood spots around the head, nor had his legs unbroken, scourged and pierced with a lance.\n6.  Contrariwise, there is a strong historical trail of at least one cloth with an image of Jesus dating no later than the 6th c.  But not even the clever Byzantines were in the scorched image business.  Surely that has to be “Checkmate!”\n\n","date":"February 8, 2012 at 11:38 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8079","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"There are simple experiments that one could do at home that can give one first hand experience of thermal printing, and, what’s more impress on one (no pun intended) the imperatives that go with the process. The chief one is that PRESSURE is needed on that ‘branding iron’ or other 3D object, if the  latter is at a temperature well below red heat, say mid-200s Celsius to get a good sharp imprint. That’s because hot agitated metal atoms with their delocalised cloud of electrons really do have to make actual contact with the atoms within the surface of the cloth. No air gap is permissible, not even 10nm. One can see this by looking at a light scorch mark under a magnifying glass, or even with the naked eye – only the crowns are scorched, where one fibre loops over another (weft over warp or vice versa). I cannot stress too strongly that scorching by contact/conduction process is an EXCEEDINGLY localised process, and fully capable of affecting only tiny thicknesses of fibre at the surface, even as low as 200nm or less (but which is not really that “thick” at the atomic/molecular level). Surface chemistry often involves much thinner layers giving major changes in physical and chemical properties (see my earlier reference to the natural oxide film on aluminium). It is the sand bed in my refinement of the Jackson strategy that provides that essential physical, non-chemical ingredient – MECHANICAL PRESSURE – and which will, I suspect, provide an aid to confirming, or at any rate supporting,  the theory that the image was formed by contact/conduction. The  3D-encoding in this theory is due as much if not more to the distribution of differential pressure between cloth and template as it is to simple differences in physical relief.  A flat surface within a hollow, e.g. an eyelid, would image poorly based on miraculous high energy radiation assuming the inverse square law still operated but images perfectly well if cloth is forced into an eye socket so as to make contact with an “eye lid” or representation thereof that is approximately square on to the cloth allowing compaction of cloth against metal- allowing actual zero-gap contact to take place. Yup, plain old heat conduction – bit of a far cry from quantum, subatomic “now you see it, now you don’t” physics.\n\n","date":"February 9, 2012 at 2:20 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8080","author":"sciencebod","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"PS  The ENEA team had no business ruling anything out – certainly not on the basis of their Mickey Mouse checklist. Bunch of jokers – the lot of them. If there were a means of excommunicating them from science, I would be pushing for it…\n\n","date":"February 9, 2012 at 2:46 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8081","author":"sciencebod","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"1. Dan, Colin’s lucid explanation of his low temperature (200C) thermal printing process, its requirements and effects has to be one of his better blogs on this site.  It’s a pity he had to add the ad hom rider describing ENEA as Mickey Mouse – it’s unnecessary and doesn’t help.  Some things that we might think are better left unsaid, if we want to win a logical argument!\n2. The next question has to be: “Does the thermal printing process he describes give the same RGB values as those on the Shroud?” That was one of the points that ENEA made, but it may require some fairly sophisticated spectroscopic analysis and equipment to measure this, probably beyond the resources outside of a physics laboratory. It might be possible with coloured filters.\n3.  Allowing that thermal printing would work with a metallic object, I doubt if I can be persuaded that the model for the Shroud was any kind of metallic statue.  It lacks a metallic look. It beggars belief that anyone, even an enthusiastic relic forger, would ever commission such an object, which would be even more impressive than its mere image on a cloth,  Despite the achievements of classic Greek statuary, there was not the knowledge available to reproduce the anatomical accuracy of the crucifixion victim on the Shroud. There’s no record of such an impressive object!\n4.  The third question therefore has to be: “Will low temperature thermal printing work with an organic object?”  It would need to be a good deal less than 200C, (which would sizzle a beef steak); 100C would cause blisters!  Can a thermal printing of an organic object be produced in under two days?  Can it be carried out with a laboratory rat for example? Dried flora will produce an image under pressure eventually, but it takes a very long time.\n5.  And all of this is without even mentioning the accuracy of the blood flows, wrist nailing and its effects, contamination from dust, pollen and cotton, the historical record, and everything else that makes the Shroud so unique, for those of us who have had the open-minded patience and dedication to be so informed.\n\n","date":"February 9, 2012 at 7:53 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8087","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"How long will Stephen Jones, a Christian, adamantly stick to John Jackson’s archeologically and exegetically flawed reconstruction of Rabbi Yeshua’s burial and rising from the dead? As the most likely reconstruction of Yeshua’s burial, the late ancient Greek version of the Gospels in conjunction with the Shroud implies the long interior shroud (Heb. sadin), soaked with a watery solution, to be first tautly wrapped (Gr. enetulixen, Matthew 27,59) lengthwise around the stiff rigid blood stained body and the latter thus wrapped to be then compressed (Gr. eneilesen, Mark 15,46) and fastened (Gr. edesan, John 19,40) width wise with medical plants and flowers (Gr. aromaton) in a veil, a shorter shroud the size of a prayer shawl (Heb. tallith) or a lengthy sheet (Heb. sovev).\n\n","date":"February 9, 2012 at 10:45 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8095","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"1.  Although his description is fascinating, I’m not sure that Max can be so certain as to the method of burial of Jesus.  I’m guessing that his “late ancient Greek version” probably refers to the Constantinople “Textus Receptus”.  Earliest full text is Codex Vaticanus with C Sinaiticus a close second, both 4th c.  There are several earlier fragments, mainly Alexandrian or possibly Coptic. There are also Syriac versions. Early canons of scripture were being formulated by about 200AD.\n2.  We need to remember that it was the day before a very special sabbath, as in that year  Passover fell on this sabbath (April 28, 30 AD according to John P Meier’s reckoning – “A Marginal Jew”),  The gospels say that Joseph of Arimathea went to Pilate to beg the body of Jesus in the evening, so that the sabbath had virtually begun already.  The burial work had therefore to be done hastily, including purchase of a shroud.\n3.  The Synoptics all say that the Galillee women witnessed the burial.  Earliest gospel Mark has Mary Magdalen and Mary mother of James purchasing spices on Sunday morning to annoint him, corroborated by Luke who has the women going off to prepare spices.  If he was already tied up as Max asserts, why would the women do such a thing, unless they merely intended making up for some missed ritual.\n4.  Only the latest gospel John has Nicodemus coming with Joseph, bringing a mixture of myrrh and aloes, about one hundred pounds (a fairly weighty concoction).  John says they toook the body of Jesus and wrapped it with the spices, and adds the gloss “following the Jewish burial custom”.  Maybe this gloss was added to satisfy his Jewish readers, and perhaps we should not read too much into it.\n5.  If in their haste, the 100 lb of spices were laid over the shrouded body, instead of being wrapped with the body, I wonder if this would create enough pressure to produce a thermal image described by Colin.  It might explain why the women returned on the Sunday morning to complete the work. Alternatively if the body was wrapped tight in a water soaked sheet as proposed by Max, would this create enough pressure.\n6.  Maybe we should accept that it was some kind of miracle, after all.  Some aspects we can definitely know, some we may know in time;  others we can guess as probably true, or have an opinion on.  But there remain aspects where we can only ever say “We do not know, and never will!”\n\n","date":"February 9, 2012 at 5:34 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8103","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"RECEIVED IDEAS DIE HARD\nDave you think Rabbi Yeshua’s burial was done in haste (in half-an-hour?). This is a received idea. In my 1998 Turin paper, I demonstrated the Shroud man burial time frame should be reconsidered in the light of « the midday night » (through the eyes of a Judean of the first Temple period, there were two nights and two days on that very day). Actually, two hours and a half as a minimum burial time frame is a much fairer estimate than just half-an-hour.\nYou also wrote: “The Synoptics all say that the Galillee women witnessed the burial. Earliest gospel Mark has Mary Magdalen and Mary mother of James purchasing spices on Sunday morning to annoint him, corroborated by Luke who has the women going off to prepare spices. If (Rabbi Yeshua) was already tied up as Max asserts, why would the women (prepare spices on Sunday morning to annoint him), unless they merely intended making up for some missed ritual.” This is another received idea.The women’s visit to the tomb on the following Sunday is to be read in the light of a specific Judean tradition which consisted to pay visit to the deceased during the week that followed his death. The use of (liquid) perfume here was just to prevent bad smells (to soak the deceased’s wrapping linens with)\nThe bloodstains on the Shroud look undisturbed. In Steve’s eye, the very fact that the Shroud was not removed from the body during the image formation process is a “clear” sign of resurrection.  Is it really so? Couldn’t this “clear” sign of resurrection just be another pro-Shroud authenticity Christians’ received idea? Is it impossible for a previously tautly wrapped Shroud (soaked with water mixed with ashes) to just separate from a remoistened blood stained body through gradual pressure release? Couldn’t a tightly wrapped up stiff rigid body resting first on the left and then on the right side and in extra height on two stones and being subjected to a myrrho-aleotic fumigation be a much more fitting scenario? Through evaporation and gradual pressure release, the interior shroud (soaked with a watery solution) could have gradually lost contact with the blood stained body. Owing to the purifying and drying up ritual,  blood could not have time to cement to the shroud. Couldn’t “a direct contact/gradual loss of contact mechanism” be a much more naturalistic explanation?\nIn a recent post I wrote :\n  “In accordance with the halakha (religious rules), any Judean dead of a violent death was to be buried “with his bloods”. In case of shed of innocent blood by the Sanhedrin, just because such innocent blood could not be atoned, it should also be purified.\nMost obviously, the Man of the Shroud’s body (still in hyperthermis) was not directly washed. Most probably his interior burial sheet was all soaked with the waters of Red Heifer or Cow (ritual ashes mixed with pure living water) and his tightly enshrouded stiff body placed first on his left side and then on his right side (at head and knee level?) upon two stones and in extra height above a slab to be submitted to a myrrho-aloetic fumigation as if the man of the Shroud were a prince or a notable. Such a specific taharah or ritual purification might as well account for the “weightlessness effect”, part of the 1988 wrong official carbon 14 dating and the overall formation process of the body image (with such neat and almost fresh-looking blood imprints on the linen fabric). Since the double imprint might well result from an overall gradual pressure release of the soaked long interior linen cloth drying up next to the crucifixion victim’s stiff body, a project in experimental archaeology would be most appropriate to reconstruct this specific late ancient Judean burial rite.” (January 20, 2012 at 11:25 am | #31)\n\n","date":"February 10, 2012 at 1:43 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8112","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Coorection: “(still i hypertherma?)”\n\n","date":"February 10, 2012 at 1:47 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8113","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"CO-Correction: “(still in hyperthermia?)”\n\n","date":"February 10, 2012 at 1:48 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8114","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Late antique spices (Gr. aromaton) can come from all types of plants and parts of plants. They can be either liquid (i.e. diluted in olive oil) or solid (i.e. dried and ground into a fine powder, solidified into a block or fresh). Besides myrrh and aloe (in powder and blocks), Rabbi Yeshua’s buriers might well have also used as “aromaton”, Chrysanthemum coronarium fresh heads since they have antiseptic (anti putrefactive), antifungal and antibacterial activities that help in corpse preservation. To say nothing of the symbolical value of such a flower head the Second tempe period.\n\n","date":"February 10, 2012 at 2:30 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8116","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"correction: “”in the Second Temple period”.\n\n","date":"February 10, 2012 at 2:31 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8117","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Max, I searched for your earlier quoted blog, Jan 20, 2012, #31, but don’t think I succeeded in navigating to it.  But to cut to the chase, re suggestion for Archaeology experiment:\nSurely it would be a fairly simple matter for an adequately equipped laboratory, to carry out a range of starter model experiments using recently slaughtered carcases of small animals, say lambs, calves, piglets, rabbits or even plucked chickens.  They could be tightly wrapped in water soaked linen cloths, along with a myrrhic-aleotic mixture, and then checked after say two days.  A range of control variables could be used say, binding / no binding, water soaked / dry, etc.  Fur might be a problem.  I offer this suggestion seriously and certainly intend no put-down.  Honestly, no tongue in cheek.\nIt should have been looked at years ago.\nI note that there is no corruption around Shroud man’s orifices,so body was removed no later than two days after death.\nTechnical point:  Doesn’t wetted linen or cord shrink on drying, so that pressure would actually increase, rather than being released as you suggest?  Maybe the experiments would need to be left in a darkened room to retain any image that might be obtained,  I look forward to a positive response.\n\n","date":"February 11, 2012 at 11:38 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8159","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Dave, don’t you forget the main issue here is to check out the direct contact-gradual loss of contact mechanism triggered off through cloth specific pressure release. It is not that simple as every minute details here count: use of purifying ritual ashes mixed with pure living water; soaking of a 3/1 twilled white lengthy interior shroud first TAUTLY wrapped lengthwise and then COMPRESSED width wise (in a veil, a shorter shroud about the size of a Judean prayer shawl plus two or three linen strips); use of fresh plants and flower heads laterally compressed, next to the skin, in the linen cloths; use of human sweat and blood. Moreover, at least three different scenarios should be investigated (with and without hyperthermia, with and without myrrhic aleotic fumigation) which means the use of at least six replica of the shroud in all (three hand-made and bleached according to the late antique fashion and three according to the medieval fashion) as a second most important issue should also be checked out: Ray Rogers’ “impurity thin film” theory.\n\n","date":"February 12, 2012 at 9:25 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8170","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"The best way to archeologically experiment would be to hire a first century c.e. tomb in Jerusalem and use it early in april.\n\n","date":"February 12, 2012 at 9:34 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8171","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"A mime artist with realistic make-up who can pose like a living statue or mannequin for hours would be needed.\n\n","date":"February 12, 2012 at 10:01 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8172","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"A piece of pipe with a diameter small enough to put into his mouth woud help him to breathe in and out.\n\n","date":"February 12, 2012 at 10:14 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8173","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Correction: “A piece of pipe with a diameter small enough to put into his mouth without hurting his jaw. It should, however, make him open his mouth wide: about as wide as an average yawn to help him to easily breathe in and out.”\n\n","date":"February 12, 2012 at 11:16 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8176","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"The lenghty interior shroud would be the only piece of linen to be soaked with the watery solution. Actually the resilience of a wet linen cloth can be mechanically increased through manufacture (e.g. that of a 3/1 twill weave).\n\n","date":"February 12, 2012 at 10:23 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8174","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Dave , you have to remember a few important facts: the lenghty interior shroud  was previously TAUT before being compressed; a very strong rigor mortis of the arms had to be counteracted; there were fresh plants and flowers laterally compressed in the lenghty shroud and during the image formation rocess, the stiff rigid body was placed first on his left side and then on his right side upon two stones and in extra height.\n\n","date":"February 12, 2012 at 10:31 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8175","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"My suggestion was for a starter pilot experiment using recently slaughtered small animals to see if it was at all worthwhile proceeding to commission the more ambitious project, which would then preferably use recent uncorrupted human cadavers, rather than live mime artists.  The smaller pilot experiment would allow a wide range of variables to be tested before proceeding to the full project.  I think the credibility of the theory, and optimum conditions needs to be tested/discovered first.  Otherwise you’re likely to get either negative or inconclusive results.  Meantime I suspect we may just be whistling in the dark.  Using a live model might not satisfy an essential requirement of the situation.  Despite the gloss “… following the Jewish burial custom…” of John 19:40 (only place where this is mentioned) we don’t know if this was strictly accurate or just merely to satisfy his Jewish readers/congregation.  There was probably something they missed doing. A very wide range of variables needs to be tested, hence small animals first.  It’s all very well having a theory about how things were done, even if it matches legislative/customary prescriptions, but what if it didn’t happen that way? You’ve then wasted a lot of experimental effort.\n\n","date":"February 12, 2012 at 3:49 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8179","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"When one does think (at 90%) that one of the three possible scenarios makes archaeological, exegetical, physical and chemlcal sense in the light of the Turin Shroud and thus might well be THE scenario, one must not spare his experimental effort and take risks whether financial or in terms of professional credibility.\n\n","date":"February 12, 2012 at 6:27 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8181","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Dave you wrote: “…preferably use recent uncorrupted human cadavers, rather than live mime artists”. I don’t share your idea unless… it is the deceased’s expessed will. In the same way, we can also recur to a Shroud man latex replica of desired rigidity and flexibility.\n\n","date":"February 12, 2012 at 6:52 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8182","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"…and weight.\n\n","date":"February 12, 2012 at 7:04 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8183","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Max, I would doubt that a latex replica or other mannequin would work.  You’d be assuming that the only reactants, (presumably chemical, possibly physical) would be a moistened linen cloth and a myrrhic-aleotic concotion; you’d be saying that an image might be formed by their mere close contact with any geometric interface.  Even a photograph requires photons impacting on the subject and we can’t be talking photons here.  You’d be ignoring the possible effects of body emanations, gases and fluids, which might well be involved if there’s anything in this theory.\nI think the best bet would be to try it out on laboratory rats or rabbits first, they might need to be partly shaved of their fur.  My translation says Nicodemus brought 100 pounds of his mixture.  Assuming it was all intended just for the one burial (which seems a very large amount) that would be about 40% of the body weight for modelling purposes.  What about the two thieves who were also executed?  To comply with the required rituals, maybe some of the concoction was also intended for them as well,  In which case it might only be 13% of the body weight.\nIncidentally, do we know if there are any balsam/gum/resin (myrrh) and aloe residues on the Shroud?  I haven’t yet checked that out.  I would think it imperative for experimental purposes that the subject models be recently dead, preferably with some blood letting, if it were to have any chance of success,\n\n","date":"February 13, 2012 at 1:22 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8188","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"First remark: Dave you still don’t discriminate between the Judean funerary use of different spices and oily spicy perfumes/ointments. Rabbi Yeshua was laid on the stone bench of the tomb’s unique (Heb. aHad) funerary niche (Heb. kokh, maqôm). It was full of mixed and pulverized or granulized myrrh and aloes (of which micro traces can still be detected on the pre-burial napkin (Aram. soudâra) known as the Sudarium of Oviedo). His corpse was fastened, with FRESH medical plants and flower heads (Gr. aromaton), in linen cloths/sheets. These plants and flower heads shall not be mistaken for the blend of spice (aloes) and perfume (myrrh) used to fumigate his corpse (drying up) and make an aromatic bed of the tomb stone bench. In my 2010 unpublished Frascati paper I wrote: “Fresh flower heads of Chrysanthemum coronarium with ligulate florets have not only antiseptic, antibacterial and antifungal activities but also are good fly repellent. One shall remember here that the ancient Greek word aromaton, used in John 19:40, means spices in terms not only of herbal perfumes and incenses but also of aromatic or medicinal plants and flowers.”\n\n","date":"February 13, 2012 at 9:13 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8193","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Second remark: according to my theory, the image formation process happened during the stiff rigid corpse purifying and DRYING UP ritual. Thus it happened SHORTLY AFTER the crucifixion victim’s death (see my 1998 Turin paper). The only body fluids to be taken here into account are human sweat and blood in conjunction with possible hyperthermia. The Shroud shows no sign of metastatic gas emanation.\n\n","date":"February 13, 2012 at 9:40 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8194","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"It would be relatively easy to vaporize sweat over and anoint blood on latex replica or a mime artist’s body and make up realistic wounds.\n\n","date":"February 13, 2012 at 10:02 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8196","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Third and final remark: in my burial reconstruction, the Turin Shroud is the lengthy INTERIOR shroud e.i. the least likely linen sheet/cloth to be in DIRECT physical contact with the myrrh-and-aloes-covered tomb stone bench.\n\n","date":"February 13, 2012 at 9:52 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8195","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Max, you’re still working from the hypothesis that everything was done according to the religious prescription governing burials of those who died a violent death.  We can’t know that the prescription was precisely followed in all its strict detail in this case.  Rabbi Yeshua himself, in his teachings, seemed disposed to dispense with the full rigor of the Law.  E.g. He seemed to differentiate between that given by Moses (Leviticus), and those aspects which seem to be later add-ons.  He touched lepers, he cured on the sabbath, and allowed his disciples to garner corn on the sabbath, he associated with all sorts of doubtful persons, publicans, prostitutes and other sinners.\nBUT, supporting your principal assertion that creation of the image may not have been a Resurrection phenomenon, check out the following 1997 paper, if you’re not already aware of it:  “The Image Formation Mechanism on the Shroud of Turin: A Solar Reflex Radiation Model (the Optical Aspect)” by Serge N. Mouraviev.\nYou can find it at: http://www.shroud.com/pdfs/mouraviev.pdf\nI’m presently unaware of any reviews of the paper (perhaps you’ve come across it before), so can’t comment on its credibility.\nMouraviev’s main thesis is that the myrrhic-aleotic mixture made the linen photo-sensitive, and that the wrapping was done in the open, in the full light of the afternoon sun.  The sun’s parallel rays penetrated the translucent shroud, were reflected off the moist sweaty, bloodied body and absorbed by the photo-sensitive interior layer.  He carried out a few elementary experiments, obtaining some blurry images which he claims supports this thesis.  There’s much more, including obtaining a 3-D aspect.  He asserts that the body was laid on its back, which gave its frontal image, and then turned over to give the dorsal image.  It accounts for why there is no lateral image, and why there are minor discrepancies between both images.  In other words, two separate images were formed.  The relative movement of the sun during these operations, would have little effect in blurring the image.\nIt shoud be possible to simulate a small-scale experiment in the lab using a suitable light source for the sun.  If he’s correct, you don’t need a full-scale model, but the model does need a reflective surface.\nOne reservation is that M’s experiments gave blurry results, but the Shroud image is sharp.\nI’d be interested in any comments on Mouraviev’s paper.\n\n","date":"February 13, 2012 at 4:01 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8203","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"A variant on the above:\nYou say that the body was laid first on its left side and then on its right.  Mouraviev’s assertion seems to assume that the sun was more or less overhead, requiring the body to be laid on its back and then on its front for an image.  It seems likely that the burial work would have been done in the late afternoon when the sun would be low in the WSW direction.  If the body was laid out lengthwise more or less north-south, then laying the body on its left side might produce one image, and laying it on its right side, would produce the other. Question would have to be if the sun was then bright enough to produce the images.\n\n","date":"February 13, 2012 at 5:04 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8204","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Dave you wrote: “Max, you’re still working from the hypothesis that everything was done according to the religious prescription governing burials of those who died a violent death.” Don’t you forget Rabbi Yeshua was buried by, at least, two Hakhamim (members of the Sanhedrin and doctors of the law who were secret disciples of Yeshua and, most likely, Hellenistic liberal Pharisees). They did know about the halakha (the Judean religious law). This is most solid ground on which to reconstruct Yeshua’s burial.\n\n","date":"February 13, 2012 at 5:12 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8205","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Most likely, the corpse was not prepared outside in the open as claimed Mouraviev but on a slab inside the tomb antechamber to say nothing of the fact there was darkness till late in the afternoon on that day.\n\n","date":"February 13, 2012 at 5:19 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8207","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"A sun image would have faded long ago with time.\n\n","date":"February 13, 2012 at 5:23 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8208","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Correction: “Besides, even in the case of a sun image, such an image would have faded away long ago. It just would not have lasted with time.”\n\n","date":"February 13, 2012 at 5:28 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8209","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"1.  I’ll buy into the Hakhamim / halakha argument; the two of them would certainly know what was prescribed by Law, and they’d no doubt be cross-checking with each other.  Possibly circumstances could make a difference, and it could still be hurried.\n2.  Both Matthew & Luke get the darkness from Mark, with just Luke saying it was a solar eclipse.  Problem is, you can’t get a solar eclipse at Passover time, there’s a full moon; Lunar eclipse Yes; Solar eclipse, No.  Maybe it was a high-flying dust cloud, or else just a dramatic gloss.  John doesn’t mention it.\n3.  “… darkness from the sixth hour until the ninth hour …” that is from mid-day to 3:00pm, That leaves about 3 hours of possibly bright daylight in latter half of the afternoon, but he’s not being taken down from the cross until after 3:00pm, get permission from PIlate, get Shroud, myrrh, aloes, transport body.  It has to be very late in the afternoon.\n4.  Full moon rises ~5:30pm to 6:30pm, dark in the tomb, light outside where they can see what they’re doing.  Third star slow to appear because of full moon, so the work has to be over by about 7:30pm because of sabbath.\n5.  We don’t know the stability of a solar-caused image, on myrrhic-aleotic photo-sensitised linen until we’ve tested it.  Otherwise you’re saying that a non-solar chemically-caused image would be more stable. Non sequitur!\n\n","date":"February 13, 2012 at 7:28 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8212","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Through the purifying-&-drying-up ritualistic process, a “natural mordant without dye” might well have oxidised the thin colourless layer of starch fractions, various sugars and other impurities coating the internal side of the lengthy linen cloth. Such a resulting “natural mordant caused image” would then be much more stable than a solar image chemically caused between 15:34 to 18:08 (maximum time frame) Friday, 7th April, 30 c. e. in Jerusalem.\n\n","date":"February 14, 2012 at 4:22 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8242","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Correction: 18:38\n\n","date":"February 14, 2012 at 5:15 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8243","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"The darkness on Rabbi Yeshua’s crucifixion day might well be the result not so much of a lunar eclipse than of the Khamsin or chamsin also called “The black breath” of the desert of Judeah. This dry, dusty wind would have plunged the city of Jerusalem into darkness.\n\n","date":"February 14, 2012 at 5:17 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8244","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"1.  Thanks for the comment about the chamsin.  I’ve always found the solar eclipse interpretation too incredible.  At full moon, a lunar eclipse may or may not have occurred, can easily be checked or calculated for 7th April 30 CE, but is likely to be irrelevant.\n2.  Regarding physio-chemical theories of image formation, with or without solar light, we’re whistling in the dark until someone does some modelling.  They don’t have to be full size human scale as I’ve said before.  Mouraviev’s paper is the only source I’m presently aware of, but there may be others.\n\n","date":"February 14, 2012 at 6:08 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8247","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"3.  Mouraviev’s theory accounts for why there is no lateral image, and minor discrepancies between frontal and dorsal images.  How otherwise can you account for absence of lateral image?\n\n","date":"February 14, 2012 at 6:13 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8248","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Dave, between 1975-1990 (e.i. well before Mouraviev’s solar reflex radiation theory), Rodante conducted two different sets of experiments (with and without solar light impacting a linen sheet soaked first with a watery and then an oily myrrhic-aloetic solution). See his book and his Siracusa paper.\nIn my burial reconstruction; the absence of  lateral image can easily be accounted by the very fact medical/aromatic plants and flower heads were laterally compressed to the corpse wrapped in the lengthy shroud.\n\n","date":"February 15, 2012 at 6:52 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8274","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"Correction: “can easily be accounted FOR by the very fact…”\n\n","date":"February 15, 2012 at 6:59 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8275","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why do we think the Resurrection was a process? What if it was not?","post":"More corrections: “In the years 1975-1990 (i.e. well before Mouraviev’s theory)\n\n","date":"February 15, 2012 at 7:35 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","id":"comment-8281","author":"Max Patrick Hamon","site":"shroudstory"}]
