[{"title":"Why the images and bloodstains were not painted on","post":"This is what isotropy means, a basic, well known property of the Shroud image.\nI hope we won’t re write the whole data set simply because Charles thinks it’s a painting, boring.\n\n","date":"November 11, 2014 at 5:56 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170587","author":"anoxie","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Charles Freeman:\nI once challenged the skeptics to identify an analogous work of art to the Shroud. No response.\nLet’s renew the challenge a little more broadly. Identify ANY painting or “daubing” or such from medieval times that under FTR will not exhibit direction as explained by Lynn-Lorre in 1977.\nYou stated that your preferred method of “painting” or daubing or whatever would not exhibit direction. Can you give us one example of any work of art that is painting or daubed or whatever that lacks direction under a Fournier analysis. If you could identify one, then perhaps OK or somebody who has access to the analytical devices could perform an analysis. OK chose what to examine; to be fair, you chose what to examine. Then we can determine if is is fairly analogous to the Shroud or not. \nI want to give you an opportunity to do it. Otherwise your  “historical” analysis is simply a facile pseudo analysis by a pseudo skeptic.\nI use the word “pseudo” in the technical sense as defined on this side of the Pond. That is one who pretending to be a skeptic is in reality is defending a point of view. That is the definition propounded by Marcello Truzzi. I believe I have the right to use American English.\n\n","date":"November 11, 2014 at 7:10 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170596","author":"John Klotz","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Your challenge is misguided. Almost all of the “sceptics” think that the Shroud is not a painting.\n\n","date":"November 12, 2014 at 3:02 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170752","author":"David Mo","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"John- see my reply below. Directionless medieval painting on linen is quite common if the  paint is applied in a fluid form. Examples given in Caroline Villiers book below. It is quite an important point for art historians because if they find paint without any brush marks they then can begin to understand how fluid the solution was when it was applied. So it is something that any conservationist working on a decayed painted linen will examine at the start if they are wanting to work on restoration of the original as it was painted e.g. They will try and reproduce the fluidity of the original paint solution on areas that have faded.\nIt is obvious really that a very fluid solution will dry without any evIdence of direction so I don’t see why it is such an issue ( or perhaps I do have some idea!) It certainly is not for those who have taken the bother to consult introductory books on painting on medieval textiles before they declare themselves authorities on whether there is painting on the Shroud or not.\n\n","date":"November 12, 2014 at 3:26 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170889","author":"Charles Freeman","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"I forgot to check the box that says “Notify of new commenst via email.” Now I have.\n\n","date":"November 11, 2014 at 7:12 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170597","author":"John Klotz","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Extraordinary.\n\n","date":"November 11, 2014 at 11:57 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170629","author":"Mordecai Boone","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Does it really need to be said that STURP proved scientifically the image was not produced by paint?\n\n","date":"November 11, 2014 at 1:11 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170635","author":"Andy","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Those days Church Leaders killed the scientists, and today Historians are trying to do the same thing.\n\n","date":"November 11, 2014 at 6:32 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170669","author":"Sampath Fernando","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"I’m sorry but this work is useless. A lot of relevant data are missing; it is applied on photographs of dubious quality and not on the originals and it forget that the current theories about painting in the Shroud don’t defend a traditional painting, but the rests of a painting not made with the traditional brushes (fingers, ink pads or similar). \nFurthermore, the bibliography is practically nil. I would like to know other studies about directionality and Fourier method (FFT) in the field of History of Art. For example: in the debate about the autenticity of “la Bella Principessa” (see here: http://www.theguardian.com/artanddesign/2011/sep/27/lost-leonardo-da-vinci-portrait#_) there was much talk about the directionality of the brush strokes but I don’t remember nothing about the FFT.\n\n","date":"November 12, 2014 at 2:33 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170747","author":"David Mo","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"It was news to me that “directionality” referred to the bias in brush work direction applicable only to paintings. I thought it had a more fundamental meaning in the context of the TS image, a reference to it’s ‘flatness’ for want of a better term – that being due to there being no indication of an angled light source. At first sight, any illumination from “light” would have to have been non-oblique, i.e  coming from directly behind the viewer.  \nIt’s that out-of-this-world absence of ‘directionality’ to do with  absence of external ‘ illumination that surely sets the TS image apart from standard paintings, even degraded ones, where the artist exploits the fixed oblique angle of incident light to create areas of shade and with it an illusion of real-life form (I hesitate to say 3D-ness since that risks further ambiguity and confusion). Is it any wonder that some see the subject itself as the  source of radiant energy, wavelength usually unspecified, albeit with handy orthogonal projection and ability to ‘scorch’ linen across air gaps, provided (a) they don’t exceed 3.7cm and (b) Occams’s razor is kept in its protective sheath.\nThere are other ways, needless to say, of creating non-directional images with negative  properties. Imprinting off a template is one. The humble rubber stamp serves as an everyday example. Imagine the ink being replaced with real or simulated body sweat, followed by an ageing step, natural or accelerated, imprinting a negative (light/dark reversed) image albeit as a barely discernible yellowing of the linen. But once there, it does not flake off, being a chemical modification of the linen fibres per se. \n‘Faded paint’ can be safely dismissed as a pigment of a historian’s imagination, unsullied by considerations of detailed science, STURP’s especially. (Sorry, couldn’t resist that one).\n\n","date":"November 12, 2014 at 3:24 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170754","author":"Colin Berry","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"I don’t think the OK’s paper is speaking of directionality of the light, because this is a problem that has nothing to do with FTIR (this is what i know in study of fakes of art) or FTT (I don’t know). This is simple question of modelage, that is to say volumetric modelling. And yes, you can see some works of art of the period with frontal illumination. See some details of the chapel of Spagnoli by Andrea da Firenze; http://www.fineart-china.com/upload1/file-admin/images/ANDREA%20DA%20FIRENZE4.jpg\nRemember, please: The Shroud is not intended to be a portrait, but a mark.\n\n","date":"November 12, 2014 at 3:48 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170757","author":"David Mo","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Maybe “directionality” that can occur through 360 degrees of solid angle should be reserved for the direction of light source imputed from the pattern of light and shade. “Direction bias” might be a better term for brush-stroke consistency, though the sooner “brushes” and external pigments are shown the exit from the TS literature the better.  It’s simply a red herring, the latter not a real one of course, but painted, probably with vermilion or some other totally irrelevant pigment off an artist’s palette (or top of historian’s head).\n\n","date":"November 12, 2014 at 4:03 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170767","author":"Colin Berry","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"David Mo:\nFirst you scream insolently:\nI’m sorry but this work is useless. A lot of relevant data are missing; it is applied on photographs of dubious quality and not on the originals and it forget that the current theories about painting in the Shroud don’t defend a traditional painting, but the rests of a painting not made with the traditional brushes (fingers, ink pads or similar).\nFurthermore, the bibliography is practically nil. I would like to know other studies about directionality and Fourier method (FFT) in the field of History of Art. For example: in the debate about the autenticity of “la Bella Principessa” (see here: http://www.theguardian.com/artanddesign/2011/sep/27/lost-leonardo-da-vinci-portrait#_) there was much talk about the directionality of the brush strokes but I don’t remember nothing about the FFT.\nAnd then you bashully admit:\nI don’t think the OK’s paper is speaking of directionality of the light, because this is a problem that has nothing to do with FTIR (this is what i know in study of fakes of art) or FTT (I don’t know)\nIf you cannot differentaite between FTIR (Fourier transform infrared spectroscopy, see http://en.wikipedia.org/wiki/Fourier_transform_infrared_spectroscopy ), and simple FTT (Fast Fourier Transform   http://en.wikipedia.org/wiki/Fast_Fourier_transform ), then I can say only one thing: despite your boasts how smart you are, you are in fact complete IGNORANT .\nRead this: http://en.wikipedia.org/wiki/Art_forgery#Digital_authentication\nStatistical analysis of digital images of paintings is a new method that that has recently been used to detect forgeries. Using a technique called wavelet decomposition, a picture is broken down into a collection of more basic images called sub-bands. These sub-bands are analyzed to determine textures, assigning a frequency to each sub-band. The broad strokes of a surface such as a blue sky would show up as mostly low frequency sub-bands whereas the fine strokes in blades of grass would produce high frequency sub-bands.[15] A group of thirteen drawings attributed to Pieter Brueghel the Elder was tested using the wavelet decomposition method. Five of the drawings were known to be imitations. The analysis was able to correctly identify the five forged paintings. The method was also used on the painting Virgin and Child with Saints, created in the studios of Pietro Perugino. Historians have long suspected that Perugino painted only a portion of the work. The wavelet decomposition method indicated that at least four different artists had worked on the painting\nWavelet analysis is similar technique to Fourier analysis, in fact it is a kind of generalization of it.\nBack to learning, David Mo.\n\n","date":"November 12, 2014 at 4:29 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170774","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"All your bibliography is this paragraph from Wiki? I think I have to find another teacher.\n\n","date":"November 12, 2014 at 5:23 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170780","author":"David Mo","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"That’s all you have to say, David Mo? Go to school, maybe you’ll learn something.\n\n","date":"November 12, 2014 at 5:26 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170781","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Of course FFT not FTT, everyone mispells it, so I also have to…\n\n","date":"November 12, 2014 at 5:37 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170784","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"David Mo,\nAs a matter of fact the analytical device used by Heller and Adler to identify blood on the Shroud was a precursor to the Multispectral Digital Imaging (MDI) used to analyze La Bella Principessa. I discuss Heller and Adler in Chapter 9 of my book, The Coming of the Quantum Christ.\nThe device they used was a microspectrophotometer. (MSP). The MSP produced a digital read out of the spectrum of the object. MDI records the spectrum data in a permanent digital file which is then available for detailed examination. All of the spectra including the invisible ones (infrared and ultra violet) are recorded. In essence, MDI combines the Quad Mosaic information with the spectrum information. The actually photographs until processed are black and white similarly to the Quad Mosaic process. \nThere is an excellent presentation of this information on the Lumiere Technology web site which analyzed both the Mona Lisa and La Bella Principessa. See http://www.lumiere-technology.com/discoveries.html. I include a discussion of Lumiere’s work in Chapter 14 of my book which deals with the Shroud’s provenance. \nThe drum I am beating right now is for the use of MDI to analyze the Shroud. (Chapter 18 of my book, its conclusion).It is generally non-destructive. However, the light used to illuminate the work has to be filtered to prevent light pollution.\nWhile the microspectrophotometer may appear “primitive” today, Heller and Adler were able to identify the spectrum of methemoglobin on samples obtained from the Shroud and that meant it was real, very ancient, degraded hemoglobin. \nBut actually this is something we agree on: The utility of employing MDI to analyze the Shroud. The result might be several terabytes or so of data well with the capability of even desktops now. The programs that analyze the data are sophisticated but available.\nMoreover, an MDI data base of the Shroud would allow for research and examination world wide without interference. Also, the database would allow peer review and criticism of the results of any analysis – unlike the basic carbon lab data which the labs have refused to release. Pam Moon had to use a British FOIA process to get copies of the Oxford sample.\nYou see David, when it comes to an MDI analysis of the Shroud being appropriate; you and I are on the same page.\n.\n\n","date":"November 12, 2014 at 5:34 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170783","author":"John Klotz","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"I think all of you mix several things: spectroscopy of electromagnetic spectrum (visible, IR, UV, X-ray etc.), with simple decomposition of image via Fourier transform (that is transition from real space, showing XY location of points to the wave vector -that is spatial frequency -space, with coordinates UV). It is the latter that I have done. It has nothing in common with light direction, or with any chemical analysis of it via spectroscopy.\n\n","date":"November 12, 2014 at 5:44 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170786","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"O.K.\nA Fourier transform has been done and the results published. I believe an MDI study would be very worthwhile. In fact it maybe the one thing that cold be done with the least fuss in the least time and the results could then become universally available.\nAnd I repeat one thing from my last chapter: the results of any study of the Shroud are the intellectual property of all humanity. Those, as they say, are “fighting words.”\n\n","date":"November 12, 2014 at 6:09 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170792","author":"John Klotz","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"I believe an MDI study would be very worthwhile.\nYes. But that’s completely different thing than what I have presented here.\n\n","date":"November 12, 2014 at 8:49 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170821","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"And BTW John, may I ask you as a lawyer?\nMay I now openly claim that Charles Freeman is delliberately deceives people, especially readers of ‘”History Today”? Are those evidence we presented sufficient enough to maintain this statement, without accusation of libel?\n\n","date":"November 12, 2014 at 9:23 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170824","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"OK\nIn this interconnected world we live in, no question has a simple answer.\nIf you were to get into an argument with Charles and used personal invective, you would have to look at the defamation laws of your country and England to arrive at a conclusion. Because he is English, he is protected by libel laws much harsher than in some other countries like the US.\nBetween the US and England, the US is most protective of the speaker and England more protective of the object of the statement. A general rule which others may disagree with is this: in the United States the libeled person must prove the statement false. In England, the speaker must prove the statement is true. I haven’t a clue as to what the law maybe in other countries.\nAs a US resident however, I am protected by US law to the extent that this “burden of proof” is a constitutional issue relating to free speech. A judgment obtained in England for libel may not be enforceable in the US unless I appear in England to litigate it if the wrong burden of proof is applied.\nThat being said, even in the US I would  be careful about a flat statement of “deliberate deception.” You might say is reasoning is shoddy or totally mistaken. But I would be leery of ever saying it was deliberately deceptive. If it goes to his profession or livelihood, you are in an entirely different arena even in the US.\nI am not giving you legal advice because we do not have a lawyer client relationship. I am only commenting on the general law.\nI could have many sharp criticisms of Charles and the shifting sands of his “proof.” \nI would not say he is being deliberately deceptive in any country.\nBut that’s just my opinion.\n\n","date":"November 12, 2014 at 10:07 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170830","author":"John Klotz","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"OK. I don’t think you should claim deliberate deception. But you can accuse him of academic incompetence. I think many posters here have exposed his theory as insubstantial. He offered a theory, it was proven wrong, time to move on. However if he continues to ignore the counter evidence and posit that his theory remains viable, then I’d revisit the ‘deliberate deception’ accusation.\n\n","date":"November 12, 2014 at 9:57 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170829","author":"David Goulet","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"The wrong kind of language was used for a very long time on this blog till Dan managed to put an end to it after pressure. Now it has raised its head again.\n\n","date":"November 12, 2014 at 10:33 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170833","author":"Louis","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Better link: http://www.lumiere-technology.com/Pages/Services/services2.htm\n\n","date":"November 12, 2014 at 5:39 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170785","author":"John Klotz","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"My request was simple: Academic bibliography about the use of the FTT in the field of History of Art. Not about other “similar” or dissimilar luminic technics. This is not the case: http://www.lumiere-technology.com/Pages/Services/services3.htm \nIt seems you have not. But I can waiting that you find it. I’m patient.\n\n","date":"November 12, 2014 at 6:51 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170802","author":"David Mo","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"You fool! You think you outsmarted everyone, including STURP, but you don’t know basic things like what FFT or negative is!\nQuicksearch, and you have this: http://download.springer.com/static/pdf/951/chp%253A10.1007%252F978-3-7908-1856-7_7.pdf?auth66=1415799362_2e492fee31de42511b1e7743af756f8b&ext=.pdf , especially chapter 4.3 Fourier Spectra\n\n","date":"November 12, 2014 at 8:39 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170818","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"http://link.springer.com/chapter/10.1007/978-3-7908-1856-7_7\n\n","date":"November 12, 2014 at 8:40 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170819","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"When I first posted this, it was for free, bad thing I haven’t saved the entire book then…\n\n","date":"November 12, 2014 at 2:51 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170881","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"What a pity. The title of the chapter is too generic and I am not willing to spend 19$. If this is all the books or articles  you know about the subject is as poor as the rest of your article.\n\n","date":"November 13, 2014 at 2:19 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170981","author":"David Mo","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Dear me; I lose my internet connection for acouple of days and come back feeling like Rip Van Winkel or Snow White. More the first than the second in my case. Anyway, OK’s FFTs are interesting, and best of all, offer anybody the chance to explore them on their own. However, I’m not sure he has destroyed the ‘painting’ hypothesis with his ‘lack of directionality’ evidence. Walter McCrone came up with the idea that the image could have been made by smudging a pigment laden finger across the cloth, but rejected it on the grounds that the threads would act as “snow-fences” (his word), so drifts of pigment would pile up against them as the finger moved across. I imagine that much the same would happen with paint, and no such drifts are observed anywhere. McCrone’s solution was to quote at some length from Sir Charles Lockwood’s book ‘Methods and Materials of Painting of the Great Schools and Masters’ which describes an unusual tempera, typical of England and Germany, which was ideal for painting on cloth, which was extremely dilute, and which appeared almost transparent. In these very dilute circumstances, there is no reason why and directionality would be apparent, even if the cloth were painted.\nThere is also the possibility that the ‘paint’, if there was any, was dabbed on vertically, and the blood dripped on with a pipette. In these cases too, no directionality would necessarily be created.\nWhat I find quite strange about OK’s FFTs of the Shroud, and still need to explore, is that his photographs of the Shroud show very obvious directionality which is clear to the naked eye, namely the weave of the cloth. I find it curious that the FFT, which OK says can recognise directionality, is unable to recognise thick obvious diagonal stripes across the page. Or can it cunningly tell the difference between the directionality of the image and the directionality of the cloth, even from a simple black and white photograph?\n\n","date":"November 12, 2014 at 12:43 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170849","author":"Hugh Farey","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"The FFT recognizes the weave. The filter image i gave you to explain the banding is precisely a filtering of the weave pattern with FFT done by Thierry Castex…\nI guess you don’t know what you’re talking about.\n\n","date":"November 12, 2014 at 12:49 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170851","author":"anoxie","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"I’m sorry, anoxie, I can’t locate your image. Can you give a reference?\nHowever, you’re certainly correct that the details of the FFT’s implications currently escape me. What is it, precisely, that indicates ‘directionality’? Is it the shape of the blob in the middle? Or the little lines across the x and y axes? I guess I’ll have to try to explore the real meaning of these images myself, but if anyone can explain, it would be helpful.\nNot that the ‘painting’ of the Shroud needed to have any directionality anyway…\n\n","date":"November 12, 2014 at 1:06 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170853","author":"Hugh Farey","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Hugh, do you have Marion-Courage book? You mentioned once you were intending to purchase it. There is clear description of this property in that book.\n\n","date":"November 12, 2014 at 1:13 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170858","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"https://shroudstory.com/2014/08/27/banding-is-it-real/\nThe banding filtered by the FFT is the banding of the weave pattern. Four spots on the FFT.\n\n","date":"November 12, 2014 at 1:15 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170859","author":"anoxie","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Yes, FFT recognises the weave. I wrote on page 4: \nBesides several dots, corresponding to the weave (and a cross, which is simply artifact of the limited size of the box), we see that the spectrum is quite isotropic, with no preffered directions.\n\n","date":"November 12, 2014 at 1:15 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170860","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"I’m sure I misunderstand, OK. What exactly demonstrates directionality? Is it the number and distribution of the little vertical and horizontal bars across the x and y axes? As I say, I look forward to exploring the FFT function on imageJ myself. It looks fascinating.\nAnd  no, I haven’t got the Marion Courage book, as I was not convinced by their discovery of all those inscriptions; but I am familiar with Tierry Castex’s website, which is also fascinating.\n\n","date":"November 12, 2014 at 1:53 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170867","author":"Hugh Farey","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"” but I am familiar with Tierry Castex’s website, which is also fascinating.”\nThen you should study it again, because he clearly explains where is the weave pattern on the FFT.\nNow i understand why you did not get at all my explanations about the banding of the weave and honnestly thought your pdf pointed to an original idea…\n\n","date":"November 12, 2014 at 2:16 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170877","author":"anoxie","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"There is also the possibility that the ‘paint’, if there was any, was dabbed on vertically, and the blood dripped on with a pipette. In these cases too, no directionality would necessarily be created.\nHugh, see this:\n\nNormal image of hexagonal mask.\n\nFFT of it.\nYou can play with it yourself in ImageJ, or GIMP, for example. In ImageJ use option Process>FFT>FFT, and see yourself!\nI suppose FFT would rather detect painting dabbed vertically, similarly like it analised hexagonal mask. Simply, our minds are not adapted to create totally random images, which would turn out isotropic in Fourier domain. There will be always deviations from randomness.\n\n","date":"November 12, 2014 at 1:47 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170864","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Hugh, Check out your folk tales!  ‘Twasn’t “Snow White”;  ‘Twas “Sleeping Beauty”!  Both included in works by Brothers Grimm, but completely different stories.  Snow White was given a poisoned apple by a wicked queen, and was wakened by a huntsman after a very short period.  Sleeping Beauty pricked her finger on a spindle as a result of a curse by a miffed fairy, and went to sleep for a hundred years along with the rest of the castle, until wakened by a prince who had found his way to the castle through briars and thorns.  \nSide issue of tragic historic interest:  Alan Turing was much taken by Disney’s 1937 animated film of Snow White, was often heard to recite the queen’s magic spell, “Put the apple in the magic brew, Let the poison seep right through.”  Due to Britain’s homophobic laws at the time, and following a verdict against him, a half-eaten poisoned apple was found at his bed-side after his suicide from cyanide.\n\n","date":"November 12, 2014 at 2:05 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170872","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"I am not really  in here as I have too much on and am not worried if I cannot convince anyone of the paintings when other people I am talking to think it is quite obvious, if only from looking at the depictions in Beldon Scott. I also don’t think anyone will miss me and if I haven’t made my points by now I never shall.\nHowever, one of the books I have found most useful is edited by the late Caroline Villiers on medieval paintings on textiles. There are lots of essays on different paintings and it depends entirely on the fluidity of the paint whether there are visible brush stokes or not. If the paint is fluid then ,of course, it settles  without brush marks, just as, to take an extreme example, water settles without marks on the surface. If, it is thicker however, the pigments will dry with the brush stokes intact . They give examples of both in the book from medieval textiles. So the directionless can simply mean that the paint was applied in a fairly fluid form.\n I would assume that Colin is reading all these books before he gets carried away with his own esoteric solutions . It really does seem that he hasn’t mastered the basics of medieval painting on linen yet but it might be wise to do so so that  someone somewhere might take him seriously!\n\n","date":"November 12, 2014 at 3:12 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170886","author":"Charles Freeman","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"when other people I am talking to think it is quite obvious, if only from looking at the depictions in Beldon Scott. \nThat shows with whom you discuss those issues, Charles. But us you cannot fool.\nSo the directionless can simply mean that the paint was applied in a fairly fluid form.\nYeah, yeah, and you obtain marvelously clear photonegative while liquid paint is spreading across the cloth….\nI would assume that Colin is reading all these books before he gets carried away with his own esoteric solutions . It really does seem that he hasn’t mastered the basics of medieval painting on linen yet but it might be wise to do so so that someone somewhere might take him seriously!\nAll those books won’t replace empirical evidence.\n\n","date":"November 12, 2014 at 3:25 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170888","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"But O.K, what is your status in the academic community who know about medieval painting on linen?\nWhy don’t they, with their expert eyes, have any problem in seeing that the images were originally painted when you do? That is the question that needs answering!\n\n","date":"November 12, 2014 at 3:31 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170892","author":"Charles Freeman","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"“Other people”. Are these other people as versed in the full gamut of Shroud research as those here? Or are they simply art historians who already think the Shroud is nothing but a curio? Posters here have pointed out some massive gaps in your theory and you’ve provided a marginal defense. If you were defending a PhD with this kind of counter punch I’m afraid you’d fail. I actually was open minded about your theory when it first was shared but you have had no convincing answers to the critics (never mind their lack of civility at times). I’m sorry but you gave it an honest effort but it’s now time to honestly concede the theory does not solve the mystery of the image formation. Giving yourself a year to collect some confirmation biased reviews won’t have you any closer to the truth.\n\n","date":"November 12, 2014 at 3:41 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170893","author":"David Goulet","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"David, How can you be so sure that a year working with experts in weaving , art iconography, medieval linen painting, etc, won’t bring the academic world closer to the truth about the Shroud?\nSuppose STURP’s dated 1978 tests are redone ( even though there is no evidence that the tapes have been preserved as an archive anywhere) and one does confirm that the calcium carbonate is not dust but gesso and thus evidence of painting?\nSuppose you get a group of experts in ancient weaving and they show physically that the Shroud could not have been woven on any known ancient loom but could be on a medieval treadle loom that was  only known in Europe since 1000, how would you, with perhaps no experience of weaving at all, actually challenge this? A miracle weave?\nI am used to having my work assessed by professional experts in addition to those who are asked to peer review it. If I am found to have been deliberately deceiving anybody they will find me out and then you can all pelt rotten apples at me as I lie in the stocks.\nWhat would be the point  of deliberately deceiving anyone anyway, what would I be hoping to gain?\n\n","date":"November 13, 2014 at 12:02 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171060","author":"Charles Freeman","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Charles, I don’t think you deliberately deceived anyone. But I am sure you are mistaken in thinking the shroud is a painting.  You say what if the tests were redone and it was discovered that the calcium carbonate was gesso instead of dust. How is that determined? Have you consulted a chemist or a microscopist? There are so many other reasons that it is not a painting that it would probably mean nothing.  You wonder what it would mean if experts show that the shroud could only have been made of a loom only known in Europe since 1000. Essentially that would be an opinion that the cloth was not more than a thousand years old.  That doesn’t make it a painting. \nI ask you again, Charles:  You speak of historical context. Can you thus give an example from anytime in history of a painted negative image that is not copied from a negative image?  Hint: a mirror image does not mean the image is a negative image. Can you explain how the image is chemically formed after all the paint has flaked off? Do you have one example from history of this happening.\n\n","date":"November 13, 2014 at 12:38 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171068","author":"Dan","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Charles has not addressed the extreme superficiality of the image detected by STURP.\n\n","date":"November 13, 2014 at 12:59 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171070","author":"Louis","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Charles I don’t think you are deliberately misleading anyone. I think you are a victim of confirmation bias. You have looked only at evidence that supports your theory and do not seem able to appreciate the evidence that damages the theory. I am not an expert in any of the disciplines on display here, but I read and consider the posts of the experts that do frequent here. One does eventually start to see a forest through the trees. It’s not the 14 century provenance I have a problem with either — your loom reference is a valid one. Or that the Shroud is indicative of gothic art style. What I have a problem with is the flaked off paint theory. It’s an interesting hypothesis but you haven’t produced a shred of conclusive evidence, nor defended well against the counter arguments. I’m wary then of anyone who proclaims ‘mystery solved!’ – though perhaps that was an editor’s decision to hype the article.\nBut you make a valid point about judging too early. I hope you will be able to share with us in a year corroboration from other experts who agree with your theory. I’m most open to re-examining the theory at that time.\n\n","date":"November 13, 2014 at 1:23 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171074","author":"David Goulet","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"I have a suggestion for Charles: get hold of an artist, give him the materials that were used by medieval painters, and ask them to paint an image like the one we see on the Shroud. I presume “Shroudies” will have the patience to wait till the paint flakes off.\n\n","date":"November 13, 2014 at 1:54 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171081","author":"Louis","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"It is STURP that we have to thank for defining the superficial image on the weave as that is exactly how the medieval linens were painted so that flags and banners could flutter. If you find large quantities of calcium carbonate then it is indicative of gesso. So we have a start there.\nBut my evidence comes from looking at the earlier depictions and descriptions and tying them into medieval iconography. This is all In my article so I will not repeat it. It adds up to me clearly that this is a linen that was originally painted in the fourteenth century. Every time I read of some other explanation of how the images got there, I feel more confirmed in my view. At least, after all these years of debate, if there was a consensus on how the images were formed other than through being  painted on, we might be able to have a proper debate. I don’ think anyone here is going to convince anyone in the outside world that it was not originally painted unless they can provide a clear alternative.\nBut Louis may be in luck. I was contacted on Monday by a TV producer who is hoping to recreate the Shroud from the weave onwards. The project seems to have been under way before he came across my article and he has started with contacting weaving experts- it turned out that one of those I consulted myself had been contacted independently by him. And then they are going to paint the surface although I warned him that it was unlikely that there are many people around who can recreate a thin layer of gesso on to which the paint goes. It was apparently a highly skilled job with some craftsmen doing nothing else. Very difficult to keep it really thin but sealing the whole surface. He has the outlines of the images and the scourge marks and the bloodstains sorted out so he has clearly been doing his homework.\nI have no idea whether I shall be involved in this or not – he just asked me some quartos about my article and went on his way – so perhaps we will all wait and see in about a year’s time what comes out of this project.\n\n","date":"November 13, 2014 at 3:16 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171094","author":"Charles Freeman","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Transform (DWT) or Fourier transform infrared spectroscopy (FTIR), both used in the detection of forgeries or analysis of components in works of art. It seems not exist bibliography about the FTT applied to art or O.K ignores it.\nThis is not the main problem with the short article of OK. The technics of analysis of image (with the Fourier Transform algorithm or others) seem useful in artistic enquiry, but they must be practised by specialist people and on correct materials. The material of FFT seems to be photographs. I suppose that Marion and Courage worked on high definition microphotographs. But comparing this kind of photographs with others extracted from a magazine is useless. O.K. is comparing too very different kind of things and the results cannot be homogenous. A serious work would take high definition microphotographs of the different replicas of the Shroud (Garlaschelli, Broch, Pesce,Craig and Breese, etc.) and would match them with similar others from the Shroud. But this it would be a serious work and not an amateur one with photoshop.\nI understand even less why he analyses the common pictures of a coin scratched with a pencil.  He seems to think that there is somebody who thinks that the shroud was made with pencil and a coin. Astonishing.\n\n","date":"November 13, 2014 at 3:33 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170985","author":"David Mo","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Sorry. The beginning of my comment was missing: \nHugh: I have been looking for some references to the FTT applied to the forgery in arts and I don’t find anything. This is a very different situation for Discrete Wavelet\n\n","date":"November 13, 2014 at 3:36 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170986","author":"David Mo","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Mo, the more you mouth of in this topic, the more evident is that your knowledge is null. \nSome literature:\nhttp://ciam.inra.fr/workshop-ssiab9/sites/ciam.inra.fr.workshop-ssiab9/files/slides/jeud/Jacobsen_SSIAB9.pdf\nhttp://people.math.aau.dk/~robert/publications/thesis.pdf\nhttps://web.math.princeton.edu/~ingrid/VUB/WOLFF_SENIOR_THESIS.pdf\nhttp://journals.istanbul.edu.tr/iujeee/article/viewFile/1023013434/1023012655Niyazi\nhttp://homepages.cae.wisc.edu/~ece539/fall10/project/Luo_rpt.pdf\nhttp://alexanderdbrown.com/research/digital-analysis-paintings.pdf\nhttp://etopia.sintlucas.be/3.14/Daubechies_Eng.pdf\nAnd so on (search for ‘Fourier’)\nHugh: I have been looking for some references to the FTT applied to the forgery in arts and I don’t find anything. This is a very different situation for Discrete Wavelet Transform (DWT) \nOf course you don’t know that Wavelet analysis is just a generalization of Fourier analysis, working on the same principle (it is simply more practical in painting analysis, so that’s why it is preffered). You don’t know basic things, but you pretend to be the smartest.\nThe material of FFT seems to be photographs. I suppose that Marion and Courage worked on high definition microphotographs. But comparing this kind of photographs with others extracted from a magazine is useless. O.K. is comparing too very different kind of things and the results cannot be homogenous.\nYou suppsose… I am quite certain you haven’t read Marion & Courage work. And my own small presentation as well. As you can see, if there is possibility to obtain some good quality photographs (in any way, whether scanned cover,or other high-definition photo in book or magazine) the results are good enough to be included in presentation, and make some conclusions from it.\nYou don’t know basics, and you dare to teach me -not only me, but Lorre, Lynn, Marion, Courage (who claim the same as me) and others?\nI understand even less why he analyses the common pictures of a coin scratched with a pencil. He seems to think that there is somebody who thinks that the shroud was made with pencil and a coin. Astonishing.\nThe more astonishing is who wrote on November 9, 2014 at 10:58 am those words:\nEverybody has done sometime a negative image. It suffices to rub a paper on a coin with a pencil. Furthermore, I have done a negative image with a pencil and a finger in 5 min. Where is the mistery?\nFirst you were so confident, no mystery in the Shroud image, it is like to rub a coin with a pencil (you were not the first one, nor probably the last to repeat this nonsense) -and know you run away, you allege me that i think that and so on. You little poor sceptical coward, have you forgotten your own words? Spreading innuendos is the best you can?\n\n","date":"November 13, 2014 at 5:37 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171003","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"None of these works speaks about FFT. \nOnly one says hat  the Fourier transform is useful for detect  brush strokes ( by a student; not publshed). This is explicitely refuted in the others. Etc., etc.\nYour list is as useless as your work.  \nIf I have time I will put here some  very interesting extracts.\nAre you joking?\n\n","date":"November 13, 2014 at 10:39 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171051","author":"David Mo","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"What we see playing out here is the same tension that drove McCrone to time and time again declare it a painting, when the Shroud obviously is not.  An authenticity finding of the Shroud fundamentally changes our secular world view.  For instance, the Shroud depicts a crucifixtion victim exactly as described in the Gospel of John, the last written Gospel, and academically considered very unreliable as a historical source, if not outright fiction. Obviously, John and the other gospels would now have to be considered reliable historical sources should the Shroud be authentic.  Critical historians, theologians would literally have to “go back to the drawing board.”  Moreover, science and physics in considering the image and a first century date, as well as the Gospel stories of the resurrected Jesus materializing into locked rooms, etc., would be faced with questions current physics/science are ill-equipped to answer.\nThat is why you see reasonable, educated people continually saying things that are demonstrably false or simply ludicrous, e.g., “the shroud is a painting”; “it’s a negative like any other of the middle ages,” or “even if it dates to the first century, there’s no reason to believe it was the Shroud of Jesus,” etc.  \nI am not convinced of the Shroud’s authenticity, but I am convinced that the truth must be discovered. And incorrect world views or academic beliefs must be relegated to the dustbin of history if they do not match the known historical facts. Let’s hope we have courage to honestly acknowledge those facts…whatever they may be.\n\n","date":"November 12, 2014 at 1:12 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170857","author":"Mordecai Boone","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"I’m sure I misunderstand, OK. What exactly demonstrates directionality? Is it the number and distribution of the little vertical and horizontal bars across the x and y axes? As I say, I look forward to exploring the FFT function on imageJ myself. It looks fascinating.\nI hope you know what the wave vector is http://en.wikipedia.org/wiki/Wave_vector\nYou can see that in my presentation. The isotropic means no directions are preffered -so we should see roughly circular Fourier image in the center. If image is directional, we see some prefferred frequencies (or better say wave vectors). If it has some structure, then it has equivalent structure in Fourier representation.\n\n","date":"November 12, 2014 at 2:49 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170880","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Now a few demonstrations for educational purposes:\n\nA square\n\nFFT of it\n\nA square with its edges smoothen by gaussian blur\n\nFFT of it\n\nA square\n\nFFT of it\n\nA circle convolved with 50-pixel-radius gaussian\n\nFFT of it\n\nA quasi-random noise (actually it is a fragment of sum of  several CCD read-outs during dark expositions)\n\nFFT of it\n\nThe same quasi random nosie , but this time with 3-radius median filter applied, showing that this nosie is not entirely random.\n\nFFT of it.\n\n","date":"November 12, 2014 at 4:55 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-170906","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"None of these works speaks about FFT.\nOnly one says hat the Fourier transform is useful for detect brush strokes ( by a student; not publshed). This is explicitely refuted in the others. Etc., etc.\nYour list is as useless as your work.\nIf I have time I will put here some very interesting extracts.\nAre you joking?\nDo you even know what FFT is?\n\n","date":"November 13, 2014 at 10:52 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171052","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"And you?\n\n","date":"November 13, 2014 at 11:01 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171053","author":"David Mo","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"As I use it apparently I know ;-) \nSo you first, do you know what FFT is?\n\n","date":"November 13, 2014 at 11:17 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171057","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"No much, but surely more than you, because you make alleged supportive references that actually are refutations of your presentation (?).\nFor example: \n“The validity of this assumption depends on the kind of painting in question; paintings\nin the e.g. photorealism style [16] do not have visible brushstrokes”. (p. 2)\n“The Fourier transform has been around for a long time and is well suited for variety\nof signal processing tasks, but capturing the local information of brushstrokes seems\nto be outside of its reach”. (p. 4)  C. Robert Jacobsen: “Digital Painting Analysis”\nIn reality the works you referred use other technics than Fourier transform, as is explained here: \n“In early days of image processing the Fourier transform was often used to decompose images into signals. In more recent years wavelets and transforms using wavelets have become more popular, as they can provide all the features of a Fourier transform, but also provide localised time information, as well as localised frequency information”. (p. 4?) Alexander David Brown: “Digital Analysis of Paintings”.\nFurthermore, all of them use more sophisticated devices than a simple scanner and photoshop, including infrared rays:\n“Our data set consisted of fifteen details of Goswin van der Weyden paintings, with the corresponding infrared reectograms of their underdrawings, as shown in Figures 7.1 through 7.15. The underdrawings were uncovered using infrared reectography technology.”  (Josephine Wolff: “Wavelet Analysis of Paintings by Goswin van der Weyden and Paul Gauguin”).\nThe most interesting is “The Eye of the Painter: Deciphering Art Mathematically”. This article shows the limits of the mathematical methods in identifying works of art. It says about the theme of the brush strokes and directionality specifically: \n“To further prove the usefulness of the wavelet technique in identifying the originality of paintings it was decided to set up a new validation experiment that would be monitored entirely,without intermediaries and without any additional technical complexities. Charlotte Caspers would make seven pairs of paintings using different canvases, brushes and even styles. In eachpair there would be one original (always a still life) and one copy, made afterwards. Both would be painted by Caspers, yet, remarkably, it took her half more time to make the copy than to make the original painting.\nIt turned out that where Caspers used soft brushes, no positive conclusions could be drawn”. (Bold letters are mine).\nThat is to say. Unlike your amateur job:\n-The works that you referred used more complex methods, related to infrared rays, wavelets transform (Discrete or Complex), high resolution microphotographs, etc.\n-Some limitations to these methods, specially in the detection of  brush strokes, are detected. Brush strokes, as Charles pointed in other commentary, aren’t detectable when the paint is fluid (tempera, watercolour or diluted oil) or when a soft tool (brush, pad-ink or similar) is used. \nThis is why your “presentation”, and those you recommended, are useless for the item we are discussing.  But the practice of recommending some texts that one has not read as supportive referenes is worse and it is often easily detected. Or perhaps you have read them but you have not understood their negative implications. I don’t know what problem you have, so I will refrain from more comments.\n\n","date":"November 14, 2014 at 2:52 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171163","author":"David Mo","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Thanjk you for your long discussions on FFT …\nYesterday I did not have enough time to write in this blog\nbecause\nI followed an entire day on Nanotextile “Innovation and Growth”…\nand, previously,\nI did not intervened with a message because\nI had read the text by André Marion and Anne-Laure Courage\nand then I agreed with OK.\nSo, I checked the text in its Italian translation (Italian = from page 139 to page 142. Polish =\nfrom page 155  to page 158), released in 1998 under the title: “La Sacra Sindone. Nuove scoperte” Ed. Neri Pozza….\nThere is the same graphic representation shown by OK for the FFT …\nGraphics:\na) “periodic Image”,\nobraz periodyczny = periodic image,\nokres period T = T period,\nkieruniek periodycznosci = direction of periodicity,\nWidmo Fourierowskie = Fourier spectrum;\nb) “Fourier spectrum” or “frequency spectrum” (bright points at distance 1 / T),\nkieruniek widma = direction of the spectrum\n— — —\nSurfing the Web I have found an interesting article:\n“How To Spot A Fake”\nLink:\nhttp://www.forbes.com/2008/12/03/collecting-forgery-art-forbeslife-cx_sf_1203fake.html\n>It still rates as one of most exciting finds in recent art history: Filmmaker Alex Matter announced in May 2005 that among his family’s belongings on Long Island, he had discovered 32 drip paintings from his deceased parents’ close friend and neighbor, Jackson Pollock. The collection’s value was thought to be near $40 million. …\n… … omitted … …\n>Martin trained a Raman microscope on 19 of Matter’s Pollocks and spotted evidence invisible to Ellen Landau’s highly trained eye, including five paint pigments on these Pollocks that allegedly didn’t exist in 1949–they’d been invented years or even decades after Pollock’s death in 1956.\n… … omitted … …\n>If the paintings are indeed fakes, and had been sold to a collector, they’d be part of the $6 billion a year the Federal Bureau of Investigations says we pay for forged, misattributed and stolen art.\n>The art world is thinly funded, insular and suspicious of costly new technologies that have the potential to undermine serious connoisseurship and provenance researchers. But there are a few new technologies gaining acceptance now or currently in development that can help us avoid fakes.\n>… Fourier transform infrared (FTIR) spectroscopy and Raman spectroscopy.\n>A staple in medical and weapons research labs for a decade or two, FTIR and Raman microscopes have gained acceptance in the art world in the past five years.\n>Both provide a nifty way to tell what the ingredients in a surface coating are because there’s no need to chip off a sample of the paint. Just shoot a light beam at a surface–a Raman microscope can zoom down to areas as small as one-1,000th of a millimeter–and then match the pattern of absorbed or altered wavelengths detected to those of known materials.\n>Most major museums still don’t have this equipment, which can cost $100,000 to buy.\n>Martin has been an early adopter. In the late 1990s he used an FTIR scope to help the FBI spot shams that a man named Charles Heller sold as authentic works from William Aiken Walker. Walker sold post-Civil War plantation scenes to tourists for as little as fifty cents until he died in 1921. Heller had sold phony Walkers for more than $9,000. \n>Martin was the first art authenticator in the U.S. to buy a Raman microscope. … … etc … …\nBut I prefer the comparisons (after/for FTIR and Raman controls)\nwith respect the high resolution SPM analyses.\n\n","date":"November 13, 2014 at 12:11 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171061","author":"piero","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Errata corrige.\nSorry:\n“Thank you you for your long discussions …”\ninstead of:\n“Thanjk you for your long discussions …”\n— —\nFTIR and Raman analyses, compared to SPMs,\nrefer to different analytical methods.\nHowever, their comparison is interesting.\nThe same can be said for the AFM and the STED.\nA novel nanoscopic tool (by Diaspro, 2012) with very high versatility …\nLink:\nhttp://www.jpk.com/index.download.73a592078475d9345ddee61653924870\n\n","date":"November 13, 2014 at 12:28 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171065","author":"piero","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"David Mo:\nNo much, but surely more than you, because you make alleged supportive references that actually are refutations of your presentation (?).\nYou pretend to be wise guy, but the more you take voice, the more ignorant you turn out. Obviously you don’t know what the Harmonic Analysis, or FFT is, and everyone who knows laughs at you. And of course you don’t understand what those paragraphs are about.\nThe papers presented discuss the issue of distinguishing between the original paintings and the copies of them, using as one of the tools Fourier or wavelet analysis of image areas in search for brush strokes (best visible in infrared -but that does not mean that they cannot be seen in visual light) -and then via some statistical analysis of frequencies (characteristic for some individual artist) determination whether the painting came from the same or different hands. They don’t deny that brush strokes leave some directional information in Fourier domain, only that such analysis is not always enough to determine whether painting is an original or a copy. \nWe have much simpler task -to determine  whether there is some directional information in Shroud images, associated with hand-made manipulations (there is no, as you can see).\nIt has been ad rem, now ad personal:\nMo, I don’t know what’s greater, whether your ignorance or or your arrogance! \nYou don’t even know what FFT is (to your information Fast Fourier Transform is an algorithm, or even the whole family of algorithms for convenient calculation of numerical Fourier transform, with as few operations as possible http://en.wikipedia.org/wiki/Fast_Fourier_transform, but in jargon the term is used for the operation itself), you don’t understand what those papers are about you haven’t performed similar analysis even on amateur basis, and you dare to claim you are wiser not only than me, but Lynn, Lorre, Marion and Courage as well! \nAs you cannot prove your points yourself, in your intellectual misery, the all you can do is to take some extracts of some publications out of context, and then DEMAND others to disprove your point, while you’ll be judge, saying what’s correct or not! It is not only in this thread that you try this primitive trick to hide your lack of competence! As I am regular on this blog, and discussed with you not once, I know your awful style! David Mo, “great expert in everything”. Great ignorant actually!\nThat’s all for you, because discussion with such guy like you is a waste of time. You have asked yourself for so many invectives -you got what you deserved. Had you some respect, instead of pride, arrogance, and spreading insinuations, we would have talked in different way.\n\n","date":"November 14, 2014 at 2:40 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171233","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"This is all very well, but all we discover, if we do discover it, is that the Shroud doesn’t have brush strokes, which we could have found out just by looking at the ‘snow-fence’ effect. Dilute paint, of the kind mentioned by Charles Lockwood, or dabbing the pigment on, would not have produced brush strokes anyway. Absense of directionality is not a proof of authenticity; it is not even an indication of authenticity.\n\n","date":"November 14, 2014 at 3:21 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171243","author":"Hugh Farey","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"BTW: I have simulated a simple model of image made using vertical dabbing.\nI made this image in 10 minutes in Paint using spray imitation, with various intensity, placing dots in as much random places , as I could:\n\nThen I applied Gauss filter with 4-pixel radius:\n\nHere is FFT of the first image, and below a second one:Although the Fourier images are axially symmetrical, yet I think there is a good chance we would recognize that those pictures were artificially made.\n\n","date":"November 14, 2014 at 3:30 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171244","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"I commend your endeavours, OK, but your computer generated spray pattern looks nothing a Shroud painted by dabbing colour on. A much better sample would be the Garlaschelli version at http://www.sindonology.org/archives/2009/shroudGarlaschelliFaceNeg.jpg. I don’t know why jpegs are unsuitable for FFT analysis, but I took a screenshot of it anyway in TIFF format. The  imageJ FFT derivations are very Shroudlike indeed.\n\n","date":"November 14, 2014 at 4:12 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171249","author":"Hugh Farey","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"http://en.wikipedia.org/wiki/JPEG#JPEG_compression\nJPEG uses a lossy form of compression based on the discrete cosine transform (DCT). This mathematical operation converts each frame/field of the video source from the spatial (2D) domain into the frequency domain (aka transform domain.) A perceptual model based loosely on the human psychovisual system discards high-frequency information, i.e. sharp transitions in intensity, and color hue\nScreenshot in TIFF doesn’t help here, as it is merely a screenshot of JPEGs -so information is lost anyway. Thus  FFT of JPEGs usually look ‘Shroudlike”.\n\n","date":"November 14, 2014 at 4:19 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171250","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"So, next experiment. I took a screengrab of your spray pattern above, converted it to jpg and then tried an FFT on that. It doesn’t look at all Shroud like. So I took a screen grab of your white dots on a black background above, converted that to jpg, and you know what? My FFT of that looks exactly like yours. I have not been able to verify that your statement about jpegs is true. What happens when you do it?\n\n","date":"November 14, 2014 at 4:35 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171252","author":"Hugh Farey","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"A you have in the Wiki quote above, JPGs eliminate higher frequencies in Fourier domain, which are equivalent of small-scale structures in real domain. Small-scale structure =high frequencies. Large-scale structure =low frequencies.\n\n","date":"November 14, 2014 at 4:46 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171254","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Hugh, re Garlaschelli.\nI said that I don’t recommend using JPEGs for Fourier Analysis, due to reasons described above. Yet this Garlaschelli photo, although being JPEG, has resolution high enough,so some FFT analysis can be performed.\nBut first look at Garlaschelli himself making his image. Take care especially about his hands moving.\n\n(16:59 onwards)\nGarlaschelli uses different technique than what I understand by the term ‘vertical dabbing’. My understanding is making small spots by multiple single touch ups by small brush (or using pippette), to create an image. But Garlaschelli’s approach is entirely different. He uses large sponge , an inch or so in size, roughly the nose width, to rub a pigment down into cloth laying on bas-relief. In strict technical sense it isn’t a ‘painting’ as he doesn’t use his hands to make a form of the image, instead he only reflects the shape of bas-relief -his hands are used only to apply pressure to the sponge. And as his sponge is large (a few cm^2, that is the size of area usually analysed via FFT), in theory there should be no directionality (but of course this method is hardly suitable to make fine detailed images). In theory, of course. But in practice he cannot hesitate from moving his hands.\nHere are some of my analyses of various fragments of Garlaschelli’s image:\nHair area:\nNose area:\nBeard area:\nAs you can see, he leaves directionality information in Fourier domain.\n\n","date":"November 15, 2014 at 8:36 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171398","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"I’m afraid I do not see sufficient distinction between the Garlaschelli FFT analyses and the Shroud analyses to be able to declare them different. I will however, investigate them further.\n\n","date":"November 15, 2014 at 1:16 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171429","author":"Hugh Farey","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Hugh, if you cannot see sufficient distinction between Garlaschelli and the Shroud, see this, the FFT of (almost) the whole face:GarlaschelliEnrie.\nEven despite Shroud has photo has more defects (I mean bandings and bright vertical streaks going up and dow n-remmeber while performing FFT analysis AVOID sharp edges), at extreme contrast its FFT is much more isotropic than Garlaschelli -direction of the movement of his hands while rubbing is reflected in the Fourier spectrum. FFT analysis is actually a really powerful tool.\n\n","date":"November 15, 2014 at 2:02 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171432","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Well, I’ve tried this too now, and I don’t get the same image. How do you put your images up here? If I knew, I’d show you what I get. Otherwise I may have to bother Dan again with a pdf!\nMeanwhile, what specifically shows anotropism? Is it the two diagonally opposite dots on the Guarlaschelli FFT? Or what?\n\n","date":"November 15, 2014 at 2:28 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171434","author":"Hugh Farey","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Hugh, do you know what diffraction and interference is (and perhaps studied mathematical derivation of it)? The formalism is the same here. \nFor now check once again my models I posted on November 12, 2014 at 4:55 pm Square, circle and so on. If the model is fairly symmetric, than Fourier image of it is also symmetric. If not, and some directions are preffered, then those directions are portrayed also on Fourier image. \nSo for example the long long horizontal streak in low frequencies on Garlaschelli’s FFT shows there is a distinguishable horizontal  regular structure comprising several vertical bands with low frequency (that is large spatial distance between them).\n\n","date":"November 15, 2014 at 2:49 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171437","author":"O.K.","site":"shroudstory"},{"title":"Why the images and bloodstains were not painted on","post":"Well, I’ve tried this too now, and I don’t get the same image. How do you put your images up here? If I knew, I’d show you what I get. Otherwise I may have to bother Dan again with a pdf!\nHugh, do you use images I post here? Unfortuantely it seems that Imageshack reduces the resolution of images I post. For example the Garlaschlli fragment from the previous post that I use is 1131×1380 pixels, Enrie has 1782×1674 pixels. Probably that’s the problem.\n\n","date":"November 15, 2014 at 3:07 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","id":"comment-171442","author":"O.K.","site":"shroudstory"}]
