[{"title":"Why the Shroud is not a Painting","post":"Dan,\nYour gut may tell you “it’s real” but the existence of the image and it’s attributes are facts. They are an important link in the chain of circumstantial evdience that supports the Shroud’s authenticity. \nPeople go to jail on conclusions derived from circumstantial evidence and plaintiffs collect big judgments. There are some who believe that in the final analysis, all evidence is circumstantial except eyewitness evidence and even Richard Dawkins finds that circumstantial evidence may be more reliable than eye witness evidence.\n(I didn’t want to write this in this post, but I can’t resist. It’s in the book. Note that I no longer refer to it as a manuscript.)\n\n","date":"September 27, 2014 at 6:47 am","url":"https://shroudstory.com/2014/09/27/why-the-shroud-is-not-a-painting/","cat":"image_theory","id":"comment-157181","author":"John Klotz","site":"shroudstory"},{"title":"Why the Shroud is not a Painting","post":"CB wrote: “If one goes to the trouble of producing a life-size double image on up-market linen to represent the imprint left by a real person (no matter whom) then one does not employ a paint brush and artists’ pigments”; he makes use of sweat and blood especially for a crucifixion victim (if I may add up). \nArchsceptics such as Garlaschelli has just ignored this basic parametre from the very start. Hope one day CB will be able to discriminate between very lightly mordanted/pre-scorched and scorched linen.\n\n","date":"September 27, 2014 at 7:58 am","url":"https://shroudstory.com/2014/09/27/why-the-shroud-is-not-a-painting/","cat":"image_theory","id":"comment-157200","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why the Shroud is not a Painting","post":"Dan wrote: “what does that leave. Thermal Imprinting?  Painting with lemon juice?  Non-brushstroke painting methods?  Photography?  Sun bleaching with glass templates?” \nI would add up: Faking a 1st c. CE Judean purification rite (fumigation + drying out of crucifixion victim’s body compressed in shrouds)?\n\n","date":"September 27, 2014 at 8:11 am","url":"https://shroudstory.com/2014/09/27/why-the-shroud-is-not-a-painting/","cat":"image_theory","id":"comment-157205","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why the Shroud is not a Painting","post":"Typo (Sorry typing on an antedeluvian computer): A 1st c. CE Judean purification rite (crucifixion victim’s body compressed in shrouds with large inner burial wrapping soaked in an alkaline solution and dried out via fumigation)\n\n","date":"September 27, 2014 at 8:47 am","url":"https://shroudstory.com/2014/09/27/why-the-shroud-is-not-a-painting/","cat":"image_theory","id":"comment-157208","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why the Shroud is not a Painting","post":"Correction: Faking a 1st c. CE Judean purification rite (in-soaked large inner burial wrapping + fumigation < drying out of crucifixion victim’s body compressed in shrouds?\n\n","date":"September 27, 2014 at 8:20 am","url":"https://shroudstory.com/2014/09/27/why-the-shroud-is-not-a-painting/","cat":"image_theory","id":"comment-157206","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why the Shroud is not a Painting","post":"Colin makes a good point which takes us away from the scientific into the historical context for a possible creation of the Shroud in the 13th or 14th century. He is correct in that, as it stands, the Shroud is far too ‘good.’ Charles will explain this better, no doubt, but I think the essence of a relic was not what it looked like, but how many red episcopal seals attested to its authenticity. Any old bone, any old coat, plants, ironmongery, even any old painting could attract thousands as long as it was solemnly assured to be genuine. At Glastonbury (though I was told this long ago and it may be apocryphal), worried that Walsingham was cornering the market in pilgrimages, it was enough simply to engrave “Hic iacet Arturus” on a slab to attract a new and plentiful source of income to the ‘authentic’ grave of King Arthur and his queen. There was no need to attempt to produce an authentic looking replica of something. If a miracle was involved in the production of a portrait, why shouldn’t it look like a painting anyway?\nThat is why I am more interested in the epitaphios of Eastern Christian ritual. I was intrigued to see that the painting on linen referenced by MikeM a few posts ago is described as a Shroud. Many of the Fayum figures were full length portraits, apparently intended to be placed over the mummies of their subjects. The reason for this is not really known, and the practice died out in the 3rd century, but there may be an echo of it in some Byzantine rites of the Catholic Church, in which the body of Christ, represented by the eucharist, is placed on (and sometimes wrapped in) a cloth specifically stated to represent a shroud. Recently (well, for the last five hundred years or so!), this symbolic shroud (the epitaphios) actually has another shroud painted on it, and the body of Christ lying on that, and often an entire lamentation scene around it, so the cloth itself is a mere carrier for the representation, but echoes of the cloth as itself the shroud may be found in the katasarkion (also strachitsa or srachitsa), a plain linen sheet which is the first cover of the Byzantine altar, fastened to it and not removed after the altar is consecrated. Somewhere between the katasarkion and the epitaphios, I feel, there may have been an intermediate stage in which a cloth, representing the shroud, was given a plain image. There are various reasons why the cloth may have been long and thin (to drape over an altar about 2m long being one of them) and why the image of the dead body was represented as two figures lying head to head (to fill the cloth with image, and to have heads, rather than feet, directly under the rituals of the altar), two aspects of the Shroud which do not imediately make sense in the context of a real burial (when a single body-length sheet is more typical – although there are a few old Egyptian exceptions – and placing the body so that the last thing to be covered is the head also seems more appropriate).\nPure speculation I agree, and if anyone can point me to the development of the epitaphios/katasarkion between, say, the iconoclasm and 1400 AD I’d be fascinated to read it, but development there must have been, and the Shroud would fit quite nicely in that gap. In this context, I feel, the exact nature of the painting could have been any of a number of things, including brush-and-paint or dabbing, colour or monochrome, realistic or impressionistic, or whatever.\nAnd finally – where are all the others? Well quite. There are no contemporary altar covers to compare the Shroud to at all, similar or dissimilar. Pity. Perhaps a reader knows of one?\n\n","date":"September 27, 2014 at 8:50 am","url":"https://shroudstory.com/2014/09/27/why-the-shroud-is-not-a-painting/","cat":"image_theory","id":"comment-157209","author":"Hugh Farey","site":"shroudstory"},{"title":"Why the Shroud is not a Painting","post":"One can have painted objects of veneration – as most icons are. Remember those who visited an exposition of the Shroud at Lirey after 1390 would have been told it was not authentic . Italy is still full of objects of veneration, many if them painted images, so if the Ahrpud were painted this would not rule out its veneration.\n\n","date":"September 28, 2014 at 11:49 am","url":"https://shroudstory.com/2014/09/27/why-the-shroud-is-not-a-painting/","cat":"image_theory","id":"comment-157480","author":"Charles Freeman","site":"shroudstory"},{"title":"Why the Shroud is not a Painting","post":"Sorry , typos. Typing on my IPhone.\n\n","date":"September 28, 2014 at 11:50 am","url":"https://shroudstory.com/2014/09/27/why-the-shroud-is-not-a-painting/","cat":"image_theory","id":"comment-157481","author":"Charles Freeman","site":"shroudstory"},{"title":"Why the Shroud is not a Painting","post":"Well said.  Barrie Schwortz’s back-lit photo shows there is no painter’s stuff on the Shroud that caused the image.\n\n","date":"September 27, 2014 at 9:28 am","url":"https://shroudstory.com/2014/09/27/why-the-shroud-is-not-a-painting/","cat":"image_theory","id":"comment-157214","author":"Andy","site":"shroudstory"},{"title":"Why the Shroud is not a Painting","post":"In most (all?) eucharist rites today, the spreading of a clean LINEN CORPORAL cloth over the semi-permanent altar cloths is required immediately before the service commencement.  [“Corporal” from Corpus(L) = body].  Kim Dreisbach comments on the origins of this practice in his paper comparing the burials of Jesus & Lazarus.  At one time, only the priests were permitted to clean this cloth before sending it to the laundry.\n\n","date":"September 27, 2014 at 4:11 pm","url":"https://shroudstory.com/2014/09/27/why-the-shroud-is-not-a-painting/","cat":"image_theory","id":"comment-157281","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Why the Shroud is not a Painting","post":"How can we trust anything found or not on the shroud? We don’t know who touched it and how it was handled for most of the time. For all we know someone could have wrapped themselves in it hoping for a cure to something. \nI’m not a forensic expert but man talking about messing with a crime scene.\n\n","date":"September 28, 2014 at 2:33 pm","url":"https://shroudstory.com/2014/09/27/why-the-shroud-is-not-a-painting/","cat":"image_theory","id":"comment-157502","author":"John Green","site":"shroudstory"}]
