[{"title":"You may reassure Mr. Berry","post":"Well, I have to say, this is looking increasingly like a stitch up. Dan refers to the “back and forth of comments” between Barrie Schwortz and myself, a coloured description if ever there was. I suggest folk revisit that posting, the one that starts with “a reader writes” and a highly informed one too who relates being acquianted early on with Barrie, and then, in a long, long comment, goes on to refer to John Heller and his book, and the claims made for blood on the “Shroud”. That was my cue tp point out something that I suspect few folk are aware of,  namely that neither Heller no Adler went to Turin to see the linen with their own eyes, relying entirely one assumes on the photographs and/ or sticky-tape slides from Ray Rogers to draw those (in)famous conclusions about “blood that is too red”, speculation re “trauma bilirubin etc all since much proselytzed since by Barrie on his lecture circuits (“for him the real clincher, thanks to world famous “blood expert” Alan D. Adler – porphyrin chemist actually). \nThat’s when things started to turn nasty, with Barrie putting in a rare appearance in which he tried to bracket me with Harry Gove for attempting to attack the credentials of STURP team members with a “personal attack” on John Heller. I replied to the effect that Heller’s failure to go and see the TS with his own eyes, despite having made the first approach to John Jackson, flagging up his interest, was a breach of PROFESSIONAL standards, illustrating my point with analogies from other professions.. \nBarrie Schworts then returned unrepentant to the thread, giving all kinds of reasons why Heller did not need to go to Turin, financial considerations etc etc, re-iterating his claim that I was making a personal attack, despite my having gone  to some trouble to distinguish between lapses of  professionalism and lapses of character, and right at the end chose  to throw in references to things in the past that have clearly bothered him for some time. Why did he not raise them earlier. Might it be because my criticism in the past has been levelled at highly technical details to do with the chemistry etc, and that he didn’t feel competent to get involved. He ended his comment with the most outrageous attack on my character, one of the worst I have encountered in an entire lifetime. And now we have Paolo de Lazzaro piling in for good measure, adding to the choreographed charge sheet. His assumption that he could not be dealing with a fellow PhD is then made an opportunity for Dan Porter to put “Mr.Berry” into his title, the subsequent word play fooling some but not I (having seen Dan Porter’s style of mud-sticks negative spin far too many times already through misuse of titles and ‘jokey’ graphics).\nAs I say, i recognize a stitch up when I see one, and you, Dan Porter are once again showing your true colours as a pro-authenticity manipulator of news and opinion.\nAs for the photochemically- hapless Paolo, I will deal with him in good time on my own site, as I have done many times before. He really needs to acquaint himself with the First Law of Photochemistry, and drop the idea that linen can be regarded as entirely carbohydrate. There’s not a single reference to non-carbohydrate constituents that could act as chromophores, notably lignin in that cited paper of his (but al least it’s free, which is just as well, since  I would never pay good money upfront to read anything that comes from his agenda-driven  laboratory). That’s despite the important paper by Day et al on flax bast fibre lignins with their unusual monomer composition and S1 location having been in the literature for some 10 years. At least Thibault Heimburger noticed, he flagging it up in late 2012 when Hugh Farey brilliantly first suggested lignin as the possible chromophore. Maybe members of the SSG need to talk to each other more, before launching into their misguided experiments, their coloured conclusions.\nI shall now return to my out-of-focus microscope. Strange how it works so well on standard mounted specimens (sectioned tissue etc) and not on whole linen fibres. Might it be something to do with their being cylindrical and highly light-refracting?\n\n","date":"August 27, 2015 at 8:10 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209112","author":"Colin Berry","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"While I find this whole topic is taking us off the rails I agree that Dan’s posting is his way of ‘weighing in’ in the dust-up.\nIn an effort to get us back on point, may I suggest a posting about the latest on the ‘KGB hacker conspiracy’. That seems to be one everyone can be equally dismissive of. :)\n\n","date":"August 27, 2015 at 8:36 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209116","author":"David Goulet","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"Colin,\nYou wrote:\n“…Hugh Farey brilliantly first suggested lignin\nas the possible chromophore…”\nAs you have previously read there was the study\nby Cardamone to take into account…\nOne of the study subjects of my\ncollege course in Textile Engineering was:\n“Textile Chemistry” and in that course there was\nalso a space reserved for the identification and\ncontrol of textile fibers with the help of microscopy\n( ie: with light microscopy and with electron microscopy) …\nOptical Microscopy.\nSpecimen Contrast in Optical Microscopy.\n>Athough transparent specimens usually induce\nphase shifts to interacting light beams though\nscattering and diffraction, these objects remain\ninvisible in the microscope because the human eye\ncannot detect differences in phase.\n>Unless the specimen is stained with highly colored dyes,\nthe only alternative available to the microscopist\nis to significantly reduce the condenser working\nnumerical aperture by closing the iris diaphragm.\n>However, this extreme measure will significantly\nimpair nthe resolution of the objective.\n>The optical systems contained in modern\nmicroscopes may be capable of producing\nhigh resolution images at high magnifications,\nbut such a capability is worthless without\nsufficient contrast in the image.\n>Contrast is not an inherent property of\nthe specimen, but is dependent upon interaction\nof the specimen with light and the efficiency of\nthe optical system coupled to its ability to reliably\nrecord the image information with a suitable detector.\n>Control of image contrast in the microscope\noptical system is dependent upon several factors,\nincluding proper setting of aperture diaphragms,\ndegree of optical aberration, the contrast mechanism\nemployed, the type of specimen, and the characteristics\nof the detector.\n>Aside from specialized contrast-enhancing accessories,\nthere are several locations in the microscope that enable\nthe operator to adjust contrast.\n>The most critical to the optical system are\nthe field and condenser aperture diaphragm settings,\nbut contrast can also be manipulated by varying\nelectronic camera (or traditional emulsion film) gamma,\naltering the magnification for video detectors,\nprocessing images in real time, as well as specimen staining. …\n>…The term contrast refers to the ability of an\nindividual specimen detail to be distinguished\nwhen compared to the background or other\nadjacent features. In effect, contrast is defined\nas the difference in light intensity between\nthe specimen image and the adjacent background\nrelative to the overall background intensity.\n>Specimen properties that produce changes\nin brightness, or color differences, arise from\nlight absorption, reflection, spatial variation in\nrefractive index, scattering, diffraction, birefringence,\nfluorescence and similar optical phenomena.\n>In general, contrast is measured by the relationship\nbetween the highest and lowest intensity in an image…\n>…An early, but still currently employed\n of increasing contrast in stained specimens utilizes color contrast filters,\nWratten lacquered gelatin squares (from Kodak), or interference filters\nin the light path.\n>For example, if a specimen is stained with a red stain,\na green filter will darken the red areas, thus increasing contrast.\n>On the other hand, a green filter will lighten any green stained area. …\n…\n>…Another simple technique for contrast improvement\ninvolves the selection of a mounting medium with\na refractive index substantially different from that\nof the specimen. …\n>… The difference in refractive indices improves\nthe contrast of these colorless specimens and\nrenders their outlines and markings more visible. …\n\n","date":"August 28, 2015 at 8:50 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209203","author":"piero","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"Source (about previous excerpts):\n“Specimen Contrast in Optical Microscopy”\nNikon MIcroscopy\n© copyright 2000-2013 All Rights Reserved\nLink:\nhttps://www.microscopyu.com/articles/formulas/specimencontrast.html\nSo…\nI want add that you could try to take some better optical images from your samples, following the right path…\nSee also: stainings and possible microchemical reactions\nto test your linen samples.\nYou certainly knows very well that:\n…microchemical reaction on starch is made by a drop solution of Iodide in Potsssium Iodide in water or in alcohol being added to one side of the covergalss and being brought under the coverglass by applying a small strip of filter paper on the other side. In this way the changing color of the starch to blue can be followed. In the beginning the layers become clearer, but later on they are no longer visible owing to the intensive color reaction. …\nSo…\nYou have to show us what are the situations on your linen fibrils before and after the treatments.\n\n","date":"August 28, 2015 at 9:24 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209206","author":"piero","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"Paolo writes, “It is evident Mr. Berry is not trained in microscope imaging. Our students can do a better work.”   Yet he does not provide a single example to back up this accusation against Colin.\nNotice I didn’t use the title ‘Dr.’ for either gent. I think I’ll reserve that title for those that take the Hippocratic oath.\n\n","date":"August 27, 2015 at 8:31 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209115","author":"David Goulet","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"As I understand it, those who take the Hippocratic oath are generally academically qualified as a Bachelor of Medicine, and in British traditions, the appellation “Doctor” has often been deemed as no more than a courtesy title.  In US traditions, the courtesy extends to those qualified as bachelors of dentistry and veterinary science.  In non-English language traditions, such professionals tend to be addressed according to the their specific discipline.  Recollections of school-boy French if memory serves correctly, for example would include such as M. le medecin (name), or M. l’ingenieur (name), and the term ‘docteur’ would be limited to those with the highest academic degree in the particular discipline.  Collins’ English dictionary gives some 13 separate meanings for the noun ‘doctor’, including informal allusions.  Woodhouse’s Latin dictionary assigns the L. noun ‘doctor’ as a teacher, and the term for a physician is ‘medicus’.\n\n","date":"August 27, 2015 at 3:25 pm","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209150","author":"daveb of wellington nz","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"I’ve been on this site since Jan 2012  DavidG, and folk here know that I’m quite happy to be addressed as Colin, and be judged by current research, only making reference to prior published work – or my doctorate – when sorely provoked.\nHowever I am now sorely provoked. This is not the first time that Dr .Paolo Di Lazzaro has crashed in on this site and addressed me as though I were a rank amateur. For his information, he was just 12 when at age 26 I took up my first full scientific research post at the University of Pennsylvania (1972). What’s more, the project was pure photochemistry (phototherapy of neonatal jaundice)  where one quickly learned the importance of identifying the precise chemical nature of the chromophore when investigating a light-driven reaction, whether using visible light or uv, whether using a high intensity mercury lamp as I was, or an excimer laser.\nWhat astounds me is Paolo Di Lazzaro’s assumption that the chromophore in his linen has to be cellulose. I see from that 2012 paper of his that he now thinks the cellulose must have mysteriously acquired a priming double bond from somewhere to be able to absorb uv light efficiently and undergo photochemical reaction.  Well, that’s progress of sorts I guess. But why the fixation with cellulose? Why has he not considered the non-carbohydrates, especially those like lignin and phenolics with  C=C double bonds in profusion, albeit as delocalised aromatic ring systems?\nMaybe if he’d chosen a hypothesis that was scientific, i.e. testable, one that was able to generate predictions, he’d have got round to doing simple checks on his preconceptions, like testing cotton as well as linen, cotton being closer to pure cellulose.\nI’ve actually done that experiment using my model system. I predicted that while I might get a coloration it would look different under the microscope. That hypothesis has been confirmed: linen gives the typical ‘half-tone’ effect with a mixture of coloured and uncoloured fibres that I’m inclined to ascribe provisionally  to internal S1 lignin. Cotton does NOT, there being a general slur of colour with no obvious fibres that are more coloured than others. You read it here first. I’ll put some of those pictures up tomorrow, but  they will be blurred, simply because my microscope has no depth of focus. But we cope – by focusing in or out until satisfied we have assimilated the big picture, taking in lots of reference points.\nYes, Dr. Di Lazzaro, this retired  PhD scientist probably know a great deal more than you about photochemistry and much else besides where chemistry, plant science and biochemistry are concerned. Indeed they are disciplines that scarcely feature at all in your written work, despite the fact that laser-generated light, uv included, has to obey the same laws of photochemistry as non-coherent light. I think it’s time you got off that high horse of yours Dr. Di Lazzaro, and began to wise up on what a TESTABLE scientific hypothesis is currently achieving (that’s mine in case you were wondering) and drop that fixation of yours with boring old cellulose.\n\n","date":"August 27, 2015 at 4:15 pm","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209157","author":"Colin Berry","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"There’s a rank smell coming out of this site right now. It’s the smell of stitch up. It began with that very curious Oh Vey posting, the one where “a reader writes” (Yeah, right)  It was on that thread that John Klotz, Dan’s “personal friend” (so he said in an email) accused this blogger.scientist of being “disingenuous”, i.e. insincere, attempting to hide motives, that being needless to say a serious slur on my character if ever there was, and indeed not the first, and it’s been downhill all the way ever since (with Barrie Schwortz piling is with his sustained character attack and now Paolo Di Lazzaro with his attack on my scientific and technical competence. That’s rich I have to say, coming from the photochemically-illiterate Dr. Di Lazzaro, nuff said,\nWell, one doesn’t need to be paranoid to see what’s going on here. I knew from the outset that I was taking a risk using the internet to disseminate real-time research that had as its chief objective a desire to debunk Di Lazzaro and his theo-so-called-science, content to blast linen with ultraviolet and then claim, without a shred of evidence, that he had achieved a coloration comparable to that of the Shroud, ipso facto supranormal in the context of a 1st century tomb. No, it’s not the job of scientists to “make people think about philosophy and theology, Dr .Paolo Di lazzaro).\nI shall now wind up my project, with a short 500-1000 word summary on my own site, and then take a long holiday from the internet, this insidiously nasty site in particular (Hugh Farey and DavidG being the rare breath of fresh air. Nice book by the way, LooneyTomb David.).\nOh, and I’ve changed my mind about posting any more pictures from my microscope. There will be verbal descriptions instead. If some don’t like taking things on trust from this seasoned investigator whose microscope happens to lack depth of field then there’s a simply remedy. Buy your own microscope, DO IT YOURSELF!\nWhere this site is concerned I am now available by email contact only:\nsciencebod01@aol.com\nI shall not be responding here to comments.\n\n","date":"August 28, 2015 at 1:37 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209184","author":"Colin Berry","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"All jobs complete. Goodbye internet. Take care.\nhttps://shroudofturinwithoutallthehype.wordpress.com/2015/08/28/might-flour-power-have-been-used-create-the-enigmatic-shroud-of-turin-body-image-a-retired-fmbra-flour-scientist-says/\n\n","date":"August 28, 2015 at 9:36 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209207","author":"Colin Berry","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"Come Holy Spirit.\nfill the hearts of the faithful.\nKindle them in the spirit of your love.\nSend forth your Spirit\nand they shall be created.\nAnd You shall renew the face of the earth.\nO, God, who by light of the Holy Spirit,\ndid instruct the hearts of the faithful,\ngrant that by the same Holy Spirit\nWe may be truly wise\nand enjoy His consolations,\nThrough Christ Our Lord, Amen.\nColin, do you believe by the light of the Holy Spirit you are truly wise?\n\n","date":"August 27, 2015 at 5:29 pm","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209162","author":"Stan Walker, MD","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"What is it you hope to achieve by asking that question, Stan Walker MD? Why not ask a meaningful one, like “Do you consider the “Shroud” of Turin was created in medieval times?” and if so “Was it made by flour-imprinting”? Answering those questions requires (a) relevant information and (b) judgement – scientific, historical etc. Whether it requires wisdom or not I could not say.\n\n","date":"August 27, 2015 at 6:04 pm","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209166","author":"Colin Berry","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"Come on Stan, you know better than to ask a question like that.  It is irrelevant and insulting.\n\n","date":"August 28, 2015 at 2:47 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209185","author":"Dan","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"And Colin can insult Di Lazzaro ad nauseam?  Some of us find Colin’s “theory du jour” bordering on entertaining to insulting.  Come on Dan,  Jesus coated with flour and half baked?  Why not Jesus fricassee?  Many of us are extremely well educated in the sciences and are not bamboozled by Colin’s liberal use of chemical terminology and his verbosity.  I value Colin’s contributions because he is interesting.  His concepts are a stretch scientifically and only if one ignores a plethora of all other scientific data on the shroud.  And you ignore Colin’s insults to those – in the medical field – who identify forensic data on the shroud that defies explanation.\n\n","date":"August 28, 2015 at 6:53 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209197","author":"Stan Walker, MD","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"I would be insulted if you asked me “do you believe by the light of the Holy Spirit you are truly wise?” even though I make it clear that I believe in the Trinity. And by the way he was talking about a medieval man coated with flour, not Jesus. \nStan, he is the only serious skeptic who in many years has been very creative and done extensive experimenting. What he believes — and that is his business — is of no consequence to what he does as a scientist. Should we ask someone in the medical field if he believes by the light of the Holy Spirit that he is truly wise?\nColin has been very insulting of many people. I have pointed that out.  You have also been insulting and I am pointing that out. Why not explain why you are “not bamboozled by Colin’s liberal use of chemical terminology and his verbosity” rather than hinting at religious heresy as a reason? Why not be truly wise?\nSorry, Stan, but that is what I think.\n\n","date":"August 28, 2015 at 7:23 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209200","author":"Dan","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"Point of clarification. Colin has never claimed that Jesus was covered in flour and half baked. He proposes a medieval artisan may have done this to a live or dead ‘volunteer’ whose features resembled the popular image of Jesus. The person was not baked, only the linen with the flour imprint. If you’re going to ridicule the theory at least appear to have understood it.\n\n","date":"August 28, 2015 at 8:01 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209202","author":"David Goulet","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"It is all too well understood David.  In debate terminology this tactic is known as a riposte.  The point inferred is Colin’s theory is half-baked.  The Bread has risen.\n\n","date":"August 28, 2015 at 8:55 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209204","author":"Stan Walker MD","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"Sorry, Dan. Thought I’d posted this under Stan’s comment.\n\n","date":"August 28, 2015 at 9:08 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209205","author":"David Goulet","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"The problem with some scientists is the ego cannot fit in the room.\n\n","date":"August 28, 2015 at 7:07 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209198","author":"Dcn Andy","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"You hit the nail on the head Dcn Andy.  Let’s see if Colin gets published in a peer reviewed scientific journal.  Maybe he would rather be on a sensationalist TV program.\n\n","date":"August 28, 2015 at 7:23 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209201","author":"Stan Walker, MD","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"Here few very simple questions to answer:\nWhat is the thickness of PCW?\nWhat is the thickness of S1 layer?\nWhat is the lignin content in PCW?\nWhat is the lignin content in S1 layer?\nHow is possible to measure the lignin content in PCW ?\nHow is possible to measure the lignin content in S1 layer?\n— — —\nHere two extremely vague references\n(papers written by Fergus, but not centered on flax/linen):\n– Fergus, B.J., and Goring, D.A.I. (1970).\nThe distribution of lignin in birch wood\nas determined by ultraviolet microscopy.\nHolzforschung. 24, 118–124\n-Fergus, B. J., Procter and other researchers. 1969.\nThe Distribution of Lignin in Sprucewood\nas Determined by Ultraviolet Microscopy.\nWood Sci. Technol., 3, 117-138.\nHere another vague reference:\nStructural Characterization of Guaiacyl-rich Lignins in Flax (Linum usitatissimum) Fibers and Shives\nJosé C. del Río, Jorge Rencoret, Ana Gutiérrez, Lidia Nieto, Jesús Jiménez-Barbero, and Ángel T. Martínez\nLink:\nhttp://pubs.acs.org/doi/abs/10.1021/jf201222r\nHere an excerpt from the abstract:\n>The structural characteristics of the lignins from flax\n(Linum usitatissimum) fibers and shives were studied.\n>Significant differences in the content and composition\nof the lignin from both parts were observed.\n>The lignin contents were 3.8% in the fibers\nand 29.0% in the shives. … etc. …\n\n","date":"August 28, 2015 at 9:42 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209208","author":"piero","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"Do you know how to work with “lignin level measured\nwith modified acetyl bromide method”? \nReference:\nIiyama K, Wallis AFA:\nDetermination of lignin in herbaceous plants by an improved acetyl bromide procedure.\nJ Food Sci Agric 1990, 51:145-161. Publisher Full Text OpenURL\nReturn to text\n\n","date":"August 28, 2015 at 9:47 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209211","author":"piero","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"Lignin content\n>Total lignin content was measured with the modified ‘acetyl-bromide’ method [86]. Briefly, dried and grounded into powder tissue samples were heated for 1 hour at 65°C with water and further filtrated through GF/A filters which was followed by washing several times with different organic solvents (in turn: ethanol, acetone, diethyl ether). Such prepared samples were dried for 12 hours and then, after adding 25% acetyl-bromide in acetic acid samples were incubated for 2 hours in 50°C and further dissolved in 10 ml of 2 N NaOH mixed with 12 ml acetic acid. After incubating for at least 12 hours at room temperature lignin content was measured spectrophotometrically at 280 nm. The results were given as an equivalent of coniferyl alcohol. …\nLink:\nhttp://www.biomedcentral.com/1471-2229/14/50#B86\nBut this work seems to be too far from the “normal textile studies” on linen fibrils…\nThen : it’s near impossible to work in this manner.\n\n","date":"August 28, 2015 at 9:50 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209213","author":"piero","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"Then we can think something about the SNOM\n(= Scanning near-field optical microscopy) and Raman microscopy for characterisation of lignin in linen fibrils…\n\n","date":"August 28, 2015 at 9:53 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209214","author":"piero","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"SNOM\nLink:\nhttps://en.wikipedia.org/wiki/Near-field_scanning_optical_microscope\n>Near-field scanning optical microscopy (NSOM/SNOM) is a microscopy technique for nanostructure investigation that breaks the far field resolution limit by exploiting the properties of evanescent waves. This is done by placing the detector very close (distance much smaller than wavelength λ) to the specimen surface. >This allows for the surface inspection with high spatial, spectral and temporal resolving power. With this technique, the resolution of the image is limited by the size of the detector aperture and not by the wavelength of the illuminating light. In particular, lateral resolution of 20 nm and vertical resolution of 2–5 nm have been demonstrated.\n>As in optical microscopy, the contrast mechanism can be easily adapted to study different properties, such as refractive index, chemical structure and local stress.\n>Dynamic properties can also be studied at a sub-wavelength scale using this technique.\nHowever, before we get to talk about these advanced techniques (SNOM, etc.), you could try to do something with the PLM.\nBut if you can not even use the PLM then think at least improve the technical control with the normal optical microscopy technique.\nThe depth of field (penetration into fibrils) and the real possibility to use SPMs (Scanning Probe\nMicroscopies) are another matter to do, after deepening the OM (= Optical Microscopy).\n— — *** — —\nLIGNIN, cellulose (the two weak substances like lignin and cellulose with combining together makes much stronger) and vague ideas (to develop)…\nHere a vague idea about new works on Lignin using Laywood…\nThere’s a product called Laywood that’s been on the market for a couple years now…\nSpinnova Ltd. has developed a technology which can be used to manufacture yarn directly from wood fibres without chemical process. This innovation is a significant, breakthroug technology, which can revolutionize both textile and forest industry and create new meaningful business activities.\nPerhaps it’s possible to do some interesting work about lignin using Laywood and SPM controls… \nLinks:\nhttp://www.advantageaustria.org/fi/oesterreich-in-finland/news/local/20150622_Lenzing_AG.en.html\nhttp://phys.org/news/2015-06-cellulose-wood-d.html\nhttp://blogs.howstuffworks.com/brainstuff/how-arboform-works-a-plastic-made-of-lignin-from-wood-that-biodegrades-like-wood.htm\nSo the question can turn to be the following:\nHow to develop creativity in other areas ?…\n(… and this because we do not like too to show the appropriate images [of linen fibrils and thin layers] in optical microscopy… and we don’t study how to detect Lignin modifications…)\n… Pranks or not?\n\n","date":"August 28, 2015 at 11:21 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209219","author":"piero","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"Optical Microscopy.\nHere I post some links for those interested\nin the continuation of the discussion about\nthe proper use of optical microscopy.\nLinks:\nhttp://nzetc.victoria.ac.nz/tm/scholarly/tei-Bio23Tuat01-t1-body-d2.html\n— —\n>The primary advantage of Köhler illumination is\nthe extremely even illumination of the sample.\n>This reduces image artifacts and provides\nhigh sample contrast.\n>Even illumination of the sample is also critical\nfor advanced illumination techniques such as\nphase contrast and differential interference contrast microscopy…\nLink:\nhttps://en.wikipedia.org/wiki/K%C3%B6hler_illumination\nOther links:  \nhttps://en.wikipedia.org/wiki/Differential_interference_contrast_microscopy\nhttp://www.microscopemaster.com/differential-interference-contrast.html\nhttps://en.wikipedia.org/wiki/Phase_contrast_microscopy\n\n","date":"August 30, 2015 at 7:30 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209302","author":"piero","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"I want to test Colin’s model.\nBut what is currently his best model ?\n\n","date":"August 30, 2015 at 3:02 pm","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209315","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"THIS IS MY ANSWER TO COLIN I WISHED TO PUBLISH ON HIS SITE FOLLOWING HIS ANSWER TO MY QUESTION ABOVE.\nhttp://colinb-sciencebuzz.blogspot.co.uk/2015/08/is-high-energy-laser-beam-really-needed.html\n(Update 31 August)\nSorry Colin, but I am unable to post this comment on your site, \n“Thanks Colin,\nI’ll try it but probably without oil.\nI do not understand why oil is needed in order to give the best shroud-like image.\nIn other words, what is not good enough with the dry-flour/wet linen model ?\nYou might be right or not.\nAt the end I will show my results, including microscopy.\nAnd also after ageing the samples (why did not you try artificial ageing ?)\nI need some weeks for this work.\nYou wrote: “Do you know of a modelled image that has a closer match with the TS?”\nAt first glance, no.\n“Isn’t that obvious TH – you having visited this site yesterday (sitemeter ;-)?”\nTrue.\nDo you spy on me ? No problem ;-)\nThibault.\n\n","date":"August 31, 2015 at 2:34 pm","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209379","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"You may reassure Mr. Berry","post":"Do you know “Dark field microscopy”?\nLink:\nhttps://en.wikipedia.org/wiki/Dark_field_microscopy\n>Dark field microscopy (dark ground microscopy)\ndescribes microscopy methods, in both light and\nelectron microscopy, which exclude the unscattered\nbeam from the image. As a result, the field around\nthe specimen (i.e., where there is no specimen\nto scatter the beam) is generally dark. …\n…just for fun!\n\n","date":"September 5, 2015 at 10:31 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","id":"comment-209657","author":"piero","site":"shroudstory"}]
