[{"title":"You shroudies and your fallacious thinking","post":"Clearly ‘a reader’ (should that be ‘a casual visitor’?) does not actually read much of the “endless blogging” or he would have learnt that miracles rarely get much of a look-in, at least round here. Generally, Shroudies (not a term I am keen on) are either people who are trying to explain the shroud without recourse to miracles, or people who accept it is a miracle and explore its spiritual meaning. There are surely only very few people trying to prove a miracle by excluding all other methods, although some people are trying to disprove a miracle by discovering a method.\nConsequently, I object to the statement that “You Shroudies [me?] always fall back on a single argument [no, I don’t]… ”\nNo doubt “a reader,” after reading, say, the last year’s worth of entries on this blog, will agree that:\n “You non-Shroudies always fall back on a single argument. First you invent a opinion you claim is held by all Shroudies, then you counter-claim that it is false by calling it a God-of-the-Gaps fallacy. Don’t you Non-Shroudies see that this is a classic Straw Man fallacy?”\n\n","date":"November 7, 2012 at 11:18 am","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-18868","author":"Hugh Farey","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"If this image was formed miraculously, that mean God would be a very poor artist !  HA HA HA !!!  Effectively, the image on the Shroud has been proven long ago to be incomplete (for example, a good portion of the feet are missing, as well as the back of the knees) AND slightly distorted in many places (even if it’s almost impossible to see with the naked eyes, the distorsions are very real).\nBecause of this and also because a lot of data from the Shroud strongly suggest that the image was formed naturally, I have to agree almost 100% with the reader’s comment, except for one thing:  his comment cannot be applied to every “shroudies” out there because I’m one of them and I don’t trust for 2 seconds that the image was formed in any way miraculously (by a direct act of God or even by a “by-product” of the Resurrection).  I think this reader should have used the term “supernatural fringe” instead, because his comment truly apply to this sad category of person…\nAnd to those who will be tempted to spit on me once again, I just want to say this (which is an expression we use often in Quebec):  “If the hat fits on you, put it on!!!”\nBy the way, I truly believe the Shroud is the authentic burial cloth of Jesus of Nazareth and I truly believe that Jesus really Resurrected.  So, before thinking that there’s just 2 ways to see the Shroud (like a forgery or like an act of God), please understand that there are still a few people like me who are located right in-between those extremes!!!\n\n","date":"November 7, 2012 at 11:43 am","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-18869","author":"Yannick Clément","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"Precision: Of course, when I say that I truly think the image has been formed naturally, I refers to a biological interraction between the body of Jesus and the thin layer of impurities located at the surface of this antique burial Shroud.\n\n","date":"November 7, 2012 at 11:46 am","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-18870","author":"Yannick Clément","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"This is a popular mental illness that insists a miracle must be an event that cannot be explained naturally because the moment you do it ceases to be a miracle. Perhaps this idea itself needs to be reevaluated? \nAs a Christian I believe nature itself is miraculous. The more we learn about it, the more mysterious and bizarre it all is — counter-intuitive you could even say. Ever heard of the “miracles of science”? 600 years ago the common man would’ve called our smart phones a “miracle” or “magic.” Being able to explain how it works (to an extent) doesn’t make it any less amazing as we see how the faithful, impalpable and invisible laws of nature — implicating such a faithful law giver — work together and are amenable to our sensorium, nay, our very existence and reality. “Miracles” become all the more impressive when studied with the tools of science/logic, not despite them. \n“Supernatural” is not a biblical term anyway. \nRather, miracles of the bible are very often rare, unusual, highly ‘synchronistic’ events (“signs”) that bear witness to a higher authority in control of events or time/space (interestingly the Hebrew term מוֹעֵד ‘moed’ can mean time or space). Miracles occur in nature because we are in nature, otherwise how could one bear witness to a miracle without using natural phenomena (sight, hearing, touching, etc)? But miracles don’t have to be one-off events in history — human reproduction itself is a miracle, yet it happens constantly. Science by itself cannot explain why it should happen at all, or how it does what it does; we can just tell a bit about what happens as it occurs, muck around with various processes and given materials, but we cannot recreate it from scratch (reproduce reproduction?) with sheer ingenuity, which would only be a product of our nature anyways. This is not to say we never could. As a Christian I also believe we will inherit all the mysteries of nature and be One with Elohim in YHWH as Christ is One body. But before this power is fully invested, one must be purified to enter in the inheritance, born of the spirit, otherwise you have chaos and confusion: \nGenesis 11:6-9  “And the LORD [YHWH] said, Behold, the people is one, and they have all one language; and this they begin to do: and now nothing will be restrained from them, which they have imagined to do. Go to, let us go down, and there confound their language, that they may not understand one another’s speech.  So the LORD [YHWH] scattered them abroad from thence upon the face of all the earth: and they left off to build the city. Therefore is the name of it called Babel [Confusion]; because the LORD [YHWH] did there confound the language of all the earth: and from thence did the LORD [YHWH] scatter them abroad upon the face of all the earth.”\nThis scattering and confusion was an act of mercy, otherwise the unrestrained wickedness of man would leave no flesh left alive. Man is not ready for the responsibility of such awesome power, so this life is an opportunity to test of our talents to see what we are to inherit in the next, tried in the fire and purified as silver, but we have the potential in us now being made in the image of Elohim, and under the righteous rule of Yeshua we will be given this authority as sons of Elohim to subdue all misguided authorities and powers to bring out their best and share in their glory as one “And when all things shall be subdued unto him, then shall the Son also himself be subject unto him that put all things under him, that God may be all in all” 1 Corinthians 15:28. “Beloved, now are we the sons of God, and it doth not yet appear what we shall be: but we know that, when he shall appear, we shall be like him; for we shall see him as he is” 1 John 3:2.\nThe shroud is a palpable token of this hope, a record of eternal life, being careful not to idolize it. For those with ears to hear:\n1 John 5:4-21  “For whatsoever is born of God overcometh the world: and this is the victory that overcometh the world, even our faith.  Who is he that overcometh the world, but he that believeth that Jesus is the Son of God?  This is he that came by water and blood, even Jesus Christ; not by water only, but by water and blood. And it is the Spirit that beareth witness, because the Spirit is truth.  For there are three that bear record: the Spirit, and the water, and the blood: and these three agree in one. If we receive the witness of men, the witness of God is greater: for this is the witness of God which he hath testified of his Son. He that believeth on the Son of God hath the witness in himself: he that believeth not God hath made him a liar; because he believeth not the record that God gave of his Son. And this is the record, that God hath given to us eternal life, and this life is in his Son. He that hath the Son hath life; and he that hath not the Son of God hath not life. These things have I written unto you that believe on the name of the Son of God; that ye may know that ye have eternal life, and that ye may believe on the name of the Son of God.  And this is the confidence that we have in him, that, if we ask any thing according to his will, he heareth us: And if we know that he hear us, whatsoever we ask, we know that we have the petitions that we desired of him. If any man see his brother sin a sin which is not unto death, he shall ask, and he shall give him life for them that sin not unto death. There is a sin unto death: I do not say that he shall pray for it.  All unrighteousness is sin: and there is a sin not unto death.  We know that whosoever is born of God sinneth not; but he that is begotten of God keepeth himself, and that wicked one toucheth him not.  And we know that we are of God, and the whole world lieth in wickedness.  And we know that the Son of God is come, and hath given us an understanding, that we may know him that is true, and we are in him that is true, even in his Son Jesus Christ. This is the true God, and eternal life. Little children, keep yourselves from idols. Amen.”\n2 Corinthians 3:18 – 4:18 “But we all, with open face beholding as in a glass [mirror, ie mirror image] the glory of the Lord, are changed into the same image from glory to glory, even as by the Spirit of the Lord. Therefore seeing we have this ministry, as we have received mercy, we faint not; But have renounced the hidden things of dishonesty, not walking in craftiness, nor handling the word of God deceitfully; but by manifestation of the truth commending ourselves to every man’s conscience in the sight of God. But if our gospel be hid, it is hid to them that are lost: In whom the god of this world hath blinded the minds of them which believe not, lest the light of the glorious gospel of Christ, who is the image of God, should shine unto them. For we preach not ourselves, but Christ Jesus the Lord; and ourselves your servants for Jesus’ sake. For God, who commanded the light to shine out of darkness, hath shined in our hearts, to give the light of the knowledge of the glory of God in the face of Jesus Christ. But we have this treasure in earthen vessels [Murdoch tr: in an earthen vessel], that the excellency of the power may be of God, and not of us. We are troubled on every side, yet not distressed; we are perplexed, but not in despair; Persecuted, but not forsaken; cast down, but not destroyed; Always bearing about in the body the dying of the Lord Jesus, that the life also of Jesus might be made manifest in our body. For we which live are alway delivered unto death for Jesus’ sake, that the life also of Jesus might be made manifest in our mortal flesh. So then death worketh in us, but life in you. We having the same spirit of faith, according as it is written, I believed, and therefore have I spoken; we also believe, and therefore speak; Knowing that he which raised up the Lord Jesus shall raise up us also by Jesus, and shall present us with you.  For all things are for your sakes, that the abundant grace might through the thanksgiving of many redound to the glory of God.  For which cause we faint not; but though our outward man perish, yet the inward man is renewed day by day. For our light affliction, which is but for a moment, worketh for us a far more exceeding and eternal weight of glory;”\nPaul like John, reminds us not to idolize this token of the miraculous:\n“While we look not at the things which are seen, but at the things which are not seen: for the things which are seen are temporal; but the things which are not seen are eternal.”\n\n","date":"November 8, 2012 at 2:53 pm","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-18895","author":"EGM","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"The conclusion that “it must be miraculous” because science has yet been able to explain the image formation process is a ludicrous claim, probably made by someone who is not a scientist.  The question then becomes “how much time must pass before you will accept that it must be a miracle because science cannot explain it?”  I would find this line of argumentation to lack real thought or consideration.  \nThe real underlying problem with this view is that one cannot comprehend how science and religion can co-exist, much less support and help one another along the process of inquiry, research and discovery.  Yet just as science is a discipline governed by rules of inquiry, etc., so is theology and religion.  This claim flies in the face of the rules of inquiry for theology and religion.\n\n","date":"November 9, 2012 at 12:04 am","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-18905","author":"Andy Weiss","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"100% agreed (if I read “The conclusion that “it must be miraculous” because science has yet been UNable to explain the image formation process, is a ludicrous claim, probably made by someone who is not a scientist.\n\n","date":"November 9, 2012 at 6:17 am","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-18916","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"or “The conclusion that “it must be miraculous” because science has NOT yet been able to explain the image formation process, is a ludicrous claim, probably made by someone who is not a scientist”.)\n\n","date":"November 9, 2012 at 6:21 am","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-18917","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"The fact is neither arch-miraculists nor arch-anti-authenticists are ready to really hear the scientific, exegetic, archaeological truth…\n\n","date":"November 9, 2012 at 6:13 am","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-18914","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"typo: exegetical\n\n","date":"November 9, 2012 at 6:15 am","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-18915","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"There seems to me to be two polarised views in the above discussion.  On the one hand there seems to be more than what could be considered a reasonable reluctance to admit the possibility that the image of the Shroud might be miraculous, when in fact it may be so miraculous.  Certainly it is not sufficient to say that because science cannot explain the image it must be miraculous.  I think there would have to be a reasonable expectation that science would never be able to explain the happening, before an occurrence could qualify as a miracle.  It needs to be shown that the imprinting of the image transcended the laws of naure, before it could be accepted as miraculous. \nThe opposite view is perhaps illustrated by EGM’s comments who clearly has a quite proper sense of wonder at all the marvels of creation, which I can certainly empathise with.  I personally believe that all the marvellous coincidences that occur in nature is sufficient evidence for me of the presence of God.  \nHowever to be technically honest, this marvellous creation cannot be called miraculous, if we stick to the strict meaning of the word.  For all that we ordinarily see is in accord with its own nature.  A miracle can only be said to occur when something happens that transcends its nature, and it requires divine intervention to bring it about.  \nTo find out what miracles are all about, is only a click away.  But be warned!  You’ll need a spare weekend to get on top of it, and a damp towel around your head to master it.\nGo to the Catholic Encyclopedia site, where there’s more discussion there than most of us could ever manage to cope with.  You’ll find it at:\nhttp://www.newadvent.org/cathen/10338a.htm \nAfter a quick scan through it, I’m still ready to assert that the image on the Shroud MAY be a miracle.  And then, of course, it might just be in the nature of what happens when an uncorrupted body can discard its own burial cloth before it starts to get really messy.  Is this meant to be irony? Perhaps!\n\n","date":"November 9, 2012 at 6:52 am","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-18918","author":"daveb of wellington nz","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"\ndaveb of wellington nz :\nthis marvellous creation cannot be called miraculous, if we stick to the strict meaning of the word.  For all that we ordinarily see is in accord with its own nature.  A miracle can only be said to occur when something happens that transcends its nature, and it requires divine intervention to bring it about.\n\nThat’s the point, the miracles that happen are in accordance with nature and not in violation of it. Let’s not mistake breaking the laws of nature with “freak” occurrences at just the right moment which is foretold or signaled somehow, ie, Christ fulfilling 100s of minute details of prophecy/laws/calendar feasts/foreshadowing/astronomical signs the magi saw and we can see with professional software giving powerful signs, etc, or Moses told to raise his staff, then a strong wind blew all night until the sea parted (wind setdown) and “congealed” just long enough for them to pass — and there just happens to be a narrow underwater ridge with a gentle slope still seen today — til the waters finally crashed down on the Egyptians behind them, etc.\nRe: transcending nature – Man some 500 years ago would’ve said huge mechanical metal birds cruising through the air 1000s of miles carrying tons of cargo would be in violation of the laws of nature/transcend nature – but that doesn’t make it so. Miracles do not transcend nature simply because they are a part of nature, and must be, otherwise how does one witness them in the first place via natural phenomena (sight, hearing, touching?). Saying miracles must not be able to have a logical/scientific explanation is to rig the deck from the start; it’s almost miraculous how widespread such an absurd idea has caught on. As far as I know, it was Thomas Aquinas who first popularized (re-popularized?) this schizophrenia and we’ve been plagued ever since. Nature itself (as we know it) required “divine intervention” because before law and order existed in the universe (as we know it) via the Word/Logos or as in the Aramaic NT, “Miltha” (meaning “word”, “matter”, “manifestation”, “power”, “utterance”, etc.), there was chaos/darkness. \nAnd as an aside because this goes back to something brought up before: the “Logos” idea is widely assumed to be a Greek concept, however this ignores the fact that the primordial “Word” was already mentioned in the Hebrew OT, for example: \nPsalm 33:6  “By the word [dabar] of YHWH the heavens were made, And by the breath of His mouth all their host.” \nPsalm 147:15 “He sends forth His command [imrah] to the earth; His word [dabar] runs very swiftly.”\nThis “Word” took on extensive anthropomorphic development in the Aramaic Targumim which were read side by side with the Hebrew as a paraphrase/explanation in ancient synagogue after the return from Babylon when everyone spoke Aramaic and most forgot Hebrew. This tradition goes back to Nehemiah 8.8 “So they read in the book in the law of God distinctly, and gave the sense, and caused them to understand the reading.”\nAlso, from Gill’s Exposition: \n“The phrase, “the word of the Lord”, so frequently used by the Targumists, is well known: and it is to be observed, that the same things which John here says of the word, they say likewise, as will be observed on the several clauses; from whence it is more likely, that John should take this phrase, since the paraphrases of Onkelos and Jonathan ben Uzziel were written before his time, than that he should borrow it from the writings of Plato, or his followers, as some have thought; with whose philosophy, Ebion and Cerinthus are said to be acquainted; wherefore John, the more easily to gain upon them, uses this phrase, when that of the Son of God would have been disagreeable to them: that there is some likeness between the Evangelist John and Plato in their sentiments concerning the word, will not be denied. Amelius (f), a Platonic philosopher, who lived after the times of John, manifestly refers to these words of his, in agreement with his master’s doctrine” … “In which words it is easy to observe plain traces of what the evangelist says in the first four verses, and in the fourteenth verse of this chapter [ch 1]; yet it is much more probable, that Plato had his notion of the Logos, or word, out of the writings of the Old Testament, than that John should take this phrase, or what he says concerning the word, from him; since it is a matter of fact not disputed, that Plato went into Egypt to get knowledge: not only Clemens Alexandrinus a Christian writer says, that he was a philosopher of the Hebrews (g), and understood prophecy (h), and stirred up the fire of the Hebrew philosophy (i); but it is affirmed by Heathen writers, that he went into Egypt to learn of the priests (k), and to understand the rites of the prophets (l); and Aristobulus, a Jew, affirms (m), he studied their law; and Numenius, a Pythagoric philosopher (n), charges him with stealing what he wrote, concerning God and the world, out of the books of Moses; and used to say to him, what is Plato, but Moses “Atticising?” or Moses speaking Greek: and Eusebius (o), an ancient Christian writer, points at the very places, from whence Plato took his hints: wherefore it is more probable, that the evangelist received this phrase of the word, as a divine person, from the Targums, where there is such frequent mention made of it; or however, there is a very great agreement between what he and these ancient writings of the Jews say of the word, as will be hereafter shown..”\nhttp://gill.biblecommenter.com/john/1.htm\nI think, as Daniel prophesied, knowledge would be increased in latter generations and this is what is happening. Many of the prophecies in the bible sounded impossible in previous generations, but nowadays they are feasible, such as the whole world seeing the two witnesses killed and resurrect three days later in Jerusalem — possible now with satellite tv — or every Israelite sniffed out in every corner of the world and brought back to Israel  –possible now with the world wide DNA database and Genetic Anthropology spearheaded by IBM and National Geographics Society.. btw IBM (Thomas Watson) were the ones who set up and ran the punchcard system Hitler employed to track and profile the Jews, see “IBM and the Holocaust” by Edwin Black. Probably just a coincidence tho.\n\n","date":"November 10, 2012 at 3:40 am","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-18940","author":"EGM","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"Do you believe the miracles like turning water into wine, feeding the five thousand, walking on water etc are allegorical?\n\n","date":"November 10, 2012 at 3:11 pm","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-18951","author":"ChrisB","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"Quote : “On the one hand there seems to be more than what could be considered a reasonable reluctance to admit the possibility that the image of the Shroud might be miraculous, when in fact it may be so miraculous.”\nQuestion:  What can make you believe that this incomplete and slightly distorted image of a DEAD MAN WHO BEARS THE STIGMATA OF CHRIST can be miraculous ???  Personally, I don’t see any good rational reason to follow that line of thinking.  Not even the fact that this image is probably the one of Jesus of Nazareth…\nThose who think the Shroud is a miraculous image reminds me of the primitive men who thought that the thunder was an act of God before science can fully explain this phenomenon that really looked to them as a miraculous and unexplainable phenomenon !\nLike I use to say about the Shroud:  Be careful folks !  NATURE CAN REALLY BE SURPRISING !!!! ;-)\n\n","date":"November 9, 2012 at 9:32 am","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-18922","author":"Yannick Clément","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"2 more reflections : \n1- It’s not because the Shroud is most probably the authentic burial cloth of Jesus Christ that the image on it is miraculous or even come from a so-called “by-product” of the Resurrection and so, even if Jesus has really resurrected.\n2- It’s not because the image on the Shroud is most probably the product of a biological interraction between the corpse of Jesus and his burial cloth that he never resurrected.\nI think these 2 lines of thinking are just simply false.  Completely false.  Sadly, many people interested in the Shroud these days really seems to think that way.\nI really have a sense that many “shroudies” out there have some fears that if the image on the cloth would be proven one day by science to be the natural product of a biological interraction between a corpse and the cloth that this would mean Jesus has never resurrected…  Here, I want to be clear :  THIS KIND OF THINKING THAT MAKES SUCH A BAD LINK IS JUST WRONG !  Totally wrong.  The Resurrection and the Shroud are 2 very different things and the authenticity of one of these 2 things should never depend on the authenticity of the other.\nFinal note :  The way I understand the Shroud is no different than many ancient Shroud researchers like Vignon, Barbet, Legrand in France and some others after that who were all Christian believers but who never accepted the idea that the image on the cloth could have come from a so-called “by-product” of the Resurrection or from a direct act of God.  I guess there are still some modern Shroud researchers who still think like us, but sadly, I really think they are RARE.  Most of today’s Shroud researchers always seems to have the Hollywood concept of the Resurrection in the back of their mind when they study this relic and this makes me sick, because if they really were honest in their science, they would NEVER leaves the door open for that kind of supernatural scenario when they do their researches about the Shroud.  But that’s not what I see that’s going on these days…\n\n","date":"November 9, 2012 at 11:46 am","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-18925","author":"Yannick Clément","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"YC: “Question: What can make you believe that this incomplete and slightly distorted image of a DEAD MAN WHO BEARS THE STIGMATA OF CHRIST can be miraculous ???” \nBecause with all my background and reading in science, including some years of University practical Engineering laboratory work, my advanced studies in mathematics, my later readings in advanced scientific theories including quantum mechanics and relativity theory, my major in Religious Studies, my studies in philosophy including critical thinking and logic, my innately sceptipical attitude about events claimed to be miraculous, my readings of the various scientific theories about Shroud image formation, my 40+ years in professional engineering work where practical solutions have to be found to difficult engineering problems, I still find miracle a more reasonable explanation than what science has ever been able to come up with to date, in its efforts to explain the image.  \nBut unlike YC, I do not hold to my views dogmatically with a refusal to admit the possibilty that my views on this matter may be incorrect, and that there MAY in fact be an acceptable scientific explanation of how a dead body can produce its own negative image on a linen cloth, with remarkably high definition, showing an orthogonal aspect, with 3D encoded information of its contours.  In 40+ years since the intensive STURP studies began, and with many theories and speculations, academic scientific papers, highly refined laboratory studies, science is no closer to any kind of consensus on how the image might have been formed by any naturalistic means.  Compare that with the progress in electronics, space exploration and Information Technology within the same period of time!  Science is still unable to exclude several possible theories on how a naturalistic formation process might have occurred.  \nThe criteria for a genuine miracle are rigorous.  But, they may still be satisfied in the case of the Shroud image.  Go to the URL reference that I gave above, if you’re capable of getting your head around it.  I found it difficult enough!\n\n","date":"November 9, 2012 at 4:11 pm","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-18929","author":"daveb of wellington nz","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"Even if I considered myself as a “rational” Catholic, I surely don’t reject all the miraculous that could happen in this material world.  But I’m prudent.  VERY PRUDENT !\nSo Dave, if you want to focus on a real miraculous image, why don’t you start looking at the Guadalupe Tilma ?  From what I’ve read so far about this mysterious object, I have no difficulty to believe this is a real miraculous image that come from another world (i.e. the spiritual world).  And believe me, I’m serious here.  As a Christian, by focusing on the miraculous aspect of this image of Mary instead of the Shroud, I truly think you would have far less chances to be disappointed by science one day… \nI have studied every important and solid facts and observation coming from the Shroud and I found nothing that can make me believe for one second that this incomplete and slightly distorted image of a dead man could have been formed because of the Resurrection of Christ.\nA miracle to me is something that goes beyond the known laws of natures (note that this is very different than something that still wait for a complete explanation) and in the present state of our knowledge, I don’t see why scientist should follow that path for the Shroud.  Now, for the Tilma, this is another story…  Seriously, this image of Mary defy the known laws of nature and to me, this is the signal I need to open my mind to the possibility of a divine intervention.  \nAgain, when I consider all the known solid data coming from the Shroud (I’m not talking about the supposed images of coins and flowers here), there’s nothing in this corpus that can make me think that science one day will not be able to properly explain the image formation process that lead to the body image we can see on the cloth.  You have to understand that so far in history, there were only one preliminary scientific study of the relic done in 1973 and another much more extended one done in 1978 and that’s all !!!  This is not very much to fully explain a complex relic like the Shroud of Turin.  That’s why I’m very confident that if a new and proper series of direct researches could be allowed by the Vatican, this will certainly help science to get very close to the complete truth about this cloth.\nIn fact, the only door I left open concerning an aspect of the Shroud that can be directly related to the Resurrection event, is the undisturbed aspect of the bloodstains on the cloth.  But as I often said, this is just a sign of the Resurrection and should never be considered as a proof of this event.  In fact, I truly think that more testing should be done concerning the transfer of exudates of blood clots from the skin of a corpse to a linen cloth in order to see if Barbet was right when he said that this unusual aspect of the bloodstains on the cloth was unexplainable scientifically.  Note that even Barbet was able to stay open minded about that by saying that we can’t predict future and maybe this aspect too could well be scientifically and rationally explained one day…  More research need to be done about this most intriguing aspect of the Shroud.\n\n","date":"November 9, 2012 at 5:52 pm","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-18931","author":"Yannick Clément","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"If someone wins ten times in a row the national lottery jackpot, is it a miracle ?\n\n","date":"November 9, 2012 at 6:15 pm","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-18932","author":"anoxie","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"That’s exactly the point I wanted to make !  Yes I agree that the Shroud and his image is truly unique and exceptional, but I don’t see any good reason to take this fact as a basis to believe it is miraculous !!!  As I said, there’s a very important difference between something that goes well beyond the known laws of natures (like the reality of the piece of human heart and blood from the miracle of Lanciano in Italy or the unexplainable image of the Guadalupe Tilma – 2 “mysterious” objects that have been examined by science and that undoubtly defies the known laws of nature) and something like the Shroud and his body image, which is only (for the moment at least) considered by science as an object that his unexplained YET.  The first category can easily be seen by a faithful as something coming from a real miraculous event while it should not be the same for the second category in which the Shroud belongs.\nEffectively, on one side, you got some miraculous objects that science CANNOT explain with the known laws of nature (like the Tilma for example) and on the other side, you got an object like the Shroud which doesn’t possess any feature that science could really considered as being impossible to explain with the known laws of nature but only as being waiting for a proper explanation.  I think it is very important to make this kind of nuance before claiming that something (like the Shroud for example) might be miraculous…\nSo far, there are some very interesting natural hypotheses that exist to explain all the most “intriguing” features coming from the Shroud. For example, the extreme superficialityt of the body image can well be simply due to a thin layer of carbohydrates impurities residing on the top-surface of the cloth (on both sides).  And here’s another example :  If the image really comes from some kind of biological interraction between a corpse and the cloth, how can the resulting image could be something else than a negative image ?  The simple hypothesis that the image comes from some kind of a natural and biological interraction like this allow us to explain very well this particular aspect of the image.  And it’s the same thing for the 3D information encoded in the image, which is certainly the feature that is the harder to explain scientifically.  But nevertheless, the simple FACT that nature can created natural images of plants and flowers with this kind of 3D information (see slides 19 and 20 on this page: http://www.gizapyramid.com/LECTURE-SHROUD3.htm) is enough to understand that this kind of information in an image CAN be naturally encoded without the need of any miraculous event.  So far, I’m not aware of even one single feature from the Shroud that science has really “tag” as “impossible to explain”, except for the undisturbed aspect of the bloodstains, which cannot be seen as something related to the formation of the body image and also cannot be seen as a direct result of a miracle, but only as some kind of a “collateral outcome” of a possible miraculous event (i.e. the “spiritualization” or the “dematerialization” of Jesus body at the moment of the Resurrection).\nBecause of this lack of features versus the Shroud that would undoubtly surpass some known laws of nature (which is totally different than the reality of the Tilma and the Lanciano miracle, which truly possessed some characteristics that completely defies some known laws of nature), I think it’s much too soon and even pretentious and unscientific to consider very seriously the possibility that the image on this relic might be miraculous (i.e. having been formed by a process that would be consider as being supernatural in the context of a dead body being enshrouded in a burial cloth)…  In my paper about the evidence of the bloodstains, I admit I have left that possibility open in my list of possible scenarios that could explain the Shroud, but I only did it to stay the more honest intellectually I could versus the very particular nature of the cloth (directly associated with the Passion and death of Christ), while at the same time considering this particular scenario as being extremely unlikely in the light of all the data and observation we know about the Shroud.\n\n","date":"November 11, 2012 at 8:24 pm","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-18981","author":"Yannick Clément","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"Clearly Yannick does not comprehend the possibility as described in the highly detailed Catholic Encyclopedia reference which I provided, several comments way back, that despite the image being describable in naturalistic terms, it may nevertheless have occurred through Divine intervention.  He has a closed mind on the subject, and is clearly pathologically averse to admitting that it might perhaps be a miracle after all.  It does not fit into his strait jacket of how he imagines God should conduct and implement His miracles.  Perhaps God should consult our knowledgable Yannick so He can get it right!  However, incessant repetition of any statement has no effect on its truth value one way or the other, no matter how long, wearisome and tortuous its expression.    \nYC can get back to me when he is able to sign off on his naturalistic explanation, but I don’t expect to see it this side of the grave.\n\n","date":"November 12, 2012 at 6:54 am","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-18993","author":"daveb of wellington nz","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"Clearly Dave, I see that you’re interested in the Shroud for his potentially (even if it unlikely) miraculous side !  \nIn my mind, a real miracle is like St John describe in his Gospel : it is a SIGN.  So, in the case of the Shroud, don’t you think the simple fact that this blood stained burial cloth of Jesus has been kept and well-preserved since 2000 years is good enough to understand it as a sign that he really has resurrected on Easter morning ???  I don’t know what is the insecurity level of your faith, but my own faith is secure enough so that I don’t need other signs than this one (along with the fact that the bloodstains on the cloth doesn’t seems to have been disturbed).  \nI don’t need to seek some physical traces of the Resurrection on that cloth like you do because 1- there are none (everything science has discover so far point in the opposite direction of a miraculous process) and 2- as Christian faithful, the great sign of the Resurrection of Christ coming from the simple presence of the Shroud among us today (along with the undisturbed aspect of the bloodstains) should be well enough.\n\n","date":"November 12, 2012 at 11:49 am","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-19000","author":"Yannick Clément","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"Clearly there are some who think it is only the god Rogers who can perform miracles — by ruling out the metaphysical.\n\n","date":"November 12, 2012 at 7:56 am","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-18994","author":"Louis","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"I see no point in continuing a dialogue with one who is pathologically averse to the metaphysical, is utterly presumptuous and incorrect concerning my motivations, who cannot see beyond his own narrow blinkered vision, who is self-contradictory, who questions the integrity of my faith, who without evidence attributes me with assertions I have not made, and whose concept of the Deity is so arrogantly limiting as to come near to heresy!\n\n","date":"November 12, 2012 at 3:51 pm","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-19005","author":"daveb of wellington nz","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"Calm down Dave.  If you don’t, I will soon have your heart attack death on the conscience !  Ha ha ha !\nQuestion 1 : If I’m “pathologically averse to the metaphysical”, why do I accept the Guadalupe Tilma and the Lanciano miracle as being real miraculous objects ??? ;-)\nQuestion 2 : Can you let me know please where exactly I have contradict myself ???\nLast comment :  My concept of Deity is like the majority of the Catholics in Quebec.  I don’t see ourselves as heretics at all.  On the contrary, I truly think our liberal way to see the Christian message of Christ is closer to the truth than most religious groups in the world, including many other Christian denominations and even other types of radical Catholics.  Here in Quebec, it’s been a long while since we have completely droped the God of the Old Testament in order to only focus on the God of Love revealed by Jesus (especially on the cross and by extend, on the Shroud).  I don’t think it is heretical at all…\n\n","date":"November 12, 2012 at 4:37 pm","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-19007","author":"Yannick Clément","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"\nChrisB :\nDo you believe the miracles like turning water into wine, feeding the five thousand, walking on water etc are allegorical?\n\nI certainly do think they are allegorical, but that doesn’t mean they didn’t really happen either. The bible/God uses our physical world as a metaphor to express higher spiritual meaning. I find it interesting how water plays a such prominent role in the miracles of the bible, NT and OT, from God calling forth the earth and animals out of water to Christ turning it to wine, and is used extensively to express spiritual ideas (baptism/born again, water of life, etc). It’s the most abundant chemical on earth’s surface and in the human body and it’s probably the most versatile and exotic in chemistry. Scientists are at a loss to explain exactly why it should expand its crystalline structure after dropping below 4 degrees Celsius, yet it is crucial for supporting life on earth. There have been some recent discoveries about H2O including that it is able to retain “memory” and the magnetic fields put out by our brains can effect it (such as when you are angry or when saying a prayer). Linus Pauling talked about “structured water” as well. People will always ridicule who aren’t ready for this and unfortunately for those a little too eager for this there are some new age spin off products and disinfo surrounding this research, so take heed. I found an interesting documentary on this subject “Water: The Great Mystery” you can check at http://www.youtube.com/watch?v=b_j-R7swwWY\nAfter I first watched this film I was reminded of a passage from Ecclesiastical History (AD 323) by Eusebius\nCHAPTER IX.\nThe Miracles of Narcissus.\nThe citizens of that parish mention many other miracles of Narcissus, on the tradition of the brethren who succeeded him; among which they relate the following wonder as performed by him. They say that the oil once failed while the deacons were watching through the night at the great paschal vigil. Thereupon the whole multitude being dismayed, Narcissus directed those who attended to the lights, to draw water and bring it to him. This being immediately done he prayed over the water, and with firm faith in the Lord, commanded them to pour it into the lamps. And when they had done so, contrary to all expectation by a wonderful and divine power, the nature of tim water was changed into that of oil. A small portion of it has been preserved even to our day by many of the brethren there as a memento of the wonder. They tell many other things worthy to be noted of the life of this man, among which is this.\nhttp://www.ucalgary.ca/~vandersp/Courses/texts/eusebius/eusehe6.html\nApologies for the delayed response, the email alerts for this thread don’t seem to be working for me.\n\n","date":"November 12, 2012 at 6:16 pm","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-19008","author":"EGM","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"According to the great Protestant biblical scholar Ernst Kasemann Jesus is the closest Christians can get to a manifestation of God. And the God he revealed is not hindered by the laws of nature.\n\n","date":"November 12, 2012 at 8:56 pm","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-19009","author":"Louis","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"Of course that he’s not hindered by the laws of nature since he’s the creator of them all ! ;-)  But at the same time, I truly believe that God is a being subtil enough to have make a good use of some of his natural laws in order leave a “footprint” of the dead body of his Son on his burial Shroud.  \nThat’s how I see the Shroud: as a “footprint” of Jesus dead body after his crucifixion and to me, this archaeological artifact is 1- a proof of the reality of the historical Jesus and by extension, a “proof” (sign would be better) of the reality of the Incarnation of God in my eyes of believer and 2- a reinsurance that the Evangelists were not a bunch of liars and that we can trust their accounts of Jesus life, particularly concerning the story of his Passion, death and Resurrection.\nAnd for the “proof” of the Resurrection everyone’s here is seeking on the Shroud, as I said the other day, the simple fact that this bloodstained burial cloth has been kept and well-preserved until this day is the only “proof” (a prefer by far to use the word “sign”) there is to see that Jesus has really resurrected.  This and also the undisturbed aspect of the bloodstains…  I truly don’t think we have to look elsewhere to find a “proof” of this most important event for the whole humanity (and not just for Christians).  I think that way because I’m convinced (after looking closely at all the most solid data coming from the Shroud) that there is no other “proof” of the Resurrection on that cloth.\n\n","date":"November 13, 2012 at 11:43 am","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-19027","author":"Yannick Clément","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"The first part of this comment refers to which deity in the last part of comment #23?\n\n","date":"November 13, 2012 at 8:18 pm","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-19036","author":"Louis","site":"shroudstory"},{"title":"You shroudies and your fallacious thinking","post":"daveb of wellington nz.\nDave, with respect to the image formation on the TS, were the emission of biophotons (light) ruled out?\nThree excerpts from Philip Cunningham’s website:\n“The fact that the pixels don’t fluoresce suggests that the conversion to their now brittle dehydrated state occurred instantly and completely, so no partial products remain to be activated by the ultraviolet light. This suggests a quantum event where a finite amount of energy transferred abruptly. The fact that there are images front and back suggests the radiating particles were released along the gravity vector. The radiation pressure may also help explain why the blood was “lifted cleanly” from the body as it transformed to a resurrected state.”\n“If scientists want to find the source for the supernatural light which made the “3D – photographic negative” image I suggest they look to the thousands of documented Near-Death Experiences (NDE’s) in Judeo-Christian cultures. It is in their testimonies that you will find mention of an indescribably bright ‘Light’ or ‘Being of Light’ who is always described as being of a much brighter intensity of light than the people had ever seen before. All people who have been in the presence of ‘The Being of Light’ while having a deep NDE have no doubt whatsoever that the ‘The Being of Light’ they were in the presence of is none other than ‘The Lord God Almighty’ of heaven and earth.”\n“It seems almost overwhelmingly apparent to me from the ‘scientific evidence’ we now have in hand that Christ literally ripped a hole in the finite entropic space-time of this universe to reunite infinite God with finite man.”\n\nBest,\n\n","date":"November 17, 2012 at 10:03 pm","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","id":"comment-19167","author":"Angel","site":"shroudstory"}]
