[{"title":"It’s everything to do with an unyielding structure called the upper rib cage","post":"Sorry Dan. No disrespect, but I don’t blog to provide  a news aggregation site such as yours with a never-ending flow of new content (and I frankly never cease to be amazed that you flag up my postings within minutes of my hitting the Publish key).\nI explained a while ago that I am reporting a long-term  ongoing  research project, started some 30 months ago, in real time, with a blow-by-blow account. It’s really for me, and me alone, to decide when to start a new posting, or when to add riders to the current one.\nReminder: blog is short for web log. Regard my blog as one might a ship’s log, that ship having  just entered some choppy waters, and requiring a cautious hand on the tiller (thus my writing in short instalments).\nSome here do not even seem to have spared a thought for why hair on the TS fails to show strandedness, I’ve just this minute inserted an image of Bob Geldof, chosen for his TS-like hair, to make absolutely certain folk know what I am referring to.\nWord of advice Dan. If you dislike finding additions when you return to my posts, then wait until I post a new one, then do your piece on the previous one. It’s then unlikely to be further edited.\n\n","date":"July 3, 2014 at 5:39 am","url":"https://shroudstory.com/2014/07/03/its-everything-to-do-with-an-unyielding-structure-called-the-upper-rib-cage/","cat":"image_theory","id":"comment-135056","author":"Colin Berry","site":"shroudstory"},{"title":"It’s everything to do with an unyielding structure called the upper rib cage","post":"Yahoo and Facebook are news aggregators (although Facebook as we see is a bit tweaked in that regard). Unlike them I read material and evaluate it. Often I comment on it. I am not a news aggregator. And you are not news. You are completely focused on the by-my-way part of my posting. Lighten up. I was, admittedly in an off-handed way, saying that your content was too significant to be missed, as it was likely to be because of the way you posted it. Okay, a bit more directly: GREAT STUFF (excuse me for shouting). Do it however you want. It is still great stuff.  As for your word of advice: as they say in The Bronx, fuhgeddaboudit.\n\n","date":"July 3, 2014 at 6:09 am","url":"https://shroudstory.com/2014/07/03/its-everything-to-do-with-an-unyielding-structure-called-the-upper-rib-cage/","cat":"image_theory","id":"comment-135059","author":"Dan","site":"shroudstory"},{"title":"It’s everything to do with an unyielding structure called the upper rib cage","post":"A real corpse, this is a U-Turn for Colin Berry.\nNext one, not a scorch but a chemical reaction ? :)\n\n","date":"July 3, 2014 at 5:40 am","url":"https://shroudstory.com/2014/07/03/its-everything-to-do-with-an-unyielding-structure-called-the-upper-rib-cage/","cat":"image_theory","id":"comment-135057","author":"anoxie","site":"shroudstory"},{"title":"It’s everything to do with an unyielding structure called the upper rib cage","post":"Next step soon, CB will see with his own awe-stricken enlarged eyes, the TS embedded in pieces in the HP Ms folio 28r lower section ink drawing and his quicklimestoned mummy laden ship sink for good in ten thousand thundering typhoons off the coast of Brittany (France).\n\n","date":"July 3, 2014 at 6:36 am","url":"https://shroudstory.com/2014/07/03/its-everything-to-do-with-an-unyielding-structure-called-the-upper-rib-cage/","cat":"image_theory","id":"comment-135061","author":"Max patrick Hamon","site":"shroudstory"},{"title":"It’s everything to do with an unyielding structure called the upper rib cage","post":"No one faking the Shroud would have a clean-shaven Jesus, and the hasid-like Jesus would have both moustache and beard.\n\n","date":"July 3, 2014 at 8:10 am","url":"https://shroudstory.com/2014/07/03/its-everything-to-do-with-an-unyielding-structure-called-the-upper-rib-cage/","cat":"image_theory","id":"comment-135075","author":"Louis","site":"shroudstory"},{"title":"It’s everything to do with an unyielding structure called the upper rib cage","post":"What to say ?\nColin wrote: “I explained a while ago that I am reporting a long-term ongoing research project, started some 30 months ago, in real time, with a blow-by-blow account.”\nThe current result of this long-time research: the TS image is a scorch, But I do not know how it was made. And It is not a photograph (we knew that).\nHot template? But ‘However, I’m as conscious as the next man of the practical difficulties of imprinting successfully off a life-size effigy. Mistakes would be costly, given the price of quality linen,’\nPrice? Is it really the problem?\nIn my opinion, the so-called practical difficulties of imprinting using a hot template are in fact impossibilities.See my PDFs:\nPDF1: https://shroudofturin.files.wordpress.com/2012/10/scorch-paper-en.pdf\nPDF2: https://shroudofturin.files.wordpress.com/2014/04/scorch-2-eng-final.pdf\nAs an answer, CB wrote:\nhttp://colinb-sciencebuzz.blogspot.fr/2014/06/thibault-heimburger-is-incorrect-linen.html\nLook at my PDF1.in which I wrote: ‘Another interesting fact comes from the observation of the lack of visible color on the backside of the lateral bands of sample 3 (Fig.2, sample 3B) even if the corresponding areas on the front (heated) side are STRONGLY  scorched. This is explained by the fact that I immediately removed the hot plate (contact time less than one second). A superficial discoloration at fabric level can be obtained even at high temperature with a very short contact time because the diffusivity of the cellulose of linen is very low’.\nIn any case, lack of color on the reverse side does not mean “superficial” in the sense of the superficiality of the TS image as shown in PDF 2.\nAfter many hours of experiments,I know that the Ts image is not a scorch.\nBecause heating (alone):\n1) can not give a discoloration as superficial as the TS image (only 1-3 surface fibers)\nDO YOU REALIZE THE EXTREME SUPERFICIALITY OF THE TS IMAGE ?\n2) can not explain the half-tone effect.\nThen Colin tried the quicklime hypothesis ???? And …\nAnd now the “impactograph” (or impactogram).\nI do not understand CB’s way of working, jumping from one subject to another..\nI definitely prefer PDFs ….\n\n","date":"July 3, 2014 at 4:01 pm","url":"https://shroudstory.com/2014/07/03/its-everything-to-do-with-an-unyielding-structure-called-the-upper-rib-cage/","cat":"image_theory","id":"comment-135151","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"It’s everything to do with an unyielding structure called the upper rib cage","post":"“DO YOU REALIZE THE EXTREME SUPERFICIALITY OF THE TS IMAGE ?\nThere’s no need to shout, Thibault.\nUnlike you, I have hands-on experience with scorching at the cellular and subcellular level. I refer to the experiments I did with (thoroughly) dried onion epidermis – just one cell thick – and little more than a pair of primary cell walls, each approx 200nm  in thickness, comparable to alleged TS image thickness. That single layer gave complete protection to underlying linen, while itself becoming extensively scorched.\nThe factor that is overlooked in so much ill-informed comment about template scorching is the endothermic nature of scorching reactions, which withdraws a lot of heat from the template at each pressing. That’ss why scorching by direct contact can be so superficial.\nYour nitpicking response to my onion experiments? To unhelpfully suggest I had not fully-dried material (I had).\nYou nitpick, Thibault. You should try being more constructive and cease this sniping by PDF (the latter full of ex cathedra pronouncements, inviting no comments).\n\n","date":"July 3, 2014 at 4:35 pm","url":"https://shroudstory.com/2014/07/03/its-everything-to-do-with-an-unyielding-structure-called-the-upper-rib-cage/","cat":"image_theory","id":"comment-135158","author":"Colin Berry","site":"shroudstory"},{"title":"It’s everything to do with an unyielding structure called the upper rib cage","post":"Sorry Colin, I do not consider your ‘dried onion epidermis’ experiment relevant.\nThere are too many differences with direct experiments on linen.\nDo you want me to list the differences ?\nIn fact there is absolutely no relationship between your experiment and the fact that you are supposed to demonstrate, i.e. it is possible to scorch only 2-3 fibers at the surface of a linen sheet with a hot template by direct contact.\n\n","date":"July 4, 2014 at 3:20 pm","url":"https://shroudstory.com/2014/07/03/its-everything-to-do-with-an-unyielding-structure-called-the-upper-rib-cage/","cat":"image_theory","id":"comment-135353","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"It’s everything to do with an unyielding structure called the upper rib cage","post":"Do you not consider it extraordinary  that gossamer-thin onion epidermis  so thin that if takes ages to reach the floor when released from a height, gives complete protection of underlying linen from a hot metal template, the latter hot enough to scorch unprotected linen, and which in fact scorched the overlying epidermis a deep red-brown colour? I do, or rather did. \nSo list the differences if you wish, Thibaullt, if you think they are important. But don’t forget to mention the fact that dried onion epidermis, just one cell thick, consists of little more than two primary cell walls, lacking the much thicker, robust secondary cell wall of plant fibres like flax bast cells (“linen fibres”). .Those tough fibres are primarily thick secondary cell walls. So how come a pair of skinny primary cell walls is somehow able to block the passage of heat, sufficient to protect what’s underneath from scorching, while the vastly thicker flax cell wall cannot. \nSure you can list differences, Thibault.  Why have you not done so already?   But as I say, there’s  one obvious difference that one might have expected to make onion epidermis ineffective – the absence of a secondary cell wall – but which did not. What’s more, I’ve provided a scientific explanation: namely that scorching, i.e. chemical dehydration of linen carbohydrates,  is highly endothermic, causing rapid cooling of the template, and making the process highly superficial at the cellular level.\nIn short, the odds were stacked against my little experiment working. Yet it worked – in spite of  everything, yet all you can do is nitpick on matters of inconsequential detail, overlooking or ignoring the bigger picture.\nYawn.\nWritten any good pdfs lately?\nPS to Dan – thanks for acceding to my request to delete my previous comments re an over-hasty report of this morning’s quicklime experiment.\n\n","date":"July 4, 2014 at 5:48 pm","url":"https://shroudstory.com/2014/07/03/its-everything-to-do-with-an-unyielding-structure-called-the-upper-rib-cage/","cat":"image_theory","id":"comment-135374","author":"Colin Berry","site":"shroudstory"},{"title":"It’s everything to do with an unyielding structure called the upper rib cage","post":"Thibault, scorch is dead, Colin just wants to keep playing, whatever inconsistencies.\n\n","date":"July 4, 2014 at 4:25 am","url":"https://shroudstory.com/2014/07/03/its-everything-to-do-with-an-unyielding-structure-called-the-upper-rib-cage/","cat":"image_theory","id":"comment-135266","author":"anoxie","site":"shroudstory"},{"title":"It’s everything to do with an unyielding structure called the upper rib cage","post":"There are a lot of practical difficulties about producing a scorch image by heating a six-foot long hot metal template, but that doesn’t mean the scorch theory is dead; far from it. If the image on the shroud is nothing but degraded cellulose, then it chemically very much resembles a scorch, and the problem is the physics, be it Yannick’s mysterious low temperature radiation, Colin’s new quicklime ideas, or painting with a soldering iron, as has recently been done by Hugh Duncan. As for the superficiality, I don’t think people realise how dense the Shroud is. It is almost twice the density of a bed-sheet, for example. This in itself is enough to prevent much that happens on one side from penetrating to the other.\nYes, all the ‘scorch’ variations explored so far are riddled with difficulties. But then, so are all the ‘radiation from a dead body’ ideas, and even the ‘completely new physics unknown to man’ ideas. Fascinating, isn’t it?\n\n","date":"July 4, 2014 at 6:58 am","url":"https://shroudstory.com/2014/07/03/its-everything-to-do-with-an-unyielding-structure-called-the-upper-rib-cage/","cat":"image_theory","id":"comment-135282","author":"Hugh Farey","site":"shroudstory"},{"title":"It’s everything to do with an unyielding structure called the upper rib cage","post":"I am curious to see the image of that\n“first thermochemical image (of sorts) using a horse brass, quicklime, linen and water”…\nDespite your previous behavior (a bit grumpy) I wish:\nGood party!\n— —\nBut next time do not forget to use the iron oxides!\nI am curious to see the final effects (from CaO + FeOx).\nWhat might happen with that mixture (…on wet linen)?\n— — —\nOxidative damages (and experiments) :\nAnyway, why do not you tell us anything about the oxycelluloses?\nI have read that oxycarmin dyes oxycelluloses dark blue to dark violet  …\nWhat is the best sistem to detect the presence of oxycelluloses on your experiments?\nPerhaps these tests (now) are a bit ‘too refined?\nWhen you can run those tests (about oxycelluloses detection)?\n— —\nI expect a second rebuff …\n\n","date":"July 4, 2014 at 12:09 pm","url":"https://shroudstory.com/2014/07/03/its-everything-to-do-with-an-unyielding-structure-called-the-upper-rib-cage/","cat":"image_theory","id":"comment-135324","author":"Piero","site":"shroudstory"}]
