[{"title":"John Jackson on Colin Berry’s “highly misleading” comments","post":"Hello Dr. Jackson. Nice of your to honour us with your presence. i have been a great admirer of much of your work, and have said so  here and in a number of postings on my own sites. Shame then that we have to launch into contentious matters of detail on our first acquaintance, but this retired science bod does relish the detail, indeed the cut-and-thrust of scientific debate, so I’ll make a start in addressing one or two of the points you raise.\nForgive my saying but you appeared to have started with some pretty fixed preconceptions, judging by that phrase “to try to avoid image blurring that results from a full relief caused by thermal radiation” (my italics). Given the aim of the exercise is to reproduce, or at any rate, attempt to reproduce, medieval technology, if only to test to destruction any ideas about forgery, then why make any a priori assumptions about the mechanisms of heat or other energy transfer involved in image production? In fact, I fail to understand why radiation should ever have entered into your thinking at all  given that white, or whiteish, linen reflects or transmits most of the visible white light or infrared radiation that falls upon it (and perhaps we could leave speculation re ultraviolet to Dr.Di Lazzaro and his super-imaginative ENSA colleagues).Scorches that result from contact with heated bronze statues, or of bas or high-relief templates are the result of pyrolysis by DIRECT contact, with NO air gap, involving conducted heat through atom-to-atom contact, the signature for which, reported by Ray Rogers for the Shroud, is selective scorching on or immediately adjacent to the crowns of threads. He himself stated that radiation could not produce that effect – that radiation would produce a more diffuse zone of pyrolysis. And what if there had been some “blurring” of the image? So what? The Australian who supervised my PhD (the late Terence Hallinan at Royal Hospital School of Medicine )impressed on me a simple, no-nonsense philosophy when it comes to embarking on new experiments: ” Just suck it and see”. Yup, suck-it-and see – don’t try to anticipate all the problems and subtleties in advance, don’t over-intellectualise – just SIAS.\nPre-soaking? (incidentally, I was and am still am hugely impressed by those experiments of yours, especially the discovery of “encoded 3D information” in your thermal imprints – what I call scorchographs –  I can improve on that. Imprint onto dry linen, but with a backing  pad of moist fabric that has been soaked thoroughly then wrung out. The latter acts as a heat sink and as an agent to facilitate partial or complete “wrap-around” imprinting. An alternative to a damp dishcloth is SNOW. I’m waiting for our present snow to settle to test out snow as an alternative to a damp pad, or the sand bed I proposed a while ago,\nTin man? Tongue was firmly in cheek when I used that term, which originated with someone else on the site, possibly Dan himself. \nI’ll stop here for now, but could let you know my views on those blood stains later. Be warned, however. I would be wanting to cast an exceedingly jaundiced eye at any claims made for blood that, we are all agreed, is centuries old. That’s with or without some initial thermal denaturation of haemoglobin about which there is much I am tempted to say of a disparaging nature, especially re that remarkable role proposed for bilirubin (a bile pigment I studied for 2 years at the University of Pennsylvania Hospital School of Medicine) which is said to account for some chameleon-like colour changes from red to brown and back to bright red again.\nColin Berry aka sciencebod\nhttp://shroudofturinwithoutallthehype.wordpress.com/\n\n","date":"March 4, 2012 at 11:41 am","url":"https://shroudstory.com/2012/03/04/john-jackson-on-colin-berrys-highly-misleading-comments/","cat":"image_theory","id":"comment-8921","author":"colinsberry","site":"shroudstory"},{"title":"John Jackson on Colin Berry’s “highly misleading” comments","post":"PS:  It is not clear from this post what I have said regarding Dr.Jackson’s work that is considered “highly misleading”. Am I required to endorse every detail of his interpretations, some of which I consider highly bizarre to say the least, to avoid being emblazoned across a headline in this way? I have expressed admiration for the approach he took in his bas relief studies (any references to a statue being a misreading of one of his own accounts, which I now realize was probably referring to earlier work of others). But bas relief versus statue cannot be sensibly discussed until one is clear as to the method of imprinting, right down to the very last detail, but the method depends on whether one is using direct contact (for which I see no alternative) or whether one is asking the reader to envisage uv or xrays emanating from the subject, which frankly I consider laughable in theory, and in any case unachievable in practice where forming an image on linen is concerned as distinct from small area of discoloration. \nSo let me put a straight question to Dr.Jackson. Does he still see a role for radiation? If so, from what region of the electromagnetic spectrum, and how does that square with the many distinctive characteristics of the Shroud image, notably selective scorching of crown fibres? Until we hear his answer, can Dan please withdraw the accusation, whether at first or secondhand, that it is I who has been misleading?  He might like to consider whether that label would be more fitting for those who promote an entirely imaginary and spurious role for radiation without (as far as I can see) a single SHRED of evidence to back it up.\n\n","date":"March 5, 2012 at 6:11 am","url":"https://shroudstory.com/2012/03/04/john-jackson-on-colin-berrys-highly-misleading-comments/","cat":"image_theory","id":"comment-8945","author":"colinsberry","site":"shroudstory"},{"title":"John Jackson on Colin Berry’s “highly misleading” comments","post":"“Highly misleading” is quoted in the headline. It stands.\nSomeone who instead of substantively criticizing the work of other scientists like Al Adler, Ray Rogers and Paolo Di Lazzaro, resorts to calling their work “Mickey Mouse science;” someone who calls the folks at ENEA “idiots” and a “bunch of jokers” doesn’t have a lot of standing here to ask for kid glove treatment. \nDan Porter\n\n","date":"March 5, 2012 at 7:49 am","url":"https://shroudstory.com/2012/03/04/john-jackson-on-colin-berrys-highly-misleading-comments/","cat":"image_theory","id":"comment-8948","author":"Dan","site":"shroudstory"},{"title":"John Jackson on Colin Berry’s “highly misleading” comments","post":"Dr. Jackson, Thanks so much for your note. Great reading and very informative. \nTo Colin’s experiments is it possible the medieval forger used a giant onion when making his forgery? Think of all the excellent French onion soup he could have made with the leftover parts! ;-)\n\n","date":"March 4, 2012 at 3:24 pm","url":"https://shroudstory.com/2012/03/04/john-jackson-on-colin-berrys-highly-misleading-comments/","cat":"image_theory","id":"comment-8927","author":"Chris","site":"shroudstory"},{"title":"John Jackson on Colin Berry’s “highly misleading” comments","post":"Well Chris, I have to say I am delighted that someone remembers my onion epidermis experiment. But did you grasp the point – namely that the most superficial layer of flax water-conducting elements – i.e.the primary cell walls of the fibrous tracheid cells –  might be scorched sufficiently to make the discoloration the dominant feature to the human eye – an imprinted image – while the underlying cells are largely unaffected? \n I suspect that those without a chemical background are unable to appreciate how thermal energy (heat) interacting with a surface layer can cause changes that are highly superficial – a few hundreds of nanometres at most (of the same order as the wavelength of visible light) yet be minor, indeed trivial, where the entire structure at the macroscopic level is concerned. Think breathing onto a cold window pane to get a feathery Jack Frost pattern, or a rainbow-coloured oil film on water…\nWe all of  us, scientists included, underestimate the ability of the eye to detect change or damage in surfaces at the microscopic, sometimes sub-light microscopic level. Subtle differences, e.g.in the way that light, or particular wavelengths thereof, are selectively scattered or absorbed, generate  pronounced changes in colour, texture, reflectiveness  etc.\n\n","date":"March 4, 2012 at 4:15 pm","url":"https://shroudstory.com/2012/03/04/john-jackson-on-colin-berrys-highly-misleading-comments/","cat":"image_theory","id":"comment-8931","author":"colinsberry","site":"shroudstory"},{"title":"John Jackson on Colin Berry’s “highly misleading” comments","post":"\nDan :\n“Highly misleading” is quoted in the headline. It stands.\nSomeone who instead of substantively criticizing the work of other scientists like Al Adler, Ray Rogers and Paolo Di Lazzaro, resorts to calling their work “Mickey Mouse science;” someone who calls the folks at ENEA “idiots” and a “bunch of jokers” doesn’t have a lot of standing here to ask for kid glove treatment.\nDan Porter\n\nHow else is one supposed to describe so-called scientists (sadly RIP in two of those cases) who have made names for themselves purposely blurring  the distinction between science and magic. Magic is not science. Science is not magic. (Feel free btw to substitute “supernatural” for magic, there being essentially no difference in my book, at least from a scientific standpoint.) \nApplying magic and/or the supernatural to material objects, like linen with a scorched-on image, shows contempt for the immutable laws of physics that have served us very well up till now, with the exception perhaps of sub-atomic physics.\nYes, Mickey Mouse science: each time I delve further into the canon of the three you name I encounter yet more Mickey Mouse science. Making facts fit crazy hypotheses is not science –  but I shall spare you any more of the pithy descriptions that are on the tip of my tongue right now.\nSo kindly stop misrepresenting me in your headlines, Dan. It is other people’s misleading so-called “science” that this retired science bod now has firmly in his sights.\n\n","date":"March 5, 2012 at 8:18 am","url":"https://shroudstory.com/2012/03/04/john-jackson-on-colin-berrys-highly-misleading-comments/","cat":"image_theory","id":"comment-8949","author":"colinsberry","site":"shroudstory"},{"title":"John Jackson on Colin Berry’s “highly misleading” comments","post":"I stopped to receive these comments!\n\n","date":"March 12, 2012 at 10:09 am","url":"https://shroudstory.com/2012/03/04/john-jackson-on-colin-berrys-highly-misleading-comments/","cat":"image_theory","id":"comment-9251","author":"Tersio Gorrasi","site":"shroudstory"}]
