[{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"Colin Berry said >>> I see there’s a proposal to put Rogers’ diffusion/Maillard hypothesis to a long-overdue feasibility test. But the protocol is rigged, given that it intends to use glucose-impregnated cloth. Yes, the Maillard reaction needs a source of reducing sugar. Not even Rogers had the brass neck to suggest glucose, the closest substitute being “starch fractions”. Reminder: starch itself is a polysaccharide, not a sugar, and only becomes reducing if extensively degraded chemically or enzymatically to small fragments with aldehyde functions. It was always hard to conceive of naturally-degraded starch ever becoming a realistic source of reducing sugar. To substitute glucose is at best a cop-out, or at worst a reprehensible sleight-of-hand unworthy of anyone who wishes to be taken seriously as a professional chemist.\n\n","date":"September 18, 2012 at 5:27 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16442","author":"Jesse","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"A very good point Jesse!\n\n","date":"September 18, 2012 at 6:39 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16448","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"Nowadays from a scientific point of view, this kind of complex problems with a lot of unknowns, are methodologically addressed in a completely different way. At least, some crucial unknowns, involving several disciplines are (to mention a few):\n1. Rogers himself speaking about an additional mechanism, apart or in combination with the Maillard reaction (Chemistry)\n2. Origin, generation rate and characterization (molecular weight, viscosity, evaporation rate, Henry’s value) of amines/sweat involved (Forensic, chemistry)\n3. Motion of amines (diffusion?, transport?, laminar flow?) (Physics, engineering, fluid mechanics)\n4. Environmental conditions of a 1st century tomb in Jerusalem (Humidity, temperature) and of a dead body after xx hours (Forensics, History, meteorology/paleoclimate, physics).\nIn highly complex problems like this, with so many critical parameters involved, is virtually impossible to put up one single experiment and obtain results, because you have to opt beforehand for a particular set of conditions, something that at the current stage is far from being clear.\nAddressing this problem involves a multidisciplinary team and an intensive previous stage of computer simulations with state-of-the-art multiphysics software (CAE-Linux -in my view the most appropiate- is freeware or COMSOL or Fluent or Star CCM+ could also do) running a big number of simulations covering different possible conditions.\nAt this point, a reduced number of possible conditions would emerge and then, it would be the moment for experiments. It could also happen that all the combinations tested based on preliminary hypothesis were ruled out -these things happen everyday-  and in that case,  everything -building new hypothesis, new conditions or historical scenarios never considered before, ….-should have to be re-thought from the scratch, thus moving to a new cycle of computer simulations under new conditions.\nThis means, finantial support, multidisciplinary teams and a lot of time.\n\n","date":"September 18, 2012 at 6:15 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16446","author":"Gabriel","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"This is disappointing. We are back to this degraded and blurred version of Rogers’ hypothesis.\nI don’t know where it comes from. Rogers himself, who was then urged to think of “something else” ? Various misunderstandings ?\nThat’s precisely why I asked Thibault for more details concerning his hypothesis.\nJust start with two comments :\n– note that cadaverine or putrescine have been ruled out by Thibault.\n– “the gaseous molecules were transported to the Shroud by thermal ie.vertical convection currents”, “Heat the dummy to give a range of surface temperatures” : this is a totally unlikely model, and bad physics.\n\n","date":"September 18, 2012 at 6:29 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16447","author":"anoxie","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"Time to go back to the drawing board.\n\n","date":"September 18, 2012 at 7:19 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16452","author":"Jesse","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"In 2004  I had a long email-discussion with Ray Rogers a long time ago. He agreed that diffusion processes and gas-concentration-differences alone could not effect the resolution of the image that we see. Something else had to be involved. We agreed that indeed we see an allocation of an image-substance (“double bound saccharides”) and that as an approximation it can be said that the closer the cloth was located to the body at one spot the more image substance had been formed. The final allocation of the image-substance gives the impression of an image.\nHe had the opinion that the image formation process was a chemical process that took place at room-temperature and took a while and that primarily gas-concentation-differences (amines) were responsible for this allocation.\nBut he agreed that concentration-differences could not effect the resolution and also not explain the image on the back-side, where there was hardly any space between body and cloth and therefore no big possibility for gas-concentration-differences. There is also a problem to explain the dark area below the nose and the scourge-marks.\nHe agreed that temperature-differences may have played a role, as temperature has an effect on the process-speed of the chemical process. But then I had the impression that he was not willing to continue the discussion.\nIf a natural process is supposed, temperature differences on the cloth can only come from a warm body: the closer the cloth was to a warm body, the higher was the temperature at that spot, the faster was the process-speed and the more image-substance has been formed – which is in agreement with what we see. The allocation of the image-substance would then not be due to gas-concentration-differences but to temperature-differences on the surface of the shroud.\nIf a cooling-down corpse is supposed there would be indeed such an effect. BUT: in the trunk of a corpse there is much more energy bound than in the extremities. Therefore the extremities would cool down fast and hardly any image should be visible there. But this is NOT what we see. The image is rather similar along the whole body, which speaks for a rather equal body temperature throughout the body during the whole duration of the process (about 36 hours). But this can only be possible if blood-circulation and a beating heart was still there.  \nTherefore I think that if somebody considers a chemical process (like the Maillard-reaction as proposed by Rogers) he might finally come up with the hypothesis of a living body.\nThis may also explain the uniqueness of the image. As far as I know there is only one similar (not equal!) image known, the so called “Liverpool-image”, found on the mattress of a just died person in a hospice, which was formed by a warm (living) body.\nCorpses can not produce such an image, therefore the image on the shroud is unique, pointing to a unique event  (my opinion).\n\n","date":"September 18, 2012 at 3:25 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16474","author":"Helmut Felzmann","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"Take a freshly dead body of a crucified man who was tortured for several hours prior to his death and put it inside a linen cloth made with the ancient method of making linen cloths and I’m 99% certain that after 36 hours at room temperature you will get something on the cloth.  I don’t say that it will look as perfect as the Shroud image but you will certainly get something because, as Rogers said it so well :  If amines came in contact with a carbohydrate layer of impurities on the cloth, this will produce a color. And Rogers add: this is not an hypothesis, this is a fact.  So, if 0% of the image on the Shroud is the product of a natural chemical process, that means there is no layer of impurities on the cloth (even though pectines and starch have already been found on the cloth !!!) and/or there was no or not enough gases released by the beaten and tortured body during the possible 36 hours he stayed inside the cloth (which is something I have a hard time to imagine, especially when we consider this crucial fact : this was not a normal corpse of someone who died of a heart attack or something like that.  This was the corpse of a crucified man who was tortured for several hours prior to die).  In this context, I just cannot imagine that the image has not have been caused at the very least partially by the kind of process proposed by Rogers.  Could another portion of the image has been caused by something else ? Of course, it’s possible…  More researches need to be done concerning every possible biological-chemical reactions that could occured between a linen cloth like the Shroud and a highly tortured corpse like the man of the Shroud.  \nAnd concerning what M. Felzmann wrote in the conclusion of his comment, I disagree with the idea of a unique event simply because of what he said about the Jospine matress !  This is a PROOF that a normal human corpse could leave NATURALLY a very good imprint of his body (or body parts) on a cloth.  Of course, this is not the same as the Shroud but I think scientists interested in the image of the Shroud should consider making more research on this Jospine matress image.  Maybe some interesting answers (or possible avenues of research) could come out of this kind of investigation.  Zugibe did some research about that in the past but he’s not a chemist or a biochemist.  Someone should take this research and push it forward.\n\n","date":"September 18, 2012 at 3:46 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16476","author":"Yannick Clément","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"a mess\n\n","date":"September 18, 2012 at 9:24 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16492","author":"Paul","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"Helmut’s comments on his discussion with Ray Rogers clarifies that Rogers himself did have reservations about the Maillard reaction acting alone, a topic recently extensively discussed and speculated about on this site. \nIt has also been suggested that the unusually heavily traumatised body of the TSM would actually have a higher temperature than its surroundings, more so than would be the case with only a moderately traumatised body.  But as Helmut points out, the limbs would lose their temperature faster than the trunk, and the resulting intensity of the image would vary across the cloth, not what we see.  \nThe dorsal image is pretty well as distinct as the frontal image, and the buttocks are not flattened by the weight of the body.  Max Patrick Hamon claims to explain this by asserting that the body was lying on its side.  We then have a problem with the flow of the gases.  Because of the fairly high resolution of the image and its orthogonality on the cloth, some envisage that the body is lying on its back and with the higher temperature of the body, the gases flow vertically upward.  But this would not explain the clarity of the dorsal image.  Inconsistency builds on inconsistency.  We do not even know if Maillard is capable of producing a distinct image.  \nThe Jospice mattress image was said by Fr Francis O’Leary to have been formed on a nylon (not linen) mattress cloth through a sheet and a thin polyurethane cover, together with pillow and pillow slips, possibly a pyjama top.  But possibly O’Leary may have been misinformed about this and perhaps Les (the corpse) had been left lying on a bare mattress by a busy and overworked hospice staff.  Note that the Jospice image is a dorsal image, and Les had not been a traumatised victim as was TSM.  \nBut we have to start somewhere, and Dennis Mannix’ proposal is probably as good as can be done at this stage.  But then there is a much longer road ahead to pursue varying all the parameters.  Many $$$$$ involved.  Does anyone have access to the Gates Foundation to make a case for funding??\n\n","date":"September 18, 2012 at 4:38 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16478","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"\nHelmut Felzmann :\nTherefore I think that if somebody considers a chemical process (like the Maillard-reaction as proposed by Rogers) he might finally come up with the hypothesis of a living body.\n\nIf you take a living body, one issue is the breathing. Take 5 L/min for an adult. There is no longer any concentration gradient depending on body-cloth clearance around nose and mouth, and the main parameter remaining is temperature.\nThen temperature gradient  on linen is created by hot air coming out of nose/mouth and direct contact point (low thermal diffusivity of linen).\nThis is not consistent with the image of the face.\nConcerning the scourge marks, I don’t see your point.\n\n","date":"September 18, 2012 at 5:55 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16484","author":"anoxie","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"to anoxie:\nthe area below is indeed very dark and different than the rest of the body-image. This can be due to breathing.\nScourge-marks: I believe that most is part of the image only a part is blood. This is the image-formation-theory has also to explain this. If the image-substance-allocation has followed the temperature-allocation this can be explained: wounds have a higher temperature than the surrounding skin.\n\n","date":"September 19, 2012 at 3:31 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16495","author":"Helmut Felzmann","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"to anoxie:\nthe area below the nose is indeed very dark and different than the rest of the body-image. This can be due to breathing.\nScourge-marks: I believe that most is part of the image only a part is blood. This is the image-formation-theory has also to explain this. If the image-substance-allocation has followed the temperature-allocation this can be explained: wounds have a higher temperature than the surrounding skin.\n\n","date":"September 19, 2012 at 3:35 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16496","author":"Helmut Felzmann","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"I think the main parameter is gas concentration gradient, temperature gradient being a second order parameter.\nAs you say, you can’t have significant temperature gradients with a dead body.\nIf you consider a living body, i’m not convinced Maillard reaction kinetics would be sensitive enough to temperature gradients on the shroud to produce contrasts we can see. And i don’t think either temperature gradients would fit the image pattern (hairs have very low thermal conductivity, steep temperature gradients next to contact points).\nPlus you have to consider the breathing which would disturb the whole face area, not a very limited (hardly noticable) area under the nose. Chest and abdominal movements are other issues.\nBut your point confirms Rogers feeling temperature gradients were important (but don’t forget he was a thermal analyst).\nConcerning scourge marks : i think you don’t wonder how blood came on the cloth, just consider reactants for the Maillard reaction could have been transfered by diffusion (ammonia, heavy amines) and direct contact too from wounds/plasma exsudation and sweat (thinking of glutamine, reactants don’t necessarily come from decomposition).\n\n","date":"September 19, 2012 at 1:02 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16513","author":"anoxie","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"I’m convinced that if we could take the fresh corpse of a crucified man who had been tortured for several hours prior to is death and put it inside a burial linen cloth made the ancient way like the Shroud and wait for 36 hours at room temperature, we would get a coloration on the surface of the cloth.  Maybe it would take some baking to simulate the aging of the cloth, but in the end, I’m convinced we would get some coloration.  I don’t say that the result would be as “perfect” as the Shroud, but I’m sure there would be some color on the surface of the cloth that would be close in color to what we see on the Shroud, because as Rogers said it very cleverly :  If amines come in contact with a thin layer of carbohydrates impurities on the surface of a cloth, there will be a chemical reaction that will produce a color.  Like Rogers said : this is not a hypothesis, this is a fact.\nSo, in order to think that 0% of the image on the Shroud has been produced by a Maillard reaction coming from some amine gases released by the corpse, you have to assume that there are no (or not enough) carbohydrates impurities at the surface of the cloth (even though pectines and starch have already been detected) and/or there was no (or not enough) amines gases released by the beaten and crucified body over a period of approximately 36 hours.\nPersonally, I have a very hard time to believe that this assumption can be correct.  I truly think that at least a portion of the image could well have been produced by the Maillard reaction that Rogers proposed with maybe one possible exception : maybe the alternative hypothesis proposed by Thibault in 2007 concerning the urea left by the drying sweat has more chances to be correct in the context of a Roman crucifixion than what was originally proposed by Rogers and could account better for the production of enough gases inside the Shroud during the first 36 hours after death.\nDefinately, more researches need to be done…  Maybe the one proposed by M. Rolfe’s website could be a good start but it truly need to be done by a professional chemist (a biochemist would be great).  Also, I would like the test to be done on a linen cloth prepared the ancient way instead of the “soaking a linen test cloth in a glucose solution and being allowed to dry in air” proposition…\n\n","date":"September 18, 2012 at 4:54 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16480","author":"Yannick Clément","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"I fear that doing such an experiment will be a waste of time & money, given that the hypothesis is extremely unlikely a priori,  for simple logical reasons. Every hypothesis on the production of the Shroud image should take into account the uniqueness of the image on the Shroud. The Maillard hypothesis proposes a cause for the image that could operate as well on other shrouds; there is no reason why this unique image should happen to be the image of Christ, no less. Neither does this hypothesis, or other hypotheses of the same grain, explain why the image is so surprisingly complete. A viable hypothesis has to take into account, in one way or another, the fact that the image on the Shroud is not the image of some random person, but a complete image of Christ (or at least of somebody sharing a plethora of characteristics with Christ). It is because the image refers to Christ that it can be interpreted as a *sign*, namely as a sign of the ressurection, and a viable theory on the image should explain this particular aspect of the image. Consider also the following. The fact that the image is unique implies that the windows for the physico-chemical conditions needed for its production are very narrow; otherwise more such images should be known. But the conditions (ventilation, gravity, pressure of the body on the Shroud…) were certainly different at the upper side resp. the lower side of the body. Nevertheless, the quality of the image is about equal for both sides of the body. The explanation of the image should account for the fact that (a) this is the image of Christ (or a lookalike) and (b) the image is complete and its quality is about equal for both sides of the body. The Maillard theory fails on all these points.\n\n","date":"September 19, 2012 at 2:12 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16494","author":"Jos Verhulst","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"If the experiment falls abysmally, then we may conclude that the image very likely has not been produced by a Maillard reaction, so I do not see it as a waste of resources at all.  It will add to our knowledge and understanding of the image, albeit in a negative way.  Some other process must be sought if a naturalistic explanation is to be obtained.  We may not conclude by such negative evidence that the image is necessarily a consequence of the Resurrection,  There may be some other naturalistic explanation: a current candidate explanation, one that has yet to be thought of, or a process as yet unknown to science. \nI do not understand the Jos Verhulst comment: “there is no reason why this unique image should happen to be the image of Christ”.  Certainly thousands of Jews were sent to their death by crucifixion during the Roman period, about 3000 following the death of Herod the Great, and several more around 70 AD, and doubtless countless others.  However on the assumption that the Shroud is of authentic 1st C provenance, there is considerable evidence that the TSM is indeed Jesus Christ.  All the wounds match the gospel accounts of his suffering and death.  But the clincher is the scalp wounds caused by the crown (cap) of thorns, inflicted by the whim of a Roman soldier in response to the purported charge the “King of the Jews”.  This was not a standard or even occasional punishment, and Jesus Christ is the only crucifixion victim known to have been so capped.  Even the arch-sceptic Thurston has said of the image, “Of the identity of the victim there can be no doubt.  If it is not Christ then it was intended to be his likeness.” \nAs far as proof of resurrection is concerned, this is provided by the fact of the image, rather than its unknown cause:  the fact that it is of a crucifixion victim, showing no corruption, so that the image was formed within 36 hours after death, and then image formation ceased.  If there had been no resurrection, then we might expect that the process would have continued, probably showing signs of corruption, and even blurring of the image,  Deliberate removal of the body from its burial cloths at this stage is too incredible to contemplate. \nThe references to the upper side of the body versus the lower side beg the question that the body was in fact lying on its back.  We cannot know this, and the no flattening of the buttocks area may suggest that it was in fact lying on its side.  \nI concur with Jos Verhulst, that any naturalistic explanation must account for the clarity of the image, its relatively high visual resolution, its evenness, and I must say the fact that it shows an orthogonal aspect on the cloth, with no lateral distortion nor images of the sides.  I will also agree that these requirements make a naturalistic explanation extremely difficult to conceive, but that is not to say impossible.\n\n","date":"September 19, 2012 at 4:46 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16498","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"Dave, you wrote: \n  “The references to the upper side of the body versus the lower side beg the question that the body was in fact lying on its back. We cannot know this, and the no flattening of the buttocks area may suggest that it was in fact lying on its side.”\n  I am glad you finally buy my idea that “the no flattening of the buttocks area may suggest that it was in fact lying on its side”. It would have been more accurate to write though: “the no flattening of the buttocks area may suggest that [the stiff rigid tortured body] was in fact lying on its side [when the image formation process occurred]”. \n  The fact is my theorical reconstruction of the TSM’s burial implies three possible scenarios :\n  1/stiff rigid tortured body’s fumigation ritual + hyperthermia\n  2/ stiff rigid tortured body’s fumigation ritual only\n  3/ stiff rigid tortured body’s hyperthermia only \n  According to my reconstruction and in all likekihood the image formed (mostly if not completly) within 4h-4h30 after death. The use of fumigation could have interrupted the Maillard reaction (whether temporarily or all the time the corpse spent in the cave-tomb).\n\n","date":"September 19, 2012 at 7:08 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16501","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"Max, I’m only open to the possibility.  For all anyone knows, the image may have formed while the body was suspended in mid-air.  But it is interesting that there are a few other images, Jospice, Veil of Antinoe you mention below (see my follow-up on this).  Also see last paragraph of mine above “naturalistic explanation must account for (etc)” particularly the last sentence.\n\n","date":"September 20, 2012 at 4:11 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16556","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"(almost buy) ;-)\n\n","date":"September 20, 2012 at 5:08 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16559","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"We can speculate ad noseam on the question of whether Rogers hypothesis for image formation can be totally right, partially right or totally wrong…  The real question is not this one.  No.  The real question is the question of what is the chromophore of the image.  I have already written about that often on this blog and I truly think that’s the main aspect science must determine BEFORE proposing any image formation process.  That’s exactly what was the method used by Rogers : First, he took EVERY solid data, observations and facts regarding the Shroud and came up with a good hypothesis regarding the chromophore of the image.  And it’s only after he was convinced that a thin layer of carbohydrate impurities was the real chromophore of the image that he start looking for a natural mechanism that could account for it.  \nSince the day he proposed his hypothesis, some members of the SSG (Fanti, Di Lazzaro et al.) have proposed another hypothesis for the chromophore of the image (the primary cell wall of the linen fiber) and right now, because new direct testing could be performed on the cloth itself, this question of the chromophore cannot be settled definitively.  It’s only once science will be sure of the chromophore that we will have a better idea of at least the probable nature (chemical, energetic, etc.) of the body image and that we will be able to better judge any hypothesis of image formation that have been proposed over the years.  \nAs I said many times here, if Rogers hypothesis is correct regarding the chromophore, any image formation hypothesis that involved any kind of energetic radiation would have to be considered highly unlikely while it would be a very strong argument in favor of a natural occurring image.  But we’re not there yet, even though the hypothesis of Rogers concerning the chromophore SHOULD be considered in the moment as the most probable that exists because of many particular data like the pectine and the starch deposits that were find on the fibers, the presence of a banding effects on the Shroud indicating a possible uneven presence of impurities on each threads (with some threads that might even have almost no impurities on them), the ghosts of color (and also the diimide reagent) leaving a clean and undamaged fiber behind, etc.  Also, and this is VERY IMPORTANT, there’s one more aspect that strongly favored Rogers hypothesis over the primary cell wall hypothesis of Fanti et al.: it is the fact that the image is very superficial and that this superficiality is the same no matter if the body was in direct contact with the cloth or if it was at a short distance of it (less than 4 cm). Effectively, Rogers hypothesis concerning the thin layer of impurities offered a very good rational and scientific explanation for this very strange particularity of the image while the hypothesis of Fanti CANNOT. Note that it is also true concerning the possible superficial image of the hair on the reverse side of the cloth. This is, for me, the most important argument in favor of Rogers hypothesis over the other ones that proposed a coloration of the linen fiber itself and I think this has been truly neglected in the recent past (the best example of this truth is the first draft of the fact list of Rolfe that was signed by almost everyone present at the conference of Valencia). Sorry but linen fibers (and the primary cell wall too) are scattered everywhere inside the cloth (not restricted to the surface) while the impurities that Rogers propose are only concentrated in a thin layer on the top surface of the cloth (on both sides), which is totally consistent with the superficiality of the image on the Shroud and totally consistent too with the fact that the image possess the same exact superficiality no matter if the body was in direct contact with the cloth or if it was located at a short distance of it. The primary cell wall hypothesis CANNOT offered a rational and scientific explanation for this particularity of the Shroud image and so, no matter what kind of image formation process could have been active to produce the image…  \nThat’s the situation right now and anybody who think that the Shroud image is the product of a supernatural kind of event should pray hard that science will never prove that Rogers was right about the chromophore !!! ;-) And I even strongly suspect that this was the real motivation of Fanti when he wrote his paper that proposed another hypothesis (the PCW) than the one of Rogers for the chromophore of the image… Effectively, it’s evident for me that he is fully aware of the fact that his corona discharge hypothesis would have to be set aside if Rogers hypothesis concerning the impurities is right. So, to conclude, I would say that the sindonologists interested by the question of the image on the Shroud SHOULD really focus their attention on the question of the chromophore before even thinking of a possible explanation for this image.\n\n","date":"September 19, 2012 at 8:25 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16505","author":"Yannick Clément","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"I would add one more little comment to complete my previous long comment.  I just want to say that beside focussing on the question of the chromophore of the image in order to have a better idea of the nature of the process that has been active inside the Shroud to formed the image, I also think Shroud scientist should try hard to confirmed the conclusion of Fanti concerning the possible presence of another superficial image of the hair (and maybe some other body parts like the beard and mustache) in the reverse side of the cloth because if it would be scientifically confirmed, this would also be another very important piece of evidence in favor of a chemical process for image formation (that could very well include totally or partially the Maillard reaction proposed by Rogers) and, at the same time, it would be another very important argument AGAINST any form of image formation hypothesis involving an energetic radiation.  Effectively, here’s what Rogers specifically said about that in his book: “Heat and radiation of sufficient intensity all the way through the thickness of the cloth WOULD NOT BE LIMITED to producing a color on the back of the cloth in the area of the hair.”  He also wrote: “We would expect to see a color in the center of the cloth.  We do not.”\nSo I am completely convinced that this is one very important aspect of the Shroud (the possible presence of a superficial image on the backside of the cloth) that should be analyzed more deeply by Shroud scientist well before they proposed any other hypothesis for image formation.  Getting access to the very high quality photographs of the reverse side of the Shroud that were done in 2000 and 2002 would be a very good step for this kind of research but I’m convinced that only a direct chemical and microscopic examination of a sample taken from this area will be enough to really settle this debate concerning the possible presence of a superficial image on the backside of the Shroud.  So, along with the question of the chromophore of the image, I think scientist MUST focus their attention on this question of the possible superficial image on the backside.  Getting finally a definitive and scientific answer to these 2 questions would greatly improve our understanding of the real nature of the image-formation process and would help to eliminate many image-formation hypothesis, because, as Rogers wrote in his book: “…the appearance of some specific parts of the image on the back of the cloth can contribute critical information toward the understanding of the image-formation mechanism.”\n\n","date":"September 20, 2012 at 9:16 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16576","author":"Yannick Clément","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"I read somewhere that there is a body image on a burial tunic. I can’t put my finger on it right now but perhaps more study of that image might yield some clues? I wish I could recall it now.\n\n","date":"September 19, 2012 at 1:00 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16512","author":"Chris","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"In his book written in 2000, Baima Bollone mentioned a few examples of body image (I think they were all partial and one of them was a cloth from a mystic in the Middle East as I recall) on linen burial cloths but I’m not sure if there is still one example of these reported cloths that can be seen and examined today.  I don’t even know if these cloths have been preserved. Nevertheless, these few reported examples are interesting because they show that a corpse CAN produce NATURALLY some kind of body image on a linen sheet…  So, that’s truly not a banal information.\n\n","date":"September 19, 2012 at 4:50 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16530","author":"Yannick Clément","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"Father Dubarle wrote an article about  the “Veil of Antinoë” (“a face veil excavated early in the 20th c. CE from a Coptic cemetery at Antinoë in Upper Egypt by French Egyptologist Albert Gayet. Apparently this veil, folded four times over the face, featured at least three imprints of the face it once covered”).\n\n","date":"September 19, 2012 at 7:16 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16538","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"I could only find two or three refs on the web to Veil of Antinoe, SHROUD SPECTRUM INTERNATIONAL, quarterly publication of the Indiana Center for Shroud Studies, issue no. 26, quote: \n“… Also of considerable interest is an article by Père Dubarle on the subject of the “Veil of Antinoë”, a face veil excavated early this century from a Coptic cemetery at Antinoë in Upper Egypt by French Egyptologist Albert Gayet. Apparently this veil, folded four times over the face, featured at least three imprints of the face it once covered.”\n“Unfortunately, although the Gayet collection still exists, and is now kept in the Louvre, the\nveil in question is either no longer extant, or its imprints have disappeared. As noted by Père\nDubarle, the pioneering French Shroud scholar Paul Vignon must have known of the Antinoë\nveil, but appears to have taken no interest in it.”  (Looks like 19th C French Egyptology) \nI was unable to follow up any other reference.\n\n","date":"September 20, 2012 at 4:06 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16555","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"Exact Dave.  That’s one of the few burial linen cloths with a body image on it that Baima Bollone talks about in his book…\n\n","date":"September 20, 2012 at 9:17 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16577","author":"Yannick Clément","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"Dave see too DAL MANDYLION ALLA VERONICA Relazione di Massimo Centini: \n“il velo proveniente dal cimitero di Antinoe, in Alto Egitto: si tratta di un velo del 500 d.C., posto sul volto del cadavere di un cristiano. Oggi il reperto è scomparso ed è un vero peccato: il velo era ripiegato in quattro e su ogni lato riportava l’impronta del volto del cadavere; tre lati erano particolarmente visibili, mentre il quarto presentava un’immagine piuttosto frammentaria. Secondo il parere degli archeologi, la formazione dell’immagine sarebbe dovuta all’azione degli aromi usati per la sepoltura”.\n\n","date":"September 20, 2012 at 6:09 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16563","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"Google translate from Italian: “The veil from the cemetery Antinoe, in Upper Egypt: it is a veil of AD 500, placed on the face of the corpse of a Christian. Today the piece and disappeared and it is a real shame: the veil was folded in four and on each side carried an imprint of the face of the corpse, three sides were particularly visible, while the fourth had a rather fragmented. In the opinion of archaeologists, the image formation would be due to the action of spices used for burial” \nThat looks very significant indeed.  Cloth of 500 AD (doesn’t say if linen, cotton or other material)  spices (possibly speculation from hearing about Rogers or Maillard?),  Possibly some doubt as to whether the veil has disappeared, or whether the image disappeared so the veil now can’t be identified??  I think it may have been deposited in the Louvre museum.\n\n","date":"September 20, 2012 at 6:52 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16566","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"Here  “ripiegato in quattro” can be translated in Greek “tetradiplon”….\n\n","date":"September 20, 2012 at 9:14 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16575","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"That is just too cute, Max.  Clearly the Shroud wasn’t tetradiplon when the original image was formed.\n\n","date":"September 20, 2012 at 4:24 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16609","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"I don’t think the Antinoe veil is significant at all! Call me stupid if you like, but the fact the image soaked thru three layers of the veil proves to me, it was definately UNLIKE the Shroud image or whatever caused it. I would suspect any cloth placed over a rotting corpses face would sustain stains, maybe even showing the features. But, a stained cloth verse the Shroud image peculiar ‘properties’ are very far apart. Furthermore we are talking of something we cannot see, investigate or study. What some archaeologist may have ‘speculated’ to the cause of the image is irrelevant…Next….\nR\n\n","date":"September 20, 2012 at 4:55 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16615","author":"Ron","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"What it can prove nevertheless is that a dead body CAN produced some form of a body image on a ancient linen cloth Ron.  That should not be regarded as a banal information.  The same thing is true concerning the Jospine Mattress…\nHey, you just wrote to Rolfe to stay open-minded because there are still a lot of things we don’t know about the image on the Shroud.  Don’t contradict yourself here please !!!  Stay OPEN.  Maybe this Antinoe cloth, if it could be analyzed by scientist could help us to understand better some aspects of the Shroud image even though we can think at first sight that it was possibly a somewhat different image formation process that has been involved in that case.  But anyway, I would be very prudent not to draw a definitive conclusion about that because we never saw even a picture of that cloth !  And since there could be an image of the hair, the beard and the mustache on the backside of the Shroud, how can you be certain if the image formation process that was active inside the Shroud could not have formed an image of these hairs on another linen cloth if this hypothetical cloth would have been put over the Shroud in the tomb ???  How can you be certain about that ???  Also, the Antinoe cloth was reported to bears a pretty clear image of the face of the dead and not just some kind of standard stain…  I really think we should stay very open and also prudent about this reported cloth, just as we have to stay open and prudent versus the Jospine mattress.\n\n","date":"September 20, 2012 at 5:09 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16620","author":"Yannick Clément","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"Still, the Geek word ‘tetradiplon’ used in conjunction with an acheropoietic facial image receives some interesting light from the unfortunatedly now lost archaeological piece…\n\n","date":"September 21, 2012 at 7:20 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16657","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"Mystiping (Miss Typing): “the GReek word ‘tetradiplon’ used in conjunction with an acheiropoietic facial image”\n\n","date":"September 21, 2012 at 7:23 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16659","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"YC; “What it can prove nevertheless is that a dead body CAN produced some form of a body image on a ancient linen cloth Ron. That should not be regarded as a banal information.” …\nIt should not be regarded with much importance either. Unless it can be shown to leave a superficial image, i.e; One that does not permeate the cloth whatsoever!…This is not the case here at all, as three layers of cloth were soaked through!  I don’t believe any normal decaying body could ever leave a superficial image as we see on the Shroud! …Moreover, as it stands as of today, no evidence has ever been found proving my belief statement in error.\nR\n\n","date":"September 21, 2012 at 6:23 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16652","author":"Ron","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"I should have added; So I don’t believe I’m in contradiction here, as we are not talking hypothesis or studies here, but evidence and evidence that does not even exist anymore, so it cannot be studied!\nR\n\n","date":"September 21, 2012 at 6:27 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16653","author":"Ron","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"I don’t share at all your point of view on that question.  It’s a fact that there can be some body image imprint of linen cloths by a dead human body.  This mean one thing regarding the Shroud :  The image on the cloth IS NOT UNIQUE IN HISTORY, on the contrary to what is often reported in the pro-Shroud world (which is a total lie).  Of course, it is a fact that no complete body image like the one on the Shroud has ever been found, but that’s not the point.  The point is this :  science can proclaim that some biological and chemical interaction between a dead body and a linen cloth (or some other material) is POSSIBLE.  That’s not banal at all regarding the question of the image formation of the Shroud.\n\n","date":"September 22, 2012 at 6:06 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16764","author":"Yannick Clément","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"I think you’ve lost your mind Yannick, if you truly believe the Shroud image is NOT UNIQUE! …No other image, with all the properties of The Shroud image has ever been found in our history! A “soaked through veil is lightyears from a extremely superficial, 3D encoded image. If you lack the logic to see this, there is nothing anyone can do.\nR\n\n","date":"September 22, 2012 at 9:11 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16777","author":"Ron","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"Ron, you miss the heart of what I said…  I don’t say these other body images (like the one on the Jospine Mattress for example) shared all the same characteristics as the Shroud image.  I said that these few cloths are the PROOF that a dead body could interact chemical and biologically with a cloth that is in contact with him to form some kind of body images just like the Shroud.  That’s a pretty good and rational argument to think that the Shroud image could well be also the results of a chemical-biological interaction between the corpse of the crucified man and the burial cloth.  If you don’t want to recognized this truth, I don’t know what else can I say.\n\n","date":"September 22, 2012 at 9:26 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16778","author":"Yannick Clément","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"\nYannick Clément :Ron, you miss the heart of what I said… I don’t say these other body images (like the one on the Jospine Mattress for example) shared all the same characteristics as the Shroud image. I said that these few cloths are the PROOF that a dead body could interact chemical and biologically with a cloth that is in contact with him to form some kind of body images just like the Shroud. That’s a pretty good and rational argument to think that the Shroud image could well be also the results of a chemical-biological interaction between the corpse of the crucified man and the burial cloth. If you don’t want to recognized this truth, I don’t know what else can I say.\nYannick YOU are missing the point; These “some kind of body images” are NOT “just like the Shroud image” WHATSOEVER! So they cannot be compared whatsoever. The main issue is the superficiality of the Shroud image…Simple. Anyone with half a brain could deduce that a rotting corpse will stain a cloth covering it and maybe even some of these stains can create an pseudo-image, but not an image with the superficiality, i.e; depth of image as seen on the Shroud image. Remember the saying; Close only counts in horseshoes and hand grenades.\n\n","date":"September 22, 2012 at 11:33 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16784","author":"Ron","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"Quote from Ron : “Anyone with half a brain could deduce that a rotting corpse will stain a cloth covering it and maybe even some of these stains can create an pseudo-image.”  In the case of the Jospine Mattress, that’s not at all what happened my friend !  The image appeared almost instantaneously after the death of the man !!!  And who can tell you that it was not the same for the Antinoe’s vail ?  Since this cloth has been lost apparently, science never performed any analysis on it.  So, who knows how the body image (the archaeologist who has made the discovery talked about an image and not a simple stain) was really formed on the cloth ???\nAnd concerning the superficiality of the image on the Shroud, if Rogers hypothesis concerning the image chromophore is right (as I believe it is), then there’s no great mystery there !!!  The fact that there would have been a thin layer of impurities on the extreme surface of the cloth (on both sides) and that this is what was colored gave us a clear, rational and scientific explanation for this question of the superficiality of the image…  \nAnd what is important to understand is this :  Since there are a few examples of body images of corpses on cloth in history, I don’t see any good reason for science to analyze the Shroud differently than the analysis that could be performed on these cloths !  In other words, science MUST put any religious conceptions and bias on the side when it comes the time to analyze the Shroud, just like it would be the case for these other cloths.  But unfortunatelly, that’s not the case at all in this post-STURP era !  Not at all !!!  You don’t believe me ?  Then just give me the name of ONE (just one !) non believer who do Shroud science today ???  I don’t say here that any Christian scientist that is doing Shroud science today have surely a pro-Shroud bias but there’s a great danger that it is effectively the case and I’m truly convinced that there are a bunch of those guys who really have such bias that intervene in their science (consciously or not).  To me, that’s the real drama of modern Shroud science !!!\n\n","date":"September 23, 2012 at 6:54 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16819","author":"Yannick Clément","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"How do you know for sure what happened in the Jospice case? How can you say it was instantaneous? It was quite a few hours  from when someone last saw him alive and they found him dead. So he could have been dead for hours. You also cannot relate the Jospice mattress cover image whatsoever with the Shroud image, as there are too many dissimilarities, Nylon vs. Linen or the fact Jospice man had numerous drugs injested for days in his system, and he was Jondice.Plus it was well known he had wet the bed several times. Again your logic is flawed and your making assumptions…Furthermore, no one can say anything about the veil except we know the image had permeated three layers of material as was the case with the Jospice mattress as it pertmeated the sheet. This one point alone is enough to warrant dismissal of any kind of similarity. Again you are assuming an hypothesis in defence of another hypothesis in that Rogers may be right in his impurity layer, I can make an assumption to; It is very unlikely an impurity layer would be ‘evenly’ spread across the sheet to give us the image we see.How is that for an assumption?\nR\n\n","date":"September 23, 2012 at 9:51 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16828","author":"Ron","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"It is very unlikely you could find cotton evenly hidden in linen threads. How is that for an assumption ?\n\n","date":"September 24, 2012 at 2:05 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16832","author":"anoxie","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"\nanoxie :It is very unlikely you could find cotton evenly hidden in linen threads. How is that for an assumption ?\nI don’t get your point, anoxie. Can you elaborate?\nR\n\n","date":"September 24, 2012 at 2:32 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16833","author":"Ron","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"I mean the shroud proved we should be carefull with assumptions and rely on facts.\nConcerning the imprity layer, it could be not perfectly spread at all. Have a look at the banding effect and local aspect of color distribution. Microscopically, thickness of the layer may range on a large scale.\n\n","date":"September 24, 2012 at 2:46 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16835","author":"anoxie","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"I agree 100% and one must ask; What exactly is the cause of the banding?, if not the impurity layer.\nThanks for your response anoxie.\nR\n\n","date":"September 24, 2012 at 3:51 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16838","author":"Ron","site":"shroudstory"},{"title":"Latest on David Rolfe’s Site on Maillard Reaction","post":"Treatment/alteration/properties of the primary cell wall ?\nMechanical properties of image fibers are different from non image fibers. If confirmed, I can hardly imagine how a thin impurity layer could increase sensitivy of fibers to tensile stress, without altering pcw.\nRogers didn’t know the pcw, but his hypothesis is consistent with pcw/impurity layer or interaction between both as the chromophore.\n\n","date":"September 24, 2012 at 5:05 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","id":"comment-16840","author":"anoxie","site":"shroudstory"}]
