[{"title":"Lightening Striking the Other Crucified Person in His Shroud","post":"The Shroud corroborates the Gospels and the OT prophecies.  It’s a kind of 5th Gospel.\n\n","date":"August 14, 2015 at 7:12 am","url":"https://shroudstory.com/2015/08/14/lightening-striking-the-other-crucified-person-in-his-shroud/","cat":"image_theory","id":"comment-208243","author":"Dcn Andy","site":"shroudstory"},{"title":"Lightening Striking the Other Crucified Person in His Shroud","post":"Yes… But most probably not for the reasons Di Lazzaro and his team are trying hard to promote!  Unlike what these Italians are thinking (and are trying to make believe), it’s highly probable that the image formation process is talking much more about Jesus’ Passion and death than his Resurrection!\n\n","date":"August 14, 2015 at 12:11 pm","url":"https://shroudstory.com/2015/08/14/lightening-striking-the-other-crucified-person-in-his-shroud/","cat":"image_theory","id":"comment-208259","author":"Yannick Clément","site":"shroudstory"},{"title":"Lightening Striking the Other Crucified Person in His Shroud","post":"“Speculation too far…”   and then some. The lightening part is interesting, but the whole ‘this would discount the Gospels’ musing is off the rails.\n\n","date":"August 14, 2015 at 8:27 am","url":"https://shroudstory.com/2015/08/14/lightening-striking-the-other-crucified-person-in-his-shroud/","cat":"image_theory","id":"comment-208246","author":"David Goulet","site":"shroudstory"},{"title":"Lightening Striking the Other Crucified Person in His Shroud","post":"Even Herbert Thurston had to admit, perhaps grudgingly, that if it wasn’t Jesus on the Shroud, then it was certainly meant to be [ “Of that there can be no doubt … ” ].  The give-away is the wounds on the head from the “crown” of thorns.  \nThe lightning comment is interesting, I hadn’t heard about the forming of anti-matter before, but it would be very short-lived, immediately combining with matter and releasing a huge amount of energy.  I know of no case where a body has disappeared as a result of a lightning strike; Does anyone else?  I’ve heard that typically in the case of a lightning strike, the electricity forms a narrow tunnel through the body from the strike point to the ground contact.   \nThe encounters with the resurrected Christ by independent witnesses in the NT are too numerous and consistent to be dismissed as outright fabrication.  The “new religious movement” was one of many such, but quite different from the others, in its new moral tone, in defining of relationships, standards of behaviour, in its counter-culture, in its underlying theology, and in its subsequent history, making it exceptional.\n\n","date":"August 14, 2015 at 3:41 pm","url":"https://shroudstory.com/2015/08/14/lightening-striking-the-other-crucified-person-in-his-shroud/","cat":"image_theory","id":"comment-208279","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Lightening Striking the Other Crucified Person in His Shroud","post":"UV from a nearby flash would just radiate on the outside of any close objects I guess. UV is light.\nHow could it penetrate and affect the shroud the way it is?\nStrong UV light may only be produced by the most energetic phase of lightning called the return stroke (20-30 kiloamperes on average) ,\n,so to have a possible interaction with the shroud, a direct strike should be needed.\nA direct return stroke would have produced considerable damage to\nthe shroud as well as to the corpse. As far as I know this is not the case.\nPrior to lightning strike, corona discharges may take place on nearby objects.\nThis indeed could possibly radiate from the body, if the shroud is rather dry. No direct strike is required for that.\nBut, such a strong corona effect is usually produced in open air, in the immediate vicinity of the stroke.\nWhen the shroud image was produced, rigor mortis seems to imply that the body had been in the tomb for several hours.\nIn such a place, no lightning strike could occur, no lightning-induced corona discharge could be expected.\nMike\n\n","date":"August 15, 2015 at 9:24 am","url":"https://shroudstory.com/2015/08/14/lightening-striking-the-other-crucified-person-in-his-shroud/","cat":"image_theory","id":"comment-208318","author":"Mike","site":"shroudstory"},{"title":"Lightening Striking the Other Crucified Person in His Shroud","post":"Honestly, isn’t this a new competitor for the “Most Absurd Theory about the Shroud of Turin Ever,” not to mention Christianity in general?  It’s just jaw-dropping in its nonsense.  To start with, a lightning bolt could not produce the image on the Shroud, much less dissolve a human body.  \nBeyond that, what kind of morons would the apostles and early Christians have to have been to see this inexplicable event (hypothesizing for the moment that it could have happened), then conflate two separate lives, make up a series of miraculous deeds that Jesus performed, abandon their previous livelihoods and spread a story that no one would believe (because no one would have heard word one about miracles that didn’t take place) in order to get themselves martyred in brutal deaths for a heavenly reward by a figure they had just made up?\nThere’s an old expression about believing ridiculous assertions: “If you believe that, I’d like to talk to you about buying the Brooklyn Bridge.”  Anyone who would give this ludicrous lightning proposal even a shred of credibility should put their money in trust immediately because those bridge proposals cannot be far behind.\n\n","date":"August 15, 2015 at 12:01 pm","url":"https://shroudstory.com/2015/08/14/lightening-striking-the-other-crucified-person-in-his-shroud/","cat":"image_theory","id":"comment-208321","author":"Jim Carney","site":"shroudstory"},{"title":"Lightening Striking the Other Crucified Person in His Shroud","post":"Well, I suppose the general point is that the likelier the Shroud of Turin is to be the burial cloth of the man whose crucifixion is described in the Gospels, the closer it is to enabling us to formulate an empirically falsifiable hypothesis that would include the proposition that Jesus rose from the dead.  Formulating an empirically falsifiable hypothesis is the first step towards the development of scientific understanding.  An hypothesis that survives enough attempts at falsification can grow into knowledge.  So, if you are hoping for science to show that Jesus rose from the dead, the recent test results regarding the shroud are exciting.  \nHowever, falsifiable hypotheses are quite often falsified. If the results do hold up, therefore, and the shroud is shown to be that of a man who was crucified in Jerusalem in the first half of the first century in the manner described in the Gospels, then sooner or later an examination of some kind may lead to evidence either that Jesus rose from the dead or that he did not.  Evidence that Jesus did not rise from the dead would be evidence against everything in the Gospels.  Don’t take it from me that the Gospel does not hold together if Jesus did not rise from the dead.  As you may recall, Saint Paul had something to say about that in the fifteenth chapter of the first letter to the church in Corinth.  If you don’t acknowledge Saint Paul as an authority, then reading the comments on a blog about the Shroud of Turin is a very strange hobby for you to have.  So I think we can all agree that if the results hold up there will be a great deal at stake in future examinations of the Shroud of Turin.\n\n","date":"August 17, 2015 at 9:54 am","url":"https://shroudstory.com/2015/08/14/lightening-striking-the-other-crucified-person-in-his-shroud/","cat":"image_theory","id":"comment-208428","author":"acilius","site":"shroudstory"}]
