[{"title":"Manipulated Miracles","post":"I explained to Dan how the image got on the cloth but it has to do with being born again or receiving salvation, and who wants that? I received a new heart from the Spirit in Genesis, and at that time it was a bright light of the Spirit that did the work. It must have been this same light, when it brought life back into Jesus body, that put the image on the cloth. Ezekiel 36:26 \nSo keep ranting about it if you don’t have anything else to do.\n\n","date":"July 25, 2015 at 4:47 pm","url":"https://shroudstory.com/2015/07/25/manipulated-miracles/","cat":"image_theory","id":"comment-206547","author":"mickeymullen","site":"shroudstory"},{"title":"Manipulated Miracles","post":"Hi Dan,  you wrote  “Or – drum roll – God said, let there be an image on the cloth. And there was”\nThat is really funny.   I really enjoyed reading that.  It brought a welcome smile to my face. They say laughter is the best medicine.  thanks for the meds.   I never did congratulate you on reaching the 3 million view mark on the Blog Site.  Congratulations!   It really is a bench mark moment.    Now you are 3 million and some change.   this can be a fun site to be on.  A little excitement in a otherwise dull day. Some of the best info on the Shroud can be found here.  Add Barry S site to that as well. Keep up the good work Dan!\n\n","date":"July 27, 2015 at 12:20 pm","url":"https://shroudstory.com/2015/07/25/manipulated-miracles/","cat":"image_theory","id":"comment-206682","author":"Dave Hines","site":"shroudstory"},{"title":"Manipulated Miracles","post":"Hi Dan, one more thing thanks for putting up some of my videos on your site, even though you do necessarily agree with the content.   Much appreciated. I aspire to do better work.\n\n","date":"July 27, 2015 at 12:24 pm","url":"https://shroudstory.com/2015/07/25/manipulated-miracles/","cat":"image_theory","id":"comment-206683","author":"Dave Hines","site":"shroudstory"},{"title":"Manipulated Miracles","post":"Sorry Dano,  I made a typing error,  I meant to say, thanks for posting some of my videos “even though you do NOT necessarily agree with the content”\n\n","date":"July 27, 2015 at 12:46 pm","url":"https://shroudstory.com/2015/07/25/manipulated-miracles/","cat":"image_theory","id":"comment-206684","author":"Dave Hines","site":"shroudstory"}]
