[{"title":"Mario Latendresse’s take on the 3D data","post":"What I really like about Mario’s work is the clarity of what he has done and the fact that it is totally objective. I am extremely interested in the progress of his project (started in April), in which the cloth/body distance is explored in more detail.\nCan I just check with Mario that I understand the process? As far as I can determine, you have the surface of a head programmed into a computer, and the surface of a cloth covering the head. By subtracting the ‘height above datum’ of the head from the ‘height above datum’ of the cloth, you are left with a vertical interval. By sampling hundreds of spots, and converting each measurement to a grey spot whose darkness relates to the height measurement, you will then be able to print your own ‘shroud’ which you will then be able to compare with the original. Is that correct?\nYou could then go on to calculate various other possible cloth body distances, as listed by OK; perpendicularly outwards from the various planes of the head, perpendicularly inwards from the cloth, or the shortest distance from the body to the cloth, and vice versa.\n\n","date":"November 4, 2013 at 7:55 pm","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-49955","author":"Hugh Farey","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"Hugh, yes, your description is a summary of the intended simulation. The main digital data is 1) a 3D surface of a sheet covering a body (in the photo you see at sindonology.org, it is only the head), 2) the 3D surface of the body. These two 3D surfaces were created from real objects. The space between the body and the sheet can be studied, such as the distance etc. But more importantly, various computer simulation can be done, in particular projections from the body to the sheet based on different hypotheses (diffusion, radiation). The sheet can then be digitally flattened to show the resulting images. This is likely to produce, more or less, some of the small distortions we see on the Shroud, such as elongated fingers, the hair appearing straight down, and more. Hopefully, I will have the (free) time to do all of these.\n\n","date":"November 5, 2013 at 1:16 pm","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50067","author":"Mario Latendresse","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"“This is likely to produce, more or less, some of the small distortions we see on the Shroud, such as elongated fingers, the hair appearing straight down, and more.”\nSorry, Mario, but this is not a good advertisement for computer modelling…\nBtw: who financed the magnificent ShroudScope?\n\n","date":"November 5, 2013 at 1:27 pm","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50068","author":"colinsberry","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"Once, again, forget about 3D and think of spatial information.\nThe shroud produces a “good 3D” means constrast is roughly correctly correlated one way or another to spatial information (body-shroud distance ?).\nA photograph produces a “bad 3D” means contrast is badly correlated (but still more or less slightly correlated) to spatial information.\nJackson ‘s experiment based on a photograph with emitted light attenuated through water gives an “excellent 3D”, means correlation between contrast and spatial information is very good (experiment is designed this way).\n\n","date":"November 5, 2013 at 4:38 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-49995","author":"anoxie","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"\nanoxie :\nOnce, again, forget about 3D and think of spatial information.\nThe shroud produces a “good 3D” means constrast is roughly correctly correlated one way or another to spatial information (body-shroud distance ?).\n\nYes.\n\nanoxie :\nA photograph produces a “bad 3D” means contrast is badly correlated (but still more or less slightly correlated) to spatial information.\nOnly in  very specific cases, when the light is stable and coming directly in front of the object or person, there are no shadowed area, reflectivity of all the object’s surface is the same (the best  is if the whole thing is painted white, like Nicholas Allen did with his model) etc. In practice, it is almost impossible to obtain.\n\nanoxie :\nJackson ‘s experiment based on a photograph with emitted light attenuated through water gives an “excellent 3D”, means correlation between contrast and spatial information is very good (experiment is designed this way).\n\nYes, but one must remember what spatial information. Because in the case of the Shroud it is not the distance from body to camera, but from body to linen, which varies point to point. That’s why the  3D relief of TS Man’s body is slightly distorted, because one must take into account the way the linen drapped the body.\nAnd Jackson experiment was in small scale. Compare with difficulties to obtain it with 180 cm model, and of course in the medieval times!\n\n","date":"November 5, 2013 at 5:01 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-49999","author":"O.K.","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"” ..Jackson experiment was in small scale. Compare with difficulties to obtain it with 180 cm model, and of course in the medieval times!”\nDifficulties? What difficulties? Jackson’s is a radiation model, and an exotic kind of radiation too, one that it now seems required a certain rock tomb to become submerged in water or some other radiation-attenuating medium in order to get collimated Resurrectional radiation to obey some kind of substitute for boring old Newtonian optics.\nOur medieval fabricator did not use or need radiation. There are conventional means of producing images on cloth from 3D subjects, ones that capture and imprint 3D information. Think brass rubbing off bas-relief templates, think Garlaschelli’s frottage, and you may find that your “difficulties” suddenly attenuate to zero, just like Jackson’s magical radiation when it hit a metaphorical brick wall (or 1st century equivalent, e.g. circular stone, with hermetically-sealing water-tight properties).\n\n","date":"November 5, 2013 at 5:16 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50002","author":"colinsberry","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"\nO.K. :\n the  3D relief of TS Man’s body is slightly distorted, because one must take into account the way the linen drapped the body.\n\nI think Jackson himself has produced the first model taking into account the drapping to correct distortions.\n\n","date":"November 5, 2013 at 5:25 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50005","author":"anoxie","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"On Monday, we’ll rule out contact models, on the grounds there would be lateral distortions, and decide to concentrate on our radiation models instead (which happily fit our miracle-accommodating 1st century narrative).\nOn Tuesday, we’ll belatedly acknowledge there are lateral distortions, so start to tinker with the details of our radiation model, forcing our model to conform with the facts, trying to ignore a ticking of the ribs by Occam’s razor.\nSorry, but THIS IS NOT THE SCIENTIFIC METHOD.\n\n","date":"November 5, 2013 at 5:35 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50006","author":"colinsberry","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"Prove to me Occam’s Razor is valid. This is the equivalent in science of a Bigfoot sighting…or an authentic 1st century Shroud – lot’s of circumstantial evidence but no real proof.\n\n","date":"November 5, 2013 at 2:23 pm","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50073","author":"David Goulet","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"Sorry Collin, but distortions and distortions are different things.\nOne must be aware what he is talking about. In the Shroud, there are no major lateral (2D) distortions. They would certainly be had the cloth was in direct contact with the body (and BTW,  no 3D would be visible then), but this is not the case. There are some minor lateral distortions (contrary to what is often said), and that’s good because it indicates that the cloth wrapped the real body. And they can be used to solve some pseudo-arguments of the sceptics, for example Schafersman tried to “prove” the Shroud being fake, because eyes of the TS Man are too high. But see: http://ok.apologetyka.info/upload/ap_upload/articles/15/2013/06/calun27.jpg and this: http://ok.apologetyka.info/upload/ap_upload/articles/15/2013/06/rysunekxxi.jpg\nMario Latendresse has shown that if the cloth was laying on the body like blue line on this picture http://ok.apologetyka.info/upload/ap_upload/articles/15/2013/06/rysunekvii.jpg no major 2D distortions would occur.\nAnd there are also 3D distortions, which are different than 2D distortions. They are also consistent with thesis that Shroud wrapped the real body. And they are tough nut to crack for any fans of idea that bas-relief was instead used by the forger.\n\n","date":"November 5, 2013 at 6:39 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50018","author":"O.K.","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"What you have written is far too self-serving in model-evaluation terms to warrant a detailed response, OK. All I would say to you is that contact/conduction models do not require imprinting off the sides of a 3D subject. If the template is a real person, one can be content with just the topmost planes. If using an inanimate template, one can make it as a bas-relief, anticipating lateral distortions, and go modelling accordingly.\nI see nothing in the 3D images of the Shroud to exclude modelling off templates by contact, and indeed can see a lot that suggests that was exactly the method employed. But I am hugely entertained by the attempts of New Age Physics to persist with its wacky radiation model, especially as it now seems to require a water bath to get the necessary radiation attenuation that would permit capture of cloth-image distance and “3D encoding”. How long before the Biblical record is modified to take account? First it was earthquakes needed to release radon gas. Expect to read of torrential rain flooding that rock tomb any day now, with displaced aragonite travertine dust forming an effective mud seal around the circular stone. Or did 100lbs of myrh and aloes create a beaver-style dam?\nRarely a day goes by without Shroudology throwing up yet another new detail to legitimise or embellish the narrative. I just wish some of those details stood up to more than a second or two of scrutiny (based on the kind of science that is to be found between the covers of standard textbooks).\n\n","date":"November 5, 2013 at 7:06 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50029","author":"colinsberry","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"And burnt Templars and leeches aren’t wacky? Give your head a shake, man. Your theories are as bonkers as anyone’s as you try to fit the evidence to meet your narrative. But keep them coming one and all. Insights always come from unexpected places — the scientist who denies that is no scientist, but merely a computer.\n\n","date":"November 5, 2013 at 11:03 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50045","author":"David Goulet","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"\nMario :\none for the original image and a different color for the shifted pixels\n\nMario, shroud image is isotropic, have you tried a vertical or an oblique shift ? Isn’ t the best result from an horizontal shift because constrast gradient is mainly horizontal ? (thinking of a vertical cylinder – no 3D with a vertical shift  legs, nose, hair…)\n\n","date":"November 5, 2013 at 6:49 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50021","author":"anoxie","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"No it is because our eyes are oriented horizontally. We perceive 3D on the basis of paralax, and such shift has to fool our mind.\n\n","date":"November 5, 2013 at 6:52 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50022","author":"O.K.","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"Sorry it doesn’t matter, forget the previous one.\n\n","date":"November 5, 2013 at 6:55 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50024","author":"O.K.","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"You can look at the shroud picture the way you want, upside down, 30°, 45°, and apply the shift this way. Your eyes will still be oriented “horizontally” according to the shift pixels.\n\n","date":"November 5, 2013 at 7:02 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50026","author":"anoxie","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"O.K., never minds.\n\n","date":"November 5, 2013 at 7:03 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50027","author":"anoxie","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"Anoxie, what is your full name?\n\n","date":"November 5, 2013 at 11:20 pm","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50118","author":"latendre","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"\nDavid Goulet :\nAnd burnt Templars and leeches aren’t wacky? Give your head a shake, man. Your theories are as bonkers as anyone’s as you try to fit the evidence to meet your narrative.\nBut keep them coming one and all. Insights always come from unexpected places — the scientist who denies that is no scientist, but merely a computer.\n\nLeeches? Far from being wacky, it was a considered systematic and logical attempt to respond to a challenge from someone on this site, who suggested there were daunting practical problems in applying blood as paint to linen. How would you able to paint with blood that starts to clot almost as soon as it is drawn, and who would be willing to supply that blood?\nWell, it’s a historical fact that bloodletting has been used as a means of treating disease since time immemorial, so there was no shortage of blood for use as “paint”., but there was still the problem with coagulation. That’s when I remembered that leeches have been used as a means of withdrawing blood, that the amounts can be quite large, say 10 ml, that it takes the leech months to digest each meal, that the blood does not clot because the leech secretes an anticoagulant. On further reading I discovered two other facts that could explain some puzzling findings from STURP. Leeches are only interested in the haemoglobin, and quickly get red of the watery plasma. That could explain why Shroud “blood” is strangely deficient in potassium and maybe sodium too. Then there was Rogers’ finding of a large amount of 4-hydroxyproline in blood. Why – given it’s a breakdown product of collagen and connective tissue, and one does not expect a lot in blood. But a leech has a lot of collagen, which may have contaminated semi-digested blood taken from a squashed leech for use as paint. Oh, and let’s not forget that atypical spectrum that Adler obtained for Shroud porphyrin. Who’s to say that was not the spectrum of semi-digested haemoglobin, instead of his wacky bilirubin hypothesis.\nPortray me too as wacky if you wish, David, but you only get away with it because I don’t have access to the Shroud. If I did, I would willingly sink some of my own resources into having a proper and thorough analysis done on the haemoglobin and its degradation products, considering that STURP barely scratched the surface, and as soon as anomalous results were obtained, instantly resorted to conjectures based on trauma and crucifixion. That’s not science. That’s making results fit preconceived notions. They seem to have forgotten what science is basically all about – questioning preconceived notions,.\n\n","date":"November 5, 2013 at 11:26 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50048","author":"colinsberry","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"Perhaps wacky is a poor choice of words but it’s one you like throw around. Your theory is outside the box. There’s no history of leech art, is there? You had an inspiration, a creative inspiration. That’s great. And it fit the narrative you had of a medieval forgery. You use science terms like ‘hypothesis’ and ‘research’ and ‘logic’. Different words for “I have a hunch and I bet there’s proof I’m right”.\nI’d hazard a guess that most people here find you a bit prickly and arrogant. A bit of a thorn in the side. But that’s exactly what is needed, someone who forces everyone to raise their game. Your personal crusade to hold Shroud science to a higher bar is necessary.\nSo if Pope Francis ever gives access to the Shroud for new science, I’ve love to have you there. That’s how wacky I am.\n\n","date":"November 5, 2013 at 11:50 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50052","author":"David Goulet","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"No comment\n\n","date":"November 5, 2013 at 11:54 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50053","author":"colinsberry","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"\nDavid Goulet :\nProve to me Occam’s Razor is valid. This is the equivalent in science of a Bigfoot sighting…or an authentic 1st century Shroud – lot’s of circumstantial evidence but no real proof.\n\n Occam’s razor is not some tendentious proposition or high falutin’ philosophical debating point. Occam’s razor is simply a preference for simplicity over complexity  – namely that, other things being equal,  a proposition that is not hedged around with lots of qualifying assumptions is more likely to be correct than one that is.  It’s really another way of saying: trust to your common sense (I do, and it rarely fails, unless one is Einstein pondering on the borderline between space and time, matter and energy)\nHaving said that, Occam’s razor is no longer fit for purpose in Shroudology. What’s needed now is Occam’s chain saw. There’s so much deadwood through which one needs  to clear a path, latter part of  20th century for the most part. Sorry, but someone has to say it (and better coming from someone who has read up on the subject), and actually has no axe to grind (please let it be 1st century, despite the weight of evidence)\n\n","date":"November 5, 2013 at 3:06 pm","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50075","author":"colinsberry","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"You need to read more Sir Arthur Conan Doyle. “Eliminate all other factors, and the one which remains must be the truth.” It’s what lead you to the leeches and scorched Templar theory, not Occam’s Razor.\nLove the ‘despite of evidence’ line too. I’d accept ‘lack of evidence’ because it actually applies — both ways. Or you could substitute ’14th century’ for ‘1st’ and it would apply just as truly.\n\n","date":"November 5, 2013 at 3:22 pm","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50076","author":"David Goulet","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"I’m not usually given to paranoia, but I’m starting to wonder the reason for your existence on this site. You appear to be tracking me.\nThis shroudology (as in scientology) thing gets more interesting by the day…  ;-)\nOh, and my (well-read ) wife says you have misquoted Conan Doyle, and has quoted a much longer passage from memory. Yours is a travesty thereof.\n\n","date":"November 5, 2013 at 3:31 pm","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50077","author":"colinsberry","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"Sometimes thorns need thorns of their own.\nI’ll defer to your wife on Sherlock. Sadly I’m more up on the silver screen Holmes than the books.\n\n","date":"November 5, 2013 at 3:35 pm","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50079","author":"David Goulet","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"Not wanting to be accused of mangling a literary great I checked for a more definitive version of the Doyle quote and found this (in context): “You will not apply my precept,” he said, shaking his head. “How often have I said to you that when you have eliminated the impossible, whatever remains, however improbable, must be the truth? We know that he did not come through the door, the window, or the chimney. We also know that he could not have been concealed in the room, as there is no concealment possible. When, then, did he come?”\n     The Sign of the Four, ch. 6 (1890)\n     Sherlock Holmes in The Sign of the Four (Doubleday p. 111)\n\n","date":"November 5, 2013 at 3:56 pm","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50080","author":"David Goulet","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"\nDavid Goulet :\nNot wanting to be accused of mangling a literary great I checked for a more definitive version of the Doyle quote and found this (in context): “You will not apply my precept,” he said, shaking his head. “How often have I said to you that when you have eliminated the impossible, whatever remains, however improbable, must be the truth? We know that he did not come through the door, the window, or the chimney. We also know that he could not have been concealed in the room, as there is no concealment possible. When, then, did he come?”\n     The Sign of the Four, ch. 6 (1890)\n     Sherlock Holmes in The Sign of the Four (Doubleday p. 111)\n\nSherlock Holmes said  ” When you have eliminated the impossible“. \nYou with your literary pretensions recast that as “When you have eliminated all other factors“.\nBit of a difference, what?\nI don’t care for people with literary pretensions who misquote and twist the words of others, especially literary greats.\nGoodnight David Goulet. I suggest you go away and do your homework – thoroughly, before pitting me against your second hand literary wisdom.\nOh, and marry a woman who’s better read than you…\n\n","date":"November 5, 2013 at 4:20 pm","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50082","author":"colinsberry","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"My literary pretensions came from the internet. I couldn’t recall the exact quote and hit upon the first one. I’m grateful for your wife’s correction, which is why I re-posted. The corrected quote is actually more appropriate to your medieval theories. You eliminated the impossible (a miraculous image process) and came up with others that, while improbable, your logic deems as truth. It was not Occam’s Razor but Sherlock’s Razor that you followed.\nToo late to marry a woman better read than myself, but my wife informs me that she’s grateful that she married a man more gracious than the one your wife married.\n\n","date":"November 5, 2013 at 4:31 pm","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50084","author":"David Goulet","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"Nice reply (shame about the abstruse middle section). There’s hope for you yet.\n\n","date":"November 5, 2013 at 4:54 pm","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-50088","author":"colinsberry","site":"shroudstory"},{"title":"Mario Latendresse’s take on the 3D data","post":"Reblogged this on Best of Shroud Story.\n\n","date":"September 29, 2014 at 5:55 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","id":"comment-157629","author":"Dan","site":"shroudstory"}]
