[{"title":"Maybe a New Image Hypothesis?","post":"Off top. Dan, have you received also my e-mail, about Kornelimünster relics? Can you manage to deal with it, and produce a posting? I see that you are bombarded with several e-mails, and overwhelmed with work. I fully understand that. \nNevertheless, if I can voice my opinion, those Kornelimünster relics are more urgent case, then for examle “Anticipating the Conference” postings. But of course you decide -it is your blog.\nI’ll try to slow down for a few days.\n\n","date":"June 20, 2014 at 5:39 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131625","author":"O.K.","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Thermochemical  is much more  plausible image mechanism than scorching. Discussing the many possibilities of image formation on the Shroud with color scientists at Eastman Kodak and on Linkedin who believe that this is man made, many concluded that lensing was a key element for the formation. This means that a source was perpendicular to the Shroud. One way to achieve this would be to add an accelerator (High alkaline substance) by applying the substance using a flue type mechanism. With the accelerator in place, a chemical reaction now can take place, creating a plate type image. The idea might have been used to mass produce cartoons. (Carpets).\nI’m only the messenger so don’t direct any hate mails at me.  However, if Colins would like to investigate further, I would be willing to share any notes I may have if I can find them.\n\n","date":"June 20, 2014 at 6:59 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131644","author":"Giorgio","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Thanks Giorgio.\nAs I expect you and others here will gather, this latest posting of mine is little more than blue sky thinking at this stage. It’s being continually added to. Think of it if you like as a work in progress (or as some will inevitably say, regress).\nInterestingly, I made a reference to “perpendicular geometry” just a few minutes ago and to the intriguing possibility of ‘reverse side imaging’.\n\n","date":"June 20, 2014 at 7:15 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131649","author":"Colin Berry","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Giorgio, methinks actually ‘hydrothermochemical’ is the most likely mechanism to account for the TS body image AND haematic decal formation.\n\n","date":"June 20, 2014 at 7:43 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131659","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"I can see it now,  quicklime  explains body disappearance and image trumping de Wesselow.\n\n","date":"June 20, 2014 at 7:53 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131661","author":"Paulette","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"quicklime ???\n>Quicklime, more formally known as calcium oxide (CaO), is a caustic alkaline substance that is produced by heating limestone in specially designed kilns. There are a wide range of uses for this substance, ranging from mortar to flux, and it has been used by humans for centuries. Many companies produce and sell it, sometimes with specific chemical impurities that make it especially suitable to certain applications.\n>Humans have been aware of the steps needed to create quicklime for a very long time, and chemists believe that its generation may be one of the oldest chemical reactions known to man. People have certainly been using the material all over the world for thousands of years; in Mesoamerica, for example, people treated corn with it in a process known as nixtamalization, while in India, it was used in a mixture designed to waterproof boats.\n> Today, quicklime is used in many industrial processes, some of which were developed hundreds of years ago.\n>Quicklime is also known as burnt lime, a reference to its manufacturing process, or simply lime.\n—- —\n“… quicklime explains body disappearance and image trumping de Wesselow.”\nI am curious about this statement because, in the past, I have read something\nabout Natron, but never about quicklime (and : Where is the proof, the trace ?) …\nIs it possible to read your explanations ?\nThank you in advance.\n\n","date":"June 20, 2014 at 8:47 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131676","author":"Piero","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Methinks Colin Berry keeps recycling my ideas (use of limestone dust -and Red heifer ashes? – mixed with water to purify Yeshua’s shed innocent blood and kill flesh flies’ larvae and blow-flies’ eggs).\n\n","date":"June 20, 2014 at 8:03 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131663","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"You and Colin are on the same page at last! The only difference is you’re working from the assumption that the limestone was circa 1st century while he is is assuming it’s medieval. \nYou do have a slight advantage in that you can provide a practical application of the lime (topical embalming). The medieval theory needs stronger evidence as to how it was that lime (while available) would be used for this purpose. \nEither way it’s interesting that this can be commonly investigated and should be.\nDare we hope for a joint paper from Hamon and Berry? :)\n\n","date":"June 20, 2014 at 9:23 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131685","author":"David Goulet","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Sorry to disillusion you, David, but there is no meeting of minds as you suggest – quite the contrary in fact, as I’ve been keeping quiet for months, indeed years, at the suggestion that limestone dust imparts alkalinity to water. There may be a small rise in pH above alkalinity if dissolved CO2 (carbonic acid) is present to attack and dissolve some of the limestone (CaCO3) to make bicarbonate Ca(HCO3)2, but that’s as far as it goes. Limestone is emphatically NOT an alkali.\nToday’s sudden rush of blood to the head, i.e. “quicklime” angle,  is based NOT on the properties of limestone/calcium carbonate, but upon two entirely different man-made substances derived therefrom, namely calcium oxide and calcium hydroxide. The first of those gives the highly exothermic chemical reaction with water, with the potential for scorching linen. The second IS an alkali that may act in concert to assist the discoloration of linen by heat. \nLimestone is the precursor substance, for sure, but plays no part in the proposed thermochemical mechanism. Sorry to disappoint. No outbreak of peace just yet, especially while ludicrous accusations of  plagiarism are flying around.\n\n","date":"June 20, 2014 at 11:25 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131710","author":"Colin Berry","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"It was a ‘bridge too far’. We knew it would be. Cryptoarcheologists and chemical scientists are the Hatfields and the McCoys of academia. ;)\n\n","date":"June 20, 2014 at 11:36 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131711","author":"David Goulet","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"The TRUE fact is ash (of the Red Heifer) AND lime contain minerals. Mixed in water they do create an alkaline solution. Besides  when ammonia is dissolved in water, an alkaline solution IS produced. Is really CB a chemist?\n\n","date":"June 20, 2014 at 3:03 pm","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131784","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Max, you thinks good. I haven’t seen my notes in three years but if I recall correctly, the bacteria found of the Shroud’s reserva might have indicated the location of where the Hydrothermal calcium-carbonate location.\n\n","date":"June 20, 2014 at 8:05 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131664","author":"HSG","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"“the bacteria found of the Shroud’s reserva might have indicated the location of where the Hydrothermal calcium-carbonate location”\nAre you sure of that ?\nWhere is the inherent paper ?\n\n","date":"June 20, 2014 at 8:52 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131678","author":"Piero","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"I have found the title of some paper under the address :\nhttp://www.bradford.ac.uk/life-sciences/media/lifesciences/schooloflifesciences/ages/Andrew-Wilson-Full-Publications-List-June-2014.pdf\nDr Andrew S Wilson, PhD, MSc, BSc (hons), MIFA, FHEA; Publication list (correct as at Jun 2014)\nArchaeological Sciences, University of Bradford\nWilson AS. 2014. Digitised Diseases: Preserving Precious Remains. British Archaeology 136:36-41.\n-Schotsmans EM, Denton J, Fletcher JN, Janaway RC, and Wilson AS. 2014a. Short-term effects of hydrated lime and quicklime on the decay of human remains using pig cadavers as human body analogues: Laboratory experiments. Forensic Science International.\n-Schotsmans EM, Fletcher JN, Denton J, Janaway RC, and Wilson AS. 2014b. Long-term effects of hydrated lime and quicklime on the decay of human remains using pig cadavers as human body analogues: Field experiments. Forensic Science International.\n-Schotsmans EMJ, Wilson AS, Brettell R, Munshi T, Edwards HGM (accepted 2014) Raman Spectroscopy as a non-destructive screening technique for studying white substances from archaeological and forensic burial contexts, Journal of Raman Spectroscopy.\n-Schotsmans EMJ, Rios L, García-Rubio A, Edwards HGM, Munshi T, Van de Vijver K, Wilson AS, (accepted 2014) Lime burials from the Spanish Civil War (1936-1939): a case study. In H. Kars and L. Van den Eijkel (eds.), Soil Forensics, Springer\nHere another source:\nhttp://www.holocaustresearchproject.org/appendix/glossary.html\n                   = Quicklime =\n>An alkali chemical also known as calcium oxide or caustic lime. A white powder which burns human skin on contact. Several inches of this powder were sometimes placed in the bottom of cattle cars prior to loading in Jews and other victims of Nazi roundups. It has also traditionally been used in the burial of bodies in open graves, to hide the smell of decomposition.\n— — —\nI am skeptic about the effect of calcium oxide on linen (… and bloodstains !).\n\n","date":"June 20, 2014 at 9:27 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131686","author":"Piero","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"As early as 23 nov. 2012, in this blog I wrote about “(the Shroud) in-soaked with alkaline waters (aqueous solution of Jerusalem limestone/Malky/Melchy dust  and/or ashes of the Red heifer + ammonia present in urea of stale heavy sweat) to kill flesh flies’ larvae and blow-flies’ eggs.” I first emitted the hypothesis in 1994! \nOn “February 16-17, 2013, I wrote:\nCLOTH-TO-CORPSE ARCHAEOLOGICAL HYDROTHERMOCHEMICAL IMPRINTING\n“Reminder for Colin Berry et al:\nArchaeo(crypto)logically speaking, in the most likely hypothesis the TSM is Yeshua’s, a natural cloth-to-corpse thermal imprinting should account in turn for a high resolution superficial body image, undisturbed bloodstains and a two thousand years’ old degraded blood still looking fresh on the cloth. To trigger up such an accidental/providential image formation process, it requires:\n1/pre-mordanting conditions (i.e. burial linen cloth in-soaked with aqueous alkaline solution such as the Red Heifer waters and/or Jerusalem limestone/Malky dust mixed with waters + ammonia present in urea residues)\n2/auto-collimation (body covered with “opaques”/sand grains present in the Judean desert and that most likely covered the TSM’s corpse) and/or Jerusalem limestone/Malky dust (to account for both the soft focus effect and stochastic aspect of the Shroud image) + long inner burial linen cloth first tautly wrapped lengthwise and then compressed widthwise around body (with stretching and excessive compression at head level to explain the reverse-side incomplete pressure imprint) + next to skin-to-cloth contact followed by gradual loss of next to skin-to-cloth contact through burial inner sheet shrinkage and relative loosening as it gets sort of taut again front and back and gradually unstuck from deceased’s body the latter resting in extra height and being laid out first on its left side and then right side while drying out\n3/heating source such as corpse in hyperthermia and/or fumigation as a purifying and drying-out ritual. Low temperature alkali gelatinisation of starch residuals present in ancient linen cloth is also a possible factor as printing paste to be taken into account in the Shroud image formation process. Purifying aqueous alkaline solution (e.g. Red Heifer ashes and/or Jerusalem limestone dust mixed with water) bubble and gelatinise at low temperature (55°-85° Celsius) and thus can be used in turn as imprinting paste thin film, mordanting and pre-washing agent).\n(Last but not least reminder): Naturally pre-mordanted linen once naturally mordanted, the mordanting looks like a very light scorch or “pre-scorch”.”\nAnd as soon as February 17, 2013 at 9:57 am, I also wrote:\n“A MUST SEE: Now on his blog, CB is just ‘recycling’ my own ‘thought experiment’ into his own scorch hypothesis in a desperate attempt to give the latter more scientific/archaeological credence!”\n\n","date":"June 20, 2014 at 9:50 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131694","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Max, Sorry I never did see your hypothesis. Very plausible. The application of the limestone/Malky dust is the key to the lensing affect. According to skeptics, the application of the (alkaline) substance on a conducive substrate (3 to 1 herringbone cloth) allows  halftones to be created.  The image can not be continuos tone, thus AM frequencies and screening values. \nKohlbeck explained the image was a mercerization process and Dr. Nitowski used ammonia present in urea to create an image with a manikin inside a lime stone tomb. \nInteresting theories.\n\n","date":"June 20, 2014 at 10:41 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131703","author":"HSG","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Intriguing thread!\nHSG: I’m interested in Nitowski’s work with imaging a manikin.  Do you have a reference, preferably URL? \nAuthentic scenario:  Alkaline reaction produces body image.  Problem – difficult to explain orthogonal image if body tightly wrapped.  I find Max’s explanation of linen stretching and shrinking to produce orthogonality too unlikely for me, there’s no image of sides.  It might be approximated if sides of body packed with herbs, spices etc.  A loose draping might also do it. \nNon-authentic scenario, i.e. Byzantine or medieval:  Lensing might explain orthogonality.  Crucifixion ceased as execution procedure under Constantine 4th century.  Requires a later crucifixion victim matching gospel accounts of punishment (scourging, crown of thorns, lance wound), and with features similar to Christ iconography.  also other imaging problems e.g. rounded buttocks might imply body was vertical at time of imaging. \nByzantine records seem fairly definite that burial shroud was part of imperial relic collection from about 10th century.  Jerusalem geology well known for its presence of limestone, also sampled by Nitowski and sent to Kohlbeck in USA for comparison with STURP samples.  Shroud image shows traces of limestone on knee and nose, also elsewhere – STURP.\n\n","date":"June 20, 2014 at 5:49 pm","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131847","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"I may be wrong, daveb, but suspect that you and some others here are confusing quicklime (calcium oxide) with limestone (calcium carbonate). Notwithstanding the fact that quicklime is made by calcining limestone, and has been for centuries, possibly millennia, that’s where the resemblance ends. The two have entirely different chemical properties. \nThe focus of my posting is quicklime (a vicious substance that has to be handled with great care), one that gives a highly exothermic reaction with water, including I propose migrating body moisture from a linen-enclosed corpse on a bed of quicklime, and which on contact might generate enough heat to produce a thermal imprint on the fabric.\n Limestone if you’ll forgive my saying is irrelevant, at least in my chosen thermochemical context.  Slaked lime (calcium hydroxide), the end product of reaction between quicklime and water,  may have a supporting role to play, by virtue of its alkaline properties, an adjunct that may speed carbohydrate pyrolysis.  Limestone however is not an alkali – being insoluble in water (ignoring the additional chemistry that comes into play when CO2 is present). Please see my now completed posting for details.\n\n","date":"June 20, 2014 at 6:14 pm","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131853","author":"Colin Berry","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Thanks for reminder Colin; I appreciate the distinction, something about CaO -> Ca(OH)2 in basic Chemistry and also Engineering Materials classes, whereas ground limestone goes regularly into my garden compost bin. \nVicious stuff, CaO wouldn’t be kind to a dead body, and I wonder how gruesome any final image might look.  Suggest try it with a dead cat first as a prelim.  Could end up a disgusting mess. \nNow ground limestone, you just might get a credible image with the right admixtures, myrrh, aloes, saponaria, anyone?\n\n","date":"June 20, 2014 at 11:17 pm","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131944","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"DaveB: again, please  read my posting. There is no direct contact between corpse and quicklime. It is migrating moisture, penetrating the thickness of the linen, that meets the quicklime on the opposite, non-body side. The thermochemical reaction in your equation, quicklime plus water makes slaked lime + heat, then takes place producing a reverse-side scorch.\nThere can be no thermochemical reaction without the quicklime. I believe I am proposing an entirely new chemical scenario for image production, as Dan has correctly grasped in his choice of title.  Repeat: limestone is an irrelevance, and dare I say needless distraction. It is the enormous heat (“enthalpy”) of reaction between calcium oxide and water that is what makes scorching possible from the moisture exiting a dead but nevertheless real body in place of the heated metal effigy in the conventional scorch hypothesis.\n\n","date":"June 21, 2014 at 12:32 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131948","author":"Colin Berry","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Daveb, Start here and watch Simon Browns’ video. The link is on my home page. http://www.holyshroudguild.org/\nFrom there go to this link http://www.holyshroudguild.org/sister-damian-of-the-cross-ocd.html\nThere are 3 link pages to see. \nI also have the original VHS tape she created for the Guild about the experiment. http://www.holyshroudguild.org/video-clips.html\nThis might be on the Simon Brown site as well.\n\n","date":"June 20, 2014 at 6:15 pm","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131854","author":"Giorgio","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"daveb, Here are some PDF files that maybe of interest to you and to others.\nhttp://public.justcloud.com/dtfmh54x8p.61146615    \nhttp://public.justcloud.com/dtfmkj3tap.61146615\nhttp://public.justcloud.com/dtfmjgij52.61146615\nhttp://public.justcloud.com/dtfmk5a6g6.61146615\n\n","date":"June 20, 2014 at 10:10 pm","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131924","author":"Giorgio / HSG","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Limestone mixed (with ashes?) and water + ammonia is relevant in my chosen 1st c. CE hydrothermochemical context.\nReminder: Naturally pre-mordanted linen once naturally mordanted, the mordanting looks like a very light scorch or “pre-scorch” BUT is not a scorch…\n\n","date":"June 20, 2014 at 9:13 pm","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131905","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"PS to daveB: I have just this minute added a crude graphic to my posting that I hope will make clear that direct contact between corpse and quicklime is NOT being proposed. The two are separated by the linen shroud, and it’s the wicking of moisture across the linen to react with quicklime on the opposite, non-body side,  generating localised heat and strong alkali (calcium hydroxide)  that sets the scene for thermochemical image-imprinting. There’s no limestone i.e plain old calcium carbonate, in this scenario note.\nReminder: calcium oxide (quicklime)  + water =  calcium hydroxide (slaked lime) +  HEAT (lots of it, sufficient probably to scorch linen)\n\n","date":"June 21, 2014 at 3:34 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-131988","author":"Colin Berry","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Read your posting, saw the video, all quite clear.  You’re going to have to do some experiments, and probably several reruns before you strike any gold.  Obvious questions arise:  1) Image is said to be superficial, maybe resident only on impurities layer; Can such an imaging process be so superficial? Or will it penetrate the fibres (flax medullas on TS not affected by process!)  2) Do we know whether or not there’ll be an alkali corrosive effect on the CaO side of the linen 3) What would be the signature residues of CaO on the backside of the linen, any? No one’s noticed any such residue signature so far.  4) Process will necessary take some finite time, so perhaps a heat process would affect subject and its appearance with consequent distorted image on cloth, but no such distortion appears on TSM (no “corruption” evident).  5) Maybe it’s not a scorch but something else, so that you could still be on to something. 6) It might not be quicklime, but it could still be alkali from body products or even Max’s red-heifer ash.  7) You’re looking for lots of heat, but if only impurities layer is affected, maybe you don’t need the same heat as is necessary to scorch linen (image is said to be resident only on crowns of fibres) .  \nI recall someone’s ribald comment a year or two back, that you’ll end up proving the Resurrection!  You still have to end up with an image that looks like crucified Jesus, complete with crucifixion marks, scourge marks, bleeding head, and lanced chest wound.  Don’t think they did that sort of thing in medieval times, more into hanging, drawing and quartering!  Look forward to seeing pictures of your chicken legs! Hope the family cat survives!\n\n","date":"June 21, 2014 at 5:16 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-132009","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Daveb wrote:\n“Don’t think they [christians] did that sort of thing in medieval times, more into hanging, drawing and quartering!”\nChristians were crucified during the siege of Constantinople 717-718 by muslims. It´s not impossible that the same type of execution took place during the crusader era in Jerusalem? And maybe some were perfected into greater correspondence with the Gospel account?\n\n","date":"June 21, 2014 at 6:20 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-132032","author":"Henrik","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"I’ll need time to deliberate and respond to daveB’s points. However, I’d just mention a “problem” with the quicklime model occasioned by your comment, Henrik –  namely that it puts the image on the opposite side of the linen from any bloodstains! \nYou see, we’re told the bloodstains are underneath the image, which would be difficult to forge (agreed). But suppose an unbloodied corpse had been placed inside a shroud, and bloodstains then painted on the OUTSIDE in all the (approximately) correct locations, followed later by image imprinting also on the outside i.e. by thermochemical action between migrating body moisture and quicklime.  The end-result would then, surprise, surprise, be a “correct” blood-first-image second scenario, but one achieved with relative ease. Hmmm. Interesting. Thanks.\n\n","date":"June 21, 2014 at 6:48 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-132044","author":"Colin Berry","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Possible problem:  As far as is known there’s no image under blood-stains, wherever any bloodstain has been removed on test fibres.  Implies that blood-stains were there first.  Forger would have to carefully remove any image wherever he needed to place a blood-stain.  Rogers could only remove image with dimide, which left intact fibre underneath and unaffected.  Not looking so good.\n\n","date":"June 21, 2014 at 4:31 pm","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-132159","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Muslims believe that Jesus was taken up to heaven and will return at the end of time to judge the world, appearing near a mosque in Damascus. They also believe that Simon of Cyrene was crucified in his place. To produce an image of a crucified man, “perfected into greater correspondence with the Gospel account” would make no sense to them.\n\n","date":"June 21, 2014 at 8:05 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-132055","author":"Louis","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Thanks daveb. I shan’t try to respond to all your several valid questions right now, for the reasons you allude to – namely the lack as yet of any kind of experimental confirmation.\nI’ve just this minute placed an order with Amazon for 1kg of powdered quicklime, which is supposed to arrive mid week. I’ll be doing small-scale experiments initially with chicken drumsticks (or maybe your “pinkies” from the local pet shop)  and scraps of left-over linen.\nLooking again at Shroud Scope images, their fuzziness and (I think) limited 3D-enhancibility, I’m modestly optimistic of  developing some ‘authentic-looking’ (?) thermochemical imprints in what admittedly is an off-the-wall change of direction.\nWe shall see. Nothing ventured, nothing gained\n\n","date":"June 21, 2014 at 3:25 pm","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-132140","author":"Colin Berry","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Embalming oils as a source for heat?\n\n","date":"June 21, 2014 at 6:28 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-132039","author":"Henrik","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Maybe we should wait 2 years, and over 200 postings.\n\n","date":"June 21, 2014 at 8:09 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-132057","author":"anoxie","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Here what I have read about CaO :\nCalcium oxide (mol.wt.= 56.08) disintegrate on contact with water in a strongly exothermal reaction (near 1140 kJ/kg CaO).\nMol.wt. of Calcium hydroxide = 74.10, solubility in water 1.85 g/L at 0 Celsius degr.\nand 0.71 at 100 Celsius degr. The pH of the aqueous solution is pH=11.3 at 0.1 g/L\nand pH=12.7 at 1.8 g/L.\n— —\nCalcium oxide reacts with water on the external surfaces of the body and is converted to Ca(OH)2 , which liberates OH ions.\nEye injuries caused by calcium oxide, including cement, and calcium hydroxide  [Ca(OH)2] are known world wide from accidents…\n— —\nWhere are the CaO-treated linen samples (from the inherent experiments) to control ?\nWhat is your idea about the measurement of heat transfer (…detailed controls required) ?\nPerhaps you can work using an IR thermocamera…\nIn any case I am curious to see what happens on bloodstains…\nHave you tried to perform an interesting experiment ?\n\n","date":"June 24, 2014 at 12:40 pm","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-132690","author":"piero","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"My first experiment will be very simple, Piero. I’ll place a 1cm depth of CaO in a shallow plastic tray, then place a square of linen on top, then drip water onto the linen.There will be a temperature probe (meat thermometer!) under the linen to monitor the reaction between water and CaO. \nI’m hoping that sufficient heat will be generated to scorch the underside of the linen.\n We shall see. First, the CaO has to be delivered (expected between Thursday and Monday).\nAny pre-existing bloodstains would be cooked, needless to say, with red haemoglobin turning into brown methaemoglobin. Rogers said that the TS blood showed no signs of being heated, but I’ve previously expressed deep misgivings about his ad hoc methodology based on presence of hydroxyproline in his mass spectrometry.  I’ll spare you the details: suffice it to say I do not regard HP as a marker for blood (it’s more generally regarded as a marker for collagen and other connective tissue, and thus not necessarily of human origin.).\nThank you for your interest.\nPS:  Did you know that the English navy in the reign of King Henry III  (13th century) beat off an attack from the French navy by blinding their sailors with finely ground quicklime (CaO)  ensuring of course that the wind was in the right direction. \nSo quicklime was around at the time of Lirey – but also the 1st century (needed to make Roman cement) so establishing a lin(k with that substance and its properties does not in itself tell us anything about authenticity. But it might explain the fuzzy and superficial scorch-like image.\n\n","date":"June 24, 2014 at 1:08 pm","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-132695","author":"Colin Berry","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Thanks, Colin.\nAll of us know that chemical reaction between calcium oxide (quicklime) with water will produce heat energy strongly by the following equation:\nCao + H2O = Ca(OH)2  —-> releases heat energy\n— —\nQuestion:\nIs one of your own fingers the temperature probe (= “meat thermometer”)?\n— —\nI have found an address:\nhttp://www.ebay.com/itm/Flir-E4-063901-0101-Thermal-Imaging-Infrared-Camera-With-MSX-/321412122631?pt=LH_DefaultDomain_0&hash=item4ad5a7c807#ht_5576wt_867\nand this is about a\n“Flir E4 063901-0101 Thermal Imaging Infrared Camera With MSX ”\n(Price = US $995.00 …). \nI wrote this “information” because I am curious to understand\nwhat are the details of your experiment…\nFor example :\nWhat are the “scraps of left-over linen”?\nIMO You have to use the proper linen materials.\n— —\nHere another (secondary) question:\nWhich are your ideas about\n“The Second Messiah” by Knight and Lomas…\nI  bought this book several years ago, but yesterday\n(in my home) I have not found that text!\nI remembered the chapter about Mills… and I wanted to read the useful phrases\n(see also: the four points by Yannick Clément…).\nYou really believe that the imprint on the Shroud is that of Jacques de Molay?\n— — —\nAnother strange thing : according to an article, the Ark of the Covenant\ncould of been a device that generated electric charges\npowerful enough to kill people … \nAll of us know that the disparition of the Ark seems to be a strange biblical enigma.\nAlthough the Ark seems to be a strange biblical enigma, the idea to link\nthe Ark to the Shroud is a strange attempt to explain what we are\nnot yet able to decipher (using another enigma…).\nI tried to think about the use of the Ark in order to obtain an imprint.\nBut (despite the interesting claims – and inherent experiments – by prof.\nGiulio Fanti … who believe that the corpse of Jesus was the origin\nof the electric field) this idea is too vague ! …\nFor example :\nWhat is your opinion about the effect of electrical discharges on bloodstains?\n\n","date":"June 25, 2014 at 9:59 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-132799","author":"piero","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Hello again Piero\nWell, you raise a number of interesting points there –  all deserving of a response, but too many to deal with in a single comment.\nYou’ve given me something to do while I wait for the calcium oxide to arrive – another ‘pot-boiler’ posting on my science buzz site. I’ll let you know when it’s done, here on this thread.\nBy the way: I did consider using my own finger as a bio-thermometer – wrapping it in glove finger fabricated from linen, and dipping into quicklime, but thought better of it. Masochism is not really my thing.  However, my kitchen lab comes supplied with a meat thermometer – the kind one pokes into one’s roasting chicken or beef to see if the centre is hot enough to be properly cooked. It’s calibrated between 60 and 87 degrees C – not as high as one would like, but OK for starters.\nThe other pastime right now is trying to find the earliest references to quicklime in history (naughty, I know,that  we pigeon-holed biochemists should go dabbling out-of-area, as this site’s owner constantly reminds me).  Might the ancient Egyptians have used quicklime for accelerated mummification? Might a certain 1st century corpse have been removed from its rock tomb for mummification, producing an imprint on the enveloping shroud?  Might it have been rumours of the imprint that captured folk’s imaginations (a variant on Wesselow), a more discreet proxy for the desiccated corpse? Was the TS a replacement for the real thing, the latter having been mislaid?  So many possibilities to consider and evaluate, some daft, some with a hint of credibility …\nAddictive, wouldn’t you say,  this Shroudology?\n\n","date":"June 25, 2014 at 10:29 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-132803","author":"Colin Berry","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Noncontact infrared (IR) thermometers use infrared technology to quickly and conveniently measure the surface temperature of objects. They provide fast temperature readings without physically touching the object …\nIR thermometers capture the invisible infrared energy naturally emitted from all objects.\n—- —\nIn some products, one or two lasers are available to help indicate the area being measured. Sometimes these lasers indicate the center of the area being measured and sometimes the edge. They can also change position depending upon distance.\nSource : http://www.thermoworks.com/blog/2011/02/introduction-infrared-thermometry/\n— —\nAre obtainable images of teeth and bone structures associated with the face?\n… So, I ask :\nWhat could really be achieved with quicklime ?\nI hope to see (soon) the results of the experiments… !\n\n","date":"June 27, 2014 at 8:42 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-133090","author":"Piero","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Here’s the problem with de Wesselow’s theory — and other theories that propose that the Shroud (being an accidental image) inspired the birth of Christianity — it overstates the impact of the relic. As Yannick and others have repeatedly pointed out the Shroud depicts the dead body of Jesus — not a resurrected one. If I’m Peter or John and I see the Shroud I’d certainly believe that it was a sign that Jesus was special. But would it alone be enough for all 11 of them, and the women, to do a 180 degree in their beliefs? Would it have inspired a deep belief in resurrection into new glorified bodies? If the Shroud is the model, then why in the ‘stories’ of encounters with the risen Jesus is He not recognizable at first sight? Where did this idea come from that Jesus looked differently? He certainly looks like himself on the Shroud, no?\nWould seeing the Shroud alone have been enough to change Saul into Paul?\nIf the early Christ-follower community’s raison d’etre relied solely on the Shroud as their proof of resurrection than the Shroud would have played a much greater part in the story. We wouldn’t be searching the scriptures and apocryphal texts for hints of the Shroud. It would have been spoken of clearly, even if the relic itself needed to be hidden.\nDo we imagine that there were no skeptics among the disciples? That faced with the Shroud no one would have claimed (as we do today) “that’s a drawing, a painting, a work of art — it’s not real!”.\nCertainly our modern sensibilities are not identical to those of the 1st century. But we are not so different than those men and women. The Shroud today, while compelling, has not transformed the world — moved masses of people to great acts of piety and faith. It’s inspired no martyrs (to my knowledge). I doubt it would have done so 2000 years ago either. \nIt has always been a sign, not a proof.\n\n","date":"June 27, 2014 at 9:28 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-133101","author":"David Goulet","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Sorry. First of all : the errata corrige!\n– CaO\ninstead of: Cao ….\n– “the Ark of the Covenant could have been a device that …”\ninstead of:  “the Ark of the Covenant could of been a device that …”\n— — —\nNow I want to add other lines about the Ark as an electrical capacitor:\n1)\n>For centuries, the Ark was viewed as a mystical object from God, beyond the knowledge of man. However, that changed on September 9, 1915, when the famous scientist Nikola Tesla published an article entitled The Wonder World to be Created by Electricity. In it, he made the following astounding claim:\n…Moses was undoubtedly a practical and skillful electrician far in advance of his time. The Bible describes precisely and minutely arrangements constituting a machine in which electricity was generated by friction of air against silk curtains and stored in a box constructed like a condenser. It is very plausible to assume that the sons of Aaron were killed by a high tension discharge…\nThe term condenser is an older word for what we now know as a capacitor, or an electrical machine capable of storing energy. Tesla thought that the Ark generated static electricity by causing air to rub against curtains. This created static electricity which was then stored inside the Ark, turning the box into a giant Leyden Jar.\nSource:\nhttp://www.guerrillaexplorer.com/strange-science/ark-of-the-covenant-lost-technology/\n2)\n>… after his escape from Egypt, Moses ordered the construction of the Ark of the Covenant to house the tablets of stone on which were written the original “Ten Commandments”. Its construction is described in great detail in the book of Exodus and according to the Bible and Jewish legend it was endowed with miraculous powers including emitting sparks and fire and striking dead Aaron’s sons and others who touched it. It was basically a wooden box of acacia wood lined with gold and also overlaid on the outside with gold. The lid was decorated with two “cherubim” with outstretched wings. In 1915 Nikola Tesla, in an essay entitled “The Fairy Tale of Electricity” promoting the appreciation of electrical developments, proposed what seemed a plausible explanation for some of the magical powers of the Ark. He claimed that the gold sheaths separated by the dry acacia wood effectively formed a large capacitor on which a static electrical charge could be built up by friction from the curtains around the Ark and this accounted for the sparks and the electrocution of Aaron’s sons.\n>Recent calculations have shown however that the capacitance of the box would be in the order of 200 pico farads and such a capacitor would need to be charged to 100,000 volts to store even 1 joule of electrical energy, not nearly enough to cause electrocution. It seems Tesla’s explanation was appropriately named.\nSource: http://www.mpoweruk.com/history.htm\nSo…\nWas the Ark of the Covenant a mysterious biblical piece of ancient technology ?\nWhat was the level of electrical knowledge in ancient times?\nNow we can read something about ancient technology :\nnew technology to explore the ancient Greek Antikythera wreck in the Agean Sea, using an exosuit developed by Nuytco Research.\nThere is the amazing technology of the EXOSUIT atmospheric diving system (ADS)\n[links : http://nuytco.com/wp-content/uploads/2013/06/Exosuit-Specifications.pdf\nor :   http://nuytco.com/media/in-the-news/\nor   http://phys.org/news/2014-06-exosuit-explore-ancient-antikythera.html ]\nand then I hope that they are able to find other interesting proofs because:\n>The team has scheduled a test run of the suit this summer at a site called the Canyons off the coast of Rhode Island. If all goes well, plans for exploring the Antikythera wreck can proceed, paving the way for a whole new way to explore undersea wrecks from virtually any era… …\n— — —\nI can only make a statement about the inability to set up scientific experiments (with adequate funding …) about the Shroud (= AFM [and Raman] controls on cellulosic chains, three-point bending test on linen fibrils, etc.).\n… And we are not yet able to built a decent simulation of “Ancient technology” for the Shroud.\n\n","date":"June 25, 2014 at 10:43 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-132806","author":"piero","site":"shroudstory"},{"title":"Maybe a New Image Hypothesis?","post":"Hello again Piero\nInitial findings  were as expected with the quicklime. But there was at least one curious and unexpected  feature (to say nothing of an unforeseen meltdown with a polythene reaction container!).\nhttp://colinb-sciencebuzz.blogspot.fr/2014/06/first-test-of-quicklime-hypothesis.html\nI shall endeavour to respond to your earlier points in my next posting (maybe the next day or two).\nIn the meantime, a word of advice: try not to place too much reliance on the Hollywood CGI in Harrison Ford’s battle with the Nazis in their quest for the Lost Ark.  Intense electrical force fields tend to be confined to thunderstorms (requiring powerful convected updraughts of air)\n\n","date":"June 27, 2014 at 12:16 pm","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","id":"comment-133122","author":"Colin Berry","site":"shroudstory"}]
