[{"title":"Maybe it is not 3D, at least not the Volckringer patterns","post":"Interesting comment and one thing’s for sure : More researches are needed to fully understand how a Volckringer pattern work and if there’s really a distance information incoded in the images.  But, I think there’s a good possibility that this is really the case.  \nThe image you see have been made by De Salvo using the same technical device (the VP-8) that was used on photos of the Shroud.  The volckringer pattens really seem to have some of the most bizarre characteristics of the Shroud images, i.e. the darks and lights seemed to be reverse.  In that sense, the direct contact points between the leaves and the paper appeared darker in the image, and the part that are farther are the lighter in the image, just like the Shroud.  If you note how a leave look like, you’ll note that it isn’t uncommon that the veins can be closer to the paper than other parts.  In that sense, it would be normal that the image of those veins appeared somewhat darker and, at the same time, appeared also higher on a VP-8 image.  In the example proposed by De Salvo, that seems to be the case.  If this is real, then the images of plants and leaves have really a distance information incode in them.  But, as I said, more researches are needed to check out if this is really the case.  In fact, the best thing would be that some scientists do the same kind of research that was done by Jackson, Jumper and Ercoline of STURP to analyze what kind of distance information is really there.  Without a proper study like that, we can talk and presume things but it will not prove anything.  \nHaving say that, I have to tell that, from my point of view, I think there’s some good chances that the Volckringer pattern could be similar in nature to what have cause the images on the Shroud.  Probably not exactly the same, but similar, chemically speaking.  Rogers just said a word in his book to say that it didn’t think it was a phenomenon that can be applied to the Shroud but the fact is :  he never studied this phenomenon in dept.  Who knows what he would have discovered if he had the possibility to study it properly ?  I would love to see a chemist study this phenomenon in dept.\n\n","date":"January 17, 2012 at 2:04 pm","url":"https://shroudstory.com/2012/01/17/maybe-it-is-not-3d-at-least-not-the-volckringer-patterns/","cat":"image_theory","id":"comment-7101","author":"Yannick Clément","site":"shroudstory"},{"title":"Maybe it is not 3D, at least not the Volckringer patterns","post":"I just want to add one more thing :  From my point of view, an in-deep study of the Volckringer pattern phenomenon, coupled with a proper analysis of the potential similarities (from a chemical and also, a physical perspective) with the body images on the Shroud could be more productive than most of the “supernatural” focused studies done in recent years…  Because the Volckringer pattern involve dead and “traumatized” biological being just like the Shroud of Turin involved a dead and traumatized biological being, I think this avenue of research could be very interesting.\n\n","date":"January 17, 2012 at 4:17 pm","url":"https://shroudstory.com/2012/01/17/maybe-it-is-not-3d-at-least-not-the-volckringer-patterns/","cat":"image_theory","id":"comment-7111","author":"Yannick Clément","site":"shroudstory"}]
