[{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"Hello ‘Reader’\nYou ask: Again, I would like to see just one example of 3D plotting from a full face photograph other than the shroud. I don’t think it is so easy.\nHere’s one I did earlier, in May 2012. Caveat: I did not start with a photograph (does that matter?) but with a quick hand sketch of the as-is TS negative image by the world’s most inept artist (me) using charcoal.  And it’s a copy of the Shroud (for starters) but I did the same for a Mickey Mouse cartoon as well.  Does that matter? Anyway the end-result showed a surprising degree of 3D-ness in ImageJ, and dare I say a luminous ghostly quality. But I don’t claim to  be the world’s best aesthete either…\nhttp://shroudofturinwithoutallthehype.wordpress.com/2012/05/02/a-scientists-eye-view-of-how-the-iconic-turin-shroud-image-could-have-come-into-being-a-happy-accident-of-thermographic-and-photographic-inversion/\n\n","date":"November 3, 2013 at 6:02 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49684","author":"colinsberry","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"PS. I now see the question I responded to was from Dan, not “Reader”. Apologies. At least no one can accuse me of being “Reader” to plant a question…    ;-)\nDan – why not provide a link to a photograph of your choice, a person’s face preferably in black and white, and I’ll see what I can do with it in ImageJ?\n\n","date":"November 3, 2013 at 7:16 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49699","author":"colinsberry","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"Hey Dan.\nOne must understand what 3D on the Shroud really is. Every monochromatic image has three dimensions, the X,Y coordinates and intensity, which is the third dimension (call it Z). So every picture will look 3D in VP8 or ImageJ. but only in the case of the Shroud this third dimension can be correlated to the body-cloth distance (what Jackson &Jumper have shown). This is what is popualrly called as 3D properties of the Shroud. However, Petrus Soons argues that besides those, the Shroud has additional holographic properties, which is another distinct way of encoding 3-D. information.\nhttp://shroud3d.com/\nSo if Soons is right, the Shroud is both height field (as you write on your page http://greatshroudofturinfaq.com/Science/Image/heightfield.html) and a holography (which was invented in 1940s, and popularised after invention of laser in 1960).\n\n","date":"November 3, 2013 at 6:27 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49689","author":"O.K.","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"One final thought on the “impossibility” of making a photograph that has 3-D qualities: it is not impossible, or even very difficult. If a front-lighted facial portrait is taken in a chamber where a uniformly distributed, moderately dense grey or black “fog” is present, less light will reach the receding portions of the face due to absorption of the light by the fog. Furthermore, of the light that does reach the more distant parts of the subject, more of the reflected light necessary to make the photograph will be absorbed on the way back to the camera, increasing the distance dependent contrast even more.\nYes, in theory it is possible. Anyway VP8 was designed to process photography. But there are two major problem. First: the lighting must be full face, and stable which is hard to obtain (even Secondo Pia had problems with lighting back in 1898, not to say about medieval). The second problem is that the intensity is not correlated to the plane in infinity (what to the high degree can be assumed in case of planetary images taken by space probes) but to the distance between body and the cloth, circa 0-4 cm, so some 3D distortions will appear (for example cheeks are higher than the space between them and the nose). So one must simulate this. Is it possible to do so? In theory yes. One must create a bubble from transparent glass or plastic, with specifically designed shape that represents the shape of the cloth wrapping up the body. And then fill it up with some opaque liquid.\nCreating such bubble is extremely complex task even in the era of computers and robots!\nSomething like that on much smaller scale (only small model of the face) however was presented in the brilliant  The Real Face of Jeus\nSee http://www.youtube.com/watch?v=vs96aPyw2i8  (from 6:00) and http://www.youtube.com/watch?v=kAnn82g4Cag\n\n","date":"November 3, 2013 at 6:42 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49691","author":"O.K.","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"The “fog” may be water: emitted light from the surface, diffuses through water and intensity is attenuated.\nJackson has done this experiment (the real face of Jesus, 47′), body cloth clearance with a plane / wrapping the body surface.\nThat said, the shroud was not underwater, and a heavy molecule diffusing through air may do the task, at first order.\n\n","date":"November 3, 2013 at 6:49 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49694","author":"anoxie","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"Would love to get Ray Downing to comment on this.  He is the 3-D animator who developed “The Real Face of Jesus” for History Channel.  In a conversation with  him, he assured me that he was able to extract a 3-D image from a 2-D surface because the data is there to allow for it.\n\n","date":"November 3, 2013 at 8:40 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49711","author":"Russ Breault","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"I met with Ray Downing for lunch and he assured me of the same thing. There is no question that the data is there. I’ve made projections with ImageJ, POVRay and Corel Brice. The questions is what does the 3D data represent, 1) cloth to body distance, 2) elevation from a plane (which is what we plot) or 3) something altogether different that we believe is 3D data (such as proposed if it is some sort of trick photography). I don’t think it is cloth to body distance, even approximately or inaccurately.  I don’t think it is a painting or a photograph or a scorch-o-graph or anything like that.\nThe 3D data isn’t encoded. It isn’t in the image in the sense that it can be extracted from the image, leaving something behind. I think the 3D data is the image. Except for spurious noise from dirt and wrinkles and such I think it is all 3D data that just happens to look like an image. I think it is connected to the resurrection but not caused by it. I think it is a real image of Jesus. It might have been imprinted before, after or during the resurrection. At this point I don’t see it being formed by chemical reactions from gas, light, particles, etc.\n\n","date":"November 3, 2013 at 9:17 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49719","author":"Dan","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"The most convincing point relating the data to a cloth body distance would be to correct the distortions according to the projection/formation mechanism and see which model is the best match to a real human form.\n\n","date":"November 3, 2013 at 9:37 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49724","author":"anoxie","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"What would the 3d characteristics be on the Shroud if the image were imaged on a modern day bed sheet?\n\n","date":"November 3, 2013 at 8:41 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49712","author":"Giorgio","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"Dan\nI have sent  you my small presentation showing 3D representations of US presidents official portraits, from Obama down to Kennedy, showing how much difficult is to obtain Shroud-like 3D properties on normal photographs.\nBesides, here is a comparison of the Shroud 3D properties with the scorch images, created by one sceptic, whose article I refuted: http://ok.apologetyka.info/upload/ap_upload/articles/15/2013/06/rysunekxxii.jpg\n\n","date":"November 3, 2013 at 8:45 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49713","author":"O.K.","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"What is your interpretation why it is difficult to obtain Shroud-like 3D properties on normal photographs?\n\n","date":"November 3, 2013 at 9:14 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49717","author":"Giorgio","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"I described it above, see #4\n\n","date":"November 3, 2013 at 9:17 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49718","author":"O.K.","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"Perhaps you could answer a question for me, OK. When references are made to the importance of cloth-body distance, that involves a radiation model (yes?). So differences in image intensity that are supposed to represent differences in cloth-body distance are assuming that Newton’s Inverse Square Law is operating (yes?). But all the radiation models I have seen that lack imaging lenses etc have to assume collimated (“unspread-out”) radiation. But why would that obey Newton’s Inverse Square Law? \nNewton’s Inverse Square Law is based on the supposition that radiation streams out in all directions as a cone, with an ever larger but fainter circle of light on a screen the further from the source of radiation, falling off as the square of distance.  So why is cloth-body distance a factor when one is having to assume collimated radiation? If there is no speading out of the radiation, it should not matter whether the cloth is 1cm or 1 metre from the radiating object.\nSo there has to be some other reason for the fading of image intensity that is unrelated to radiation (yes?). That means other mechanisms of image imprinting have to be considered (yes?). Reminder: there are three chief mechanisms for transfer of thermal energy between two bodies – assuming it is thermal energy that has produced the tan-coloured dehydration products of linen carbohydrates – namely radiation, conduction and convection.\nRaymond Rogers had no time for radiation models. Nor do I. So forgive me if I switch off when folk refer blithely to cloth-body distances. That is not dispassionate objective science. It is (more often than not) agenda-driven, subjective “science”…\nI believe that the Shroud image has to be examined as a product of conduction (primarily) and convection effects, involving  very close contact between subject and cloth. Conduction requires zero distance of separation,  but convection probably allows a little more, maybe a few mm, possibly a cm or two at most.  But conduction and convection are accommodated better in models that assume the correctness of the radiocarbon dating… \nTake away message: if Shroud authenticity is to be buttressed by science, it has to be science that operates according to the known laws of physics. Collimated radiation, indeed any kind of emitted radiation, stretches credulity. Collimated radiation that results in cloth-body distance as a factor makes no sense at all to someone like me whose science background is traditional and no doubt boring to some..\n\n","date":"November 3, 2013 at 9:20 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49720","author":"colinsberry","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"Are you saying that the herringbone weave plays an important roll in creating the 3D affect or the heringbone pattern is considered a 3D distortion between body and the cloth?\n\n","date":"November 3, 2013 at 9:25 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49721","author":"Giorgio","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"No, herringbone pattern is not considered here.\n\n","date":"November 3, 2013 at 9:32 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49723","author":"O.K.","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"In my opinion, tit is the lensing affect of the image caused by the herringbone pattern we see such a distinct 3D pattern.\n\n","date":"November 3, 2013 at 9:49 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49732","author":"Giorgio","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"\nDan :\n The questions is what does the 3D data represent, 1) cloth to body distance, 2) elevation from a plane (which is what we plot) or 3) something altogether different that we believe is 3D data (such as proposed if it is some sort of trick photography). I don’t think it is cloth to body distance, even approximately or inaccurately.  I don’t think it is a painting or a photograph or a scorch-o-graph or anything like that.\n\nCloth to body distance. The problem is, we don’t know how the image of the body was projected on the Shroud, that means what is relation between body points and cloth points There are four major hypotheses:\n1. Vertical projection (as assumed by Jackson and Antonacci)\n2. Projection perpendicular to the surface of the body\n3. Projection perpendicular to the surface of the cloth\n4. Projection at the lines of minimum distance between cloth and the body (supported by Mario Latendresse and I also consider it most likely)\nSee my figure:\n\nUsually all 4 models create very similar results, so they are rarley discussed. However they are vital to the study of 2D and 3D distortions present on the Shroud, and to image creation mechanism. There are some  mathematical subtleties which can be crucial in this case.\n\n","date":"November 3, 2013 at 9:31 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49722","author":"O.K.","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"\ncolinsberry :\nPerhaps you could answer a question for me, OK. When references are made to the importance of cloth-body distance, that involves a radiation model (yes?). So differences in image intensity that are supposed to represent differences in cloth-body distance are assuming that Newton’s Inverse Square Law is operating (yes?). But all the radiation models I have seen that lack imaging lenses etc have to assume collimated (“unspread-out”) radiation. But why would that obey Newton’s Inverse Square Law?\n\nNo, the Newton’s Inverse Square Law plays no vital role here. Jackson assumes that there is some opaque medium (like air in case of the UV), some “cloud” that is responsible for intensity-distance correlation, according to the law:\nI=I(0)*exp[-tau] , where tau is optical depth of the medium.\n\ncolinsberry :\nSo there has to be some other reason for the fading of image intensity that is unrelated to radiation (yes?). That means other mechanisms of image imprinting have to be considered (yes?). Reminder: there are three chief mechanisms for transfer of thermal energy between two bodies – assuming it is thermal energy that has produced the tan-coloured dehydration products of linen carbohydrates – namely radiation, conduction and convection.\nRaymond Rogers had no time for radiation models. Nor do I. So forgive me if I switch off when folk refer blithely to cloth-body distances. That is not dispassionate objective science. It is (more often than not) agenda-driven, subjective “science”…\nI believe that the Shroud image has to be examined as a product of conduction (primarily) and convection effects, involving  very close contact between subject and cloth. Conduction requires zero distance of separation,  but convection probably allows a little more, maybe a few mm, possibly a cm or two at most.  But conduction and convection are accommodated better in models that assume the correctness of the radiocarbon dating…\n\nIn case of the Shroud only conduction plays a vital role, radiation and convection are usually negligible. Conduction requires direct contact, while on the Shroud there are areas which were not in direct contact with the body. That’s one of the reasons why schorch hypotheses makes no sense, because it is binary, either there is a contact or no. So 3D always fails, even despite the image looks like 3D. On the contrary the Shroud image has quite smooth gradation of greyscale.\n\n","date":"November 3, 2013 at 9:40 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49725","author":"O.K.","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"“No, the Newton’s Inverse Square Law plays no vital role here. Jackson assumes that there is some opaque medium (like air in case of the UV), some “cloud” that is responsible for intensity-distance correlation, according to the law:\nI=I(0)*exp[-tau] , where tau is optical depth of the medium.”\nThat all looks impressively scientific, especially as it tries to gain an exemption from Newton’s Inverse Square Law. But I don’t think it does the business, at least in the context of Rogers’ model, whether you call it diffusion, convection or a mixture of both, and I’ll tell you why.\nIf you are going to posit that something in the intervening  air is radio-opaque and is absorbing radiation so as to give the impression that Newton’s Law is being obeyed for collimated beams, you have to consider another Law – the most fundamental one of all in physics, namely the Law of Conservation of Energy. If your mysterious source of radiant energy is being absorbed on the way to its target (linen), then its energy cannot just disappear. It has to be converted to another form of energy. Without knowing the wavelengths being proposed it’s a matter of guesswork, though it would have to be longer wavelength energy, probably infrared. That’s the thermodynamics – the start and result if you like. But consider the kinetics too, that the absorption of radiant energy will increase the kinetic energy of electrons in chemical bonds causing excitation, or simply increased bond vibration, and sooner or later, probably sooner, that energy will be transferred to neighbouring air molecules as increased kinetic energy, i.e translation, straight line speed. In other words the air would heat up, expand, cause thermal convection currents etc, and almost certainly destroy any imaging system that depends on diffusion or convection. \nIt would be nice to think that Shroudology could open up new undreamt-of fields of physics, but I personally would prefer to know about those new phenomena first from other systems than have them snuck in the back door so to speak by folk who are trying to work their way around Newton’s Law.\n\n","date":"November 3, 2013 at 9:08 pm","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49814","author":"colinsberry","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"\nanoxie :\nThe most convincing point relating the data to a cloth body distance would be to correct the distortions according to the projection/formation mechanism and see which model is the best match to a real human form.\n\nBut your use of the term “projection” means you are only comparing within a subset of models, i.e. radiation models, unless you envisage transport of matter across air gaps. The latter is possible in convection models, notably Rogers’ with his gaseous amines, and might be possible if one had superheated air that was hot enough to scorch linen.  But if we are to be scrupulously scientific, we have to ensure that our models are not restricted to those that happen to fit a particular or favoured narrative – if you see what I mean.  I’m trying to recall a saying about a road to a certain destination being paved with good intentions. Maybe it’s now been fitted with one of those moving walkways for the benefit of those who come laden with baggage.   ;-)\n\n","date":"November 3, 2013 at 9:52 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49734","author":"colinsberry","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"Rogers ´ model is not a convection model but a diffusion model. Convection ruins the resolution.\n\n","date":"November 3, 2013 at 9:58 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49738","author":"anoxie","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"True, anoxie, but only up to a point. It was initially proposed as a diffusion model, but that immediately raised doubts re credibility, especially with ammonia or the lighter organic amines diffusing away too fast for there to be any real prospect of sharp imaging (even assuming there was enough reducing sugar present, recalling that degraded starch does not necessarily equate to sugar, depending on many factors). So correct me if I’m wrong, the model has since been refined to incorporate the idea of laminar flow, as distinct from random diffusion in all directions, and one needs laminar flow to get enough mass transfer anyway, aided perhaps by elevated temperature (though it’s hard to see how the temperature in a rock tomb, even with post-mortem changes, can ever be high enough to kick- start a Maillard reaction with a very steep temperature response curve (probably a reflection of unfavourable thermodynamics as well as kinetics). \n But there’s a more fundamental objection one can make to the diffusion model, whether aided or unaided by convection currents – it starts by assuming the very thing that is supposed to be under critical scrutiny, i.e. that there was a 1st century starch-coated cloth in contact with a real dead (and rapidly) decomposing body. Sorry – that’s not my idea of dispassionate science. It’s agenda-driven, which doesn’t necessarily make it wrong – just suspect, and thus deserving of the closest critical scrutiny – it being the reputation of science and scientists that is on the line, thanks to our sensation-seeking media, ready to emblazon the latest discoveries (including crackpot ideas) before they have been properly assessed and/or vetted by the scientific community.\n\n","date":"November 3, 2013 at 10:20 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49741","author":"colinsberry","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"Convection can work if there is a receptor that  isolates the theromal exchange.  This is why I don’t agree with the assertion that the Shroud’s image is continuous tone or a smooth gradation of grayscale. What Enrie’s images detailed is on the contrary. It is a low resolution image that appears to have a  lensing affect imaged the surface of the herringbone pattern. If I’m not mistaken, Collins successfully demonstrated a carton with 3 D characteristics which is represented with approximately 65 dpi.  That is why I asked, how would the 3d characteristics appear on the Shroud if the image were imaged on a modern day bed sheet?\n\n","date":"November 3, 2013 at 10:46 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49747","author":"Giorgio","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"I don ´t know, there are various interpretations of Rogers ´ theory. That´s why i asked Thibault back in June 2012 for more details and he has written what is in my view the most comprehensive and coherent theory (though to be continued) concerning image formation. It was a mail from Ray Rogers and is on the right side of this blog.\nIt is random diffusion, as random diffusion attenuates light intensity according to the lengh of the path in the water in John Jackson ´s experiment\nConcerning heavy molecules, this is a critical point, Thibault is working on it.\nConcerning the reactant on the cloth, given the distribution of image it has to be (double ?)-superficial (as long as you consider a diffusion mechanism). Is it a starch coating ? A modification of pcw of superficial fibers during the production of the cloth ? More tests are needed. Btw, Rogers didn ´t know the pcw, no wonder he never mentionned it.\n\n","date":"November 3, 2013 at 11:07 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49751","author":"anoxie","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"“Opaques” can account for collimation.They can  easily be found in the Judean desert dust… Archaeologically speaking, just imagine the TS man’ s bloodied body covered in desert dust and tightly wrapped up within an in-soaked long inner shroud of which pressure gradually and slightly loosened up via a purifying and drying ritual (fumigation). Methinks Mr CB just cannot, he is no archaeologist at all.\n\n","date":"November 3, 2013 at 10:07 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49739","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"Without going into the physics of how the image was formed, the 3D appearance as imaged by ImageJ depends on a linear relationship between darkness and vertical distance from a horizontal plane, whose floor level (zero darkness, zero height) corresponds to the background colour of the shroud. Has anybody experimented with non-linear relationships, does anyone know, say exponential – twice the darkness corresponds to four times the height? That would be interesting, I think.\n\n","date":"November 3, 2013 at 10:28 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49742","author":"Hugh Farey","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"Interesting point, Hugh. There is no fixed relationship, needless to say. One fiddles with a gain control that magnifies or reduces the height according to taste.\nWhat I did some time ago was to try what I called normalization. One makes a scorch imprint off a template, then adjusts the 3D image to get the best match with the original template, and then applies those same settings to the “as-is” Shroud image (e.g. on ShroudScope). It resulted in one of the best 3D-enhanced images of the Man in the TS I’ve ever seen (though I say it myself)  ;-)\n\n","date":"November 3, 2013 at 10:35 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49743","author":"colinsberry","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"Has anybody experimented with non-linear relationships, does anyone know, say exponential – twice the darkness corresponds to four times the height? That would be interesting, I think.\nAs far as I know, no one yet. The linear approximation (the first order of Taylor’s series of unknown relation) is usually good enough for previous uses. But of course checking higher orders would be good to improve the results.\n\n","date":"November 3, 2013 at 10:35 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49744","author":"O.K.","site":"shroudstory"},{"title":"Maybe the 3D data doesn’t mean what we think it does","post":"But one may try, even ImageJ has some mathematical functions to process the images.\n\n","date":"November 3, 2013 at 10:42 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","id":"comment-49746","author":"O.K.","site":"shroudstory"}]
