[{"title":"Might tactile chemography prove to be the super-model?","post":"Question-the applications that Colin used in his latest experiment, would it have been detected let’s say STURP?\n\n","date":"April 26, 2015 at 8:21 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197633","author":"don","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"I had a long and detailed discussion with Adrie van der Hoeven on that very point on my last-but-one posting Don – 27 comments in all. \nhttp://colinb-sciencebuzz.blogspot.co.uk/2015/04/the-enigmatic-shroud-of-turin.html\nMaybe you’ll find what you’re looking for there. If not, let me know.\n\n","date":"April 26, 2015 at 9:38 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197642","author":"Colin Berry","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Apologies. I linked to the wrong posting. It was the one before:\nhttp://colinb-sciencebuzz.blogspot.gr/2015/04/modelling-turin-shroud-medieval-fake.html\n\n","date":"April 26, 2015 at 10:43 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197646","author":"Colin Berry","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Colin used the word “might” because he had to. Now, why would a medieval forger go through all this trouble? Was he also some kind of Nostradamus, knowing that STURP would begin examining his work in 1978?\n\n","date":"April 26, 2015 at 9:11 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197638","author":"Louis","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"What an extraordinary comment. What possible relevance has Nostradamus or STURP to a new model that attempts to account for the TS body image? It describes how the image could have been generated in principle, by initial imprinting followed by separate chemical (or thermochemical) development.\nWhy the TS was produced is an entirely separate question. It’s not one that is amenable to the scientific method. But that won’t stop me mixing it with all the other amateur historians here, and say the motive was obvious: to create a faux relic that could be passed off as Joseph of Arimathea’s linen (Matthew, Mark, Luke). \nThat’s before the TS was replaced by the ‘real’  burial garments, supplied it would seem (John)  by that Nicodemus fellow. \nThe aim was to simulate (i.e. ‘fake’) a negative body imprint (direct physical contact, no magical radiation) due to sweat and blood.That’s why the body image had to be LIFE SIZE (when it would have been so much simpler to do a scaled -down version if merely a  a painting) and why it’s a DOUBLE imprint, head-to-head, so as to simulate an up-and-over sheet of linen, one used  (or perceived to have been used) as a stretcher and/or ‘body bag’ for discreet transport of a newly deceased and naked VIP between cross and rock tomb.\nNostradamus? STURP?  Bizarre!\n\n","date":"April 26, 2015 at 10:10 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197644","author":"Colin Berry","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"I have noticed that the “professional scientist” is starting to hit below the belly again, resorting to personal attacks, and this is deplorable. A professional scientist would not do that, because he is confident, not “quietly confident.” He would also take the peer-reviewed papers of Drs. Alan Adler and John Heller seriously.\nThis “amateur historian” had one of his articles, written after painstaking research, praised in a letter he received from a Holocaust survivor, president of the country’s Jewish society, and is preserved in the library of one of the world’s best universities for reference. Another one, also on history, was dispatched to the Vatican Secretary of State (without his knowledge) to influence him in a decision that had to be taken by Rome. The decision was in keeping with the historical research mentioned in the article. \nBut, let us go to the next step:\n https://www.academia.edu/11804110/Is_the_Sudarium_of_Oviedo_the_key_to_unraveling_the_mystery_of_the_Shroud_of_Turin\nSo, according to Colin’s experiments, the medieval forger saw the Sudarium of Oviedo, detected the blood group, found someone suitable and beat him up in such a way so that the stains on the napkin would match the face seen on the Shroud. What lengths he went to in order to not be detected by STURP!\nIf anyone buys this theory and then thinks that the people promoting the Jesus family tomb are correct that is an even bigger mistake:\nhttps://www.academia.edu/7556467/Jesus_was_not_buried_in_Talpiot_-_Parts_I_and_II\nand:\nhttps://www.academia.edu/7471223/Jesus_was_not_buried_in_Talpiot_-_Part_III\nAryeh Shimron, whose “findings” were reported by the NYT, is a geologist, not an expert in limestone ossuaries. And, most important of all, those in the antiquities market, particularly forgers, are known to store different kinds of soil samples. Perhaps there is something even more important: the Geological Survey of Israel is known to have authenticated forgeries. They have not said anything now because no peer-reviewed paper was written. The rest will come in Talpiot IV.\n\n","date":"April 26, 2015 at 11:11 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197647","author":"Louis","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"I decline to respond in detail to this kind of febrile diatribe.\nMy views on the Adler and Heller claims, especially those regarding fanciful “trauma bilirubin” displaying as they did pro-authenticity assumptions and thus unscientific non-objectivity have been closely  argued on and off for some 3 years or more in any number of postings and comments, here and on my own site(s). I doubt whether Louis has bothered to read any of them.\n\n","date":"April 26, 2015 at 11:36 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197648","author":"Colin Berry","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"“Febrile diatribe?” Really? Adjectives like these do not promote fruitful discussion, they betray nervousness.\nWhy does Colin refuse to address the Sudarium of Oviedo topic? I have more on the topic, which will be dealt with in another article.\nI have read the postings and comments coming from him, and do admit that more work is needed on the blood, beyond what he says.\n\n","date":"April 26, 2015 at 11:53 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197650","author":"Louis","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"“Why does Colin refuse to address the Sudarium of Oviedo topic?”\nAnswer: because I prefer to stay focused on the Shroud of Turin – and, since you ask – consider the Sudarium of Oviedo to be sindonological baggage of absolutely no relevance whatsoever. Dream on Louis.\n\n","date":"April 26, 2015 at 12:05 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197654","author":"Colin Berry","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Admit you do not want to tackle it for other reasons, Colin. Those who have worked on it have PhDs, like you.\n\n","date":"April 26, 2015 at 12:22 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197655","author":"Louis","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Methinks it’s time to say goodnight to this site. Forgive me if I choose to be more selective in future as to which comments warrant a response, and which are best ignored.\n\n","date":"April 26, 2015 at 12:41 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197657","author":"Colin Berry","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Yes, continue to ignore those comments to which you have no answer. Professional science proceeds in a different manner.\n\n","date":"April 26, 2015 at 12:49 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197658","author":"Louis","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"I repeat: goodnight.\n\n","date":"April 26, 2015 at 12:51 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197659","author":"Colin Berry","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Goodnight. Perhaps you will change your mind tomorrow morning?\n\n","date":"April 26, 2015 at 1:18 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197660","author":"Louis","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"For the time being, Colin is only at the beginning of his work.\nHere is what Rogers wrote in “Physics and chemistry of the Shroud of Turin” (P; 28-29):\n “Hypotheses on chemically-induced cellulose degradation: (…) Concentrated sulfuric acid, for example, dehydrates cellulose to produce a convincing yellow discoloration; however, attempts to create an image with acid were rather disappointing. In particular, it proved quite difficult to control the depth penetration, and densities of the stains. Also, unless the acid is properly neutralized, the continuing reaction can cause disastrous effects.”\nColin’s experiments show that.\nAnd:\n” the results of experiments with chemically-induced cellulose degradation have, so far, provided the closest approximation to the observed image characteristics; however, the approach has some difficulties. The problem of controlling depth penetration of the applied materials has already been mentioned.(…) Depth penetration can depend not only on the fluid properties of the foreign material but also on the surface and absorption characteristics of the linen fibers. Simulated image stains, to date, have been fairly successful, but more work is necessary.”\n“More work”: it seems to me that this is exactly what Colin is doing.\nFor now, the results are not convincing but we will see.\n\n","date":"April 26, 2015 at 3:52 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197668","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"I have read what Adrie posted in your blog’s comments section about Adler and Heller investigating whether nitric acid was presented on the linen fiber-   “a) diphenylamine b) fast blue salt B” for the detection of “nitro derivatives” and\n“a) ninhydrin b) fluorescamine” for detecting “amines, primary” and more tests for other nitrogen-containing substances and got negative results from image fibers (A Chemical Investigation, 1981). Their table 7 listed all their tests for organic structures and functional test is online.” So with your experiment, don’t you think nitric acid or whatever would have been detected?\n\n","date":"April 26, 2015 at 6:31 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197675","author":"don","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"“So with your experiment, don’t you think nitric acid or whatever would have been detected?”\nNo, not necessarily, Don. Don’t forget that Adler and Heller were forced to convert those to ‘micro-spotting’ tests to be applied to minute fibres stuck to adhesive tape, looking (one presumes) for colour changes under the microscope instead of in a test-tube.Those forensic style tests are an order of magnitude less reliable than the standard versions, best seen as initial screening tests. Don’t forget either that the standard test for “total nitrogen” i.e. Kjeldahl (or micro-Kjeldahl) does not in fact detect or measure nitro- or ester nitrate groups if present, so is not total nitrogen? I hope they were not relying on the absence of a nitrogen peak on x-ray fluorescence, as they apparently relied on the absence of an aluminium peak to exclude alum mordants, since that technique only works reliably for atoms of elements higher than sulphur in the Periodic Table.\nYou omitted my discovery in the 19th century literature of a phenomenon that intrigued Adrie, namely that nitrated cotton (gun cotton – used as propellant in military rounds and shells) gradually “leaks” its nitrogen when exposed to air (hardly surprising since that’s why it’s the highly combustible/explosive material that it iswhen the release occurs instantly, requiring no oxygen. Who’s to say that 700 years + is not long enough for nitrated linen to lose its extra nitrogen.\nHowever, please note that the new model does not insist on nitration in the second development step. All that’s required is an agent that turns the primary imprinting medium a yellow or brown colour. It may be there’s an organic substance that merely needs some heating in an oven at a temperature well below that which affects linen, say 150 degrees C, and we’re now back at the Garlaschelli model requiring no nasty chemicals, merely an oven roasting.\nIt’s the physical and chemical principles that need first to be established, fascinating because they have to work on a biological matrix already the subject of biotechnology (retted flax) with the added uncertainties as to what else might have been used for final image development.\n\n","date":"April 26, 2015 at 9:45 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197687","author":"Colin Berry","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Re another instance of the way reality can be scientifically/chemically manipulated to fit one’s agenda:\n“Tobacco companies have been making cigarettes more addicting for decades. In 1973, a senior scientist for a tobacco company wrote in a secret report: « Methods which may be used to increase smoke pH and/or nicotine ‘kick’ include: (1) increasing the amount of (strong) burley in the blend, (2) reduction of casing sugar used on the burley and/or blend, (3) use of alkaline additives, usually ammonia compounds, to the blend, (4) addition of nicotine to the blend, (5) removal of acids from the blend, (6) special filter systems to remove acids from or add alkaline materials to the smoke. »”\nSOURCE: R.J. Reynolds senior scientist, 1973 Bates No. 502193199/3228\n\n","date":"April 27, 2015 at 9:07 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197732","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Colin wrote: “That’s why the body image … (i)s a DOUBLE imprint, head-to-head, so as to simulate an up-and-over sheet of linen, one used (or perceived to have been used) as a stretcher and/or ‘body bag’ for discreet transport of a newly deceased and naked VIP between cross and rock tomb.”\nCould Colin account for an alleged “1325 CE± 65 monk” (or alchemist) using an about 4,40 x 1,10m DOUBLY IMAGED cloth (implying it was wrapped around the body from head to toe) while the original size of the most famous representative relic of the , first kept in Aachen or Aix-la-Chapelle and then –after having been cut in two halves– Compiègne and Kornelimünster) was only about 2,10 x 1,80m and NON-IMAGED (implying it was wrapped around the body from one side to the other)?\nMax patrick Hamon\nOn January 29, 2015 at 7:22 am, I wrote\n“In the 13th-14th CE, the body sheet was folded over the deceased right or left side, then the other edge over his right or left side. To my knowledge, there is no known examples of any medieval body sheet having been wrapped around the deceased from head to toe. Why the sudden need to forge an alleged Sindon Munda/Sindon Kathara (or Matthean “PURE/CLEAN cloth” as an “UNclean cloth” wrapped around first over the head, then the feet and not from side to side?”\n\n","date":"April 27, 2015 at 9:28 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197735","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"CORRECTION (sorry pasting and writing in haste)\nColin wrote: “That’s why the body image … (i)s a DOUBLE imprint, head-to-head, so as to simulate an up-and-over sheet of linen, one used (or perceived to have been used) as a stretcher and/or ‘body bag’ for discreet transport of a newly deceased and naked VIP between cross and rock tomb.”\nOn January 29, 2015 at 7:22 am, I wrote\n“In the 13th-14th CE, the body sheet was folded over the deceased right or left side, then the other edge over his right or left side. To my knowledge, there is no known examples of any medieval body sheet having been wrapped around the deceased first over the head, then the feet . Why the sudden need to forge an alleged Sindon Munda/Sindon Kathara (or Matthean “PURE/CLEAN cloth” as an “UNclean cloth” wrapped around first over the head, then the feet and not from side to side?”\n\n","date":"April 27, 2015 at 9:32 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197736","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"I’ve asked this question in the past too. There is one possible answer if one is speaking of a stretcher cloth (vs a burial cloth). It is more difficult to carry a body stretcher-like if the cloth is folded across the body side to side. Much easier if the linen is stretched head to foot as each bearer (assuming at least four – one on each corner) now has a similar type of seam to grip. If you go side to side, one set of bearers has no easy seam to grip. The corpse’s weight will be easier to distribute evenly with a head-to-toe model.\n\n","date":"April 27, 2015 at 11:00 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197746","author":"David Goulet","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"No David. Not at all. In the hypothesis the TS man was carried on a stretcher (or a short ladder) and his body wrapped into a cloth to be carried to the tomb, it would have been much easier to directly fasten his corpse to the stretcher or ladder with an outer cloth tightly wrapped side to side around both body and stretcher or ladder. As the bloodied body image shows, it is not a ‘stretcher cloth’ at all but a long inner burial cloth.\n\n","date":"April 27, 2015 at 11:20 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197747","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Besides its width is most inconvenient  to be a ‘stretcher cloth’.\n\n","date":"April 27, 2015 at 11:23 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197749","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Fair point, Max.\n\n","date":"April 27, 2015 at 11:45 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197753","author":"David Goulet","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Hello David.\nWhat are we discussing? The real means by which the crucified man was transported from cross to tomb, or the imagined means, as per medieval faking of J of A’s linen?\n\n","date":"April 27, 2015 at 11:23 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197748","author":"Colin Berry","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"You know, I’m not sure myself anymore. :)\n\n","date":"April 27, 2015 at 11:44 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197752","author":"David Goulet","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"And why the need for the forger to add four geometrical series of small burn-holes?\n\n","date":"April 27, 2015 at 9:52 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197738","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"… as if the geometrical burn holes had occurred when the cloth was folded in four in order to fit the size of a Byzantine altar cloth!  He even went as far as excelling the threnoi epitaphioi? Don’t you really think your alleged forger-alchemist has taken incredibly great pains to fool people?\n\n","date":"April 27, 2015 at 10:14 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197740","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"And why the need for a naked Christ and not a Christ with his loin cloth?\n\n","date":"April 27, 2015 at 10:31 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197742","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"BTW your alleged forger-Alchemist was far smarter than you: he recorded two four-fingered hand not a five-fingered hand. Why the need again?\n\n","date":"April 27, 2015 at 10:33 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197743","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Hi Max,\nGreat point!  No forger would have known that fact.\nWho was found to be correct eventually, referencing the reason the thumbs turned inward, Barbet or Zugibe?\nhttp://www.crucifixion-shroud.com/Barbet.htm\nBest,\n\n","date":"April 27, 2015 at 6:59 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197784","author":"Angel","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"I am used to refer to both Barbet’s and Zugibe’s interpretations since I cannot tell for sure which of the two is right or wrong.\n\n","date":"April 28, 2015 at 3:15 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197815","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Would not the thumbs have been fastened together somehow, under the palms, out of sight?  How else could the hands have stayed in that position?  It seems that otherwise, with the elbows not on the body and off to the side, the weight of the upper arms would cause the hands to continuously slide backward off of the pubis area.\n\n","date":"April 28, 2015 at 8:25 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197836","author":"Nabber","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Hi Max,\nAgreed!   Both hypotheses seem plausible.\nAs well, too much credit is given to the medieval artists/forgerers.  There is no way any of them would have duplicated each of the flagrum wounds sustained by Christ on a painting.  \nArtists, from the beginning of history, have never painted Christ’s wounds in such detail, but instead their paintings depicted only nail marks through the hands and feet. Even DaVinci was not that thorough.\nAnd how would a medieval artist know to place AB blood type on both the Shroud and Sudarium?\nQuote from link:  “This test is the starting point for all the others and the results are positive. Blood of the group AB is also very common in the Middle East and rare in Europe.” (Guscin, M., 1998).\nhttp://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html\nTruth is no artist would know the information presented above and, for that reason alone,\nthe Shroud (despite an erroneous C-14 dating) has a greater probability of being Christ’s authentic burial cloth than not.  And AB positive blood type was found on both the Shroud and the Sudarium, each in a different location.  How would a painter accomplish this?\nFurther, according to the genetic studies done by FamilyTreeDNA on Jewish ancestry, two of the genetic markers on Jesus’ fragmented DNA (Garza-Valdes), 150T and 195C indicate Jewish ancestry.  Kelly Kearse would be more knowledgeable on the DNA.  Yet, how would a painter/forgerer know this specific blood information in advance of his or her paiting?\nBest,\n\n","date":"April 28, 2015 at 4:08 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197877","author":"Angel","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Hi Angel, that is what I pointed out in a comment above, dated 26th, also providing the link:\nhttps://www.academia.edu/11804110/Is_the_Sudarium_of_Oviedo_the_key_to_unraveling_the_mystery_of_the_Shroud_of_Turin\n\n","date":"April 28, 2015 at 4:25 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197879","author":"Louis","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Hi Max! Good to hear from you again. You didn’t mention a “stretcher cloth” in your earlier collection of funereal laundry found in the tomb on Easter Sunday. Do you think it was there, or discarded after use?\n\n","date":"April 27, 2015 at 1:31 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197762","author":"Hugh Farey","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Pre-burial items (such as e.g. the blood in-soaked Oviedo Sudarium) were placed inside pots in the tomb chamber with the dead. Most likely Yeshua’s body was carried to the tomb on a short ladder used as stretcher (the same ladder that was used to take him down from the cross).\n\n","date":"April 28, 2015 at 3:07 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197813","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"As indicated earlier, I’m taking a break from experimentation, while taking stock of results so far (and the trickle of comments here and elsewhere).\nThere are some new variants I shall be testing re the initial imprinting and subsequent development.\nImprinting: is it better to do it as already described, with the imprinting medium placed first on the subject, before draping the linen over, OR is it better to do it Garlaschelli style (“frottage” as he calls it) where the linen is placed over first, and the medium then added last for moulding around contours?\nIf I stick with my procedure, is it better to imprint LOTTO or LUWU configuration, those acronyms having been tested in my contact scorch model. (LOTTO = Linen On Top, Then Overlay; LUWU = Linen Underneath With Underlay) Each has its pros and cons where an inanimate template (statue, bas relief etc) is concerned, while for a real human being LOTTO is better obviously then LUWU.\nThen there’s the imprinting medium. The pilot study used a hot water dispersion of white wheat flour. I’m thinking of trying a cold water dispersion, so as to have intact endosperm cells, The latter have their starch granules and storage protein nicely enveloped in a primary cell wall sac whose composition will probably not be dissimilar from that of the superficial PCW of the linen fibre. On the chemical principle that like is attracted to like, there might be something to be said for bonding a compatible microparticulate substance to the linen first as a possibly more receptive carpet for image capture.\nFinally, I shall try substituting a purely thermal treatment for nitric acid vapour.(essentially Garlaschelli technology). That too might produce a TS like coloration and image, either by oxidation of carbohydrates OR via Maillard reactions between sugars and proteins (yup, we’ve been there before in the scorch model, but here the chemistry is being tested in the new two step imprinting/developing model for which I have high hopes.\n\n","date":"April 28, 2015 at 12:49 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197801","author":"Colin Berry","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"From your very preliminary pilot experiments, the first problem is to find an imprinting medium able to produce a continuous image rather than scattered colored spots.\n\n","date":"April 28, 2015 at 2:29 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197863","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"I look forward to hearing some more about these aspects of the TS that the new model is supposed to match. Having said that, one hopes they are based on something more substantial than the Mark Evans photomicrographs that TH managed to extract from the STERA archive, and which appear to be the  supporting ‘evidence’ for all those ‘enigmatic’  properties like “striations”, “discontinuities” and “half-tone” effect. Amazing really, considering those pictures show merely threads for the most part, with skeins not isolated fibres.\nAs for ‘scattered colored spots’, where did they spring from? What about those folk in Sicily (G.Fazio et al) and their ‘stochastic’ process who would presumably be only too happy with “scattered spots”, provided they were randomly distributed.\nSorry about all the inverted commas, quotation marks around terms. That’s ‘sindonology’ for you.\n\n","date":"April 28, 2015 at 9:46 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197898","author":"Colin Berry","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Colin,\n “These aspects of the TS that the new model is supposed to match” are very important.\nYour new model, at the end, must match (or at least be compatible with) the fundamental surface distribution properties of the TS: superficiality (at fabric, thread and fiber level), uniformity of the image (no “hot point”, no spot, no “hole”), half tone and fuzzy contours, and bundles of fibers adjacent to uncolored fibers…\nNow, if you think that these facts are not proved, despite the many photos you have, I can’t add anything.\nIf you think that those properties are not important at all, please explain…\nThe ” ‘scattered colored spots” (also seen in Garlaschelli’s shroud) is only my description of your hand imprint. \nI’ll be in Turin until Sunday.\n\n","date":"April 29, 2015 at 3:32 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197958","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Yes, it’s vitally important to match every tiny detail of the TS, as it existed when first produced. My new project will attempt to simulate in the kitchen the effect of centuries of  subtle degradation on an image of unknown provenance, whether 700 or 2000 years  old.\nSeriously, TH, one has to recognize the limitations of any attempts at model building. That’s what we scientists, as distinct from physicians, engineers, technologists etc  do – we build models. Recognizing the limitations of models, we are concerned primarily with the principles, especially when there are so many who claim for example that a 200nm thick image in unexplainable by conventional science (wrong, it is).\nI am not trying to produce a facsimile copy of the TS (forgery Mark 2?) merely to show that its defining characteristics are consistent with medieval forgery. That’s as a counter to those pseudoscientific agenda-pushers who say they are not. (That’s my agenda – anti-pseudoscience). “Defining characteristic” must not turned into a trail (trial?) with no ending.\n\n","date":"April 29, 2015 at 10:25 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197974","author":"Colin Berry","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Back from Turin.\nAs in 2010, it was a wonderful experience.\nColin: “Maybe we need an updated checklist.” of the defining details, the “details” that any kind of model must share with the TS. Yes, we need it otherwise we could discuss endless.\nIn this discussion, we have to face at least two challenges.\n1) The image is necessarily the result of the interaction between the Body Image Formation (BIF) Process and the linen.\n2) The effect of ageing.\nThere are some properties of the image which are directly related to the BIF process: negativity, superficiality at fabric and thread level, 3D properties.\nIn my opinion we can add: high resolution, fuzziness of the contours, “no patch” (the image is continuous in a given image area at macro level).\nBut there are also some properties for which point 1) and or point 2) could be more or less important (or not):\n– The banding effect\n– Narrow range of optical densities\n– No saturation, no “hot point”\n– Faintness\n– Half-tone\n– Discontinuities at micro level\n– Superficiality at fiber level\n– Mechanical weakening of entire image-bearing fibres\n– ….\nIn other words, is it possible to find a rational method to decide that a given model is compatible with the TS image (or not), taking into account Points 1 and 2 ?\n\n","date":"May 3, 2015 at 4:01 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-198221","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Some people think that the “effects of aging” are that an originally bright clear image has faded/flaked to what it is now; and others that an originally completely invisible image became visible by darkening – those who habitually place their experiments in an oven for “aging.”  We need to be clear about what “aging” really does.\n\n","date":"April 30, 2015 at 2:28 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197978","author":"Hugh Farey","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Louis says:\nApril 28, 2015 at 4:25 pm\nHi Angel, that is what I pointed out in a comment above, dated 26th, also providing the link:\n https://www.academia.edu/11804110/Is_the_Sudarium_\nApril 28, 2015 at 4:25 pm\nLouis says:\nHi Angel, that is what I pointed out in a comment above, dated 26th, also providing the link:\n https://www.academia.edu/11804110/Is_the_Sudarium_of\n***Angel says:  Hi Louis.   For some reason I can access your link, but there is no information included on the page.  Perhaps this is a result of my dial-up connection.\nYes, there have been several others who have pointed out the relationship of AB blood on both the Sudarium and the Shroud.  I just included it again.\nYet, I was specifically referring to the genetic testing for Jewish ancestry (FamilyTreeDNA) by Dr. Doron Bahar of Haifa University, Israel.  The DNA performed by Garza-Valdes on the blood on the Shroud blood indicates Jesus had markers 150T and 195C.   Does your comment address this question?\nI’ve not seen another post that referred to the haploid group or mutant genetic markers.\nBest,\n\n","date":"April 28, 2015 at 6:50 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197888","author":"Angel","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"edit:  Dr. Doron Behar, Hebrew University of Jerusalem, Haifa, Israel\n\n","date":"April 28, 2015 at 11:35 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197905","author":"Angel","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"PS  Disregard my reply with your post duplicated.  There is no edit button to make the correction.\n\n","date":"April 28, 2015 at 6:54 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197889","author":"Angel","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Louis, my mother had AB positive blood and when I attended Dr. Adler’s two seminars, back in the 80s, he was adament that the blood on the Shroud was AB negative.  \nI’m still trying to figure out how AB negative has now become AB positive?\nBest,\n\n","date":"April 28, 2015 at 6:58 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197890","author":"Angel","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Hi Angel\nNo, I just mentioned the AB type blood, without giving details.The publishing house which published Dr. Garza-Valdéz’s book gave me a copy as well as his contact details in order to write a report, however there was something wrong with these and no contact could be made. I therefore only wrote a review. Ian Wilson appreciated the work done by him and Professor Stephen Mattingly, but the Shroud’s papal custodian Cardinal Giovanni Saldarini dismissed the results because they did not have an authorised sample.\n\n","date":"April 29, 2015 at 6:11 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197925","author":"Louis","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Thanks, Louis,\nI appreciate your effort.  :)\nBest,\n\n","date":"April 29, 2015 at 3:20 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197956","author":"Angel","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"A good review of the current thinking about the Shroud’s DNA is at: https://shroudofturin.files.wordpress.com/2014/09/atsi-2014-uncovering-the-sources-of-dna-of-the-turin-shroud.pdf.\nAs human migration from Africa millions of years ago surged through the Middle East, so the Middle East is very much the trunk of a tree, whose genes then spread around the world. To identify a person as Middle Eastern, you have to either show that he does not have genes that developed subsequently in more far flung corners of the globe (which attempt to prove a negative is almost impossible in this case), or that he does have genes which subsequently disappeared in other parts of the world (particularly Europe), or that he has genes which have developed peculiarly to the Middle East since the great human migration into Europe and India ceased. This would be the best, but has not been observed.\n\n","date":"April 29, 2015 at 2:04 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197911","author":"Hugh Farey","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Hi Hugh,\nThank you for the link and the detailed explanation.  :)\nI was hoping the genetic information Garza-Valdes outlined would prove the man on the Shroud was not only Jewish, but that type AB blood originated with Jesus over 2000 years ago, as opposed to D’Adamo’s view that the AB blood type was introduced approximately 700 AD.\nBest,\n\n","date":"April 29, 2015 at 3:28 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197957","author":"Angel","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"No chance! Sorry!!\n\n","date":"April 29, 2015 at 4:53 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197964","author":"Hugh Farey","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Hugh, I looked closely at the results on the link you provided in your post and what made little to no sense is there were about 3 or 4 haplogroups assigned to the Shroud blood and several subclades, as well.  If I remember correctly there was an L haplogroup, a few Rs, and several Us.  How is this possible?\nWhen mtDNA genetic testing is done, one haplogroup is assigned and with further testing, a subclade of that haplogroup is scientifically determined and finally the refined test, FTDNA, is performed giving the correct subclade for the haplogroup.\nIn my case the first mtDNA testing (HVR1) placed me in the haplogroup K (Katrine clan), then a more detailed study, (HVR2), determined a subclade K1a3a and finally a refined study was performed (FTDNA) and that further detailed my subclade as being K1a3a1b. Notice all three results include the “K” haplogroup.  Only one haplogroup (K) and not several.\nWith that in mind, the Shroud man’s genetic test results (mtDNA) appear to be useless, since there are too many haplogroups that are assigned.  There should only be one.   Any explanation?   :)\nBest,\n\n","date":"April 30, 2015 at 2:20 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-198040","author":"Angel","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Not really my field, Angel, but I think a haplogroup is a non-random collection of haplotypes, which are themselves non-random collections of genes. I would guess that few people in the world are so “pure-blooded” as to have only a single haplotype. I guess that when we are investigating the closeness of our relationship to somebody else, only a single haplotype need be investigated, as long as it is present in both people. Maybe somebody who knows what he is talking about could clarify?\n\n","date":"May 1, 2015 at 9:41 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-198084","author":"Hugh Farey","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Colin,\nWhere are the controls on linen fibrils (= inspections under a microscope)?\nWe have not yet seen the controls at “sub-fibre level” …\nYou know that Shroud image reproduction fails if the features of linen fibril is not the same of the linen fibrils of the Shroud…\nUntil we have not seen what are the true features (remember also the question of colorless medulla) we cannot speak about the interesting experiments you have done.\n— — —\nB.T.W. I have read that :\n>cold nitric acid, i. e. at ordinary room temperature, either alone\nor in combination with certain other acids, will not deleteriously attack\nthe fiber of flax straw or tow but will attack and reduce the woody portion or shives,\nwhich, as is well known, comprise cellulose fibers associated\nwith encrusting or adsorbed lignin.\nSo…\nHave you studied the nitric acid action (reaction) on lignin ?\n— —\nPerhaps we can also try to detect where are (= maps)\nthe reacted lignin constituents (during the controls on linen fibrils)…\n— —\nI’m too impatient, I’m sorry…\n— —\nIn any case I believe that new AFM controls on linen fibrils\nare based on something more substantial\nthan the Mark Evans photomicrographs.\n\n","date":"April 29, 2015 at 9:33 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197933","author":"piero","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"However if it is already available a Leica microscope,\nfor example:  the new Leica DVM6\n(= 2350x magnification shows you details down\nto 0.4 micrometers on the same microscope…\nBut we know that this is still not enough for some cases\nof the thinner layers of the Image!)\nI would be happy because I think I can unmask\nyour interesting “chemical attempts”.\nThen I already using only the OM (= Optical Microscopy)\nI can think to solve the problem of examination for your\nnitric acid fumigated (or “chemical treated”) linen samples…\nLink:\nhttp://www.leica-microsystems.com/products/digital-microscopes/details/product/leica-dvm6/\n\n","date":"April 29, 2015 at 9:51 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197936","author":"piero","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Piero:I shall be doing all the tests you suggest and more besides, but all in good time. For now I have been content to flag up the results of my pilot experiments with the new two stage imprinting/developing methodology. They show how it’s possible to get a yellow-brown negative imprint from a real person that shows some 3D-properties.There’s a little reverse side colour, but less than I expected, and simple modifications may be able to prevent it altogether. Image superficiality has still to be determined, but  then chemical degradation does not always show itself as visible discoloration: there may be less superficial damage to the SCW core of the fibre, the hemicelluloses especially,  that are not easily visible, maybe not visibly affecting the ‘medulla’, i.e. most central part, thus distinguishing the new technique from the alleged defect of the contact-scorch model.\nBeing aromatic, lignin is a possible target for nitration as well as oxidation. I’m thinking of using the stone cells of pear fruit as a model system for looking at linen, given the ease of seeing them under the microscope. However, it’s not impossible that the result obtained with nitric acid could be reproduced using acid-free thermal development alone, given the right imprinting agent, perhaps not the wheat flour paste used in my preliminary experiments. There’s a vast number of variables and combinations thereof that need to be tested. It will take time.\n\n","date":"April 29, 2015 at 9:58 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197937","author":"Colin Berry","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Typo: I’m thinking of using the stone cells of pear fruit as a model system for looking at LIGNIN.\n\n","date":"April 29, 2015 at 10:00 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-197938","author":"Colin Berry","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Here’s the result of that experiment with pear flesh as a model system for targeting of lignin, piero, obtained just 5 minutes ago.\n\nhttp://colinb-sciencebuzz.blogspot.co.uk/2015/05/modelling-turin-shroud-my-flournitric.html\nThat’s the nitric acid treated half on the right, control (untreated) on the left. The lignified stone cells do indeed become prominent, so it’s highly probable  that lignin from any source will be targeted. Having said that, the non-image areas of linen are only slightly discolored after nitric acid treatment.\n\n","date":"May 4, 2015 at 11:21 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-198296","author":"Colin Berry","site":"shroudstory"},{"title":"Might tactile chemography prove to be the super-model?","post":"Hugh Farey\nMay 1, 2015 at 9:41 am \nNot really my field, Angel, but I think a haplogroup is a non-random collection of haplotypes, which are themselves non-random collections of genes. I would guess that few people in the world are so “pure-blooded” as to have only a single haplotype. I guess that when we are investigating the closeness of our relationship to somebody else, only a single haplotype need be investigated, as long as it is present in both people. Maybe somebody who knows what he is talking about could clarify?\n***Angel says:  Hi, Hugh.\nThank you, but only one haplogroup is assigned to mtDNA (maternal line) and only one to YDNA (paternal line).\nI used my mtDNA K (Katrine clan) as an example.\nWhen you say we are closely related to other people, well that is true.\nIn my case, K (Katrine) haplogroup is the daughter of U (Ursula), as an example.  Therefore, my ancestors would go back beyond Katrine to Ursula’s line (U haplogroup) and Ursula’s line goes back to Africa (L haplogroup).  All separated by thousands of years.\nYet, these other groups, in my example Katrine, are pre-Katrine.  There is only one final haplogroup for the mother’s line and one for the father’s line.  In my case, the ancestors of K are U and the ancestors of U are L, but I am not assigned to all three (K, U and L) , but only K.\nI suspect, since the DNA of Jesus (Shroud) was fragmented, the genetic scientists were unable to definitely determine His final haplogroup (FTDNA), and if one of His markers indicated Ursula (U) then U was included as a haplogroup, and  if another of His markers indicated Africa, then L was included as a haplogroup and for this reason, there are both numerous haplogroups and subclades assigned to the TS mtDNA.  Garza-Valdez included mtDNA data only up to marker 263, where my refined mtDNA dat is in the multi-thousands.\nAs well, it matters not which genetic organization performs the DNA testing, all will give the same result for the final haplogroup and subclade.  \nThis link shows a photo of how everyone’s ancestors go back to Africa as well as the expansion times (years ago).\n http://www.worldfamilies.net/mtdnahaporigins\nThis is such an interesting field of study, but as a rule no one cares unless he/she has had his/her own personal DNA performed.  There are even DNA forums, where people from each of the various haplogroups and subclades discuss their common ancestry (Vikings, Kazars, etc.).  \nThe price has come down a lot and many times these genetic testing companies have sales on their services.  I paid separately for HVR1, HVR2 and finally FTDNA, but if anyone here chooses to have his or her DNA done, don’t pay separately for all three.  Just pay a little more, when there is a sale, for the refined test (FTDNA).   This test will include the other two.\nKelly Kearse may be able to clarify the results on the TS DNA.\nThanks again, Hugh.\nBest,\n\n","date":"May 1, 2015 at 4:34 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","id":"comment-198098","author":"Angel","site":"shroudstory"}]
