[{"title":"Modelling the Man on the Turin Shroud using medieval technology: are we nearly there yet?","post":"It’s naughty and probably unwise to blow one’s own trumpet, but I’m frankly amazed at the quality of those images, especially the one on the right (the king’s head). Using simple materials – metal castings, olive oil, white flour and an oven one can obtain images that while blurry could be mistaken for 19th century photographic negatives. What’s more, they are not necessarily my best images that are obtainable from those two horse brasses. I had started yesterday substituting rice for wheat flour as imprinting medium, leaving an area of the fabric (linen and cotton) free of imprint that could be removed after oven-baking and tested for its ability to take a fresh imprint after that pre-baking step. Yes, images were obtained with the rice flour onto the unbaked linen and cotton, though not as good as MIGHT have been seen with wheat flour. In other words, wheat flour has still to be tested on all four combinations of wheat/cotton/unbaked fabric/baked fabric. The image in this posting was from just one of those 4 (wheat/baked cotton).\nToday I shall test all 4 combinations in the same session, and see which gives the best result. Regardless, one has a technology that delivers results that are reminiscent of those obtainable when bas relief objects  cast in metal, or carved into softer materials – lino, raw potato even-  are used in conjunction with paint as a means of printing images (as with modern day T-shirts). The difference is that mine is a thermal imprinting technique that appears to produce a final image that is chemically bonded onto the heat-resistant  cellulose fibres of the fabric, at least some being resistant to washing with soap and water. Might we be seeing here the technology that was deployed in the 14th century to produce the image of the man on the Shroud?\nMore work is needed to characterize that final wash-resistant image, whether obtained on linen or cotton, used ‘as-is’ or pre-baked, and to try and understand the mechanism by which the colour migrates from the roasting flour with its ongoing  Maillard reactions into the underlying weave of the fabric. Might oil play a role in the migration, as suggested previously by this investigator last year when first reporting on the flour-imprinting model? That model seems to me to be gaining in strength and hopefully credibility with each passing day, but there will be no counting of chickens, not just yet anyway.\n","date":"January 7, 2016 at 8:35 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/06/modelling-the-man-on-the-turin-shroud-using-medieval-technology-are-we-nearly-there-yet/","cat":"contact_imprint","id":"comment-6668","author":"Colin Berry","site":"colinberry"}]
