[{"title":"Modelling the Turin Shroud: forged in the 14th century as a white flour imprint onto linen? Then chemically developed with nitric acid to resemble ancient yellowed sweat?","post":"Yes, image capture first, maybe scarcely visible, followed by a separate second stage to augment the visibility. It’s analogous to pre-digital photography, but as I was saying just the other day to someone on the shroudstory site, it’s possible that the two-stage process could have been in operation many centuries earlier, at least in principle. Imagine someone pressing their face down into a pillow. They leave an indentation, which is a kind of negative image of sorts, but it’s faint and it’s temporary (disappearing as soon as the pillow returns to its original shape). But suppose they had first smeared their  face with oil, before pressing in into the pillow. It’s a faint imprint in oil, but it’s permanent, remaining visible after the pillow has sprung back.\nSo far we’ve achieved Stage 1 imprinting. We now want to develop the image further. If oil had been used as imprinting medium, there’s a way of doing that. One finds something that attaches preferentially to oil rather than fabric. Thinking about the way fingerprints can be revealed by dusting. one could try blowing soot (fine particles of carbon) onto the oil imprint. There’s a good chance they would stick to the oil and resist being shaken off. One has then achieved second stage development.\nBy the same reasoning the TS image could have been produced by 1. impaction of a flour/water paste coated human (+ blood) onto linen to leave a faint negative image.  Then, Step 2,  develop the image by exposing to a suitable chemical that forms a strong yellow colour with flour but not linen. Nitric acid, either as vapour or solution, fits the bill. I consider this technology to have been fully within the means of a medieval entrepreneur, especially one who had links with an alchemist and who knew the recipe for generating nitric acid (heat a mixture of Cyprus vitriol, alum and saltpetre).\nThanks for your interest and appreciative comment, Mark One\n","date":"May 16, 2015 at 5:48 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/05/13/modelling-the-turin-shroud-forged-in-the-14th-century-as-a-white-flour-imprint-onto-linen-then-chemically-developed-with-nitric-acid-to-resemble-ancient-yellowed-sweat/","cat":"uncategorized","id":"comment-6081","author":"Colin Berry","site":"colinberry"},{"title":"Modelling the Turin Shroud: forged in the 14th century as a white flour imprint onto linen? Then chemically developed with nitric acid to resemble ancient yellowed sweat?","post":"Ooops. Silly me. I already had the Heller/Adler requirement catered for in the two stage methodology proposed here, then went and clean forgot about it. So here’s the necessary amendment/correction, which I’ll insert shortly. The blood is added as dribbles directly on top of the flour paste BEFORE second stage imprinting. That way it imprints onto linen first, so ends up UNDER the body image, not on top, as would be the case if blood had been applied after imprinting. Must stop there: laptop playing up. Thanks for spotting  and reporting the error.\n","date":"May 16, 2015 at 7:01 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/05/13/modelling-the-turin-shroud-forged-in-the-14th-century-as-a-white-flour-imprint-onto-linen-then-chemically-developed-with-nitric-acid-to-resemble-ancient-yellowed-sweat/","cat":"uncategorized","id":"comment-6078","author":"Colin Berry","site":"colinberry"},{"title":"Modelling the Turin Shroud: forged in the 14th century as a white flour imprint onto linen? Then chemically developed with nitric acid to resemble ancient yellowed sweat?","post":"Thanks for taking the trouble to field my query, and for providing a lucid explanation. As I understand it (as a non-scientist), the core of your idea is a two-stage process of image formation, analagous to pre-digital photography: (a) taking the photo; (b) developing it as a negative. The blood is added between the two stages.\nThe blood, of course, is a bridge that will have to be crossed later. It’s interesting to note Adler’s comments about the blood (referenced in Kearse’s “Immunological Review”, 2012: http://www.shroud.com/pdfs/kearse.pdf).\nI like the way you work. You are right to challenge suggestions of supernatural involvement by attempting to reproduce image formation in this manner. It always worries me when I hear someone say, as scientists, journalists and mystics often do: “THAT can’t possibly have happened”. If you succeed in developing a putative image-formation technique which could have been executed by anyone in the 13th/14th century, you will have disproved the “can’t possibly have happened” normative statement, which would be a significant step forward in TS research.\n","date":"May 16, 2015 at 12:57 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/05/13/modelling-the-turin-shroud-forged-in-the-14th-century-as-a-white-flour-imprint-onto-linen-then-chemically-developed-with-nitric-acid-to-resemble-ancient-yellowed-sweat/","cat":"uncategorized","id":"comment-6080","author":"Mark One","site":"colinberry"},{"title":"Modelling the Turin Shroud: forged in the 14th century as a white flour imprint onto linen? Then chemically developed with nitric acid to resemble ancient yellowed sweat?","post":"Your research experimentation is fascinating and your blog is like a little island of near-sanity in a storm-tossed sea of hype (much of which is the result of the machinations of people with vested interests – not just religious groups, but also the press). I myself am an atheist, so I have no axe to grind other than wishing for an open-minded, scientific and empirical approach to the problem.\nYou warn against mistrusting fellow scientists, and you may well be wise to do so, but your Point 7 (“The body image would have to be imprinted first, so as to know where to apply the blood”) flatly contradicts Heller and Adler, who are quoted as saying in the Canadian Society of Forensic Science Journal (1981) that the image colour does NOT appear under the bloodstains when the bloodstains are removed with a proteolytic enzyme. I take this to mean that the blood must have “coloured” the linen BEFORE the body image was created.\nAre you refuting Heller and Adler’s statement? If so, it would be interesting to know on what grounds. “Take nobody’s word for it” is a fine starting-point, but supposing they’re right?\n","date":"May 16, 2015 at 3:23 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/05/13/modelling-the-turin-shroud-forged-in-the-14th-century-as-a-white-flour-imprint-onto-linen-then-chemically-developed-with-nitric-acid-to-resemble-ancient-yellowed-sweat/","cat":"uncategorized","id":"comment-6076","author":"Mark One","site":"colinberry"}]
