[{"title":"Inexplicable 3D Optical Illusion Phenomenon","post":"Yeshua is the Son of God, and left His image on the  burial cloth.\n\n","date":"January 1, 2009 at 7:12 pm","url":"https://shroudstory.com/2008/09/30/inexplicable-3d-optical-illusion-phenomenon/","cat":"image_theory","id":"comment-241","author":"TA","site":"shroudstory"},{"title":"Inexplicable 3D Optical Illusion Phenomenon","post":"“You cannot plot a regular photograph this way”?\n   I do it all the time with a landscape generator.\ntake a look at my website.\nIncidentally,\nHebrew law required cleansing of a body before burial.\nThere would have been no dirt, grime, sweat, or BLOOD\non Jesus when wrapped.\n\n","date":"April 4, 2010 at 6:03 pm","url":"https://shroudstory.com/2008/09/30/inexplicable-3d-optical-illusion-phenomenon/","cat":"image_theory","id":"comment-1230","author":"R. Maresz","site":"shroudstory"},{"title":"Inexplicable 3D Optical Illusion Phenomenon","post":"Incidentally,\nPeople who were deemed worthy of being crucified were usually left on the cross to be eaten by birds. They were not given a proper burial, which is why Jesus did not recieve one. Not even the families of the deceased could take their dead. They were left out to rot. So it WAS something special when Joseph of Arimathea went to Pilate and asked for the body of Jesus, took Him and wrapped Him in a clean linen cloth, and placed him in the tomb. (Matthew 27:59-60)\nIf this does not convince you, I hope you would take notice to the fact that the new investigation done on the Shroud has concluded that the image is not of dirt or sweat. They have no idea what it is, and it is proven that the blood IS human blood. Also, even IF the body was cleansed, Jesus suffered so greatly that his wounds were extremely deep. Even after a traditional cleansing, the stains would still have been left. He most likely had little or no skin left on his back after the stripes he recieved. In the Old Testament, the sacrificial lamb’s back was skinned to insure it was as pure inside as it was out. As most of us understand and know to be true, Jesus is the eternal sacrificial lamb. To have no skin on your back and then be wrapped in a cloth would produce enormous blood stains.\nMy faith is not based on the Shroud of Turin. I think it is a haunting example of what Jesus suffered through. I also think it is interesting that it has stumped scientists. Even they have come to the conclusion that, if put in front of a jury, the Shroud of Turin would be voted authentic according to the information they have.\nGod has a sense of humor, and I believe in my heart that the Shroud is authentic. I believe that even if its not, God keeps it here as a reminder to us that we should be eternally greatful to Him.\n\n","date":"April 19, 2010 at 12:00 am","url":"https://shroudstory.com/2008/09/30/inexplicable-3d-optical-illusion-phenomenon/","cat":"image_theory","id":"comment-1262","author":"K Hef","site":"shroudstory"},{"title":"Inexplicable 3D Optical Illusion Phenomenon","post":"Bodies don’t bleed after death.\nIn a previous History Channel special, a scientist proved the red stains to be red ochre, a medeivel pigment.\n\n","date":"May 8, 2010 at 9:06 pm","url":"https://shroudstory.com/2008/09/30/inexplicable-3d-optical-illusion-phenomenon/","cat":"image_theory","id":"comment-1283","author":"R,Maresz","site":"shroudstory"},{"title":"Inexplicable 3D Optical Illusion Phenomenon","post":"Actually, the heart doesn’t pump blood after death. But in fact bodies do bleed after death if they are moved about or the limbs are moved. And blood still under pressure from the previously beating heart is sometimes released in spurts. Don’t depend too much on television CSI; those are general statements. As for the scientist in the previous History Channel special, you are referring to Walter McCrone. His “proof” was visual observation through a microscope. In fact, Mark Anderson, who worked for him disagreed and ran Raman Spectrometry on McCrone’s samples. What McCrone saw was organic and thus could not be red ochre. Later tests at the Nebraska University center for Spectrometry proved also that there was no red ochre in the samples. BTW, it is a very ancient pigment and a very modern pigment. The correct statement is that it is a pigment used throughout history and known in medieval times.\n\n","date":"May 9, 2010 at 6:47 am","url":"https://shroudstory.com/2008/09/30/inexplicable-3d-optical-illusion-phenomenon/","cat":"image_theory","id":"comment-1284","author":"Episcopalian","site":"shroudstory"},{"title":"Inexplicable 3D Optical Illusion Phenomenon","post":"A dead stiffening body with coagulated blood won’t express what the shroud shows, especially when it is\nlaid out and cleansed before final wrapping.\nBut, the shister who created the shroud knew he had to really “sell” the idea of Jesus’ burial shroud to his potential buyers of the “holy relic”. Some sort of animal blood carefully placed would seal the deal.\nThere are two types of tests for blood: preliminary and conclusive.\nIf the Police see a red stain, they often do a preliminary test for blood. It’s quick and simple and only determines if there is protein present in the specimen. If the preliminary test is negative,\nthey won’t bother doing the conclusive test for human blood.\nI’m still waiting for the name of the conclusive test for human blood that they used; who analyzed the specimen, and at which CLIA certified laboratory\nit was done. I fear that the shroud team did some\nsort of preliminary test ( which would test positive\nfor any species of animal blood) and are trying to\npass it off as a definitive test. Surely, such a high\nprofile result would be published in a scientific journal. I haven’t seen it yet in the Journal of Pathology.\n\n","date":"May 15, 2010 at 8:55 pm","url":"https://shroudstory.com/2008/09/30/inexplicable-3d-optical-illusion-phenomenon/","cat":"image_theory","id":"comment-1294","author":"R. Maresz","site":"shroudstory"}]
