[{"title":"More on Max Patrick Hamon and the Coin-on-Eye Issue","post":"If it’s so true Max, then explain to me why Miller and Pellicori in their STURP paper about the analysis of the UV photos of the Shroud have not said a word about possible blood stains (or any word about a possible image of a coin) in the eye region ??? Yet, they were able to detect minute stains of serum and minute scratch-like marks in the scourge marks !!!\n\n","date":"October 25, 2011 at 8:33 am","url":"https://shroudstory.com/2011/10/25/more-on-max-patrick-hamon-and-the-coin-on-eye-issue/","cat":"image_theory","id":"comment-4328","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Max Patrick Hamon and the Coin-on-Eye Issue","post":"In a previous post, regarding the release of HAL9000 images someone asked was what the Archidiocesis of Turin afraid of. I think the Archidicocesis and the Chuch are afraid of exactly the type of discussions we are seeing these days in this blog.  A lot of discussion on 40 years-old evidences, a lot of personal remarks…….They must have reached the conclusion that no matter how solid the new evidences they have are (HAL9000+material from the 2002 restoration+..¿?) it would be impossible to have a serious and cold discussion on the facts. Once you release the images, how can you prevent someone from calling up the press and claim that he is seeing something. If not accepted, someone will always put through the idea that someone has been the victim of a plot to keep him silence? If a new C14 test is carried out with positive results, the following day someone will claim that the Church has changed the original fibres since 2002 lest the whole religion system crumbles. If it is negative, again, new claims will be made regarding the selected patch or any other issue.\nThe Church knows how media work and can foresee that they could never expect a fair and cold debate, whatever the results are. After all, the Catholic faith basements do not rely on a “true” Shroud.\nSO most probably, they have already analyzed by themselves the evidences they have at hand and will never repeat the error of putting forward their new evidences so that 40 years later, discussions still go on. After all, never forget that the Catholic Church “does not need” outer scientists (like a second STURP) for this or any other issue. The Church has got their own and very high level experts on virtually every field involved, who can provide her with state-of-the art and cutting edge methodologies and procedures to address this and any other issue. Silently and peacefully while the whirl of the STURP which started nearly 40 years ago is still turning.\n\n","date":"October 25, 2011 at 11:30 am","url":"https://shroudstory.com/2011/10/25/more-on-max-patrick-hamon-and-the-coin-on-eye-issue/","cat":"image_theory","id":"comment-4335","author":"Gabriel","site":"shroudstory"},{"title":"More on Max Patrick Hamon and the Coin-on-Eye Issue","post":"And since when is there anything wrong with discussion? Discussion is good. What is bad is the fact the Church, since the original STURP team studies, has been completely uncooperative! They have their own A-team of scientists? Yeah okay…when STURP showed up in ’78 with their precisely built table with magnetics so they would not harm the shroud, they found the church was using ‘tacks’ on the Shroud to hold it in place. OMG NO!…The problem lies with the church not being upfront or forthcoming. The 2002 restoration is proof of that. It’s been 40 years! The technologies today are leaps and bounds ahead that time, or of ’88 or even ’02. I even read of a new type of c-14 technology that no material needs to be destroyed whatsever! …So yes I think many of us are still asking what the hell is the archidiosis of Turin afraid of?\n\n","date":"October 26, 2011 at 7:23 am","url":"https://shroudstory.com/2011/10/25/more-on-max-patrick-hamon-and-the-coin-on-eye-issue/","cat":"image_theory","id":"comment-4349","author":"Ron","site":"shroudstory"},{"title":"More on Max Patrick Hamon and the Coin-on-Eye Issue","post":"Dan, I do like your mild sense of humour!\n\n","date":"October 25, 2011 at 2:18 pm","url":"https://shroudstory.com/2011/10/25/more-on-max-patrick-hamon-and-the-coin-on-eye-issue/","cat":"image_theory","id":"comment-4339","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"More on Max Patrick Hamon and the Coin-on-Eye Issue","post":"Pienso que en el fondo del debate sobre monedas y flores, ya sea consciente o subconscientemente, subyace la reacción de Maillard a la que Rogers atribuye el COLOR de las fibras del lino.\nComo cualquier otra teoría vaporográfica la reaccion de Maillard NO puede justificar la imagen, ni de monedas y flores si es que las hubiera, ¡ ni la imagen del Hombre de la Sábana!.\nPodría haber justificado el COLOR , no su ordenación como IMAGEN…….pero ni siquiera el color es admisible es este caso específico de la Sábana de Turín.\nLa presencia del RIGOR MORTIS, patente en la imagen, indicando la persistencia de elevada cifras de ácido láctico NO es compatible con el inicio de la DESCOMPOSICIÓN de las proteinas y producción de las aminas CADAVERINA, PUTRESCINA y afines, necesarias en la reacción de Maillard que propuso Rogers.\nLa descomposición se inicia una vez ha CESADO el rigor mortis.\nRogers, al que tanto debemos en el estudio de la Sábana, se equivocó en este punto, el cuerpo de Jesús de Nazaret NO sufrió la corrupción, no pudo producir cadaverina, putrescina y afines, y por tanto no pudo haber ninguna reacción de Maillard que diera color a la Sábana.\nPara los que creemos en la verdad de ” ni permitirás que tu santo vea la corrupción”, Hechos 2:22-33, la producción de aminas aromáticas, cadaverina y putrescina procedentes de la CORRUPCIÓN, DESCOMPOSICIÓN o PUTREFACCIÓN de las proteínas corporales del Hombre de la Sábana, precisas en la reacción de Maillard que propone Rogers, NO es aceptable ……..y para Turín creo que tampoco.\nCarlos Otal\n\n","date":"October 25, 2011 at 6:11 pm","url":"https://shroudstory.com/2011/10/25/more-on-max-patrick-hamon-and-the-coin-on-eye-issue/","cat":"image_theory","id":"comment-4341","author":"Carlos Otal","site":"shroudstory"}]
