[{"title":"More on Sciencebod Reacts (Focus on paper by Fanti, et al)","post":"I only hope that just because sciencebod’s “scientific” claims are not rigourous at all, that doesn’t automatically make Fanti and, more specifically, his supernatural explanations emerge as more rational and serious.\n\n","date":"January 30, 2012 at 10:48 am","url":"https://shroudstory.com/2012/01/30/more-on-sciencebod-reacts-focus-on-paper-by-fanti-et-al/","cat":"image_theory","id":"comment-7701","author":"Gabriel","site":"shroudstory"},{"title":"More on Sciencebod Reacts (Focus on paper by Fanti, et al)","post":"I would be more worried if people interpretted man’s understanding of nature, the universe and everything in it, as being “completely understood” and therefore anything outside of our understanding is just irrational! That is not what science should be, as that type of thinking builds a ‘box’ around the whole essence of science and limits ones’ imagination. Not to mention how utterly proud and conceited a notion it is that man has come to know ALL there is to know….lol. We know only a smidgen of the truth…Don’t believe me? read what Einstein had to say about that.\nAlthough the notion of a “resurrection-phenomenon”, may be outside our present understanding of science, does not in any way make it irrational or comedic or impossible. The sooner the ‘armchair’ scientists here understand this the better for everyone…..\nLets not get too big for our britches!\nR\n\n","date":"January 30, 2012 at 4:06 pm","url":"https://shroudstory.com/2012/01/30/more-on-sciencebod-reacts-focus-on-paper-by-fanti-et-al/","cat":"image_theory","id":"comment-7719","author":"Ron","site":"shroudstory"},{"title":"More on Sciencebod Reacts (Focus on paper by Fanti, et al)","post":"As I’ve said before on this blog; Maybe the Shroud in a small sense has a simple message, amongst others, …that is, it’s God’s way of putting us in our place. A reminder that pride is a sin and to be humble is the way too the Lord.\nR\n\n","date":"January 30, 2012 at 4:13 pm","url":"https://shroudstory.com/2012/01/30/more-on-sciencebod-reacts-focus-on-paper-by-fanti-et-al/","cat":"image_theory","id":"comment-7720","author":"Ron","site":"shroudstory"},{"title":"More on Sciencebod Reacts (Focus on paper by Fanti, et al)","post":"Fanti’s article is naively biaised. But I would draw a parallel with the C14 datation. In both cases there is an assumption which distorted the way facts have been analysed.\n1/ Fanti’s article. There’s the image of a body, the imprint of which is lying on a linen => there must be an outline.\n2/ C14 datation. They took a sample, textile experts said it’s homogeneous => it must be homogeneous.\nError ?\n1/ The outline is not continuous whereas it should be => take opportune values and techniques and reconstruct a continuous outline.\n2/ C14 datation. Significancy limit 5% => don’t bother explaining this very low significancy, take opportune statistical techninques, anyway it’s medieval not antique.\nArtefact or new fact ?\n1/ The linen could be folded.\n2/ The sample could may be not representative of the whole linen.\n\n","date":"January 31, 2012 at 2:00 pm","url":"https://shroudstory.com/2012/01/30/more-on-sciencebod-reacts-focus-on-paper-by-fanti-et-al/","cat":"image_theory","id":"comment-7770","author":"anoxie","site":"shroudstory"},{"title":"More on Sciencebod Reacts (Focus on paper by Fanti, et al)","post":"Nice comment !!!  He he !  Anyway, Fanti and other who proposed those kind of hypothesis will always have a fan club.  That’s the situation in the Shroud World and I don’t think that will change in a near future.\n\n","date":"January 30, 2012 at 11:33 am","url":"https://shroudstory.com/2012/01/30/more-on-sciencebod-reacts-focus-on-paper-by-fanti-et-al/","cat":"image_theory","id":"comment-7702","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Sciencebod Reacts (Focus on paper by Fanti, et al)","post":"To be more specific on Fanti’s article :\n1/ The raw computerized outline without any reconstruction would have been more informative than the smooth imprint.\n2/ “The technique to point out the outlines used different elaborations, among them a\npreliminary filtering of the image, a determination of the threshold on the basis of preestablished\ngrey levels and an adjustment of the outline through suitable spatial filters.”\nmore explanations about the techniques would be required.\n3/ “an opportune value like threshold is determined”\nopportune seems subjective.\n4/ There is a zone under the buttocks with no image. Using a computerized method would lead to a discontinuous outline on the dorsal image.\nbest regards,\n\n","date":"January 30, 2012 at 2:00 pm","url":"https://shroudstory.com/2012/01/30/more-on-sciencebod-reacts-focus-on-paper-by-fanti-et-al/","cat":"image_theory","id":"comment-7715","author":"anoxie","site":"shroudstory"}]
