[{"title":"More support for Treasures Decoded: The Turin Shroud","post":"That was certainly fast Dan.  I enjoyed watching the video.  Those of us who are steeped in all this stuff probably won’t find anything all that new.  I was intrigued by the attempt to test the maillard reaction hypothesis and a little disappointed that the result was largely limited to similarity of appearance at the microscopic level.  Still it’s a start.  It is always striking to me how poorly the results end up compared with the actual shroud.\n\n","date":"May 17, 2013 at 12:35 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-33876","author":"rschneider42","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"So those who made a big noise about the Maillard reaction have something more to learn.\n\n","date":"May 17, 2013 at 5:19 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-33899","author":"Louis","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"Of course, was there any doubt.  There are many things to learn.  None of the suggested mechanism come anywhere close to duplicating the shroud except in the most superficial way.  There are four keys characteristics and a flock of others that need to be reproduced to duplicate the shroud.  The four major ones I call the STAR characteristics.  S)uperficial: image only extends a few hundred nanometers into the fibers and then on the surface.  They don’t penetrate.  T)hree dimensional: intensity varies with cloth to body distance so that rendered with that in mind you get a three dimensional image.  A)real Density: the image behaves like a half-tone image, all the image elements being the same color (within about 2%) so that apparent density changes are relatively more or less colored areas not changes in color.  R)esolution — the image is focused and relatively high in definition.\nCommonly suggested mechanisms rarely can explain more than one or two of these features and I’ve seen none that adequately explain all.\n\n","date":"May 17, 2013 at 9:22 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-33912","author":"rschneider42","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"One wonders if a Maillard reaction alone is sufficient to explain the image-formation process and an environment simulating a first-century Jerusalem tomb and the exact means employed to bury Jesus will be very difficult.\n\n","date":"May 18, 2013 at 10:51 am","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-33947","author":"Louis","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"Maillard reaction alone?  The Maillard reaction would potentially explain the coloration and the superficiality.  It does not explain other characteristics.  For that you need a uniform linear transfer mechanism of a reagent that would react with the surface layer in a very limited way since it can’t propagate too far without blurring the image.  It has to be collimated so that you’ll get resolution, and the reagent must disappear or be rendered non-reactive by transfer through nominally four centimeters of air.  \nThe collimation mechanism may be gravity or the electrostatic field (those are the two most obvious fields available).  The reagent might be materials in a water solution used to pat clean the body which came off the body in a very fine microaerosol which was neutralized as it was transported through air.  Some such process would potentially duplicate the image.\nProblems are that ordinary gas diffusion would normally tend to blur the image although a massive enough reagent would not diffuse as much and might solve the problem.  What I don’t think is particularly justified is a miraculous hypothesis both because the image isn’t perfect and there are image lacuna which suggest the image take up sensitivity is yarn dependent.  It might simply be a combination of rare characteristics that coming together allowed the image to be formed.  I tend to think of these kinds of events as miracles of the 2nd kind (not supernatural, but extraordinary because of the required cooperation of many natural but rare events).\n\n","date":"May 19, 2013 at 11:04 am","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34036","author":"rschneider42","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"the only way that you would have a similar image as on the shroud is if the pig rose from the dead\n\n","date":"May 17, 2013 at 5:55 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-33905","author":"Paul","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"I was a bit disappointed in the pig experiment. If Maillard is the cause of the image, then it seems to need very specific but as yet unknown environmental conditions, such as temperature, humidity, duration in contact with body, maybe tomb darkness, to work.  Maybe the cloth needs to be moist, and whether it is merely draped, or wrapped and bound are factors. I had the impression that this one-off experiment was conducted in the open air with little apparent attempt to control these conditions.  As I’ve often mentioned previously on this blog, the most successful attempts to produce credible images that I know of are by Giovanna De Liso working for 12 years in the seismically active area of Piedmont. Earthquakes release a heavy, mildly radioactive, chemically inert gas, radon, and possibly the radioactivity of radon is needed for Maillard to produce an image. Recall that the gospel accounts relate that an earthquake occurred immediately after the crucifixion. I have yet to be persuaded that Maillard is indeed the answer, although Barrie claims he saw signs of similarity at the microscopic level. The only way that Maillard can be conclusively proven or disproven to my way of thinking, is to run an experiment with several traumatised lab rats or other small animals, with a full range of controlled environmental variables. The question of how the linen has been processed and treated also needs to conform with the ancient method. If such an experiment failed to produce a credible image, then other hypotheses, perhaps involving seismic activity, need to be seriously considered.\n\n","date":"May 17, 2013 at 11:46 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-33916","author":"daveb of wellington nz","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"Quote :  “If such an experiment failed to produce a credible image, then other hypotheses, perhaps involving seismic activity, need to be seriously considered.”\nComment :  Maybe OR more experiments need to be done concerning the Maillard reaction while changing the environmental conditions and/or the conditions of the linen cloth itself each time in order to see if a much better image can be produced at the surface of the cloth.\nThere are so many unknown factors that we will never know that it is statistically almost impossible for a researcher to reproduced all the environmental conditions and the conditions of the linen cloth with a 100% level of success.  In such a bad context, how in the world can we take just one single experiment like the one that was done in the program (I have not watched it but I will) and conclude that this is a sure proof that the Maillard reaction hypothesis of Rogers cannot explain the image on the Shroud or to conclude that we must seek elsewhere in order to find a better explanation?\nMuch more researches under good lab conditions must be done to check out Rogers’ hypothesis properly…\n\n","date":"May 18, 2013 at 4:33 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-33968","author":"Yannick Clément","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"One never knows what ends up on the cutting room floor during editing, but even for a one-off, some type of side by side control group is relevant (essential) to compare it to:\n1. a non Saponaria-treated piece of cloth on a pig \nor\n2. a Saponaria-treated piece of cloth that is not draped over a pig\nEven with 1 & 2 mentioned above, and realizing this is a tv program, with time constraints and emphasis on sound byte-type conclusions, the effort of going towards original experimentation is an encouraging direction-it would be great to see some follow up on this.\n\n","date":"May 18, 2013 at 6:48 am","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-33933","author":"Kelly Kearse","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"I thought also that the move towards experimental observation was encouraging.  I thought the cloth should have been draped across features of the pig that might create an image rather than just a stain, like some articulated part of the head.  None of the examples in the piece were striking unless strikingly wrong is a criteria.  There are lots of arguments against the photography example that go beyond the lack of silver on the cloth and the bas-relief rubbing is a total loser and frankly looked it on the video.  The lack of gradient in the maillard experiment didn’t recommend it very much in the video but at least the discoloration seems to have something like the right characteristics.\nAll in all the emphasis on experiment and comparison may be the best features of the piece.\n\n","date":"May 18, 2013 at 7:17 am","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-33935","author":"rschneider42","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"Great comments by Daveb, Kelly and Ray!  Watch for the next update on shroud.com (due at the end of this month) for an article titled, “Behind the Scenes of a New Smithsonian Channel Shroud Documentary” in which I will give some details on the techniques the producers used for creating the program.\n\n","date":"May 18, 2013 at 3:20 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-33963","author":"Barrie Schwortz","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"Further possible required condition for Maillard: It has to be asked if there was a burial ritual or some other cause which modified the pH (Hyrogen+ ion) of the cloth which may have been essential to formation of an image. What about the effects of specific herbs and spices? There were about 100 lbs of these (Jn 19:19). How were they disposed about the body? Not known! Speculations, yes – Specific factual information, no!\n\n","date":"May 18, 2013 at 4:25 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-33967","author":"daveb of wellington nz","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"Concerning the disposition of the corpse inside the Shroud, I was VERY HAPPY the other day to read on Mario Latendresse’s website that he will do a new 3D analysis in order to learn more about that!  This is an excellent news because that’s one thing that can (and should) be done before a new series of direct tests can be allowed on the Shroud itself.\nOne more kind of experiment that could (and should) be performed before anyone get to Turin to analyse the Shroud itself would be, for a specialist in ancient textile, to reproduce some linen shrouds with all the known methods of making a linen cloth in Antiquity and in Medieval time in order to compare the resulting shrouds with the known data coming from the Shroud of Turin.  This could greatly help us to learn what was the most probable method used to produce the Shroud of Turin and what kind of impact this could have had on the image formation process.  Remember that if Ray Rogers’ conclusion was right concerning the ancient method used to make the Shroud, that would mean it really had a huge impact on the image formation.\nFor more infos about Mario’s future experiments, go to his website :  http://www.sindonology.org\n\n","date":"May 18, 2013 at 4:44 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-33969","author":"Yannick Clément","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"I was a bit disappointed in the pig experiment. If Maillard is the cause of the image, then it seems to need very specific but as yet unknown environmental conditions, such as temperature, humidity, duration in contact with body, maybe tomb darkness, to work.\nNot only that, but even if some of the pig’s physiology is very close to human ( niot that close, but closer than other mammals) it is a pig, not a human – therefore the possibility of miscalculations in the experiment are huge.\n\n","date":"May 18, 2013 at 6:16 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-33980","author":"jesterof","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"I agree.  Also, one VERY IMPORTANT factor to never forget concerning the Shroud and this could well have had a huge impact in the formation of a body image on the cloth :  This was a highly tortured and crucified corpse that was placed in that cloth and not any normal corpse that would have die of a natural cause.  No doubt that the biological state of this particular corpse was VERY DIFFERENT than any body that would have died of a natural cause.  The very probable presence of a high level of bilirubin in the blood of the Shroud man at the time of his death is only one major biological difference that we know of, but there were most certainly many other important biological differences in the composition of the blood, sweat and other body tissues that could have played potentially a major role in the formation of the body image on the Shroud and, of course, these biological factors were not reproduced in the experiment that was done with the pig…  No doubt that, along with the unkown environmental conditions at the place of execution and inside the tomb and also the still not fully determined chemical aspect of the linen cloth itself, the exact biological state of the Shroud man’s corpse when it was placed inside the Shroud is a very important unknown reality that render things very difficult for anybody who wants to reproduce the body image we see on the Shroud on another linen Shroud.\n\n","date":"May 18, 2013 at 6:38 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-33981","author":"Yannick Clément","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"Yes, Yannick, very valid point.\n\n","date":"May 18, 2013 at 9:11 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-33992","author":"jesterof","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"Use traumatised rats! Get the vermin! Think of the advantages and savings! Small animals, small cloths, several of them so you can vary the environmental conditions to order. Try different cloths. If Maillard is at all a goer, it’ll show up! If not you’ll have to look for another explanation. They have earthquakes in California, you could try it over there! Low cost experiment! Whose going to want to eat a pig that’s been used in some experiment anyway? If you get anough rats, you can even have controls! We use models all the time in engineering! We even try out model hulls in my old School of Engineering Hydralics Lab for Team NZ in the America Cup Race! Giovanna DeLiso used a snake for his seismic investigations in Piedmont, and obtained the best images yet!\n\n","date":"May 19, 2013 at 1:55 am","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34018","author":"daveb of wellington nz","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"Please,no blood sacrifices in the realm of Shroud studies.\n\n","date":"May 19, 2013 at 9:15 am","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34030","author":"Louis","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"you want PETA on your tail? ;-)\n\n","date":"May 19, 2013 at 11:04 am","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34035","author":"jesterof","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"Ray Schneider :Maillard reaction alone?…. What I don’t think is particularly justified is a miraculous hypothesis both because the image isn’t perfect and there are image lacuna which suggest the image take up sensitivity is yarn dependent…. I tend to think of these kinds of events as miracles of the 2nd kind (not supernatural, but extraordinary because of the required cooperation of many natural but rare events)\n*************************\nWhile my background is not science, we have something in common: going for Jesuit retreats, and, in my case, surrounded by German Jesuit priests and lay brothers, almost all WW II veterans, having fought as soldiers and pilots in the Reichwehr and Luftwaffe. Very tough hombres, so the lessons in spirituality given by the priests came together with lessons in discipline and dedication to a cause by the lay brothers….\nMaillard reaction alone? : That query was prompted by comments written a few months ago suggesting that it could explain how the image was formed and the rest was redundant.\nMiraculous hypothesis: That’s right, it can not be taken for granted. The last question in the interview-article “Science and religion meet in Shroud research” on the HSG website has roughly something to do with this.    \nMiracles of the 2nd kind: That was what was meant by saying “indirectly observed on the Shroud” in the above-mentioned interview.\nBeing Christian, I think the Resurrection can be “felt” and not “seen”. Relic-based faith is no faith at all.\nBest.\n\n","date":"May 19, 2013 at 12:08 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34037","author":"Louis","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"“Relic-based faith is no faith at all.” — said Louis.  I don’t think that faith is baseless.  That is unwarranted.  Moreover it is also somewhat irrelevant.  The question is how the image got on the shroud and what kind of image is it?  This is a question of fact which can be explored with science and technology.  The testimony of the shroud is something else.  It is a kind of 1st century photograph of Jesus Christ if it is authentic.  It has been called the Fifth Gospel for it tells the story of the passion rather directly.  That however is a religious matter and largely outside the competence of science.\nThe apostle Thomas had to see Christ risen and put his hand into his side before he would believe.  Those who believe with less evidence are not thereby better, although Jesus describes them as “blessed”.  What is important is the truth and the truth demands evidence. “Faith without works is dead” said James.  Perhaps that could be construed to also mean that faith motivates the work needed to gain understanding.\n\n","date":"May 19, 2013 at 1:04 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34039","author":"rschneider42","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"We will be laughed out of court if relics are presented as evidence to justify faith and that is why the Catholic Church treats the Shroud as a secondary matter. Suppose the relic is “proved” to be the burial cloth of Jesus, that is, we have found Alan Adler’s “lab test for Christ-ness”, what else will be expected? A dead Jesus who left his image on the Shroud does not prove anything because we know that he was a historical figure. So, people will ask if anything can be seen to prove “the third day he rose from the dead” in the Creed. If yes, great, if not, why.\nThat is where science comes in, to tell us what can and can not be seen.\nThere is a lot more in the box when it comes to faith, as “Fides et Ratio” penned by John Paul II demonstrates. It is an important document by a pontiff who was also a philosopher and used by the late Cardinal Avery Dulles in his own papers on theology. Christians will have a tougher time in post-Christian Europe, and the trend is slowly spreading to the US…\n\n","date":"May 19, 2013 at 1:26 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34040","author":"Louis","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"The problem of course is that you are the one that raised this red-herring of an issue.  No one, at least not me, raised any such argument and certainly there is no test for “Christ” but that’s irrelevant the question whether the Shroud of Turin is consistent with being the burial cloth of Christ.  That’s rather a different question.\nThe Resurrection was the central message of the gospel from the beginning.  One can’t prove the Resurrection from the Shroud of Turin.  Lazarus was not resurrected.  He was resuscitated.\n\n","date":"May 19, 2013 at 1:55 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34044","author":"rschneider42","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"No herring can be seen there because there are many issues involved. Whatever science discovers will automatically lead to more interpretations, theology and what not. At this stage, mind you, the TS is already being used for a very different purpose, as you can see if you read “The Quest for Jesus in Shroud research” on the HSG website.\n\n","date":"May 19, 2013 at 2:15 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34047","author":"Louis","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"\nLouis :\nChristians will have a tougher time in post-Christian Europe, and the trend is slowly spreading to the US…\n\nIsn’t that as it is supposed to be?\nas for the scientific proof of Resurrection. Even if it is possible to prove scientifically the Resurrection of the Man of the Shroud, it will still leave behind a lot of unbelievers – that is human nature…the resurrection of the Lazarus was viewed by crowds, yet there still were those who weren’t swayed…\n\n","date":"May 19, 2013 at 1:47 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34042","author":"jesterof","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"That’s right, in keeping with Luke 16:31, but it doesn’t seem that everyone in the pro-authenticity camp will agree.\n\n","date":"May 19, 2013 at 2:05 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34045","author":"Louis","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"Of course the difference between resurrection and resuscitation is that the person resuscitated dies again.\n\n","date":"May 19, 2013 at 2:28 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34049","author":"rschneider42","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"Jesterof said the crowds were not swayed in the case of Lazarus, so neither will they be swayed in the case of the TS. One is prompted to add: not only because of human nature; there are many more questions to answer…\n\n","date":"May 19, 2013 at 3:00 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34053","author":"Louis","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"Well, of course. It doesn’t seem that people have the tendency to agree even on the mutually viewed events unfolding, leave alone the connection between the Shroud and the Faith.\nI am more in the camp which tends to agree with this :For those who believe, no explanation is necessary. For those who do not believe, no explanation is will suffice.\nBut that does not mean I do not want to find out from the scientific point of view all secrets of the Shroud.\n\n","date":"May 19, 2013 at 2:11 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34046","author":"jesterof","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"That’s right again, roughly what I think.\n\n","date":"May 19, 2013 at 2:18 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34048","author":"Louis","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"\nrschneider42 :\nOf course the difference between resurrection and resuscitation is that the person resuscitated dies again.\n\nand who was resuscitated?\nbtw, person resuscitated dies again, but not necessarily in short time after resuscitation\n\n","date":"May 19, 2013 at 3:10 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34055","author":"jesterof","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"Quote : “and who was resuscitated?”\nAnswer :  Jairus daughter, the son of the widow of Nain and Lazarus, but I thought you already knew the answer…  \nHave you noticed that all three people “resuscitated” by Jesus (I prefer the term “re-animated” by the way) were all human beings who died way “too soon”, at an early age?  This fact has always struck me…  I think it is another very good sign of the extreme compassion of God, who is always deeply touched by the injustice suffered by small and poor.  God is love and nothing else my friends and he want to save every one of his beloved children.  And don’t worry, he will succeed because God’s plan on creation is a plan of love and happiness and nothing else.  And these three “resuscitations” are all great signs of this.\n\n","date":"May 19, 2013 at 5:17 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34066","author":"Yannick Clément","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"After having seen the TV program, I have some good comments to make :\n1- In the program, there are two huge historical mistakes :  1- The program seem to suggest that Geoffroy de Charny was some kind of an obscure knight when he became in possession of the Shroud, which is totally false.  In fact, de Charny was one of the leading knight of all the kingdom of France when he build the Lirey church.  And 2- The program tell us that de Charny claimed he get the Shroud during a crusade he made, which is also totally false.  In fact, de Charny NEVER SAID A WORD about how and when he became in possession of the Shroud.  It’s also very important to understand that de Charny never participate in the 4th crusade, which saw the Latin crusaders making the sack of Constantinople.  This terrible event, which most probably lead to the transfer of the Shroud from that city to Europe, happened a century before de Charny’s time.  The only crusade in which Geoffroy de Charny participated is the Smyrna crusade in 1346 and it’s highly improbable that he could have come in possession of the Shroud at that occasion, no matter what Ian Wilson and other “historians” can think.\n2- Once again (history always seem to repeats itself), Garlaschelli and Allen didn’t said a damn word about their incapacity to reproduce the forensically accurate bloodstains and scourge marks we see on the Shroud.  I think these guys should read carefully the paper I wrote concerning the evidence of the bloodstains (link : http://shroud.com/pdfs/n76part5.pdf).  How in the world can they pretend having succeed to reproduced the Shroud, while at the same time, they completely failed to reproduced the bloodstains we see on the cloth with any kind of credibility whatsoever?  Here’s a good question for them:  How in the world someone in medieval time could have artificially produced the forensically accurate bloodstains and scourge marks we see everywhere on the Shroud, while it is a well-known fact that the exact Roman method of crucifixion was at the very least partially unknown at the time (the nails driven in the wrist instead of in the palms is just one example of this)?  Obviously, in order to produce the bloodstains and scourge marks we see on the Shroud, a forger would have needed to scourge and crucified a real man with the exact Roman method of crucifixion.  Not only did such a gruesome idea is ridiculous when you think that our medieval forger did not needed to go that far to produce a false Christian relic (some drops of animal blood in liquid form could have easily do the job), but it is also completely ridiculous to imagine that our forger would have wait until the bloodstains were completely or partially dried before placing his corpse inside the Shroud, while he would have been anxious to leave some clear bloodstains on the cloth in order to reproduce  the stigmata of Christ.  In sum, the simple fact that Garlaschelli and Allen were, once again, not able to reproduce the bloodstains and scourge marks we see on the Shroud is well enough to understand that their work is NOT a replica of the Shroud.\n3- For those of you who pretend that Barrie’s experiment with the pig can be seen as some kind of proof that the Maillard reaction hypothesis is false or cannot, alone, pretend to explain the body image on the Shroud because he wasn’t able to get a clear image on his linen cloth, I have this important comment to make :  Barrie did not baked his linen sample in the same way Garlaschelli did with his artistic image in order to reproduce ageing, which is why no image whatsoever could be seen on his linen cloth.  If you read again the part of Rogers book in which he present the very good coloration result he obtained in a lab experiment he did with an old-fashion linen sample that was exposed for a time to ammoniac gases (this is, for me, the closest matching result ever obtained by anybody concerning the coloration of linen fibers like we see on the Shroud), you will note that he specifically said that it was only after he baked his linen sample to simulate ageing that a clear coloration could be seen at the surface of the cloth to the naked eye.  I’m certain that if Barrie would have baked his linen sample, a visible image would have appeared on the cloth.  I don’t pretend the image of the pig would have been as good as the body image on the Shroud (in fact, I’m sure it would not because of the conditions in which Barrie did his experiment), but I’m certain we would have seen a faint yellow coloration at the surface of the cloth that would have shown a pretty good chemical and physical match with many aspects of the body image we see on the Shroud.  In sum, the fact that no image was clearly visible on the cloth right after Barrie’s experiment can be seen as another good confirmation of an hypothesis first described by Paul Vignon if I remember well (and backed-up by Rogers later on), which state that the image on the Shroud is most probably a latent image that only developed at the surface of the cloth after some time.  Note that this probable fact can easily explain why there is absolutely no mention in the Gospels of a body image on the Shroud of Christ after the Resurrection.  The probable fact that there was no visible image right after the event (pretty much like there was no clear image on Barrie’s linen sample), along with the probable fact that this gruesome and bloody burial cloth was hidden well soon after it was discovered and kept by the disciples on Easter morning is the most rational explanation for why there is no mention in the Gospels of a body image on the Shroud of Christ.  In such a context of hiding, it’s very probable that the latent image only started to become visible to the naked eye many years after the Resurrection event, at a time when the cloth was most probably kept hidden in the dark, which probably mean that no one (not even those who were keeping it hidden) was able to noticed it on the cloth.  This pretty funny situation could well have last for many years, decades and even centuries after the Resurrection…  All this reflection of mine is true of course only if the Shroud is truly the authentic shroud of Jesus-Christ.  In the end, when it comes to the body image we see on the Shroud, it’s very probable that the disciples of Jesus were not able to distinguish any clear image on the cloth on Easter morning, no more than Barrie was able to distinguish any clear image on the linen cloth he used for his experiment.  Time is a very important factor in the production of a Maillard image coming from the close proximity of a linen cloth made the ancient way and a fresh corpse and, in the case of Barrie’s experiment and also in the case of the disciples of Jesus on Easter morning, there was not enough time that had been spent for a clear image to get formed on their cloths.  In my mind, Barrie’s result can truly been see as another clue that tend to back-up the hypothesis of a latent image that come from a natural image formation, which imply, at least for a part that remain to be know, a Maillard reaction at the surface of the cloth… The main problem that remains to be solved is, of course, the question regarding the very high resolution of the image.  That’s why more researches that involve a Maillard reaction (like the one done by Barrie) are truly needed to get closer to the truth regarding the Shroud image.  And it’s important to understand that such researches will need to be done in the future with some baking of the linen samples to simulate ageing and to clearly see an image at the surface of the linen cloth.\n4- Obviously, Barrie’s experiment with a pig and a tiny linen sample left in open air is very far from having reproduced the most probable environmental conditions that were present inside the tomb when the image formation process was active.  For this reason, any image result that can come out of this kind of experiment cannot be consider as a proof of anything.  In my mind, the only good result obtained by Barrie that can be consider seriously versus the Shroud image (and it’s a huge one) is the fact that he was able to prove that if we take a linen cloth made with an ancient method that leave a carbohydrate layer at the surface of it and we place it over fresh corpse for more than 24 hours, a Maillard reaction will start, which will lead to the coloration of some fibers that look pretty much like we see on the Shroud.  This is great because that tend to confirm Rogers’ claim that “when amines and reducing sugars come together, they will react. They will produce a color. This is not a hypothesis: this is a fact. A cloth with crude starch on it (note that Rogers could also have said : “a cloth with a carbohydrate layer on it” and that would also have been correct) will ultimately produce a color, if it is left in close proximity to a decomposing body.”  Barrie’s experiment show that Rogers was right about that, which lead me to this conclusion :  It’s very hard for me to believe that the body image we see on the Shroud had nothing to do with a Maillard reaction that came from the close proximity of an ancient linen cloth with a fresh and tortured human corpse.  Important note:  I don’t pretend that a Maillard reaction, in the way described by Rogers, is the only thing that lead to the apparition of the body image on the cloth, but I’m almost certain that it took some part in it (probably a huge part).\n5- I don’t think the linen sample used by Barrie for his experiment was treated with some starch in the way described by Rogers in his book.  It’s important to note that, for Rogers, the impurity layer of carbohydrates that caused a Maillard reaction at the surface of the Shroud was mostly composed of starch, along with other residues (like some residues of saponaria and probably also some polysaccharides residues that were extracted from the primary cell wall during the retting of the flax plant).  It would be a very good idea for a researcher to do another experiment like the one done by Barrie but, this time, with a pre-treatment of the linen cloth with starch.  If we believe Rogers, such an experiment would give an even better result than the one obtained by Barrie…  And, this time, I hope the researcher who would do this kind of experiment would think of baking his sample after the time of exposure.  There’s no doubt in my mind that he would get an image on his cloth.  The question is:  Could such a natural image show a high resolution?  In fact, the real question is this:  Under which environmental, biological and linen cloth conditions a Maillard image could present a high resolution like the one on the Shroud?  Since we’re almost sure now that a Maillard image would eventually developed at the surface of a linen cloth made with the ancient method if this cloth is placed over a fresh corpse, THAT’S THE REAL QUESTION THAT REMAIN TO BE ANSWERED.\n5- Garlaschelli said something like this in the program: “Those who doesn’t accept the validity of the C14 dating result will not accept also my theory of image formation.”  I would like to remind Mr. Garlaschelli that even if the C14 dating result of 1988 is wrong and the Shroud is much older than this, that doesn’t necessarily mean it cannot be a forgery done during the first few centuries of Christendom (let say before 500 A.D. and the first apparition of the Pantocrator icon) with the use of a real scourged and crucified corpse.  It will forever be impossible for science to clearly and definitely state who the Shroud man really is.  Because of this fact, there will forever be an openness (even though this openness doesn’t appear to be very probable) for a natural forgery scenario that would have been done with the use of a real crucified body.  Also, there will forever be an openness (very tin nevertheless) for a scenario involving the burial shroud of a real crucified man other than Jesus of Nazareth that was accidentally looking like the Jesus of the Gospel.\n6- I hope everybody who will watch this program will understand that if the Maillard reaction hypothesis for image formation proposed by Ray Rogers and partially tested by Barrie Schwortz is correct, THAT DOESN’T MEAN THE SHROUD IS SOMEONE ELSE THAN JESUS AND/OR THAT HIS RESURRECTION NEVER HAPPEN. \nAll right.  That’s all for the moment…\nYannick\n\n","date":"May 19, 2013 at 5:02 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34065","author":"Yannick Clément","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"\nYannick Clément :\nQuote : “and who was resuscitated?”\nAnswer :  Jairus daughter, the son of the widow of Nain and Lazarus, but I thought you\nalready knew the answer…  \n\nLazarus was resurrected – he was DEAD for 4 days already. I do not remember how long were the other two, but the girl, as I recollect, might have been less than an hour – so the term resuscitated might be applied, with understanding that resuscitation as a term involves actually a lot of physical activity, but I will agree for the stretch :-)\nOne can resuscitate only near-death or in the time of clinical death – up to an hour after death. After that it is resurrection only.\nSpeaking withing the medical therminology\n\n","date":"May 19, 2013 at 5:45 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34067","author":"jesterof","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"Ok… but the most important thing concerning these cases reported in the Gospels is not the medical terminology but the great sign of the unconditional love of God for every one of his beloved children that we all are, especially the most vulnerable.  That was my main point.\n\n","date":"May 19, 2013 at 6:22 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34071","author":"Yannick Clément","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"\nYannick Clément :\nHave you noticed that all three people “resuscitated” by Jesus (I prefer the term “re-animated” by the way) were all human beings who died way “too soon”, at an early age?  This fact has always struck me…  I think it is another very good sign of the extreme compassion of God, who is always deeply touched by the injustice suffered by small and poor.  God is love and nothing else my friends and he want to save every one of his beloved children.  And don’t worry, he will succeed because God’s plan on creation is a plan of love and happiness and nothing else.  And these three “resuscitations” are all great signs of this.\n\nHonestly I do not see it  that way – Lazarus clearly was not young and was sick for quite a time, so even if for his sisters ( or any family) his death would be all too soon, but per Gospel description it was not.\nI can’t use the term resuscitate on somebody already decaying for 4 days…\nIt is, probably, professional bias :-)\n\n","date":"May 19, 2013 at 5:49 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34069","author":"jesterof","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"Lazarus was most probably pretty much of the same age than Jesus…  In the Jewish context of Jesus time, to die Young like that was almost considered as a curse of God.  The miracle operated by Jesus on his friend was a way for him to set the record straight about who God really his (which is very far from any human projection).\n\n","date":"May 19, 2013 at 6:25 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34072","author":"Yannick Clément","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"\nYannick Clément :\nLazarus was most probably pretty much of the same age than Jesus…  In the Jewish\ncontext of Jesus time, to die Young like that was almost considered as a curse of God.  The miracle operated by Jesus on his friend was a way for him to set the record straight about who God really his (which is very far from any human projection).\n\nThe impression I get he was much older, but it is not that important – the resurrection of Lazarus was the way to set the record straight.\n\n","date":"May 19, 2013 at 6:57 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34074","author":"jesterof","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"In sum, the three resurrections performed by Jesus are all signs of our own resurrection that will happen after our death and that is a total free gift from God who is Love and nothing else.  The only difference between these 3 people and all of us is the fact that all three “resurrected” people had to die once again (that’s why I prefer to use the term “re-animation” but not in a medical sense), while our own resurrection will be spiritual (with a spiritual body) and will last forever.  Death and suffering will not be able to touch us no more.\n\n","date":"May 21, 2013 at 10:53 am","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34217","author":"Yannick Clément","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"there is no medical sense in re-animation. however it reminds me zombies :-)\nor whatever those creatures are – the walking dead which are supposedly re-animated by shamans in Africa.\n\n","date":"May 21, 2013 at 8:41 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34256","author":"jesterof","site":"shroudstory"},{"title":"More support for Treasures Decoded: The Turin Shroud","post":"irony aside, all resurrected three were fully functional alive people – until their second death, which does not happen with re-animation ( per my understanding the term).\nNot only did Jesus return their soul back to the body, but he healed all the illnesses they had – and that is the difference between resuscitation ( which merely restores the heartbeat and blood pressure in physical meaning or returns the soul back to the body in spiritual)but it does not heals the pais and ills which the dead person had before death.\nIn the case of all three cases of resurrection by Jesus Christ – everyone was healed.\nThat is why it is not resuscitation or reanimation – it is resurrection.\n\n","date":"May 21, 2013 at 8:46 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","id":"comment-34257","author":"jesterof","site":"shroudstory"}]
