[{"title":"My revised Model 10, proposing a key role for RADIANT (infrared) heat in generating image colour from a body imprint onto wet linen, using nothing but dry white flour.","post":"Good morning Hugh\nAll this talk of oscilloscopes as part of a VP-8 set up is complete news to me. The ones I saw in the late 50s sitting on the physics teacher’s bench at school were only capable of displaying pulsating electrical signals, and I see nothing on the wiki entry to suggest they are used for modern digitized image display.\nMention the VP-8 and I think of Pete Schumacher, a VP-8 engineer even before STURP in the late 70s. But here’s a still from a video clip of Pete  in meet-the-people mode at his Shroud exhibition centre in Alamogordo, NM. \n\nThat’s a 3D -rendered image on that display monitor, so Pete I’m pleased to see has moved with the times. Well, partly, In the video we see him altering the angle of view of the greenish Shoud face by twiddling knobs on that separate unit. You and I do the same simply by stroking a touchpad on our laptop pre-loaded with fuly-digitized ImageJ!\nSo why did Janis opt for a VP-8? What’s it got to offer that ImageJ hasn’t? One thing it doesn’t offer is a frame around the image displaying all one’s settings, a valuable resource to informed visitors to say nothing of those of us who in the past have been accused of producing fake self-serving  images (like the time I showed that painted representations in 19th century art  of Jesus recumbent on J of A’s linen responded quite well to 3D-rendering!)\nAs for Janis’s other points, I’m addressing her “unique photograph’ claim in more details today (using, not abusing ImageJ). As for the lance wound site being allegedly visible in the body image I took Giulio Fanti to task some 5 years ago for doing the same:\nhttps://shroudofturinwithoutallthehype.wordpress.com/2012/08/07/yet-more-fanti-sy-from-fanti-faccini-et-al-this-time-on-the-spear-so-called-wound/\nHis brief haughty reply (on Dan Porter’s site) was to tell me to address any objections to the Journal’s editors, which I have to say was to my way of thinking a  mechanical engineer displaying a total misunderstanding of the role of the peer-reviewed SCIENCE journal, namely to act as filter,  often less than perfect, NOT to serve as concrete wall between authors and readership.\n","date":"August 15, 2017 at 7:18 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/07/13/my-revised-model-10-proposing-a-key-role-for-radiant-infrared-heat-in-generating-image-colour-from-a-body-imprint-onto-wet-linen-using-nothing-but-dry-white-flour/","cat":"capillary_migration","id":"comment-9876","author":"Colin Berry","site":"colinberry"},{"title":"My revised Model 10, proposing a key role for RADIANT (infrared) heat in generating image colour from a body imprint onto wet linen, using nothing but dry white flour.","post":"And this is how I commented on the same presentation to Russ Breault and the Shroud Science Group:\n“The idea that the VP-8 was “not a computer but an oscilloscope” is meaningless. Although in the video you reference Kevin Moran appears to be using a fairly conventional oscilloscope to display the results of the image manipulation program, the VP-8 is not the oscilloscope but the box beside it (the computer), which converts pixels of an image into 3D co-ordinates in order for them to be displayed on the oscilloscope screen. It is certainly true that we can now control far more parameters than the VP-8 machine could, but the basic principle is identical. I thank you for Janis Winchester’s 2017 presentation, and apologise to her sincerity, but hardly a sentence of her presentation was scientifically intelligible. Sentences like “In fact it was the brightness embedded in the fabric that recorded this historical photo” are either meaningless or incorrect, depending on how they are to be interpreted. Her identification of an exit wound for the Spear is wholly untenable.”\n","date":"August 15, 2017 at 3:00 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/07/13/my-revised-model-10-proposing-a-key-role-for-radiant-infrared-heat-in-generating-image-colour-from-a-body-imprint-onto-wet-linen-using-nothing-but-dry-white-flour/","cat":"capillary_migration","id":"comment-9875","author":"Hugh Farey","site":"colinberry"},{"title":"My revised Model 10, proposing a key role for RADIANT (infrared) heat in generating image colour from a body imprint onto wet linen, using nothing but dry white flour.","post":"Have been grinding teeth these last few days, a result of seeing this abstract from Pasco, Friday July 21 :\n10:15 am to 10:35 am“Use of the VP-8 Image Analyzer with a photograph of the Shroud of Turin exhibiting 3D results” by Janis Winchester.\n (My italics)\nThis research uses a VP-8 Image Analyzer, manufactured by Interpretation Systems Inc., with a photograph of the Shroud of Turin. The image emerging on the oscilloscope of the VP-8 shows the information embedded on the fibers of the image on the Shroud of Turin. The findings detail the pattern of the discolored fibers that show wounds of a spear entrance and exit point and other marks of a man who died by crucifixion. The unique feature is the 3D appearance from the 2D photograph of the Shroud of Turin. No other photograph shows this characteristic. A thank you is extended to Shroud Researcher Mr. Kevin Moran for the use of his VP-8 Image Analyzer, and assisting with a video for this presentation.\n###################\nOK, it’s a VP-8 being used – old analogue technology – not the digital ImageJ this investigator has used on and off these last 5 years. So it’s just possible (just!) that one gets different results with the VP-8. But I doubt it somehow. That being the case it’s time to confront head on what I regard as major disinformation regarding the “uniqueness” of the Shroud image, relative to other photographs (taking that term in its widest sense to mean photographs of  real anatomy or IMPRINTS thereof). \nExpect a new posting in the next few days where I will ring the major changes on the two chief variables:\n 1. photograph of human anatomy in natural or artificial light versus imprints thereof – testing both positive AND tone-reversed negative –  and:\n2. elevation mode in  ImageJ, i.e. whether one promotes the darkest or lightest parts of the image. \nNo, the Shroud image is NOT unique as regards 3D response in ImageJ, probably VP-8 as well, as will be seen… One just needs to be less starry eyed and a wee bit more scientific – like running a proper/full set of controls!\n###################\nPS Added Thursday Aug 10\nHave just discovered that Janis Winchester has a website, one that combines sprituality, relaxation techniques etc with brief references to the Turin Shroud. \nhttp://www.shroudview.com/\nI’ve used the Comment facility to send the following:\nHello Janis\nAs a courtesy, I’m writing this to let you know that I have commented on the abstract of your presentation at Pasco on my latest posting (in the Comments, not the main posting).\n(link inserted)\nAs stated, your views on the uniqueness of the Shroud’s 3D ‘properties’ are ones I have seen many times before from any number of Shroud authorities, indeed from STURP’s John Jackson and John Heller no less, but have to say I totally reject, for reasons I’ll be setting out in my next posting. The so-called “3D properties” are a standard feature of any imprint that is entered into software specifically programmed to elevate image density onto a new artificially-created z axis perpendicular to the original 2D x-y plane. Naturally, one has to accept the Shroud body image as an imprint – not a protophotograph . Frankly I consider that a head-to-head image of a man’s body – frontal and dorsal- can be nothing but an imprint , unless proved conclusively otherwise with conventional physics and chemistry. Starting with a one-off, untestable, non-falsifiable miraculous event (resurrectional incandescence with outburst of allegedly image-creating radiation) and then ‘bolting on’ conventional science is not science in my view. I shall be candid: it’s pseudoscience masquerading as science, and you Janis, despite your forensic background are now part of the problem, not the solution.\n","date":"August 9, 2017 at 6:07 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/07/13/my-revised-model-10-proposing-a-key-role-for-radiant-infrared-heat-in-generating-image-colour-from-a-body-imprint-onto-wet-linen-using-nothing-but-dry-white-flour/","cat":"capillary_migration","id":"comment-9855","author":"Colin Berry","site":"colinberry"},{"title":"My revised Model 10, proposing a key role for RADIANT (infrared) heat in generating image colour from a body imprint onto wet linen, using nothing but dry white flour.","post":"Ah! The latest page. I must confess I only found this after I had posted my comment to James Bond. More later…\n","date":"July 26, 2017 at 1:40 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/07/13/my-revised-model-10-proposing-a-key-role-for-radiant-infrared-heat-in-generating-image-colour-from-a-body-imprint-onto-wet-linen-using-nothing-but-dry-white-flour/","cat":"capillary_migration","id":"comment-9803","author":"Hugh Farey","site":"colinberry"}]
