[{"title":"Mystery as Proof","post":"There is among those who have studied a the Shroud a fallacious intellectual modesty. We do not order our lives by reasonable doubt, but I believe the doubt as to the Shroud’s authenticity and the Resurrection is arguably unreasonable. Faith not founded on fact  is not faith but superstition. That’s fighting words to some. Similarly, skepticism not founded on fact is not true skepticism but pseudo-skepticism.\nThe atheist and the agnostic reject the possibility of Resurrection, but the Resurrection is, or is not, a fact. The faith that the Resurrection is real is founded on facts as reported in five written accounts and in the sudden transformation of a group of cowering disciples who became inflamed with great courage unto death. And then there is the Shroud of Turin.\nIs the evidence circumstantial: yes. But other than the unprecedented nature of the event what is the proof that it did not happen. The Universe was created when a incredibly tiny “singularity” blossomed into a tiny bit of matter of incredible, virtually immeasurable heat and began the expansion that we are still experiencing to date. Anybody witness that? Where’s the proof? Does any one have the power to repeat it? Yet most educated humans and scientists now accept it as a fact. I certainly do.\nThe Shroud of Turin is a fact. I believe it’s authenticity has been established as a fact and that authenticity is as the burial cloth of a person whose existence is an historical fact. \nThere are some fundamentalist and even some not so fundamentalist who still protest to faith that is not science and therefore believe on faith. If that comforts you, that’s fine. But the time as come to understand that science and religion are no longer running on parallel courses. The issues science is grappling with including, inter alia, the nature of human conscience are religious issues. \nA reporter for Rolling Stone who covered the STURP team in Turin in 1978  wrote that apart from proposed carbon dating, there was as much room for doubt as to the authenticity of the Shroud as there was on a “crowded microdot.” And he rejected Christ’s divinity. That was before the STURP team published its results and before the C14 fiasco. There is no substantial evidence that the Shroud is a forgery and there is no evidence of any kind that it was other than the burial cloth of Jesus,we call Christ.\nThe microdot is even more crowded  today.\n\n","date":"December 12, 2013 at 6:42 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58305","author":"John Klotz","site":"shroudstory"},{"title":"Mystery as Proof","post":"Correction: We do not order our lives by PROOF BEYOND  reasonable doubt.\n\n","date":"December 12, 2013 at 6:47 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58308","author":"John Klotz","site":"shroudstory"},{"title":"Mystery as Proof","post":"‘Skepticism not founded on fact is not true skepticism but pseudo-skepticism.’  Come on, John!  The OUP defines scepticism ( as one of its definitions) ‘ ‘Doubt as to the truth of some assertion or supposed fact’. ‘Doubt’ is the key word. It simply means that in a specific case the ‘facts’ are not established fully enough for them to be accepted as true-  they may or may not be. It is is a perfectly honourable position to take. A ‘pseudo-sceptic’ would be someone who claims that they are sceptical about something when in fact they believe it to be true.\nIt is one of the virtues of Dan’s blog that one can express sceptical views about particularly assertions about the Shroud and the benefits are obvious from the debates that follow. Compare Stephen Jones’ blog where nobody dares say anything and there is simply no debate – I know which I prefer which is why I look in on this blog but would never bother with Stephen Jones..\nSo please don’t denigrate the honest sceptics- those who really don’t know because the evidence is, as yet, inadequate. By posing questions ,they may actually lead to new insights about the Shroud.\n\n","date":"December 12, 2013 at 7:04 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58315","author":"Charles Freeman","site":"shroudstory"},{"title":"Mystery as Proof","post":"another correction: “human conscience” = human self consciousness\n\n","date":"December 12, 2013 at 7:40 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58333","author":"John Klotz","site":"shroudstory"},{"title":"Mystery as Proof","post":"It is as mysterious as the creation of the universe.What mere man can copy that and then explain how he did it. I agree with story, the true success of STURP was in proving it to this day as a mystery\n\n","date":"December 12, 2013 at 6:49 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58309","author":"Vincenzo Giovanni Ruello","site":"shroudstory"},{"title":"Mystery as Proof","post":"Charles,\nDoubt as to facts must itself be based on facts. I approach the proof of facts as someone schooled in law. Even Richard Dawkins accepts, even advances, proof by circumstantial evidence. The issue is when does the burden of proof change. When proven facts lead to a conclusion, to rebut that conclusion, you need proven  contrary facts. \nOf course, you may reject some facts has unproven. However, save for the C14 tests which have been rebutted conclusively IMVHO (in my very humble opinion expressed as irony) there are no other facts except the argument that Dawkins scoffs at: Argument from Incredulousness.\nI am trying to get the first and by far longest part of my manuscript concluded, at the outside by Christmas. Then comes the second, shorter part: Christ and the Quantum. By Ash Wednesday perhaps I’ll be ready for at least Kindle, Nook or other E-Book formats. Then will the fur fly (hopefully).\nNow I have to run to a required CLE course so that I can continue my registration as an attorney in NYS – probably for the last time.\n\n","date":"December 12, 2013 at 7:26 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58328","author":"John Klotz","site":"shroudstory"},{"title":"Mystery as Proof","post":"‘Doubt as to facts must itself be based on facts.’ Well, we shall just have to disagree on that. I would suggest that that is philosophically untenable- surely as an attorney you doubt some of the stories you hear because they appear to be implausible or self-serving without having any alternative facts with which to disprove them.You just say, surely, ‘I doubt your account’.\n The important thing is we don’t shut each other up. I really value scepticism as without it we can hardly  make any progress, not least in trying to understand the Shroud.\nI am intrigued to know why  the fur might  fly when your book is published? -or perhaps I should not ask you to give your secrets away at this stage and we shall just have to wait until Ash Wednesday!\n\n","date":"December 12, 2013 at 7:44 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58334","author":"Charles Freeman","site":"shroudstory"},{"title":"Mystery as Proof","post":"No, his doubt in such a situation is based on the known facts — patterns, if you will — of human behavior.  Plausibility is a comparative concept and is dependent on knowledge.  Whether we realize it consciously or not, human beings have a vast data warehouse against which we compare our every observation.  So, saying “I doubt your account” is really saying “Your explanation does not comport with the facts as I understand them” or perhaps “Your account is inconsistent with my previous observations of human behavior.”\n\n","date":"December 12, 2013 at 10:56 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58407","author":"Jeff","site":"shroudstory"},{"title":"Mystery as Proof","post":"The limit is thin between mystery and ignorance.\n\n","date":"December 12, 2013 at 8:07 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58345","author":"anoxie","site":"shroudstory"},{"title":"Mystery as Proof","post":"‘The limit is thin between mystery and ignorance.’ If this was a philosophy blog, we would have a wonderful debate on this one- I would certainly enjoy analysing what it does or even might mean!\n\n","date":"December 12, 2013 at 9:13 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58363","author":"Charles Freeman","site":"shroudstory"},{"title":"Mystery as Proof","post":"Mystery : “there are no chemical or physical methods known which can account for the totality of the image, nor can any combination of physical, chemical, biological or medical circumstances explain the image adequately.”\nIgnorance : “there could be a thin reactive layer on external fibers.”\n\n","date":"December 12, 2013 at 3:12 pm","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58492","author":"anoxie","site":"shroudstory"},{"title":"Mystery as Proof","post":"Charles,\nThe second part of my book will explore the issues raised in a piece I blogged sometime ago:\nhttp://johnklotz.blogspot.com/2012/08/michael-redux-quantum-mechanics.html\n\n","date":"December 12, 2013 at 8:11 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58347","author":"John Klotz","site":"shroudstory"},{"title":"Mystery as Proof","post":"John. I am sure that it will be an interesting contribution so good luck with finding a way of publishing it.\n\n","date":"December 12, 2013 at 2:41 pm","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58481","author":"Charles Freeman","site":"shroudstory"},{"title":"Mystery as Proof","post":"John\nMax Tegmark in his new book, “Our Mathematical Universe-My Quest for the Ultimate Nature of Reality” takes on Penrose and his quantum brain idea saying that it’s killed by decoherenc.\n\n","date":"September 13, 2014 at 10:12 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-150711","author":"John Green","site":"shroudstory"},{"title":"Mystery as Proof","post":"Parascience, id est, quantam mechanics/cosmology has a better chance of convincing the masses how the image was formed rather than conventional science\n\n","date":"December 12, 2013 at 11:00 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58409","author":"michaeljude","site":"shroudstory"},{"title":"Mystery as Proof","post":"Jesus purportedly was crucified to forgive sins. Science can explain the mechanics of sin? This one aspect, real or not, fact or fiction cannot be ignored when attempting to determine the source of the image\n\n","date":"December 12, 2013 at 11:25 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58422","author":"michaeljude","site":"shroudstory"},{"title":"Mystery as Proof","post":"Michael, we will buy your book if we want to. We are probably less inclined to do so because you are tossing out teasers. Here in this blog we tend to say what we have to say. \n\n","date":"December 12, 2013 at 3:24 pm","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58495","author":"Dan","site":"shroudstory"},{"title":"Mystery as Proof","post":"I appreciate the kind words and offer to buy the book, however, that is not any degree of priority with me whatsoever. I am the first to confess the book is NOT an easy read and would need some rewriting to make it more commercially viable. For this and other reasons I unwittingly throw out ‘teasers’. Then there is the matter of ‘what’ inspired me to write the book. The book is a first-hand, factual account of an event that involved the supernatural and what I later came to recognize as cosmology. The event redefines the word bizarre but did capture the interest of 2 Jesuit priests and an associate of one of theirs who specialized in religious phenomena.\n\n","date":"December 13, 2013 at 9:40 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58816","author":"michael jude","site":"shroudstory"},{"title":"Mystery as Proof","post":"Please Only Discuss Michael Jude’s Book and Claims HERE\n\n","date":"December 13, 2013 at 1:01 pm","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58903","author":"Dan","site":"shroudstory"},{"title":"Mystery as Proof","post":"Michael,\nPope Benedict that well known radical has written about Genesis as allegory and expressed concern about the doctrine of original sin.\nAt least one Catholic academic has called original sin original selfishness which was one of the driving forces of evolution. Science has much to teach us. Just as we have to “put aside childish things” as we mature, we have to come to grips with actual, not allegorical history.\nI do not fear for either the Church or Christ. Becsue where science is heading whether it realizes it or not is the universal creative power of love. Yup, I wrote love.\nBy the way, my screen is distintegrtaing before my very eyes so I hope this transmits well.\n\n","date":"December 12, 2013 at 5:06 pm","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58522","author":"John Klotz","site":"shroudstory"},{"title":"Mystery as Proof","post":"I submitted this to Dan a few months ago.  It is a little video called “The Mystery is the Message.”  https://vimeo.com/71629598\n\n","date":"December 12, 2013 at 2:55 pm","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58484","author":"Russ Breault","site":"shroudstory"},{"title":"Mystery as Proof","post":"John, the doubts about original sin are joined by those about the original couple.\n\n","date":"December 13, 2013 at 8:24 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58782","author":"Louis","site":"shroudstory"},{"title":"Mystery as Proof","post":"Louis,\nI am not sure where you are coming down on this. One thing Benedict did was reference the work of Teilhard which had been banned by the Church under Pius XII. I think the story of creation-Evolution to be a glorious one. Sometimes we limit the power of the Creator by reading Scripture too literally when so much of it is allegory or metaphor.\nThat humanity was not scarred by an original scene of eating forbidden fruit is in my mind a given. But that our human nature was corrupted by the selfish intrinsic in the evolutionary process is something I can accept. \nThis is speculative metaphor, but perhaps it as if selfishness was the mold from which life evolved and when it came to humanity the mold had to be smashed. Christ was the Good Shepherd who laid down his life for his sheep. To do so as an a the ultimate act of love. No greater love has anyone than he lay down his life for another. \nThe Resurrection is the promise that sacrificing selfishness for love is not the way of death but ultimately eternal life.\n\n","date":"December 13, 2013 at 9:53 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58824","author":"John Klotz","site":"shroudstory"},{"title":"Mystery as Proof","post":"correction:\noriginal scene – original sin\n\n","date":"December 13, 2013 at 9:54 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58827","author":"John Klotz","site":"shroudstory"},{"title":"Mystery as Proof","post":"John, like you I do not fear for either the Church or Christ (#18), but the evidence for many things is inadequate, as Charles stated. We have to tread carefully because science advances in stages and a new stage may bring information showing that what was assumed in a previous one was wrong. It is not difficult to agree what you said in your first paragraph,but what about the rationale behind what is stated in the second one?\n\n","date":"December 13, 2013 at 10:43 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58848","author":"Louis","site":"shroudstory"},{"title":"Mystery as Proof","post":"Even with the accompanying accoutrement of nails in the hand, coins over the eyes, radiation, carbon dating, recitation and interpretation of biblical verses/passages and whatever else can be found in the ‘kitchen sink’ of sindonology, trying to determine how the image was made, where it originated from by focusing solely on the image alone is akin to trying to explain how a car moves by only explaining what a spark plug is\n\n","date":"December 13, 2013 at 9:44 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58820","author":"michael jude","site":"shroudstory"},{"title":"Mystery as Proof","post":"Michael,\nI agree with you but unlike others, I believe that science will one day explain the image but it will be a day when it recognizes the fact of Resurrection. So much of what we j-know today was previously explained by superstitions that science put aside. The volcano did not rfruupt because the volcano god was angry. \nScience is pushing the envelope when it studies human consciousness and finds itself looking at quantum process (as some do). Hameroff uses  quantum entanglement or action at a distance to theorize near death experiences. The best may be yet to come. Make that is to come.\n\n","date":"December 13, 2013 at 10:07 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58834","author":"John Klotz","site":"shroudstory"},{"title":"Mystery as Proof","post":"Jesus once said ” i have many more things to tell you but you cannot bear to hear them now\n\n","date":"December 13, 2013 at 9:45 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58821","author":"michael jude","site":"shroudstory"},{"title":"Mystery as Proof","post":"Louis,\nI assume you are referring to:\n“That humanity was not scarred by an original scene of eating forbidden fruit is in my mind a given. But that our human nature was corrupted by the selfish intrinsic in the evolutionary process is something I can accept.” \nThere is a reference for that is currently on the web is http://americamagazine.org/issue/350/article/evolution-evil-and-original-sin\nDomning also wrote a book with his colleague the late Moinka K. Helwig:: Domning, Daryl and Hellwig, Monika K., Original Selfishness: Original Sin and Evil in the Light of Evolution (Ashgate, 2006);\n\n","date":"December 13, 2013 at 11:20 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58861","author":"John Klotz","site":"shroudstory"},{"title":"Mystery as Proof","post":"John, thanks for the link. I will go through the article and see if there is anything to comment.\n\n","date":"December 13, 2013 at 12:37 pm","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58892","author":"Louis","site":"shroudstory"},{"title":"Mystery as Proof","post":"John,\nDomning’s evaluation of the present (2001) state of studies is very good, however he comes up with a sort of theological solution in the end that will not convince many. It was nice to see that he, too, saw a problem when it came to the first couple.\nGo to the link:\nhttps://www.academia.edu/5353803/God_science_and_religion_today\nwhich was written in 2009. You are on the right track, the track first laid out by Teilhard, but perhaps you may have to wait till more adequate evidence is available.\n\n","date":"December 13, 2013 at 2:02 pm","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58938","author":"Louis","site":"shroudstory"},{"title":"Mystery as Proof","post":"Louis,\nWhen the issue is the Resurrection, anything said today is speculation but the issue is whether the speculation is grounded in facts or just a stab in the dark. We have two great mysteries: the nature of the image of the Shroud and the Resurrection. Because I believe that the facts establish the authenticity of the Shroud, I do not believe it’s a stab  in the dark to hypothesize that the two mysteries are related. It’s a reasonable hypothesis – if you accept the possibility of Resurrection. When Hameroff hypothesizes that that human consciousness is created by the microtubules of the brain function through a quantum phenomenon, and that explains near death experiences then how many steps away are we to hypothesizing the Resurrection?\n\n","date":"December 13, 2013 at 2:27 pm","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58949","author":"John Klotz","site":"shroudstory"},{"title":"Mystery as Proof","post":"Funny you should mention Tielhard. In 1988, when I spoke to a certain Jesuit priest here, in the Philadelphia about my lifes experiences and the one in particular which led to the writing of my book he said I reminded him of / sounded like Plato, Catherine of Sienna and De Chardin……who knew?\n\n","date":"December 13, 2013 at 2:35 pm","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58954","author":"michael jude","site":"shroudstory"},{"title":"Mystery as Proof","post":"John, I see no problem in the Resurrection, only in the creation of the Universe theories, which is the reason for the suggestion to wait till adequate evidence is available. The same suggestion can apply to what has been written about near-death experiences. Right now I am reading a big, 525-page highly abstract book on philosophy for review, to be followed by another one on neuroscience, and hope to find material to “fill gaps” in what we know so far or, who knows, even leave them as they are, unable to provide answers. Your research is quite comprehensive and that is good for the line you are following.\n\n","date":"December 13, 2013 at 2:52 pm","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-58962","author":"Louis","site":"shroudstory"},{"title":"Mystery as Proof","post":"Reblogged this on Best of Shroud Story.\n\n","date":"September 13, 2014 at 4:47 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","id":"comment-150654","author":"Dan","site":"shroudstory"}]
