[{"title":"Nevertheless, the images are real enough!","post":"This doesn’t make sense. It can only apply if the Shroud is a forgery.\nAs in the case of the Maillard effect, one must ask, Why did it only happen to the body of Jesus? We would have dozens of burial cloths with images in Jerusalem.\nWas there an earthquake the instant Padre Pio held the handkerchief to his face? Was that how the image got there?: You can see a photograph in:\n https://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\nIt was also studied by Professor Pietro Baraldi of the University of Modena.\n\n","date":"November 13, 2015 at 6:18 am","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214564","author":"Louis","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"I think the readers of this blog\ncan better understand what you have\npreviously mentioned about the handkerchief\nwith the image of “Padre Pio / Jesus”.\nThis handkerchief is a special object\n(…a particular relic !!! …!?!?)\nHere a rough translation of the beginning\nof the “paranormal story” (= another\n“textile miracle”, after the Veil of Manoppello!):\n>In the fall of 1998, I received a phone call.\n>A spiritual son of Padre Pio asked me to visit him.\n><> he said. <>.\n>Padre Pio had been dead for thirty years.\n>The process of beatification was over and was known\nthe date of the solemn proclamation of his holiness.\n>I went to see the man and told me a story\nso shocking that I thinked that, at least in part,\nwas the result of his imagination.\n>I told the story in my article, but in a detached\ntone, as if to make it clear to the reader that\nI reported faithfully what I was told, but I myself\ncould not believe that these facts were true events…\n… …\nSource:\nhttp://www.lalucedimaria.it/il-volto-di-padre-pio-impresso-nel-fazzoletto-un-dono-speciale-per-un-suo-figlio-spirituale/\n— —\nBut see also the very strange\nitalian book:\n“Le Acque Cristiche: Le Acque a Luce Bianca di origine naturale”\n(Area51 Publishing, 30 June 2014)\nand\nwhat wrote Cristina Cassanelli (= a mix,\nwith paranormal claims)…\nLink:\nhttps://books.google.it/books?id=u3LsAwAAQBAJ&pg=PT13&lpg=PT13&dq=fazzoletto+Padre+Pio+Ges%C3%B9&source=bl&ots=xwWhSS2bNz&sig=3rFQlfv_-iK_e3ghlaNUXH4z-KY&hl=it&sa=X&ved=0CFIQ6AEwCmoVChMIy8fvgt6NyQIVQ0gUCh3XOgrh#v=onepage&q=fazzoletto%20Padre%20Pio%20Ges%C3%B9&f=false\nWhat was the result obtained after the analyses?\nWhere are the results obtained using an ATR-FTIR\n(…or a more advanced check = using SPM\nanalyses, etc.) control?\nIn conclusion:\nI think this miracolous handkerchief\nis a very interesting argument,\nbut (here) off of topic…\n\n","date":"November 13, 2015 at 11:39 am","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214569","author":"piero","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Sorry.\nThe previous change of graphics\nis just the result of a manipulation\nby a third part, a person unknown to me.\nIn fact I did not want to write in that\nbad manner, with that erroneous change of character!\n\n","date":"November 13, 2015 at 11:50 am","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214570","author":"piero","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Piero, please read my previous comment as well as the interview with Professor Giulio Fanti carefully.\n\n","date":"November 13, 2015 at 1:15 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214572","author":"Louis","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Louis is not a scientist, but a journalist, and I don’t believe he fully understands the complex scientific issues involved.  Padre Pio’s image of his face on a handkerchief is unlikely to have much to do with the Shroud image unless both occurred as divinely directed miracles.  Louis may believe that the Shroud image was such a miracle, and this may be correct.  However others prefer to explore scientific explanations first, if only to exclude them before coming to such a conclusion.  \nHis comment that De Liso’s work can only apply if the Shroud is a forgery is in fact what makes no sense at all.  Are we to expect that a medieval forger would be aware that seismic events had the potential to create such images, and then would wait several years before exactly the right conditions came along before he could produce such an image?  It is preposterous.  \nDe Liso’s experimental work only followed on from a theoretical hypothesis by Lattarulo, and until then no-one had even considered the possibility of a seismic origin of the image.  Her work was directed at ascertaining the possibility of a naturalistic explanation of the origin of an image within a 1st century tomb, not at whether the idea might have occurred to a medieval forger.  She makes the explicit point that such imagery was only ever obtained under certain very specific conditions and was not merely the usual expected product of every general seismic event during her 12 years of field experiments.  \nIt may just be conceivable that such imagery might have occurred with dozens of burial cloths in 1st century Jerusalem, but by the time anyone ever thought to unwrap a shroud to place the bones in an ossuary, any such imagery would have been long defaced by corruption.  This could not happen with the Shroud of Jesus, because of the fact of his resurrection, and a decision to vacate his linen wrapping within days of his death.  \nAll four gospels mention an earthquake following the crucifixion, Matthew even attributing an after-shock to the moving of the entrance stone.  This suggests that it was a real event and not merely a literary device of the evangelists. \nA critic would see some shortcomings and unfortunate omissions in De Liso’s paper, and there is much more about her experiments that would be good to know.  Unfortunately, there seems to have been little follow-up or development of her work, and those who may have been associated with it seem to have gone off on tangents with their lasers, corona discharges, bodily emission of neutrons and other miraculist theories.  \nAs wise men have often observed, it is the most difficult thing in the world to get a new idea accepted, and the pedestrian preference is to cling to familiar paths even when well-worn or else to venture into the speculative or outlandish.  Such seems to be the case with the apparent lack of follow-up to De Liso’s seismic investigations into Shroud-like imagery.  But it might just yield an answer lying dormant and waiting to be discovered.\n\n","date":"November 13, 2015 at 3:25 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214575","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Hi Daveb – Yes there is a possibility to get images during  seismic events with Radon. I don’t know whether  De Liso managed to get both frontal and dorsal images from the experiments.\n\n","date":"November 13, 2015 at 3:56 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214577","author":"Sampath Fernando","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Daveb is a retired engineer, not a scientist, while Louis has published on religion for twenty years. Many of his writings are based on research, some of it in situ. While daveb correctly mentions that complex scientific issues are invoved he does not take everything into account.\nIt is known that Jewish mourners would visit the tombs where their loved ones were buried after three days just to make sure that no one was buried alive. As I said, if earthquakes can form images they would find dozens of shrouds with images on the third day, a long time before they thought about placing bones in ossuaries.\nWith all this talk about earthquakes and radon, there is no report that there was an earthquake in Italy when Padre Pio held the handkerchief to his face. It is important to remember that the kerchief was examined by scientists, one of them a respected university professor of geology.\nThere is also no record of any earthquake in Thornton, England the day Les died, otherwise good Francis O’Leary would have mentioned it:  https://www.academia.edu/4691379/Can_the_Jospice_Mattress_imprint_be_compared_to_the_Image_on_the_Shroud\n\n","date":"November 13, 2015 at 3:58 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214578","author":"Louis","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Louis\nI don’t agree with your assertion that there should be dozens of shrouds with images if earthquakes can form images.\nFirstly, the nature of Jesus’s burial. It was a temporary burial brought on by circumstance. People were not usually buried in shrouds.\nSecondly, even if they were, we may simply not have any other shrouds with images because of the passage of time. Perhaps we have the shroud before us because it was preciously kept and guarded due its status in enshrouding Jesus.\n\n","date":"November 13, 2015 at 11:56 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214591","author":"Thomas","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"“People were not usually buried in shrouds.”\nAt Qazone, Jordan, near the Dead Sea, numerous graves were discovered dating to the 2nd Century AD;   42 pieces of shrouds were taken from 50 graves, including one intact shroud.\n“Secondly, even if they were, we may simply not have any other shrouds with images because of the passage of time.”\nThat doesn’t make sense.  In my readings on archaeology and shrouds, it is stated often that archaeologists have found hundreds of shrouds over the centuries.   Only one, from Egypt, had a partial outline, but it was caused by embalming fluids.  The Shroud remains the only one with an image.\n\n","date":"November 16, 2015 at 8:59 am","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214656","author":"Nabber","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"including one intact shroud.\nMore details, please.\nAs far as I know, Akeldama is the only one (except our Shroud of Turin) relatively “intact” 1st century Palestine burial shroud. the rest are just fragments.\n\n","date":"November 16, 2015 at 9:21 am","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214657","author":"O.K.","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Directed to Thomas:\nHello Thomas\nFirst-century Jewish burials were more complicated than is generally believed:\n https://www.academia.edu/7471287/Book_Review_The_Tomb_of_Jesus_and_His_Family_Exploring_Ancient_Jewish_Tombs_Near_Jerusalems_Walls\nQuite recently I had to point out to some “Shroudies” that a wrong image was used to accompany an article on burials in the first century and it could mislead readers. They agreed with me. The Church of the Holy Sepuchre area was honeycombed with tombs, and I believe that the tomb where Jesus was buried lies beneath the wooden planks in the middle of the church.\nAnother problem is that two burial shrouds were used till the year AD 50, when Rabban Gamaliel II changed the rule and only cloth began to be used.Of course, it is possible that Joseph of Arimathea took the only cloth he had at his disposal in the little time he had.\nI have seen stains on burial cloths, that is, strips of cloth, but these apparenty were the result of embalming fluids in Egyptian burials.\n\n","date":"November 16, 2015 at 10:16 am","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214660","author":"Louis","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Louis is quite right about the uncertainty surrounding any particular Jewish burial in the early part of the 1st century, especially one carried out in peculiar circumstances. OK is correct that there is only a single instance of a moderately intact (but badly damaged) 1st century Jewish shroud, and that too was related to an untypical burial (a rich leper). Nabber’s shrouds at Khirbet Qazone are of course Nabataean rather than Jewish, with quite a different funerary tradition. The vast majority of Jewish burials were reduced to ossuaries after a year or so, which is why there has been little opportunity to discover any Shrouds used in the interim stage.\nThere does seem to have a trend towards over-elaborate burial clothes, which Rabbi Gamaliel reversed by example rather than dictat, but apart from that there is very little evidence of what a conventional burial should have consisted of, and how far, and how often, the prescription was deviated from, either by custom circumstance. whether Jesus would have qualified for anything too elaborate, being an executed criminal, is uncertain, although he was obviously considered very special by his friends.\n\n","date":"November 16, 2015 at 1:41 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214670","author":"Hugh Farey","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"custom OR circumstance. Sorry.\n\n","date":"November 16, 2015 at 1:42 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214671","author":"Hugh Farey","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Hugh, I think you will appreciate this:\nhttp://www.holysepulchre.custodia.org/default.asp?id=4108\nIt was the Franciscan archaeologist Father Virgilio Corbo who conducted the important excavations.\n\n","date":"November 16, 2015 at 2:27 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214672","author":"Louis","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"——————-\nWhy did I not pay more attention when the paper was included in the Proceedings of the International Workshop on the Scientific approach to the Acheiropoietos Images in Frascati in 2010?\n—————–\nMaybe because the lyric singer Giovanna De Liso is more known for telling about her experiences of “alien abduction” and her photos of UFO.\nSorry: only Italian\n——–\n\nhttp://oggiscienza.it/2012/10/01/alieni-energia-piezonucleare-e-fusione-fredda/\n\n","date":"November 13, 2015 at 4:24 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214580","author":"Marco Bella","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Great, that is what I thought because the paper does not say that she is a scientist.\nNo “superstitio”, please.\n\n","date":"November 13, 2015 at 4:30 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214581","author":"Louis","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"I note that there are several different persons on the web who bear the name of Giovanna De Liso.  I have no idea as to whether the author of the paper “Shroud-like experimental image formation during seismic activity” by Giovanna de Liso. is the same person who happens to be a lyric singer, at sometime abducted by aliens, or not.  However the same author has also published a paper “Seismic Precursory Phenomenology in Unusual Animal\nBehaviour in Val Pellice, Western Piedmont, in Comparison with Anomalies of Some Physical Parameters” in the Open Journal of Earthquake Research, 2014, 3, 30-42\nPublished Online February 2014, and can be easily found on the web.  I would presume therefore that this author has some competence in investigating seismic phenomena.  As to any singing ability, I am unable to comment. \nBottom Line:  The images displayed at the top of this posting from her paper as a result of her seismic research are sufficient to prompt further investigation and I have yet to see an adequate explanation for them as a result of seismic activity. \nIt so happens that the profession of engineering requires a solid grounding in the hard sciences, whereas religious journalism does not.  Nor is any imagery appearing on the interior surface of a shroud wrapping a human corpse likely to be externally visible to any visiting mourners, whether or not the visitation occurs after an earthquake event. \nIt is easy to detract from the investigative work of others with careless comments, than it is to provide a constructive criticism of such work.\n\n","date":"November 13, 2015 at 5:25 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214582","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"I am surely not denigrating anyone!\nI enjoy classic music and I believe that Giovanna De Liso is a good singer. I can definitively say that her singing is much better that my piano playing.\n\nHowever, I am afraid I cannot share the same opinion about her “research”.\nThe publisher “scientific research” is cited here:\nhttp://scholarlyoa.com/2015/01/02/bealls-list-of-predatory-publishers-2015/ \nAnd yes, there is little doubt that the opera singer, the earthquake “researcher” and the “occasionally” alien abducted are indeed the same person.\nhttp://ocasapiens-dweb.blogautore.repubblica.it/2012/10/21/sbigottimento/\n\n","date":"November 13, 2015 at 5:53 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214583","author":"Marco Bella","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"“I have yet to see an adequate explanation for them as a result of seismic activity.”\nThat is what exactly I have been saying right from the beginning!\nReligious journalism also requires some grounding in science, as for instance when writing on Parapsychological phenomena, Archaeology and Science-Theology dialogue and I have written on these topics. Engineers who have done a course on Bible are not exactly qualified to write on religion.\n\n","date":"November 13, 2015 at 5:54 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214584","author":"Louis","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Of the five Giovanna de Lisos listed at LinkedIn, one is described as “docente di canto lirico privato e al Conservatorio di Musica di Cuneo, cantante lirica, ricercatrice scientifica” and her research interests include: “Research on seismic precursors is aimed at better understanding of the subject and the strengthening of protection from the risk of earthquakes” and “Research on the formation of the Image Man of the Shroud of Turin, accompanied by a deepening even historical exegesis of the Gospels, has so far brought out the uniqueness and authenticity (not a fake!).”\nHowever, regardless of her qualifications or lack of them, she has shown us images of a snake and a key on a cloth. I should like to know how they arrived there, and whether geophysical activity was involved or not. It is to my mind at least as likely as a sudden burst of UV radiation or the emanation of cadaverine.\n\n","date":"November 13, 2015 at 6:36 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214585","author":"Hugh Farey","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Hey guys, Louis, piero, daveb, Hugh, Dan, everyone!\nHaven’t you noticed something more general; that Marco Bella and his friends (I am quite sure Gian Marco Rinaldi is very active in this, perhaps Andrea Nicolotti,maybe Garlaschelli, and likely more unknown friends of theirs) are very passionatley looking for any information that may be useful to denigrate their opponents in the field of Shroud research.\nI am quite sure this gang has started personal files on several of you, especially more prominent in Shroud research and discussion on this blog. I am certain the started my file. So watch out yourselves, because they may already know what you don’t want to be known!\nThese awful methods were widely used by security services in the Communist block countries.\n\n","date":"November 13, 2015 at 6:52 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214586","author":"O.K.","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"O.K.,  being so paranoid,\nWhy anyone would be remotely interested in compiling a dossier on anyone who believes the Shroud is authentic defeats me. Some of us of are academics, merely interested, among other projects we are working on, in finding the truth about its origin. What harm are you doing to anyone in believing that it is authentic? Why should you have any importance that deserves busy people to be compiling a file on you? What use would it be to anyone?\n What matters is finding scientific, artistic,  etc, evidence that establishes the origin of the Shroud. Some of us prefer to focus on that. I\n\n","date":"November 14, 2015 at 2:42 am","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214593","author":"Charles Freeman","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"I hope I can count myself one of Marco Bella’s friends, and also Gian Marco Rinaldi, Andrea Nicolotti and Luigi Garlaschelli, just as I hope I can call OK, Louis, Thomas, Daveb, Charles and all the rest of you friends. I bear malice to no man, and have no reason to suppose any man bears malice to me. God bless us all.\n\n","date":"November 14, 2015 at 3:40 am","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214595","author":"Hugh Farey","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Amen. \n\n","date":"November 14, 2015 at 4:33 am","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214596","author":"Dan","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Hi O.K.\nThanks for the advice, coming from someone who lived behind the Iron Curtain. If what you are saying is true there are ways to handle it. But I really do not see any reason for files, for that would be trying to hit below the belly and can have a boomerang effect. The people you cite are qualified professionals, university professors, they have careers to worry about.\n\n","date":"November 13, 2015 at 7:05 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214587","author":"Louis","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"“Engineers who have done a course on Bible are not exactly qualified to write on religion”  What a load of B.S!  \nDoes Louis hold a major from any Religious Studies department from any university which encompasses the religious experience of most of mankind as I do?  I dare he say he does not!  \nAs for the so-called “science” of Parapsychology, Encyclopedia Britannica concludes its article on Parapsychological Phenomena with this paragraph:\n“Discussion about parapsychological phenomena has sometimes assumed emotional overtones, unsuitable to scientific discipline, and outspoken but contradictory opinions are still frequently voiced. Believers and nonbelievers in psi may base their belief or disbelief on what they consider to be the scientific evidence, on their personal experiences, or on some larger system of attitudes and values into which ESP does or does not fit. When such extreme and contradictory views are widely held, it is almost certain that the evidence is not conclusive either way and that confident conclusions are unlikely to be supported by a survey of all the known facts.”\nHardly a sound basis for any discipline claiming to be a science! \nHugh is on the money with his objective comment:\n“However, regardless of her qualifications or lack of them, she has shown us images of a snake and a key on a cloth. I should like to know how they arrived there, and whether geophysical activity was involved or not. It is to my mind at least as likely as a sudden burst of UV radiation or the emanation of cadaverine.” \nIt is issues that need to be addressed, and resorting to snide attacks upon persons is the refuge of those with no sound argument to contribute to any kind of fruitful discussion.  \nIf any Latinate gang is compiling a file on a Shroud authenticist who happens to be living in the antipodes, then they can have little else to occupy their time more usefully.  I doubt their reach extends this far.  It is the enemy within who is more of a worry!\n\n","date":"November 13, 2015 at 8:06 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214588","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Daveb is as usual trying to hit below the belly, once again now because he does not want to admit that he took the wrong path and Bella showed him why. He has also used foul language, quite shamelessly. I must point out to him that the people in the anti-authenticity camp havê never done this, só they are not hypocrites. See.how much he understands about science?  The only thing he has published on religion is an article on the Shroud in his parish bulletin.\n\n","date":"November 13, 2015 at 8:26 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214590","author":"Louis","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Who cares about the shroud? Bless the people of the wonderful city of Paris.\n\n","date":"November 14, 2015 at 12:00 am","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214592","author":"Thomas","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":">”Who cares about the shroud? ”\nIMHO this is a wrong phrase [unless\nyou are a new C. Hitchens …\n=… organised religion is “violent,\nirrational, intolerant, allied to racism,\ntribalism,… etc. …\nLink:\nhttps://en.wikipedia.org/wiki/God_Is_Not_Great#Contents%5D,\nSo, try a moment  to think about the History.\nPeople like ISIS members are very dangerous.\nIt is not playing “Image” Lennon piano that\nwe can stop these madmen.\nSee also the next Jubilee in Rome and the public safety!\nNot even with the use of provocations\nlike a song: “Image there’s no Islam…“ that you\ncan stop the horrible terrorist organization!\n— — —\nThomas,\nYou proclaim emphatically:\n “Who cares about the shroud? ”\nSo…\nAre you an expert in public safety,\nimmigration, mediation, emergencies\nand civil defence?\n\n","date":"November 15, 2015 at 8:31 am","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214629","author":"piero","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Excuse me, I forgot to include\nin the previous text a bracket (=]) …\nSometimes I wonder if an\nalien civilization is able to direct\nour minds with phenomena\nthat now appear to us to be miracles…\nAnd I have not yet found a\ngood explanation on this particular\n(“modern”) speculation.\n\n","date":"November 15, 2015 at 8:39 am","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214630","author":"piero","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"… And if De Liso had the helpful\nadvice given to her by aliens?\n… In this case:\nWhat is your answer?\n\n","date":"November 15, 2015 at 8:41 am","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214631","author":"piero","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Thank you Hugh for your comment at Nov 14, 3:40 am. \nI continue to be encouraged by supportive comments I regularly receive from highly qualified writers and genuine researchers on the Shroud of Turin, who consistently display qualities of sound judgement and a critical approach to the subject, regardless of any lack of unanimity between us, and who seldom display a need to resort to any kind of personal attack for lack of a better argument.\n\n","date":"November 14, 2015 at 1:45 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214610","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Daveb began the personal attacks on this thread and now he resorts to insults. He is not a scientist and went along the wrong track. Instead of admitting that both M. Bella and myself showed him how he was wrong he continues with his attacks. We do need these kind of people in the Shroud “crowd”.\nWell, as I said more than once here, he does not learn from mistakes.\n\n","date":"November 14, 2015 at 7:57 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214617","author":"Louis","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Giovanna de Liso together with another author has more recently published a highly technical paper on Seismic Precursory Phenomenology in Unusual Animal Behaviour and with apparently significant results.  It is only too apparent from this paper that she has some considerable expertise, competence and familiarity with seismic technology. \nThe so-called list of predatory publishers referred to by Marco Bella is so extensive that very few on-line publishers would escape being included.  I note for instance that it appears to include the academia sites where Louis himself is so prone to log his offerings.  \nThe only real contribution that either Louis or Marco Bella have made to this thread is to refer to De Liso’s reported unusual fantasy of alien abduction and propensity for observing UFOs.  This may raise some doubts about her scientific objectivity.  However several other notable scientists in the course of history, including for instance both Kepler and Newton, have also indulged in peculiar fantasies which hardly derogates from their scientific work.  Her competence as a singer is hardly relevant to her competence as a scientist.  \nNo-one in this thread, apart from Hugh Farey and myself have addressed the specific issues of the topic that Dan saw fit to post here, but instead have concentrated on personalities.  I imagine that this is meant to pass for responsible religious journalism. \nHowever the matter of De Liso’s 2010 Frascati paper is now being explored by way of another route, hopefully with more positive and telling results than this toxic thread has been able to provide,\n\n","date":"November 15, 2015 at 4:52 am","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214624","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"My first comment challenged what was being stated.\nSome comments later daveb wrote,\n “I have yet to see an adequate explanation for them as a result of seismic activity.”\nand I responded:\n“That is what exactly I have been saying right from the beginning!”\nI imagine that he was trying to pass his views off as science and since he did not succeed he began to resort to personal attacks and foul language.\nSee his comments above.\nReaders note: He will continue with his insults and attacks, because, as I said he does not learn from mistakes.\n\n","date":"November 15, 2015 at 5:55 am","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214626","author":"Louis","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"It is only too plain that like all the rest  of his noxious statements this silly presumptuous ad hom comment adds nothing whatsoever to the true subject of this posting, the possibility of seismic imagery. Toxic!\n\n","date":"November 15, 2015 at 1:23 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214637","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"daveb has started his personal attacks again because the rubbish he was pursuing was brought to his attention. It can be read above on this thread.\nThere is no image that has been proved to have been the result of seismic activity.\nHe has also made comments against Parapsychology, demonstrating more ignorance. It is recognised by the WHO, which is an UN body.\nNot long ago he claimed that the gospel of Matthew was written for gentiles and when I had to show him that he was wrong he took my comments, rehashed them and posted it immediately in the same thread, trying to pass them off as his own research. That was when I had to tell him what he was doing.\n\n","date":"November 16, 2015 at 8:06 am","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214655","author":"Louis","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"I cannot find that Parapsychology is recognised by either the World Health Organisation or the United Nations other than as a recreational pursuit for interested staff, like the Choir, the Gym Club and the Mystic Round Table.\n\n","date":"November 16, 2015 at 2:37 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214674","author":"Hugh Farey","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"I will provide the link the fastest possible. One does not have to be like Sir Athur Conan Doyle and jump to conclusions. He lost a son during World War I and the British were having a bad time getting over their losses and there were attempts to overcome the grief by going into Spiritualism. Times were different.\n\n","date":"November 16, 2015 at 2:54 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214675","author":"Louis","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"WHO: For a start go to page 41:\nhttp://apps.who.int/iris/bitstream/10665/165674/1/25823.pdf?ua=1\n\n","date":"November 16, 2015 at 4:14 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214681","author":"Louis","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Exactly. A newsletter from 1983 dealing with drug abuse and listing every possible publication that might be relevant mentions the Journal of Altered States of Consciousness, which after all covers what drugs do, saying that the journal deals in “psycho-pharmacology, dream research, yoga, parapsychology and such states as trance, hypnosis, general anesthesia, and mystic rapture.” This hardly constitutes WHO recognition of parapsychology, does it? The Journal changed its name in 1981 to ‘Imagination, Cognition and Personality’, whose current website does not mention anything parapsychological among its ‘Aims and Scope.’ \nInformation from good ol’ Wiki….  Although the the Parapsychological Association is affiliated to the American Association for the Advancement of Science, the US National Academy of Sciences has said that: “no scientific justification from research conducted over a period of 130 years for the existence of parapsychological phenomena” has been found, and most parapyschological departments of universities are dedicated not to assuming it exists, but to trying to find some evidence for it. So far they have been unsuccessful. A panel commissioned by the United States National Research Council to study paranormal claims concluded that “despite a 130-year record of scientiﬁc research on such matters, our committee could ﬁnd no scientiﬁc justiﬁcation for the existence of phenomena such as extrasensory perception, mental telepathy or ‘mind over matter’ exercises… Evaluation of a large body of the best available evidence simply does not support the contention that these phenomena exist.”\nWell, they may all be wrong, and as we have heard elsewhere in this post, some ideas have eventually become accepted even after years of rejection, but it would clearly be wrong to suggest that parapsychology is in anyway mainstream science just yet.\n\n","date":"November 16, 2015 at 4:50 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214685","author":"Hugh Farey","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Take it easy, I said it was just the start. I have to look for the link and will do so when I can.\nSPR in London has a good library, with books magazines, etc.\n\n","date":"November 16, 2015 at 5:00 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214686","author":"Louis","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Unfortunately we have not yet\nthe possibility to read the useful\ninformations on thickness of thin\ncoloured layers for the mysterious\n“handkerchief of Padre Pio”…\nSee also the use of ATR-TIR (or\nmore advanced tools = SPM analyses,\netc.) in order to detect something\n(= an exact chemical fingerprint)\nabout the thin coloured layers.\nAnother thing: we can use vibrations\nto help dyeing processes (with US = UltraSounds!).\nHere some references:\n– Ultrason Sonochem. 2003 Mar;10(2):85-94.\nStudies on the use of power ultrasound in leather dyeing.\nSivakumar V1, Rao PG.\n– N.S.E. Ahmed, R.M. El‐Shishtawy, M.M. Kamel,\n(2007)\n“Ultrasound assisted pre‐treatment and dyeing\nof linen fibres with reactive dyes”,\nPigment & Resin Technology,\nVol. 36 Iss: 6, pp.363 – 372\n– Article in\n“Fibers and Polymers” January 2015,\nVolume 16, Issue 1, pp 62-66\nFirst online: 04 March 2015\n“Ultrasound effect on dyeing wool fibers\nwith two anthraquinone dyes”\nby\nAndreia Sanislav, Magdalena Fogorasi,\nMichaela Dina Stanescu , Simona Muntean, Mihaela Dochia\nLinks:\nhttp://www.ncbi.nlm.nih.gov/pubmed/12551768\nhttp://www.emeraldinsight.com/doi/abs/10.1108/03699420710831782\nhttp://link.springer.com/article/10.1007%2Fs12221-015-0062-5\n— — —\nI hope my informations on the use\nof ultrasounds (… and therefore\nof vibrations …coming from earthquakes!)\nwill not be too misrepresented in\nyour interpretation of this message …\nSo…\nAt first glance seems very obvious that earthquakes\nhave nothing to do with the towel-handkerchief\nof Padre Pio or with the image of Lees\n(= the poor man Liverpool).\nOn this I agree, no doubt!\nI will not deny the possible miracles,\nI want to understand what caused the images.\nAmong other things I believe in Father Pio\n(… but not [too] in the image of Lees!).\n\n","date":"November 15, 2015 at 9:58 am","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214632","author":"piero","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Errata corrige:\n>See also the use of ATR-FTIR (or\nmore advanced tools …\nInstead of:\n>See also the use of ATR-TIR (or\nmore advanced tools …\n\n","date":"November 17, 2015 at 12:36 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214740","author":"piero","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"Louis persists with his obsessive personal vendetta against myself.  Much as I might be tempted to respond in kind, no difficult task, I prefer to refrain from doing so.  However I shall not let pass his comments on a technical matter, viz:- \n“Not long ago he claimed that the gospel of Matthew was written for gentiles and when I had to show him that he was wrong he took my comments, rehashed them and posted it immediately in the same thread, trying to pass them off as his own research. That was when I had to tell him what he was doing.”  Louis, Nov 16, 8:06 am above. \nI certainly had no cause to rehash any such of his comments, but the technical aspect is far more complex.  Thus Encyclopedia Britannica for instance notes that in may ways, Matthew’s is the most Jewish of the gospels, but it identifies the target audience as Greek-speaking gentile Christians.  \nThus on the gospel’s origin:\n“The Gospel grew out of a “school” led by a man with considerable knowledge of Jewish ways of teaching and interpretation. This is suggested by the many ways in which Matthew is related to Judaism. It is in some ways the most “Jewish” Gospel. Striking are 11 “formula quotations” (“This was to fulfill what was spoken by the prophet . . .”) claiming the fulfilment of Old Testament messianic prophecies.”  (Etc)\nHowever on the Matthean church it comments:\n“Matthew is not only an original Greek document, but its addressees are Greek-speaking Gentile Christians. By the time of the Gospel According to Matthew, there had been a relatively smooth and mild transition into a Gentile Christian milieu. The setting could be Syria, but hardly Antioch, where the Pauline mission had sharpened the theological issues far beyond what seems to be the case in Matthew.”  … …\n“For Matthew, there had already been a separation of Christianity from its Jewish matrix. When he speaks about the “scribes and the Pharisees,” he thinks of the synagogue “across the street” from the now primarily Gentile church. Christianity is presented as superior to Judaism even in regard to the Law and its ethical demands.”\n“The Matthean church is conscious of its Jewish origins but also of a great difference in that it is permeated with an eschatological perspective, seeing itself not only as participating in the suffering of Christ (as in Mark) but also as functioning even in the face of persecution while patiently—but eagerly—awaiting the Parousia. ”  Etc. \nThis is clearly no rehash of Louis’ comments but is a particular view expressed in a highly reputable reference source.  Clearly also, not all Biblical scholars might agree with this particular view.  For them they may consider it is indeed addressed to a church of Jewish Christians, because of the Jewish flavour of the text.  But that does not seem to be the view of the majority.  \nBiblical scholarship is a hotly debated discipline, even among the best of its scholars. so clearly discerning unanimity is a difficult matter.  It is certainly more complex than Louis might prefer to believe.  His persistent obsessive carping against myself I shall let pass, considering it for the most part to be trivia, preferring instead to deal with issues rather than personalities.  And there, I think I shall let it rest.\n\n","date":"November 16, 2015 at 4:29 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214682","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Nevertheless, the images are real enough!","post":"“Louis persists with his obsessive personal vendetta against myself.”\nPlease note the projection and strange ambivalence in feeelings.\n\n","date":"November 16, 2015 at 6:00 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","id":"comment-214689","author":"Louis","site":"shroudstory"}]
