[{"title":"New 3D Rendering of the Shroud of Turin Face by John Chen","post":"Please do not perpetuate the Carbon 14 dating myth. The small piece from the lower-left corner of the cloth which was tested by 3 laboratories in 1988 is not representative of the shroud. The piece was taken from a corner that had been repaired in the 16th century. Here’s the proof:\no 3 different textile experts saw discernible differences between the sample area and the rest of the shroud, including an “invisible” mending technique used by Europeans of old to mend damaged linens, which made both the reweave and its reattachment “invisible” to the untrained eye.\no Retired Los Alamos National Laboratory scientist Raymond N. Rogers examined 14 strands from the test sample under a high-powered microscope: \n He saw clearly distinguishable cotton fibers (flat, tape-like) spliced into the linen fibers (round, like tiny bamboo shoots). His findings were published in a 2002 co-authored paper, “Scientific Method Applied to the Shroud of Turin.” \n There was a brownish coating on the cotton fibers, which had been applied as a liquid and had flowed down the threads. Chemical analysis showed it was madder root in a gum arabic base—a classic dye mixture to blend in the newer mending patch with the rest of the cloth, applied after the patch was weaved. \n In 1978, Rogers inspected the shroud itself with even more probing technology and confirmed there was no cotton elsewhere interwoven with the linen. \n Rogers also performed a test for vanillin, found in flax, the plant from which linen is made. Vanillin is known to dissipate slowly over centuries. Rogers found significant amounts of vanillin in the Carbon 14-tested sample.\n\n","date":"March 31, 2011 at 1:43 pm","url":"https://shroudstory.com/2011/03/30/new-3d-rendering-of-the-shroud-of-turin-face-by-john-chen/","cat":"image_theory","id":"comment-2763","author":"Eowyn","site":"shroudstory"},{"title":"New 3D Rendering of the Shroud of Turin Face by John Chen","post":"My source is Robert K. Wilcox’s excellent book, The Truth About the Shroud of Turin (Regnery, 2010).\n\n","date":"March 31, 2011 at 1:44 pm","url":"https://shroudstory.com/2011/03/30/new-3d-rendering-of-the-shroud-of-turin-face-by-john-chen/","cat":"image_theory","id":"comment-2764","author":"Eowyn","site":"shroudstory"},{"title":"New 3D Rendering of the Shroud of Turin Face by John Chen","post":"I would have to say neither camp, for or against has made conclusive arguments\nCarbon dating past, present, future (although highly unlikely) proves the age of the cloth itself and not when the actual image was produced\nSome refer to Da Vinci and the camera obscura..i.e the reason it behaves like a photograph is because it was made using photographic techniques. Some experts have also noted key similarities between the face on the Shroud and that of Da Vinci himself\nBut Da Vinci appears to have been born way too late in terms of what some consider to be historical references to the shroud e.g the Holy Mandylion of Edessa or the Pray Manuscript. \nThen again, it could be argued that if it is indeed man-made, the “artist” used an ancient piece of cloth and had seen the Pray manuscript and added those finishing details to the image….\nBut then there’s the possible relationship with the Sudarium of Oviedo….\nSo, I will not say it is fake or real\nI just think it is absolutely magnificent regardless \nAnd I am Sikh not Christian!\n\n","date":"April 4, 2011 at 6:53 pm","url":"https://shroudstory.com/2011/03/30/new-3d-rendering-of-the-shroud-of-turin-face-by-john-chen/","cat":"image_theory","id":"comment-2795","author":"Seeker9","site":"shroudstory"}]
