[{"title":"New Paper:  Variations in Image Due to Amounts of Burial Ointments?","post":"Interesting.\n\n","date":"March 1, 2015 at 10:25 am","url":"https://shroudstory.com/2015/03/01/new-paper-variations-in-image-due-to-amounts-of-burial-ointments/","cat":"image_theory","id":"comment-192102","author":"Andy","site":"shroudstory"},{"title":"New Paper:  Variations in Image Due to Amounts of Burial Ointments?","post":"I clicked the link and it automatically downloaded.  I don’t recall signing up for the site.\n\n","date":"March 1, 2015 at 10:26 am","url":"https://shroudstory.com/2015/03/01/new-paper-variations-in-image-due-to-amounts-of-burial-ointments/","cat":"image_theory","id":"comment-192103","author":"Andy","site":"shroudstory"},{"title":"New Paper:  Variations in Image Due to Amounts of Burial Ointments?","post":"Dan, it can be automatically downloaded.\nOne needs to wait and see what those in the field of science will say. I did not find it convincing, it is something like the Maillard effect that has been proposed. My next article will be online shortly.\n\n","date":"March 1, 2015 at 12:23 pm","url":"https://shroudstory.com/2015/03/01/new-paper-variations-in-image-due-to-amounts-of-burial-ointments/","cat":"image_theory","id":"comment-192108","author":"Louis","site":"shroudstory"},{"title":"New Paper:  Variations in Image Due to Amounts of Burial Ointments?","post":"Very interesting paper and it will help many to understand why different grey scales were produced of the negative image on the shroud of Turin. Furthermore it help to understand why the image on the Shroud of Turin cannot be produce by a painter.\n\n","date":"March 2, 2015 at 12:41 am","url":"https://shroudstory.com/2015/03/01/new-paper-variations-in-image-due-to-amounts-of-burial-ointments/","cat":"image_theory","id":"comment-192144","author":"Sampath Fernando","site":"shroudstory"},{"title":"New Paper:  Variations in Image Due to Amounts of Burial Ointments?","post":"That’s funny, Jesus was buried like the other Jews during the period. Why did none of them leave images on burial shrouds? Herod was buried with tons of spices and the rest….\n\n","date":"March 2, 2015 at 8:47 am","url":"https://shroudstory.com/2015/03/01/new-paper-variations-in-image-due-to-amounts-of-burial-ointments/","cat":"image_theory","id":"comment-192181","author":"Louis","site":"shroudstory"},{"title":"New Paper:  Variations in Image Due to Amounts of Burial Ointments?","post":"According to New Testament Jesus was resurrected but not the Herod. Image may have got printed during the resurrection process. Neither Average Human being nor a Scientist don’t anything about this resurrection process. That is why still we are stuggling to understand how the image was formed on the Shroud of Turin.\nHope one day someone can find that process.\n\n","date":"March 2, 2015 at 5:12 pm","url":"https://shroudstory.com/2015/03/01/new-paper-variations-in-image-due-to-amounts-of-burial-ointments/","cat":"image_theory","id":"comment-192232","author":"Sampath Fernando","site":"shroudstory"},{"title":"New Paper:  Variations in Image Due to Amounts of Burial Ointments?","post":"Sorry. typo\nNeither Average Human being nor a Scientist don’t know anything about this resurrection process.\n\n","date":"March 2, 2015 at 6:05 pm","url":"https://shroudstory.com/2015/03/01/new-paper-variations-in-image-due-to-amounts-of-burial-ointments/","cat":"image_theory","id":"comment-192234","author":"Sampath Fernando","site":"shroudstory"},{"title":"New Paper:  Variations in Image Due to Amounts of Burial Ointments?","post":"Agreed, but as I wrote earlier the paper is suggesting something like a a Maillard process. My next Shroud article will be online shortly, dwelling on the image formation process. Keep tuned. Your views are welcome.\n\n","date":"March 2, 2015 at 6:59 pm","url":"https://shroudstory.com/2015/03/01/new-paper-variations-in-image-due-to-amounts-of-burial-ointments/","cat":"image_theory","id":"comment-192242","author":"Louis","site":"shroudstory"},{"title":"New Paper:  Variations in Image Due to Amounts of Burial Ointments?","post":"In the paper of Fazio I have not found the word: “chromatography”.\nI remember that I wrote something about IGC (= inverse Gas Chromatography)\nin the past (in October 25, 2012)…\n>Do you know the IGC (= Inverse Gas Chromatography) ?\n>What is the surface energy of linen samples in the different kind of experiments ?\n>Until now we have read anything about this question in the studies about the Holy Shroud of Turin.\n>Why ?\n>Perhaps Al Adler (a well known chemist) has considered that question, but I have found nothing in the interesting collection of the papers by Adler.\n>Am I wrong ?\nThe argument to debate in this blog was the following:\n“Comment Promoted: Denis Mannix on his proposal” (2012)\n— —\nSe also the paper by Mannix (only two pages):\nhttps://www.shroud.com/pdfs/n74part2.pdf\n— —\nHere another message sent from myself on this blog\n(October 25, 2012 at 10:12 am):\n>… if you want understand the meaning of the IGC-way, in my opinion, you have to be focused on the following question :\n>What is Inverse Gas Chromatography ?\n>Answer :\n>Inverse gas chromatography (IGC) is different from the GC,\nbecause in IGC analytic way it is the adsorbent stationary phase that is under investigation and known molecules are injected into the mobile phase act as a probe. It is through this inversion of the role of the phases that IGC gets its name.\n>The application of IGC is typically in regards to studying the surface (= surface energy…) property of a solid adsorbent and therefore the principles and theory correspond to that of\ntraditional adsorption chromatography …\n… …\n>…  I have some doubt about the presumed great amount of aromas during the burial rite, etc.\n>Unfortunately the interesting study (= intensity of the Shroud body image versus the cloth-body distance, etc.) by Giovanni Fazio, titled :\nThe original presence of burial ointments on the Turin Shroud (2006 = an old paper. Now there are other studies by Fazio and C.),\n>source :\nhttp://www.sindone.info/FAZIO2.PDF \n>seems to be inconclusive.\nHere the title of the paper (= http://www.sindone.info/FAZIO2.PDF ) =\n“The original presence of burial ointments on the Turin Shroud”\n… and here the beginning of the Abstract:\n>The research of aromas and burial ointments on the Shroud of Turin, by microchemical and spectroscopic measurements, has furnished various results. Therefore, we have investigated the effects that the above substances, if present, could have produced\non the body image characteristics ….  …\n— — —\nSee for example :\nthe “photographic plate”\nby Paul Joseph Vignon (born in 1865)\nand René Colson (prof. of Physics at Polytechnic School of Paris)\nColson found ancients recipes and from the old writings was discovered\nthat myrrh and aloes were worked with olive oil in order to obtain a paste\nthat subsequently was distributed on sepulchral linen …\nIn other words:\na cloth impregnated with that emulsion produces\ndifferent levels of browning under alkaline vapors…\n>Source ?\n… the same booklet (= “La Santa Sindone”, ed. Mursia, August 1978,\nChapter VIII : “The believer and the agnostic”, p 101) indicated by Fazio … :\nThomas Humber,  “The Sacred Shroud”, Pocket Books\n— —\nSee also:\nhttp://en.wikipedia.org/wiki/Anointing_of_Jesus\nBut oils seem to be incompatible with the bloodstains\nthat are observed on the Shroud…\nIf I am right oils seem to produce smearing for bloodstains.\nWhat is your exact ideas concerning the use of oil (oil !?!?!??) and burial spices\nor about “original presence of perfumes and/or burial ointments”?\nSorry, here I have no “Likert scales” to test your behavior… !\n\n","date":"March 2, 2015 at 10:58 am","url":"https://shroudstory.com/2015/03/01/new-paper-variations-in-image-due-to-amounts-of-burial-ointments/","cat":"image_theory","id":"comment-192194","author":"piero","site":"shroudstory"},{"title":"New Paper:  Variations in Image Due to Amounts of Burial Ointments?","post":"In the paper by Fazio and others there is not the name “Yannick Clément”…\nWhy?\nPerhaps he didn’t believed in the presence of oils…\nAm I wrong in my simple supposition?\nI am curious to read what will be the answer by Yannick …\n— — — — —\nHere another paper:\nJournal of Materials Science\n20030515, Volume 38, Issue 10, pp 2205-2208\n“The characterisation of cotton fabrics and the interaction\nwith perfume molecules by inverse gas chromatography (IGC)”\nLink:\nhttp://link.springer.com/article/10.1023%2FA%3A1023788400431#\nAbstract\n>IGC is a versatile tool in the characterisation of textile products and the interaction of these materials with fragrance molecules due to the wide range of physicochemical parameters, which can be determined by this technique.\n>This is demonstrated by means of cotton wool and cotton fabrics.\n>Alkanes, fragrance molecules and other polar probes have been used to measure interaction parameters such as dispersive component of surface energy and specific free energy in different experimental conditions (relative humidity, concentration, cotton sample type).\n\n","date":"March 2, 2015 at 11:17 am","url":"https://shroudstory.com/2015/03/01/new-paper-variations-in-image-due-to-amounts-of-burial-ointments/","cat":"image_theory","id":"comment-192197","author":"piero","site":"shroudstory"},{"title":"New Paper:  Variations in Image Due to Amounts of Burial Ointments?","post":"IGC = Inverse Gas Chromatography \nIn IGC the roles of solid and gas are inverted compared to classical analytical gas chromatography.\nIn IGC, a column filled with the solid sample to be investigated and a single gas (probe molecule) is injected.\nThe aim of this characterisation technique is to determine the thermodynamic surface properties and surface morphological aspect of linen or/and cotton fibres.\nThe surface characterisation by Inverse Gas Chromatography (IGC)\nhas been recommended by several papers.\nI have read that IGC method is the better method to determine the energetic properties of fibers than wetting technique …\nWhen you want to properly speak about the surface of that Ancient Linen, then you can try to do something using IGC, because testing the hypothesis of  “natural production by stochastic process” you require (at least) some basic data …\nThe basic tools for IGC are inexpensive,\nwidely available and well suited for routine\nlaboratory applications.\nThen the application of inverse gas chromatography\nseems to be easy, cheap and quick!\nPhysiochemical data.\nYou can consider dispersive component of surface energy\nand specific free energy in different experimental conditions.\nIn 1936 Joel H. Hildebrand (who laid the foundation for solubility theory in his classic work on the solubility of nonelectrolytes in 1916) proposed the square root of the cohesive energy density as a numerical value indicating the solvency behavior of a specific solvent.\nlink:\nhttp://cool.conservation-us.org/byauth/burke/solpar/solpar2.html\nThen Hildebrand solubility parameter for a pure liquid substance is defined as the square root of the cohesive energy density.\nHere I presume you know the heat of vaporization,\nV(index m) = the molar volume, RT (from the Ideal Gas law\n[Liter atm / mole K] * K = [L atm / mol] )\nand the energy of vaporization….\nThe partial pressures of all of the components in a mixture of real gases depend\non the types of molecules and the temperature. At constant temperature,\nthe internal energy of a mixture remains constant; however,\nthe partial pressures of the components depend on their “fugacity.”\nIn any case we can expect that the chemical researchers are able to work using the IGC …\nUnfortunately Rogers passed away in 2005.\nI can recommand you to read a polish paper (in english) published in 2008:\n“Inverse gas chromatography as a source of physiochemical data”\n(read, at the end of this message, the bibliographic reference)\nbecause IGC could be called a milestone in testing properties\nof liquid and solid materials.\nTypical units are hildebrand :\n1 hildebrand = (1 cal )^1/2 (1 cm)^-3/2 = 0.48888 (Mega Pascal)^1/2 \nThe conventional units for the solubility parameter are (calories per cm3)^1/2, or: (cal)^1/2 (cm)^−3/2.\nLink:\nhttp://en.wikipedia.org/wiki/Hildebrand_solubility_parameter\nSee also :\nHildebrand’s delta.\nHildebrand solubility parameter is also known as three-dimensional solubility parameters or HSP because Hansen proposed an extension of the Hildebrand parameter\nin order to estimate relative miscibility of polar and hydrogen bonding systems.\nThere is a formula to calculate the distance (Ra) between Hansen parameters in Hansen space.\nCombining this with the interaction radius gives the relative energy difference (RED) of the system (the ratio Ra/R0, where R0 is a value called interaction radius that is given to the substance being dissolved).\nHistorically Hansen Solubility Parameters (HSP) have been used in industries such as paints and coatings where understanding and controlling solvent/polymer interactions was vital. Over the years their use has been extended widely… \nLink:\nhttp://en.wikipedia.org/wiki/Hansen_solubility_parameter\nFor molecules whose heats of vaporization can be measured (… or calculated) one can determine the value of delta.\nThere are three delta components (Hansen evaluation system):\n– dispersion\n– electrostatic\n– hydrogen bonding \nDo you know HSP (= Hansen Solubility Parameters) for myrrhoaloetic oils ?\nPerhaps you can try to do some easily experiments using methane or propane gas\nin your cooling room (both are explosive gases when mixed with air: warning, take care!!!).\n— —\nI have read that:\nthe retention volume is calculated from the retention time\nand the partial pressure from the peak/step height.\nSince the retention volume represents the first derivation of the adsorbed amount,\nintegration gives the isotherm.\nPerhaps other bloggers can contribute\ndeveloping this argument…\n— —\nAs previously wrote I don’t believe in oil’s presence.\nYears ago I have read something about an\n“Unguentum Apostolorum”.\nAn oily, viscous substance, indicated by Norma Weller (now a deceased researcher),\nwho also wrote something about an archaeological expert in ancient forms of burial and embalming…\nIGC can be employed to explore changes in surface energy\n(see, for example : Corona Discharge treatments, etc. …)\nIGC became very popular method for the measurement\nof physico-chemical properties of solid materials.\nTherefore Inverse Gas Chromatography (IGC), at infinite dilution, can be used\nto determine thermodynamic parameters of adsorption, such as free energy, enthalpy\nand entropy, as well as the dispersion component of surface free energy,\nand the interaction parameter.\nThen Inverse Gas Chromatography can be an useful tool to use\nin the case of experiments about thymol treatments (see: the inherent old claims)…\nI am curious to see what happens with natural linen samples, natural treated linen\nand modern/commercial linen samples. Perhaps they should show a smaller surface energy\ndue to the additional treating ingredients and processing methods…\nIn any case, I hope in your interesting answers…\n—————————— \nBibliographic references :\n– D.R. Lloyd, T.C. Ward, H.P. Schreiber (Eds.),\nInverse Gas Chromatography – Characterization of Polymers and Other Materials\n(ACS Symposium Series No. 391), American Chemical Society, Washington,\nDC, 1989, p. 230.\n– Inverse gas chromatography as a source of physiochemical data\nAdam Voelkel, Beata Strzemiecka, Katarzyna Adamska, Kasylda Milczewska\nJournal of Chromatography A, 1216 (2009) 1551–1566\n[So … After twenty years : 1989 – 2009,\nthat way always seemed to be interesting]\n– Hildebrand and Hansen Solubility Parameters from Molecular Dynamics\nwith Applications to Electronic Nose Polymer Sensors\nby\nM. Belmares,  M. Blanco and other researchers\nJournal of Computational Chemistry,\nVol. 25, No. 15\nCopyright 2004 Wiley Periodicals, Inc.\n– Belgacem M.N., Czeremuszkin G. and Sapieha S. 1995.\nSurface characterization of cellulose fibers by XPS and inverse gas chromatography.\nCellulose 2: 345-157.\n\n","date":"March 3, 2015 at 5:59 am","url":"https://shroudstory.com/2015/03/01/new-paper-variations-in-image-due-to-amounts-of-burial-ointments/","cat":"image_theory","id":"comment-192272","author":"piero","site":"shroudstory"}]
