[{"title":"Nice 3D Image","post":"There is no 3D in the clip. Any illusion of 3D is created by the animation. and the latter is achieved somewhat crudely by compressing the subject right of the midline (viewer’s perspective) while keeping the opposite side the same. Note the way that the image seems to shrink as the virtual “camera” jerkily pans to the left.\nI see there are free, downloadable programs available on the internet for animating  any uploaded GIF image of one’s choosing.  I might try saving the blogmeister’s image as a GIF file, then animating as per his clip that attempts to endow the 2D positive Shroud image with allegedly 3D properties. Then we would see Dan Porter constantly shaking his head at some of the ideas that appear on his site.\nSorry, blogmeister. No 3D properties, except those that can be elicited from image density in OTHER programs. Good try. No cigar.\n\n","date":"June 21, 2013 at 2:03 pm","url":"https://shroudstory.com/2013/06/21/nice-3d-image/","cat":"image_theory","id":"comment-37626","author":"colinsberry","site":"shroudstory"},{"title":"Nice 3D Image","post":"I’d love to see Dan in 3D, please do.\n\n","date":"June 21, 2013 at 2:19 pm","url":"https://shroudstory.com/2013/06/21/nice-3d-image/","cat":"image_theory","id":"comment-37632","author":"David Goulet","site":"shroudstory"},{"title":"Nice 3D Image","post":"You’ve missed the point, DG. Don’t confuse animated 3D of light/dark tone-reversed 2D images with 3D, or even pseudo-3D.\n If you want to see Dan Porter in real 3D with enhanced animation, arrive on his doorstep, pretend to be Cardinal Spaghettini from Rome, and announce that the Vatican has had to turn down his request to be Official Site Provider for All Matters Pertaining to the Turin Shroud.  For super-animation, tell him that honour is being bestowed on a rival consortium led by Barrie Schwortz, Thibault Heimburger and David Rolfe. \nIn your dreams? Well, my dreams anyway…\n\n","date":"June 21, 2013 at 2:57 pm","url":"https://shroudstory.com/2013/06/21/nice-3d-image/","cat":"image_theory","id":"comment-37643","author":"colinsberry","site":"shroudstory"},{"title":"Nice 3D Image","post":"Cardinal Spaghettini was made papal nuncio to Malta last month – it was in all the papers. Besides Dan’s got a bigger budget than the Vatican these days.\n\n","date":"June 21, 2013 at 3:35 pm","url":"https://shroudstory.com/2013/06/21/nice-3d-image/","cat":"image_theory","id":"comment-37652","author":"David Goulet","site":"shroudstory"},{"title":"Nice 3D Image","post":"Actually, Colin, in this case you are mistaken. The 3D data that allows plotting (e.g. imagej, VP8, etc.) can also be viewed in many ways: stereoscope, 3D glasses, lenticular print, simulated motion, etc. The shrinking you see was artistic effect, very common in documentaries — panning in and panning out. It has nothing to do with the 3D effect you see. Really! Ray Downing did the work in his documentary. I’ve met with him. I’m completely convinced about the quality and integrity See https://shroudstory.com/2013/02/02/teaser-of-the-day-3-why-many-state-that-the-shroud-is-a-3d-image/\n\n","date":"June 21, 2013 at 2:22 pm","url":"https://shroudstory.com/2013/06/21/nice-3d-image/","cat":"image_theory","id":"comment-37634","author":"Dan","site":"shroudstory"},{"title":"Nice 3D Image","post":"Actually, Colin, you have done enough work, yourself, with imagej to know better.  Plot several images by changing to viewing position just slightly. Then animate the GIF, a very elementary task. Now, do it with my picture. Shaking my head is a whole different game and doesn’t mean it is 3D.\n\n","date":"June 21, 2013 at 2:30 pm","url":"https://shroudstory.com/2013/06/21/nice-3d-image/","cat":"image_theory","id":"comment-37637","author":"Dan","site":"shroudstory"}]
