[{"title":"Not happy with Giulio Fanti’s Paper in JIST","post":"I must disagree. I think Prof. Fanti’s paper is wonderful. The scoring method shows great originality. I cannot think of a better set of characteristics. The other reader if he wishes to criticize it should tell us what his list should be and how he would weight each item differently to achieve different results.\n\n","date":"December 27, 2011 at 5:01 am","url":"https://shroudstory.com/2011/12/26/not-happy-with-giulio-fantis-paper-in-jist/","cat":"image_theory","id":"comment-6164","author":"Raskin","site":"shroudstory"},{"title":"Not happy with Giulio Fanti’s Paper in JIST","post":"sadly fanti should have stopped while the paper was still a critical commendium and not tried to push his cd agenda with a dubious scoring method\n\n","date":"December 27, 2011 at 6:30 am","url":"https://shroudstory.com/2011/12/26/not-happy-with-giulio-fantis-paper-in-jist/","cat":"image_theory","id":"comment-6166","author":"MouseInTheHouse","site":"shroudstory"},{"title":"Not happy with Giulio Fanti’s Paper in JIST","post":"two papers with different conclusion. fanti shows how fractured the ssg world is between natural and supernatural and also fanti and enea big time. my bet is still on rogers when better developed\n\n","date":"December 27, 2011 at 6:35 am","url":"https://shroudstory.com/2011/12/26/not-happy-with-giulio-fantis-paper-in-jist/","cat":"image_theory","id":"comment-6167","author":"MouseInTheHouse","site":"shroudstory"},{"title":"Not happy with Giulio Fanti’s Paper in JIST","post":"Quote : “The results have been summarized in two tables, leading to the inference that a source of radiation is the best hypothesis and that, of the various hypotheses based on radiation, CD is the best, although no complete results can be obtained because of the difﬁcult and in some cases dangerous environmental conditions required for experiments. . . .”\nNo, seriously ???  I’m VERY surprised by this conclusion !!!!  \nCRAP !  Fanti, in my opinion, is the very best example of goal-oriented pseudo-science in the Shroud world.  A guy that from the very beginning has one conclusion in his head (the Shroud is a proof of the resurrection and was done by a supernatural burst of radiation) and do EVERYTHING he can, and I mean EVERYTHING, to make others believe he’s right.\nSeriously, do you really think it’s the correct way to do science folks ???\n\n","date":"December 27, 2011 at 5:26 pm","url":"https://shroudstory.com/2011/12/26/not-happy-with-giulio-fantis-paper-in-jist/","cat":"image_theory","id":"comment-6186","author":"Yannick Clément","site":"shroudstory"},{"title":"Not happy with Giulio Fanti’s Paper in JIST","post":"Although I do not agree with Fanti’s scoring, or his CD conclusion. What is wrong with the forcefullness of his belief? Aslong as people have a brain to consider, or not, his proposals to be right? No one need accept his proposals out of hand! I doubt very many would actually.\nWhat would you say to the Wright brothers extreme belief of the possibility of flight? Many thought they were wrong, even nuts! Science did not believe flight was possible, yet they were one-sighted and sturn in their beliefs…We’re all aware of the outcome!…Would you say they were doing “incorrect” science?\nI don’t know if that is a good analogy but I hope my point was clear.\nR\n\n","date":"December 28, 2011 at 6:07 pm","url":"https://shroudstory.com/2011/12/26/not-happy-with-giulio-fantis-paper-in-jist/","cat":"image_theory","id":"comment-6238","author":"Ron","site":"shroudstory"},{"title":"Not happy with Giulio Fanti’s Paper in JIST","post":"Fanti is agenda driven and it’s obvious as the nose in anyone’s face.  I hope my point was clear.\n\n","date":"December 29, 2011 at 6:48 pm","url":"https://shroudstory.com/2011/12/26/not-happy-with-giulio-fantis-paper-in-jist/","cat":"image_theory","id":"comment-6265","author":"Yannick Clément","site":"shroudstory"}]
