[{"title":"Now the ENEA Report on MSNBC’s Cosmic Log","post":"The news have jumped back to Europe. Now, in Spain, it is the “italian authorities” who claim that the Shroud is “supernatural”\nhttp://www.elconfidencial.com/alma-corazon-vida/2011/12/21/la-sabana-santa-es-sobrenatural-segun-las-autoridades-italianas-89663/\n\n","date":"December 22, 2011 at 4:38 pm","url":"https://shroudstory.com/2011/12/22/now-the-enea-report-on-msnbcs-cosmic-log/","cat":"image_theory","id":"comment-5957","author":"Gabriel","site":"shroudstory"},{"title":"Now the ENEA Report on MSNBC’s Cosmic Log","post":"Here we go again: “The Shroud’s origin is supernatural” http://www.mediterraneodigital.com/sociedad-y-tiempo-libre/14-sociedad-y-tiempo-libre/3620-la-tecnologia-del-siglo-xxi-lo-confirma-la-sabana-santa-es-de-origen-sobrenatural.html\n\n","date":"December 22, 2011 at 4:44 pm","url":"https://shroudstory.com/2011/12/22/now-the-enea-report-on-msnbcs-cosmic-log/","cat":"image_theory","id":"comment-5958","author":"Gabriel","site":"shroudstory"},{"title":"Now the ENEA Report on MSNBC’s Cosmic Log","post":"Can you tell M. Di Lazarro to read (or read again) the book of Ray Rogers please ???  Rogers show in an experiment he did with linen prepared the old fashion way, i.e., with an impurity layer, that 10 minutes of exposition to ammoniac gas can color the fibers in a way which is like the Shroud, i.e. the coloration is present only on the external surface of the fiber and not inside the fiber and did not penetrate into the cloth (the color stayed on the external surface of his sample only).  \nSo, you see ?  UV lights are not the only way to achieve a coloration that look like the Shroud…  And, by the way, Rogers result were not exposed in the media.  I think it was not extraordinary enough for them !\nI may be a blogger but I have a brain and I can use it.  And, by the way, I’ve read his paper !  All Di Lazarro showed with his experiments, is that some UV lights can color the external surface of a MODERN linen fiber, i.e. the primary cell wall, which is not what Rogers reports for the Shroud fibers.  \nFor Rogers, the Shroud coloration rest only on a thin layer of impurity and some parts of that layer where stuck in the sticky tapes he used to take samples from the Shroud.  In other words, those parts of the coloration were taken out of the colored fibers.\nQuestion for M. Di Lazarro :  Did you try to put a sticky tape on one of your linen sample and look to see if you can find ghosts of coloration stuck in the tape ?  If you can’t, sorry but your result is NOT like the Shroud coloration.  I really wonder if he tried this little verification…  That can really help to see if the results he had with UV light can really be compared to the Shroud coloration.\nAnd, by the way, that your result could be close to the Shroud coloration or not, that prove absolutely nothing about the fact that, as you say, “The probability the Shroud is a medieval fake is really low.”  In other words, it’s not because you can produce a coloration close to the Shroud with UV lights that it proves the Shroud coloration was achieve that way and, as a consequence, no medieval forger could have done it !  I’m not as dumb as this !  \nWith Rogers coloration result, some sceptic could even argue the opposite !  Yes…  They could argue that some medieval guy took a man, beat him, scourge him and crucified him like Christ and put it in a Shroud.  In this manner, if the Shroud was prepared the ancient way and the dead body emits some ammoniac gas (which is probable), then there’s a possibility there for the production of a false relic.  I know it doesn’t stand high in the probability scale (and I don’t believe that’s what happen) but nobody (and surely not your results) can disprove that scenario completely !!!  Sorry…\nAll you prove (and that would have to be confirmed by an independent scientist) is that UV lights can color a modern linen sample on the external surface only and the coloration don’t penetrate into the cloth.  The link with the Shroud image is just an extrapolation. That’s all.  Sorry but I just don’t buy it.\n\n","date":"December 22, 2011 at 4:54 pm","url":"https://shroudstory.com/2011/12/22/now-the-enea-report-on-msnbcs-cosmic-log/","cat":"image_theory","id":"comment-5959","author":"Yannick Clément","site":"shroudstory"},{"title":"Now the ENEA Report on MSNBC’s Cosmic Log","post":"It is starting to get extremely irritating that people are still arguing whether this Shroud can be from the ‘medieval’ period. There is sufficient evidence and I believe most here know exactly what I am talking about, that shows it is definitely NOT FROM THAT PERIOD!, Scientifically, artistically or materially!…CASE should be CLOSED already!\nThere is also sufficient evidence, that shows this CAN NOT be some type of ‘HOAX’, an artist’s work or even that someone placed a dead body within a Shroud to conjure up a hoax!….So why do we still mention it in our comments, or discuss it’s possibility? \nYannick I don’t agree also that the ENEA report ‘proves’ image formation ‘completely’ either, atleast not yet. What they claim about the medieval forgery; I find a rediculous statement actually, as I see no connection and also because the comment was not necessary, whatsoever! Anyone who still contemplates that this can be ‘in particular’ a medieval forgery, has a very illogical mind, can turn a blind eye to facts and/or are absolutely bias, to say it simply.\nAnyways, the main point I needed to make was to Yannicks last statement above; I wouldn’t go as far as saying it is “just a extrapolation”, reason being that in some sense they have proved something here. That something being; …They have been able to color a linen only to a specific depth with UV light! … Downplay this as you will, but it is still very relevant to understanding the image formation and to the continuation of Shroud studies!  It still needs varification yes, and they are unable, (presently), to show a complete image or 3D attributes, but they admitted this! being honest and scientific at the same time….Just that one ‘maybe’ misquoted or misguided comment puts any negativity to this study, that’s all….IMHO…\nThanks,\nR.\n\n","date":"December 25, 2011 at 6:41 am","url":"https://shroudstory.com/2011/12/22/now-the-enea-report-on-msnbcs-cosmic-log/","cat":"image_theory","id":"comment-6107","author":"Ron","site":"shroudstory"}]
