[{"title":"Image of the Resurrection?","post":"Yes I agree, the image is made at the instant that the supernatural soul of Jesus Christ enters into hi physical body and that is what cause the color image that surrounds the body image of Christ,  He then awakens in his newly empowered physical body and resurrects.\n\n","date":"November 22, 2014 at 5:41 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","id":"comment-172491","author":"ekmcmahon","site":"shroudstory"},{"title":"Image of the Resurrection?","post":"The shroud bears the image of a corpse, a dead male body to be more precise . Not really the ideal image to demonstrate the triumph of life over death. Linking this cadaverous  image to resurrection relates to fantasy, imagination, mirage …\n\n","date":"November 22, 2014 at 6:23 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","id":"comment-172503","author":"PHPL","site":"shroudstory"},{"title":"Image of the Resurrection?","post":"Are you serious? If I wanted to sell something as real, the first thing that would be mimicked was something that reflected all of the iconography in a very simple manner. And in Christianity, the theme of sacrifice trough death as important as the resurrection itself. There is a reason why the crucifix is the main symbol. An “unexplained” image that correlates with the injuries of the Gospels would have been more valuable than a similar image of Jesus alive… It is the stigmata that serves as “proof” that it is that particular individual and thus, what would have raised the value of the item considerably.\nYou should be able to easily know that, but perhaps your interest in throwing random attacks has clouded your judgement…\n\n","date":"November 22, 2014 at 9:00 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","id":"comment-172524","author":"Eric","site":"shroudstory"},{"title":"Image of the Resurrection?","post":"Heck, even *today* the selling point for the authenticity of the shroud is the fact that what is depicted mirrors the Gospels. A fact that virtually all pro-authenticity papers state.\n\n","date":"November 22, 2014 at 9:04 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","id":"comment-172526","author":"Eric","site":"shroudstory"},{"title":"Image of the Resurrection?","post":"On that same line, the answer to YC’s question can be found in the same iconography. The correlations are so precise that Occam’s razor (I know..) leaves Jesus as the most likely subject.\nThus, religious people/supernatural aficionados see it as a sign from God or some sort of physical reminder. And skeptics see that portraying him was the easiest way to flim-flam people in an age where the Church was extremely powerful. That is, unless you take positions like those of Hugh of Charles, who provide their own explanations of why they believe that is the subject.\n\n","date":"November 22, 2014 at 9:17 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","id":"comment-172530","author":"Eric","site":"shroudstory"},{"title":"Image of the Resurrection?","post":"From my perspective of the Quem Queritis ceremony it is quite simple. It is Easter morning -Christ has risen. Those coming to the tomb ( that has been set up for the purpose) cannot believe this so that the ‘angel’ ( a priest) sitting by the tomb tells them to go in and they will see the grave cloths lying there. The images on the Shroud represent the dead Christ imprinted onto the cloth. But He is not there and they hold up the grave cloth to show that he has risen just leaving the impression of where his body had been. The Lirey Pilgrim Badge shows two priests holding up the Shroud before an empty tomb just as the ritual demands.\nSo the Shroud is like a memory of how he was when he was dead BEFORE the Resurrection.\n\n","date":"November 22, 2014 at 9:51 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","id":"comment-172535","author":"Charles Freeman","site":"shroudstory"},{"title":"Image of the Resurrection?","post":"Charles proposes that the Shroud was painted and the paint has now all flaked off.  One of his proof points is that copies or replicas of the cloth all show a much darker image than we see now.  Perhaps he is right. Or perhaps the image has grown more faint over time by natural means or perhaps there is a third option.  I lecture extensively on the Shroud.  When showing images of the Shroud, I often use the more contrast enhanced images from Enri–1931.  He used monochromatic film which enhances lights and darks.  Why would I do this?  SO THE AUDIENCE CAN SEE THE IMAGE!  Is it not likely that copies of the Shroud were made so people could see it?  Think of how the replica would have been displayed, in a dark church with no electric lighting.  Add to the problem of how one might paint something so faint in the first place.  Why not paint it so everyone can see it…even from the back of the church? (As a note:  Barrie’s pictures from 1978 are perfectly accurate in terms of color–but as a result the image is more faint.  Post 2002 restoration images are even harder to see because of a brighter backing cloth which has somehow effected the contrast.)\n\n","date":"November 22, 2014 at 11:55 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","id":"comment-172546","author":"Russ Breault","site":"shroudstory"},{"title":"Image of the Resurrection?","post":"No Russ, I don’t work from copies and replicas. I work from the depictions of expositions of which there are probably fifty different ones over the years,  by  different artists,of course.. I start with the Tempesta engraving of1613  as Tempesta was famous in his day for accuracy as an engraver. Then we look at other examples from1578 to 1703 to check whether Tempesta should be trusted. Obviously the three I take from before 1613 cannot have been influenced by him but they show similar feature to those in the later 1600s.\nYou make the fundamental mistake in asserting that the images on the Shroud were created  faint, my argument with illustrations is that they became faint over time ( the nineteenth centurY seems to show the deterioration of the images although a lot more work by profEssional art historians is needed here ).it is just a different way of approaching the issue and I think more fruitful in getting to the heart of the issue.\nWhat is essential is to assemble a data base of  all the depictions of expositions- they really are fascinating when you start comparing them with each other to work out the features like the Crown of Thorns ,shown with lots of prickly thorns , that are now lost. There may be problems off copyright but the idea would be to have a historical Shroudscope that anyone could access. It would be an essential part of any Shroud researcher’s materials.\n\n","date":"November 23, 2014 at 2:51 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","id":"comment-172630","author":"Charles Freeman","site":"shroudstory"},{"title":"Image of the Resurrection?","post":"P.S. For instance , your loincloth issue. There is, of course, no problem in a loincloth being added – it is no different from many other relics that coverings were created for- look at the wonderful gold costume that the Volto Santo is decked out in when processed or gems sewn onto relics. No one saw this as a problem any more than they did in cutting out part of the Shroud to give away as a relic probably in the 1530s ( or STURP taking off parts of the image to the US – no one seems to have seen this as desecrating a holy relic but  it could be argued that it was by those who think the Shroud is authentic. If it is not authentic that is not a problem although it may have been unwise to separate elements of the Shroud in this way – I still don’t know whether they are kept together in proper conservation conditions and what the rules for access by scholars are.)\nHowever, Russ’s point is valid. Is this a loincloth painted onto the Shroud or one painted on by artists who were unanimous in showing it? ( I have at least thirty examples  that show it -the 1998 catalogue of the Savoy family’s collection is enormously helpful here ). This is why we need ALL of them online so that you,Russ, and other Shroud researchers can freely argue from a common data base. I think it would be an excellent study for a Master’s dissertation by a budding art historian to collect them all together but there would probably need to be finance available to that those images still subject to copyright can be paid for.\nAs a historian I just believe in assembling all the evidence and opening it up to public and academic discussion. Then we can see what comes out of it.\n\n","date":"November 23, 2014 at 4:48 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","id":"comment-172642","author":"Charles Freeman","site":"shroudstory"},{"title":"Image of the Resurrection?","post":"P.P.S. Of course the tradition with relics ever since the fourth century is that any one part of a relic, a finger from a saint, a sliver of the Cross, a single thorn from the Crown of Thorns has the power of the whole. So anything removed from the Shroud that is original to it is this same category and those who think the Shroud is authentic should venerate it as such. One more reason to make sure that these tapes are kept with appropriate care. In traditional Catholic teachings on relics each one with material from the original surface has the spiritual power of the whole Shroud.\n\n","date":"November 23, 2014 at 5:01 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","id":"comment-172647","author":"Charles Freeman","site":"shroudstory"},{"title":"Image of the Resurrection?","post":"One more comment regarding Charles’ painting theory.  He alleges that in earlier centuries…before the paint flaked off, the loin cloth was more pronounced, which is why it is featured in nearly all copies or replicas.  However the Lier copy from 1516 barely shows any such loin cloth and the image is noticeably faint.  The Exhibition Poster from 1663 also shows the image very faint versus the darker images we find on other copies. Regarding the loin cloth, if there was any attempt to copy with realism what was seen on the original Shroud, why do all the loin cloths vary so much?  From 1579 it looks like a bath towel, others look like boxer shorts and yet others look like a stuffed diaper.  There is no consistency whatsoever regarding the presumed loin cloth.  Maybe that is because it never existed on the original and therefore invites artistic license!\n\n","date":"November 22, 2014 at 1:47 pm","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","id":"comment-172562","author":"Russ Breault","site":"shroudstory"},{"title":"Image of the Resurrection?","post":"I can’t say I’m over-impressed by people who claim to understand me better than I know myself.\nYannick wants to know why “everyone” “always” sees an image of the Resurrection.\nEveryone? Always? On what grounds does this question have any competence whatever? I doubt if more than a tiny minority of Shroud observers see an image of resurrection. I believe Yannick is tilting at windmills.\nEric thinks there are “religious people” who “see it as a sign from God”, and “skeptics” who think it was ” to flim-flam people”. Can a skeptic not be religious? Can a religious person not be a skeptic? Is it ridiculous to believe that making the Shroud could have been an act of devotion rather than cynicism? I’m so glad Charles and I are excepted from this dichotomy.\nSimplistic classifications such as these are prima facie evidence of either an ignorance of, or a rejection of, the numerous different and varied attitudes towards the Shroud held by those interested in it, many of which have been expressed on this blog. They are manifestly absurd.\n\n","date":"November 22, 2014 at 5:45 pm","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","id":"comment-172593","author":"Hugh Farey","site":"shroudstory"},{"title":"Image of the Resurrection?","post":"To be fair, I did place you on a category of your own.  \nAs far as the distinction between religious people, paranormal aficionados and skeptics, I was merely following YC’s lead.\n\n","date":"November 23, 2014 at 9:29 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","id":"comment-172676","author":"Eric","site":"shroudstory"},{"title":"Image of the Resurrection?","post":"Mark 5:1-3, 9:\n1 They came to the other side of the sea, to the territory of the Gerasenes. 2 When he got out of the boat, at once a man from the tombs who had an unclean spirit met him. 3 The man had been dwelling among the tombs, and no one could restrain him any longer, even with a chain.   9 He asked him, “What is your name?” He replied, “Legion is my name. There are many of us.” \nTheir name is Legion, and they are many! \nPierre D’Arcis, Herbert Thurston, Emily Craig, Randall Bresee, Lynn Picknett, Clive Prince, Nicholas Allen, Luigi Garlaschelli!  Shall I go on?  “Originally a painting, but it has all now flaked off!”  “A mild scorch, posing as a sweat imprint?”  All have their explanations, except the one that matters! \nA burial cloth with an image, but where is the body?  “They stole it!” or “It was fed to dogs!” but it still left its imprint.  And don’t forget the bloodstains!  A very dead corpse, no longer there!  A sign of the resurrection! \nBut!  Their name is Legion, and they are many!\n\n","date":"November 22, 2014 at 7:16 pm","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","id":"comment-172600","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Image of the Resurrection?","post":".Merchant of Venice Act 1 Scene 3 Lines 98-102.\n“The devil can cite Scripture for his purpose.\nAn evil soul producing holy witness\nIs like a villain with a smiling cheek,\nA goodly apple rotten at the heart.\nO, what a goodly outside falsehood hath!”\n..manifestly absurd… \nNow Colin, Charles, David Mo, David Goulet, PHLP, Gian Marco Rinaldi and myself are all posessed by devils. Presumably they all jumped out of the Gadarene swine just before they drowned and have been wandering about ever since looking for people to possess…\nMore sensibly, but just as erroneously, daveb subtly alters Yannick’s “image of the resurrection”, which Yannick thinks everybody, except himself presumably, sees in the Shroud, to a preferred “sign of the resurrection” which is much more reasonable, even, somewhat generously interpreted, to myself.\n\n","date":"November 22, 2014 at 11:22 pm","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","id":"comment-172614","author":"Hugh Farey","site":"shroudstory"},{"title":"Image of the Resurrection?","post":"A cult-like devotion to Rogers is behind this. The so-called “miraculists” are always the object of attacks, but no one says anything about the “positivists”. Rogers was discussed in the following interview:\nhttps://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\nTo what lengths will people go?\n\n","date":"November 23, 2014 at 8:21 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","id":"comment-172668","author":"Louis","site":"shroudstory"}]
