[{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"You mean MS Office Picture Manager.\n\n","date":"July 17, 2014 at 7:13 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-138898","author":"Paulette","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"I stand corrected. It was MS Office Picture Manager instead of PhotoShop.\n\n","date":"July 17, 2014 at 7:29 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-138900","author":"Dan","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Was it finger-lickin’ good? (couldn’t resist)\n\n","date":"July 17, 2014 at 1:15 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-138945","author":"Chris","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Might something so mundane as a Nutella contact print prove to be the undoing of Shroud authenticity?\nIt’s not everyday that a simple model system reproduces not just one but TWO oddities (skeletal fingers, no thumbs), both of which have been the source of much high falutin medical theorizing, or indeed fantasizing.\nMethinks time is running out for a 1st century provenance. Not before time, some might think, given the radiocarbon dating AND the obstinate failure/refusal to countenance a re-run.\n\n","date":"July 17, 2014 at 1:32 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-138949","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"What does your impact print look like under a microscope? Is it easy to discern the material used for the imprinting? I assume traces of hazelnut goodness will reside in your test linen. Assuming a medieval artisan didn’t have access to Nutella (his loss) what material might he have used and why has it escaped detection?\n\n","date":"July 17, 2014 at 2:20 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-138958","author":"David Goulet","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"OK, so we need to switch from a 21st century model system, and think about the Shroud’s provenance, David, whether 1st of 14th century (my preference should be clear).\nIt’s not so much a question as to how the image was produced (though that’s still my major interest). It’s what medieval pilgrims were asked to believe, and indeed probably did.\nForget about 21st century theorizing (flashes of radiation at the instant of Resurrection, or ghoulish narratives based on putrefaction). \nThere’s any amount of circumstantial evidence to suggest that pilgrims viewed the Shroud as a sweat imprint, a whole-body post-mortem version if you like of the pre-mortem if allegorical Veil of Veronica.\nIt’s finally time for this blogger to stand up and be counted, and what you read here is just an outline summary. Much has been articulated previously, but the ability to reproduce the imprinting of those backs of hands as bony fingers without thumbs has now helped my thoughts finally to crystallize.\n\n","date":"July 17, 2014 at 2:34 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-138961","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"The problem I have with the medieval impactogram theory is that it is too simple. The bas relief scorch theory at least had a high level of complexity (specialized statues, master metal workers and a conspiracy of Templars involved). It was so complex it helped explain why there might be only one Shroud.\nBut this current theory appears to be something within the realm of anyone (with some resources) to replicate. Why then only one?\nI actually like the impactogram theory because it does answer some questions about the image. My thoughts are crystallizing too but on a natural (not man-made) impactogram image.\n\n","date":"July 17, 2014 at 2:54 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-138963","author":"David Goulet","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"But a contact scorch from a heated template is an ‘impactograph’. The only reason I used my own hand, coated with Nutella, is because i couldn’t find a bronze replica of it in the garage, so had to settle for second best.\n\n","date":"July 17, 2014 at 3:25 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-138967","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Medieval monks made “Lebküchen” or “Pfefferküchen”, where chocolate was used. Nutella is nice, and marzipan is even nicer.\n\n","date":"July 17, 2014 at 2:27 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-138960","author":"Louis","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"What we seem to be dealing with this theory, to use older terminology, is a stamp. The image is a stamp created by contact between linen and some material placed over a corpse or statue. Stamps often leave behind uneven images as the Nutella hand experiment demonstrates. \nColin’s experiment supposes a stickier medium than previous suggestions of ochre or other powdery substances. My question is: whatever the medium there must be some residue, however faint or miniscule, left on the linen, so how did STURP (or others) miss it?\nAnd again, as with the scorch theory, do we have evidence of this method being used elsewhere around the medieval era?\nJust because something is possible doesn’t mean it is probable.\n\n","date":"July 17, 2014 at 2:38 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-138962","author":"David Goulet","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Luigi Garlaschelli’s powder-rubbing model, even if incorrect, gives a pointer to the kind of subtlety that is possible if wishing to leave a “stamp” (good, straightforward term)\n on linen.\nHe proposed that the kind of ochre (red-brown ferric oxide, Fe2O3, available in medieval times, made by decomposing  green vitriol,  hydrated ferrous sulphate, FeSO4. 7H2O), would have contained acidic impurities, notably sulphuric acid, which becomes conc H2SO4 when one drives off water.\nHe reckoned that the acidic ochre was used to produce a negative image from a human subject, and the linen then heated in an air oven to make it seem older than it really was. But the heat might also have caused the acidic impurities to chemically etch the linen, via the same kind of pyrolytic chemistry (dehydration reactions etc) that occurs when linen is scorched directly with a hot metal  template. Later  the solid ochre flaked off, or was scrubbed off, leaving just the ghostly image (Hugh Farey has also flagged up this kind of erosion scenario as a possible explanation).\nIn other words, there’s a mechanistic spectrum that runs between a purely thermal action (scorching from a hot template) or a chemical mechanism (traces of sulphuric acid etc) or any number of in-between mechanisms that rely on a combination of chemistry and heat.\nDespite these uncertainties re precise mechanism, the narrative may hinge on the credibility or otherwise of a medieval artisan asking himself a simple question: “How can I produce a whole-body version of the Veil? How can I simulate a post-Criucifixion sweat imprint that might be left on linen as a yellow discoloration?”  \nIt didn’t need to be a real sweat imprint – merely a yellow-brown image that could be represented as an ancient degraded sweat image.\nMy own preferred scenario is that of a post 1314 scorch-imprint designed to simulate a slow-roasted Knight Templar, possibly a Knight Templar (Jacques de Molay?) being “reinvented” as a sweat imprint of the crucified Jesus.\n\n","date":"July 17, 2014 at 3:13 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-138966","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"“But a contact scorch from a heated template is an ‘impactograph’. The only reason I used my own hand, coated with Nutella, is because I couldn’t find a bronze replica of it in the garage, so had to settle for second best.”\nI thought you had buns of steel! ;)    Thanks for the clarification though.\n\n","date":"July 17, 2014 at 3:37 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-138970","author":"David Goulet","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"CB: There seems to be no reason to justify why an attempt was made to link de Molay,burnt at the stake, to the crucified Jesus. We humans can think without observing and reach wrong conclusions. Lesson by an English bishop:\nhttp://www.catholicherald.co.uk/news/2014/07/17/academic-asks-lincoln-to-honour-bishop-with-statue/\n\n","date":"July 17, 2014 at 4:42 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-138980","author":"Louis","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"I’ve skimmed that hagiograph, Louis, and frankly consider it half-baked, indeed faintly ludicrous. Science progresses by model building, and models are based on a combination of observation AND thought. It’s thought without observation that characterized the vacuous philosophical discourse  re the natural world prior to the arrival of true experimental scientists like those who founded England’s Royal Society (Newton, Hooke, Boyle etc etc).\nEnough of that. Back to the matter in question.\n It would take too long to address all the evidence for a link between the Lirey Shroud and the Templars right now, under this somewhat inauspicious blog posting. It has been the subject of several blog postings on my dormant WordPress site, receiving scarcely a mention here.\nHere’s just one of several that conveys the gist of my thinking re a Templar connection:\nhttp://shroudofturinwithoutallthehype.wordpress.com/2014/02/19/was-the-mk-1-ts-image-a-presumed-heat-scorch-relaunched-at-lirey-as-a-notional-sweat-imprint/\nHere too is  a summary I wrote for Joel Achenbach’s blog in the Washington Post back in February:\nhttp://www.washingtonpost.com/blogs/achenblog/wp/2014/02/14/the-shroud-of-turin-pseudoscience-and-journalism/?commentID=washingtonpost.com/ECHO/item/1392472957-339-766\nThere is an alternative kind of ‘shroudie’, one who eschews the sensationalism and pseudoscience, and in the case of this retired scientist is patiently exploring alternatives ones that might explain how that length of linen with its scorch-like image appeared in medieval France when it did.  \nI’ve been at it for some two years, but only recently, after experimentation with different types of heat scorch (contact, radiation) have the pieces of the jigsaw begun to assemble into some kind of pattern. \nBriefly, here'[s the current working hypothesis: Jacques de Molay, last Grand Master of the Knights Templar and his closest associates, e.g. Geoffroi de Charney, were all slow-roasted on the same day in Paris 1314. The method of execution closely mirrored that of the martyred St. Lawrence, for which there is much very Shroud like devotional artwork showing a naked or near-naked man forced down onto a grid iron. The surviving Templars wanted to create a tribute or memorial, and having an existing penchant for images on cloth (see Barbara Frale’s finding in the Vatican secret archive) decided to scorch a double front and back image onto linen, as if a ‘hot Templar’ had been wrapped in a shroud. But what to use as a hot template? Here’s where the ambiguity began – they chose a recycled bronze of the crucified Christ, i.e. a life-sized crucifix, which was heated and then had linen pressed against it, with damp overlay, to leave a faint, superficial NEGATIVE image. Maybe they thought that no one would be able to say, looking at a light/dark reversed negative:”Hey that’s Jesus”. Or maybe they wanted folk to make a connection with Jesus, or maybe St.Lawrence.  \nA few decades later, that shroud is now in the hands of the Lord of Lirey, one Geoffroi de Charny, probably de Charney’s nephew (see above) and the possibilities were quickly spotted and realized for morphing the scorched-on image with that of the crucified Jesus. The rest as they say is history. More? Just ask.\n\n","date":"July 17, 2014 at 7:20 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139018","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Colin, I may not agree with a number of things you say,but I understand your point of view. There were indeed many strange ideas and rumours circulating in France in the beginning of the fourteenth century, which is what led the Pope to fear a schism.\nIt is not easy to fill the gap, there are suggestions:\nhttps://www.academia.edu/7447446/Was_there_a_link_between_the_Knights_Templar_and_the_Turin_Shroud_An_interview_with_Dr._Barbara_Frale\nI hope to do further work on this topic shortly, but much will depend on illustrations that will have to be examined.\n\n","date":"July 17, 2014 at 7:51 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139025","author":"Louis","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"The Shroud image does not correspond to any known medieval artistic style, neither painted nor statuary.  It is unlikely that there should be no known record of a life-size statue or bas relief of a Christ laid out in death as shown on the TS.  Such a sculpted work or bronze casting would hardly have passed with no known comment whatsoever.  At least a loin cloth appears to have been de rigeur.  Advances in Science may progress by way of speculation, but it ought to be at least a credible speculation, with at least some minimal supporting evidence.  The lack of knowledge of the detailed forensics and anatomy demonstrable on the TS argue against any such hypothesis.\n\n","date":"July 17, 2014 at 9:52 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139042","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Well, I ‘m no art historian, daveb (are you, btw?) but I know how to scan Google image files. \nThe style of art we see on the TS WAS around in medieval times, and probably earlier too.\nThere are any number of images of a naked man with hands crossed over groin area. The trick is to google St.Lawrence. Example:","date":"July 18, 2014 at 1:14 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139070","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Postscript:  From the word go, I had a gut feeling that there would be a give-away clue to the provenance of the TS, and that it would probably take me far too long to spot the obvious, as has proved to be the case. \nThose crossed hands were the clue – with their bony fingers and absence of thumbs. The imaging is precisely what you expect and get from contact printing (not necessarily with artist’s pigment or Nutella substitute if you include pyrography). \nThinking of which see the work by modern day pyrographic artist Irene Corgiat, including her passable attempt at reproducing the TS.\nhttp://carverscompanion.com/Ezine/Vol7Issue2/KMenendez/KMenendez.html\nNo, she did not use a template. It was not thermal imprinting off a hot template that guarantees a negative image from a positive. It was done free hand. Pyrography can come in different forms.\nThe wiki entry on pyrography (in the broadest sense of the term) informs one that it’s an art form that has existed “since the dawn of recorded history”.\nThe hands on the TS can be seen as prima facie  evidence that it is a contact print (a curious and distinctive negative light/dark reversed image needless to say, as per the rest of the image, outwith most Western art tradition, daveb please note). \nThe STURP  findings re chemical modification of linen carbohydrates, deduced via a process of exclusion (of any conceivable external pigments, Nutella presumably included), make it an odds-on bet we are looking at some kind of pyrographic contact print, aka ‘thermal or maybe thermochemical impactograph’ if you’ll forgive my homespun terminology. \nMPH, guardian of the English language, once told me off for calling it a “scorchograph”. I’m now a chastened but reformed character, at least linguistically, though still ready to inflict neologisms on the blogosphere when its back is turned.\n\n","date":"July 18, 2014 at 2:26 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139077","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"The latest BSTS Newsletter, which Barrie will no doubt publish soon, contains an astonishing attempt by “Kitchen Scientist” Hugh Duncan to draw the entire ventral image using only a soldering iron. It is astonishing successful.\n\n","date":"July 18, 2014 at 4:17 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139102","author":"Hugh Farey","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"“The latest BSTS Newsletter, which Barrie will no doubt publish soon, contains an astonishing attempt by “Kitchen Scientist” Hugh Duncan to draw the entire ventral image using only a soldering iron. It is astonishing successful.”\nOne looks forward to seeing that, Hugh. (Incidentally, why does the BSTS have to piggyback on shroud,com when it’s a 5 minute job to set up a blogsite?)\nBut I still maintain for a whole number of reasons that the NEGATIVE TS image was made as an imprint from 3D “object” onto 2D plane surface. If that view were wrong, and the TS had been drawn freehand, as per Irene Corgiat and now Hugh  Duncan, why draw it as a light/dark reversed negative? OK, there’s an obvious answer, namely that the artist was attempting to simulate a sweat imprint. But there was a well-established history of so-called sweat imprints morphing decade by decade, century by century, into high grade works of art, with positive rather than negative character (the Manopello image being arguably a case in point).\nThe clicher for me re the TS being a passive imprint, warts an’ all, with no artistic input at the imprinting level (template fabrication being a separate issue entirely) are those hands with the skeletal fingers and no thumbs (sorry to repeat myself).  No self-respecting artist would have set out to depict the hands of a newly crucified Jesus in that fashion, making the subject look semi-mummified.\n\n","date":"July 18, 2014 at 4:34 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139106","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Colin, there is a small inner circle deciding what can and what cannot be published in the realm of Shroud studies. They can also upload rubbish, publish ridiculous papers. To qualify you have to be a chummy. You are no fool, haven’t you seen this reflected in the blog? Dan is fair, but the pressure from the circle is evident, justification is needed for why some things have to be posted.\n\n","date":"July 19, 2014 at 11:47 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139304","author":"Louis","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Ooh, that’s a bit sharp, Louis. Are you referring to me as a “small inner circle”? And are you referring to a paper you haven’t seen as “uploaded rubbish” or a “ridiculous paper”? \n“Justification is needed for why some things have to be posted.” Of course, otherwise the shroud world might be flooded with recipes for cheesecake or reviews of Star Wars. But as long as the topic presented was the Shroud of Turin, can you give us an example of something which has been rejected, by me, Barrie or Dan, or for that matter David Rolfe, who publishes Pam Moons ideas, or anyone else who might inhabit the “small inner circle”? I think not.\nEven David Roemer’s essay, which was rightly rejected by the Bari and St Louis conferences because it was nothing to do with the Shroud, has found more publicity here than ever it would have done elseswhere.\n\n","date":"July 19, 2014 at 12:54 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139314","author":"Hugh Farey","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"As for daveb, I agree with him, at least in part. Actually it is not the crossed hands nor the nakedness, nor the alleged anatomical accuarcy, that I find problematical; they pop up here and there in various medieval contexts, from actual burials to depictions of dead bodies. For me, it is the long thin shape and more particularly the double image that seems incompatible with medieval artistry or even relic-forgery. I have attempted (and will continue) to find a context in terms of a reredos, altarcloth or epitaphios, some of which seem promising lines of inquiry, but as it stands, this lack of context is a major argument against a 13th century creation.\n(Sorry daveb, running with the hare and hunting with the hounds again, but there it is!)\n\n","date":"July 18, 2014 at 4:27 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139104","author":"Hugh Farey","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Off topic….I’ve noticed the past few days that there appears to be a misalignment between the left and right shoulders / neck region. In particular, one side is lower than the other as if there was a dislocation. This corresponds with the arm positions on the frontal image ie. the right  shoulder is set lower, as is the right arm.\nThis would seem to be an argument in favour of the image being generated from a real human (dead) body.\nThoughts?\n\n","date":"July 18, 2014 at 3:02 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139088","author":"Thomas","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Oh, I’m a fool alright. Louis, a fool for failing to do contact prints of my own hand and fingers in July 2012, leaving it till July 2014.\nAs far as shroudie conferences (conclaves?) are concerned. one views from afar with bemusement. Nuff said methinks…\nHere’s a link to my current posting. \nhttp://colinb-sciencebuzz.blogspot.fr/2014/07/here-in-just-10-sentences-is-summary.html\nNote the new harder line, prompted by Prof Fanti’s tendentious claim for imaging across air gaps, and my firm conviction that there is no evidence for so highly improbable a process on close scrutiny of the entire TS image. The TS displays as a contact-only image. There is no precedent for imaging across air gaps by non-collimated or non-focused radiation. The air attenuation hypothesis is simply wishful thinking, except for two narrow windows in the microwave region (B.A.Power). Have your ever heard John Jackson, Giulio Fanti etc make mention microwave radiation?\n\n","date":"July 19, 2014 at 12:43 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139313","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Colin, thanks for the comments. There are always corrections and adjustments to be made in scientific theories and calculations, and I presume that this will be done in this case also. Well, we will have to wait to see both Saint Louis and Bari will offer and from what one has read some new theories will be on the programmes, and that is good.\nI am working on the TS-Templar link and may have something new to propose, depending on analysis of images and texts.\n\n","date":"July 19, 2014 at 12:56 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139315","author":"Louis","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Hugh, I can tell you what you are asking for if you can first tell me why you have avoided tackling my comments and began to do so only yesterday, after a long while.\n\n","date":"July 19, 2014 at 1:10 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139317","author":"Louis","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Sorry, Louis, I’m not sure what comments you want me to tackle. Recently you have been mildly discussing the Big Bang and the nature of faith with David Roemer, which was insufficiently connected with the Shroud for me to want to pursue here, and above you have mentioned a Templar connection, about which I am insufficiently informed to be able to say anything useful. In general I only comment if I have something to add to the discussion. Perhaps I simply agree with you most of the time. What has this to do with “inner circles”? If I am part of one, then I’m afraid it’s very small and consists entirely of me, as I do not carry out any correspondence about the Shroud outside this website. To which coterie of esoteric hierarchs did you think I was affiliated? And whose ideas have they suppressed?\n\n","date":"July 19, 2014 at 6:55 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139361","author":"Hugh Farey","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Hugh, I am wondering if you read my comments which Dan reproduced when introducing “A telling interview with Giulio Fanti” on the other thread. That is exactly what I meant, and Dan was fair in uploading the pdf.\nThe line you are following shows that you think for yourself, and that is good. As for the “justification” to upload the pdf sent by me it was needed simply because otherwise the inner circle will have raised eyebrows. There was no reference to you and, as for the rest(comment, 11.47 AM), I stand by what I say.\nIt is a pity that the discussion with David Roemer came to an end. We both agreed that his paper was rightly rejected due to the fact that it had hardly anything to do with the Shroud. I think he has raised important issues, which cannot be swept under the rug, the only objection, on my part, being that these are hooked on to the Shroud.\nI have said that even if the relic is “proved” to be authentic it will still not answer many questions and these also involve some, repeat, some, of the things that David Roemer has been saying. There is a lot more in the box.\n\n","date":"July 19, 2014 at 8:38 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139377","author":"Louis","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Thanks, Louis. I agree that there is plenty to discuss in the Science/Religion field, and have had some interesting exchanges on other sites regarding it, but I like to restrict my activity here just to the Shroud – it maintains focus!\nAs for Giulio Fanti, I am not an anti-Fanti, although I have not had the same success with my little plasma ball as he had. Like various other proposals, however, demonstrating a possible method of making an image is a long way from proof that it must have been created that way.\n\n","date":"July 20, 2014 at 6:13 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139449","author":"Hugh Farey","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Hugh, that is precisely the reason why the exchange on science/religion was restricted to a few lines. I was reminded of mass I used to go for at the London house of a religious order, closer than the nearest Catholic parish. One morning two nice, young priests who had just come back from missionary work in South America spoke about their work instead of giving a sermon. One of them said that he had gone to talk about God in that part of the planet and had found Him there. The faithful were invited to comment and no one said anything. After mass one of the persons who had accompanied me asked why I did not comment. My reply was that it was a topic about which there was so much to discuss that the mass would have to be interrupted and there would just be time to have coffee with the padres after that.   \nWith your science background, and your grasp of physics, I think you will like:\nhttp://www.jesuit.org/blog/index.php/tag/jesuit-brother-guy-consolmagno/\nI hope to clear doubts regarding Professor Fanti methodology shortly, after working on Part II of the Jospice Mattress Imprint paper and additional material on a possible TS- Knights Templar connection. I did not wish to trouble good Father Francis O’Leary because he was busy trying to get as many funds as possible for the Jospice, but it was clear that he was convinced about the imprint formation process. However, the two courses I did in Parapsychology, with a professor and author of several books, one of which was on the mind, and was judged to be the best on the topic by a researcher at London’s SPR, enabled me to distinguish between what is spiritual from what is psychological.\n\n","date":"July 20, 2014 at 11:05 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139478","author":"Louis","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"CB: “Well, I ‘m no art historian, daveb (are you, btw?) but I know how to scan Google image files.”\nAt least one artist in the family is quite enough without my adding to them, though we do have a few other aspirants.\nCheck: http://www.spiritwrestler.com/catalog/index.php?artists_id=3 you’ll find a few interesting images there, but none using nutella. \nI do know there’s a lot more to artistic styles and genres than a mere naked body with hands crossed over the groin.  The TS is unique.  And surprisingly, your “artist” after his amazing discovery whatever it was,  only ever did it once! \nExperiments with cloth draped over models demonstrate that the TS imaging extended for some 4 cm beyond contact, as shown by the various 3-D  investigations, e.g. the Jumper & Jackson work.  This refutes that it is a ‘contact only’ image!\n\n","date":"July 19, 2014 at 5:20 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139352","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"What you have to understand, daveb, is that “draping a cloth over a model” is itself a model, and just one of several. It cannot be assumed a priori to be a valid model, and indeed it is biased in favour of authenticity from the word go. \nIf your starting point is unbiased (or biased in favour of the radiocarbon dating) and you take as axiomatic that a decent and fairly complete imprint off a 3D subject requires not just contact between subject and cloth but contact under pressure, to ensure optimal imprinting of relief, then your model has to consider the ways in which pressure can be applied. In fact there are two main ones: linen underneath the template, with pressure applied from above, and linen on top of template, with manual moulding of fabric to relief.\nIt is then the task of the modeller to scrutinize the TS image closely, and attempt to deduce which of those configurations best fits the facts. The degree of tenting (short-cutting) of fabric between prominences is a major diagnostic feature. Other things being equal, one expects more tenting if a template is pressed down into linen. \nThere is indeed evidence of tenting, especially between crossed hands and abdomen, as judged by the lack of imaging around the hands. So who is right: Prof Fanti, who says the imaging is OK on the belly, and would presumably subscribe to that plucked-from-the-air 3-4 cm allowable air gap, or this blogger who says the evidence from the lack of imaging alone in that region is fully consistent  with a contact-only model?  The clincher for me is the ability to model the peculiar hands with bony seemingly separated fingers and no thumbs by pressing one’s Nutella-coated hand (fingers touching, no gaps) down onto linen. The thumb cannot be imaged, and tenting of linen between fingers plus bony centres results in the peculiar imaging (the subject of so-much wacky experimentation, like medics self-administering  radio-technetium to test for “x-ray type imaging” (see those heroic experiments by August Accetti). \nI am now entirely convinced that the contact model fits far too many assorted facts to be untrue, and I never had much time anyway for radiation theories that allow imaging across air gaps. Where’s the supporting physics as distinct from qualifying assumptions, like the 3-4cm air gap), read fudge factors? Which type of radiation is operating? Where are the model images, comparable to those one can produce by contact scorching?  Why is there always a deafening silence when one poses these questions? Why does Dan get into a lather when I refer to Mickey Mouse science? Is it because I name names? What am I supposed to do: refer to Mechanical Engineer X or Theophysicist Y?\n\n","date":"July 19, 2014 at 6:08 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139357","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Colin, Thank you for taking the trouble of a detailed response.\nI can readily understand the reason why the thumb will not be imaged in your contact experiment for the back of the hand.  It so happens that this peculiarity of the wrist is well-known to lawn-bowlers, as they need to be aware of it to obtain accuracy in bowling to their chosen line.  There is a natural limit to how far the hand can be twisted outwards, but inwardly no problem. \nIn a good image of the Shroud (e.g. Shroud 2) there is a narrow band immediately around the hands which does not seem to be imaged.  The narrowest part of my wrists (back of hand to palm) is 5 cm.  If I cross them one over the other, that’s 10 cm and clearly beyond the approx 4 cm which others have asserted is the range within which imaging can occur.  So the fact that there’s no image around the crossed hands is to be expected.  However the non-imaged band is itself quite a narrow one, and the belly is certainly visible.  \nA number of reasons have been asserted as to why the thumbs are not visible.  Barbet asserted that his experiments in driving a nail through the wrist of amputated hands resulted in severing the median nerve so that the thumb reflexed into the palm.  Zugibe asserted that the thumb in the palm was in its natural position anyway.  So a contact-only theory is not necessary for the thumb. \nI have mentioned elsewhere that it is pretty well impossible to obtain perfect contact between a real fabric and any object which has 3 dimensional curvature.  It can only succeed to the extent that there is sufficient give or stretch in the fabric, which even for real fabrics is quite limited unless it is rubber or lycra or some-such, and certainly linen is quite limited.  We could only expect contact at the high points of the object.  But that is not the case with the Shroud image, where there certainly seems to be a small air gap across which imaging still succeeded in occurring.\n\n","date":"July 19, 2014 at 8:24 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139372","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Thanks too for your detailed reply to my detailed reply, daveb, even if I profoundly disagree with most of its contentions.  As before, it’s not possible to respond to all points. Let’s focus on the most crucial aspect, namely that “permissible” 3-4 cm air gap, routinely conjured up, at least on the internet, like a Hogwarts magical spell (or missile-deflecting force field if your prefer Star Wars to Harry Potter).\nAt least you agree that there’s a non-imaged zone around the hands (Giulio Fanti please note) but then you qualify that by saying, in effect  “Ah, but it’s not very wide, and there’s still some belly visible”.  \nIn my book, not written by  J.K.Rowling, if  there’s no contact, then there’s no imaging. That’s the uncompromising contact model of image-imprinting, the one I am defending against proposed (or more generally assumed) magical mystery radiation-imaging.\nNote the self-denying ordinance. Defending the contact-image model requires far greater self-discipline than the oh-so-malleable radiation model, one that self-indulgently allows imaging in expected non-contact zones provided the air gaps don’t exceed the generously-provisioned 3-4 cm  air gap.\nOK, so that forces me to confine attention to locations where any air gap is expected to be less than the pseudo-scientific 3-4cm fudge factor. But if one sees failure to image, no matter how restricted the zone, then that’s it for the radiationist school of thought, correction, fantasizing.  Puff of white smoke – gone. Poetic justice, some might think.\nThere is indeed just such a location (shame there aren’t more). What’s more it’s plain for all to see on those crossed hands. Look carefully at the region where the edge of the more visible upper hand overlaps the hand it covers..\nI’ll add a labelled photograph to my site, then copy-and-paste its location here in a comment to follow later, maybe not till later in the day (social engagements).\nPrepare to be put on the spot, all you shameless proponents of radiation modelling who through deploying your magical 3-4 cm smokescreen  have got away with mystery-mongering for far too long, bringing science and scientists into disrepute.\n\n","date":"July 20, 2014 at 3:50 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139426","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"PS: here’s a link to that graphic. Look inside the yellow rectangle. Spot the non-imaged zone in the angle where the two hands overlap.\n\nReminder: it’s NOT a photograph. It’s better described as a contact print, or what I’ve previously called an ‘impactograph’.\nRIP radiation twaddle.\n\n","date":"July 20, 2014 at 5:03 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139442","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Trouble is, look a bit further to the left, where the fingers of one hand overlie the thigh. Should I expect a similar non-contact zone fringing them? What’s more, although the bony fingers are evident, the space between them is the same colour as the thigh they overlie, not the background colour of the cloth. How do we think that discolouration occurred?\n\n","date":"July 20, 2014 at 8:38 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139460","author":"Hugh Farey","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Definitely Colin likes to shoot himself in the foot.\nThis is an obvious selective bias.\nLook at the ulnar side of the right hand, there is an image, yellow rectangle concerns only the radial side.\nNow, cross your left hand over your right hand and move it slightly, you’ll rub the radial part of the dorsal face of the right hand, leaving the unlnar side undisturbed, precisely where you get the image. \nRIP impactograph twaddle.\n\n","date":"July 20, 2014 at 9:26 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139470","author":"anoxie","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"It looks far less persuasive when viewed in negative.  The left hand is over the right hand.  So the back of the left hand is about 5 cm (> 4 cm) above the back of the right hand, and would be nearly double that over the upper left leg.  Furthermore there are four V intersections formed where the hands cross over the body and where tenting would occur.  Nevertheless there seems to be little loss of imaging there. \nI have not been a great advocate of any radiation theory, although I’m on record as saying that I suspect radon may have had some kind of role in image resolution.  The 3-4 cm measurement you deplore, is no magical number, but has been supported by experiments in draping with live models.  \nI’m still old-fashioned enough not yet to have abandoned much of what Ray Rogers conceived as causing the image, essentially Maillard, although I surmise inadequate by itself.  I am not persuaded that the non-imaging area you highlight deals any kind of death-blow to any radiation theory, Roger’s Maillard, nor that any kind of ‘contact-only’ conclusion has been adequately demonstrated.  \nBy the way, Colin, do you have any measurements concerning the minimum thickness of your wrists?\n\n","date":"July 20, 2014 at 7:52 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139454","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"“The 3-4 cm measurement you deplore, is no magical number, but has been supported by experiments in draping with live models.”\nAbout these experiments, daveb: what kind of radiation was used, and what kind of images were produced?\nOr are we still talking here about loose draping and resulting cloth-body distance measurement alone, which I went to some trouble in an earlier comment to explain was just one of several cloth-body configurations, with nothing but the cloth’s own weight to provide pressure? Do please explain yourself because it gets tedious having to respond time and again to the same comment if it’s in fact irrelevant to the issue under consideration.  \nThe issue is the expected differences in outcome between imaging by contact and imaging by radiation (especially when the source of radiation is unspecified, and/or the reader is left to guess how the radiation in question is able even to discolor linen, far less project an image across air gaps.\n\n","date":"July 21, 2014 at 1:05 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139589","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"From Hugh:\n“Trouble is, look a bit further to the left, where the fingers of one hand overlie the thigh. Should I expect a similar non-contact zone fringing them? What’s more, although the bony fingers are evident, the space between them is the same colour as the thigh they overlie, not the background colour of the cloth. How do we think that discoloration occurred?”\nHugh, in posing these entirely reasonable questions, which may or may not have a satisfactory answer, you are attempting to put the contact-imprint model on the spot.\nFair enough. I’ve been fielding objections to the so-called scorch hypothesis for some 30 months, and invariably find they are based on pure supposition and dare I say deep-seated  prejudice, rather than systematic experimentation with model scorches, properly designed to eliminate bias (TH please note).\nBut today, the boot is on the other foot. I am pointing to a zone where one hand abuts on the other, and challenging the radiationists to explain why it’s not imaged in their model. The maximum height difference between one of my own hands placed on top of the other is certainly no more than 4cm, and the average difference is 3cm or less. so that the “no imaging for air gaps greater than 3-4 cm”  rule, which I have to say I regard as highly self-serving and unscientific,  simply cannot be used to explain the (relative) absence of imaging.\nAs I say, today is the day for for the proponents of radiation  to explain absence of imaging, at the chosen locale relative to immediate surrounds, where imaging would be predicted. Today is not the day to be telling me that there’s maybe still a bit of imaging, relative to reference points elsewhere. It’s all to do with the major differences to be expected between one  model and another, as a necessary prelude  to scientific shortlisting of priorities and rational choice of future research direction. Let’s not get too bogged down in the minutiae at this stage.There’s a time and a place for everything. Now is the time to look at the big picture.\nPS: Remember the conversation we had on my site a while ago, Hugh, on discoloration of linen in convection ovens at temperatures below those that cause immediate scorching?  I suspect that some of your questions are answered by considering the diffuse browning action of hot air, temporarily confined between template and linen, the precise amount varying in different imprinting scenarios. Note that Luigi Garlaschelli used an air oven to accelerate background discoloration (artificial “ageing”) as well as assist the chemical etching action on linen fibres with his acid-contaminated ochre made with medieval technology (calcining of green vitriol).\n Convection currents carry far more joules of thermal energy per unit time than radiation across air gaps, due to the mass as well as temperature term in transported heat. You as a physics teacher will know that (though I suspect that lay folk  know that instinctively too, from oven baking at home gently and thoroughly in the convected hot air setting, not radiation mode from red hot elements.).  \n\n","date":"July 20, 2014 at 2:04 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139495","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"CB: “The maximum height difference between one of my own hands placed on top of the other is certainly no more than 4cm, and the average difference is 3cm or less …”  You do have skinny hands.  \nLeft palm covers dorsal right wrist, masking assumed right wrist wound;  left little finger at mid-carpal of right hand; left first finger above right wrist;  thickness of left palm = 4 cm; if left thumb reflexed into left palm, add another 1 cm;  thickness of right wrist = 5 cm;  Conclusion:  dorsal of left hand is 9 – 10 cm above pubic area! Consequently inevitable air gap well exceeding image limit of 4 cm.\n\n","date":"July 20, 2014 at 4:39 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139510","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Sorry, daveB, but that is obscurantist mumbo jumbo from start to finish, typical of this site’s fantasizing shroudology. \nEven if some parts of a height difference between two planes were to exceed the mumbo jumbo 3-4 cm guidelines, one  would still expect there to be imaging of those parts below that cut-off point. Where is it?  I don’t see it, certainly not at the crossed hands, where the step-difference is largely if not entirely below 3-4 cm.\nTalk of “wrist wounds” and “reflexed left thumbs” in the context of a detached, objective model-centred enquiry that attempts to elucidate likely imaging mechanisms is also, I have to say, mumbo jumbo.\n\n","date":"July 20, 2014 at 4:58 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139513","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"A hypothetical non-existent anatomically perfect bas-relief model is mumbo-jumbo.  Objective measurements on hand thicknesses and my attempts to explain their relative geometrical location are not.  Nor is the fact of tenting of cloth with resultant air gaps over three-dimensional curvatures, which is a mathematically provable theorem in topology, and demonstrable with a simple tea towel over crossed hands. \nSorry you’re peeved at reaction to your latest pet theory!\n\n","date":"July 21, 2014 at 1:11 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139590","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"So what about these 3D-enhanced images that I reported a while back, obtained by pressing a hot 3D brass crucifix into linen.\nhttp://shroudofturinwithoutallthehype.files.wordpress.com/2013/11/dorsal-images-in-imagej-cropped.png?w=640&h=389\n(link to image only)\nIn what way are those images hypothetically non-existent or topologically imperfect? \nDespite any imperfections you may (or may not) see in those images, please explain how comparable ones could be obtained using radiation across air gaps. Again, I ask you to specify the nature of that radiation.  Which part of the electromagnetic spectrum are we talking about?\n\n","date":"July 21, 2014 at 1:22 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139595","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Sorry you’re peeved at reaction to your latest pet theory!\nPeeved? Pet theory?\nFar from it. I’ve simply firmed up on 2.5 years of investigation, where it’s no longer “the TS image could have been made by contact imprinting” to “the TS image WAS made was contact imprinting”.\nDespite those endless references to linen draped loosely over volunteers, we are still waiting to learn how the imaging is or was achieved.\n It may be a long wait, given that no one has bothered even now, 25 years post-STURP,  to specify the precise nature of the radiation, substituting vague references to earthquakes, radon, corona discharges etc etc. \nTime methinks to drop the totemic references to cloth-body distances, and cease being so coy about the nature of this mysterious energy, one that is able to project across air gaps and somehow imprint a negative image. \nNope, I’m not miffed – just bemused at the ability of folk to pay lip service in the first instance to airy fairy ideas re radiation,  and then proceed to elevate them to   a priori assumptions devoid of supporting experimental evidence, excluding those meticulously measured air gaps under glorified dust covers.\n\n","date":"July 21, 2014 at 5:09 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139619","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"I wasn’t commenting on your scorch experiments.  I’m leaving that to others more qualified to do so.  For all I know, despite some commentators’ objections, they might be quite helpful in coming to an understanding of whatever was the actual cause of the Shroud image.  \nMy mumbo-jumbo comment was referring to the basic concept that the actual image was in fact formed by some artisan constructing a life-size, anatomically perfect statue or bas-relief, of a prone Christ laid out in death, showing all his wounds and injuries; not only complying with the gospel accounts, but in fact even more medically and archaeologically accurate, at a time when Galen’s text was still the standard manual on medical matters; that such a template has never been discovered nor is there any known record or report of it;  that he only ever did it once without repeating it; that there is no trace or tradition of his early experiments and failures;  that he saw value in producing what can now only be understood as a photographic negative result; and that such accurate realism has never been previously demonstrated in the medieval arts until the Renaissance period.  \nI consider that proposing such a catalogue of improbabilities might qualify as mumbo-jumbo!  However if it has led to your carrying out any enlightening experimental work, it might even then still be worthwhile mumbo-jumbo! \nIt seems that the Canadian meteorologist Bernard A Power whose credentials you recently advocated on this site, favoured the microwave and UV bands of radiation as a possible imaging agent.  I am unable to comment on the merits of this viewpoint.  I have a personal view, quite unsubstantiated, that radiation may have been involved, but perhaps not necessarily as the primary cause.  It may well have been alpha particles.\n\n","date":"July 21, 2014 at 6:00 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139624","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"“anatomically perfect statue” : Well, this anatomically masterpiece statue was certainly not used to show the image of a body featuring a tiny forehead , a head too large for the body, no neck , abnormally long arms of different lengths, no navel , no ears,\n\n","date":"July 21, 2014 at 8:33 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139639","author":"PHPL","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"To me it looks as though a rectangular object blocked the imaging process in the yellow box highlighted. It’s too defined. I would expect a gradual transition into the imaged area.\n\n","date":"July 20, 2014 at 5:08 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139515","author":"ChrisB","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Would you care to speculate on the nature of  the rectangular object that interfered with imaging?\nTestable (scientific) hypothesis?\nNope.  Here we see yet one more example of shroudology resorting to evasive, obscurantist mumbo jumbo.\n If resorting to mumbo jumbo, then please preface with the initials MJ, to spare me and other scientists from having to read it. Life’s too short (at my time of life) to be continually confronted with MJ.\n\n","date":"July 20, 2014 at 5:22 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139516","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Why would the nature of the object matter?\nIt still remains that the non imaged area is too defined to be what you think it is.\n\n","date":"July 21, 2014 at 12:41 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139667","author":"ChrisB","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Yes, it’s “too defined” as you say, which is what makes it interesting, and indeed an important spy clue to the mechanism of imaging.\nIts geometrical regularity, which you earlier described as a rectangle, is easily explained in a contact-only imaging process.\n In a situation where cloth, even under some pressure, cannot easily penetrate into an angle, ie. between a vertical and horizontal plane, it tends to shortcut, i.e. to ‘tent’ across the gap, in a manner which, seen in cross-section, is the hypotenuse of a right-angled triangle.\nThe pale non-imaged band on the TS within my yellow rectangle is the base of that triangle, where imaging could not occur due to loss of contact between cloth and hot template. \nForget then about imported rectangles. Think about the difficulty of getting cloth to follow intricate 3D contours, especially a pair of right angle turns, closely spaced.\n\n","date":"July 21, 2014 at 1:12 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139671","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"There’s an easy answer to all this conjecture, which I am sure is deeply unsatisfactory to many of you….\nThe image was created by the miracle of the resurrection, a unique and utterly marvelous event, which is clearly not replicable. Many great and not so great minds have grappled with the issue over many years, and we seem as far away as ever from explaining it satisfactorily.\nI’m happy with leaving it to God’s mysterious work. I sure as heck enjoy all the theorising though!\nAnd I always keep an open mind that one of you, one day, might provide a compelling scientific explanation.\nBut I won’t be holding my breath!\n\n","date":"July 21, 2014 at 3:28 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139609","author":"Thomas","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Assuming, for a moment, a “hot scorch” of some kind, I hope I’m agreeing with Colin in seeing two mechanisms responsible for the variations in image density. The first is the variation in pressure where the two surfaces (‘body’ and cloth) are in contact, and the second a much more diffuse convection effect where they are not. Dr Power quotes John Jackson’s list of intensity/distance correlations which, when graphed, clearly show a steep line over the first centimetre or two (which I would interpret as the ‘contact’ zone) and a much more flatter line between that distance and four or five centimetres (the ‘convection’ zone). In other words a very small difference in contact pressure would produce a large intensity variation, while quite a large difference in distance in non-contact zones has little effect on image intensity.\nThe radiation hypothesis has to cope with a number of difficulties; the fact that it has to be vertically collimated, and the severe distance/intensity attenuation being the biggest. Also the fact that even between points of the same distance, at least as determined by Jackson, the intensity varies by a factor of two.\nAnd, yes, Thomas, scientist to the core though I be, I have never ruled out the ‘miracle’ hypothesis. I could only do that from a theological viewpoint!\n\n","date":"July 21, 2014 at 5:35 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139620","author":"Hugh Farey","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"The focus yesterday was on the overlap of the hands, where the expected cloth-body distance could be as much as 4cm, so the relative absence of imaging can be explained away in terms of “attenuation of radiation” (one cop out) or, courtesy of Hugh’s comment, weakening of convection currents of hot gas, which is interesting, and something I’ve muttered about previously, but is probably still a cop out (while recognizing that convection may have contributed to the TS’s image fuzziness or background-yellowing).  Out of interest, since when has John Jackson been talking about convection, rather than radiation attenuation?\nWhat one needs to do is locate a part of the image where the expected cloth-body distance is 1cm or less. If there’s still weak or essentially no imaging, then it’s striking confirmation of contact-only imprinting, and curtains for radiation/convection models that allow an air gap.\nThere is indeed just such a location on the TS that provides the crucial sub-1cm test. What’s more, it’s in my ‘Nutellograph” above (a handy term plagiarized from the site’s host, one who can never be accused of taking my ideas too seriously).\nClue: fingers that are held together produce a contact imprint that makes them appear as if separated.  Ask yourself why. Think cloth-finger distance (sub-1cm).\n\n","date":"July 21, 2014 at 6:08 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139625","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Hugh – never ruled it out, but consider highly unlikely?\n\n","date":"July 21, 2014 at 6:51 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139631","author":"Thomas","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"How do we know what sort of gases, or heat or substance an instantaniously dematerialisibg body could generate and from there how image formation could occur?\nI suspect science is not able to model  or predict this but let me know if I am wrong.\nof course dematerialisation is totally different to decomposition\n\n","date":"July 21, 2014 at 7:05 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139633","author":"Thomas","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Colin: I don’t think Jackson ever considered convection, probably for reasons of image clarity.\nThomas: Scientifically, a process intrinsically inexplicable cannot be assessed for probability, Theologically,, an inherently irrational process defies the principle of rationality, which is a.well-established aspect of Catholic Christianity. Miracles are not subjectible to scientific investigation.\n\n","date":"July 21, 2014 at 11:25 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139658","author":"Hugh Farey","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Hugh, the reference to miracles in Catholicism was appropriate. One case at your end involved a Hindu-born surgeon at King’s College Hospital, London and a Catholic child. It even seems to have merited the attention of RD. The last line in the link is what you commented:\nhttp://old.richarddawkins.net/articles/1164-baby-39-s-39-miracle-39-recovery-in-british-hospital-to-give-malta-its-first-saint\n\n","date":"July 21, 2014 at 12:20 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139664","author":"Louis","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Look at:\n\nand then:\n\nAny comment?\n\n","date":"July 21, 2014 at 8:50 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139644","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Colin should buy a microscope and a pair of glasses, but it’s old news.\n\n","date":"July 21, 2014 at 10:24 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139651","author":"anoxie","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"My first comment:\nThe first picture (http://imgur.com/H5GsK5I) comes from a HD photograph of the region in question. I have transformed the original color photo (the best one available) into a grey-scale photo because the famous ‘banding effect’ is much more easy to see. Note that in this first photo I did not enhance the contrast.\nThe second photograph (http://imgur.com/IDrEi7E) focus on the area of interest (the so-called ‘non imaged zone’) along the ulnar side (not radial, sorry Anoxie) of the upper hand. This time it’s contrast enhanced.\nHere is a link to the first photograph with some markers in order to help you to see and understand what follows:\n\n1) This zone has definitely an almost perfect triangular shape.\nWhy?\nBecause it is at the intersection of two light bands: A and B (the vertical band B being much more easy to see than the horizontal band A).\nWhen a light band intersects another one in the image the image density is lower.\nThis has been shown by Rogers and the pictures shown here demonstrate that very clearly.\nThe fact that the area in question has an abnormal triangular shape strongly suggests that the banding effect occurs.\n2) Is there an faint image in this area?\nThe main difficulty is to know how would a non imaged zone appear in this area?. In other words what is the standard density of a ‘non-image’ (‘background-only density’) in this particular area?\nI have no definitive answer. However, since the triangular zone pertains to band B, It seems reasonable to take it as a non image density standard for this band. In this case, the triangular area being slightly darker than the standard ‘non-image’ reference might be an evidence (not a proof) that the so-called ‘non imaged zone’ bears in fact a very faint image, almost invisible because of the banding effect.\n3) The statement 2 above is heightened by the fact that the adjacent areas C and D are clearly imaged.\n4) The so-called gasps between the fingers. If gasp means ‘no image at all’ this is false.\nThere is clearly a faint image and no ‘gasp’ between the fingers. \nThe main question is: ‘contact-only’ (whatever the method) or ‘contact+action at distance’ in order to explain the TS image.\nThis post does not answer but at least it shows that thinks are not as simple as some people think.\nMore later.\n\n","date":"July 21, 2014 at 2:41 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139675","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"“cross your left hand over your right hand and move it slightly, you’ll rub the radial part of the dorsal face of the right hand, leaving the unlnar side undisturbed,”\nI don’t change a single word. \nThe TS man has his left hand over his right hand.\nYelow rectangle is centered on the radial side of the dorsal side of the (anatomical) right hand of the TS man (A-B) where you can see a faint image (Colin’s selection bias), whereas on the ulnar side of the dorsal side of the right hand you can see a much clearer image (right hand – D).\n(A-B) and (A-C) are on the radial side.\n\n","date":"July 21, 2014 at 3:27 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139679","author":"anoxie","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"“This zone has an almost perfect triangular shape”.\nWhat is a “perfect triangle” in the context of the TS image?  Perfect in what sense? The term “perfect” is meaningless if all one is doing is looking for banding effects that can only emphasize two out of three sides of one’s “perfect” triangle, i.e. the vertical and horizontal, but NOT the hypotenuse. That’s without putting TH’s allegedly superior black-and-white photographs alongside the “as is” Durante 2002 image from Shroud Scope. When one performs careful changes in contrast, first to increase, then to decrease, one appreciates there is nothing “perfect” about the so-called triangle, given, among other things,  the substantial image density in the area of the imaginary right angle of the imaginary perfect triangle.\nThis entire comment is pseudo-geometry:  it tries to explain away the region of interest as an artefact of banding. It is nothing of the sort.\nIncidentally, “gasp” must surely be a typo. It would surely have been “gaps”. \nOh, and did Ray Rogers RIP really say that “when one light band intersects another one in the image the image density is lower”?  I hope not, since in terms of what makes an image darker or lighter (presence or absence of pigment or coloured pixels) that statement would be profoundly unscientific.\n\n","date":"July 21, 2014 at 7:14 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139707","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Sorry for the typo. Yes “gasp” must be read “gaps”.\nYou, CB wrote:\n““This zone has an almost perfect triangular shape”.\nWhat is a “perfect triangle” in the context of the TS image? Perfect in what sense? The term “perfect” is meaningless if all one is doing is looking for banding effects that can only emphasize two out of three sides of one’s “perfect” triangle, i.e. the vertical and horizontal, but NOT the hypotenuse. ”\nYou can not seriously extract a short sentence out of its context. The hypotenuse  side obviously consists of a strong image. Do you really think I/we are so stupid ?   \n“This entire comment is pseudo-geometry: it tries to explain away the region of interest as an artifact of banding. It is nothing of the sort.”\nNot at all.\nThe question is: is there a faint image in that area? I only wished to show that one can not answer without taking into account the banding effect because there is an obvious correlation between the borders of this “non imaged area” and a very bright large vertical band .\nCB: ” Oh, and did Ray Rogers RIP really say that “when one light band intersects another one in the image the image density is lower”? I hope not, since in terms of what makes an image darker or lighter (presence or absence of pigment or coloured pixels) that statement would be profoundly unscientific.”\nSee:\nhttp://www.shroud.com/pdfs/rogers5faqs.pdf\n“In ultraviolet-fluorescence photographs (see Hands UV). Both warp and weft yarns show this property. Some areas show darker warp yarns and some show darker weft yarns. In some places bands of darker color cross. In other places bands of lighter color cross. The effect is somewhat like a plaid”. \n And: “Anna Maria Donadoni, a curator at the Museum of Egyptology in Turin, pointed out locations where batches of yarn ended in the weave and new yarn had been inserted in order to continue weaving. The yarn ends were laid side by\nside, and the weave was compressed with the comb. The ends are often visible, and the overlaps correspond to zones of different color in the weave. The different batches of yarn show different colors.\nWhere darker bands of yarn intersect image areas, the image is darker. Where lighter bands intersect an image area, the image appears lighter. This proves that the image color is not a result of reactions in the cellulose of the linen.\nSome impurities on the surface of the different batches of yarn produced the image color. This observation is extremely important when tests are being made on image-formation hypotheses. If image color is not simply a result of color\nformation in the cellulose of the linen fibers, image formation must be a much more complex process than we originally thought.”\nHugh: thank you for your comments.\nThere are different kinds of bands on the TS.\nMore later.\n\n","date":"July 22, 2014 at 4:32 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139838","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"I’ve read nothing here or in TH’s previous comment to cause me to change my mind. In fact, I’ve just added the failure of imaging where one hand meets the other to a list of 10 points, summarizing the Shroud Scope evidence for imprinting-by-direct-physical-contact only, with no air gaps allowed (post in preparation).\n\n","date":"July 22, 2014 at 5:03 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139843","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"The “banding effect” is presumably brought about by two possible causes, both related to the treatment of the different hanks of yarn of which the shroud is composed. I would predict that each warp thread was made of its own hank, and therefore that vertical bands of different intensity would occur randomly across the image, giving irregular widths of lighter and darker areas. Each weft hank, on the other hand, would be woven across and back until it was used up, and a new hank attached to the shuttle. This would result in horizontal bands of approximately uniform width on the image. The intersection of these bands would produce a vaguely chequered effect, ranging from light (where two light bands intersect) through medium (one light, one dark), to dark (two dark bands), with endless graduations in between as the colour of each band varies anyway. This pattern should be seen all over the Shroud, even in non-image areas. If the image is related to the treatment of the cloth, then indeed light image areas could be less responsive to whatever caused the image, producing a less intense image, and dark areas more so, producing a more intense image. This would vindicate Rogers’s suggestion. The exact reverse of this could in theory be also the case!\nI’m in Kathmandu just at present and do not have ImageJ with me, but it would be instructive to take a vertical strip or two, perhaps one centimetre wide, of non-image, to see if it produced approximately evenly distributed variations in intensity (or height), and a horizontal image or two of non-image to see if it produced random variations.\n\n","date":"July 22, 2014 at 12:40 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139733","author":"Hugh Farey","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Hi Hugh,\n                Great to know that you are now in Nepal. Enjoy your trip Sir ! Are you going to climb mount Everest ? If you see the Yeti, please don’t forget to take photos of it.\n\n","date":"July 22, 2014 at 1:39 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139739","author":"PHPL","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Ahhh the yeti, up there with big foot and the shroud for the skeptic\n\n","date":"July 22, 2014 at 4:02 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139764","author":"Thomas","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"In the good old days, before there was much security about these things, I slipped a few rupees to the monk responsible for guarding the yeti scalp at Pangboche and tried it on as a hat. I believe it had already been identified as the much stretched and distorted skin of a serow deer even then. \nMeanwhile, I was disappointed while investigating Shroud 2.0 (no computer, you understand, but I’ve brought an iPad!). There are bands all right, very clear, very regular, but, contrary to my hypothesis above, in the longitudinal direction! On closer inspection, they turn out to be artifacts of the photography. The shadows cast by the threads as they lie in one direction of weave are blacker than those in the other direction. Clearly we must be careful when we look at photographs of supposed bands…\n\n","date":"July 22, 2014 at 6:49 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-139783","author":"Hugh Farey","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Thibault Heimburger wrote :\n“The question is: is there a faint image in that area?”\nI guess “that area” is the (A-B) triangle, it’s a banding effect as you’ve suggested.\nNote the slight misalignement of the 5th right finger.\n\n","date":"July 24, 2014 at 3:44 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140091","author":"anoxie","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"http://colinb-sciencebuzz.blogspot.fr/2014/07/the-turin-shroud-looks-for-all-world.html\nCongratulations Colin (sincerely).\nCould you please give us a large photograph (as large as possible) of:\n\nI mean the scorch imprints and the 3D renderings.\nThank you in advance\n\n","date":"July 25, 2014 at 4:19 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140345","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Thanks TH. None of my pictures are reduced in size before I post them, so you should be able to copy/save straight off the original posting:\nhttp://shroudofturinwithoutallthehype.wordpress.com/2013/11/14/a-challenging-scorch-assignment-that-i-had-been-putting-off-and-off-and-off/\nHave you tried clicking once or twice on images of interest to get a full screen display? It usually works in my experience.\nDid you see the little time bomb added to my current posting (LOTTO is now enjoined with LUWU for frontal and dorsal imprinting respectively).\nThank you John P Jackson for providing (back in 1991!) that gem of information re the different character of the frontal v dorsal images which I’ve only just unearthed. Thanks to Stephen Jones for getting JPJ to publish it in full on his site. (Shame about the conspiracy theories).\nhttp://theshroudofturin.blogspot.co.uk/2012/01/john-p-jackson-unconventional.html\n\n","date":"July 25, 2014 at 4:45 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140351","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"It’s a nice posting Colin.\nWould you concur that – at least theoretically – the image could also be explained\nby a miraculous contact process at resurrection?\nBecause I still have a few problems with a medieval artisan theory, including:\n– “Sweat mimicking” – as far as I know the “sweat image” of history related to the face, not the whole body.\n– The buttocks! This still does not make sense to me in terms of medieval sensibility, with the VAST MAJORITY of historical imagery protecting Christ’s modesty with loin cloth.\nI realise there is the odd depiction of a fully nude Jesus, but a nude Jesus depicted in a manuscript (always with hands protecting modesty and no buttocks on display) is entirely different to a nude human size Jesus depicted for public showing!\n\n","date":"July 25, 2014 at 6:44 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140366","author":"Thomas","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"It’s a nice posting Colin.\nThank you\nWould you concur that – at least theoretically – the image could also be explained\nby a miraculous contact process at resurrection?\nDunno. At the risk of appearing evasive, I admit to some difficulty with a sentence that has the words “theoretically” and “miraculous” so close together. Oxymoronic?\nBecause I still have a few problems with a medieval artisan theory, including:\n– “Sweat mimicking” – as far as I know the “sweat image” of history related to the face, not the whole body.\nYes, it was an audacious idea on someone’s part to eclipse the then crowd-drawing Veil of Veronica with something bigger and better. But the marketing instincts were sound, enlarging (literally) on an existing idea, since that ambitious quantum-leap was finally able to win public acceptance (despite opposition from the indignant local bishop etc). Who’s to say that the ‘sweat imprint’ idea was not just an intermediate one, with a newer ‘resurrection imprint’ narrative gradually taking its place? The latter could have been a defensive ploy too (to prevent imitations popping up everywhere, given there can only be one Resurrection, and thus only one genuine Shroud).\n The buttocks! This still does not make sense to me in terms of medieval sensibility, with the VAST MAJORITY of historical imagery protecting Christ’s modesty with loin cloth.\nI realize there is the odd depiction of a fully nude Jesus, but a nude Jesus depicted in a manuscript (always with hands protecting modesty and no buttocks on display) is entirely different to a nude human size Jesus depicted for public showing!\nI’m not sure that a putative “sweat imprint” of a naked man on linen, a negative faint and fuzzy one at that, would have been viewed in quite the same way as one painted with dense pigment on canvas especially when only on temporary fleeting display. Besides, being an image on a burial shroud,  it would remind pilgrims of the state in which all of them enter and finally exit the world, being another factor helping to suppress usual sensibilities.\nSudden thought: might the impressive number of scourge marks, 372 in all we are told, distributed over most of the body, buttocks included,  be said to have served a kind of  ‘clothing’ effect?  Maybe their masking action helped prevent elderly spinster ladies from going into a swoon. Or if they did, it could be blamed on the sight of all that blood, as distinct from bare skin.\n\n","date":"July 26, 2014 at 12:34 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140413","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Mmmmmmm\n\n","date":"July 26, 2014 at 2:49 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140433","author":"Thomas","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Hmmm. I think you’ve maybe overdone it with the m’s, but I’m willing to give you the benefit of the doubt.\n\n","date":"July 26, 2014 at 3:09 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140439","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"I can think of no instance where there has been any difficulty in distinguishing the photograph of a man, and one of his statue or for that matter of a bas relief.  The Shroud was known in Europe for over 500 years, and then Secondo Pia took his photographs in 1898, and that changed everything.  The negative was not of a statue or of any other effigy, but was immediately recognised as the photograph of a man, albeit a corpse.  Yes, there were dissenters, notably Thurston and Chevalier, but in 1931, Guiseppe Enrie took even better photographs.    Most of the attempts to replicate the Shroud image with few exceptions are readily recognised for what they are, bold attempts as shams and fakes,  The skeptics will have a case when they are able to produce a photographic negative that looks like a human corpse laid out in death, which cannot be easily refuted as such.  To date I believe that has yet to be achieved.\n\n","date":"July 26, 2014 at 5:52 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140461","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Methinks you may be underestimating the ability of tone inversion applied to a NEGATIVE image to produce a positive that’s as good, if not better, than a one-step positive.\nOne can demonstrate the quantum leap in image enhancement, simply by making a crude sketch of the TS image in charcoal, then reversing tones in ImageJ or similar:\nhttp://shroudofturinwithoutallthehype.wordpress.com/2012/05/02/a-scientists-eye-view-of-how-the-iconic-turin-shroud-image-could-have-come-into-being-a-happy-accident-of-thermographic-and-photographic-inversion/\nThe amazing softening effect, and dare one say semi-3D look (that’s before applying 3D-enhacement software) is explicable when one recalls that the harsher black zones of the negative are relegated to white or grey space, while the initial “pure” white space is promoted to represent those all-important zones of shade that the eye interprets as surface relief. \nThink how much better the end-result can be if instead of starting with a 2D sketch, with no 3D history, one starts with a 2D imprint obtained from a 3D object. That’s how Secondo Pia was able to achieve that seeming miracle of transforming a somewhat  unattractive negative to a serene ghostly positive, better I maintain than any positive that one could hope to produce directly by modern one-step digital photography.\n\n","date":"July 26, 2014 at 6:28 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140468","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"So (according to Colin Berry’s allegedly ‘scientific’ Gospel), the 14th c. CE forger was even AWARE her/his positive crude sketch of the TS image was to be enhanced  just by reversing tones in late 19th c. CE negative photography and in  21st c. CE ImageJ by applying 3D-enhancement software and look more spectacular/attractive. \nThis is quite an intellectual quantum leap indeed! ‘Your’ medieval forger was not just a genius as a forger but a prophet too. \n(Mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmort de rire/LOL).\n\n","date":"July 26, 2014 at 11:07 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140509","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Too bad CB can produce neat negatives or 3D enhancements but just cannot produce a 2D replicate that matches the TS bloodied body image AS IT IS.\n\n","date":"July 26, 2014 at 11:21 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140511","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Methinks CB is underestimating THE MATERIAL REALITY of the TS image and mistaking eidomatic fiction for hyperreality.\n\n","date":"July 26, 2014 at 11:30 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140516","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"My essential point was, not so much that this medieval forger, probably unknowingly, had succeeded in achieving the equivalent of a 19th century photographic negative, (why he thought such a process might have any 14th century value, we can only guess) but that using an inorganic template, it turned out that this negative was recognisable in the 19th-20th century as a real human being, and not a template at all!  Mirabile dictu!\n\n","date":"July 26, 2014 at 4:05 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140566","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"PS:  It goes without saying that it would not have entered the minds of medieval artisans to imagine that something made to represent a scorch or sweat imprint would many centuries later be tone-reversed with photosensitive salts making it possible to visualize the appearance of the discarded template. As for what that was, or whom it represented, that’s a matter of conjecture (St.Lawrence? Jacques de Molay? Jesus Christ?)\n\n","date":"July 26, 2014 at 11:27 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140514","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"First produce a 2D match to the TS bloodied image, then we’ll see…\n\n","date":"July 26, 2014 at 11:34 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140517","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"More than 3 years ago, you’d say you will using baked mummies…\n\n","date":"July 26, 2014 at 11:37 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140518","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"typo: you said\n\n","date":"July 26, 2014 at 11:41 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140519","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"CB wrote: “It goes without saying that it would not have entered the minds of medieval artisans to imagine that something made to represent a scorch or sweat imprint would many centuries later be tone-reversed with photosensitive salts making it possible to visualize the appearance of the discarded template.”\nMethinks you enter too much of your OWN 21st c. CE biased thoughts in the mind of a 14th c. CE forger who never walked the earth… but in your wildest and agenda-driven dreams.\n\n","date":"July 26, 2014 at 11:53 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140521","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"CB I’ll take some vacation in August (I am bogged down with work. Just have no time to write away a paper on the TS now). \nThen I’ll have time to demonstrate how wrong you are e.g. as far as the Hungarian Pray Ms bifolium folio 28r upper pen & ink drawing section is concerned. \nThere is no getting away from facts. You live in TS image fiction.\n\n","date":"July 26, 2014 at 12:21 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140525","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"CB, the only thing I agree with you is the TS man’s body was compressed/fastened in the burial wrapping/large linen cloth and heating source is a must to account for the image formation process.\nRegarding TS man’s body’s compression, this is no news at all. It was written in the Greek Gospels nearly 2000 years ago…\n\n","date":"July 26, 2014 at 12:37 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140530","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"“The skeptics will have a case when they are able to produce a photographic negative that looks like a human corpse laid out in death, which cannot be easily refuted as such. To date I believe that has yet to be achieved.”\nAnd that is a very good point.\n\n","date":"July 26, 2014 at 6:12 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140464","author":"Thomas","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Let’s all wish MPH a happy and restful vacation.\nFor my part, work on the likely provenance of the TS image continues apace. Having satisfied at least myself that it’s a contact-only imaging mechanism, one that tolerates no air gaps, tomorrow’s posting just needs a snappier title than this more informative draft:\n“Cloth-body distance is irrelevant in the contact-only imprinting model. What matters is the angle of contact that cloth-template contact areas make with the vertical in an applied and/or gravitational force field, and loss of contact due to bridging of fabric between high points on the template.”\n\n","date":"July 26, 2014 at 12:35 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140529","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"“Contact and loss of contact”, this is my approach you are recycling AGAIN to fit into your scorch theory…  Glad I am really inspiring you.\n\n","date":"July 26, 2014 at 12:51 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140537","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Methinks,sooner or later, you’ll have no choice but to agree with my archaeological solution… and become an authenticist.\n\n","date":"July 26, 2014 at 12:56 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140538","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"“My essential point was, not so much that this medieval forger, probably unknowingly, had succeeded in achieving the equivalent of a 19th century photographic negative, (why he thought such a process might have any 14th century value, we can only guess) but that using an inorganic template, it turned out that this negative was recognisable in the 19th-20th century as a real human being, and not a template at all! Mirabile dictu!”\nYes, but negative images that look scarcely life- like can have a value in themselves (e.g. brass rubbings) and, if one so desires, be tone-reversed to get a better idea of the initial template’s appearance and even the subject as they may have looked in life (or shortly thereafter).\nHere’s a comparison I have just done, based on a rubbing from a mid-14th century brass.\n\nThe message is simple: just because one can transform a negative image from medieval times to a more human- like positive does not make one obliged to attach any significance to the before-and-after-images. It’s all in the processing, not the personalities.\n\n","date":"July 26, 2014 at 5:24 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140576","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Colin there must be a skeptics society there in England who you could work with to test a full human size scorch scenario?\n\n","date":"July 26, 2014 at 5:51 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140579","author":"Thomas","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Methinks any image obtained in the 21st century would almost certainly look too new, Thomas, and too well-defined to pass muster with authenticists-turned -instant-aesthetes. \nThere would be all kind of objections raised by drafted-in militias of home microscopists too, claiming that the swogglefloggles on the linen nodes did not quite match those of the Shroud (OK, I pretend, but something along those lines is entirely predicable.)\nIt’s not just the problem of simulating the effect of centuries of physical and chemical degradation. What about Lalaing’s testimony? Is one supposed to, or allowed to reproduce that as well?\nFrom shroud.com history page: \nApril 14, 1503 Good Friday: Exposition of the Shroud at Bourg-en-Bresse for Archduke Philip the Handsome, grand-master of Flanders, on his return from a journey to Spain. ………..     Lalaing adds that the Shroud’s authenticity has been confirmed by its having been tried by fire, boiled in oil, laundered many times ‘but it was not possible to efface or remove the imprint and image.’ \n(This sceptic says they weren’t trying to efface the image – they were trying to mature it….).\n\n","date":"July 26, 2014 at 6:10 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140584","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"CB:  “Here’s a comparison I have just done, based on a rubbing from a mid-14th century brass.”  But they’re not at all recognisably human, unless one is suffering from some terrible eye disease;  and I didn’t even need my spectacles!\n\n","date":"July 26, 2014 at 6:46 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140587","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"What an odd response. Drawing an analogy, might its somewhat tetchy quality be the result of having to remind daveb of the difference between a map and the territory it represents?\nSome maps may be better than others, e.g. in having semi- 3D enhancement, but they are still maps, not territory.\n\n","date":"July 27, 2014 at 12:23 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140622","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"I didn’t intend it to be tetchy, sorry if you thought it so.  You’re saying that a photograph is a map.  A photograph of a person is then a map of the person, and a reasonable quality photograph is indeed recognisable as that of a person.  A photograph of a statue, or a painting of a person is easily recognisable as no more than that of a statue or a painting.  It would never be mistaken as a photograph of the person that it’s meant to represent.  In the same way, I maintain that the Shroud image is an image of a human being, not that of a statue or a bas relief.  The human form has many subtleties, perceived I suppose partly unconsciously, in a way that enables us to distinguish it from a mere artifact of a person.  The images that you have presented in all of your models could never be mistaken as an image produced from any real person,\n\n","date":"July 27, 2014 at 6:16 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140657","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"OK, thank you for addressing the matter of tone. Let’s agree that we’re still on the same wavelength, even if it’s the heat rather than light end of the em spectrum.\nI’m wondering how you can be so certain about spotting when a particular  tone-reversed image such as Secondo Pia’s is that of a real person, as distinct from being template-derived. How can you be so certain? Have there been systematic studies in which respondents are asked to judge which is real, which isn’t? I doubt it. In fact there’s a paucity of studies generally on the result of imprinting off templates and comparing the image and original.\nIn fact, there are some very life-like looking bronzes, if you allow for the fact that the eye can generally distinguish between stone, bronze and skin in a straight photograph. But that distinction is lost if you start with a template with smooth surface texture (“skin”), take an imprint and then invert the tones.\nThe real test, at least where the head is concerned is the “hair”.  If you look at a good statue, like Michelangelo’s David, it’s quite life- like, even in stone, except for the eyes (obviously) but also the hair, which looks too coarse and braided, and that defect would be carried through to any 2D imprint. But the TS man’s hair is indistinguishable from skin if one simply compares the two in postage stamp-sized areas (we only perceive it as “hair” by its overall distribution, framing the head, not its surface texture.). So a forger would not need to start with a template that tried to make hair look strand-like, so making his task easier. Eyes too – one would not  attempt to model open eyes, and again the TS image gives an appearance (probably illusory) that the eyes are oh so conveniently closed.\nI’m fairly confident, simply from experimenting with hot brass scorches on linen, that it would not be too difficult to produce a scorch imprint that, after tone-reversal, you’d find difficult to distinguish from a real person, except maybe for it having an other-wordly serene and ghostly appearance. (Yes, don’t forget the apparent luminosity  that one does not expect of, say,  Michelangelo’s David, but works the other way, favouring authenticity, when judging  whether Secondo Pia’s image is that of Jesus, especially if it were viewed as a selfie captured at the instant of Resurrection as some would have us believe).\n\n","date":"July 27, 2014 at 7:57 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140673","author":"Colin Berry","site":"shroudstory"},{"title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?","post":"Colin, thank you for responding to the issue in such detail.  The challenge is plainly one of producing a life-like image from an inorganic template.\n\n","date":"July 27, 2014 at 6:01 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","id":"comment-140753","author":"daveb of wellington nz","site":"shroudstory"}]
