[{"title":"Of inexplicable explanations","post":"In most if not all of the so-called unexpainable  cases, their very unexplainability is only due to bad observations and/or biased material and/or inappropriate tools and/or intersubjectivity.\n\n","date":"August 30, 2013 at 8:11 am","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-42396","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Of inexplicable explanations","post":"We humans know only about 5% of ontological reality and both scientists and believing Christians should know that. On the part of the Church, there is the Pontifical Academy of Science, however there is no such organ among scientists,so there are those who indulge in scientism and those who are open-minded, willing to admit that there is much more to learn. There are some clues in the words of Jesus…\n\n","date":"August 30, 2013 at 9:50 am","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-42401","author":"Louis","site":"shroudstory"},{"title":"Of inexplicable explanations","post":"My understanding is that there are two kinds of knowledge: faith and reason. In reason, we know something is true because we can see the truth of it (e.g., the sine of 22 degrees is what math books say it is). In faith, we know something is true because God is telling us (e.g. Jesus is alive in a new life with God). The Resurrection is both an historical event and an object of faith. Faith is both a decision and a gift from God. It is wrong to criticize the judgment of people who do not believe in Jesus or life after death. We can summon people to believe, but we should not demand it. We should accept the response: I can’t see the truth of it. Another good response is: God has not given me the gift of faith.\nI believe in Jesus for a large number of reasons. It is the entire story that is persuasive. The Resurrection is one bit of data. The Holy Shroud is another. When I give my reasons it is accompanied by a summons to believe, not a demand. To say that Jesus being alive “explains” the Resurrection and Holy Shroud implies that people who don’t believe have bad judgment.\n\n","date":"August 30, 2013 at 9:52 am","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-42402","author":"David Roemer","site":"shroudstory"},{"title":"Of inexplicable explanations","post":"It may have been the historian-author Anne Fremantle who once wrote that there were three fundamental heresies: Polytheism, Pantheism and Prometheanism. Prometheanism places mankind in the place of God. Hesiod relates two versions of the Greek Titan Prometheus, the supreme artisan, who tricked Zeus and stole the secret of fire. For his impudence, Zeus had Prometheus chained to a rock where an eagle ate his immortal liver which constantly replenished itself. Behind the Genesis myth of the Fall of Adam lies the serpent’s voice “You will become like gods!” \nZeus’s eagle continues to chew at the liver of modern scientists, dissatisfied, laboring to unravel the secrets of the universe, to become omniscient like the deity. It chewed at the liver of Albert Einstein until his death, as he hoped to discover the logic and rationality behind the mysteries of the quantum, expecting to derive a Great Unified Theory. But it was Schrodinger’s cat who had the last word. There was no logic behind the quantum, only probabilities and the mystery of entanglement! \nThere may be a natural explanation for the image on the Shroud. But it will only come with a much greater concerted effort that hitherto. There are two major problems hindering solution of the puzzle: that of resources, and the problem of accessibility to this major relic, protected by its guardians.  \nA major experimental project is required. I’ve previously suggested a multi-variate experiment involving small laboratory animals, with linen cloths treated in various ways, and they can be loosely draped or tightly wrapped, with and without ancient burial herbs and spices. \nIt is not sufficient to obtain one-off small ambiguous stains, or to conduct one-off amateurish porcine experiments for the sake of some media sensationalism. A clear and unambigious image of a real object must be obtained to claim any kind of success. \nThe most successful results I’m so far aware of are those of Giovanna de Liso over a 12 year period, in relation to her seismic experiments near Piedmont. But they are subject to carping criticisms and much more is required. \nWould the effort be worthwhile? Clearly there are animal ethical issues involved. Is it so important that an answer be found? What say you, Prometheus? Or shall it remain a mystery?\n\n","date":"August 30, 2013 at 5:05 pm","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-42424","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Of inexplicable explanations","post":"Showing that I too keep an open mind…\nHas anyone ever looked at alchemy? Could a medieval alchemist have poured some kind of solution over a dead body, and the solution transfered an image to the cloth?\nJust putting it out there\n\n","date":"August 30, 2013 at 7:24 pm","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-42435","author":"Matthias","site":"shroudstory"},{"title":"Of inexplicable explanations","post":"Daveb is a long-standing advocate for Giovanna de Liso’s ideas and although I’ve read his posts and her paper with interest, I’ve not commented on it till now. Since he seems to be wholly alone in his recognition of de Liso’s work it’s time somebody else added their appeal for further investigation! Her paper is at http://www.acheiropoietos.info/proceedings/DeLisoWeb.pdf.\nI think it suffers in translation, as I find it difficult to understand perfectly, and further experimentation does seem to depend on living in an area of frequent, predictable, non-threatening earthquakes, which rules me out, but at least one might explore some of the background to her experiments. She begins by saying that she was inspired by the observation of “seismic oxidative phenomena on vegetal structures and ferromagnetic rocks, occurring along parallel surfaces to the ground.” Without moving onto the shroud, does anybody know anything of these? De Liso gives a few references, but none of them appear to treat of the phenomena described.\nDe LIso goes on to describe how she draped a variety of stuff from metal keys to dead snakes in variously moisture saturated cloth, placed the cloth between door-sized plates of gneiss (ferromagnetic rock), all within a cave near a crevice from which radon gas was emitted, and waited for the next earthquake before examining the cloth and finding images of one sort of another. She associates the formation of images with electromagnetic anomalies as well.\nI don’t really know what to make of this, or how to proceed with further study, except to observe that Jerusalem is not characterised by ferromagnetic geology. Would anyone like to advise?\n\n","date":"August 31, 2013 at 3:49 am","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-42467","author":"Hugh Farey","site":"shroudstory"},{"title":"Of inexplicable explanations","post":"It’s a nice, interesting theory but far from convincing.\nI favour the resurrection.\n\n","date":"August 31, 2013 at 6:26 am","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-42475","author":"Matthias","site":"shroudstory"},{"title":"Of inexplicable explanations","post":"It’s more than just a “nice interesting THEORY”, Matthias. Nobody, not even Yannick Clement (who apparently doesn’t believe in earthquakes) has ever been able to point me to any more persuasive or successful images on linen, than those obtained by De Liso! All anyone else seems to have ever achieved are a few ambiguous stains, never a coherent image of any specific object. A major criticism against the Resurrection causing the image, (often mentioned by Yannick) is that the image is that of a very dead corpse apparently in a type of rigor mortis, NOT that of a risen glorified Christ, and NOT even in transition towards Resurrection! \nYou may believe the Resurrection caused it if you prefer that explanation, however, such belief does not make it a necessary truth, for the simple reason that all other reasonable avenues remain unexplored. The most rigorous forum for proof of a miracle is the Vatican Causes for Saints, and they are certainly silent in this particular case. \nI tend to the view that it may be what can be technically called a “secondary miracle”. In a “primary miracle”, Providence intervenes to suspend the usual Laws of Nature to bring about some wondrous event, such as the otherwise unexplainable complete cure from a disease usually considered fatal.  In a “secondary miracle” the Laws of Nature are not suspended, but come together in such a remarkable way, that the result is seen as an Act of Providence.\nIt is generally thought unusual for an image to form on a burial shroud, but then nobody ever looks at such shrouds before decomposition sets in to see whether it is usual for these images to form or not.  More likely, if the Shroud image does have a natural cause, then it is probably as a result of some rare combination of environmental factors which may include: temperature, humidity, ambient light, the types of burial herbs and spices, variations in the geomagnetic and electric fields, perhaps accentuated by iron-bearing rocks, and just possibly the release of radioactive gases during an earthquake. Whatever the rare combination of factors might have been, perhaps it could be seen as a Providential Act.  \nUntil a concerted effort has been made, such as the multi-variate experiments I’ve suggested, then natural causes cannot be ruled out, even if they are the result or coming together of some rare serendipity, perhaps an Act of Providence.\n\n","date":"August 31, 2013 at 7:32 am","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-42480","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Of inexplicable explanations","post":"Dave: An extract from my article written in polish:\n“Ale wizerunek jest. Niewytłumaczalny. Ray Rogers sądził że jego teoria reakcji Maillarda jest w stanie w naturalistyczny sposób, bez odwoływania się do cudów, wyjaśnić powstanie wizerunku na Całunie. Rogers był chemikiem, przeprowadził odpowiednie eksperymenty i stwierdził że przy odpowiednich warunkach da się tą metodą uzyskać zabarwienie poszczególnych włókien o właściwościach takich jak na Całunie. Ale nie był fizykiem i nie interesowała go tak naprawdę  praktyczna niemożliwość uzyskania tak doskonałych  makroskopowych właściwości wizerunku w wyniku procesu gazowej dyfuzji. Jak to możliwe utworzyć tak niezwykły obraz nie zaprzeczając statystycznym prawom termodynamiki? Rogers uznał że nie ma sensu rozważać tego problemu, ot zdarzył się taki nieprawdopodobny wypadek i my możemy jedynie a posteriori dociekać jak to się w sposób naturalny stało (nie oznacza to że teoria Rogersa zaprzecza Zmartwychwstaniu, po prostu w ogóle nie bierze go pod uwagę). Może tak się stało, może nastąpił taki zupełnie niewyobrażalny wypadek –w teorii nie jest to niemożliwe. Tyle że tak nieprawdopodobne, że prędzej bym się spodziewał że odkryty basen olimpijski w letnie upały sam z siebie zamarznie (co też jest teoretycznie możliwe)… I dlaczego zdarzyło się to akurat w przypadku osoby, która przeszła dokładnie identyczne męki jak opisywane w Ewangelii męki Jezusa z Nazaretu, z którym być może jest po prostu tożsama… Chyba że czyjaś niewidzialna ręka kierowała torem każdej cząsteczki amoniaku…  Zmartwychwstanie Jezusa i utworzenie wizerunku mogło się odbyć również i bez błysku… ale w równie cudowny sposób!”\nCzytaj więcej na: http://ok.apologetyka.info/racjonalista/dzieje-caunu-turynskiego-wedug-leszka-zuka-z-racjonalisty-cz-2,629.htm\n\n","date":"August 31, 2013 at 7:41 am","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-42481","author":"O.K.","site":"shroudstory"},{"title":"Of inexplicable explanations","post":"Google translation (with my corrctions):\nBut the image is. Inexplicable. Ray Rogers believed that his theory of the Maillard reaction is able naturalistic way, without resorting to miracles, explain the origin of the image on the Shroud. Rogers was a chemist, carried out the appropriate experiments and found that the appropriate conditions this method can get the color of individual fibers with properties such as the Shroud. But he was not a physicist and was not really interested in the practical impossibility of obtaining such perfect macroscopic properties macroscopic of the image through a process of gaseus diffusion. How is it possible to create such an unusual image not denying the statistical laws of thermodynamics? Rogers concluded that there is no point in considering this problem, just happened to such an incredible event and we can only investigate a posteriori how it naturally happened (this does not mean that the theory of Rogers denies the resurrection, just does not take it into account) . Maybe so, maybe there was such quite unbelievable event -in theory it is not impossible. Only so improbable, that sooner I would expect that the outdoor Olympic swimming pool  to freeze by itself in the summer heat (which is also theoretically possible) … and why it happened jus tonly in the case of the individual who had suffered exactly the same passion as Passion of Jesus of Nazareth described in the Gospel with whom perhaps he can be identified … unless Someone guided by the invisible hand the track of each molecule of ammonia … Resurrection of Jesus and the cration of the image could take place even without the flash … but also in a miraculous way!\n\n","date":"August 31, 2013 at 7:51 am","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-42484","author":"O.K.","site":"shroudstory"},{"title":"Of inexplicable explanations","post":"the images were created under very controlled circumstances, and Jerusalem does not have  ferromagnetic geology. So….\nLook, I agree that the image might have been caused by explainable natural phenomenon, and that such serendipitious factors working together could potentially constitute a miracle…or not. But I do find the reluctance of Christians to consider a miraculous resurrection as the cause of the image odd to say the least! I could perfectly understand it if it came from atheists or agnostics!   \n‘A major criticism against the Resurrection causing the image, (often mentioned by Yannick) is that the image is that of a very dead corpse apparently in a type of rigor mortis, NOT that of a risen glorified Christ, and NOT even in transition towards Resurrection!’\nYeah, but if we start from the point that the resurrection is a miraculous event that contradicts the laws of nature, then anything is possible, including methods of image creation well beyond our human imaginations. That’s why I find attempted scientific explanations of a resurrection generated image such as bursts of radiation pointless, because radiation is a natural phenomenon and the resurrection isn’t!\n Maybe the image does capture Christ just in the moment to  transforming  between dead corpse and resurrected spiritual body? There is a serenity in the face that to me speaks of something different to a pained, tortured person. I’ve seen tortured dead bodies and I’ve never seen a serene face on any of them like the face of the shroud.\n\n","date":"August 31, 2013 at 8:01 am","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-42485","author":"Matthias","site":"shroudstory"},{"title":"Of inexplicable explanations","post":"Dave, it is a THEORY with regard to explaining the Shroud image.\n\n","date":"August 31, 2013 at 8:20 am","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-42486","author":"Matthias","site":"shroudstory"},{"title":"Of inexplicable explanations","post":"Matthias, you wrote: \n“Jerusalem does not have ferromagnetic geology”.\nThe TRUE geological fact is Malky rock in Jerusalem (especially the Golgotha mount), is a white limestone, with red veins containing iron.\n\n","date":"August 31, 2013 at 9:57 am","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-42494","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Of inexplicable explanations","post":"Last time I checked the Scripture Jesus Christ was not buried on Golgotha,\n\n","date":"August 31, 2013 at 3:51 pm","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-42513","author":"jesterof","site":"shroudstory"},{"title":"Of inexplicable explanations","post":"In Ukrania in winter maybe it was.\n\n","date":"August 31, 2013 at 4:47 pm","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-42523","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Of inexplicable explanations","post":"Ah, Max, master of the Hapax Legomenon. It took me a while to identify your Malky rock with wikipedia’s Meleke Limestone, which is characterised by being pure white when quarried, aging to off-white, golden or pinkish. Iron may well be the explanation of the pinkish colour, but it doesn’t sound as if it is present in sufficient quantities to be described as ferromagnetic. Even Mizzi Ahmar, which is pinkish from the start, is not a ferromagnetic rock.\n\n","date":"August 31, 2013 at 10:42 am","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-42497","author":"Hugh Farey","site":"shroudstory"},{"title":"Of inexplicable explanations","post":"What is the relevance of this? Golgtha was a place of death but not the place of burial.\n\n","date":"August 31, 2013 at 3:53 pm","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-42514","author":"jesterof","site":"shroudstory"},{"title":"Of inexplicable explanations","post":"But the place of burial is maybe 20-30 metres from it.\n\n","date":"August 31, 2013 at 3:55 pm","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-42515","author":"O.K.","site":"shroudstory"},{"title":"Of inexplicable explanations","post":"Hugh, additional information: Malky in Hebrew means ‘royal’. That’s ok with me (most likely a non ferromagnetic iron-bearing rock) since I don’t buy into Giovanna de Liso’s hypothesis at all.\n\n","date":"August 31, 2013 at 2:02 pm","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-42506","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Of inexplicable explanations","post":"I agree with Hugh inasmuch as if there is a miraculous, inexplicable cause, then science is done here.  But how would one come to that conclusion?\n\n","date":"August 31, 2013 at 3:04 pm","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-42510","author":"Andy Weiss","site":"shroudstory"},{"title":"Of inexplicable explanations","post":"I think that the first suggestions that the Shroud image may have a naturalistic explanation was probably published by Fr Peter Rinaldi in 1934, in a remarkable article for a now defunct American  publication, ‘The Sign’. A brief tribute to Fr Rinaldi’s work, together with a URL ref to the article can be found at:\nhttp://johnklotz.blogspot.co.nz/2012/12/rev-peter-rinaldi-apostle-of-shroud.html \nHis article was probably responsible for arousing the first interest in USA for the relic. The suggestion of a naturalistic explanation had the advantage of removing Shroud interest from the confines of the Woowoo brigade and arousing scientific interest, with the consequence that we now know a great deal more about it than before. \nO.K’s suggestion that it is necessary to suspend the Laws of Thermodynamics, and that the image is as likely as a swimming pool freezing over in the summer heat, is I believe unnecessary. This is demonstrated by the fact that one De Liso has been successful in showing that it is possible for images to be formed under certain specific conditions. This then raises the possibility that images may also be formed under certain other specific conditions. \nIf say the image is the result of some kind of gaseous diffusion process, then it is possible to conjecture that conditions might be so controlled as to produce a distinct clear image of the object, together with its 3-D information:- if the flow is laminar and not diffuse; if there is a collimating influence on the molecules, such as by mild radiation or some electro-magnetic effect; if image-forming molecules undergo a chemical change in proportion to the path length. For the scientifically-minded, I can recommend checking out some flow-net theory, experiments and diagrams in any engineering undergraduate Fluid Mechanics text. I was involved in some rather convincing flow-net laboratory experiments during my early engineering training. \nIn response to Andy Weiss: My comments are to refer him to my suggestion concerning a multi-variate experiment with small laboratory animals. If such an experiment failed to produce any trace of an image, then we might come to the conclusion he proposes. Otherwise if the experiment were successful, Prometheus would then be Unbound!\n\n","date":"August 31, 2013 at 5:33 pm","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-42529","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Of inexplicable explanations","post":"I wonder if small laboratory animals might be obtained from a Catholic Chicken Farm supplying Colonel Sanders K.F.C. outlets?\n\n","date":"August 31, 2013 at 8:59 pm","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-42541","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Of inexplicable explanations","post":"\nMax Patrick Hamon :\nIn Ukrania in winter maybe it was.\n\nwith you “knowledge” what and were is winter I won’t be surprised. Upgrade your physical geography ASAP!\n\n","date":"September 3, 2013 at 5:53 pm","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-42806","author":"jesterof","site":"shroudstory"},{"title":"Of inexplicable explanations","post":"Reblogged this on Best of Shroud Story and commented: \nI was prompted by an email from a reader of http://www.shroudstory.com to find this and post it again on the blog. So why not reblog it, as well. \n\n","date":"August 14, 2014 at 4:26 am","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","id":"comment-143850","author":"Dan","site":"shroudstory"}]
