[{"title":"Of laser like light and scorching","post":"And how many angels can dance on the point of a pin?\n\n","date":"March 21, 2013 at 7:16 am","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","id":"comment-27963","author":"Paulette","site":"shroudstory"},{"title":"Of laser like light and scorching","post":"It is the head of a pin. The point of a pin is unreasonable. It would be impossible to measure accurately.\n\n","date":"March 21, 2013 at 7:20 am","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","id":"comment-27965","author":"Dan","site":"shroudstory"},{"title":"Of laser like light and scorching","post":"Dan,\nI really can’t say I am on a different wavelength or not. I believe there is place where existence interfaces with the God, I refer too as the primordial self-consciousness from existence as we know it sprang.\n\n","date":"March 21, 2013 at 7:17 am","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","id":"comment-27964","author":"John Klotz","site":"shroudstory"},{"title":"Of laser like light and scorching","post":"John wrote: “Applying Occam’s razor, could it be that the “simplest explanation” of the image is in fact the Resurrection?” \n– My answer: Definitely it just could not. TRULY Applying Occam’s razor, the simplest explanation of the image on the Sindon is in fact a Second Temple period Judean burial ritual.\n\n","date":"March 21, 2013 at 7:24 am","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","id":"comment-27966","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Of laser like light and scorching","post":"Max,\nThat does not explain the image which is unique in history. There is no artifact from any burial is any period which as produced such an image with such exquisite detail. Surviving blood stains, yes. Surviving detailed image: No.\nIf I am wrong, and I am sincere in this request, cite me an example and any reference to the same hat I can check.\n\n","date":"March 21, 2013 at 7:41 am","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","id":"comment-27968","author":"John Klotz","site":"shroudstory"},{"title":"Of laser like light and scorching","post":"It is unique in history just because Yeshua’s corpse didn’t remain very long into his burial sheet (roughly less than 36 hours) and the latter was kept by his disciples as a sign of the new covenant between G.od and men. THIS is (almost) unique if now you think of the Jospice mattress (kept till now) and the Veil of Antinoe (kept till a century ago)…\n\n","date":"March 21, 2013 at 7:52 am","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","id":"comment-27969","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Of laser like light and scorching","post":"John you wrote: “That (my archaeological solution) does not explain the image”. As “thought experiment” it DOES work and can explain many Sindon image and bloodstain oddities. What now is most needed is experimental archaeology (and it has a cost). Neither anti-authenticists and arch-fraudulists  nor arch-miraculists or miraculistic authenticists will help to demonstrate I might well be right after all.\n\n","date":"March 21, 2013 at 8:04 am","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","id":"comment-27970","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Of laser like light and scorching","post":"Re Veil of Antinoë see e.g. DAL MANDYLION ALLA VERONICA Relazione di Massimo Centini:\n“il velo proveniente dal cimitero di Antinoe, in Alto Egitto: si tratta di un velo del 500 d.C., posto sul volto del cadavere di un cristiano. Oggi il reperto è scomparso ed è un vero peccato: il velo era ripiegato in quattro e su ogni lato riportava l’impronta del volto del cadavere; tre lati erano particolarmente visibili, mentre il quarto presentava un’immagine piuttosto frammentaria. Secondo il parere degli archeologi, la formazione dell’immagine sarebbe dovuta all’azione degli aromi usati per la sepoltura”.\n(“The veil from the cemetery Antinoe, in Upper Egypt: it is a veil of AD 500, placed on the face of the corpse of a Christian. Today the piece has disappeared and it is a real shame: the veil was folded in four (possible ancient Gr. tetradiplon) and on each side carried an image of the face of the corpse, three sides were particularly visible, while the fourth had a rather fragmented image. In the opinion of archaeologists, the image formation would be due to the action of spices used for burial”)\nSee also French Shroud scholar and researcher Dubarle.\n\n","date":"March 21, 2013 at 8:30 am","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","id":"comment-27971","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Of laser like light and scorching","post":"Typo: (possible ancient Gr. tetraplon)\n\n","date":"March 21, 2013 at 8:32 am","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","id":"comment-27972","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Of laser like light and scorching","post":"When I wrote “the simplest explanation of the image on the Sindon is in fact a Second Temple period Judean burial ritual”, I meant a specific one (as no anointing ritual was performed while performing the purification of the shed innocent blood of a man unfairly sentenced to death by the Sanhedrin; a shed innocent blood that could not be atoned).\n\n","date":"March 21, 2013 at 1:00 pm","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","id":"comment-27979","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Of laser like light and scorching","post":"Continued\nI am such a klutz, I launched prematurely.\nMy conclusion, not yet proven or capable of proof, perhaps for now, is that through the Shroud of Turin,   primordial consciousness is communicating with us.\nWhile I do not ascribe to the bible as history fundamentalism, I am struck by the reference to light in both Genesis and John. My thoughts are an “educated” speculation not capable of scientific proof. Not yet anyway, but tomorrow?\n\n","date":"March 21, 2013 at 7:36 am","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","id":"comment-27967","author":"John Klotz","site":"shroudstory"},{"title":"Of laser like light and scorching","post":"Quote : “Applying Occam’s razor, could it be that the “simplest explanation” of the image is in fact the Resurrection?”\nIf someone answer “yes” to that question, then he prove himself to be completely religiously biased !  Because the image on the Shroud is a dead man, the simplest explanation of the image, using Occam’s razor WITHOUT ANY RELIGIOUSLY BIAS, is evidently to think of some still undefined natural process (or processes) that came directly from an interraction between the surface of the cloth and the corpse it covered (this last description is a proven fact, i.e. the shroud is a real burial cloth that covered for a short time the real corpse of a man).  THAT’S THE SIMPLEST EXPLANATION…  Of course, that is so ONLY if you free your mind of any religious pre-concieved notions.  Unfortunatelly, it’s rare to see someone acting like that in this pro-Shroud world and that’s the main reason why Shroud science is regarded as a sick joke by a lot of true scientists these days.\n\n","date":"March 21, 2013 at 1:03 pm","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","id":"comment-27980","author":"Yannick Clément","site":"shroudstory"},{"title":"Of laser like light and scorching","post":"Yes Ynnick but you must remember that all men are born with preconcieved notions and idealologies It is simply imposible for anyman to be truly objective as I am Christian i am inclined to come to a “biased” conclusion (Dont mind my grammar im only 15)\n\n","date":"March 21, 2013 at 1:20 pm","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","id":"comment-27981","author":"Chidi","site":"shroudstory"},{"title":"Of laser like light and scorching","post":"I am a proud Christian Catholic guy myself and I don’t see any problem thinking that the body image on the cloth was formed by the interraction between the dead body of Jesus and his burial shroud before he resurrect on Easter morning and don’t know why a Christian believer should be afraid of that really good possibility.\n\n","date":"March 21, 2013 at 4:41 pm","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","id":"comment-28001","author":"Yannick Clément","site":"shroudstory"},{"title":"Of laser like light and scorching","post":"\nMax Patrick Hamon :Re Veil of Antinoë see e.g. DAL MANDYLION ALLA VERONICA Relazione di Massimo Centini:“il velo proveniente dal cimitero di Antinoe, in Alto Egitto: si tratta di un velo del 500 d.C., posto sul volto del cadavere di un cristiano. Oggi il reperto è scomparso ed è un vero peccato: il velo era ripiegato in quattro e su ogni lato riportava l’impronta del volto del cadavere; tre lati erano particolarmente visibili, mentre il quarto presentava un’immagine piuttosto frammentaria. Secondo il parere degli archeologi, la formazione dell’immagine sarebbe dovuta all’azione degli aromi usati per la sepoltura”.\n(“The veil from the cemetery Antinoe, in Upper Egypt: it is a veil of AD 500, placed on the face of the corpse of a Christian. Today the piece has disappeared and it is a real shame: the veil was folded in four (possible ancient Gr. tetradiplon) and on each side carried an image of the face of the corpse, three sides were particularly visible, while the fourth had a rather fragmented image. In the opinion of archaeologists, the image formation would be due to the action of spices used for burial”)\nSee also French Shroud scholar and researcher Dubarle.\nMax, I remember going thru this before, there are two problems with comparing the veil here, or using it at all. For one, it does not exist! It cannot be studied. So one could easily say the image may have been man made, who is to argue!…No pictures, no concrete evidence, so no relevance. Two: Read the discription closely; 3 sides of the folded veil were saturated completely through. How does that compare at all to the Shroud image, as the Shroud image does not saturate through even one complete fibre. Image properties must also be taken into account when or if trying to compare to others. I never wanted to mention it before, but this one point I think ‘may’ put a dampener on your image forming theory, if I understand it correctly.\nSo repsectfully,  in over 100 years of archaeological history and findings, not one burial garment has ever been found with an image comparing to the Shrouds’ image, or even close to it, as of yet.\nR\n\n","date":"March 21, 2013 at 2:01 pm","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","id":"comment-27983","author":"Ron","site":"shroudstory"},{"title":"Of laser like light and scorching","post":"Reminder for Ron: anatomically speaking, the POSITIVE image of the Jospice mattress is and the Veil of Antinoë was even more realistic in their very details than te Turin Shroud.\n\n","date":"March 21, 2013 at 3:09 pm","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","id":"comment-27987","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Of laser like light and scorching","post":"Reminder to Max, How can you make any comments to the veil? Have you ever seen it, or photographs of it?…Don’t think so; so…Null and Void.\nSecondly, we’ve covered the Jospice mattress way too much on this blog and it is NOT, by far, anything comparable to the image on the Turin Shroud…Lets get over it already. There is no other image known to man, EVER FOUND, that compares to the Shroud image in all of it’s details and attributes, nothing even close.\nR\n\n","date":"March 21, 2013 at 4:38 pm","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","id":"comment-28000","author":"Ron","site":"shroudstory"},{"title":"Of laser like light and scorching","post":"Ron, see French archaeologist Gayet’s comments + French Shroud scholar and researcher Dubarle’s research paper. It did look like an ‘unpainted Fayoum portrait’. The closest example we still have today is the Holy Face of the Veil of Manoppello. \nRon, can you explain to me how the face “came onto” the sea-silk Veil of Manoppello? You just can’t. Is it a supernatural image just because no one has ever been able to re-do it so far?\nRon can you explain to me how the Jospice body image ‘came onto’ the mattress? You just can’t. Is it a supernatural image just because no one has ever been able to re-do it so far?\nDo you believe in a g.od of the gaps in human generalintellect?\nThe sole true exception to the rule of nature is the Guadalupe Tilma. It has “living eyes” neither the TS face nor the Manoppelo Veil have.\n\n","date":"March 22, 2013 at 6:14 am","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","id":"comment-28034","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Of laser like light and scorching","post":"Typo: look/looked even more realistic in their very details\n\n","date":"March 21, 2013 at 3:09 pm","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","id":"comment-27988","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Of laser like light and scorching","post":"Reminder 2 for Ron: in its very details the Turin Shroud POSITIVE image does look fuzzier and less realistic than the Positive image of the Volckringer patterns.\nReminder 3: Methinks you just don’t (really want to?) correctly understand my theory lest you have to totally rethink the Shroud image.\n\n","date":"March 21, 2013 at 3:58 pm","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","id":"comment-27994","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Of laser like light and scorching","post":"Back to the topic and questions of the original posting – interaction of the supernatural and our universe. I believe a better analogy can be found in the idea of parallel universes. Ant on table top has only two dimensions, we have three of length and one of time. Our universe is only one part of creation. When it comes to travelling angels, dimensions are irrelevant, think bilocation as a few saints have apparently been able to manage. Something beyond the ken of ancient writers of scripture with their three tiered universe.\n\n","date":"March 21, 2013 at 4:10 pm","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","id":"comment-27996","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Of laser like light and scorching","post":"The more I read comments on this blog by  arch-miraculists  as e.g. Ron and John Klotz or arch-fraudulists as e.g. Colin Berry or A. Lombatti, the more methinks 90-95% of the Turin Shroud scholars and researchers should go back to the Turin Shroud Thinking Skill classroom.\n\n","date":"March 22, 2013 at 7:07 am","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","id":"comment-28040","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Of laser like light and scorching","post":"The real archaeological scientific problem is not with the TS “crucial evidence” but with the arch-miraculistic and arch-fraudulistic eyes-and-brains that behold it.\n\n","date":"March 22, 2013 at 11:31 am","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","id":"comment-28060","author":"Max Patrick Hamon","site":"shroudstory"}]
