[{"title":"Of the crowns of fibers and the Shroud of Turin image","post":"Thanks for this, Dan, it clears up a lot of questions that have been in my mind.  I know Colin in some recent postings has cast doubts on some other aspects of Roger’s work relating to blood residues, I think it was.  I recall that some much earlier postings had referred to the Maillard reaction, but I had the impression that there was quite some lack of unanimity about it.\nA reasonably equipped lab ought to be able to set up a program of small scale experiments to test Rogers’ theory.  Clearly a few batches of linen cloth would be required, manufactured to the ancient specification.  It might even be necessary to try out different key variables in producing the linen.  I’m thinking small animal experiments again.\nThe absence of a lateral image has to be significant,  Despite Max’s views on the matter, it looks to me that if Rogers was correct, then the burial work couldn’t have been fully completed according to the prescribed ritual, and the cloth would have to be left loose at the sides without tying.  Perhaps they intended to finish the job on Sunday morning, but by then it was too late.\nIf some of the 100 lb mixture that Nicodemus brought was laid over the top of the partly wrapped body, I wonder if that small pressure might just provide the right sort of close mixing of the body chemicals with the starch/saccharides.\nClearly there’s also some chemistry that might need exploring a bit more as well.\nI marvel that it hasn’t been taken a lot further before now.  Meantime I’ll check out the references.  Know any good chemists who’d understand amino-carbonyl reactions?\n\n","date":"February 21, 2012 at 7:55 am","url":"https://shroudstory.com/2012/02/21/of-the-crowns-of-fibers-and-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-8576","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Of the crowns of fibers and the Shroud of Turin image","post":"Dan, this is a good summary of Roger’s theory.  I believe that a maillard reaction may account for something.  I remember early discussions of this when it was first proposed and many still wonder whether such reaction can account for the photo-like quality of the face.  It is very possible that more than one thing is responsible for the totality of the image.  What still bothers me is the dorsal image.  Gases tend to rise.  One would think there would be a difference of image intensity between the dorsal and frontal images, yet that is not the case. I am in the maillard plus camp…maillard plus something else.  Not sure what, but I can certainly speculate!\n\n","date":"February 21, 2012 at 10:19 am","url":"https://shroudstory.com/2012/02/21/of-the-crowns-of-fibers-and-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-8581","author":"Russ Breault","site":"shroudstory"},{"title":"Of the crowns of fibers and the Shroud of Turin image","post":" Fantasia – with murine star billing\n\n","date":"February 21, 2012 at 11:46 am","url":"https://shroudstory.com/2012/02/21/of-the-crowns-of-fibers-and-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-8584","author":"colinsberry","site":"shroudstory"},{"title":"Of the crowns of fibers and the Shroud of Turin image","post":"yeah that is a mature comment colin\n\n","date":"February 21, 2012 at 4:32 pm","url":"https://shroudstory.com/2012/02/21/of-the-crowns-of-fibers-and-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-8599","author":"MouseInTheHouse","site":"shroudstory"},{"title":"Of the crowns of fibers and the Shroud of Turin image","post":"I considered it a mature way of saying, sotto voce, that the proposed sequence of events was sheer fantasy from start to finish, or what I’m minded to call Mickey Mouse science, but I stand to be corrected…\n\n","date":"February 21, 2012 at 5:07 pm","url":"https://shroudstory.com/2012/02/21/of-the-crowns-of-fibers-and-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-8600","author":"colinsberry","site":"shroudstory"},{"title":"Of the crowns of fibers and the Shroud of Turin image","post":"Most decidedly, Dave’s received ideas die hard: Dave, SERIOULY, if the words “Archaeology” and “Exegesis” have a real meaning to you, how on earth can you still infer from the Gospels that Rabbi Yeshua’s body could have been « partly wrapped » and « the cloth (…) left loose at the sides without tying »? Shall I repeat again and again, if we SERIOUSLY read the Gospels in the light of the Turin Shroud, it implies the lengthy linen cloth (Heb. sadin), was first tautly wrapped (Gr. enetulixen, Matthew 27,59) lengthwise around the stiff rigid blood stained body and the latter thus wrapped to be then compressed (Gr. eneilesen, Mark 15,46) and fastened (Gr. edesan, John 19,40) width wise with spices (Gr. aromaton). In other word, in the hypothesis the Turin Shroud is Yeshua’s, his body was FIRST tightly wrapped up THEN, and only THEN, the tautly wrapped interior lengthy shroud might well have concomitantly been subjected to a gradual pressure release from the outer linens and a gradual pressure increase (from the arms in rigor mortis in particular) and get taut again.\n\n","date":"February 21, 2012 at 11:48 am","url":"https://shroudstory.com/2012/02/21/of-the-crowns-of-fibers-and-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-8585","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Of the crowns of fibers and the Shroud of Turin image","post":"Corrections: “SERIOUSLY”, “In other words”\n\n","date":"February 21, 2012 at 12:12 pm","url":"https://shroudstory.com/2012/02/21/of-the-crowns-of-fibers-and-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-8586","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Of the crowns of fibers and the Shroud of Turin image","post":"Max, I think you’re being far too dogmatic about details that we can’t possibly know as applyinig to a particular event  You’re reading far more into Jn 19:40 than the text allows – biblical literalism!  There’s no lateral image on the Shroud!  My answer to this is, “Test all the variables in the laboratory!” including tightly wrapped and loosely wrapped.\nColin thinks Roger’s hypothesis is fantasia, but with all his remarkable chemistry abilities, I’m not aware that he’s run any laboratory tests himself exploring Maillard;  No doubt he’ll correct me if I’m wrong.  As for fantasia, the Maillard theory seems to have far more credibility, than some imagined bas relief that incorporates all the forensic evidence that the Shroud displays.\nRuss’s comments on “maillard plus” has some appeal   Mouraviev’s paper may be relevant: “The Image Formation Mechanism on the Shroud of Turin: :A Solar Reflex Radiation Model (the Optical Aspect)” check URL: http://www.shroud.com/pdfs/mouraviev.pdf\nGases expand; Whether they rise or fall depends on their molecular weight, E.g. released gases from LPG fall, and even find their way into drains.\nWe’re whistling in the dark, until there’s some concerted effort to explore Maillard ++ in a full program of laboratory tests, probably involving laboratory mice and variables in the processing of ancient linens.\n\n","date":"February 21, 2012 at 4:08 pm","url":"https://shroudstory.com/2012/02/21/of-the-crowns-of-fibers-and-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-8597","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Of the crowns of fibers and the Shroud of Turin image","post":"“Gases expand; Whether they rise or fall depends on their molecular weight, E.g. released gases from LPG fall, and even find their way into drains.”\nOnly true on a relatively short time scale, DaveB – minutes, hours at the most. Gaseous diffusion may be slow but is no respecter of molecular weight.\nI did a post on the subject 2 years ago:\n why don’t we suffocate in our (heavy) CO2? \n\n","date":"February 21, 2012 at 4:29 pm","url":"https://shroudstory.com/2012/02/21/of-the-crowns-of-fibers-and-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-8598","author":"colinsberry","site":"shroudstory"},{"title":"Of the crowns of fibers and the Shroud of Turin image","post":"Yeah, sure, Colin.  My comment was directed at Russ’s remark that gases tend to rise.  I’ve had some experience with transport of hazardous goods including LPG, and was aware that the stuff gets into drains and other low-lying areas which demands the correct precautions being taken in clean-up work.  Also it depends on the “relative molecular weight” in air.  As you say, after this initial tendency they then diffuse, which disposes of any argument that cadaver’s gases wrapped in linen would tend to be concentrated at the high points.\nBut I’ve yet to check out the physical properties of cadaverine and putrescine.\n\n","date":"February 21, 2012 at 5:21 pm","url":"https://shroudstory.com/2012/02/21/of-the-crowns-of-fibers-and-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-8602","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Of the crowns of fibers and the Shroud of Turin image","post":"“But I’ve yet to check out the physical properties of cadaverine and putrescine.”\nI would not waste my time if I were you with “made to order” chemistry. There’s too much of it in the world of Shroud science – mining the textbooks for something, anything, that might offer a pat answer that fits with preconceptions…\n\n","date":"February 21, 2012 at 6:17 pm","url":"https://shroudstory.com/2012/02/21/of-the-crowns-of-fibers-and-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-8609","author":"colinsberry","site":"shroudstory"},{"title":"Of the crowns of fibers and the Shroud of Turin image","post":"Dave you wrote: “Max, I think you’re being far too dogmatic about details that we can’t possibly know as applyinig to a particular event You’re reading far more into Jn 19:40 than the text allows – biblical literalism!”.\n“DETAILS THAT WE CAN’T POSSIBLY KNOW AS APPLYING TO A PARTICULAR EVENT”. Dave I wish you could be aware of how dogmatic you are as you are making use here of a NEGATIVE EXEGETICAL DOGMA I would called NIHILISTC ILLITERALSIM. You should have told me firsthand you were a Gospel nihilistic illeteralist, I would not have wasted my time with you!\n\n","date":"February 21, 2012 at 6:44 pm","url":"https://shroudstory.com/2012/02/21/of-the-crowns-of-fibers-and-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-8611","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Of the crowns of fibers and the Shroud of Turin image","post":"Actually, on reading the Gospels in the light of the Turin Shroud, WE CAN POSSIBLY KNOW DETAILS AS APPLYING TO A PARTICULAR EVENT such as Rabbi Yeshua’s Passion or Burial. Dave, you are TOTALLY wrong!\n\n","date":"February 21, 2012 at 7:46 pm","url":"https://shroudstory.com/2012/02/21/of-the-crowns-of-fibers-and-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-8622","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Of the crowns of fibers and the Shroud of Turin image","post":"PS  How I can at one and the same time be a “biblical literalist” and “read far more into Jn 19:40”? Just ask a Gospel nihilistic illeteralist, he will tell you…\n\n","date":"February 21, 2012 at 6:54 pm","url":"https://shroudstory.com/2012/02/21/of-the-crowns-of-fibers-and-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-8613","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Of the crowns of fibers and the Shroud of Turin image","post":"Correction: “illiteralist”\n\n","date":"February 21, 2012 at 7:01 pm","url":"https://shroudstory.com/2012/02/21/of-the-crowns-of-fibers-and-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-8615","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Of the crowns of fibers and the Shroud of Turin image","post":"Correction: “How can I”\n\n","date":"February 21, 2012 at 6:55 pm","url":"https://shroudstory.com/2012/02/21/of-the-crowns-of-fibers-and-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-8614","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Of the crowns of fibers and the Shroud of Turin image","post":"Today New Zealand observed a national memorial service on the first anniversary of the devastating 6.3 earthquake that hit the city of Christchurch at 12:51 pm on February 22, 2011, with the loss of 185 lives, many of them from overseas, and the destruction of many buildings and thousands of homes.  About 30,000 people attended the service and it was televised nationwide.  We appreciate the condolences expressed by Hilary Clinton US Secretary of State and by His Royal Highness, Charles Prince of Wales.  Children released 185 monarch butterflies, a beautiful sight, in memory of those who were lost.  The service had a strong religious component, the final blessing being given by the American lady bishop of Christchurch.  It is remarkable how in a nominally secular country, how religion comes to the fore in observing moments of national grief.\nAs for me, I’m off for a few days to check out some of our wonderful wine country in the Wairarapa plains.  See you all next week. Cheers, Daveb.\n\n","date":"February 21, 2012 at 8:48 pm","url":"https://shroudstory.com/2012/02/21/of-the-crowns-of-fibers-and-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-8625","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Of the crowns of fibers and the Shroud of Turin image","post":"Dave, enjoy your Wairarapa plain woderful wine and just forget about exegesis! Thank you for your opposing view.\n\n","date":"February 22, 2012 at 7:37 am","url":"https://shroudstory.com/2012/02/21/of-the-crowns-of-fibers-and-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-8633","author":"Max Patrick Hamon","site":"shroudstory"}]
