[{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"I tried Colin’s theory with an experiment with some barbecued chicken and some ecru (no dye used) needlepoint linen.  I used varying degrees of “done-ness.”   No scorch marks were in evidence. No matter how little or how long I cooked the bird, no “Image of the Yard Bird” imprinted itself on the linen.  It occurs to me that from an experimental point of view, if the body was hot enough to  scorch linen it was also hot enough to 1) blister and disfigure the skin 2) melt the sub-cutaneous fat which would (and did) run out and soak into the linen.  Actually, human bodies have a LOT of s.c. fat; in some cases corpses have been found covered in solid fat (called grave wax, or, scientifically, adipocere.)  Also DIFFERENT PARTS OF THE CHICKEN BURN DIFFERENTLY at the same heat.  Most importantly I found that the blood oozing from the chicken turned a different color after being exposed to heat. I realize of course that live human and Puritan’s Pride pullet are different, but there you have it, in the spirit of scientific enquiry. The image of the Man is not blistered, presents no oily marks from running fat. No seasonings or barbeque sauce was used. I considered rubbing the chicken with camphor (to simulate myrhh but I don’t know if they are chemically similar, they sort of smell alike.  Introduction of too many variables.\n\n","date":"October 28, 2013 at 4:49 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-48965","author":"Josie L. Tyner","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"There’s been a misunderstanding, one that arose after proposing that a Shroud image of medieval provenance may have represented a Templar (Jacques de Molay?) who had been slow-roasted to death on the banks of the Seine in 1914. But I thought I had made it clear that it would have been a heated effigy, made in metal or plaster that had been used to scorch linen, not a real person, living or dead.\nI’ve been having a re-read of Luigi Garlaschelli’s paper, which I initially found a bit off-putting for reasons that now look somewhat trivial. In fact there’s a lot of very good science there, tucked away among all the arts and crafts detail. Note that while he used real subjects from which to obtain his powder imprints, subsequently baked in an oven to get chemical etching, he was forced to use a bas relief template for the head. That he says was made from Plaster of Paris (it would have been nice to have seen a photograph, if only to have judged the fairness or otherwise of Thibault Heimburger’s critique re inferior 3D-ness).\nI had previously described two ways of getting a thermal imprint onto linen – one from a charcoal drawing with “thermostencilling” using radiant heat, selectively absorbed by the carbon, and a second by direct contact imprinting – hot metal or maybe ceramic onto cloth (“simple scorch”) . But the more I think about it, the more I consider that Luigi’s indirect method, with cold powder imprinting (“frottage”) followed crucially by baking, is the more likely “forger’s” technology, producing a fuzzier end product, but surprisingly by employing what was probably in essence the same carbohydrate-dehydration chemistry. Even the final STURP summary makes brief reference to the ability of acid (sulphuric) to produce a chemically-assisted dehydration of linen carbohydrates to get a yellow discoloration.\nI hope this makes sense, being written while a howling gale outside is stripping all the trees of their autumn leaves.\n\n","date":"October 28, 2013 at 5:20 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-48966","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Oops. Typo. 1314, not 1914.\n\n","date":"October 28, 2013 at 5:30 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-48969","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Fantastic! Josie, I salute you!\nBonkers, but fantastic.\n\n","date":"October 28, 2013 at 5:26 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-48968","author":"Hugh Farey","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"I am repeating the experiment with a plaster souvenir.  I did learn quite a bit though.  Called three funeral homes, two hung up on me. Finally El Angel funeral home of San Antonio, TX.  answered my question. Different parts of the human body do burn differently at the same temperatures. That is why the temperature of crematoria are gradually increased.  But here is something to ponder:  why would anyone use a coal to make the holes, when wooden fires were used to burn people?  I am going to try the experiment with and without camphor.  I am also going to use ALOES.  I always wondered why Joseph of Arimathea brought so much darned Aloe ( aloe sativa grows in the Holy Land and Egypt, aloe Vera here in the U.S. of A.  But I think they are basically the same).  Do you reckon it might have been used as a fumigant? Stories about mummification (It was still going on in Egypt because in the San Antonio Museum of Art there are mummies dating to the first and second century AD) no doubt were known.  I’m not saying J. of A. was trying to mummify Jesus! No WAY! But, I mean, who was thinking straight that day?!  Anyway, aloe is very gummy, very gooey.  Should have results by the end of the wk.  Yeah, I guess its a little crazy but lets face it; whoever did this, if indeed it was the product of human hands, had equipment much less sophisticated than mine. Wish me luck.\n\n","date":"October 28, 2013 at 11:09 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-48995","author":"Josie L. Tyner","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Colin,\nDisappointed you caught your typo. We could have needled you on that for years. :-)  However, as to your “bas relief” theory, I would merely paraphrase that renowned Englishman Ebeneezer Scrooge: “Bas relief? Bah, humbug.”\nWhat you are proposing is not a bas relief of a head but a bas relief o an entire body, front and back;  a bas relief that is accurate to extremely minute details. One that would be five – six feet tall give or take. It never happened.\nCan you point to any bas relief that is comparable at any time in art history? Could Charles Freeman? The creator of the bas relief would have been not only been  one of the greatest   artists of human history but one of its greatest, way ahead of his (or her) time,   forensic pathologists. Centuries of progress in medicine would have been short-circuited.\nThe image of the Shroud is of a real human body of someone who was tortured, scourged and crucified. And the image by any reasonable manner was created within 48 hours of his death. \nThose are facts. Any idea who it might have been? I am not sure you even deserve an “E” for effort.\nStrictly an “F” for fantasy. (If there any typos in this, as there are in many in my posts, I just wanted Colin to know, he is not alone). Love can make symbols real, but not fantasy.\nWould like  to meet you and others in Ohio. Think about it. You could put faces on your antagonists. I promise not to jeer (God willing I can make it.) \nAnd has to charcoal, a piece of charcoal with a tip fine enough to create the details of the image doesn’t exist. Neither, by the way is there such a paint brush. Heller covers that in his book.\n\n","date":"October 28, 2013 at 7:02 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-48975","author":"John Klotz","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Ohio? What time of year? Is it handy for Hawaii? \nThat’s all this devious, covertly agenda-pushing “pseudo-skeptic”  quote unquote dare say, given his wrong-headed materialist world view based on scientism, materialism and no doubt liberal dashes of other dodgy –isms, like Methodism through liberalism, reductionism, positivism, pragmatism, postmillenarianism, semicolonialism;  any one of these risks further negative-feedback, so I’ll jsimply leave a few apposite quotes from Luigi Garlaschelli’s paper which I’m presently re-reading with increasing admiration.\nRe claims for the TS having a generally authentic look, he writes: \n1. To satisfy the growing curiosity about the puzzling cloth, a first committee of neutral museum experts, art scholars, and forensic test specialists was appointed in 1973 by Cardinal Pellegrino. Art historians were sceptical as to the antiquity of the cloth and were rather inclined to see it as a late medieval work.\n2. Re the STURP findings : The image of the Shroud is very faint … and can be discerned by the naked eye only from a couple of meters away. \n3.  The image contains some 3D information. ….  The image seems to.lack the wrap-around lateral distortions that are to be expected from any likely interaction between a human shape and a cloth. The image has been called an orthogonal projection of a body onto a surface.  (my aside: too good to be true, unless miraculously projected, but if the latter then “anatomical accuracy” becomes meaningless in a scientific sense).\n…Many submicron sized particles of red ochre were found only in the image area and in the blood stains.\nAlthough the lack of historical records , the artist’s confession reported in the 1389 memorandum, and the results of the C-14 dating all seem to rule out the possibility that the TS is the actual burial cloth of Jesus of Nazareth, this hypothesis might still apply to a 14th-century artifact  obtained by wrapping the corpse of a crucified man. These hypotheses imply contact between the body and the cloth and some form of material transfer between them.\nFurther objections to the hypothesis that the Shroud is not an artifact are of course possible: for example it is a physical impossibility for blood oozing from the scalp to flow at the outer surface of the hair. Instead the whole hair mass should be matted and smeared. Moreover long hair should fall down at the sides of the face and could not possibly leave the kind of imprint one can see in the Shroud.\n… a general weakness of most of the attempts to reproduce the Shroud is that they try to generate an image as we see it today, i.e. extremely faint. We believe it much more likely that an artist would have preferred to create a clearly visible picture for the veneration of worshipers. In other words we must take into account the possibility that the original image has slowly faded during the (at least) 650 years of its existence.\n(Me again: as for claims for anatomical perfection): \n: “…the accuracy of the anatomy of the Man of the Shroud has been debated many times. Some researchers consider it perfect and flawless, others think it looks unnatural. According to Frederick Zugibe, it may even show evidence that Jesus suffered from Marfan’s Syndrome, a rare hereditary disease having among its symptoms elongated limbs, long spidery fingers and a long thin face. Since the image is fuzzy and ruined by burns, it is very doubtful whether accurate anthropometric measurements are possible (for example, in the front image the feet do not even show)…\nSo what price that so-called anatomical perfection (“accurate to extremely minute details”)?  Since when has proposed Marfan’s syndrome been the sine qua non  for anatomical perfection?\n\n","date":"October 28, 2013 at 9:34 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-48984","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Colin,\nAre you aware that some have claimed that the American President Abraham Lincoln displayed symptoms of  Marfan’s Syndrome” It is the subject of some debate. Without sounding condescending or neo-colonial (I have a Chinese Granddaughter who has brought joy to our family) “What has that [Zugbe’s diagnosis of Christ] have  to do with the price of tea in China?\nBy the way, Lincoln has been described as the greatest of American Presidents. He certainly was one of  the greatest members of humanity to occupy the White House. Has Steven Spielberg’s “Lincoln” crossed the pond yet. I am reminded just now, searching for words to describe Lincoln (and having seen a new production of MacBeth yesterday at Lincoln Center of Shakespeare’s)epitaph of Brutus (delivered by Mark Anthony)\n“He only, in a general honest thought\nAnd common good to all, made one of them.\nHis life was gentle, and the elements\nSo mix’d in him that Nature might stand up\nAnd say to all the world ‘This was a man!’:”\nStrange, but the more I think about, Jansenistes aside, those words might also apply to the Man in the Shroud.\n\n","date":"October 28, 2013 at 10:40 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-48992","author":"John Klotz","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Can someone please tell me when Mr. Klotz has returned safely to planet Earth, even if miles above terra firma.?  There may still be a faint chance of his cell phone signal becoming semi-intelligible. and to cease breaking up.   ;-)\n\n","date":"October 28, 2013 at 12:56 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49003","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Y’ALL ARE MISSING COLIN’S BIGGY. He shows us that the PCW is a perfect platform for a miraculous image. It offers wonderful possibilities for tonal qualities without paint or dyestuff. Miraculous pyrolysis is the perfect solution. Manmade and man-controlled dehydration on such a scale seems beyond even remote possiblies.\n\n","date":"October 28, 2013 at 4:25 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49024","author":"Paulette","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Read this please: http://www.shroud.com/pdfs/n74part3.pdf\nThis has been written by Italian nuclear physicists who are real experts in radiations and their possible effects. These researchers have carefully analysed all the most pertinent data coming from the Shroud and have concluded, just like Ray Rogers, that only a very mild and NATURAL process  involving some form (still undetermined) of a weak release of energy from the corpse (heat and/or post-mortem gases are the most probable scenarios for these experts) could have caused the formation of the very superficial and discontinuous image on the Shroud.\nHere’s one important part of their paper: “Successively, we have shown that the natural mechanism that led to the latent image is able to explain the chemical and physical characteristics of the Shroud body image[8]. This confirms that the attempts described in [3,4] produce images that are different from that obtained by a natural process [1,8].”\nNow, we got not only Rogers (who was a great expert in radiation) who say to us that we can forget any hypothesis involving some form of man made forgery or some form of supernatural process involving a form or another of energetic radiation but you also got some true experts in radiation from Italy who are completely INDEPENDENT from Rogers and who reached the VERY SAME CONCLUSION!\nI think the Shroud world should open up his mind a little bit more and listen carefully to what those Italian EXPERTS (no wanna-bes there) have to say, while also keeping in mind what Rogers had to say about the Shroud image…\n\n","date":"October 28, 2013 at 4:53 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49025","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"“…only a very mild and NATURAL process involving some form (still undetermined) of a weak release of energy from the corpse (heat and/or post-mortem gases are the most probable scenarios for these experts) could have caused the formation of the very superficial and discontinuous image on the Shroud….”\nPersonally speaking, I get somewhat weary of folk who write “most probable” when it should be “possible”,  or who overwork the term “stochastic” given that random collisions are a central feature of all chemistry, and become of increasing practical significance in slow systems (if indeed the Shroud image was formed slowly, which they think was the case with little it seems to go on except that stochastic randomness). Yes, those Italian radiation experts seem to think they can look at the Shroud image and detect a “stochastic” pattern that means there was a seeding of a latent image via radiation and then slow radiation-independent development.  Maybe, but I suspect that one can read too much into faint and aged images that have degenerated (also a stochastic process) and arrive at premature conclusions. Better in my view to collect more data on the image rather than be dogmatic as to the kinetics and precise mechanism of its formation. \nThere’s also the small matter of the scientific method – namely that hypotheses should framed in such a way as to suggest new lines of experimentation. Sticking to structure/function relationships avoids imposing theoretical straitjackets.\n\n","date":"October 28, 2013 at 7:30 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49042","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"“…the PCW is a perfect platform for a miraculous image…”\nNo doubt, the same was once said about chromosomes being the perfect platform for the miraculous storage and transmission of genetic information, before the discovery of DNA double helix and the triplet code. Personally, I get a lot more satisfaction knowing the details of that code, than merely assuming that inheritance is something we’ll never comprehend and must therefore be shrugged off as an impenetrable black box or miracle.\nMethinks there’s a lot more scope for a subtle and complex Shroud image if formed on a chemically heterogeneous platform than on Rogers’ ‘starch impurity’ coating, but crucially for head-to-toe homogeneity too when the heterogeneity is identical, from fibre to fibre.\n\n","date":"October 28, 2013 at 4:54 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49026","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"I’m in agreement with your last comment. But I think (though I need not think so for any non-scientific reason) that a miraculous dehydration is more probable than what you have so-far proposed. And in that regard I agree with Klotz. I can’t imagine either you or Rogers is right. Rogers, however, was more in touch and more humble with the reasons his hypothesis was inadequate. It may be just a matter of style. But none of this should mean that I am pushing miraculous image formation. I’m not. What I like is the better knowledge about the fiber and the “platform” possibilities it offers, which includes miraculous possibilities.\n\n","date":"October 28, 2013 at 5:59 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49033","author":"Paulette","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Paulette,\nWhy is everyone so afraid of some process involving resurrection causing the image? Such a process would be “natural.” For all the averting of our glances from the Resurrection, the fact remains that the Shroud is without historical precedent or antecedent. So is the Resurrection.\nI hate to keep beating the Abramoff drum, but if our consciousness is a quantum function and the brain functions through action at a distance quantum  entanglement and at death, as Abramoff theorizes,  the quantum information of our brain is discharged (reunited) with the quantum information of universe, than what’s the big deal with Resurrection?\nOf course there ares several steps in what I just wrote BUT each one of the steps is a question that at least some scientists are dealing with today. Scattered about the scientific landscape like a child’s collection of Legos the elements of science approaching these problems. The problem is putting them together.\nThe basic theories that Abramoff is espousing came from work he did with Nobel prize winning physicist Sir Roger Penrose. Penrose doesn’t carry the ideas as far as Abramoff but he partnered with Abramoff has they started down the trail. This brothers and sisters, this is not woo-woo. It isn’t pseudo-science. To paraphrase Churchill it isn’t the end of the trail, nor is it even the beginning of the end.  It is the the walk from the parking lot to the beginning. Alas, too many minds have stayed in the car in parking lot and rolled-up the windows  lest the bears come for them and disturb their comfortable agnosticism or atheism that demands nothing and justifies everything. Dawkins it is reported defending pederasty in English boarding schools, for example.  There may be risks but the trail is there, not altogether clearly marked but promising an exhilarating trek. Roll down the windows, get out of the car and get moving.\n\n","date":"October 28, 2013 at 9:26 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49053","author":"John Klotz","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Still waiting for someone to create an exact image of the shroud. C’mon you guys, you’re telling me you can’t create something that was created probably 2000 years ago? I’m disappointed.\n\n","date":"October 28, 2013 at 10:15 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49056","author":"Donn Reile","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Or possibly 800 years ago as the case might be.\nAlso check: “Shroud-like image formation during seismic activity;” by Giovanna de Liso; ENEA Frascati Conference May 2010. http://www.acheiropoietos.info/proceedings/DeLisoWeb.pdf\n\n","date":"October 28, 2013 at 11:47 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49063","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Do you have any biographical details on this lady, daveb? I can find nothing on Google Scholar except submissions to ‘acheiropoietos’ proceedings. Has she had anything published in mainstream scientific journals? \nI’m tempted btw to proffer some unsolicited advice on how not to write papers that combine the description of hitherto unreported phenomena obtained in the field, outwith labs with controlled conditions, and the specialized science and technology  that might be brought to bear once the  nature and causation of those new phenomena have been addressed. But first things first – what else has she published and where, and is it expressed in the same densely-interwoven mix of field and lab jargon (which I doubt somehow)?\n\n","date":"October 29, 2013 at 8:59 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49101","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Daveb, here’s what Fazio, Mandaglio and Rogers (all true experts in radiations) would tell you: It is simply impossible, theoretically speaking, to get the kind of extremely superficial and discontinuous distribution of yellowed fibrils that we see in the image area on the Shroud with any known form of energetic radiation.  Why?  Simply because these kind of processes are much too strong to achieve such a particular result.  Same thing for the scorch hypothesis of our friend Colin Berry.\n\n","date":"October 29, 2013 at 4:41 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49130","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"If you’re still waiting, it is truly possible that it’s simply due to the fact that no one ever dared to beat, scourge, torture and crucify a man and than, to place it loosely without any straps inside a linen burial cloth made with the ancient method of manufacturing linen cloths and wait between 24 and 36 hours before removing the body…\nReproducing a very complex biological process that was initiated by a weak release of energy coming from a fresh tortured corpse is not what I call an easy task…\n\n","date":"October 29, 2013 at 3:51 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49123","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"“Why is everyone so afraid of some process involving resurrection causing the image?” I have no problem whatever with the resurrection causing the image. I would just like to know how. The suggested mechanisms involving radiation are not coherent enough to admit of much investigation yet, but when anybody suggests one, I’ll be right there, being scientific, and trying to disprove it. That’s what scientists do. I sincerely hope the hypothesis resists such an attempt, whereby it will gain stature, if not, until it has been reproduced, authority.\n\n","date":"October 29, 2013 at 6:12 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49086","author":"Hugh Farey","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Hugh,\nI really don’t think I have any dispute with this. I do accept Rogers work on the age issue but the issue of image formation process is wide open. Where I have trouble is people who object to the process being “natural.” The self-conscious entity from which our existence sprang and which we call God, was the first naturalist. Go back far enough, everything is natural. Resurrection is beyond our experience, so it is disdained as unnatural. I think it’s simply unique. But that uniqueness holds out a promise to all of “woman born.” (I still haven’t gotten over the imaginative production of MacBeth I saw Sunday.)\nMy belief is that the Shroud is a finger print of the primordial consciousness.\n\n","date":"October 29, 2013 at 7:39 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49094","author":"John Klotz","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Progress report:\n1. As predicted, cotton fabrics give a far more intense scorch than linen, when the two are overlapped and imprinted with the same hot template spanning the two. Practical relevance: assuming it is the incredibly thin PCW of linen that is susceptible to scorching, and can be selectively scorched leaving the underlying cellulose core untouched, then it’s looking increasingly easier to rationalize the superficiality of the Shroud image as being restricted to the PCW, and to see why it is possible to have selective scorching.\n2. I have come across a very recent paper  (2011) that describes in detail how hemicelluloses, pectins etc can be simply removed from flax fibres using dilute caustic alkali (NaOH). \nhttp://www.hindawi.com/journals/ijps/2011/503940/\nThe paper shows photomicrographs before and after, suggesting strongly that it is an outer flaky coating that is removed by alkali leaving a smooth core.  (There may even be those ribs in the schematic diagram above, using the eye of faith). Could it be that a simple steeping  in alkali is all that will be needed to leave a chemically-stripped linen that will then resist being scorched? If so, that would provide prima facie evidence, would it not,  that the Shroud image might be restricted to the outermost, superficial PCW, explaining its alleged thinness (200-600nnm)?\n3. I have some liquid oven cleaner at home that is a mixture of sodium hydroxide and detergent. I shall try treating linen and maybe cotton straightaway to see whether the end-product, after washing and drying, is then scorch resistant.\nThis is going well, far too well. My luck can’t possibly hold…\n\n","date":"October 29, 2013 at 1:07 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49117","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Colin, once you will succeed to reproduced a body shape on a linen cloth with your method, I really wonder what you will do to reproduce on a linen cloth all the different kinds of blood and serum stains that are visible on the Shroud with a high level of fidelity…\n\n","date":"October 29, 2013 at 3:54 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49124","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Blood either came before image (as claimed) or it came after. Nobody says it came at exactly the same time as the image, so being temporally separated, blood stains can be addressed separately from the mechanism of image formation, which is just as well (science preferring to tackle one thing at a time).\n\n","date":"October 29, 2013 at 4:42 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49131","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"But if the bloodstains are real bloodstains coming from a real crucified body, don’t you think the most probable scenario for the formation of the image must be related to some form of energy naturally released by this dead body?  We know for a fact that the bloodstains were there BEFORE the image.  In this context, I don’t see any possible scenario involving a forger except a forgery scenario involving a forger taking a real crucified body in order to produced a false relic of the Passion of Christ with his bloody stigmata plus a body image, which, in such a context, could well have been produced naturally BY ACCIDENT.  But you should agree with me that such a scenario is far from being more probable than the one involving the natural formation of the bloodstains and the body image by the dead body of Jesus of Nazareth after his entombment.  Note: this scenario do not necessarily imply any supernatural event related to the Resurrection, but it COULD.\n\n","date":"October 30, 2013 at 8:29 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49196","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Follow up report: have got a good result with cotton – alkali pre-treatment results in a marked reduction in scorch intensity. That was using a 30 minute steeping in  commercial oven-cleaner diluted 1:5. The result with linen was not nearly so clear cut – disappointing in fact – with a smaller difference (just discernible maybe). But these are early days. Maybe a higher concentration of alkali is needed with linen or a longer treatment period.  These are early days. More work is needed. \nIt may be that linen has a negligible amount of PCW, compared to cotton, as a result of anatomical differences or retting. But that would still leave hemicellulose admixed with cellulose in the secondary cell wall comprising the core of the fibre – less superficial but still prone maybe to dehydration and yellowing , while making for a less simple take-away story.  But there we go: that’s science bizz – one takes each day as it comes…\n\n","date":"October 29, 2013 at 4:57 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49132","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"I’m not a scientist but I do love this blog. Great research by you scientists. I wish everyone in the world would read this blog! Just fascinating stuff. Keep up the good work!\n\n","date":"October 29, 2013 at 10:51 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49155","author":"Donn Reile","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Update: Wednesday am\nIf cotton were linen, then I would be able to announce the (well nigh) perfect result, based on that graphic above showing reactive hemicellulose being the most superficial layer, and thus prone to both heat degradation, and solublization in alkali. You see, after steeping cotton overnight in diluted alkali, there is now an amazing difference in ‘scorchability’ – the untreated cotton being black, and the treated being a faint tan.\nSadly for shroudology (or fortuitously for some) linen is not cotton, and behaves very differently. First it is far less prone to scorching, and secondly there is scarcely any difference between alkali-treated and control (there’s a little, as per prediction, but not nearly enough upon which to build a case). \nI have now emptied undiluted oven cleaner onto linen in an attempt to snatch victory from the jaws of defeat. I’ll test half of the fabric this evening.\nIn the meantime, I’m thinking of other possible scenarios that are not inspired by that graphic above. Hugh Farey mentioned lignin a while back as a possible target for whatever produced the image on the Shroud, and there is plenty of that in certain grades of linen, both at those peculiar dislocation nodes, and according to some, outside them as well. While I’m in sloshing chemical mode, it occurs to me that lignin can be dissolved out with metabisulphites, as per paper industry, and that the Campden tablets one uses in wine-making as a disinfectant are mainly sodium metabisulphite. So at some stage I’ll repeat these tests, substituting metabisulphite for alkali, and see if I can bring linen to heel, darned pesky disobedient stuff…\n\n","date":"October 30, 2013 at 8:19 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49193","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"\nAnonymous :\nBut if the bloodstains are real bloodstains coming from a real crucified body, don’t you think the most probable scenario for the formation of the image must be related to some form of energy naturally released by this dead body?  We know for a fact that the bloodstains were there BEFORE the image.  In this context, I don’t see any possible scenario involving a forger except a forgery scenario involving a forger taking a real crucified body in order to produced a false relic of the Passion of Christ with his bloody stigmata plus a body image, which, in such a context, could well have been produced naturally BY ACCIDENT.  But you should agree with me that such a scenario is far from being more probable than the one involving the natural formation of the bloodstains and the body image by the dead body of Jesus of Nazareth after his entombment.  Note: this scenario do not necessarily imply any supernatural event related to the Resurrection, but it COULD.\n\nAs soon as I talk about the image, someone is sure to come along and say “Ah, but there’s blood underneath”. And and as soon as I talk about the blood, someone says “Ah, but there’s an image on top”.\nIn fact I think that the chronology of blood v image placement is still a moot point, based on different lines of evidence, and needs re-investigating as a matter of urgency (though image first would not look good for authenticity). In the meantime, my mind is on that image – blood can wait (again) for another day.\n\n","date":"October 30, 2013 at 8:54 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49199","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"It’s almost always the same thing in Shroud research: people always commit the very huge mistake of considering the body image separately from the blood and serum stains. Since these biological stains confirm the fact that there really was, for a short period of time, the dead body of a tortured man in that cloth, I don’t see any good reason to look elsewhere than some undetermined natural process for the formation of the body image that is certainly related to the biological state of the Shroud man’s body. And if you don’t agree with me about this, that would mean you believe that a forger would have created manually the image from the already bloodstained burial cloth of a crucified man (all this without disturbing the stains) or he would have created manually the image first and then, he would have used the real and fresh corpse of a crucified man to produce by direct contact the blood and serum stains “in sync” with the image (and all this from clotted blood on the skin and not from free blood in liquid form)?  Seriously, if you don’t agree with my first statement, that’s the kind of highly improbable scenarios you’re forced to rely on.  And if you really want to rest your case on this kind of highly illogical hypothesis, I would be forced to put your judgment of scientist in question…\n\n","date":"October 30, 2013 at 11:10 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49212","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"“I would be forced to put your judgment of scientist in question…”\nOne day, when I’ve time, I’ll explain the way that science works – or, as often as not  – does not work, at least on desirable time scales. \nThere are at least 13 process skills that are called into play (from memory), with different folk endowed with different mixes, so the scientific MO does not really lend itself to philosophical analysis, it making demands at so many levels that are not pure reasoning, or logic or intellect. \nTry not to take snapshots of science – they rarely capture anything of value re the essence of the scientific MO. Read Watson’s “The Double Helix” and you’ll get a much better idea of the clash of temperaments  and different modus operandi that, when put together,  can ultimately yield the right answer – or,  at any rate, part of the answer.\nScience is a hit-and-occasionally-not-miss method for probing those unknown unknowns – it’s not a fixed mind set…\nThink of it as a poker game where it’s mainly but not all down to luck…\n\n","date":"October 30, 2013 at 12:08 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49218","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Colin, I would like you to answer the previous comment above.  In fact, I would like to learn if you really believe in one of the two scenarios I describe in case the Shroud image would have been produced manually by a forger…  I’m very curious to learn if you really believe such a ludicrous scenario.\n\n","date":"October 30, 2013 at 2:08 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49233","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"“Since these biological stains confirm the fact that there really was, for a short period of time, the dead body of a tortured man in that cloth …” Really? Be careful…\n\n","date":"October 30, 2013 at 12:28 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49220","author":"Hugh Farey","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"It’s incredible to see how people don’t want to agree with the facts.  Both bloodstains and body image are in total sync with the scenario of an enshrouded body.  It’s ludicrous to deny that fact.  Try something else please.  First thing you should try is to seriously consider the two ludicrous options that are left if you deny this basic fact.  Then, if you still want to believe that a forger could have manually produce the Shroud image with all its forensically perfect blood and serum stains (remember that this is a strong indicator of exudates of blood clots and not fresh liquid blood), it’s your liberty and I won’t say a word.\n\n","date":"October 30, 2013 at 1:04 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49221","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"That’s a rant, if you don ‘t mind my saying. Feeling better now, are we?\n It’s a length of carefully preserved linen – with a faint but  interesting image – when all is said and done…\n\n","date":"October 30, 2013 at 1:18 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49222","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Nice to see you back, Yannick. Or someone who sounds and thinks a lot like Yannick. ;)\n\n","date":"October 30, 2013 at 1:37 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49223","author":"David Goulet","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"The whole picture draw by all the most solid facts and observations collected by STURP (not by Colin Berry or Hugh Farey or me) points directly in direction of a naturally produced image and bloodstains, which both came from the presence for less than 48 hours of a tortured and crucified dead body inside the cloth.  You can say or think what you want but, in the present state of our knowledge about the relic, you will never be able to change this REALITY. Of course, if future researches can prove the STURP team was wrong about some aspects of the relic, that could change one or two things.  But presently? No way.  And seriously, I would be very surprise if a new series of direct research would prove the STURP team was wrong on the most important aspects of the relic.\n\n","date":"October 30, 2013 at 1:41 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49225","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"One important precision :  So far, there is, in my mind, only one important conclusion of STURP that is probably false and that only future researches on the cloth could prove : the chromophore.  I seriously think there are very good reasons (ghosts, banding effect, confirmed presence of starch in the non-image area, historical reliability concerning the ancient method described by Rogers that would have left a layer of impurities on top of the cloth, etc.) to believe Rogers was correct later on when he conclude that the image is only residing in a thin layer of carbohydrate impurities instead of being located inside the inner structure of the linen fiber itself (like the STURP team thought at the time of their final report).  And this make all the difference in the world versus the question of the image formation process that lead to the presence of the body image on the cloth.  But again, as I said, only a new series of direct tests could settle this question once and for all.\n\n","date":"October 30, 2013 at 2:06 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49232","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"\nDavid Goulet :\nNice to see you back, Yannick. Or someone who sounds and thinks a lot like Yannick. ;)\n\nYou may think that, David, but I couldn’t possibly comment…   ;-)\n\n","date":"October 30, 2013 at 1:42 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49226","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"I’m not Yannick.  I’m just his phantom… ;-)\n\n","date":"October 30, 2013 at 1:44 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49227","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Vive le phantom. Just keep it short please…\n\n","date":"October 30, 2013 at 1:45 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49229","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Phantom in french spells “fantôme”… ;-)\n\n","date":"October 30, 2013 at 1:54 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49231","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Seriously, forget who speaks and please concentrate on what his said by this person…  Is it dumb or not?  Is it highly probable or not?\n\n","date":"October 30, 2013 at 1:45 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49228","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"No, it’s simply not. It’s not impossible, but the reflectance spectrum of the blood simply doesn’t match the reflectance spectrum of… um… blood. Nor, before we wander off down that track, do the bloodstains resemble bilirubin. I don’t disagree that there is biological material there, and for all I know there may be a blood component, but even if it were competently established that the marks were actually made from the blood of a dead, tortured, man, that still wouldn’t prove, or even suggest, that he was present when his blood was applied to the shroud. As for the comment that the “bloodstains and body image are in total sync with the scenario of an enshrouded body,” even committed authenticists argue for at least three, quite contradictory, interpretations of what that might mean. Wrapped (for the bloodstains, possibly), draped (for the image, possibly), or horizontal (also the image). Some people call for a combination of all three. They can’t all be correct. Which of them specifically is it ludicrous to deny, in your opinion?\n\n","date":"October 30, 2013 at 2:10 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49235","author":"Hugh Farey","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Quote : “the reflectance spectrum of the blood simply doesn’t match the reflectance spectrum of… um… blood.”\nAdler and Baima Bollone’s testing proved that this is real blood (on the Shroud and also on the Sudarium of Oviedo and also on the Tunic of Argenteuil).  There is no good reason to deny this basic fact. \nSo, it is real blood material BUT not complete blood that would have stain the cloth in liquid form.  When people will finally understand this important aspect of the question?  On the Shroud, it is not complete blood that has stained the cloth in liquid form but exudates of blood clots.  I’m sure this can account for the particular reflectance spectrum.\nAnd seriously, if you prefer to rely on the reflectance Spectrum for the blood issue more than on the chemical tests that were performed by true experts, it’s your liberty.  I will certainly not fall into that trap. And if I’m right, there is even one DNA test that was performed in Texas that showed the bloodstains were truly made of human blood material. This test never was recognized by Turin but it was really performed…  \nAnd for the transfer processes that lead to the formation of the bloodstains and body image, what I meant is this: all the data coming from the Shroud strongly suggest that both processes originated from a real dead body that was covered by the Shroud. That’s what I meant.  For the bloodstains, it’s pretty evident that they all came from direct contact between a wooden human body and the cloth it covered and for the image, it was most probably formed at a time the cloth was more loosely draped over the cloth.  But in the end, both transfer certainly happened while there was a dead body placed inside this Shroud…\n\n","date":"October 30, 2013 at 3:11 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49243","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"One last thing concerning the reflectance spectrum of the Shroud blood.  As you point out yourself talking about the high level of bilirubin that is probably there : these bloodstains come from an highly tramatized person and I’m sure this could also had a huge impact on the resulting reflectance spectrum of those stains.  One thing’s for sure : the blood material that composed the Shroud’s bloodstains is very different than some bloodstains that would have been left on a cloth by the blood flowing out in liquid form of the open wound of a normal and non-tortured person.  And in the end, please consider this : even the color of the blood is unusual for an old blood (especially when it is put under UV light). Does this means the blood is not real human blood?  Of course not!\n\n","date":"October 30, 2013 at 3:28 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49247","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"\nAnonymous :\nPhantom in french spells “fantôme”… ;-)\n\nUn immediament internet searche sous le nom “phantome”, sans le circumflexe, qui utilise le franglais, il a dit que: “Un fantôme est une apparition, une vision ou une illusion interprétée comme la manifestation surnaturelle d’une personne décédée”.\nMais a t’il produce un image sur la fabrique, c’est que je veux apprendre…\n\n","date":"October 30, 2013 at 2:08 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49234","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"There’s a difference between Quebec French and France French, says the guy with the French last name who cannot speak either. :(  Malheursement.\n\n","date":"October 30, 2013 at 3:09 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49242","author":"David Goulet","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"A very big difference I might add…  Quebec language is not even French anymore.  It’s more a sort of “slang” language that originated from French.\n\n","date":"October 30, 2013 at 3:13 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49245","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"\nAnonymous :\nAnd if I’m right, there is even one DNA test that was performed in Texas that showed the bloodstains were truly made of human blood material. This test never was recognized by Turin but it was really performed…\n\nThe genes that were evaluated are not exclusive to blood material.  These tests only show that human DNA is present on the Shroud-they do not confirm that the bloodstains were truly made of human blood material-the DNA could have just as easily gotten there through handling (contamination).   \nImmune receptor gene rearrangement is unique to lymphocytes, a type of white blood cell.  In all other cell types in the body, such genes remain in the unrearranged (germline) configuration-this is the only type of DNA test that would truly show that the DNA originated from blood cells.   \nhttp://www.shroud.com/pdfs/kearse2.pdf\n\n","date":"October 30, 2013 at 6:23 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49270","author":"Kelly Kearse","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Thanks for the precision.  I wasn’t aware of this.  Nevertheless, it would take someone with a big closed-mind to not agree with the strong conclusions of Adler and Baima Bollone (2 conclusions made by independent experts) that the blood on the Shroud is real human blood.  This is one of the strongest conclusion that came out of the 1978 investigation and I don’t think there’s any good reason to doubt this.  We don’t need DNA proof for this, even though it would be, of course, the last confirmation to obtain to put a 100% sure proof over this. Let’s say that, presently, there is something like a 99% proof.\n\n","date":"October 31, 2013 at 8:28 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49310","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"If you’re not sure about my 99% certainty about the human blood conclusion, please read this other comment of mine where I have reprinted a portion of the last paper of Adler on the subject : https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/#comment-49311\nBe certain that an expert in blood like Adler would never have used a tone so confident in his paper if he, personally, would not have been sure about the conclusion that the bloodstains on the Shroud are really composed of human blood and, not only this, but of human blood of someone who was in a highly traumatic state when he shed that blood, which, as Adler was well aware, is totally consistent with the image of a beaten, scourged and crucified man we see on the Shroud.\n\n","date":"October 31, 2013 at 9:02 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49316","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Adler was an organic chemist, specializing in porphyrin chemistry and synthesis.To my knowledge he was not an expert in blood, and never claimed to be, except insofar as blood contains haemoglobin, and haemoglobin contains protoporphyrin IX.\nBut why are you here, posting comment after comment on blood as a marker for authenticity, some of which, candidly, are rants that we have seen on numerous previous occasions?  It is all so repetitive, i.e. that your favourite experts could not possibly have been wrong or under-informed, despite having to be content for the most part with tiny sticky-tape samples, allowing only microscopy and spot tests.\n The posting is not about blood, nor is it (directly) about authenticity. It is about target molecule(s) for image reception on linen fibres. Can we stick to the topic please?\n\n","date":"October 31, 2013 at 9:23 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49321","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"My “favorite” expert’s conclusion was independently confirmed by another true expert named Baima Bollone.  I don’t have any reason to doubt their principal conclusions versus the blood.\nAnd if you don’t want to talk about the evidence coming from the bloodstains, maybe it’s because you’re well aware of the fact that this is enough to prove that your own hypothesis on image formation is completely off-track versus the reality of the Shroud.  The bloodstains alone are telling us that the body image is most probably the result of a direct interaction between the cloth’s surface and a dead body of a crucified man…  But obviously, this is not what you want to hear.\n\n","date":"October 31, 2013 at 9:38 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49322","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Stop pressForget about the primary cell wall, forget about hemicelluloses. They may be relevant to cotton, but not linen (maybe retting removes them at the same time as pectins).\nFact: one can dunk linen in undiluted oven cleaner (“5-15% sodium hydroxide”) for several hours and it has scarcely any effect on its ability to take a scorch (whereas that of cotton is clobbered by the same treatment).\nWhy?  The answer has been staring me in the face for months, but I’m either too thick or senile or both to have seen it.Dislocation nodes.\nSo how did the eureka moment arrive?  I began wondering what might be taking the faint scorch on linen if it was not hemicellulose. Fats or protein? They would surely be clobbered with strong alkali. Lignin (mentioned yesterday)?  I steeped linen yesterday in strong metabisulphite solution, said to dissolve lignin, but there was no effect on “scorchability”. So what does that leave?\nAnswer – amorphous cellulose, i.e. cellulose that is NOT part of highly crystalline arrays. That is a description of cellulose in the PCW and perhaps a few regions of the SCW also, and importantly, while more ready to dehydrate and scorch, it may still be chemically resistant to alkali.\nThen I suddenly remembered a posting I did months ago: linen fibre nodes are where one sees most of the colour in the scorched fabric under the microscope.\nhttp://shroudofturinwithoutallthehype.wordpress.com/2013/01/08/it-would-seem-that-those-linen-fibre-nodes-aka-dislocations-are-prime-targets-for-a-thermal-imprint-from-a-hot-template-scorch-mark/\nSomewhere I’ve read that odd things happen to cellulose in the region of flax nodes (reversal of helical direction?). \nHypothesis: the dislocation nodes of linen fibres have relatively non-crystalline cellulose, and it is that which is the main site of chemical dehydration in a retted flax fibre that has lost most of its PCW hemicellulose through microbial action.\nDoes anyone have any good HD photomicrographs of Shroud image-bearing fibres that show the nodes?\n\n","date":"October 31, 2013 at 3:46 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49292","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"This is really interesting. I admit that I am really more of a paleoarchaeosteganocryptananalyst (having studied it for 15 minutes), than I am a materials scientist (having only studied it for 40 years), but I am drawn to a remark in Amorphous Cellulose – Structure and Characterisation (http://www.cellulosechemtechnol.ro/pdf/CCT1-2(2011)/p.13-21.pdf), to wit:\n“Most cellulosic materials consist of crystalline and amorphous domains, in varying proportions, depending on both source and history. The physical properties of cellulose, as well as their chemical behaviour and reactivity, are strongly influenced by the arrangement of the cellulose molecules, with respect to each other and to the fibre axis as well. [U] Most of the reactants penetrate only the amorphous regions, and it is only in these regions with a low level of order and on the surface of the crystallites that the reactions can take place, leaving the intracrystalline regions unaffected.[/U]” (Underlining mine)\nFurthermore, in Thermogravimetric Measurement of Amorphous Cellulose Content in Flax Fibre and Flax Pulp (http://link.springer.com/article/10.1007%2Fs10570-010-9472-0#page-1), we read:\n“For amorphous cellulose two interpretations have been discussed: amorphous zones are periodically arranged along the microfibril, or amorphous cellulose consists mainly of surface chains. This last hypothesis is supported by the relation between crystallinity and reactivity of the cellulose.” It looks as if we need not go exclusively to the nodes. It also looks as if that cleaning off of the irregular surface described in one of your references above might also remove any amorphous cellulose.\n\n","date":"October 31, 2013 at 6:23 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49299","author":"Hugh Farey","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Snap as regards the second source. Hugh, which I had placed just 30 minutes ago in a start-up bibliography on my new Eureka! posting, 1 of 2. Am glad you consider it significant too (and am heartened to learn that there is an entire textbook devoted to amorphous cellulose).\nI’m somewhat puzzled by your comment “we need not go exclusively to the nodes”. When one looks at fibres from the faintest scorch imprints on linen, most of the brown colour is at the nodes, though granted there is a faint yellow coloration on the rest of the fibre. Aren’t those nodes the place to focus on, given the faintness of the Shroud image?\nThere seems to be little info (or interest) in the literature on the precise function of those nodes, but one possibility is that they provide a little give to the stem fibres of the flax plant through having tiny non-crystalline regions that act like slightly flexible kinks. I’m presently wondering of that amorphous cellulose is PCW, SCW or both, and trying to fit that to the subtle properties of the Shroud image (360 degree encirclement of the fibre of imprinted regions, half-tone, striations, superficiality etc). But this could all be a waste of time if the nodal location  of image pigment does not show up on the Shroud. Thus the repeated plea for some high mag/HD photomicrographs, to which so far there’s been no response. Mark Evans portfolio? Thibault Heimburger? Barrie Schwortz? Can anyone assist?\n\n","date":"October 31, 2013 at 6:54 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49303","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Gr.12 chemist here. Can you explain in layman’s terms why this eureka makes you so excited? I’d like to be excited too.\n\n","date":"October 31, 2013 at 7:28 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49305","author":"David Goulet","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"\nDavid Goulet :\nGr.12 chemist here. Can you explain in layman’s terms why this eureka makes you so excited? I’d like to be excited too.\n\nExcited? I’m more relieved than excited, David, relieved that there’s a target molecule that provides a reasonable match to the data.  You  may recall that STURP confined its conclusions to stating that the Shroud image resembled a scorch, being dehydrated carbohydrate, but without specifying which carbohydrate, or where, making any kind of fingerprinting impossible. That was 25 years ago, and I think it fair to say that progress on further characterization of the Shroud image – or even thermochemical modelling thereof – has been essentially zilch. I propose that the Shroud image is dehydrated amorphous cellulose, probably concentrated at the dislocation nodes of linen fibres. Eureka (but I could be wrong).\n\n","date":"October 31, 2013 at 7:49 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49306","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"For those, like Hugh, who are still uncertain that the bloodstains on the Shroud are really made from human blood because their spectral characteristics are somewhat different than the normal characteristics of ancient blood, I strongly suggest you to read the excellent paper presented by Alan Adler at the International Scientific Symposium of Turin in March 2000.  And for those who are unable to put their hand on it, here’s the most relevant part concerning the subject of the spectal characteristics of the Shroud’s bloodstains (emphasis are mine):\n“An X-Ray fluorescence investigation (note: a study published in 1980 by Morris, Schwalbe and London of STURP) was carried out on the Shroud to complement the X-radiographic study (note: a study published in 1980 by Mottern, London and Morris of STURP). The blood marks show an element distribution CONSISTENT WITH A BLOOD CLOT EXUDATE, including an iron value elevated over the cloth background value, but no evidence for the presence of mercury or any of the trace elements associated with the mineral forms of iron oxides. This observation SUPPORTS BLOOD MARKS IDENTIFICATION AS BLOOD DERIVED, BUT DOES NOT SUPPORT THE PROPOSAL THAT THE BLOOD MARKS ARE PAINTED MINERAL MIXTURES OF IRON OXIDE AND MERCURIC SULFIDE (VERMILLON). This is IN AGEEEMENT WITH THE CHEMICAL AND X-RADIOGRAPHIC CONCLUSIONS (note: that the bloodstains are really made of real human blood material). An independent scanning electron microprobe study (note: a study published in 1981 by Baima Bollone, Jorio and Massaro in Italy) compared one of the blood particles with a control sample of human blood and found AN EXCELLENT MATCH, FURTHER SUPPORTING THESE CONCLUSIONS.\nUltraviolet and visible reflectance studies were carried out on the Shroud and also some fluorescence spectroscopy (note: both studies published in 1980; one by Pellicori and the other by Gilbert and Gilbert of STURP). In general, these observations COMPLEMENTED THOSE SEEN IN THE FLUORESCENCE PHOTOGRAPHIC STUDY (note: a study published in 1981 by Miller and Pellicori of STURP). The reflectance spectra of the blood marks from the whole cloth and also a near UV-visible microspectrophotometric study of blood particles from the sticky tapes (note: a study published in 1980 by Heller and Adler of STURP) are CONSISTENT WITH THE SPECTRA EXPECTED FOR A TRAUMATIC BLOOD CLOT EXUDATE. In a more recent study (note: a study published in 1998 by Adler, Selzer and DeBlase), transmission UV-visible spectra of a simulacrum of a TRAUMATIC CLOT EXUDATE prepared from laboratory chemicals MATCHES THESE OBSERVED SHROUD SPECTRA, but the simulacrum of a mineral pigment “blood” composed of iron oxide, mercuric sulfide and gelatin IS A COMPLETE MISMATCH. This CONFIRMS THE PREVIOUS CHEMICAL AND FORENSIC CONCLUSIONS. It is of interest to note that the position of the near UV PEAK FOR ALBUMIN BOUND BILIRUBIN IS INDICATIVE OF THE TYPE OF SPECIES FROM WHICH THE BLOOD ORIGINATES AND IN THESE OBSERVED SPECTRA IS CONSISTENT WITH A PRIMATE ORIGIN (note: see Heller and Adler’s paper published for STURP in 1981 and entitled “A Chemical Investigation of the Shroud of Turin”), IN AGREEMENT WITH THE IMMUNOLOGICAL STUDIES IDENTIFYING A HUMAN SOURCE FOR THE BLOOD MARKS (note: Adler probably refers here to the studies performed by Baima Bollone in Italy).\nAn infrared reflectance examination of the Shroud accompanied the thermographic study (note: a study published in 1980 by Accetta and Baumgart of STURP). Although these spectra were of low resolution, some high and low frequency peaks typical of amide absorptions associated with proteins could be detected in the blood mark spectra, but not in those of the body images. THESE RESULTS WERE CONFIRMED AND EXTENDED in a more recent high resolution microspectrophotometric FTIR investigation of fibers and particles extracted from the STURP sticky tapes (note: a study published in 1996 by Adler). Again, protein amide bands were ONLY OBSERVED IN THE BLOOD PARTICLES AND THE SERUM COATED FIBERS ASSOCIATED WITH THE BLOOD MARKS. Utilizing the spectral analysis capabilities of the computer program accompanying this instrument, which allows one to add or subtract standard spectra of a known molecule to the observed spectrum, testing its presence, IT WAS DEMONSTRATED THAT THE OBSERVED SPECTRA OF THE BLOOD PARTICLES CONTAINED BOTH METHEMOGLOBIN AND ALBUMIN BOUND BILIRUBIN (note: this strongly suggest that the bloodstains on the Shroud comes from someone who was in a highly traumatic state at the time he shed is blood). INFRARED SPECTRA OF THE TRAUMATIC BLOOD CLOT SIMULACRUM CITED ABOVE AGREED WITH THAT OF THE OBSERVED BLOOD PARTICLE SAMPLES (note: he talks about the blood particles coming from a bloodstained area on the Shroud), BUT THE MINERAL PIGMENT SIMULACRUM DID NOT. These results AGAIN CONFIRM THE CHEMICAL AND FORENSIC CONCLUSIONS AND DEMONSTRATE THAT THE BLOOD MARKS ARE NOT PAINTINGS.”\nNow, after having read this part of Adler’s paper, which was written shortly before the death of this true expert in the chemistry of blood, if you still unsure about the fact that the bloodstains on the Shroud are really made of real human blood and, more precisely, of blood clot exudates coming from an highly tortured man, I don’t know what it will take to convince you! In my mind, this is the strongest fact coming from the whole investigation performed by STURP (and also by Baima Bollone in a completely independent mode)! Yes, the chemical, physical and spectral characteristics of the bloodstains on the Shroud are showing some noticeable differences with normal bloodstains made of liquid blood coming from someone who was not tortured for several hours prior to death (whether it be the chemical composition, the visible color, the spectral characteristics, etc.) AND IT’S TOTALLY NORMAL THAT IT IS THAT WAY SINCE THE BLOOD ON THE SHROUD IS MAINLY COMPOSED OF EXUDATES OF BLOOD CLOT SHED BY A MAN WHO WAS IN A HIGHLY TRAUMATIC STATE PRIOR TO DEATH!  This is what can explain the differences versus normal ancient bloodstains that was noticed by other people over the years.  \nI don’t have anything else to say on the subject, except for the fact that this very strong scientific fact coming from the blood is the most solid piece of evidence that support the authenticity of the Shroud as a real burial cloth and, not only that, but as the authentic burial cloth of none other than Jesus of Nazareth! Also, it confirms the principal conclusion of STURP, i.e. that the body image on the cloth must have come from an interaction (supernatural or, more probably, natural) between the burial cloth and the dead and crucified body that was present in it for less than 48 hours. \nNow, if people don’t want to see what is as evident as the nose in anyone’s face, what can we do?\n\n","date":"October 31, 2013 at 8:28 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49311","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Essentially, I think, its the superficiality thing. To help with the explanation, I will say that the shroud is woven of threads, and each thread is made of twisted fibres. These are loose and can be pulled apart with a needle. Each fibre, in turn, is made of fibrils, packed around a hollow centre, the lumen, and surrounded by a sheath. It seems reasonably clear from Mark Evans’s micrographs that the image appears only on the uppermost fibres of the threads of the shroud, not on the fibres buried within the threads, and not on the fibres as they dive beneath other threads as part of the weave. It is not clear from Evans’s photos whether these coloured areas are as a result of the whole fibre being discoloured, just the sheath, just the fibrils, or what.\nExplaining the mechanism of image formation, whether by heat (subdivided into conduction and radiation), chemically (by gas diffusion or possibly direct contact), or some other kind of electromagnetic or nuclear radiation, must intimately involve the chemistry of the fibres, and those who study it are not in universal agreement, to put it mildly. Any kind of gas diffusion and most kinds of radiation seem to penetrate too deeply and too widely, and even conduction or contact must be fantastically discriminate to produce such an effect. I have shown that brushing the surface of linen with a hot spatula can do it, but am not aware of any other method that simple. Most experimenters have first done something to weaken the correct fibres appropriately, and then produced the surface discolouration by heating in an oven. Fanti and his friends have found that very intense, very short bursts of laser light can do the trick, while Garlaschelli has done it by dabbing cloth with a gel containing sulphuric acid. Rogers despaired of achieving it in the end, and postulated that the linen wasn’t degraded at all, but that the image appears only on a surface coating derived from an evaporation gradient.\nWhatever the truth of the process, understanding the relative sensitivities of the chemicals which make up the linen fibres, be they cellulose (crystalline or amorphous), lignin (with or without vanillin), hemicellulose, pectin or anything else, ought to be a great help.\n\n","date":"October 31, 2013 at 8:45 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49313","author":"Hugh Farey","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Quote: “Fanti and his friends have found that very intense, very short bursts of laser light can do the trick.”\nComment: Yes, BUT ONLY for the superficial nature of the image. With lasers, it is THEORETICALLY IMPOSSIBLE to get a discontinous distribution of colored fibers in an image area like we see on the Shroud and this definitive conclusion doesn’t come from me or you but from real expert in the field of radiation named Fazio and Mandaglio.  Seriously Hugh, you can forget a burst of high energetic radiation as the cause of the image on the Shroud…  The answer to the “mystery” is most certainly much more milder than such an high-energetic process.\n\n","date":"October 31, 2013 at 9:06 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49317","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Thanks Hugh. There’s nothing there with which I disagree. However, let’s not forget that we frequently see assertions on this site to the effect that no one has succeeded in reproducing all the subtle characteristics of the Shroud image*, right down to the microscopic characteristics. Yet I for one have never seen the photomicrographs on which those claims are based. I am not questioning the evidence – but  would simply like to see it with my own eyes, especially with a view to determining where the image is in relation to those dislocation nodes. \nIn passing, might I ask which Mark Evans photos you refer to (links?) and whether they are at a sufficiently high level of magnification and resolution to see the nodes?\n* as listed in my previous comment, i.e. 360 degree encirclement of the fibre of imprinted regions, half-tone, striations, superficiality etc.\n\n","date":"October 31, 2013 at 9:07 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49318","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"I just meant those ones you get by putting “shroud” and “Mark Evans” on Google images. Nothing new, I’m afraid.\n\n","date":"October 31, 2013 at 10:18 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49325","author":"Hugh Farey","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Sorry, Anonymous’s comment’s slid in before my reply to David.\nAnonymous, I have read all the papers you cite, and believe I have covered their conclusions before on this blog, probably in response to a similar posting by yourself. I will limit myself to a two observations, and hope that others will understand that your entire comment is similarly flawed.\nFirstly:\n“An X-Ray fluorescence investigation […] was carried out on the Shroud to complement the X-radiographic study […]. The blood marks show an element distribution CONSISTENT WITH A BLOOD CLOT EXUDATE, including an iron value elevated over the cloth background value, but no evidence for the presence of mercury or any of the trace elements associated with the mineral forms of iron oxides.”\nThe actual words of the report are:\nIn the initial abstract – “In ‘blood’ stain regions the measurements show significantly higher concentrations of iron. However the data do not allow a unique identification of the stain’s origins.”\nIn the Conclusion – “Substantially non-uniform concentrations of iron were observed, particularly at the dorsal-foot and side-wound ‘blood’ stain regions. However we can say no more than that either blood or some iron-based pigment was used to produce the stains.”\nOh, and the word ‘mercury’ does not appear in the report at all.\nSecondly:\n“The reflectance spectra of the blood marks from the whole cloth and also a near UV-visible microspectrophotometric study of blood particles from the sticky tapes […] are CONSISTENT WITH THE SPECTRA EXPECTED FOR A TRAUMATIC BLOOD CLOT EXUDATE.” Need I remark that in none of the papers cited do the words “trauma”, “exudate” or “clot” appear at all, let alone an image of the “spectra expected” from one.\n“In a more recent study […], transmission UV-visible spectra of a simulacrum of a TRAUMATIC CLOT EXUDATE prepared from laboratory chemicals MATCHES THESE OBSERVED SHROUD SPECTRA, but the simulacrum of a mineral pigment “blood” composed of iron oxide, mercuric sulfide and gelatin IS A COMPLETE MISMATCH.” The spectra from which this nonsense is derived can be seen at http://www.sindone.info/ADLER.PDF. The accuracy of the comments above can be judged by anybody who cares to look at it.\nAs I remarked above “I don’t disagree that there is biological material there, and for all I know there may be a blood component” but to claim any proof from the battery of investigations cited above is wildly over-egging your pudding…\n\n","date":"October 31, 2013 at 10:16 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49323","author":"Hugh Farey","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Quote : “but to claim any proof from the battery of investigations cited above is wildly over-egging your pudding”\nThis conclusion don’t come from me!  It comes from true experts like Adler and Baima Bollone who analyzed the blood from the Shroud independently from each other.\nWhen people don’t want to see the truth…\n\n","date":"October 31, 2013 at 10:47 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49329","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Note:  you seem to suggest that my quotation of Adler’s paper is full of mistake.  I have carefully reprinted the entire section of the paper he presented at the International Scientific Symposium of Turin in March 2000 and that we can found in his book about the Shroud.  There’s absolutely no mistake there.\n\n","date":"October 31, 2013 at 10:51 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49331","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"I’m sorry if I gave the impression that you were guilty of any misquotation, or that it was your conclusions with which I disagreed.Whether a person is a “true expert” depends on whether his work is justified, and in this case, I think it is not. I disagree with Adler’s conclusions, and I have explained why.  I’m not sufficiently familiar with Baima Bollone’s work to be able to comment on it, so I haven’t.\n\n","date":"October 31, 2013 at 11:05 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49333","author":"Hugh Farey","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"And for you, what the composition of the Shroud’s “bloodstains” then?  Just curious…\nSorry, but I don’t have followed this blog very much until the last few days.  I’m not familiar with your conclusions.\nLast thing: The independent confirmation of Adler’s conclusions by Baima Bollone should be enough for you to consider a serious revision of your own conclusion on this subject…\n\n","date":"October 31, 2013 at 11:27 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49336","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"\nHugh Farey :\nI’m sorry if I gave the impression that you were guilty of any misquotation, or that it was your conclusions with which I disagreed.Whether a person is a “true expert” depends on whether his work is justified, and in this case, I think it is not. I disagree with Adler’s conclusions, and I have explained why.  I’m not sufficiently familiar with Baima Bollone’s work to be able to comment on it, so I haven’t.\n\nYes, “true expert” is not a term that has any place in detailed scientific discussion. Nor should it be deployed on an internet forum in an attempt to close down debate, it being the quality of the evidence that matters. I could say more on the subject of STURP and blood, and have done so in the past, but this posting is about the image-receptive layer of linen. Blood can wait for another day.\nI checked Google as suggested. Hugh, but see no pictures at the individual fibre level, so no nodes either. \nSorry for the terseness. I’m using someone else’s laptop, and must now close.\n\n","date":"October 31, 2013 at 11:24 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49334","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"“Blood can wait for another day.”\nBut one day, you will have to address this topic and you will have a great difficulty to make believe that a forger could have produced the Shroud image with anything else than a real crucified corpse.\n\n","date":"October 31, 2013 at 11:29 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49337","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"People around here plays with words in an incredible way!  To me, a true expert in one particular field is someone who is a professional in this field.  Nothing more, nothing less.  This doesn’t imply that this person cannot make some mistakes of course.\nIn the case of Adler, he was a true expert in blood because he was a profesionnal scientist who worked all his life in this domain.  So, he should knew what he was talking about when it comes to blood. Same thing for Fazio, Mandaglio and Rogers : there are all experts in the field of radiation (unlike Fanti by the way), simply because these 3 scientists have worked all their life in the field of radiations.  So, because of that, they all knew radiations and their possible effects much better than the vast majority of Shroud researchers.\n\n","date":"October 31, 2013 at 11:38 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49339","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Well, fair enough. But please, right now, before you lose the enthusiasm, click on my link above, scroll down to Figure 2, look at the lines marked “Blood Glob,” “Clot Simulation,” and “Mineral Simulation” and say, aloud and in capital letters –\nThe simulacrum of a TRAUMATIC CLOT EXUDATE prepared from laboratory chemicals MATCHES THE BLOOD GLOB, but the simulacrum of a mineral pigment “blood” IS A COMPLETE MISMATCH.” Go on… have the courage of Alan Adler’s convictions…\n\n","date":"October 31, 2013 at 12:24 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49342","author":"Hugh Farey","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"And what do you make of all the data coming from both forensic and chemical investigation supporting the conclusion that the blood is real human blood from a highly traumatized person?\nYou cannot leave that aside.\nBy the way, can you please answer this simple question: for you, what is the most probable composition of the Shroud’s bloodstains ?  Medieval paint?\n\n","date":"October 31, 2013 at 1:05 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49343","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Na na na, no wriggling. Did you do it? Did you look at those spectra and say, in capital letters, that the blood spectrum MATCHES the simulated exudate, but IS A COMPLETE MISMATCH with the simulated pigment?\nAll right, all right. For what it’s worth I think most of the chemical tests do suggest the blood is, in fact, blood. I don’t think the evidence about the sort of blood is conclusive, and it is not obvious that it leaked from a dead body, but it does seem to be, mostly, blood.\n\n","date":"October 31, 2013 at 2:45 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49348","author":"Hugh Farey","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"\nHugh Farey :\nAll right, all right. For what it’s worth I think most of the chemical tests do suggest the blood is, in fact, blood. I don’t think the evidence about the sort of blood is conclusive, and it is not obvious that it leaked from a dead body, but it does seem to be, mostly, blood.\n\nI believe Colin would concur with that (he’ll correct me if I’m wrong), which is why he came up with the leech theory. The weight of evidence suggests blood, blood, blood. The question is what is the source of the blood? The weight of evidence is less discernible here.\n\n","date":"October 31, 2013 at 2:54 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49349","author":"David Goulet","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"I completely disagree.  Almost every forensic experts agree to say that the bloodstains match perfectly the body image on the cloth.  And the FACT that there are serum stains around most bloodstains, along with the form of most bloodstains (thicker at their borders) is a confirmation that Barbet was correct regarding the kind of transfer (exudates of blood clots), which match perfectly with the gospel accounts in the sense that it is highly probable that the body didn’t reached the tomb very soon after death because 1- Jesus died before the others and 2- Joseph had to ask permission to remove the body and bury it and 3- This burial was totally unprepared.  For all these reasons, it is highly probable that most if not every bloodstains (except the post-mortem blood that could have been released by the open wounds during the transfer of the body to the tomb and after the enshrouding) had enough time to clot to a certain level before they came in contact with the cloth.  \nAnd seriously, if the blood on the Shroud would come from anything else than the crucified body who left an imprint on the cloth, why in the world would there’s be a level of bilirubin much higher in that blood?  Seriously, we have no good reason to doubt Adler’s conclusion, which, again, we’re independently confirmed (for the most part) by Baima Bollone.  Also, the fact that these conclusions confirms the majority of the hypotheses proposed by Barbet in the 1930s is another important fact to keep in mind, which also suggest that Adler and Baima Bollone’s conclusions are correct.\n\n","date":"October 31, 2013 at 3:41 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49355","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Last comment from me: in every other field of science, the conclusions of Adler and Baima Bollone for the blood (i.e. that the blood is real human blood and that it came from an highly traumatized person) and the conclusions of Rogers, Fazio and Mandaglio for the image (i.e. that no energetic radiation that we know could have formed the kind of superficial AND discontinuous image we see on the Shroud) would have been acknowledge for a long time. But of course, in the Shroud world, those who don’t want the Shroud to be authentic will ALWAYS put in doubt the first conclusion (i.e. the one concerning the bloodstains) and those who don’t want the image to have been formed naturally (i.e. the supernatural fanatics) will ALWAYS put in doubt the second conclusion (i.e. the one concerning the image formation).\n\n","date":"October 31, 2013 at 3:47 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49356","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"I should add that there is another group who don’t want the image to have been formed naturally and it’s the gang (Colin is one of the primary member of that group) who still believe (I still don’t understand how someone can still believe this) the image is the product of a man made forgery.\n\n","date":"October 31, 2013 at 3:49 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49357","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Thanks for trashing this thread with your fanaticism, your obsessions. In fact, I responded to your claims as long ago as July 2012 (see below), but decided to keep quiet about that, given the posting was about image formation, NOT about Adler and his theories re blood. I did not wish to encourage you in your renewed attempt to shut down debate. That is still my position, so do not expect any further response here from me.\nhttp://shroudofturinwithoutallthehype.wordpress.com/2012/07/20/no-dear-yannick-adler-and-heller-did-not-prove-it-was-real-blood-on-the-shroud-of-turin-even-if-some-real-blood-is-now-present/\n\n","date":"October 31, 2013 at 4:08 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49361","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"I have read this and, seriously, this is not worthy of a scientist.  Disregarding the strongest fact about the Shroud (independently confirmed by Baima Bollone I remind you again) is ludicrous and prove that you don’t want to see the reality in face.  If you want so much the Shroud image to have been created by a forger, I really think you only got one credible (even though it is not probable) scenario left to you:  a “natural” forgery involving the use of a real crucified body in order to create false bloody stigmata of Christ on a real shroud and maybe also in order to create the body image we see, even thought it’s far from being evident that such a forger would have been aware that a body image would have come out of his project.\n\n","date":"October 31, 2013 at 4:48 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49364","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"It’s important to keep one thing in mind, Phantom, and that an earmark of scientific proof is that the results can be replicated. I could come out tomorrow and deny Newton’s theories about gravity but some quick repeats of various experiments would squash my doubts. The problem with the Shroud is that we have very limited experimental evidence, done by a relative handful of scientists. This Shroud is not as accessible as gravity.\nIf Colin, or anyone else, wants to doubt the scientists you mentioned that is his prerogative. We can’t claim those earlier experiments/observations were definitive because not everyone has access to the same materials to repeat the experiments. Fresh data would certainly help.\nAs long as the evidence has not completely ruled out the forgery theory, Colin is doing science (and us) a favour by following that line of reason. It either opens up new insights, or closes off dead ends. You may think it is a complete waste of time but it is his time to waste.\n\n","date":"October 31, 2013 at 4:38 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49363","author":"David Goulet","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"You can believe what you want.  Once a new series of tests will confirm Adler and Baima Bollone’s conclusion for the blood and Rogers, Fazio and Mandaglio’s conclusion versus the image, then what?  I will tell you what will happen:  You will see again the same crap coming out of close-minded people like Berry and others who simply don’t want the Shroud to be the authentic burial cloth of Jesus of Nazareth and who don’t want the image to have been formed naturally. \nBecause those people will never accept the truth of the Shroud, they will still deny the most solid facts regarding the relic, no matter how solid those facts are.  This is the reality and that will never change.\nAnd if you don’t believe me, just consider the creationists in the US!  Those are the Colin Berrys and the Giulio Fantis of the evolution theory!\n\n","date":"October 31, 2013 at 4:52 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49366","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Thank you David – I could not have put it better myself. ;-)\nIt is not authenticity per se that is my chief concern (interesting though it is, but it’s just one of a number of enigmas that interest me – Stonehenge etc). It’s the claim of so many scientists – many of them not totally detached and objective – that scientific data – their data – support the case for authenticity. \nWhen Adler, struggling to account for an atypical porphyrin spectrum, posited a complex with bilirubin (“crucifixion trauma”) he abandoned his claim to scientific detachment. When Rogers wanted to account for a thin detachable image layer, and decided it was due to a 1st century starch coating, he too abandoned his claim to scientific detachment. Their role in STURP was to seek evidence for authenticity – not merrily to go assuming it as a basis for highly embroidered theory to explain away awkward or unexpected findings. Methinks things might have been very different had the National Academy of Sciences been invited to take on the task.\n\n","date":"October 31, 2013 at 5:12 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49367","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"It is the business of the scientist to attempt to falsify hypotheses, regardless of faith. I think of myself as a kind of Harry Houdini, who, you will remember, spent years of his life desperately trying to get in touch with his dead mother, and, instead, found himself unmasking fraud after fraud among mediums and spiritualists. I would so like the shroud to be genuine I am prepared to leave no stone unturned in the hope that one of them will eventually demonstrate that the shroud could not possibly be a 13th century creation. Sadly, I have found nothing that truly substantiates that hypothesis. So, Anonymous, I do not “want the image to have been created by a forger,” indeed, exactly the opposite, but these irregular and unsubstantiated claims about reflectance spectra and bilirubin, among many other claims, are wholly unpersuasive. You may, and God bless you, have no reason to doubt Adler’s conclusions, but I have given ample evidence to explain why others may not be able to accept them so readily.\n\n","date":"October 31, 2013 at 6:07 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49372","author":"Hugh Farey","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"\nAnonymous :\nYou will see again the same crap coming out of close-minded people like Berry and others who simply don’t want the Shroud to be the authentic burial cloth of Jesus of Nazareth and who don’t want the image to have been formed naturally. \nBecause those people will never accept the truth of the Shroud, they will still deny the most solid facts regarding the relic, no matter how solid those facts are. \nAnd if you don’t believe me, just consider the creationists in the US!  Those are the Colin Berrys and the Giulio Fantis of the evolution theory!\n\nCan’t handle a discussion of the science, attack the individual(s)…here we go again…\nAny scientist will concur that their own data is subject to further confirmation and extension, particularly with the benefit of hindsight and further advances in technology.  More dishonor is done to their previous efforts by such a skewed defense that oversimplifies findings, than an objective review/discussion of specifics that considers alternative possibilities-this is in earnest how science operates and moves forward.  Science deals in the progression of ideas and pushing the explanation even further, not by putting results in a china cabinet and making them off limits to further exploration or questioning\n\n","date":"October 31, 2013 at 6:28 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49374","author":"Kelly Kearse","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"All I know is this (and that will be my final word) : The blood expert of STURP who analyze the blood from the Shroud (Adler) tells me that it really come from exudates of traumatized blood clots, which is in total sync with what is seen in the body image and this conclusion has been fully confirmed by an independent expert from Italy named Baima Bollone. And the best radiation expert of STURP (Rogers) tells me that a burst of energetic radiation of any kind or a scorch is unable to produce all the characteristics of the body image on the Shroud mainly because such processes are releasing too much energy (in other words, they are too strong) and this conclusion has been fully confirmed by two independent experts in radiation from Italy named Fazio and Mandaglio (both nuclear physicists). I don’t know for you, but for me, having a brain that work all right and a pretty good judgment, when I hear such conclusions from true experts that were independently confirmed by other true experts, I have a strong tendency to LISTEN and to ACCEPT THEM. And once you do this, you have to come to this conclusion: The Shroud is a real burial shroud that has contain for less than 48 hours the tortured and crucified body of a man who look like the Jesus of the Gospel and in all logic, the body image on the cloth CANNOT have been caused by the hands of a forger, no more than any burst of radiation coming from the dead body (which is, by the way, scientifically impossible). In this context, anyone with a brain who accept these confirmed conclusions of true experts about the Shroud would come, like me, to this final conclusion: a natural and probably biological process (or a series of processes like that) related to an interaction between the dead body and the surface of the cloth must be responsible for the body image on the cloth!  That’s my line of thinking and if someone don’t want at all cost the Shroud to be the product of a forger or the by-product of the Resurrection of Christ, he will surely come to the same conclusion as mine. And you know what? No matter how solid the conclusions I described are and no matter if they become even more solid after another future round of direct tests on the cloth, I’m sure all the others will never accept them and will still do everything they can to make believe they are wrong (like reinterpreting falsely the professional FTIR analysis of Adler that confirmed the previous chemical and forensic conclusions that the bloodstains are really made of exudates of traumatized blood clots in order to back-up their preconceived ideas)!  That’s the sad reality of sindonology my friends!\n\n","date":"November 1, 2013 at 8:30 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49427","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Important additional note : All I said about accepting the conclusions of Adler versus the blood and the conclusions of Rogers that the body image cannot be the product of a scorch or of a burst of high-energetic radiation (conclusions that were all independently confirmed by other experts in the same scientific fields) doesn’t mean new tests and examination should not be done! On the contrary, such a new series of direct researches on the cloth is definately needed to confirm even more these previous conclusions, which I already consider to be very solid, especially because they were all confirmed by totally independent researchers who were also expert in the same scientific fields as Adler and Rogers.  And if someone disagree with all I said this morning, it’s ok.  It’s your liberty.  But if you really want to deny these solid conclusions, I really think you should ask yourself if it would be possible that one or two preconcieve ideas about the Shroud (like the idea that it MUST be directly related to the Resurrection of Christ or that it MUST be a false relic) could interferred in your reasoning…  Maybe by asking you the question honestly, you will start considering the solid conclusions I just described with a different perspective.  I don’t think we will see this happening soon but who knows?  And please ask yourself the question : What would be the problem if the Shroud was the real burial cloth of Jesus and if the image on it would be the product of a natural process related to his dead and crucified body?  WHAT WOULD BE THE PROBLEM?  Remember that this is the most probable conclusion we must come if we accept the solid conclusions I just described…\n\n","date":"November 1, 2013 at 8:53 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49429","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"I think that’s clear. Decide which side you’re on, collect the statements of the scientists who agree with you, accept them uncritically, ignore any evidence to the contrary, abuse those who present opposing evidence, and accept that that’s “the sad reality of sindonology my friends!”\nLuckily, there are some of us with a different approach. Keep an open mind, examine the statements of everybody with whatever views, respect the validity of evidence that cannot be falsified, have patience with those whose views have become polarised and intolerant, and make that “the happy reality of sindonology my friends!”\nBut don’t pay any attention to me, since I am not among those “having a brain that work all right and a pretty good judgment.”\n\n","date":"November 1, 2013 at 8:53 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49428","author":"Hugh Farey","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Bulls…  You only seek your own preconceive truth instead of, like me, accepting the most solid conclusions from true experts (which you are not obviously).  These conclusions I accept are not from me but from real experts in their fields and have been INDEPENDENTLY CONFIRMED by other true experts in the same fields.  But in the end, you think what you want Hugh.\n\n","date":"November 1, 2013 at 8:56 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49430","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"And by the way, it’s not a matter of « choosing your camp », it’s a matter of accepting the REALITY exposed by true experts in their fields.  Question : Why is it so hard for you to accept the reality?  Because this reality doesn’t fit with your preconcieve ideas?\n\n","date":"November 1, 2013 at 8:58 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49431","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"I was about to launch into a rant of my own here asking why there has to be so much animosity in these posts. But then I was struck by a passage from Scripture “So, because you are lukewarm, and neither hot nor cold, I will spit you out of my mouth.”  There is fire and ice here because the Shroud (and what it means for science, Christianity, history, etc) matters deeply to us for our own reasons. Though I wish there was bit more respect on display, it is indeed good to see that this is not a lukewarm forum.\n\n","date":"November 1, 2013 at 9:44 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49440","author":"David Goulet","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Message to Dan Porter: how about your placing a ban on the term “true expert(s)”?  Just look what the constant repetition of that essentially meaningless (dare one say mindless?) label has done to this thread.\n\n","date":"November 1, 2013 at 9:13 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49434","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Message to Colin Berry: Read this please: https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/#comment-49339\n\n","date":"November 1, 2013 at 9:31 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49437","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Based on this comment of mine, you’re probably a true expert in your field…  BUT…  That doesn’t mean your interpretation of the data is good.  By the way, Rogers’ main conclusions versus the nature (natural nature) of the body image were independently confirmed by 2 others true experts in the field of radiation.  And you?  Can you tell me another true expert who work in the same field as you who have been able to independently confirmed your own conclusions?\n\n","date":"November 1, 2013 at 9:35 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49438","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"I can’t help myself.  I need to say this truth : After years of following what’s going on in sindonology, I was struck (and a bit disgusted) by the fact that most present researchers are trying to explain the body image while following the exact paths (i.e. the « supernatural » path related to a burst of high-energetic radiation or the « forgery » path) the true experts about the Shroud told us not to follow!  Effectively, who, in the present day, is trying hard to test natural hypotheses for image formation in laboratory? Not a bunch unfortunatelly!  Nevertheless, it is precisely in that exact direction that the experts are telling us to search…  In such a bad context, I think it’s easy to understand why nobody to this day has been able to reproduce an image on linen with all the characteristics of the Shroud image!  If things don’t change, this reality will stay unchanged I’m affraid…\n\n","date":"November 1, 2013 at 9:30 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49436","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Now we are back discussing image formation, this seems as good a moment as any to announce something I discovered earlier today from looking at a pdf accessible on this site.\nIt’s from Thibault Heimburger MD, and displays photomicrographs from the Mark Evans collection. Previously I had assumed that they were not of sufficiently high magnification to show the nodes on linen fibre, which is true. But if those nodes become pigmented for whatever reason, the sites of those nodes show up as banding, with relatively white/transparent areas in between.\nOne such Mark Evans picture shows up precisely that kind of banding on a Shroud image thread. That makes the pigmentation consistent with what I see in my model systems, using scorching/pigmentation by direct contact with heated solid, and thus consistent with medieval fabrication. However it is not, repeat NOT consistent with the Rogers’ impurity coating hypothesis, unless one tries, late in the day, to build in qualifying assumptions about starch sticking preferably to the nodal regions. (Reminder: scientists, whether regarded as “true experts” or not, do not care much for qualifying assumptions, certainly not defensive ones).\nI’ll post some enlarged/cropped pictures from that Evans archive later today on my own site, which Dan Porter is free to post here if he so desires (see my latest posting).\n\n","date":"November 1, 2013 at 9:54 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49443","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"“and thus consistent with medieval fabrication” — should edit this to say ‘and thus is consistent with medieval technology’. How can it be consistent with medieval fabrication if we do not have other examples of such fabrication?\n\n","date":"November 1, 2013 at 10:34 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49445","author":"David Goulet","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Instead of seriously considering Colin’s fantasy David, I think it would be much better for your understanding of the Shroud’s REALITY to focus on the very important conclusions of the experts named Adler and Rogers (again, which were all independently confirmed by other experts in the same fields) I brought you in my previous comments.\nI don’t know what was exactly the real natural process that lead to the formation of the body image but I know one thing: it was a natural process (or processes) and this was most probably directly related to some mild energy (heat, post-mortem gases, other molecules like lactic acid, etc.) that was (or were) released by the corpse of the Shroud man.  If you listen carefully what the true experts who analyzed the blood and the image on the Shroud had to say, that’s the conclusion you should reach.  As Fazio and Mandaglio once wrote in one of their papers, the only “mystery” that remains regarding the Shroud image is to define what really was the true nature of the natural phenomenon that produced this image.  And as they said, it will be very hard to find this because of the complexity of such natural phenomenons and because they don’t have a tendency to leave an evident “signature”.\n\n","date":"November 1, 2013 at 10:49 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49449","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"I think we all agree that the Shroud is a one-off, David, but that should not prevent us from speculating as to how the image was formed, either in a 1st century tomb or a 14th.century workshop. If the latter, then it could have been made by thermal imprinting from some kind of hot solid template (or powder frottage as per Luigi Garlaschelli). Selective pigmentation at the nodes fits the later model, and so far I’m merely content to refer to ‘consistency’. You may need to wait longer for proof (possibly not my lifetime!).\nI’ve posted the first of the promised Mark Evans enlargements to my own site.\n\n","date":"November 1, 2013 at 10:51 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49450","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Colin,\nGlad to read you again on this blog.\nYou wrote:\n” It’s from Thibault Heimburger MD, and displays photomicrographs from the Mark Evans collection. Previously I had assumed that they were not of sufficiently high magnification to show the nodes on linen fibre, which is true. But if those nodes become pigmented for whatever reason, the sites of those nodes show up as banding, with relatively white/transparent areas in between.\nOne such Mark Evans picture shows up precisely that kind of banding on a Shroud image thread.” \nLooking forward to your “enlarged/cropped pictures” from Evans collection.\nI just wish to recall that a fiber is not a thread and a thread is not a fabric.\nMy comments will follow tomorrow.\n\n","date":"November 1, 2013 at 5:14 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49478","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Nice to hear from you Thibault.  All my comments re nodes etc refer to individual fibres needless to say.\nI have posted a magnified view of fibres from the first of your Mark Evans photographs of Shroud image areas which show interrupted  (“spotty”) pigmentation, and it is tempting to suppose that represents a concentration of dehydrated carbohydrate in and around the nodes, but I can’t be certain.  It may even by inter-nodal. What amazes me is that we don’t appear to have images of Shroud fibres taken under a simple microscope at sufficient magnification and resolution to show the nodes clearly. Why is that do you suppose? Maybe you have access to some that have so far evaded my image searches and can tell us if it’s the nodes or inter-nodal regions that have the yellow/tan coloration.\nA bientôt.\n\n","date":"November 1, 2013 at 5:43 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49483","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"“Effectively, who, in the present day, is trying hard to test natural hypotheses for image formation in laboratory? Not a bunch unfortunately!”\nWell, I agree I’m not a bunch, but I’ve been soaking linen in various things in an attempt to replicate Rogers’s evaporation gradients, and also mixing ammonia, urea and even myrrh in various proportions in an attempt to produce discolouration. Just now I’ve been getting some fascinating ideas from madder root…\n\n","date":"November 1, 2013 at 10:41 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49448","author":"Hugh Farey","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"Am pleased to hear that St.Raymond has left a representative on Earth to keep his ideas alive, Hugh. Science would probably make little progress without opposing viewpoints. (Shame that some folk here don’t seem to appreciate that).\n\n","date":"November 1, 2013 at 11:04 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49451","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"\ncolinsberry :\nI think we all agree that the Shroud is a one-off, David, but that should not prevent us from speculating as to how the image was formed, either in a 1st century tomb or a 14th.century workshop. If the latter, then it could have been made by thermal imprinting from some kind of hot solid template (or powder frottage as per Luigi Garlaschelli). Selective pigmentation at the nodes fits the later model, and so far I’m merely content to refer to ‘consistency’. You may need to wait longer for proof (possibly not my lifetime!).\nI’ve posted the first of the promised Mark Evans enlargements to my own site.\n\nAgreed. But precision in wording is as important as in experimentation. ;)\n\n","date":"November 1, 2013 at 11:07 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49452","author":"David Goulet","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"OK, guilty as charged. David.  But how many experimentalists do you know who report their results in real time, and have to attend to domestic chores at the same time (“Yes dear, I’ll be there in a minute…”)?\n\n","date":"November 1, 2013 at 11:11 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49453","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"True. Charges dismissed. :)\n\n","date":"November 1, 2013 at 11:21 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49455","author":"David Goulet","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"\nAnonymous :\nInstead of seriously considering Colin’s fantasy David, I think it would be much better for your understanding of the Shroud’s REALITY to focus on the very important conclusions of the experts named Adler and Rogers\n\nThe wise man has more to learn from the fool than the fool from the wise man. Now I’m not saying Colin is a fool, nor you. Nor am I a wise man. But the heart of this saying is that the wise man can learn even from something that on the surface seems ‘fantasy’. Why, because the wise man has the ability to discern, to put things in perspective and context. He finds nuggets of Truth amongst a load of B.S. \nHere’s a thought experiment, if Rogers (or others of these scientists) was still alive and reading this blog, do you think he would discount Colin’s experiments or theories? Or would he take up the challenge, go back to his instruments to see if Colin was right or if he was talking through his rear end? I believe Rogers would have taken up the challenge as he did with the invisible weave theory – which also must have sounded like fantasy.\nWith an enigma like the Shroud nothing should be thrown off the table. Nothing! That is bad science and it is even worse theology.\n\n","date":"November 1, 2013 at 11:20 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49454","author":"David Goulet","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"“do you think he would discount Colin’s experiments or theories?”\nOF COURSE!!!  Read this paper please: http://shroudnm.com/docs/2013-01-10-Yannick-Cl%C3%A9ment-Reflections-on-Ray-Rogers-Shroud-Work.pdf\nAnd especially all the quotes concerning the FACT that the Shroud image is NOT a scorch.  Why Rogers would lose one minute (if he was here today) testing something he has already tested and anlayzed carefully and came out convinced it was NOT consistent with all the known characteristics of the image?  All the quotes in the paper above are there to prove my point!\nAnd by the way, I think you should read again this other good paper: http://www.shroud.com/pdfs/n76part5.pdf\nYou’ll see that the evidence coming from the bloodstains ALONE are enough to discard any man made forgery (at least, if you use your judgment correctly).  Why is it so?  Read again this previous comment of mine: https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/#comment-49196\nYou’ll see that once you accept the fact that the bloodstains on the Shroud really came from a crucified man (most certainly the same as we see the image on the cloth), then any kind of man made forgery scenario become ludicrous!!!!\nFinally, I think you should always keep in mind this truth:  Rogers’ most important conclusion versus the image (which was indepedently confirmed later on by true experts in radiation named Fazio and Mandaglio) is this one (at least, to me): he was categorical on one point: the Shroud image, with all its very particular characteristics (especially the discontinuous distribution of colored fiber in the image area and the extreme superficiality of the colored fibers), cannot be the result of any kind of high-energetic radiation, nor of a scorch.  Now, you’re free to believe the claims made by others, but personally, I have no reason to doubt this expert conclusion, especially because it has been, since, completely backed-up by 2 other experts in radiation who have studied the Shroud image carefully for at least a decade now.\n\n","date":"November 1, 2013 at 3:46 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49472","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"I’ve read those papers/comments before. They are excellent. I assume Colin has too. But what I was supposing was if someone challenged Roger’s conclusions, introducing a new theory with some experimentation behind it (like Colin’s recent one) I don’t  believe Rogers would have dismissed it out of hand. He would have looked at its merits and if he felt it might have some validity he would have investigated further. I think this because I believe Rogers was a sincere scientist.\nFor the record, I’m not convinced by the scorch theory. But there’s been many things in my life I was initially unconvinced by, only to be later surprised. I am more cautious now where I place my exclamation points. Something the 1988 C-14 team might also feel today?\n\n","date":"November 1, 2013 at 4:24 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49473","author":"David Goulet","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"I have just one advice to you David since it’s evident that you have no preconceive ideas about the Shroud and that you only seek truth regarding this relic:  Try to always keep in mind the whole picture of the Shroud even when you will look a some tiny détails.  And this whole picture tells you that the Shroud is not a man made forgery (the only forgery it can be would be through the use of a real crucified corpse that would have beared all the stigmata of Jesus), nor the product of a high-energetic radiation.  Those “theories” simply do not fit with the whole picture given by the data collected by STURP and some other reliable researchers.  We must look elsewhere for a proper answer and this “elsewhere” MUST be related with a natural phenomenon most probably in direct link with the biological state of the Shroud man’s corpse during the time he was enveloped into that cloth (no more than 48 hours).  I’m affraid there is no other viable road to follow if someone really want to find truth regarding the image formation.  Rogers knew this and he was one of the first to really try some lab testings to check out his Maillard reaction and the truth his this:  HE SUCCEED to reproduce the kind of coloration we see in the image area on the Shroud with a linen sample prepared the old fashion way and some release of ammoniac gas, which is truly interesting (see his book for details). Of course, he did not succeed to reproduce an image with all the characteristics of the Shroud but this was a great  step in the right direction.  Other researchers should follow Rogers’ footsteps and verify his ideas about the image formation more deeply.  If someone would do this properly, I think we could have some nice (at least to some people) surprise!  Note: One thing I wonder about the result of coloration obtained by Rogers is if his colored sample made of linen was showing a discontinous distribution in the colored area. There’s nothing about this important aspect of the question in his book…  But since Rogers presented this result as being a good match with the image area on the Shroud, I have to guess it was the case.  Anyway, I would love to learn the real truth about that.\n\n","date":"November 1, 2013 at 4:43 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49476","author":"Anonymous","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"\nDavid Goulet :\nTrue. Charges dismissed. :)\n\nButch Cassidy: “Oh, good. For a moment there I thought we were in trouble.”\n\n","date":"November 1, 2013 at 11:25 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49456","author":"colinsberry","site":"shroudstory"},{"title":"Of those big-meaning words: Superficial, half-tone and striated","post":"“Rogers knew this and he was one of the first to really try some lab testings to check out his Maillard reaction”\nShame he never compared the nitrogen content of image v non-image regions (it should be higher for a Maillard-reaction image than for a simple thermal discoloration).Shame too that he never compared the reducing sugar content for image v non-image areas (it should be higher for non-imaged areas not exposed to amines). Shame too that his model experiments substituted dextroses for starch, conveniently providing the aldehyde reducing sugar end groups that are lacking in starch.\nThere’s also the small matter that while the STURP summary never used the term “scorch” it did indicate that the discoloration was one that closely resembles that of carbohydrate dehydration brought about by heat or acid, with not so much as a passing nod to Maillard chemistry.  So one has to be very careful before book-ending STURP and Raymond Rogers when discussing mechanisms of image formation.Rogers went out on a limb – and he did so by taking a first century provenance as his working hypothesis.So when the radiocarbon dating came along, the proper response surely would have been to insist on a more representative range of samples, instead of incriminating the one that was taken. There was the retained strip, after all. Why not check that, sq cm by sq cm, to look for any signs of reweaving with more modern material.\nAs some will have gathered, Raymond Rogers RIP was never my favourite scientist despite his flair for analytical chemistry. I did not care for his modus operandi. post 1988 especially, when it began to lack strict scientific detachment and objectivity. It became a narrative in search of evidence, when it should have been evidence in search of a narrative.\nIn passing, I’m having second thoughts about nodes and amorphous cellulose. It seemed a good idea at the time, but that’s science bizz for you (dissolving perspectives, egg-on-face). I blame it on that book I was given (“101 Ways To Avoid Becoming An Accountant”)\n\n","date":"November 2, 2013 at 3:12 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","id":"comment-49529","author":"colinsberry","site":"shroudstory"}]
