[{"title":"Okay, maybe I shouldn’t have used the word ‘Significant’","post":"Because Colin is a Brit (British with affection and respect, too bad about Yorktown) I choose to paraphrase Winston Churchill (the Brit, not the American historian) on Allied Victories n North Africa in WWII): STURP was not the end of the Scientific study of the Shroud, it wasn’t even the beginning of the end, it   was the beginning of new era of Shroud research.\nI think we can all agree that Shroud science began with the Pia photographs. That first  published scientific study of the Shroud was Paul Vignon’s 1902 book on the Shroud that was translated into English. I think it is fair to say, that it culminated in STURP’s 120 hours of scientific examination of the Shroud in Turin in 1978.\nThe scientific tests used by the Shroud team and by scientists in  the aftermath (cf Heller and Adler) were in  fact based on  the advances of quantum mechanics. For example, that certain aspects of the Shroud  are fluorescent when bombarded by certain wave lengths of light that the object being bombarded discharges light of a certain wave length. The image itself is not fluorescent.\nHeller and Adler used an early microscopic digital image analyzer. It was, if you  were read their work, a  very exacting process, dependent on the use of tiny portions taken from the Shroud. There work occurred in  the  US on samples of Shroud fibriles taken during the 120 hours. Today, digital-spectral imaging cameras can  examine an artifact and if   carefully controlled is absolutely non-intrusive. \nA  French firm was able to use one  in the Louvre and unlock the original appearance of the Mona Lisa. An explanation of how they did it and the results can be found on t their web site: http://www.lumiere-technology.com/\nUnlike WWII, Scientific study of the Shroud will never end. So maybe it is better to think of STURP as not the end, the beginning of a new era.\nTo look back 36 years at STURP  and carp about  what they were able to do in it’s remarkable 120 hours is well, as the Brit’s would say “a bit much.” What they accomploshed was ground breaking. \nIt was clearly the beginning not of the end but a new ea which, hopefully will end only when humanity does. And then again, according to science that may be sooner, rather than later.\n“\n\n","date":"July 31, 2014 at 7:12 am","url":"https://shroudstory.com/2014/07/31/okay-maybe-i-shouldnt-have-used-the-word-significant/","cat":"image_theory","id":"comment-141418","author":"John Klotz","site":"shroudstory"},{"title":"Okay, maybe I shouldn’t have used the word ‘Significant’","post":"A significant comment.\n\n","date":"July 31, 2014 at 7:22 am","url":"https://shroudstory.com/2014/07/31/okay-maybe-i-shouldnt-have-used-the-word-significant/","cat":"image_theory","id":"comment-141424","author":"Paulette","site":"shroudstory"},{"title":"Okay, maybe I shouldn’t have used the word ‘Significant’","post":"John, I agree with all you said, but I think what really stimulated/catalyzed the formation of STURP was the VP8 image analysis performed by Jumper/Jackson/Schumacher.\n\n","date":"July 31, 2014 at 7:38 am","url":"https://shroudstory.com/2014/07/31/okay-maybe-i-shouldnt-have-used-the-word-significant/","cat":"image_theory","id":"comment-141428","author":"Mike M","site":"shroudstory"},{"title":"Okay, maybe I shouldn’t have used the word ‘Significant’","post":"PS, I am in perfect accord with Colin’s basic point: that it’s time for a new “STURP” team study of the Shroud,\n\n","date":"July 31, 2014 at 7:15 am","url":"https://shroudstory.com/2014/07/31/okay-maybe-i-shouldnt-have-used-the-word-significant/","cat":"image_theory","id":"comment-141419","author":"John Klotz","site":"shroudstory"},{"title":"Okay, maybe I shouldn’t have used the word ‘Significant’","post":"There is a very simple reason why the Shroud image is analogous to a photographic negative with left-right reversal and it does not require an exclusively contact theory to achieve it.  Because of the disposition of the imaged object and the cloth, the Shroud has acted essentially as a mirror.  It is certainly easier to realise this in a contact process analogy, but the same image reversal would occur even with action at a distance, as indeed occurs with a mirror. \nI was able to give a simple demonstration of this property to a small audience last March, using the simple props of a towel, some cut-out patterns of red cloth emulating blood-stains and some velcro spots attached to the towel.  Positioning the “stains” in the appropriate places on my body and attaching them to the towel, it became clear that everything became reversed. \nColin has made the further point that the strongest imaging is likely to occur for body areas closest to the cloth, while more distant areas will not be imaged so readily, hence we also obtain the light-dark reversal as well. \nThe notion that the image is caused by sweat is very ancient.  It is contained or implied in various versions of the Abgar legend, and the Catholic Encyclopedia in commenting on the Veronica legend acknowledges that the Abgar story is likely the source of the Veronica story.  It would seem that legends attached to the Image of Edessa were projected onto its various copies so it seems there was no shortage of images said to be “made not by human hands”.  The notion that sweat caused the image is echoed in the record of the viewing of the Mandylion by Constantine Porphyrogennetos and the Lecapeni.  It also seems to have been the impression of St Francis de Sales concerning the Shroud image as quoted above.  \nThe notion that sweat caused the TS image was even postulated by Paul Vignon in his earliest theories, although he later discarded it.  We see some echo of it in Ray Rogers’ imaging experiments with ammonia and even in his Maillard hypothesis.  \nAfter all this, what else might be said about the negativity of the image.  Perhaps not a great deal.  The imaging simulations by Jumper and Jackson persuaded them to assert that the imaging could occur up to a distance of perhaps 4 cm from the cloth, and they obtained some impressive 3-D impressions as a result.  The light-dark reversal would still occur, but would be graduated rather than either / or, that is a one or a zero.  A contact process is not an essential process for the negativity property.\n\n","date":"July 31, 2014 at 7:22 am","url":"https://shroudstory.com/2014/07/31/okay-maybe-i-shouldnt-have-used-the-word-significant/","cat":"image_theory","id":"comment-141423","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Okay, maybe I shouldn’t have used the word ‘Significant’","post":"And that too is a significant comment.\n\n","date":"July 31, 2014 at 7:30 am","url":"https://shroudstory.com/2014/07/31/okay-maybe-i-shouldnt-have-used-the-word-significant/","cat":"image_theory","id":"comment-141426","author":"Paulette","site":"shroudstory"},{"title":"Okay, maybe I shouldn’t have used the word ‘Significant’","post":"STURP’s analysis has indicated that the image was not produced by contact with a liquid  (the image is very superficial, discolouring the top 2-3 microfibriles at most) also the image formation mechanism was not a contact process since the image is visible where there is no contact, and not visible in some areas where there should’ve been contact. These two observations stand against a sweat imprint. Nonetheless, it wasn’t even ignored by STURP members, Rogers, promoter an image by Maillard reaction who’s is basically a sweat imprint. There is nothing new here!\n\n","date":"July 31, 2014 at 7:51 am","url":"https://shroudstory.com/2014/07/31/okay-maybe-i-shouldnt-have-used-the-word-significant/","cat":"image_theory","id":"comment-141430","author":"Mike M","site":"shroudstory"},{"title":"Okay, maybe I shouldn’t have used the word ‘Significant’","post":"“Even the common French description of the Shroud as the “Suaire” (“face cloth”)  instead of a “linceul”.”\nThis is a recurrent theme from Colin…\nGuess what: a “suaire” is a “linceul” in French, both terms are usually used to describe the Shroud.\nhttp://www.littre.org/definition/suaire.\n\n","date":"July 31, 2014 at 1:18 pm","url":"https://shroudstory.com/2014/07/31/okay-maybe-i-shouldnt-have-used-the-word-significant/","cat":"image_theory","id":"comment-141478","author":"anoxie","site":"shroudstory"}]
