[{"title":"Irene Corgiat’s Shroud of Turin Image","post":"Once more Da Vinci conspiracy theories about Shroud image production are resurrected, this time not by a kind of protophotography technique but by «pyrography».\nMy husband’s new upcoming book about the Shroud does focus on this issue and the reader will understand why such claims are just preposterous.\nLet’s unveil what he wrote on this subject.\nAs Dr. Barrie Schwortz pointed out back in 2003, areas of scorched linen fluoresce under U.V. light exposition and Shroud image does not fluoresce under such condition, and besides Irene Corgiat’s scorch image has not encoded 3D data like the Shroud and doesn’t deal with blood stains problem either.\nIf a microscopic observation would be done on fibers from this scorched image surely the crystalline pattern of cellulose molecules organization would be altered to an amorphous one, which does not happen with Shroud image fibers and colored fibers would not be found side by side with uncolored ones.\nThe Shroud Image is unique and as Professor Alan Adler once stated «Leonardo can rest in his grave»\n                          Best regards\n                        Maria da Glória\n                  Centro Português de Sindonologia\n\n","date":"March 12, 2012 at 6:46 am","url":"https://shroudstory.com/2012/03/12/irene-corgiats-shroud-of-turin-image/","cat":"image_theory","id":"comment-9241","author":"Maria da Glória Gonçalves Barroso","site":"shroudstory"},{"title":"Irene Corgiat’s Shroud of Turin Image","post":"Still more promoting of 20th century science, much of it cursory, impressionistic and frankly  second-rate, much of it from self-appointed “experts” in “Sindonology” (a pretentious term if ever there was).  Are there any real scientists at the Centro Português de Sindonologia doing original research, instead of parroting the same old mantras, blithely ignoring – or ignorant of – any and all counter-arguments?\nIt would help if Maria da Glória were to enlist the aid of some real scientists at her Institute, assuming there are any, to evaluate and comment on their and others’  ‘trump card’  namely the highly questionable fluorescence issue. \nThey could start by defining the precise chemical structures of the fluorochromes in linen scorched under different experimental conditions, the likelihood or otherwise of those fluorochromes being of sufficient chemical stability to go on fluorescing over centuries of exposure to air, light, smoke and other pollutants etc etc. \nYes, I know the 1532 scorch marks still fluoresce, but they are supposed to have been produced in a closed reliquary under conditions of limited oxygen having been exposed to an intense fire generating temperatures (we are told) high enough to melt silver (962 degrees Celsius). The 1532 scorching could involve entirely different pathways of pyrolysis, with different end products. One cannot equate aerobic and non-aerobic pyrolysis, or low and high temperature pyrolysis. I know from my own research that the faintest of scorches can be bleached with 6% hydrogen peroxide, whereas more intense ones cannot, implying a sequence of chemical events at the molecular level, not a single simplistic either/or response.\nMore science please, and less parroting of tired old mantras.\n\n","date":"March 12, 2012 at 8:08 am","url":"https://shroudstory.com/2012/03/12/irene-corgiats-shroud-of-turin-image/","cat":"image_theory","id":"comment-9243","author":"colinsberry","site":"shroudstory"},{"title":"Irene Corgiat’s Shroud of Turin Image","post":"Less dictating and talking at people and more independent review of your claims, please.\n\n","date":"March 12, 2012 at 9:55 am","url":"https://shroudstory.com/2012/03/12/irene-corgiats-shroud-of-turin-image/","cat":"image_theory","id":"comment-9250","author":"Chris","site":"shroudstory"},{"title":"Irene Corgiat’s Shroud of Turin Image","post":"Collin,\nI do agree with you, the Turin Shroud image doesn’t involve any supernatural image formation process. It is to be more seriously studied/researched in conjunction with (at least) one possible heating source.\nHowever, how long do you SERIOUSLY think Irene Corgiat’s pyrographic (or even any of your own much awaited “kausonographic”) pseudo Shroud face Image could fool any  medical examiner who would professionally proceed to its “autopsy?\n\n","date":"March 12, 2012 at 9:07 am","url":"https://shroudstory.com/2012/03/12/irene-corgiats-shroud-of-turin-image/","cat":"image_theory","id":"comment-9247","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Irene Corgiat’s Shroud of Turin Image","post":"Corrections: “could fool any medical examiner that would professionally proceed with is “autopsy”?”\n\n","date":"March 12, 2012 at 9:45 am","url":"https://shroudstory.com/2012/03/12/irene-corgiats-shroud-of-turin-image/","cat":"image_theory","id":"comment-9249","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Irene Corgiat’s Shroud of Turin Image","post":"That is the question…\n\n","date":"March 12, 2012 at 9:11 am","url":"https://shroudstory.com/2012/03/12/irene-corgiats-shroud-of-turin-image/","cat":"image_theory","id":"comment-9248","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Irene Corgiat’s Shroud of Turin Image","post":"My advice to any hospital pathologist minded to base an autopsy on a faint image on linen, centuries old, of unknown provenance, would be to get a CT scan done as soon as possible on his own cranium. He should not be surprised to learn there is a large fluid-filled cavity in his brain where previously there was grey matter…\n\n","date":"March 12, 2012 at 12:13 pm","url":"https://shroudstory.com/2012/03/12/irene-corgiats-shroud-of-turin-image/","cat":"image_theory","id":"comment-9254","author":"colinsberry","site":"shroudstory"},{"title":"Irene Corgiat’s Shroud of Turin Image","post":"This is actually funny.\n\n","date":"March 12, 2012 at 5:27 pm","url":"https://shroudstory.com/2012/03/12/irene-corgiats-shroud-of-turin-image/","cat":"image_theory","id":"comment-9267","author":"Dan","site":"shroudstory"},{"title":"Irene Corgiat’s Shroud of Turin Image","post":"By means of his thermostenciling technique, could then Mr Scorchscientist for Easter, lightly bake/cook us a couple of mummified skeletons in the manner of the Turin Shroud so that we can check if they can stand TOO the double test of a medical examination and blood pattern analysis? \nMy advice to any kitchen scorchscientist minded to reproduce such a faint image on linen, centuries old whether of known or unknown provenance, would be to get a mummy toaster as soon as possible. He should not be surprised to learn there is none currently available on the market\n\n","date":"March 12, 2012 at 8:01 pm","url":"https://shroudstory.com/2012/03/12/irene-corgiats-shroud-of-turin-image/","cat":"image_theory","id":"comment-9269","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Irene Corgiat’s Shroud of Turin Image","post":"The moral is, no matter how light/dark a kitchen scorchscientist’s matter may be, what matters here is substance.\n\n","date":"March 13, 2012 at 5:45 am","url":"https://shroudstory.com/2012/03/12/irene-corgiats-shroud-of-turin-image/","cat":"image_theory","id":"comment-9272","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Irene Corgiat’s Shroud of Turin Image","post":"Correction: The moral is, no matter how light/dark a kitchen scorchscientist’s grey matter may be, what matters here is substance.\n\n","date":"March 13, 2012 at 5:47 am","url":"https://shroudstory.com/2012/03/12/irene-corgiats-shroud-of-turin-image/","cat":"image_theory","id":"comment-9273","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Irene Corgiat’s Shroud of Turin Image","post":"I’m not a scientist and neither is my husband who is a medical doctor but there are some members of Centro Português de Sindonoogia from several fields of science who agree with scientific information conveyed by S.T.U.R.P. investigators and others.\nWhen it comes to the Shroud, real scientific information is gotten mainly from those who had access to direct study of the Shroud and gathered samples for off-site studies and later published their findings on peer reviewed scientific journals.\nS.T.U.R.P. studies, Professor Raymond Rogers and Professor Adler’s studies are considered crap by Dr.Colinsberry, to him only does matter his own opinion, and that’s truly outrageous to honest Shroud scholars.\nShroud science should be based on facts and not guesses.\nThe late Dr. Walter McCrone is on the skeptic side but nevertheless his conclusions disagree from Dr. Colinsberry claims of the image on the Shroud being a scorch.\nDr. Colinsberry stated that scientific investigation should be done so here goes a challenge for him.\nDr. Colinsberry as a great scientist he claims to be should be able to reproduce by his scorch technique a life size image of the Shroud that would fit ALL characteristics and properties of the Shroud image namely optical, microscopical , physical and chemical and which would deal with the blood marks being impressed on the cloth before the image.\nAnd why not present this hypothetical work at «Scientific Conference on the Holy Shroud» which will be held at Valencia University-Spain next April 28-29-30 ?\nI guess the comitee is still accepting papers just search http://www.linteum.com\n                                           best regards\n                                        Maria da Glória\n                           Centro Português de Sindonologia\n\n","date":"March 13, 2012 at 7:12 am","url":"https://shroudstory.com/2012/03/12/irene-corgiats-shroud-of-turin-image/","cat":"image_theory","id":"comment-9274","author":"Maria da Glória Gonçalves Barroso","site":"shroudstory"}]
