[{"title":"One Handed Clapping for Colin Berry’s Criticism of the Colorado Paper","post":"If the mystery physicist wishes me to respond to his questions, then fine, but it will have to be on the site where the posting appeared – mine – not a third party site. Sorry to be so insistent, but I do not spend hours of my time in careful composition (like looking closely at the context of that term “luminance distribution” with all its miraculist baggage before expressing an opinion) simply to boost Dan Porter’s visitor count or Google rankings.\nI would have preferred to send this message to Dan as a private email, but the two I have sent him recently have both gone unacknowledged. Posting to dead letter boxes is not my idea of fun.\n\n","date":"February 18, 2013 at 7:18 am","url":"https://shroudstory.com/2013/02/18/one-handed-clapping-for-colin-berrys-criticism-of-the-colorado-paper/","cat":"image_theory","id":"comment-24657","author":"colinsberry","site":"shroudstory"},{"title":"One Handed Clapping for Colin Berry’s Criticism of the Colorado Paper","post":"Seriously, Colin? You are going to boost my visitor count or Google ranking by answering a question on my site????  Is this what this is all about? The way you boost visitor counts or Google ranking is by not thinking about it and thinking instead about what you are writing or posting on your own blog. Luminance distribution?\nGood grief, man, I just realized. You just did answer thus boosting something or other, maybe. Except you didn;t really answer, did you. Oh, well. We’ll maybe catch you on your blog and boost your whatever this is about.\n\n","date":"February 18, 2013 at 8:39 am","url":"https://shroudstory.com/2013/02/18/one-handed-clapping-for-colin-berrys-criticism-of-the-colorado-paper/","cat":"image_theory","id":"comment-24673","author":"Dan","site":"shroudstory"},{"title":"One Handed Clapping for Colin Berry’s Criticism of the Colorado Paper","post":"Why not address the issue, Dan, namely that I have my own site, and that the proper place for dealing with issues raised in my postings is there, not here? My point was addressed as much, if not more, to “reader” as yourself, who could quite easily adopt a pseudonym if he is genuinely concerned with semantics – and not simply trying to score cheap debating points or cast aspersions on my reasons for researching the Shroud. From where I’m standing it looks like a top-and-tail putdown AND a character slur, though I may be mistaken. \n  The issue I have raised re the modus operandi of John Jackson and the Shroud Center are serious ones, at least to this (retired) scientist. There is no room for ‘theophysics’ in science. Science is science. Hypotheses have to be testable in principle. Jackson’s wacky  radiation hypothesis is simply NOT testable. You and the mystery physicist (who seemed to appear about the same time as a Vatican State visitor on my flag counter – there’s a first time for everything) may think otherwise, and use this as yet another opportunity to have a dig at someone whose outlook and priorities in life are clearly  different from your own. If that is your preferred blogging persona, all nuanced pro-authenticity asides with no real substance, then so be it.  Don’t let anything I say deter you from your mission in life – whatever that is (about which one can only speculate, given how little you reveal about yourself beyond being Catholic-lite, correction, Episcopalian).\nOh, I now find it is the last three emails of mine that you have failed even to acknowledge, far less respond to. Care to explain why?\n\n","date":"February 18, 2013 at 9:33 am","url":"https://shroudstory.com/2013/02/18/one-handed-clapping-for-colin-berrys-criticism-of-the-colorado-paper/","cat":"image_theory","id":"comment-24682","author":"colinsberry","site":"shroudstory"},{"title":"One Handed Clapping for Colin Berry’s Criticism of the Colorado Paper","post":"nice piece…I too am theologically liberal (Catholic), but traditional too. For example, I don’t believe in the ‘physical’ body resurrection, but in the ‘spiritual’ body resurrection. Actually I don’t think this is actually that liberal as St Paul talked about the spiritual body, and before I converted to Catholicism I asked three priests if my non-belief in a physical body resurrection was problematic in becoming Catholic and they all said “no”\n\n","date":"February 18, 2013 at 7:56 am","url":"https://shroudstory.com/2013/02/18/one-handed-clapping-for-colin-berrys-criticism-of-the-colorado-paper/","cat":"image_theory","id":"comment-24664","author":"Matthias","site":"shroudstory"},{"title":"One Handed Clapping for Colin Berry’s Criticism of the Colorado Paper","post":"I would add too that my cousin is a nuclear physicist and Catholic too.. who said science and Faith are not reconcilable???!!!\n\n","date":"February 18, 2013 at 7:57 am","url":"https://shroudstory.com/2013/02/18/one-handed-clapping-for-colin-berrys-criticism-of-the-colorado-paper/","cat":"image_theory","id":"comment-24667","author":"Matthias","site":"shroudstory"},{"title":"One Handed Clapping for Colin Berry’s Criticism of the Colorado Paper","post":"i have comment on this before but can’t seem to get recognition or rebuttal.  In September, 1998 the Buddhist Monk Khenpo A-Chos acquired Rainbow Body.  At death (if in fact he ever stopped breathing) over a period of seven days his body proportionately shrunk to the point that it finally disappeared.  The shrinkage was accompanied by the display of multi-colored radiation, hence the name Rainbow Body. It is also referred to as the Light Body and the adepts, of which there are thousands, also have the ability to re-materialize in the confines of space and time.  The phenomena occurs also occurs in the Hindu tradition and reminds us too of the strange deaths of Enoch, Elijah, Moses, Mary and Jesus.\nFather Francis Tiso (who has impeccable scholarly credentials) visited Khenpo A-Chos’ hermitage at which the disappearance took place and confirmed its authenticity. Google his name and read for yourself.  All the adepts from contemporary to antiquity had one thing in common; lifestyle of love, compassion and asceticism taken to the extreme.  These are virtues that we can also assign to the Old and New Testament figures who experienced Rainbow Body like deaths and are available to every living creature that chooses the path.   These qualities, taken together, result in the absolute destruction of ego.  Said another way, they indicate the cessation of observation of self.  From quantum physics (i.e. the Thomas Young Double Slit Experiment) we know that in the atomic realm, when human consciousness ceases to observe something,  that something ceases to exist. It returns to the realm of invisible wave, formless and everywhere at the same time, releasing the energy that it held when it existed in form and substance. \nThe most plausible explanation for the image on the Shroud is that Jesus achieved Rainbow Body and the burst of radiation that followed produced a scorching effect on the burial cloth.  This conclusion is a bitter pill to swallow as it sends shock waves through fundamental Christian thought, from the alpha to the omega, the story of creation to that of resurrection of the body.  For sure, whether one imputes Rainbow Body to Jesus or not, the words in Genesis “to dust you shall return” need to be appended with the words, “but only if you so choose.”  And once you do, it is all downhill from there for the Christian theologian.\n\n","date":"February 18, 2013 at 10:46 am","url":"https://shroudstory.com/2013/02/18/one-handed-clapping-for-colin-berrys-criticism-of-the-colorado-paper/","cat":"image_theory","id":"comment-24690","author":"Tom Devins","site":"shroudstory"},{"title":"One Handed Clapping for Colin Berry’s Criticism of the Colorado Paper","post":"Reader, I have Googled “Francis Tiso.” He has his own web-site. He travelled to Tibet to investigate an account of a “Rainbow Body” manifestation. He presents a comprehensive spiritual comparison between the rainbow body and the resurrection without anywhere “confirming” its authenticity. He suggests a succession of follow-up activities which look vaguely scientific, none of which were in fact followed up. He saw two photographs of a monk manifesting the rainbow body while still alive, but does not describe them. He does say “The question of whether this “really” happens or not pushes us into a kind of endless debate about what is real…  Suffice it to say that the evidence collected… should convince a reasonable person that something out of the ordinary happened.” That’s as far as his evidence goes.\nAlas, from a scientific point of view, there is nothing to investigate.\n\n","date":"February 18, 2013 at 11:27 am","url":"https://shroudstory.com/2013/02/18/one-handed-clapping-for-colin-berrys-criticism-of-the-colorado-paper/","cat":"image_theory","id":"comment-24694","author":"Hugh Farey","site":"shroudstory"},{"title":"One Handed Clapping for Colin Berry’s Criticism of the Colorado Paper","post":"I have communicated to Father Tiso by e-mail and hope to solicit his help in bringing the Rainbow Body phenomenon to light in the form of a video and/or book. He currently lives in Rome.   The phenomenon is real and he most certainly confirms its authenticity.  Other Rainbow Body adepts include; Dilgo Khyentze Rinpoche (1992), Togden Ugyen Tendzin (1962), Ayu Khandro Dorje Peldron (1953), Khenchen Tsewang Rigdzin (circa 1953), Yilunga Sonam Namgyel (1952), Pema Dudul (1872), Milarepa (1135), Padmasmbhava (8th century) and in later antiquity, dates uncertain: The Ancient Kings of Tibet, Mamkel Nyingpo and the Eighteen Tamil Siddhas (HIndu). \nThere are more.  Those identified were enough to satisfy my needs and I have researched their lives in enough depth to be able to correlate lifestyle with the strange deaths they incurred.  I have interviewed a prominent Buddhist scholar who also confirms the phenomena.  \nIt is a real thing that happens to ordinary people who choose to walk the difficult walk and not just talk the talk as most of us everyday people do. It is time for the Church to fess up.\n\n","date":"February 18, 2013 at 12:48 pm","url":"https://shroudstory.com/2013/02/18/one-handed-clapping-for-colin-berrys-criticism-of-the-colorado-paper/","cat":"image_theory","id":"comment-24705","author":"Tom Devins","site":"shroudstory"},{"title":"One Handed Clapping for Colin Berry’s Criticism of the Colorado Paper","post":"Tom, most interesting.\n\n","date":"February 18, 2013 at 3:02 pm","url":"https://shroudstory.com/2013/02/18/one-handed-clapping-for-colin-berrys-criticism-of-the-colorado-paper/","cat":"image_theory","id":"comment-24715","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"One Handed Clapping for Colin Berry’s Criticism of the Colorado Paper","post":"All the mors so as the rainbow (according to the Tanakh is “the sign of the covenant that G.od set between Him and mankind… for all generations to come.”\n\n","date":"February 19, 2013 at 2:32 pm","url":"https://shroudstory.com/2013/02/18/one-handed-clapping-for-colin-berrys-criticism-of-the-colorado-paper/","cat":"image_theory","id":"comment-24898","author":"Max Patrick Hamon","site":"shroudstory"}]
