[{"title":"Paper Chase:  A Significant Paper by Mario Latendresse","post":"I definetly agree that it is a must-read paper, but it has been long ago easily available on the Barrie’s site.\n\n","date":"November 2, 2014 at 7:26 am","url":"https://shroudstory.com/2014/11/02/paper-chase-a-significant-paper-by-mario-latendresse/","cat":"image_theory","id":"comment-167884","author":"O.K.","site":"shroudstory"},{"title":"Paper Chase:  A Significant Paper by Mario Latendresse","post":"I think it has always been listed on Barrie’s site since 2005 as linking to Mario site (http://www.sindonology.org/papers/latendresse2005a.pdf). Mario now catches the request and redirects it to Academia. This is nice. No disk storage costs, no bandwidth issues (but who pays for that anymore — it’s free these days) and I definitely think more exposure. I’m looking at ways to put the 2008 Ohio conference papers there to save costs and increase exposure. See: Publishing Shroud of Turin Papers on Academia.edu\n\n","date":"November 2, 2014 at 9:29 am","url":"https://shroudstory.com/2014/11/02/paper-chase-a-significant-paper-by-mario-latendresse/","cat":"image_theory","id":"comment-167895","author":"Dan","site":"shroudstory"},{"title":"Paper Chase:  A Significant Paper by Mario Latendresse","post":"Dan, you are making a big mistake. It is always more convincing to get material published in a respected peer-reviewed journal and then provide a link to academia. edu. or other websites that house scientific papers. That is what the best scientists and scholars do, it is much more credible than providing links to personal or other websites. It can backfire,meaning it is being posted there because the scientist is not that good, no one reads his papers posted on some website, and so he is drawing attention to it by appealing to academy. edu.\n\n","date":"November 2, 2014 at 11:30 am","url":"https://shroudstory.com/2014/11/02/paper-chase-a-significant-paper-by-mario-latendresse/","cat":"image_theory","id":"comment-167914","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  A Significant Paper by Mario Latendresse","post":"As far as I can tell on first reading, Charles seems to have viewed it purely as a contest between two mutually exclusive alternatives.  Exhibit A  was a pro-authenticity imprinting off a 1st century individual’s real body. Exhibit B was a freehand medieval-era painting, that being duly declared the winner on points.\nShhh. There was a third option, or at any rate a second medieval imprinting option (but don’t tell Charles I said so).\nFor once I find myself in agreement with the pro-authenticists  – the image is a negative IMPRINT off some kind of contoured 3D template – whether living, dead or inanimate.  It was  definitely nothing so mundane (and scientifically uninteresting) as an allegedly inferior  painting!\n\n","date":"November 2, 2014 at 12:11 pm","url":"https://shroudstory.com/2014/11/02/paper-chase-a-significant-paper-by-mario-latendresse/","cat":"image_theory","id":"comment-167919","author":"Colin Berry","site":"shroudstory"},{"title":"Paper Chase:  A Significant Paper by Mario Latendresse","post":"There is no competition here – it is an accumulation of evidence that gives a coherent picture of the Shroud’s provenance. I ask in vain for any one convincing  piece of data that dates the Shroud to the crucial period of AD 1-30. Failing that I put together in my article all the evidence that suggests a western origin for the Shroud, done on a medieval treadle loom, showing fourteenth century iconography ,etc, ,etc that reinforce my argument for those (have you got round to it yet,Colin? ) who have read my article. I am not competing with anyone on this!\n\n","date":"November 2, 2014 at 1:26 pm","url":"https://shroudstory.com/2014/11/02/paper-chase-a-significant-paper-by-mario-latendresse/","cat":"image_theory","id":"comment-167927","author":"Charles Freeman","site":"shroudstory"},{"title":"Paper Chase:  A Significant Paper by Mario Latendresse","post":"(Sorry, as indicated I posted inadvertently to the wrong thread – a new window had opened unintentionally obscuring the intended one  “History vs Science etc).\nYes. I had missed earlier links to your article, Charles, so did not get to read it until a few hours ago, and then posted first thoughts.\nI had thought of deploying the term “Options” as in Option 1 (1st century imprinting, whether by magical radiation or Rogers’ ‘naturalistic’ mechanism) versus Option 2 (medieval painting), but decided on “contest” instead, given there’s always a polarization of views in shroudology, rather than mere choices. “Options, “contest”, “competition”, whichever term one uses should not prevent any of us from making a cool and rational assessment of the available evidence and arriving at our own judgement as to where the truth lies, based on a balance of probabilities and that indefinable thing called gut feeling. \nMy chief reservation with your analysis is not to do with the chronology, placing the TS in the medieval era. It’s your thesis that it’s a product of its time, entirely explicable by the artistic conventions of the era.\nI believe the TS to be a one-off, but stand to be corrected. Are you aware of any other images with its peculiar properties, notably the negative ‘photographic’ character. Can you name any other image in which the aim has been to depict an imprint, as left by a figure on both frontal and dorsal contact sides of a burial shroud that has been PAINTED? I can’t, but then I’m not an art historian. \nBut if, as I believe, the artisan(s) (NOT artist) who produced the TS deployed an entirely novel, one-off imprinting technology that did not use paint but which modified the fabric itself chemically, or some exceedingly thin surface coating, then I hardly think the TS was produced simply for dramatic effect for an Easter ritual, given there was no compelling need that I can see to show ANY image whatsoever on the shroud.\nBrand new technology? When it’s entirely divorced from the conventions of extant art or even crafts,when we struggle to comprehend the physics and chemistry even now, centuries later, then that says to me there must have been  a far more compelling reason on someone’s part to invest time, energy and expenditure in so ambitious an undertaking. But what?\nIt’s claimed that Geoffroi de Charny was nephew of Geoffroi de Charney, Knight Templar, Preceptor of Normandy, who was roasted alive alongside Jacques de Molay, Templar Grand Master, Paris 1314. “Roasted” note. it’s a long shot I know, but there’s another hypothesis there if the TS image is indeed as I suspect some kind of thermal imprint.  Visual metaphor? The slow grill equivalent of gallows humour? But what do I know, me being merely a dilettante in all matters historical (scientific too according to anoxie and John Klotz ;-).\n\n","date":"November 2, 2014 at 2:35 pm","url":"https://shroudstory.com/2014/11/02/paper-chase-a-significant-paper-by-mario-latendresse/","cat":"image_theory","id":"comment-167933","author":"Colin Berry","site":"shroudstory"},{"title":"Paper Chase:  A Significant Paper by Mario Latendresse","post":"Thermal imprint is closer to authenticity than not. Only no hot paint, please!\n\n","date":"November 2, 2014 at 3:23 pm","url":"https://shroudstory.com/2014/11/02/paper-chase-a-significant-paper-by-mario-latendresse/","cat":"image_theory","id":"comment-167942","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  A Significant Paper by Mario Latendresse","post":"Take another look at the STURP Summary, Louis. While it  doesn’t say “hot paint”  it does say “dehydrated, oxidized, conjugated” linen carbohydrates. Sounds to me like some kind of “hot paint”  albeit a somewhat metaphorical description.\n\n","date":"November 2, 2014 at 3:31 pm","url":"https://shroudstory.com/2014/11/02/paper-chase-a-significant-paper-by-mario-latendresse/","cat":"image_theory","id":"comment-167943","author":"Colin Berry","site":"shroudstory"},{"title":"Paper Chase:  A Significant Paper by Mario Latendresse","post":"Colin, the STURP papers dismiss the notion of painting, particularly the one that was proposed by Walter McCrone. Some chemist should be able to explain why the “dehydrated, oxidized, conjugated linen carbohydrates” you mention have nothing to do with paint.\nI did some googling on material used for making paint in the medieval ages and found nothing about hot paint:\nhttp://www.answers.com/Q/How_was_paint_made_in_the_medieval_times\nI think your approach here is honest, unwilling as you are to buy Charles Freeman’s painting hypothesis, and this can lead to fruitful discussion.\nOriginally the image information process was said to have involved heat and light but now there is only talk about heat, at least by Professor Fanti.    \n.\n\n","date":"November 2, 2014 at 5:17 pm","url":"https://shroudstory.com/2014/11/02/paper-chase-a-significant-paper-by-mario-latendresse/","cat":"image_theory","id":"comment-167962","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  A Significant Paper by Mario Latendresse","post":"Oh dear. You seem to have taken me too literally Louis. I wasn’t suggesting for one moment that STURP’s dehydrated carbohydrates represented real paint. I was merely responding to your term “hot paint”.which I took to be a metaphor.\n One can think of Irene Corgiat as applying “hot paint” when she scorched a look-alike image of the TS onto linen using her pyrographic tool (similar to an electrician’s hot soldering iron),  the colour being entirely due to chemical pyrolysis of the linen’s own carbohydrates.\nI personally do not buy into any suggestion that the image was originally applied pigment that subsequently ALL detached, leaving some kind if visible but unspecified signature. Even if that had happened it would be unscientific to push that as a probable scenario. To be scientific there would need to be evidence of at least some remaining pigment, sufficient for chemical characterization.\nExcluding the problematic traces of iron oxide or mercuric sulphide claimed by Walter McCrone that don’t square with the reflectance spectroscopy (dehydrated carbohydrates) except by invoking a Joe Nickell/Luigi Garlaschelli scenario (chemically-induced dehydration due to H2SO4 impurity in medieval ochre – ingenious but otherwise unsupported) there’s not a shred of hard evidence for any kind of real, non-metaphorical “paint”. The logical next stage in model building has to be a “scorch” hypothesis, not necessarily a contact scorch (my own preference). Even Di Lazzaro’s laser beams produced what might legitimately be described as a scorch. “Scorch” should be seen as any coloration produced from the linen carbohydrates per se as a consequence of chemical changes that lead to loss of the elements of water  (2H per O atom) with the production of yellow chromophores with conjugated double bonds (-C=C-C=C-) with their extended delocalised system of  pi-bonding electrons.\n\n","date":"November 2, 2014 at 6:48 pm","url":"https://shroudstory.com/2014/11/02/paper-chase-a-significant-paper-by-mario-latendresse/","cat":"image_theory","id":"comment-167978","author":"Colin Berry","site":"shroudstory"},{"title":"Paper Chase:  A Significant Paper by Mario Latendresse","post":"Colin, sorry to have misunderstood you. You have been very objective in your comments, providing a clear picture. The context is to determine whether paint    makes sense or not and since it has been practically ruled out we are left with an image formed by scorch or a scorch-like process. So that is how the studies should advance. I hope to be able to delve more deeply into the scientific aspects of the image — not my field — and get some more information about them shortly.\n\n","date":"November 2, 2014 at 7:39 pm","url":"https://shroudstory.com/2014/11/02/paper-chase-a-significant-paper-by-mario-latendresse/","cat":"image_theory","id":"comment-167989","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  A Significant Paper by Mario Latendresse","post":"PS Sorry, wrong posting. Not sure how that happened. Maybe Dan can decide where best to put it.\n\n","date":"November 2, 2014 at 12:29 pm","url":"https://shroudstory.com/2014/11/02/paper-chase-a-significant-paper-by-mario-latendresse/","cat":"image_theory","id":"comment-167921","author":"Colin Berry","site":"shroudstory"},{"title":"Paper Chase:  A Significant Paper by Mario Latendresse","post":"To me, the most important thing in this very interesting paper is the fact that it independently confirmed quite well the conclusion already reached by Jackson et al. from STURP concerning the frontal part of the cloth and its most probable configuration over the body, which was loose and not tied up.  Would be nice to see Mr. Latendresse or another scientist making the same analysis for the dorsal part of the cloth, which is something that has never been done, not even by STURP!  And if we believe the theoretical conclusion reached by Fazio and Mandaglio in a paper they published some years ago, the maximum distance for the image formation process that was calculated by STURP for the frontal part of the Shroud (i.e 3.7 centimeters) is most probably shorter for the dorsal part, even though, for the moment, the precise and definitive maximum distance for this dorsal region still wait\nto be determined.  \nFor more infos about that subject, I recommand to read the annex of this paper of mine: http://www.holyshroudguild.org/uploads/2/7/1/7/2717873/yannick_clment_thoughts-on-newly-published-rogers.pdf\nI don’t think many people have read this and, frankly, I think there are some interesting things in there. Have a nice reading!\n\n","date":"November 2, 2014 at 5:56 pm","url":"https://shroudstory.com/2014/11/02/paper-chase-a-significant-paper-by-mario-latendresse/","cat":"image_theory","id":"comment-167968","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase:  A Significant Paper by Mario Latendresse","post":"I have read through Mario’s paper on a number of previous occasions, I think it is excellent.  One reservation that I and others have, is at the top of the head, as it would seem that from the measured distance between the facial and occiput images, the cloth was drawn quite firmly over the top of the head which would have been masked in some way to leave no top of head image.  I believe that an air gap at the top of the head cannot be sustained because of the measurement.\n\n","date":"November 2, 2014 at 6:47 pm","url":"https://shroudstory.com/2014/11/02/paper-chase-a-significant-paper-by-mario-latendresse/","cat":"image_theory","id":"comment-167977","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase:  A Significant Paper by Mario Latendresse","post":"I utterly agree with Daveb when it comes  to the excellence of Dr,Latendresse’s paper.\nI think the question of how the cloth was placed over the top of the head was already analyzed on this blog and it is my personal opinion that an air gap beteen the top of the head and the cloth cannot be excluded based only on empirical paper measurements and «medium» anatomical distances from the front and the back top of the head.\nThis point of view shoud certainly be considered if a contact mechanism /normal to the skin mechanism is assumed as the way the image formed on the cloth.\nOn the contrary if the Body wrapped in the cloth projected His image onto the cloth by an orthogonal collimated way as Professor Alan Adler (and other researchers) thought), then there’s no problem accepting that the cloth was firmly drawn over the top of the head.\nProfessor Latendresse nicely explained the boodstain issue but a question puzzles my mind, and I think it would be useful to discuss it on this blog:\nBLOODSTAINS ON THE SIDES OF THE FACE APPARENTLY ON THE HAIR-IF A CONTACT MECHANISM IS ASSUMED FOR THEIR IMPRESSION ON THE CLOTH DID THEY ORIGINATE FROM THE FACE OR FROM THE HAIR?\nThere are contradictory findings\nEveryone remembers Dr. Gilbert Lavoie’s experience with a stained sheet covering the head of a long hair bearded man and the conclusion was staightforward: bloodstains beside the face of the Man of he Shroud and apparently on the hair originated from the anatomical face.\nOn the other way Dr. Petrus Soons states that when image processing expert Bernardo Galmarini «replaced» the previously removed bloodstains over the 3D face model they appear  on the hair on two sides of the face!!!\nWeird enough isn’t it?\n                                                                    regards\n                                                      Antero de Frias Moreira\n                                           Centro Português de Sindonologia\n–\n\n","date":"November 3, 2014 at 6:22 am","url":"https://shroudstory.com/2014/11/02/paper-chase-a-significant-paper-by-mario-latendresse/","cat":"image_theory","id":"comment-168168","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Paper Chase:  A Significant Paper by Mario Latendresse","post":"First, thanks Dan for promoting my paper. Yes, it is the same paper that was presented at the 2005 Dallas conference. Indeed, I recently “published” it on academia.edu and I applied a redirect to academia.edu, if an attempt is made to access the paper from sindonology.org. Most of my papers (not about the Shroud) are listed (and some available) at ResearchGate, my personal web page at SRI International or Université de Montréal. But I decided to give academia.edu a try. It takes time to transfer these papers due to copyrights.\nSecond, Antero de Frias Moreira (and Daveb) mentions two important “puzzles” (questions): 1) How close is the cloth on the top of the head considering the absence of an image on the Shroud; 2) Lavoie’s theory that some bloodstains around the face originated from the face, and the not the hair.\nFor  question 1, I am fairly certain that there was a sufficient gap between the cloth and the top of the head such that we can apply the principle “distance >2cm => no image”. This can be tested by the following measurements: a) lay down flat on your back on a floor (that’s a real experiment), the back of your head touching the floor; b) place a finger at the intersection of the floor and the back of your head; c) measure the distance from that point on your head to your hairline going over the top of your head (or where you think the hairline should be if your hairline is receded); d) measure to the distance from the perceivable hairline on the Shroud to the point where the image abruptly stops on the back of the head on the Shroud (that is, close to the location of most bloodstains starts on the back of the head); e) compare the two last measurements.\nI get about 20.5 cm for (c) and 26 cm for (e).  This measurement (e) was done on the Shroud Scope (http://goo.gl/NdxL5d). There is a difference of 6 cm which is clearly enough to create a gap of more than 2 cm from the cloth to the top of the head. I would even say that there are other indications that the cloth slightly sag away from the top of the head, one of them being the fading bloodstains on the back of the head as you go up towards the top of the head.\nOf course, we expect the results to be different for different people, but this is confirmed for most people, it is the most likely correct conclusion. And if it happens only for a few percentage of people, it is a possibility.\nFor the measurements you can do some variations, like tilting the head forward slightly (as it is presumed on the Shroud), but that will not change much your results. \nFor question 2, I am fairly certain that the theory of Lavoie is incorrect (regarding the bloodstains near the face, not other bloodstains he studied). That is, the bloodstains perceived as coming from the hair on each side of the face, when looking at the Shroud, comes from the hair. This is actually one of the main conclusions of my paper: most of the cloth was not repositioned between the moments the bloodstains formed and the images formed (there are probably some part of the Shroud that was repositioned between these two moments but only the side of the body). Otherwise, you would have vertical misalignment of the bloodstains and the images. The way the bloodstains appear does not preclude that they come from the hair (and Lavoie never used arguments based on “the way the bloodstains” appear.)\nMore precise studies could be done regarding the right principle to use about the distance cloth-body: is it vertical, normal to the skin, or the shortest distance cloth-body? To do so would require a more thorough simulation using 3D technology and computer simulation. In any case, a 3D simulation could make it much clearer all the possible small distortions perceived on the Shroud.\n\n","date":"November 3, 2014 at 7:34 pm","url":"https://shroudstory.com/2014/11/02/paper-chase-a-significant-paper-by-mario-latendresse/","cat":"image_theory","id":"comment-168407","author":"Mario Latendresse","site":"shroudstory"}]
