[{"title":"Paper Chase:  An Alternate Hypothesis for the Image Color","post":"I think this is a dead end. But the article where he sums up his ideas (top right corner of this blog) is an excellent basis and different from this version.\n\n","date":"September 2, 2013 at 1:36 pm","url":"https://shroudstory.com/2013/09/01/paper-chase-an-alternate-hypothesis-for-the-image-color/","cat":"image_theory","id":"comment-42685","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase:  An Alternate Hypothesis for the Image Color","post":"Just to make sure most people won’t miss the newest version of the guess posting that you can find on top of the blog’s main page, I have decided to post it also here, since the topic concern also Rogers’ new paper.  So, here’s a copy of the post I made this afternoon and I really hope people will take time to read this updated version instead of the actual guess posting because I truly believe this new version is better and more complete:\nHello everyone. Last night and today, I have written a much complete version of my thoughts regarding this very interesting and even important paper from Rogers and here it is (I hope you will now comment on this new updated version instead of the one that was posted by Dan):\n[The rest of this comment is in the revised version]\n\n","date":"September 4, 2013 at 5:41 pm","url":"https://shroudstory.com/2013/09/01/paper-chase-an-alternate-hypothesis-for-the-image-color/","cat":"image_theory","id":"comment-42954","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase:  An Alternate Hypothesis for the Image Color","post":"Yannick, i think this paper is simply anterior to his mail, written in 2003 i guess, and to his experiments which proved convection blurred the image.\n\n","date":"September 5, 2013 at 8:16 am","url":"https://shroudstory.com/2013/09/01/paper-chase-an-alternate-hypothesis-for-the-image-color/","cat":"image_theory","id":"comment-43004","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase:  An Alternate Hypothesis for the Image Color","post":"If Rogers experiments would have produced a result that would have “proved convection blurred the image” as you said, no way he would have kept defending his Maillard reaction hypothesis, while trying constantly to refine it, until his death!  \nCan you please give me the reference for this so-called “2003 mail” of Rogers?  I really don’t know what you’re talking about.\nPersonally, all I have read in Rogers’ writings is precisely the opposite! Effectively, Rogers was clear in his book and in his papers about the Shroud that he thought that some particular conditions could have helped to produced the high-resolution body image on the Shroud with the kind of diffusion process he described.\n\n","date":"September 9, 2013 at 10:43 am","url":"https://shroudstory.com/2013/09/01/paper-chase-an-alternate-hypothesis-for-the-image-color/","cat":"image_theory","id":"comment-43471","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase:  An Alternate Hypothesis for the Image Color","post":"I made a little mistake in my last paragraph. Sorry.  You should read: Personally, all I have read in Rogers’ writings is precisely the opposite! Effectively, Rogers was clear in his book and in his papers about the FACT that he thought that some particular conditions could have helped to produced the high-resolution body image on the Shroud with the kind of diffusion process he described.\n\n","date":"September 9, 2013 at 10:44 am","url":"https://shroudstory.com/2013/09/01/paper-chase-an-alternate-hypothesis-for-the-image-color/","cat":"image_theory","id":"comment-43472","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase:  An Alternate Hypothesis for the Image Color","post":"2003 mail :3\nMAILLARD REACTION IN DETAIL\nNo convection means no convection cells, but diffusion is still active.\n\n","date":"September 9, 2013 at 1:23 pm","url":"https://shroudstory.com/2013/09/01/paper-chase-an-alternate-hypothesis-for-the-image-color/","cat":"image_theory","id":"comment-43492","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase:  An Alternate Hypothesis for the Image Color","post":"I understand better what you mean:  For Rogers, if there would have been convection cells Inside the Shroud, this would have blurred the image.  So, if the image really comes from a diffusion process similar to his hypothesis, that means there were no or very few convection cells produced during the image formation process.\nI hope I put it correctly…\nIn another part of Thibault’s paper, here’s another relevant quote of Rogers about this convection cell issue: “Heavy amines appear much more slowly. I sent the CDH data previously, and Fred sent his alignment\nchart. Most will start to appear when the body has essentially cooled to ambient. There will be no\nconvection cells to mix and/or transport them. The amount that appears at the surface of the skin will\nincrease on a time scale of days. They are liquids at room temperature, but they vaporize more rapidly\nthan they appear (pools do not form, certainly not in less than 30 hours when tissues start to liquefy).\nThey diffuse much more slowly than ammonia, improving resolution. Putrescine boils at 158C;\ncadaverine boils at 178C. They don’t evaporate as rapidly as water, but they smell a lot worse and are a\nlot more reactive with saccharides. They are also basic and toxic. They have a much harder time\ndiffusing through the pores of the cloth, although I wouldn’t be surprised to find that some had made\nit.”\n\n","date":"September 9, 2013 at 2:00 pm","url":"https://shroudstory.com/2013/09/01/paper-chase-an-alternate-hypothesis-for-the-image-color/","cat":"image_theory","id":"comment-43495","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase:  An Alternate Hypothesis for the Image Color","post":"That´s the point. Challenge is to identify which substances diffused from the surface of the skin, and the heavier the better. Using EDTA he got a millimetric resolution.\n\n","date":"September 9, 2013 at 2:39 pm","url":"https://shroudstory.com/2013/09/01/paper-chase-an-alternate-hypothesis-for-the-image-color/","cat":"image_theory","id":"comment-43496","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase:  An Alternate Hypothesis for the Image Color","post":"Science have to find what substance(s) can diffuse the best without producing convection cells, but also in which environmental and/or textile and/or biological conditions did a diffusion process of this or these substances can help to produce the best image resolution!  There are so many possible factors that could have played a huge role for the high-resolution of the image…\nBy the way, what is EDTA?\n\n","date":"September 9, 2013 at 3:00 pm","url":"https://shroudstory.com/2013/09/01/paper-chase-an-alternate-hypothesis-for-the-image-color/","cat":"image_theory","id":"comment-43497","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase:  An Alternate Hypothesis for the Image Color","post":"Convection, and convection cells, would result from a temperature gradient not from the substances (but skin temperature quickly reaches ambient temperature once blood flow stops.)\nThere are many factors limiting resolution, one is the molecular weight of diffusing molecules, e.g. NH3 alone simply can’t reach high resolution.\n\n","date":"September 9, 2013 at 3:13 pm","url":"https://shroudstory.com/2013/09/01/paper-chase-an-alternate-hypothesis-for-the-image-color/","cat":"image_theory","id":"comment-43499","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase:  An Alternate Hypothesis for the Image Color","post":"I’m sure a lot of other factors could have played a role in the image formation.  A particular degree of humidity for example.  The amount and location of carbohydrate impurities on the  surface of the cloth could also (as it seem to me) have make a good difference between a high-resolution image and a not so good resolution…  And for the biological conditions, you mentioned the most important for diffusion, i.e. what was the temperature of the body when he was placed Inside the Shroud and how fast did he cooled down?\nAgain, I ask you the same question:  What is EDTA?\nBy the way, imagine there would have been a small coach of urea on the skin and hair of the Shroud man after the drying of his intense sweat and before his body was placed Inside the Shroud, which is truly a possibility regarding the context of a crucified body.  Don’t you think this kind of biological deposit could have played a huge role in the image formation process?  I personally think this is a hypothesis that should have been analyzed more in deep by Rogers during the making of his image formation hypothesis.  We know that urea can be transformed into NH3 (ammonia gas), so in my mind, it could have played a role in the formation of the image (even if you think that ammonia cannot in any circumstances produce a good-resolution image), along with maybe other biological deposits and/or some molecular diffusion from the corpse (like singlet oxygen molecules; on this subject, see: http://shroud.com/pdfs/n69part3.pdf and http://shroud.com/pdfs/n56part4.pdf).\nAnd finally, how can we be so sure that ammonia cannot produce a good-resolution image until every possible environmental, textile and biological conditions could be fully tested?  As it seems to me, we’re very far from there …\n\n","date":"September 9, 2013 at 3:45 pm","url":"https://shroudstory.com/2013/09/01/paper-chase-an-alternate-hypothesis-for-the-image-color/","cat":"image_theory","id":"comment-43501","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase:  An Alternate Hypothesis for the Image Color","post":"Temperature of the skin ? No significant gradient with room temperature, at least to create active convection cells.\nEDTA is the reactant Rogers used to mimick heavy amines.\nI don’t think urea produces ammonia significantly at ambient temperature. Glutamine does for example.\nAmmonia could have played a role during the induction phase “to prepare” the coating of fibers but alone can’t reach high resolution because based on a diffusion model gradient is not steep enough.\n\n","date":"September 9, 2013 at 3:57 pm","url":"https://shroudstory.com/2013/09/01/paper-chase-an-alternate-hypothesis-for-the-image-color/","cat":"image_theory","id":"comment-43503","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase:  An Alternate Hypothesis for the Image Color","post":"Thanks for the info.  I think Rogers was fully aware of the fact that ammonia gas alone could probably not have produced the image on the Shroud.  But having said this, I think it would very good to see some CSI expert doing more test on linen sample in various conditions to see what kind of role an ammonia diffusion could possibly have played in the formation of the image.\n\n","date":"September 10, 2013 at 8:31 am","url":"https://shroudstory.com/2013/09/01/paper-chase-an-alternate-hypothesis-for-the-image-color/","cat":"image_theory","id":"comment-43601","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase:  An Alternate Hypothesis for the Image Color","post":"Here is why you must read the (Rogers’) paper:\n“I believe that a combination of relatively rapidly decomposing impurities on the surface of the cloth with transfer/diffusion of catalytic compounds from a body, as discussed by Pellicori, could explain the observations on the chemistry and appearance of the image on the Shroud. It should explain the shallow penetration of the image, the fact that the color did not penetrate more deeply at presumed contact points, its “half-tone” appearance, and its predominantly discontinuous distribution.”\nYes, but with all due respect to a gifted chemist sadly no longer with us,  Raymond Rogers seems to have had little or no understanding of the flax/linen surface onto which the superficial Shroud image was imprinted, whether by natural processes, or miraculously or by forgers. He describes the hemicelluloses of linen as an “impurity”, despite being an intrinsic and major component of the superficial primary cell wall (PCW), and then substitutes that conjectural man-made impurity coating (starch, saponins etc) onto which the Shroud image was imprinted.\nAll of this I have said on numerous previous occasions. The reason for posting this comment is to provide a link to a schematic diagram of the PCW  I have just come across,  one that shows some fascinating detail (caveat: possibly conjectural) re the relationship between the chemically-reactive hemicellulose (shown in blue) and the underlying cellulose fibrils.\n\nNote the way that the hemicellulose forms a series of interrupted striations on the surface of the cellulose fibrils. Then imagine an image being thermochemically imprinted by some means onto that surface. It is not difficult to see how the resulting image might exhibit  both half-tone character AND striations as reported per Shroud image  if there were selective pyrolysis (chemical dehydration to yellow or tan products) of those interrupted hemicellulose bands or segments, leaving the cellulose relatively intact.\nIt may be time to restart those kitchen experiments. It could start with attempts to strip off the outermost PCW layer of cells selectively, or even the hemicelluloses only, and see whether the surface then resists thermochemical dehydration (aka “scorching”  ;-). \nStrategies? There are physical means, e.g. stripping with adhesive tape, freeze-thaw cycles, or possibly chemical ones too, though I don’t under-estimate the difficulties. It will be interesting to compare linen with cotton, since one might anticipate some differences (the linen PCW has only to make contact with other internal cells of stem’s bast fibres, so can/may be somewhat fragile, while the cotton PCW on those hairy seed bolls is in direct contact with outside air, so might need to be thicker and more robust, easier to see and possibly imprint, but harder to strip off).\nIn the longer term, it might be interesting to see whether those hemicellulose segments, if disposed as per diagram, can be selectively stained histochemically, and detected (if present) under light microscopy of flax/linen fibres, and compared with high magnification/HD photographs of the Shroud fibres. Does anyone know if the latter are available, and/or whether they show a striation pattern comparable to the hemicellulose in that schematic diagram?\n\n","date":"October 27, 2013 at 9:15 am","url":"https://shroudstory.com/2013/09/01/paper-chase-an-alternate-hypothesis-for-the-image-color/","cat":"image_theory","id":"comment-48894","author":"colinsberry","site":"shroudstory"}]
