[{"title":"Image Theory: “You’ve gotta admit — this is exciting stuff!”","post":"I know Jabba personally via email exchanges and he sent me this same message yesterday.  Here’s my answer to him (that could be good for anyone else) :  \nIf you really want to study the question further, buy the book of Rogers and read it carefully.  There a part in his book where he comment specifically about the hypothesis of Corona discharge.  And don’t forget, Rogers was an expert in the field of radiations.  I’m sure of one thing :  If he would have thought 2 seconds that the image was generated by some kind of radiation or electric discharge, he would have told us.  It wasn’t the case at all !  All he wrote was against this possibility.  At least, buy the book and see for yourself !  It’s the best scientific book I’ve ever read about the Shroud.\nIf it would be proved one day that the image was generated by a process involving quantum mechanics, then it wouldn’t be a supernatural event !  What I think is that science for the moment is not able to fully understand the image because there’s too much unknown surrounding it.  And maybe these unknown data will make that we’ll never be able to fully understand the image formation process…  At least, I’m confident that a new series of direct testings on the Shroud will resolve many issues surrounding it and we’ll be able to understand way better the image on the cloth.  Another I’m sure of is the fact that nature is really surprising sometimes !!!  \nBecause I think the Shroud is genuine, I had to ask myself why God wanted to let an imprint of his Son on a Shroud ?  I think the main purpose of this is, for the Holy spirit, to reach many doubters and made them think !  I also think one other purpose (and it worked for me) is to give more strenght to my faith and also, to provide the most incredible Icon of the passion and death of Christ to help our meditation.  Also, for me, it is some kind of a proof of the Incarnation of God and that’s important !\n\n","date":"September 1, 2011 at 5:51 pm","url":"https://shroudstory.com/2011/09/01/image-theory-youve-gotta-admit-this-is-exciting-stuff/","cat":"image_theory","id":"comment-3763","author":"Yannick Clément","site":"shroudstory"}]
