[{"title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?","post":"It is absolutely amazing the way the pseudo skeptics swallowinq whole any din-bat, unathenticated theory as long as it “proves” the Shroud a fake.\nAs I understand the Freeman position as reported uin the article uoted: all iot will take is for the vtican to authprixze tests diretd towrds hi one theory to solve the whole mu=ystery. All it would take for a pig to fly is for it to sprout wings. \nI am still waiting for an identification of the existence in present time of an “art object” that has the physical properties of the Shroud mimicked to the molecular and the atomic level.\n\n","date":"June 1, 2015 at 6:49 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","id":"comment-200766","author":"John Klotz","site":"shroudstory"},{"title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?","post":"typos dinbat = dingbat\nvtican = Vatican\nauthprixze = authorize\nmu=ystery = mystery\nI can’t believe I am over-caffeinated this early in the morning.\n\n","date":"June 1, 2015 at 6:52 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","id":"comment-200767","author":"John Klotz","site":"shroudstory"},{"title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?","post":"Why do some folks just have to go out of their way in an attempt to destroy the Christian faith ? As I have said before, I am not a scientist but I do know how to read and think.  I am more than happy accepting the proof that has been published that proves that the Shroud is the burial cloth of Jesus Christ and he resurrected on the 3rd day. Also as I have said before while I was reading one of the articles and was studying and comparing the online photos, I was told by my Guardian Angel that I was looking at images of the risen living Jesus Christ. The image was imprinted by the living Devine Soul as it re-entered and re-constituted the body of Jesus the Christ.\n\n","date":"June 1, 2015 at 7:18 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","id":"comment-200768","author":"ekmcmahon","site":"shroudstory"},{"title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?","post":"I can understand Charles’ position as an acadêmic but feel the need to point out that the complexities in the image have not been taken into account.\n\n","date":"June 1, 2015 at 7:21 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","id":"comment-200769","author":"Louis","site":"shroudstory"},{"title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?","post":"Louis,\nYou are presuming that Charles is an academic. Does he have an academic position?\n\n","date":"June 1, 2015 at 7:24 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","id":"comment-200770","author":"John Klotz","site":"shroudstory"},{"title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?","post":"Hi John\nHe hás no academic position, but hás given courses in history at Cambridge. I can say one thing, speaking from experience. Acadêmics can be biased in what they publish and they are generally respected because of their positions. I havê known serious researchers in Parapsychology in Europe who havê complained to me that acadêmics refuse to address their research. Parapsychology is recognised by the UN.\nI’m now working on a review of an acadêmic book, which should be posted today. It is a serious study that merits consideration.\n\n","date":"June 1, 2015 at 8:37 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","id":"comment-200779","author":"Louis","site":"shroudstory"},{"title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?","post":"I did a PhD so know from experience that the academic world is far from pure. Its full of bias and world views often dictate. In my field you faced an uphill battle if you didn’t subscribe to the left leaning doctrine expected. I didn’t subscribe and struggled. So much for free thought and openess to different perspective – things that in my view should be central to academia.\n\n","date":"June 2, 2015 at 3:03 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","id":"comment-200844","author":"Thomas","site":"shroudstory"},{"title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?","post":"“While Colin complains that the world is ignoring his two-stage imprinting model,”\nIf you want to be taken serioulsy you have to be consistent.\nWhatever nonsense Charles Freeman is writing, he has been consistent with his views, and has published a readable article about it.\nColin had published a kind of “summary” of his scorch hypothesis, it was back in the days you could still read one of his blogpost with a single mug of coffee. He had been promoted on Wikipedia.\nIs he still complaining that his scorch hypothesis which could “explain it all” has been removed from the references on Wiki? Is he complaining that Wiki has not updated his page for his latest “hypothesis which explains it all”?\n\n","date":"June 1, 2015 at 8:23 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","id":"comment-200777","author":"anoxie","site":"shroudstory"},{"title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?","post":"Charles Freeman hangs out on every skeptic blog message board known to man.  Bottom line:  Freeman’s world view is severely threatened by an authentic and unexplainable Shroud.  He is not adding anything of value to the discussion on this board.   And the only thing I agree with Colin  on….\n\n","date":"June 1, 2015 at 9:07 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","id":"comment-200780","author":"Nabber","site":"shroudstory"},{"title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?","post":"If you had to be scientifically correct to be a leading Shroud skeptic, one would know.\nYou think he doesn’t add anything of value, i think Colin doesn’t either. As a chemist, i would rather listen to Thibault, silent so far on his own views.\n\n","date":"June 1, 2015 at 11:07 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","id":"comment-200791","author":"anoxie","site":"shroudstory"},{"title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?","post":"I beg pardon about my past intervention (= yesterday)\nbecause I wrote imprudently about nanotensile test (Hysitron apparel)\nand I forgot to write a in good manner about all the controls… \nWhere are the AFM experts ?\nDid they carefully avoid experts who might actually find that the Holy Shroud is not what it purports to be?\nIs that the reason for the silence?\nI don’t believe in that controversial idea, but I am curious about\nthe possible results from the inherent discussions…\n\n","date":"June 1, 2015 at 10:17 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","id":"comment-200784","author":"piero","site":"shroudstory"},{"title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?","post":"“… that National Geographic is especially bad on this, maintaining “the idea that there is something inherently mysterious about the Shroud when in fact an afternoon in a conservation lab – which would find the traces of gesso and paint – would probably sort things out.” ”   \nOver a period of three days in 1978, some 30 scientists with impeccable credentials, with then state of the art equipment found no trace of gesso, nor of paint, yet Freeman persists with promoting his absurd hypothesis, which lacks any supporting evidence whatsoever, and yet he finds support from similarly minded ignoramuses from Academia, and close minded so-called “free-thinkers”. \nAs a professional art critic, Freeman is unable to distinguish an image of a real human being from that of a painted portrait, is unable to understand the distinction between an imprint and a painting, nor the distinction between a negative image and a positive, and is utterly lacking in any scientific credentials whatsoever.  He claims to have examined candidates in the philosophical discipline of “critical thinking”, and yet he breaks all the rules of this discipline in his own uninformed comments, passing over and ignoring any scientific work which does not suit him, and can only resort to citing anonymous experts in defence of his specious claims.\n\n","date":"June 1, 2015 at 3:17 pm","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","id":"comment-200802","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?","post":"Dave, don’t hold back, tell us how you really feel …\n; ^ }\n(and thanks!)\n\n","date":"June 1, 2015 at 4:36 pm","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","id":"comment-200804","author":"Nabber","site":"shroudstory"},{"title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?","post":"These comments suggest that the case for authenticity is closed. Yet science moves on and I shall be interested to see what new tests on the Shroud will bring. I know where I think the argument will end up.\nI am just happy to wait but  naturally I am putting forward my own ideas in the meantime as everyone else here is doing. It is something called free debate.\n\n","date":"June 2, 2015 at 1:25 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","id":"comment-200834","author":"Charles Freeman","site":"shroudstory"},{"title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?","post":"yes it’s free debate. But I think many of us would appreciate knowing who your so called experts are. The ongoing anonymous referencing is frustrating and breeds suspicion as to credibility when it’s possibly not warranted.\nSurely some of these experts wouldn’t have a problem with being name checked if they are so confident in their views? \nYou don’t have to do it here. Why not write an article where their opinions are brought through?\n\n","date":"June 2, 2015 at 3:57 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","id":"comment-200848","author":"Thomas","site":"shroudstory"},{"title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?","post":"Thomas- you are quite right- the articles will keep on coming- and when I need to give an acknowledgment of an expert I will do so with their permission.\nWe may never get a final solution for the Shroud but we can at least provide overlapping evidence from a variety of specialists which gives us a reasonable understanding of it.\n Inevitably many textile experts will give their opinion from what they can see of the Shroud’s weave and iconography and the present state of the images but prefer not to go further without a close-up examination. Sadly unlike the Anti-Kythera Mechanism where there is access given freely to those with the right expertise- the Shroud at present is off-limits and expert opinion is likely to be limited as a result.\n\n","date":"June 2, 2015 at 4:16 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","id":"comment-200850","author":"Charles Freeman","site":"shroudstory"},{"title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?","post":"I like to interpret the story of 3 monkeys in different way:\n1.Hear  only who support (or from experts who don’t want to divulge their names),\n2.Speak (or write) only to get popular,\n3.See (or read) only the area of your speciality.\n\n","date":"June 1, 2015 at 11:04 pm","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","id":"comment-200827","author":"Sampath Fernando","site":"shroudstory"},{"title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?","post":"Do you know the Determination of Abrasion Resistance of Fabric by using the Martindale Method on fabrics made of linen?\nIn other words:\nIs it possible to know what are you thinking about the possible useful tests (to use) in order to show the truth?\n— — —\nI am curious to know what is the exact level of abrasion for the four corners of the ancient cloth.\n— —\nThe reasoning is the following : if there are 1300 years of difference the behavior of the textile material in the Raes/C14 corner is different with respect the original part of the cloth.\nThen, in my opinion, it is very easy to do an interesting comparison through non-destructive analyses (= SPM controls)\nPerhaps we can start from the tables of results obtained using the adequate controls on linen samples (controls on experiments done to find the level of abrasion on linens previously treated with different kind of treatement [= Martindale, crockmeter, etc.]).\n— — *** — —\n>The Martindale Abrasion Tester was developed by J.G. Martindale in the early 1940s under the auspices of the Wool Industries Research Association in England. It uses an oscillating top plate to move a circular test specimen in a grouping of elliptical repeating paths over a stationary abradant under pressure. There are a set of 16 sequentially changing ovals or back and forth ellipses executed in each repeating group. The precise\nrepeating group is known as a Lissajous figure.\n>Quantifying The Abrasion Resistance Of Textiles can be performed in several ways each of which requires the rubbing of the fabric of interest against a standard abradant and the assessment of how much abrasion it takes to either create a hole, aesthetic deterioration, strength loss or mass loss. \nLinks:\nhttp://www.textileinstruments.net/news_pro.asp?id=310&Movements,Lissajous,rubs-and-cycles-of-Martindale-and-Wyzenbeek.asp\nhttp://textileinstruments.net/pod_pro.asp?id=276&smallclassname=Fabric%20Garment&smallsmallclass=Phycical&name=Martindale%20Pilling%C2%A0And%C2%A0Snagging%C2%A0Tester\n\nhttp://file.yizimg.com/175706/2011120810224025.pdf\nhttp://en.wikipedia.org/wiki/Lissajous_curve\n— —\nHere another way (destructive = Digital Bursting Strength Tester)\nto test the textile material:\n\ntps://www.textiletestingequipment.com/instrument-42/Fabric-Garment-Testing-Instruments/digital-bursting-strength-tester-paper-fabric-garment-film-sheets.aspx\n— —\nI’d like to address the interesting issue in terms of time (= centuries) and level of textile damage’s probability (see: Bayes’ theorem)…\nDo you know where are the useful works or the useful ancient samples?\nFor example:\nWere the ancient coptic samples never controlled in this manner???\n\n","date":"June 3, 2015 at 9:49 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","id":"comment-200982","author":"piero","site":"shroudstory"},{"title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?","post":"GOOGLE : EUGENE RAY / SHROUD OF TURIN\n\n","date":"June 3, 2015 at 1:14 pm","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","id":"comment-200997","author":"Eugene Ray","site":"shroudstory"},{"title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?","post":"I have. I can make nothing of your website. If you have any evidence of anything, post it here.\n\n","date":"June 3, 2015 at 5:10 pm","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","id":"comment-201014","author":"Hugh Farey","site":"shroudstory"},{"title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?","post":"I’m sorry that I have to agree with Hugh.  I’m not at all sure that Eugene has anything of substantial evidence or not.  If he has, then it might be helpful to him, if he consults someone more skilled in the design of web-sites.  I was unable to discover anything on his present site that demonstrated any evidence at all, beyond a few incidental assertions.\n\n","date":"June 3, 2015 at 9:20 pm","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","id":"comment-201027","author":"daveb of wellington nz","site":"shroudstory"}]
