[{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"Dan, Thibault, I think that having access to the second part of this paper regarding the laws of diffusion (in my view the strongest difficulty) would be most interesting. In fact, after the previous discussions on Dan’s previous post on gas diffusion and the band effect,  addressing a comprehensive discussion on the diffusion mechanisms is a must.\n\n","date":"June 26, 2012 at 5:59 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13049","author":"Gabriel","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"-There’s no second part(cf previous discussion)\n-Resuming Rogers’ idea to a “Gas diffusion hypothesis” is misleading (at least G. Fanti was mislead in his analysis of Rogers’ hypothesis) : to be precise Rogers’ explanation of chemical properties of the image is based on Maillard reaction, concerning image resolution he made an hypothesis, to be tested and optimized, including many parameters, one of which being gas diffusion.\nRogersJohn Jackson’s mathematical analysis of image resolution suggested that no single, simple molecular-diffusion or radiation mechanism could produce the image observed. However, a combination of systems could offer an explanation, e.g., anisotropic heat flow by radiation from the body to the cloth, attenuated heat-flow in the cloth, gaseous diffusion, convection, surface properties of cloth, and the dependence of chemical rates on temperature.\n","date":"June 26, 2012 at 6:47 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13052","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"Very well said Anoxie !!!  It’s a very good summary of Rogers hypothesis…  And as Dan once said, it is not even a complete hypothesis yet.  Rogers died before he could push it forward.  It was still in a preliminary form when he died and, as I said the other day, would be nice to see some other chemist(s) take Rogers work and push it forward, while doing more experiments to test his ideas.\n\n","date":"June 26, 2012 at 5:46 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13067","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"To start with, Maillard reaction itself is complex. Its kinetic and products depend on substances reacting and parameters such as moisture, pH, temperature which have to be determined.\nSo yes, a chemist’s expertise is definitely needed.\n\n","date":"June 27, 2012 at 12:27 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13103","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"Some years ago, Rogers wrote a very long SSG message to explain step by step his hypothesis and the many parameters. I will try to summarize this message later.\nHowever, I think that experiments would be impossible for the time being for practical reasons.\nBut as I wrote, there are professional software able to model the behavior of the gaseous diffusion between 2 surfaces taking into account many parameters (geometry of the surfaces, molecular weight, temperature, convection  etc..).\nThis may be the first step.\nWhatever the complexity of the structure of the TS and of the chemistry of the Maillard reaction in/on the target (the TS), the main first key-parameter is the number of gaseous molecules reaching the target at a given location within a certain time.\nThis could help to find some basic necessary conditions consistent with the so-called collimation and the high resolution in the case of the gaseous diffusion hypothesis.\nAfter that we could work more in detail and perhaps perform some experiments.\n\n","date":"June 27, 2012 at 3:57 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13114","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"Although you only have preliminary results obtained with a software (and not a full second paper yet) it would be great if you could share them in this blog. Being Rogers theory’s major difficulty the gas diffusion\\motion, I would love to discuss any initial research on this topic.\n\n","date":"June 28, 2012 at 2:48 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13119","author":"Gabriel","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"I would also say that addressing this problem as you mention, considering the number of gaseous molecules and not at a macroscopic level thus counting flow using volume per unit time units,  confines the problem to a very specific set of conditions. This implies a very-very low emission rate of amines/sweat/any other reactive compound/  and if so, modelling such a flow would not be so difficult.\n\n","date":"June 28, 2012 at 2:59 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13120","author":"Gabriel","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"“Gaseous diffusion hypothesis” is misleading.\nA large part of the shroud could be in direct contact with the body. And this is to be quantified, but when Dr Flury Lemberg removed the back cloth on the shroud, she noticed the shroud is strikingly soft.\nThere is no color saturation on the shroud, ok, but analysing the grey scale, there are evidences of a saturation at contact points (hair, nose, eyebrows, beard, chicks, forearms…), and gradient is steep (pure diffusion zones).\nConcerning contact zones, there’s a pressure gradient too. Higher pressure meaning microcopically : shroud clother to the skin, and more contact points.\n\n","date":"June 27, 2012 at 5:39 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13115","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"You touch a very good point Anoxie !  It’s true that some good portions of the cloth were most probably in direct contact with the corpse and, how surprising, it is these supposed parts (the nose, the hands, part of the hair, the back, the buttocks, etc.) that are the most define in the image !  I think the high-resolution of the image is misinterpreted or overestimated because the highest resolution is found in the probable zones of direct contact that don’t need any image projection…  When we have to judge the possibility of the hypothesis proposed by Rogers, we have to understand this FACT.  I really have a sense that all the parts of the image that was projected to the cloth are less high in resolution than all the parts that were in direct contact with the fabric and, if I’m right, this is a very good indicator that the image formation (at least, a good part of it) was most probably chemical in nature…\nAnd for the comment of Thibault, I would say this :  Even if laboratory experiments can be tough to do and expensive, I don’t see why this could not be done in the present state of the scientific research !  Look, if Rogers, alone in his home lab, was able to do some interesting preliminary experiments, I really don’t see why someone else could not take his work and push it forward.  Really, I don’t see any good reason to do more experiments to verify his hypothesis more deeply.  And I even think that some experiments could be done without being too expensive or too complex…  I think this hypothesis of Rogers should be tested step by step, with the purpose of testing every aspects of it.  This can be a very long process, but I think if someone would have the guts, he could make a nice portion of the road !  And I don’t think this should mean that no computerize models should not be done in parallel.  As I say, I think it should be a step by step process with the main goal of not forgetting or neglecting one or more aspects of his hypothesis, which is a very complex one…\nFinding the right number of gaseous molecules reaching the target at a given location within a certain time in order to produce an image like we see on the Shroud is one aspect of the problem and I agree that this should be analyzed in deep, because that can help to confirm or not if a gaseous diffusion can really have taken some part in the image formation process.  But, because we’re not even sure of the chromophore of the image, a scientist who will try to find the correct model should be VERY CAREFUL before he can say for sure that this is the right model for the Shroud’s image !  I think it’s easy to see the complexity of testing Rogers hypothesis adequately.  That’s why I prefer by far to see some real lab experiments done on real linen samples of different natures (one prepared the same way than we found in Pliny the Elder, another more recent sample, another one prepared a like we see in Pliny but with another detergent at the end of the process, etc.) and with real amines sources of different natures (ammoniac only, ammoniac mixed with more heavy amines, etc.).  \nI think the first experiments should be focused mainly on the image chromophore proposed by Rogers and see if he was right about that versus the Shroud.  If we could be certain that the chromophore is really a thin layer of carbohydrates impurities located on-top of the most superficial fibers and ONLY THAT, then making some real lab experiments with amines and other biological products with a coloring potential would be easier to do and the results of these analyses would be also easier to compare with the Shroud’s reality…\n\n","date":"June 28, 2012 at 1:36 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13144","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"Question for Gabriel :  Have you followed all the rest of the very good discussions that went on after the publication by Dan of my long comment about Rogers hypothesis ?  If you didn’t, I recommend you to read all that was written here : https://shroudofturin.wordpress.com/2012/06/14/gas-diffusion-and-the-banding-effect/#comments\nI’ve come up with more quotes from Rogers that really help to understand better his hypothesis and ideas versus the Shroud…  Since you love this topic, I hope you’ll be able to read all the comments that were posted there !\n\n","date":"June 28, 2012 at 2:24 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13147","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"Yannick, I have read them all and as in previous occasions we have exchanged some comments under that post. I do appreciate all your hard work in explaining Rogers hypothesis.  My view is that Rogers theory is chemically speaking rather solid but more research is needed regarding the motion of gases/amines and how this explanation fits in the anisotropiic vertical formation of image. That is why  I am so interrsted if Thibault has made a preliminary model on diffusion!\n\n","date":"June 28, 2012 at 3:18 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13153","author":"Gabriel","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"I understand and I agree with you.\n\n","date":"June 28, 2012 at 4:04 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13160","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"\nGabriel :\nmore research is needed regarding the motion of gases/amines and how this explanation fits in the anisotropiic vertical formation of image\n\nWell, you’ve got the answer, it can’t fit, gaseous diffusion is isotropic. Then I don’t think there is a “vertical formation of image”.\nBut, if you assume the shroud was mostly in direct contact with the corpse, you can consider local conditions consistent with so called “high resolution”.\n\n","date":"June 28, 2012 at 5:33 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13162","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"Right now, since no one knows exactly what was the real image formation mechanism (or mechanisms), I think we should be extremely prudent with the idea of an anisotropiic vertical formation of the image.  Mario Latendresse, in his study presented at the Shroud Conference in Dallas in 2005, said that the projection of the image could have been directly vertical, but it the projection could also have follow the closest path between the body and the cloth.  If this last hypothesis is right, then I don’t know if this would be more in favor of a gaseous diffusion from the body or from the skin, but it’s interesting nevertheless.  Anyway, Rogers was aware of these difficulty concerning the projection of the image, along with his high-resolution and, nevertheless, the few preliminary tests he made gave him results that were good enough for him to not look elsewhere to find a better explanation and, on the contrary, to continue his investigation (that was stop when he died of course).  I think that’s one very important thing to note and, for me, this is a proof that no one, in the present state of our knowledge, have the right to discard Rogers hypothesis.  On the contrary, as I often say, I think these preliminary tests were enough encouraging that someone else (another top-notch chemist) should take over the work of Rogers.\n\n","date":"June 30, 2012 at 3:41 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13231","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"Yes, I think too Rogers found the right track.\nAs Thibault wrote in his article the reactive amine should be on the skin. And next step is :\n\nThibault HEIMBURGER :\nThe main first key-parameter is the number of gaseous molecules reaching the target at a given location within a certain time.\n\nThat is modelling the liquid vapour transition kinetic and interdiffusion of gases.\n\n","date":"July 1, 2012 at 11:05 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13280","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"So far, based on basic models (plane and radial diffusion) to study gradient concentration, I think the diffusion hypothesis is consistent with image resolution .\nAnother argument for gaseous diffusion is the banding effect.\nI found a picture with an enhanced contrast (or a better resolution) here. Contrast is very good but you can see few bands almost blank or brown all lenght long. And according to gaseous diffusion, there was gas in no contact zones (between fingers, between hands and legs…), able to react.\nThen we can say, on this area, the limiting factor was the reactive on the cloth.\n\n","date":"July 2, 2012 at 3:58 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13334","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"Good comment Anoxie.  As I said before, in Rogers mind, the reactive level of each fibers depend on many factors, not just one.  And the banding effect is a good indicator that he was probably right about that.  For example, a fiber that would have more impurity on its surface would have a higher coloring potential.  Also, a fiber that would receive more amines, no matter the amount of impurities would react more stongly, etc.  This is not an easy hypothesis to judge because of the number of factors involved in the image formation process that is proposed…  And we also have to remember that Rogers himself agreed that there was probably other process(es) involved, along with the one he proposed, in order to account properly for the final body image.  What is interesting to note is this :  Recently, I came across an old article written in 1951 which state that Paul Vignon himself had the same exact feeling than Rogers about his own vaporographic hypothesis, i.e. that something else probably had been acting inside the Shroud in order to account for the final image.  Taking these point of views into account, the question that come is this one :  What the hell can be this other process (or these other processes) involved in the image formation ???  Personally, I think it would be interesting for a chemist to check out the hypothesis proposed by John De Salvo, because I have a feeling that it can well be another complementary process that was active inside the Shroud (involving a chemical reaction coming from a molecular transfer of lactic acid from the skin).  You can see that there would be a lot of lab tests that should be done in order to verify all this.  Important note :  These kind of tests still wait to be performed by an expert in chemistry…  Anyone interested ???\n\n","date":"July 2, 2012 at 4:47 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13338","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"\nYannick Clément :\na fiber that would have more impurity on its surface would have a higher coloring potential\n\nExactly, but too much impurity and the contrast is ruined… What seems extraordinary is the very good match between the amount of reactive amines and the amount of reactive on the shroud. And as you say, there may be other critical parameters (temperature ? moisture ? adsorption ? diffusivity/porosity of the shroud ?) \nActually, there seem to be a contrast of the image depending on the band. That’s obvious on “blank” bands, but on brown ones, we should not mistake the variegated patterns for the image. It’s hard if not impossible to do on a picture.\nI don’t think STRP team did a spectrophotography of the shroud able to differentiate image patterns from variegated patterns. Is there such a material ? Or at least a very high resolution picture of the shroud ?\n\n","date":"July 3, 2012 at 1:11 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13351","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"Very good point…  It would be nice to have a constrast enhanced picture of the Shroud at very high resolution where we could really distinguish very well what is really a body image coloration, what is really a blood or serum stain, what is really a scorch (lite scorch, medium scorch, heavy scorch, etc.), what is really a non-image area, etc…!  I think that would help to understand better the image formation process…  I’m sure there’s some images like that in circulation but I never one really good where all the different colorations on the Shroud would be easy to distinguish from each other.  That’s truly a great problem in order to understand better the image formation because many of these different elements have a coloration that is pretty close and it is easy to make interpretation mistakes.  One good example of that is the debate I had on this blog with Mario Latendress about the 2 series of 3 stains in the buttocks area !  He was claiming that these where blood stains and I pretend that these are light scorch instead !!!  It’s really not easy to be sure about these different coloration.  \nAnd for the match between the amount of reactive amines and the amount of impurities on the fibers, I’m not so sure about that.  In my mind, it is truly possible that there some light coloration that have not been detected on some fibers because these fibers didn’t beared much impurities, while in other areas (where the bands are darker), it’s truly possible to think that the more impurities there are on the fibers, the more we can see an intense coloration.  I think there really is a relationship of that nature on the Shroud concerning the body image, but I don’t think it’s a mystery at all.  I just think that the more impurities you have, the more dense the coloration will be, that’s it.  That’s the way I see the body image coloration.  I think we can assume that the density of the image can be due, not only to the number of colored fibers by square cm, but also to the thickness of the impurity layer of each fiber.  This idea should be tested with a computerized model to see if a result like the image on the Shroud can be obtain when you put these 2 parameters in the process.\nAnd I agree completely with you that many others parameters could have been critical inside the tomb and inside the Shroud in order to produce a body image of the high quality as wee see on the Shroud.  That’s why if someone should do one day more laboratory experiments to push Rogers work forward, he will have to think of testing the image formation process proposed by Rogers in a vast spectrum of environmental conditions !\n\n","date":"July 4, 2012 at 6:16 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13470","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"\nYannick Clément :\nAnd for the match between the amount of reactive amines and the amount of impurities on the fibers, I’m not so sure about that.  In my mind, it is truly possible that there some light coloration that have not been detected on some fibers because these fibers didn’t beared much impurities, while in other areas (where the bands are darker), it’s truly possible to think that the more impurities there are on the fibers, the more we can see an intense coloration.\n\nOk, I’ll try to be clearer.\nColoration intensity is based on the density of impurity layer, but contrast comes from the difference between colored zones and the background color, and gradient of reactive on colored zones.\nIf the density of the impurity layer was too high, we would have a blurred image (like the one Rogers got in his first experiments), too low, a ghostly or no image.\nTo have a correct contrast, the global range of the reactive and the mean density of impurity layer have to match.\n\n","date":"July 5, 2012 at 1:19 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13481","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"Ok, I think I understand your point.  But I’m sure that there is some range between a too high amount of impurities and a too low amount…  Don’t you think ?  The question is :  What can be that range ?  I think only real experiments (along with maybe some estimations from a software modeling) could permit to calculate this range precisely.  Who knows ?  Maybe this range is large enough, so that we don’t have to call this a “miracle” ! ;-)\n\n","date":"July 6, 2012 at 8:32 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13554","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"\nanoxie :So far, based on basic models (plane and radial diffusion) to study gradient concentration, I think the diffusion hypothesis is consistent with image resolution .\nRegarding this crucial point I would say:only perhaps\nThe reason is that in my view, vertical anisotropy and image resolution are closely linked and diffusion is isotropic.\nI also see difficulties in studying and modelling the process at a molecular and not a macroscopic level. However, after thinking quite a lot about this, I must admit that if that were the correct approach, the complexity of the problem would increase exponentially and by itself, it would explain another mistery: why so far, nobody has  been able to provide a comprehensive model for image formation.\nThis is why I would like to reiterate my strong interest in the first calculations that Thibault has made to address this problem. It would be great if he could share them in this blog for open and honest discussion.\n\n","date":"July 3, 2012 at 4:13 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13363","author":"Gabriel","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"In my view, there is no definite argument for vertical anisotropy.\n\n","date":"July 3, 2012 at 4:55 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13367","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"I agree with Anoxie.  Since we are not sure yet about the correct image formation process, it is very difficult to be definitive about this aspect of the question…  More researches and testings must be done to see more clearly.\n\n","date":"July 4, 2012 at 6:17 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13471","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"\nYannick Clément :\nI think only real experiments (along with maybe some estimations from a software modeling) could permit to calculate this range precisely.\n\nExperiments are needed to explore the reactivity of the impurity layer, and the amounts/type of reactive amines needed to have a correct resolution.\nBut I see no theoretical objection to discard this hypothesis.\n\n","date":"July 7, 2012 at 5:12 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13566","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"Do you mean that you don’t see any good reason (theoretically speaking) to reject Rogers hypothesis or the contrary ???  I’m not sure to understand correctly what you mean in your last comment…\n\n","date":"July 8, 2012 at 6:57 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13619","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"Personally, I really don’t think there is a scientific FACT that can permit to reject the hypothesis of Rogers.\n\n","date":"July 8, 2012 at 6:58 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13620","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"That’s it, i don’t see any definitive argument to reject an hypothesis based on Maillard reaction.\n\n","date":"July 9, 2012 at 3:20 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13659","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"La hipótesis de Rogers, aunque a Yannick le DISGUSTE, es insostenible……Veremos que cuenta el químico Denis Mannix en la reunión de la BSTS.\n-La producción de aminas “pesadas”, cadaverina y putrescina se inician en la fase de PUTREFACCIÓN, y esa fase NO comienza hasta que desaparece el  RIGOR MORTIS. El hombre de la Sábana presenta rigor mortis.\nLa fase de putrefacción necesita el concurso de bacterias aerobias y anaerobias y el ph ácido por las elevadas cifras de ácido láctico mientras dura el rigor mortis inhibe el crecimiento de las bacterias.\nNO hay formación de cadaverina y putrescina que precisa la hipótesis de Rogers porque NO hay putrefación.\nRigor mortis y putrefacción NO son compatibles. Así se estudia en el Cronatodiagnóstico, determinación del tiempo transcurrido desde la muerte.\n-En las muertes traumáticas y con shock múltiple la “Tríada de la muerte” la constituye la ACIDOSIS, HIPOTERMIA y COAGULOPATÍA.\nLa HIPOTERMIA suele establecerse entre los 34- 30 grados centígrados.\nPero aún admitiendo en el momento de la muerte todo lo contrario, una HIPERTERMIA de 41 grados centigrados, la temperatura corporal disminuye 1 grado centigrado por cada hora transcurrida después de la muerte durante las primeras 12 horas, y 1/2 grado centigrado por cada hora transcurrida después de la muerte después de las primeras 12 horas.\n– Así que a las pocas horas de la muerte la TEMPERATURA NO PARECE SER COMPATIBLE con una reacción de Maillard que además CARECE de la participación de aminas pesadas (cadaverina, putrescina etc)……….\n\n","date":"July 8, 2012 at 10:01 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13623","author":"corneliotel","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"Ignoro el por qué en mis comentarios aparezco unas veces como “corneliotel” y otras veces como “carlos”.\n\n","date":"July 8, 2012 at 10:04 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13624","author":"corneliotel","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"I don’t speak spanish, but I think you based your argument on Rogers’ hypothesis  presented in his article on Maillard reaction.\nYour points are debatable but mostly right, that’s why to have a comprehensive hypothesis, it must be optimized.\nI can read “putrescina, cadaverina” in your comment, you should note they have been ruled out by thibault Heimburger, his article cited in this post.\n\n","date":"July 9, 2012 at 1:08 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13628","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"anoxie:\nCadaverina y putrescina……NO\nTemperatura……………………NO\nReaccion de Maillard………..NO\nHipotesis de Rogers,,,,,,,,,,,,NO\n(corneliotel o carlos)\n\n","date":"July 9, 2012 at 2:34 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13630","author":"Carlos Otal","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"Why do you discard Maillard reaction ?\n\n","date":"July 9, 2012 at 4:00 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13637","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"Carlos, how can you be certain of the reactions of a tortured, scourged, crowned with thorns and crucified body like the man of the Shroud.  Have you ever analysed one in your life ???  And I also think you should be more careful regarding the fact that no one know what was the exact conditions that were present inside the tomb and inside the Shroud…  In that context, how can we be certain about these issues regarding the amount of heavy amines produced, the time when they started to be released by the body, etc. ???  \nIs it possible for you to understand the FACT that the man of the Shroud WAS NOT A NORMAL CORPSE and we there is no way to be certain of how this corpse could have react exactly inside the tomb and inside the Shroud ???  To remain scientifically sound, I think we must be much more careful about these questions than what you show…\n\n","date":"July 9, 2012 at 10:10 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13676","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"I’m with Carlos, or corneliotel here ;-)\nI agree 100% with the temperature issue, which I mentioned here many months ago, and no way the body would have reached or sustained a temperature of 40C in the tomb.,I agree with the rigor-mortis vs. putrefaction also; Gases will emanate from the orifices first, and there is no sign whatsoever of this on the Shroud. The ventral and dorsal images are equal in density; this refutes can not be explained or possible with this hypothesis.Then there is the issue as in the that the manufacturing of the Shroud followed a description by Pliny the Elder..which is pure speculation!. The Milliard reaction can not explain the precise-detailed image formations on non-contact areas. Last but not least; Rogers himself states that this hypothesis does not EXPLAIN the image in it’s entirety, and continues with the comment; other processes were involved!! What other processes?…Sorry seems far-fetched to me and in his own words it does not explain the image.\nR\n\n","date":"July 9, 2012 at 4:21 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13660","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"Temperature : ok\nPutrefaction and gases coming from the orifices : ok\nBut i think that was mere ideas for Rogers, not a comprehensive hypothesis.\nConcerning Maillard reaction and the resolution, i don’t agree.\nMaillard reaction id the best explanation, by far, to explain chemical properties of the image.\nResolution is consistent with gaseous diffusion given a close corpse-shroud configuration.\n\n","date":"July 9, 2012 at 8:11 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13665","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"“Resolution is consistent with gaseous diffusion given a close corpse-Shroud configuration’ ….Please lets stay real here! Where is this consistence evidence?\n\n","date":"July 10, 2012 at 6:07 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13683","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"Read again Rogers book Ron, particularly the part where he describe the results he obtain with his 2 preliminary experiments concerning his Maillard reaction hypothesis…  If you don’t have time, go read the summary I did here : https://shroudofturin.wordpress.com/2012/06/14/gas-diffusion-and-the-banding-effect/#comment-12512\n\n","date":"July 11, 2012 at 7:46 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13759","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"Ron, have you ever thought that the other unknown process involved could have been a direct contact only process like, maybe, one particular kind of process that could be compared to the Volckringer pattern, as proposed by John De Salvo ?  I think if a process like that was also involved, along with a Maillard reaction, that could help to explain the precise details of the Shroud’s image !  Effectively, if you are honest (and I know you can be honest), you have to agree with me that we can assume that all the areas of the image that are the more precise (the hands, the face, etc.) are the ones that were in direct contact with the cloth…  I think if there was really a complementary process that was also acting inside the Shroud, along with a Maillard reaction, this should have been a direct contact process.  I think the future researches about the image formation process(es) should really try to look in that direction.\n\n","date":"July 9, 2012 at 10:24 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13677","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"Sorry Yannick, you can go on referring everyone too your own speculations and writings, but simple logic tells me, a milliard reaction, alone, or in conjunction with some other ‘unknown speculated process’ cannot explain or produce the image we see on the Shroud, especially if one understands the image well…i.e; contact points.\nR\n\n","date":"July 10, 2012 at 6:02 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13682","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"If you want to talk about “contact points”, let me remind you that the image that is the most dense on the Shroud is the image of the hair and face and Rogers hypothesis offer a rational explanation (theoretical for the moment) for this particular aspect of the cloth, while, at the same time, in Rogers mind, this same aspect of the Shroud (particularly for the image of the hair) was one major reason to reject any hypothesis based on any kind of radiation (like the UV light of Di Lazzaro, the corona discharge of Fanti, the protons and neutrons of Rinaudo, etc.).\n\n","date":"July 11, 2012 at 7:50 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13760","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"All I can do in regard of all these critics made by PARTISANS OF THE SUPERNATURAL HYPOTHESES, is writing again what I wrote recently in my long comment that you can find here : https://shroudofturin.wordpress.com/2012/06/14/gas-diffusion-and-the-banding-effect/#comment-12937\nI hope you’ll go and read all this comment.\nHere’s the last part where I adress these “often heard” critics :\nAnd concerning the second assumption made by Thibault, I really don’t think the documentary research he made concerning the production of amines by a dead body has covered all the possibilities that exist, especially when you consider that the dead body inside the Shroud WAS NOT a normal corpse, but was a crucified body that suffered a great deal (and for a long period of time) prior to his death. In this very odd condition, I’m not so sure that someone has the right to completely reject the possibility that heavy amines could have been produced by this very particular corpse in more quantity and in a faster time than a normal dead body… That’s why, personally, I’m not ready yet to reject this possibility, even if I have a tendency to believe that Thibault’s complementary (or parallel) hypotheses can well be close to the truth. In fact, I think it’s truly possible to think that these 2 hypotheses could have acted simultaneously inside the Shroud, i.e. that some reactive gas could have come from inside the body, along with some more gas that could have come from the skin. WHY NOT ? Again, we MUST remember the very particular nature of the corpse that was enveloped in the Shroud !!! \nThat’s a crucial factor in order to evaluate properly the hypothesis proposed by Rogers ! And I think that’s precisely where there was a little “mistake” made by Thibault in his conclusion versus the documentary researches he made on the subject !!! Effectively, I think he has underestimated the particularity of this tortured and crucified corpse versus the known production of amines from a normal corpse… I really think it’s fair to assume that the few scientific studies he found on the subject never intended to characterise the production of amines (especially the amount and the speed of this production) coming from a beaten, scourged, crowned with thorns and crucified dead body that had suffered a very high rising of the bilirubin that was in his blood ! In this context, the fact that he based his conclusion on a “normal” production rate can really be irrelevant versus the reality of the Shroud… That’s really what I think. In that regard, I think we have to consider both hypotheses is “possible” regarding the formation of the Shroud’s image.\nAnd to conclude this message, let me share with you a little reflection that can help you understand that, in the present state of our medical knowledge, I don’t think we have the right to conclude that a tortured and crucified body would react in the same exact way than a normal corpse : We know for a fact that rigor mortis would come much faster in the case of a tortured body like the man of the Shroud. This is a fact and we can even see some clear signs of this in the Shroud’s image, i.e. the bending of the knees (one more than the other), the expended chest, the bending of the elbows, the bending of the head forward, etc.). In this particular context, let me leave you with this very good question : If the very particular nature of the corpse that was enveloped in the Shroud was responsible for the fast coming of a state of rigor mortis (that can have been also stronger, as much as faster), than who can really be certain if the production of amine gases from the body could not also have been accelerated (regarding not only the rapidity and the quantity of the gases released but also for the places of the body where those gases were released) ??? WHO CAN REALLY BE CERTAIN ABOUT THAT ??? If you do, please show me a published scientific paper that proves that being tortured for a long period of time and to die of crucifixion has really no effect on the production of heavy amine gases coming from the body after death !!! Even if I consider it to be very good, I’ve not found anything concerning this crucial aspect of the question in the paper written by Thibault… I think it’s fair to presume that, concerning this aspect of the question, MORE RESEARCHES ALSO NEED TO BE DONE in order to really know the truth !!! And I also think it’s fair to say that, in the Shroud world, a vast majority of people (whether it be authentic sindonologists or just interested people like we see here on the blog) have really paid attention to the very particular aspect of the body image on the cloth, but at the same time, those people have greatly neglect the simple FACT that the corpse that was most probably at the heart of this body image formation had a very particular nature too ! I think that’s a big mistake to underestimate, neglect or simply forget that important FACT when it comes to reflect upon the body image on the Shroud, because I really believe that one cannot go without the other ! In other words, I personally think that one (the nature of the corpse) can really help to explain the other (the body image on the cloth)… Reflect upon this folks !\nThat’s it for this long comment.  Since no medical and scientific studies has ever been done on a real tortured, scourged and crucified man, no one can say for sure how much amines could be produced by this kind of corpse and how fast these amines could be released by a corpse.\nAnd also, like we found in Thibault’s paper, there’s another complementary solution (urea on the skin left there by the drying sweat) that could maybe account better for the body image on the Shroud, while remaining essentially based on the Maillard reaction hypothesis of Rogers…\nSo, because of all this, I don’t think Rogers hypothesis can be declared dead yet, even if I know that’s the biggest dream of all the members of the supernatural fringe…\n\n","date":"July 9, 2012 at 10:04 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13675","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"La imagen de la CARA por contacto es IMPOSIBLE.\n[la demostración es ELEMENTAL, SIMPLE Y SENCILLA y creo que usted y otros muchos NO lo entienden]\nMida usted con el Shroud Scope cualquier distancia en la cara entre puntos equidistantes, desde uno a otro lado y que pasen por la nariz, por ejemplo ENTRE LA PARTE MÁS EXTERNA DE AMBOS PÓMULOS.\nLa distancia obtenida, menor de 11 centímetro, es IMPOSIBLE en una imagen por contacto.\nPuede hacer MUCHAS otras mediciones, por ejemplo la línea externa del cabello desde un lado al otro lado de la cabeza, etc,etc, etc. TODAS las medidas que obtenga serán IMPOSIBLES en una imagen de contacto, porque la imagen NO ES POR CONTACTO.\nCarlos\n\n","date":"July 10, 2012 at 5:10 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13679","author":"corneliotel","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"I agree that the idea that the image would be only a contact point process really seem irrelevant versus the Shroud.  But in the case the cloth was very loosely draped over the body and ONLY the highest points of the frontal body, like the face the hands and the knees, were touching the cloth without touching the sides of the body, I’m not so sure that there could not have been some direct contact process involved in the image formation process…  It far from being proven that the shroud was tightly bound around the body (with linen strips maybe) at the moment the body image was formed…\n\n","date":"July 11, 2012 at 7:55 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13761","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"To be more understandable, I’ll write again my first phrase : I agree that the idea that the image would be only a contact point process really seem irrelevant versus the Shroud. But in the case the cloth was very loosely draped over the body and ONLY the highest points of the frontal body, like the face, the chest, the hands and the knees, were touching the cloth and, at the same time, the cloth wasn’t touching the sides of the body, I’m not so sure that there could not have been some direct contact process involved in the image formation process…\nRemember that we are not sure at all of the exact configuration of the Shroud at the moment the image were formed and the 2 studies that were done on the subject (one by STURP and the other by Latendresse) seem to suggest that the cloth was not tight around the body but, on the contrary, it was more probably pretty loose over it.\n\n","date":"July 11, 2012 at 7:59 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13762","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"\nRon :\n“Resolution is consistent with gaseous diffusion given a close corpse-Shroud configuration’ ….Please lets stay real here! Where is this consistence evidence?\n\nDiffusion creates a gradient of concentration/density of probability decreasing exponentially with distance (obviously analytical results have other factors depending on plane, radial diffusion) + we should take into acount boundaries contidions (close corps-Shroud configuration)\neg : compare legs and fingers, local gradient depends on radius, what can you see ? a higher resolution on fingers vs legs.\nNow, Ron, what I said, is :\n\nanoxie :\nSo far, based on basic models (plane and radial diffusion) to study gradient concentration, I think the diffusion hypothesis is consistent with image resolution .\nSo far, diffusion can’t be discarded.\n\n","date":"July 10, 2012 at 10:28 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13687","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"Ron (and others skeptics versus Rogers ideas) should read again (with an open-mind) the part of his book where he talk specifically about his hypothesis, particularly the part where he report his preliminary results of some tests he did himself in his home lab.  It show that his hypothesis surely cannot be ruled out for the moment.\n\n","date":"July 11, 2012 at 8:01 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13763","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"I would go further, this hypothesis cannot be ruled out, and is the most consistent with image pattern.\nConcerning diffusion one should keep in mind that :\nRogers :\n“Diffusion does not mean the same thing as “diffuse”.\n\n","date":"July 12, 2012 at 1:07 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13768","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"A solid model describing the motion of amines from the body towards the cloth is still missing. Particularly, the motion of those amines coming from the lungs through mouth and nose. The movement of this amines from the nose to the hair and then towards the cloth to originate a Maillard reaction while providing a high resolution seems to me hard to understand.\nAgain, the only person who seems to have made some initial calculations on this issue is Thimabult. I would reiterate my request to him: is it possible that you share your estimations with us in this blog for a honest discussion?\n\n","date":"July 12, 2012 at 2:30 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13769","author":"Gabriel","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"\nGabriel :\nA solid model describing the motion of amines from the body towards the cloth is still missing.\n\nFick’s laws of diffusion (+ close corpse-shroud configuration) :\nSmaller bend radius explains higher resolution and steeper gradient.\nDiffusion gradient explains no clearcut edge of the image.\nIsotropy is inherent to diffusion.\n\nGabriel :\nParticularly, the motion of those amines coming from the lungs through mouth and nose. The movement of this amines from the nose to the hair and then towards the cloth to originate a Maillard reaction while providing a high resolution seems to me hard to understand.\n\nThe reactive amines should be on the skin.\n\n","date":"July 12, 2012 at 5:08 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-13786","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis","post":"Dear Gabriel and all,\nFor the time being I am not at home.\nI’ll try to find the files you are asking for and also the long message from Rogers explaining all the details of his thought at the end of this week.\nThank you for your patience\nThibault\n\n","date":"July 31, 2012 at 8:04 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","id":"comment-14354","author":"Thibault","site":"shroudstory"}]
