[{"title":"Photomicrographs and More at Mario Latendresse’s Sindonology","post":"Wow… Thanks O.K, for the heads up. thanks Mario for the work put into this. The photo micrographs are one of the most impressive things I’ve seen in a long time. You can even know the exact spot from the links at the bottom of the page. I will probably spend a lot of time chewing on these images.\n\n","date":"January 25, 2014 at 11:46 am","url":"https://shroudstory.com/2014/01/25/photomicrographs-and-more-at-mario-latendresses-sindonology/","cat":"image_theory","id":"comment-74549","author":"Mike M","site":"shroudstory"},{"title":"Photomicrographs and More at Mario Latendresse’s Sindonology","post":"Ditto from above! (Mike M)\n\n","date":"January 25, 2014 at 12:52 pm","url":"https://shroudstory.com/2014/01/25/photomicrographs-and-more-at-mario-latendresses-sindonology/","cat":"image_theory","id":"comment-74553","author":"Annette Cloutier","site":"shroudstory"},{"title":"Photomicrographs and More at Mario Latendresse’s Sindonology","post":"So many photographs, so many images and no real advances in Shroud studies. This is looking like the field of Bible translations, with one translation claiming to be better than another one, several kinds of criticism, allegorical reading, cabala, esoteric interpretation and what not. Since the relic itself is not available for fresh examination we will have to rely on historical research and archaeological findings. The Dead Sea Scrolls were very helpful in understanding the transition from Second Temple Judaism to Rabbinic Judaism and Christianity.\n\n","date":"January 25, 2014 at 2:43 pm","url":"https://shroudstory.com/2014/01/25/photomicrographs-and-more-at-mario-latendresses-sindonology/","cat":"image_theory","id":"comment-74564","author":"Louis","site":"shroudstory"},{"title":"Photomicrographs and More at Mario Latendresse’s Sindonology","post":"Maybe one needs to have a research perspective fully to appreciate the potential of these image-analysis tools. And when I say “research” I mean open-ended, agenda-free, non ideology-knocking research that simply looks for new handles on old problems. I especially like the possibilities suggested in that “find edges” facility, and the fact that it finds none on the Shroud, at least for what matters, i.e.body image (blood stains excepted, since they could have been added later). \nProbably few would have challenged the view that the Shroud image was fuzzy, but how does one measure fuzziness from a model-builders standpoint especially when the latter are being told, indeed, here on this very site (permanent fixture, pdf, margin)  that their existing technology generates excessive contrast, read over-sharp edges and/or excessive density gradients (never mind the template, just feel the thickness of the result)? \nI for one will go back to Mario’s site for insights into how edges are detected, with a view to finding whether it’s a truly objective process, or whether it relies upon some arbitrary cut-off points or other criteria, e.g. rate of change of pixel density per unit length, meeting meets (or failing to meet) some arbitrary pre-set criterion. Either way, it’s good to have a measure, or even a provisional either/or test, of fuzziness, that being a prime, albeit rarely highlighted characteristic of the Shroud image.\n\n","date":"January 25, 2014 at 3:29 pm","url":"https://shroudstory.com/2014/01/25/photomicrographs-and-more-at-mario-latendresses-sindonology/","cat":"image_theory","id":"comment-74569","author":"colinsberry","site":"shroudstory"}]
