[{"title":"Photomicrographs and Stochastic Imaging","post":"” For some reason it has been distorted into a 320 by 320 square in Colin’s blog (not that this seems to make any difference for the purpose at hand).”\nI have a slow copper-cable internet connection where I am at present that frequently louses up my attempts to edit or even insert images. It happens mainly in the evening (or screening of World Cup matches). I shall try re-loading the graphic to restore its original proportions.\n\n","date":"June 17, 2014 at 3:27 am","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","id":"comment-130163","author":"Colin Berry","site":"shroudstory"},{"title":"Photomicrographs and Stochastic Imaging","post":"Fixed. Thanks Dan for pointing out the glitch.\n\n","date":"June 17, 2014 at 3:33 am","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","id":"comment-130164","author":"Colin Berry","site":"shroudstory"},{"title":"Photomicrographs and Stochastic Imaging","post":"Thibault Heimburger : “If there is a stochastic process, it is at thread level and not only at fiber level.”\nStochastic process at a thread level, seriously ?!?\nAuthors mistake “stochastic” for “unknown”. And I don’t see why this process should not be totally deterministic.\n\n","date":"June 17, 2014 at 8:51 am","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","id":"comment-130210","author":"anoxie","site":"shroudstory"},{"title":"Photomicrographs and Stochastic Imaging","post":"Can someone please explain how Stochastic FM frequencies  create a 3D image?\n\n","date":"June 17, 2014 at 10:42 am","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","id":"comment-130227","author":"HSG","site":"shroudstory"},{"title":"Photomicrographs and Stochastic Imaging","post":"?\n\n","date":"June 17, 2014 at 11:48 am","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","id":"comment-130242","author":"anoxie","site":"shroudstory"},{"title":"Photomicrographs and Stochastic Imaging","post":"reproducing the shroud using FM screening you’ll get 3d as well.\n\n","date":"June 17, 2014 at 12:00 pm","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","id":"comment-130253","author":"anoxie","site":"shroudstory"},{"title":"Photomicrographs and Stochastic Imaging","post":"How do you interpret the screening of the image we see on the Shroud? Do you believe that the image is random stochastic FM screening or AM screening? \nLooping the original prints of the 16×20 black and white image of the Enrie photo I see a prism (a Term we use for Lines Per Inch varying screen angles for security printing. Ours are set at 135º converging with another at 45º). The image formation is represented by dots per inch. (low resolution dots per inch since it is less than news print). \nMy own interpretation of this image, I would explain that the Shroud is consistent with AM screening of LPI and DPI with varying frequencies. This image mechanism is why it produces such a good 3D rendition. I don’t believe we can get the same results if the Shroud was an image mechanism of random high resolution FM screening.\n\n","date":"June 17, 2014 at 12:45 pm","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","id":"comment-130274","author":"HSG","site":"shroudstory"},{"title":"Photomicrographs and Stochastic Imaging","post":"Actually I think the shroud is consistent with AM screening with varying frequencies resulting in a higher contrast and sharper 3D than a high resolution FM screening.\nBut “stochastic FM screening” is misleading, it is not a stochastic process but a pseudo-random distribution of dots. On the TS, the grid is the linen and contrary to a stochastic process, i think the key is a varying threshold.\n\n","date":"June 17, 2014 at 1:37 pm","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","id":"comment-130287","author":"anoxie","site":"shroudstory"},{"title":"Photomicrographs and Stochastic Imaging","post":"When you say varying threshold, are you talking about the herringbone weave’s in and out pattern which creates depth? or are you talking about frequency densities?\n\n","date":"June 17, 2014 at 1:47 pm","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","id":"comment-130295","author":"HSG","site":"shroudstory"},{"title":"Photomicrographs and Stochastic Imaging","post":"frequency densities, fibers properties.\n\n","date":"June 17, 2014 at 1:56 pm","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","id":"comment-130300","author":"anoxie","site":"shroudstory"},{"title":"Photomicrographs and Stochastic Imaging","post":"Thank you.\n\n","date":"June 17, 2014 at 1:58 pm","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","id":"comment-130301","author":"HSG","site":"shroudstory"},{"title":"Photomicrographs and Stochastic Imaging","post":"The prism is represented by the linen’s converging angles\n\n","date":"June 17, 2014 at 12:51 pm","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","id":"comment-130275","author":"HSG","site":"shroudstory"},{"title":"Photomicrographs and Stochastic Imaging","post":"Anoxie wrote: “Thibault Heimburger : “If there is a stochastic process, it is at thread level and not only at fiber level.”\nStochastic process at a thread level, seriously ?!?”\nI agree that this particular sentence is misleading. But reading my entire comment, you should have understood what I meant.\nI do not think that the image formation process is a stochastic process.\nThe true question is: how can we explain the surface distribution of the color ?\nYou wrote:” But “stochastic FM screening” is misleading, it is not a stochastic process but a PSEUDO-RANDOM distribution of dots.” and “….”varying threshold” and “fibers properties”\nCould you please explain in detail ?\nIn addition, I completely disagree with Colin.\nI repeat: the distribution of the image color is not consistent with any kind of scorch, even if one takes into account ageing etc..\nThis has been shown in :\nhttps://shroudofturin.files.wordpress.com/2014/04/scorch-2-eng-final.pdf\nMore later.\n\n","date":"June 18, 2014 at 4:06 pm","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","id":"comment-130895","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Photomicrographs and Stochastic Imaging","post":"“This has been shown in :\nhttps://shroudofturin.files.wordpress.com/2014/04/scorch-2-eng-final.pdf”\nNothing is “shown” unless opened up to debate. Pdfs do not open up to debate. Criticizing others via pdfs is a means of evading both online counter-criticism or more formal peer review.\nPersonally speaking, I can scarcely be bothered to read pdfs any more – they occupy a nether world between public and private domain, and at best qualify as vanity publications in my mind.\n\n","date":"June 18, 2014 at 5:03 pm","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","id":"comment-130920","author":"Colin Berry","site":"shroudstory"},{"title":"Photomicrographs and Stochastic Imaging","post":"Colin, re PDFs;  Unless the PDF is ‘secured’, any that may capture your interest could be downloaded and saved and then you could add comments highlighting text, and use the ‘Add sticky note’ tool; maybe forward it back to the author.  This would deal with your objection that they “occupy a nether world” and provide the discussion forum you say is needed.\n\n","date":"June 18, 2014 at 6:11 pm","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","id":"comment-130952","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Photomicrographs and Stochastic Imaging","post":"Thanks daveb, but that’s too complicated for simple souls like myself. Neither does it guarantee that one’s comments get to be seen.\nI did suggest to TH many moons ago, in an email, that he set up his own blog, a matter of a few clicks, not realizing at the time that he had already set up a Shroud-based website in 2005, quite a polished one, that immediately went into dormant mode, for “lack of time” I gather. \nhttp://www.suaire-science.com\n If TH has time to do hands-on research and write critiques of others’ findings and ideas as pdfs that gets cited here, wiki and elsewhere, might one politely suggest he’s time to post them to sites, his own or someone else’s, in a form that invites and allows discussion.\n\n","date":"June 19, 2014 at 2:14 am","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","id":"comment-131106","author":"Colin Berry","site":"shroudstory"},{"title":"Photomicrographs and Stochastic Imaging","post":"You’re the chemist Thibault, the issue is complex and i may remind you i’ve been waiting for two years your views on the potential reactants.\nSo let’s start with physics, if you consider a gas solid reaction, the surface of the fiber is critical, fibers are heterogeneous and surfaces more or less cracked resulting to a different sensitivity to induction phase allowing the autocatalytic reaction and reaction completion. This is one parameter of the “varying threshold” of reactants leading to the coloration of a given fiber.\n(You can consider a genuine stochastic fm screening but usually it refers to a printing technique where “stochastic” is pseudo random and not a genuine physical/chemical stochastic event.)\n\n","date":"June 18, 2014 at 5:23 pm","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","id":"comment-130930","author":"anoxie","site":"shroudstory"},{"title":"Photomicrographs and Stochastic Imaging","post":"If we believe Rogers, the surface of the colored fibers is much more cracked than non-colored fibers, which is, to him, an indication of a dehydration process that probably involved only a thin layer of impurities and I remind you that such a layer has good chances to be UNEVEN and NON-HOMOGENUOUS at the surface of the Shroud, which offer a good explanation for why there are some bundles of colored fibers right next to bundles of uncolored fibers, especially when we understand that this particular observation has been more often reported in zones where we can expect that there was a direct-contact between the corpse and the cloth.  In other words, for me, the best explanation for the observation of bundles of colored fibers right next to bundles of uncolored fibers is the presence of a uneven and non-homogeneous layer of carbohydrate impurities that would have been the only thing yellowed by the image formation process, which can well have been stochastic in nature because, in the face of all the pertinent data coming from the Shroud, this process could well have been very mild with only a tiny amount of energy involved and happening at normal temperature.  That’s what me, Fazio and Mandaglio think.  Note that the discontinuous distribution of colored fibers is enough to reject any image formation hypothesis involving a high amount of energy… That’s important.\n\n","date":"June 19, 2014 at 9:06 am","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","id":"comment-131224","author":"Yannick Clément","site":"shroudstory"},{"title":"Photomicrographs and Stochastic Imaging","post":"Ruling out “high amount of energy.” In your opinion. I think there is room for some skepticism about that conclusion.\n\n","date":"June 19, 2014 at 10:16 am","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","id":"comment-131256","author":"Dan","site":"shroudstory"},{"title":"Photomicrographs and Stochastic Imaging","post":"It’s not only MY opinion.  It is the opinion of authentic experts in radiation, namely Fazio, Mandaglio and Ray Rogers.  I don’t know one good reason to discredit their conclusions that the Shroud image cannot have been formed by an event that released a high amount of energy.  You should note Dan that Fazio and Mandaglio came to this very same conclusion as Rogers, while working completely independent of him, which in science, it is something that gives much more credit to the conclusion reached…  Again, the fact that all these experts in radiation came to the very same conclusion is good enough for me.  I don’t need to look in that direction to find the answer to the image because I know that this is not where I can find it.\n\n","date":"June 19, 2014 at 10:52 am","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","id":"comment-131276","author":"Yannick Clément","site":"shroudstory"}]
