[{"title":"Poor Leonardo must be turning over in his grave","post":"It is most likely Leonardo Da Vinci had access to either the Veronica (The actual Veil of Manoppello) or the Turin Shroud as a member of the secret society of Artists called The Knights of The Mist.\n\n","date":"November 23, 2011 at 9:01 am","url":"https://shroudstory.com/2011/11/23/poor-leonardo-must-be-turning-over-in-his-grave/","cat":"image_theory","id":"comment-4946","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Poor Leonardo must be turning over in his grave","post":"It is also most lilely that Leornado Da Vinci’s sfumato technique owes much to the Man of the Shroud…\n\n","date":"November 23, 2011 at 9:06 am","url":"https://shroudstory.com/2011/11/23/poor-leonardo-must-be-turning-over-in-his-grave/","cat":"image_theory","id":"comment-4947","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Poor Leonardo must be turning over in his grave","post":"St. Catherine’s monastery in the Sinai?? Wow, a clue!  Why does DaVinci always get blamed for everything… it’s gotten to the point where, if DaVinci’s name comes up, I really don’t want to hear it because this guy couldn’t possibly have done all the stuff he gets credit for. \nBut this monastery… maybe they should be looking into that more. Maybe it was a monk at the monastery who made the shroud. That would be more likely: some hidden monastery in some remote place with some secret monk who used to be a mad scientist chemist magician before he converted. A place so remote that the REAL truth about the Shroud could be forever sealed. \nDaVinci’s workshop was far too public: people would have known. But I think the conspiracy theorists should investigate this monastery. Who knows what other relics this mad scientist chemist magician monk was able to turn out; all in the name of promoting the faith?  \nI should write a book, I think I’m onto something… :D\n\n","date":"November 23, 2011 at 12:20 pm","url":"https://shroudstory.com/2011/11/23/poor-leonardo-must-be-turning-over-in-his-grave/","cat":"image_theory","id":"comment-4951","author":"AnnieCee","site":"shroudstory"},{"title":"Poor Leonardo must be turning over in his grave","post":"You two can try to present your very “creative” theories at the next International Conference on The Shroud of Turin in Valencia (Spain), April 28-30 2012 http://www.linteum.com/\n\n","date":"November 23, 2011 at 5:03 pm","url":"https://shroudstory.com/2011/11/23/poor-leonardo-must-be-turning-over-in-his-grave/","cat":"image_theory","id":"comment-4955","author":"Gabriel","site":"shroudstory"},{"title":"Poor Leonardo must be turning over in his grave","post":"Thanks Gabriel for this information !  It’s the first time I heard about this conference…\n\n","date":"November 23, 2011 at 5:45 pm","url":"https://shroudstory.com/2011/11/23/poor-leonardo-must-be-turning-over-in-his-grave/","cat":"image_theory","id":"comment-4957","author":"Yannick Clément","site":"shroudstory"},{"title":"Poor Leonardo must be turning over in his grave","post":"Anyone notice (in the video), on their ‘precise overlay’ the eye locations are off? LOL and by miles folks!! They are either blind or are blinded by their bias. These people are a joke and anyone who even contemplates anything they say are simply just gullible.\n The Pantocrator located in the St.Catherine’s monastery is just one other ‘proof’ that the Shroud is authentic and most likely was at one time the artifact known as the Mandilion….Also no mad scientist Monk could have possibly created the Shroud image(s), that has been overwhelmingly proven by science…The Shroud is definately not man made!…It may be a freak of nature as some propose or as I believe it is a testament left by God himself of his love for us, but definately not manmade.\nR.\n\n","date":"November 25, 2011 at 4:24 pm","url":"https://shroudstory.com/2011/11/23/poor-leonardo-must-be-turning-over-in-his-grave/","cat":"image_theory","id":"comment-5015","author":"Ron","site":"shroudstory"},{"title":"Poor Leonardo must be turning over in his grave","post":"Sorry should read; Mandylion, or better known as the Image of Edessa.\nR.\n\n","date":"November 27, 2011 at 7:19 pm","url":"https://shroudstory.com/2011/11/23/poor-leonardo-must-be-turning-over-in-his-grave/","cat":"image_theory","id":"comment-5046","author":"Ron","site":"shroudstory"}]
