[{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"Great quote from Rogers ! :-)\nHaving read carefully just about everything published by Rogers about the Shroud, there’s one particular quote from him that stand over every phrases he ever wrote about his hypothesis and it’s this one :  “When amines and reducing sugars come together, THEY WILL REACT.  THEY WILL PRODUCE A COLOR.  This is not an hypothesis: this is a fact.” (A Chemist’s Perspective on the Shroud of Turin, page 108). \nSince it is a FACT that there is reducing sugars on the surface of the Shroud (starch found by McCrone and confirmed by Rogers and also pectin sugar found by Adler), to denied that the Maillard reaction had nothing to do with the body image on the Shroud, someone has to believe that the dead body that was brutaly tortured for many hours prior to death didn’t emit ANY gas at all during the first 36-40 hours after death (i.e., before the arrival of the first signs of liquid from putrefaction).  No ammoniac gas at all, no putrecine gas, no cadaverine gas, no nothing !  I think someone must have a very great faith to believe that !\nThat’s why I agree with Dan that the Maillard reaction, in the present state of our knowledge of the Shroud, is the hypothesis that got the most solid base, scientifically and logically speaking.  I think the probability that the gaseous diffusion proposed by Rogers took at least some part in the image formation process is VERY high.  Now, to say that, alone, it can account for the totality of the image, I still have serious doubts, mainly because of the problem with the high resolution of the images.  That’s why my reflection on the subject lead me to think that the solution to the mystery must be seek in an hybrid process (acting partially by direct contact and partically by a diffusion).  I think the Maillard reaction is responsible for the diffusion part and a bit also of the direct contact part but I think there’s a missing piece of the puzzle that was acting mostly in direct contact and that is responsible for the high resolution of the body images.  I have personally some ideas of what could be this missing piece of the puzzle but since I’m no expert, it’s surely not me who will do scientific experiment in a laboratory to check out my ideas ! ;-)\nThere’s one important fact about the body images on the Shroud that is not often publicize :  The parts of the image that get the highest resolution are all parts that were most likely in DIRECT CONTACT with the body.  I think this fact is too often forgotten.  I think the reason is that people tend to focus only on the fact that some parts of the image were formed while those areas of the Shroud were probably away from the body.  Since this property of the images is one of the most awesome feature, I think that’s why people tend to focus only on this aspect and forget that most of the images (some say 80%) were probably formed by DIRECT CONTACT.  If someone doesn’t agree with me that the image was mainly formed by direct contact, tonight, when you’ll go asleep, just noticed what’s the proportion of your body that is in direct contact with your blanket !!!  It was THE SAME THING for Jesus when he was in the Shroud !  So, for me, I really think this high resolution thing is somewhat misunderstood a bit because I think most of the image (especially the parts with the highest degree of resolution) came from a direct contact process and not from a diffusion process.  And it is well known that it’s easier to obtain high resolution in a direct contact context than in a diffusion or projection context.\nSo, my perception (of course, I can be wrong) is this :  A part of the Shroud images came from some kind of a vertical projection process, yes.  But I think a greater part of the images came from a direct contact process and it was this unknown process that can account for the high resolution of the body images.  That’s where my reflection has lead me.  Of course, everyone is free to believe otherwise… ;-)\n\n","date":"November 20, 2011 at 7:14 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4904","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"The body was in the tomb most likely a maximum of 36 hours but who is to say the image didn’t form an hour after being entombed? Before any gases were released in any relative quantity?\nI cannot agree that 80% of the body image was due to direct contact, it was far less. The body was in rigor, when you go to sleep tonight try to simulate the posture of the man on the Shroud, then come back and tell us 80% of the sheets have contact~that is one stretched theory. The milliard reaction theory I think fails not only to explain the high image resolution but how a gas or gases could possibly only effect the top-most fibrels on each and every fiber, without effecting the whole circumference of the fibrels….seems impossible to me as does a gas traveling thru as much as 4cms’ of air and leaving a precise image of a man…the gases would diffuse much to widely…I’m no expert and I may have this gas thing all wrong but common sense tells me otherwise.\nRon\n\n","date":"November 25, 2011 at 5:11 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-5018","author":"Ron","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"Ron, you wrote : “I’m no expert and I may have this gas thing all wrong but common sense tells me otherwise.”\nRogers was my friend…  He explain his hypothesis with great profesionnalism in his book.  Why don’t you just leave that door open for the moment ???  I don’t ask you to favored this hypothesis.  I just ask you to be open-minded a bit about it.\nAnd remember also that this is not because some gaseous diffusion could have been at work in the Shroud that nothing else could not have been active also !  And remember also that we don’t know all the conditions that prevailed before the death of Jesus, during the wait until his body could reach the tomb and after that, in the tomb !  Since we don’t know everything, we must leave the door open to some “special” conditions that could have favored a better body imprint than in “normal” conditions.  Who knows ?\nAnd for the 80% estimation for the proportion of the body that was in direct contact with the Shroud, I’ve read it in a french book on the Shroud this summer and it came from Marcel Alonso, who’s a well-known Shroud researcher in Europe.  Even if I’m not sure about the exactness of this estimation, I agree with him that the majority of the body must have been in direct contact with the Shroud (with a large spectrum of slight differences in pressure).  Rigor mortis or not, to think that most of the Shroud wasn’t in direct contact (at various degrees) with the corpse, we have to think that it was stretched out strongly (almost flat) over the dead body or, even worse, that the body levitated in the air while the 2 parts of the Shroud didn’t touched at all the body and were stretched completely flat in the air (like the hypothesis of Lavoie) !!!  \nOn the contrary, the work of STURP (with a confirmation study made by Mario Latendresse for the frontal part over the waist) have showned that it was possible that the body images were formed while the Shroud was drapped naturally and kind of loosely (without being tied with ropes) over the body.  This kind of configuration made it quite clear that the Shroud would have touched (with different level of pressure) the body in a majority of places, especially true for the frontal part of the Shroud.  And even the back part would have touched to at least the feet, the buttocks, a good portion of the back and probably a good portion of the back of the head.  In this context, and if we forget to consider the sides of the body of course, I doubt that the proportion of direct contacts would be under 70%…  And I’ve never been so sure about the 4 cm estimation reached by the STURP team because I always tought that there was not many places where there really was a distance so high between the Shroud and the corpse, except probably the region of the back of the knees.  I think Latendresse estimation that after 2 cm, the image formation process had lost over 80% of his capacity is much more closer to the truth and I even have a tendency to think that beyond 2 cm, no color at all was formed.  That’s what I think because of my estimation that the Shroud was pretty close to the body almost everywhere (except the back of the knees). \nWho knows ?  Maybe the image formation process was so subtle that a slight difference in the kind of direct contact (difference of pressure) could had an important effect on the darkness of the image that was formed ?  Since we don’t know the real image formation process, I think this idea should not be discard too fast…\n\n","date":"November 25, 2011 at 10:32 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-5022","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"In my comment below, when I wrote “Rogers was my friend”, I hope you understand that I meant “Rogers was an expert, my friend Ron” !!!  :-)\nOf course, I never had the chance to meet Ray Rogers personally or even talk with him via emails…  And I should say that it’s just too bad !\n\n","date":"November 25, 2011 at 10:35 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-5023","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"Rigor mortis y produccion de aminas cadavéricas ( cadaverina , putrescina etc) son INCOMPATIBLES.\nSólo cuando desaparece el rigor mortis se inicia el proceso de descomposición.\n\n","date":"November 20, 2011 at 7:42 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4905","author":"co","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"……Y sin DESCOMPOSICIÓN NO HAY REACCIÓN DE MAILLARD.\n\n","date":"November 20, 2011 at 7:44 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4906","author":"co","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"Nice comment but is there real scientific proof of what you say Carlos ?  Bring me a scientific reference for the fact that no amines at all can be produced while the body is in rigor mortis and I will believe you.  Don’t forget that even if no putrecine or cadaverine were released by the body, I think it is well known that ammoniac gas can be released pretty soon by a corpse.  And if there was any ammoniac gas released inside the Shroud, it if a fact that this gas would have react with the surface of the Shroud to form a coloration that look pretty much like what is on the Shroud (here, I just talk about the coloration and not the other properties of the images).  \nHaving said that, here’s some question for you : Do you know one particular scientific paper that was published on this subject and can scientifically proof what you said (even for the ammoniac gas) ?  Do you know if this article have been published in a peer-reviewed journal ?  Do you know if the conclusions from this article have been confirmed by other studies ?   \nI’m curious about your statement that no gas at all can be released by a corpse while he his still in rigor mortis.  I found your comment interesting but I surely have great doubts about that until you bring me some hard scientific facts that can back up what you said.\n\n","date":"November 20, 2011 at 8:12 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4907","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"If the Maillard or a similar biochemical reaction followed by a few years of ageing is responsible for the formation of the image, hasn´t anybody tried to reproduce it? I mean, if we are talking about amines and sugars plus blood and sweet you don’t need a human body to reproduce it. It should work also almost with any dead animal…..Just get a pork or a lamb killed a couple of hours ago, sprinkle it with blood and sweat and wrap a linen around it during 36 hours at a temperature of 10-12 ºC. Then get that linen and keep it in the oven for some minutes (a standard procedure to simulate ageing) and see what happens!!\nIt could be an interesting experiment and if carried out under a minimum level of external and independent supervision could be most interesting. This experiment is neither expensive nor needs specially sophisticated instrumentation………and could be published in a peer-review journal.\n\n","date":"November 20, 2011 at 8:27 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4908","author":"Gabriel","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"I read somewhere (my memory fails me) that someone did attempt a similar experiment. They used a manniken filled with heated water to simulate the body temp. Had the body covered in sweat and some other products, exactly what fails me again…It failed apparently to re-produce a similar image, that’s all I remember. Maybe Dan or someone else has heard of this experiment and can chime in.\n\n","date":"November 25, 2011 at 4:55 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-5017","author":"Ron","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"A manniken is not a real dead corpse Ron.  Someone should try to make some tests with real animal cadavers but I’m not sure if that would be relevant.  To do so, the animal must have been tortured before (to simulate a tortured and crucified person) and surely would not want that to happen !  Also, as I said, the fabrication of the linen cloth should be done like it was done in Antiquity and I’m not so sure if it is easy these days to find someone who make linen cloth the ancient way…  I don’t think it would be easy to find a sample like that.  If you do this with modern linen, Rogers have said it many times : your experiment is wrong from the beginning.\n\n","date":"November 25, 2011 at 9:37 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-5021","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"Nice remark Gabriel !  I don’t think anybody has ever done any kind of experiment like that…  If you know a scientist around you, must be interesting to submit him your idea of research.  The best would be to find a chemist or a biochemist to do this kind of experiment.  And this kind of experiment should be done on linen cloth prepared the ancient way (as describe by Pliny the Elder).  If it’s not done with this kind of linen (for example, if it is done on modern linen), the results could not be compared to the Shroud…  This is very important to remember.   \nAnd if you can buy Rogers book, you’ll see that he did some interesting experiment with a piece of linen prepared the ancient way (it’s important because this way, there’s really a thin sugar coating that is present at the surface of the linen).  He submit this piece of cloth to an ammoniac vapor for 10 minutes and then, leave it at room temperature for 24 hours.  After some heating (to simulate aging), he obtain a result that his very close to the Shroud coloration.  Of course, the few other experiments done by Rogers were not able to clearly reproduce a body part on linen with a real 3D property like the Shroud and with a very high resolution but I’m not fool enough to believe that he had time to fully test his hypothesis before he died.  Remember that he came back to the Shroud science only around 2000 and he died in 2005.  That’s not very long to develop and test an hypothesis like that !  One thing’s for sure : more tests need to be done to completely check out this hypothesis !  And unfortunatelly, as I know, those tests still wait to be done.  This is surely due to the fact that sindonologists have other interesting things to do, like making UV laser tests on linen !!! ;-)\n\n","date":"November 20, 2011 at 8:57 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4909","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"Ray Rogers is right to a certain extent. The fact is he just ignores the specific ritual the corpse was subjected to. You just cannot explain the image formation process without referring to the archaeology of the burial of the Man of the Shroud.\n\n","date":"November 22, 2011 at 12:25 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4928","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"Patrick, I agree with what you say about the lack of information that we have regarding the exact conditions (environmental, biological, etc.) of Jesus Passion, death and burial.  It’s very true that all those conditions could had a profond impact on the image formation mechanism (or mechanisms).  Since it is IMPOSSIBLE to know for sure all those conditions, future scientific researches about a natural image formation process will be a very hard task !  Those kind of researches will need a lot of tests made in very different conditions to find what I call “the good recipe” !  This is one important reason that explain why there’s no research in this field right now.  The task is very difficult…  Because of all the unknown regarding Jesus Passion, death and burial, I even think that maybe we never be able to find this correct “recipe”…  But still, research need to keep on !\n\n","date":"November 22, 2011 at 2:08 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4930","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"I am convinced the image formation process is due to a specific (Judean) burial ritual (in conjunction or not with the corpse still being in hyperthermy).\n\n","date":"November 23, 2011 at 4:42 am","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4941","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"Aunque Barry no lo tenga recogido en su web (creo), Giulio Fanti respondió a la hipótesis de difusion gaseosa de Rogers:\nhttp://www.dim.unipd.it/fanti/diffusion.pdf\n\n","date":"November 22, 2011 at 9:08 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4933","author":"co","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"Personally, I don’t think the diffusion hypothesis of Rogers can explain everything but I’m convinced it did took part (in what proportion, I don’t know) in the image formation process.  I just can’t believe the corpse didn’t emit any gas at all during the 36-40 hours that he was wrapped in the Shroud.  And if he emit some gas, then a part of the image formation process was due to those gas…  Fanti can claim what he want to defend his own hypothesis, I prefer to believe in an expert like Rogers.  But I repeat :  I don’t think the diffusion hypothesis can explain every aspect of the images.  Something else must have been include in the process and this something has not been found yet.  It must have come from something on the skin that operate mainly by direct contact (but maybe also at a very short distance by a molecular transfer).  One thing’s for sure in my mind :  it is something natural that came from the corpse or, as Max said, something that was put on the skin during the burial rite.\n\n","date":"November 23, 2011 at 9:37 am","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4948","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"Y la ausencia de signos de difusión gaseosa (5.7a No signs of gas exhalation on face image) se reiteraba en:\n“The death of the Shroud Man: an improved review” 2008\nhttp://ohioshroudconference.com/papers/p07.pdf\nEs de hacer notar que uno de los coautores, Delfín Villalaín, es catedrático de Medicina Forense.\n\n","date":"November 22, 2011 at 9:38 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4934","author":"co","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"I think this paper misunderstood greatly the diffusion process.  I’m not convinced at all that somebody can prove that there is no signs at all of a gaseous diffusion process in the body images on the Shroud.  Look at Rogers experiments published in his book and you’ll see that the result is not so far from what we see on the Shroud…\n\n","date":"November 23, 2011 at 11:46 am","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4950","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"I do agree. It does not come from the corpse.\n\n","date":"November 23, 2011 at 4:26 am","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4938","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"Meaning it is not natural.\n\n","date":"November 23, 2011 at 4:44 am","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4942","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"However the corpse tightly wrapped up in the Shroud did leave a heat transferable decalcomania-like imprint…\n\n","date":"November 23, 2011 at 4:33 am","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4939","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"Facts are undeniable….\n\n","date":"November 23, 2011 at 4:36 am","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4940","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"I repeat: I am convinced the image formation process is due to a specific (Judean) burial ritual (in conjunction or not with the corpse still being in hyperthermy).\n\n","date":"November 23, 2011 at 4:47 am","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4943","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"On October 31, 2011 at 4:55 am | #24, I wrote:\nDevemos tener en cuenta del muy especifico ritual adoptado (una fumigacion del cadaver con la Sabana banada de une solucion acuosa) y/o tambien de la temperatura possiblemente elevada del cadaver…\n\n","date":"November 23, 2011 at 5:26 am","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4944","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"Carlito, que piensas?\n\n","date":"November 23, 2011 at 5:29 am","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4945","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"Desde 1900 han sido muchos los intentos de obtener imágenes por CONTACTO remedando las posibles condiciones del enterramiento.\nVignon, Colson y Delage, Judica Cordiglia, Romanese, Rodante, utilizaron diversas combinaciones, vapores de amoniaco, aloe, mirra, sudor y sangre, otras especies aromáticas que pudieran haberse utilizado ( dalla y rhusumah), diversos grados de humedad,etc, etc.\nTODAS resultaron un FRACASO al no poder eludir graves y grotescas deformaciones que son INHERENTES al CONTACTO, muy lejos de la calidad FOTOGRÁFICA de la imagen que presenta la Sábana de Turin.\n[fracaso que no han mejorado las pretendidas con pigmentos colorantes por Nickel, Broch, Blanrue o Garlaschelli]\nRogers, junto a Arnoldi, escribía en 2002: “The chemistry of the color does not answer all questions about how the “photographic” image formed”.\nLas imágenes de contacto no pueden eludir la deformación de Mercator.\n\n","date":"November 23, 2011 at 12:27 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4952","author":"co","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"Nobody know the exact position of the Shroud versus the exact position of the corpse. I think it’s prematured to say that it is IMPOSSIBLE to obtain body images like we see on the Shroud with any natural or artificial mechanism operating both by contact (with many degrees of contacts) AND by close promixity.  More tests need to be done with many configurations between a corpse and a Shroud.  I agree with you on one point :  By direct contact only, it seem impossible to obtain images like the Shroud.  I finish by a remark :  The STURP team found some real distorsions in the images even if they are not apparent enough to be easily seen.  And Mario Latendresse confirmed those observations by STURP.  Those analyses showed that the images on the Shroud were probably formed while the cloth was resting naturally loose over the body.    If the draping was really loose over the body (and I don’t have doubt versus this kind of configuration because it fits with a partial rite done on Friday) and if the draping didn’t imply any direct contact with the sides of the body, I don’t think nobody can totally discard some unknown hybrid process that could have operate both by direct contact AND by a gaseous and/or a molecular diffusion).  Since we don’t know the exact “recipe” of the mechanism, we have to keep this door open.  By the way, those studies are enough to completely reject the non sense hypothesis of Lavoie with his levitation of the body ! ;-)\n\n","date":"November 23, 2011 at 2:46 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4953","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"No experimental archaeology has ever been made of a corpse (still in hyperthermy or not) tightly wrapped up into a shroud soaked with water mixed with ash and made to dry up via a myrrhoaleotic fumigation.\n\n","date":"November 23, 2011 at 3:17 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4954","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"Hello Patrick !  Do you have some credible historic document to show that the Jewish burial rite was done the manner you just describe ?  Do you think they put the things you mention just on the Shroud or also on the skin of the dead ?\n\n","date":"November 24, 2011 at 9:27 am","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4967","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"I would like to get more information about this interesting hypothesis…  For you, what was the active reagent present on the body that was able to react with the Shroud (in direct contact zone and also at close distance in non contact zone) to leave an imprint ???\n\n","date":"November 23, 2011 at 5:43 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4956","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"If we let aside imaginative thinking, the question someone might ask himself when it comes to the body images formation on the Shroud is this :  What product(s), whether natural (biological products like gas, sweat, etc.) or artificial (burial products like myrrh, aloes, olive oil, etc.),  could have been present in the Shroud and could have participated in the formation of the images ?\nThat’s the most honest and logical question (if we want to stay scientifically credible) we can ask on this topic before even considering things like UV light, radiation of some kind or things like that.  That’s why I’m open to Max suggestion.  I also know that some members of the STURP team and some other researchers tested different kind of natural hypothesis over the years, but we can’t say that they fully tested them in every possible conditions and configurations.  Also, many biological products have never been tested at all (as I know).  So, there’s room for more researches in this field.\nPersonally, since I don’t believe they had time to do a proper burial rite, I favored the biological products that could have come out of the dead corpse (like gas) or that could have been present on the skin (like sweat and other products that could have been left there by the drying of the sweat).  But even I think it is highly probable that only a dead body was present in the Shroud and nothing else, I don’t close the door completely to the possibility that some burial products could have been also present in the Shroud along with the dead body, even if the analysis by STURP didn’t found anything like that.  Who knows if those products could have taken part of the image formation and cannot be detect no more because of the chemical reaction they produce on the linen cloth (that would have changed their nature) or just because they evaporate with time ?\nSo, I left the door open for this possibility.  But again, the fact that the burial rite was done in a hurry don’t get too well with the idea that those products could have been put on the skin of the corpse or on the Shroud surface…  St-John mention a mix of myrrh and aloes, but many biblical scholars like Raymond Brown favored the use of those products in a solid state and just being put around the Shroud (or under it) to avoid bad smelling, because the participants knew they had to come back inside the tomb on Sunday morning to finish the rite properly.  That’s exactly what I think too and that would explain why the STURP team didn’t found any traces of aloes and myrrh in their analysis…\n\n","date":"November 24, 2011 at 11:32 am","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-4972","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin","post":"\nYannick Clément :In my comment below, when I wrote “Rogers was my friend”, I hope you understand that I meant “Rogers was an expert, my friend Ron” !!! :-)\nOf course, I never had the chance to meet Ray Rogers personally or even talk with him via emails… And I should say that it’s just too bad !\nGot it!\n\n","date":"November 26, 2011 at 4:57 am","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-5026","author":"Ron","site":"shroudstory"}]
