[{"id":"comment-11944","author":"the_deuce","post":"Those other paintings of Christ naked are interesting, though I don’t think they make good counterexamples, since they are rather obviously based on the Pray Codex itself, or otherwise based on the same source as the Pray Codex, either directly or indirectly, so they would share the same “excuse” for depicting Him that way..","date":"2012-06-05","mins":"10:22 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-8012","author":"the_deuce","post":"The forked beard and overall shape of the face stand out the most to me..","date":"2012-02-06","mins":"11:00 pm","url":"https://shroudstory.com/2012/02/06/another-justinian-this-one-circa-652/","cat":"art","title":"Another Justinian, this one circa 652"},{"id":"comment-11990","author":"the_deuce","post":"No blood trails on the forearms, hair or elsewhere, no scourge marks, no swollen cheek, no wrist wound Because clearly the artist didn’t think Jesus had been scourged or crucified…..","date":"2012-06-06","mins":"9:03 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-11993","author":"the_deuce","post":"We cannot analyse one element alone and then, analyse another element alone. No, we have to look at the WHOLE PICTURE AT ONCE ! And what it the whole picture ? Exactly. I think it can be argued within reason that the Codex wasn’t *directly* copied from the Shroud, but the people who persuade themselves that there is no connection between the two at all, simply because they can find some of the individual elements in different contexts, are simply deluding themselves, imo. It’s like finding a written work and conjecturing that it was created by random banging on a keyboard because you’ve seen all the same letters elsewhere. The confluence of the naked Christ and his general appearance, hidden thumbs and long fingers, hands crossed over the genitals, and long shroud establish the connection. The question from that point is which direction the connection is in (I consider it more plausible that the Shroud was the ultimate source for a number of reasons). The L shape and herringbone pattern wouldn’t be significant on their own, imo, but they become suggestive in light of the connection established by the other factors..","date":"2012-06-06","mins":"9:24 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"}]
