[{"author":"the_deuce","post":"Hi, Stephen,It occurs to me that, while there is no contradiction between the Shroud and the Gospel accounts, the fact that so many people perceive such a conflict, by taking a naive reading of the Gospels as a fully exhaustive account, offers further evidence that the Pray Codex is based on the Shroud.The Codex depicts a single long cloth under the body and wrapped (or about to be wrapped) over top of the head, like the Shroud. However, a naive reading of only the Gospels themselves, and taking the Gospel descriptions as an exhaustive description of the cloths, would tend to give a different impression. It seems very unlikely that the artist would have drawn the burial cloth the way he did based only on the Gospel accounts, without additional information to go on. Together with the naked body, crossed wrists, etc, we have good evidence that the additional information was the Shroud..","date":"2012-07-19","mins":"9:42 PM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n"},{"id":"comment-7919","author":"the_deuce","post":"Hmm, I don’t think that the Edessa link can be dispensed with quite that easily. If the only thing we had to go on was the legend about St. Jude bringing a cloth that Jesus wiped his sweat on to Edessa, then yes, that would be extremely weak, even contradictory. But there are other stories and descriptions that mention there being blood on it for certain, including blood from the spear wound on his side specifically, and that seem to indicate that it was a full length image. There are other descriptions that describe it as a very faint, ghostlike image, and which indicate that the Edessa cloth was stored in a way that it wasn’t totally visible. And there appears to be internal evidence from the Shroud itself that it was kept folded in a way that may have only made the face and upper chest visible. I think you can conclude from the Edessa stories themselves that there was confusion caused by people’ limited knowledge of the image. For instance, the image almost certainly had blood on it, but the story of Jesus merely wiping his face on it was developed by someone who didn’t know that. The story that attributed it to him wiping his face at Gethsemane was developed by someone who was aware of the facial blood and tried to account for it, but wasn’t aware of the blood elsewhere on the Shroud, later attributed to his side wound. Legends that involved Jesus imprinting his whole body by wiping his face were developed by people who realized there was more than just a face there and wanted to explain it, etc. That’s all to say that there are some descriptions of the Edessa cloth that seem to fit an identification with various aspects the Shroud and some that don’t, but also internal evidence from just the descriptions themselves that some of those stories were developed by people who weren’t aware of many of the Edessa cloth’s properties, likely because of the way the cloth was stored and displayed (much as how we didn’t learn about the reverse side image on the Shroud until just a couple years ago!) I don’t think the identification of the two is a lock, but I do think it’s a plausible conclusion, and not based just on pure supposition..","date":"2012-02-04","mins":"10:18 am","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","title":"Calling all history buffs: Interesting comments from Yannick Clément"},{"id":"comment-7931","author":"the_deuce","post":"Yeah, just by looking at the Shroud itself, you can tell that the sides were folded in at about shoulder width, and that it was also folded in half lengthwise several times. I think the idea that there was a copy of the Shroud face that was often shown in its place is plausible to explain the confusion over whether the Edessa cloth had blood on it, but not necessary. The blood stains and their placement don’t become obvious for what they are until you look at the Shroud image in negative and brightened up (and particularly when you see the whole body, front and back). It would be easy for someone peering into only a part of it, stored inside a box with a view hole at the very faint facial image (which is appears to be how the Edessa image was kept) to miss it. And then there’s the circumstantial evidence of Christ Protector, the coins, etc It’s not a complete lock, but there are many disparate puzzle pieces that fit together pretty nicely there..","date":"2012-02-04","mins":"4:28 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","title":"Calling all history buffs: Interesting comments from Yannick Clément"},{"id":"comment-7932","author":"the_deuce","post":"Btw, I thought the image at Taylor Marshall’s place, of what you get if you fold the Shroud along its fold lines, was pretty interesting. The upper chest is still in the picture, but without the context of the rest of the image in view and the aid of photo negativity, you really can’t tell that there’s anything there but the face. Http://cantuar.blogspot.com/2011/05/christs holy image of edessa and is it.html.","date":"2012-02-04","mins":"4:32 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","title":"Calling all history buffs: Interesting comments from Yannick Clément"},{"id":"comment-7983","author":"the_deuce","post":"Yannick: Taking a legendary account like that for a real and pure physical description of the Mandylion is purely speculative… It’s notable in that the account illustrates that they were trying to explain an image with blood on the face, not just possible sweat. And the “side wound” reference illustrates that it had blood on it for certain, and not just on the face, contrary to the impression you’d get just from the version of the story where Christ merely wipes his face on it. HOW IN THE WORLD A CHRISTIAN WRITER COULD LOOK AT THE SHROUD FACE, THEN HE WOULD NOT RECONGNISED THE EVIDENT SET OF BLOODSTAINS COMING FROM A CROWN OR CAP OF THORNS AND CONFUSE THEM WITH THE BLOODY SWEATOF CHRIST IN GETHSEMANE ??? I think it would be quite easy. Take a look at what the Shroud looks like when folded along its fold lines, in which configuration it was evidently stored for a long time (long enough to permanently imprint the fold lines): Now, imagine that was *all* you’d ever seen of the Shroud. Imagine that you’d never seen it in negative, and that you’d never seen the rest of the body and crucifixion wounds, or the back side of the image with the blood all over the top of the head. Even though the upper chest is in the picture, you can’t really make it out without more context, and it’s not obvious that the blood stains are blood stains. Now imagine that you’d only seen it indoors in pre electricity lighting conditions, stored inside a box with a view hole with a lattice..","date":"2012-02-06","mins":"9:58 am","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","title":"Calling all history buffs: Interesting comments from Yannick Clément"},{"id":"comment-7920","author":"the_deuce","post":"Btw, while not related to the Shroud’s possible presence at Edessa specifically, I think we need to remember the Sudarium of Oviedo as corroborating evidence for the Shroud’s ancient existence..","date":"2012-02-04","mins":"10:25 am","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","title":"Calling all history buffs: Interesting comments from Yannick Clément"},{"id":"comment-10864","author":"the_deuce","post":"Thanks for the reminder that Colin Berry is completely out of his gourd. I’d almost forgotten. Also: “looks nothing like Christ – no long hair, beard” Are we looking at two different Shrouds, or is Colin so desperate to see what he wants to see that he’s managed to convince himself that there’s no long hair or beard?.","date":"2012-04-26","mins":"12:03 pm","url":"https://shroudstory.com/2012/04/23/colin-berry-historybod-a-tale-of-two-meanings/","cat":"history","title":"Colin Berry, Historybod: A Tale of Two Meanings"}]
