[{"id":"comment-7842","author":"the_deuce","post":"Well, he can be given credit for (sort of) attempting to explain the 3 D information in the image, which is at least an improvement over denying its existence. Other than that, it contradicts much of what is known about the Shroud (the extreme shallowness of the image, for instance, such that the cells of the linen fibers are essentially intact rather than scorched), and it’s bizarre and convoluted in a way that this picture captures nicely..","date":"2012-02-01","mins":"12:38 pm","url":"https://shroudstory.com/2012/02/01/a-new-theory-for-how-the-turin-shroud-was-faked/","cat":"image_theory","title":"A new “theory” for how the Turin Shroud was faked"},{"id":"comment-8610","author":"the_deuce","post":"Yes, obviously if you’re trying to lower a metal statue at 220°+ C into a cloth on a sand bed, and press it down enough so that it makes contact with all the features, it’s going to be in contact with it for more than 3 seconds. And the parts that stick out the most are going to be in contact for longer and exert more pressure, and thus burn deeper. And you’re not going to have perfectly even pressure and contact time across the whole statue either..","date":"2012-02-21","mins":"6:30 pm","url":"https://shroudstory.com/2012/02/21/colin-berrys-idea-is-untenable-and-heat-cannot-produce-a-superficial-coloration/","cat":"image_theory","title":"Colin Berry’s idea is untenable, and heat cannot produce a superficial coloration"},{"id":"comment-8623","author":"the_deuce","post":"Ron: Yes, you’d get side images from forming an indentation with a cold run, and like Art Science pointed out, the even bigger problem is that you’d completely lose the 3 D effect by having all parts of the statue exert the same pressure for the same amount of time..","date":"2012-02-21","mins":"8:10 pm","url":"https://shroudstory.com/2012/02/21/colin-berrys-idea-is-untenable-and-heat-cannot-produce-a-superficial-coloration/","cat":"image_theory","title":"Colin Berry’s idea is untenable, and heat cannot produce a superficial coloration"},{"id":"comment-8459","author":"the_deuce","post":"Another issue is that the half tones in the Shroud show great detail, which shouldn’t be the case if they are simply the result of burnoff in a radius around the areas of a statue that were in direct contact. Also, the edges of the Shroud image are pretty well defined, which you likewise wouldn’t expect. And as always, we have to remember that a purported forger couldn’t possibly have been deliberately trying to make a 200nm image, or to create detailed half tones that would only be really apparent under photo negativity with contrast enhancement, so we have to imagine them sort of stumbling into whatever method we are imagining them to have used. I’m also skeptical that hemicelluloses coated linen fibers would actually burn in the way described under a hot statue, but only experimentation can show for sure..","date":"2012-02-19","mins":"9:27 am","url":"https://shroudstory.com/2012/02/19/i-dont-get-it-writes-a-reader-about-colin-berrys-hypothesis/","cat":"image_theory","title":"I don’t get it, writes a reader about Colin Berry’s Hypothesis"},{"id":"comment-8465","author":"the_deuce","post":"If the burnoff from a point of contact is only .1 mm, then this idea ceases to be an explanation for large, visible half tone effects in the first place..","date":"2012-02-19","mins":"11:53 am","url":"https://shroudstory.com/2012/02/19/i-dont-get-it-writes-a-reader-about-colin-berrys-hypothesis/","cat":"image_theory","title":"I don’t get it, writes a reader about Colin Berry’s Hypothesis"},{"id":"comment-7990","author":"the_deuce","post":"Some fibers have color while adjacent ones do not. Rogers, Adler and others have noted that the color luminosity doesn’t vary much, not by more than 2% according to micro densitometer readings taken by Adler. But the thread’s apparent luminosity, the visual tone as we see it, varies significantly according to the concentration or pattern of color discontinuities. That’s fascinating! I didn’t know about that! So the fibers in the darker parts of the Shroud image aren’t colored more darkly, or more deeply, than the fibers in the lighter parts. It’s just that colored fibers are in greater concentrations relative to uncolored fibers in the darker areas of the Shroud! On the shroud, image color has formed on the back side of the cloth in the region of the hair. It is interesting to note that the image is superficial to both surfaces of the cloth and that there is no image within the many dozens of fibers that constitute the yarn. And don’t forget the much fainter image on the reverse side of the front image. Somehow it created an image on one side of the cloth, and a much fainter mirror image on the other side, but without “burning” (or whatever) the material in between..","date":"2012-02-06","mins":"1:32 pm","url":"https://shroudstory.com/2012/02/06/sciencebod-and-his-experiments/","cat":"image_theory","title":"Sciencebod and his experiments"},{"id":"comment-7723","author":"the_deuce","post":"I can understand someone arguing that the 3 D information in the image wasn’t created by an actual 3 D body – ie, that the image was deliberately fabricated somehow to *seem* 3 D by shading areas such that their hue would correspond with their depth on a real face. I don’t believe that, or think it’s even a tiny bit plausible given what we know about the Shroud, but at least it’s a logical statement. If, on the other hand, sciencebod is really trying to say that the 3 D encoding is all an illusion, that it’s just pure luck that it has the appearance of depth and that plotting the depth based on hue with a computer produces such an accurate 3 D image of a face, based on the fact that the burn holes produce a variation in hue as well, then he’s simply nuttier than a Snickers bar, and it’s amazing that anybody is wasting more than a single breath dismissing his idea as less than wrong..","date":"2012-01-30","mins":"4:56 pm","url":"https://shroudstory.com/2012/01/30/sciencebods-3d-problem/","cat":"image_theory","title":"Sciencebod’s 3D Problem"},{"id":"comment-8930","author":"the_deuce","post":"Colin, your comparison to Piltdown man is exceedingly weak. He knows. It’s so nonsensical that it’s not even an analogy, let alone a bad one. I think we’re well past the point where arguing with Colin risks “answering a fool according to his folly”..","date":"2012-03-04","mins":"4:15 pm","url":"https://shroudstory.com/2012/03/04/stephen-jones-has-an-important-posting-on-heated-bas-relief-images/","cat":"image_theory","title":"Stephen Jones has an important posting on heated bas relief images"},{"id":"comment-10442","author":"the_deuce","post":"“Are [the moustache and beard] really there, or do we just interpret the darker image above and below the mouth as facial hair?” That can’t be a serious question..","date":"2012-04-16","mins":"9:37 am","url":"https://shroudstory.com/2012/04/16/the-image-on-david-rolfes-website-absence-of-eyebrows/","cat":"image_theory","title":"The Image on David Rolfe’s Website:   Absence of Eyebrows?"},{"id":"comment-8143","author":"the_deuce","post":"One other thing that should be obvious: A scorch caused by a heated statue would be deeper in the darker areas where there was more pressure, not with an even depth (much less one only 200nm) along the whole image..","date":"2012-02-11","mins":"12:19 pm","url":"https://shroudstory.com/2012/02/10/the-image-on-the-shroud-of-turin-is-not-a-scorch/","cat":"image_theory","title":"The image on the Shroud of Turin is not a scorch"},{"id":"comment-8054","author":"the_deuce","post":"Yup, I tend to agree with you Dan. I don’t think the Shroud was a side effect of the resurrection, but that the image was formed as a deliberate miracle of its own, sort of like the changing of water into wine, such that no theory that tries to explain it as a “side effect” or “byproduct” of something else, even if that something else is another miracle, can explain all of the salient properties of the result..","date":"2012-02-08","mins":"12:07 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","title":"Why do we think the Resurrection was a process? What if it was not?"}]
