[{"id":"comment-212505","author":"sampath_fernando","post":"Hi Louis – What about your views regarding compilation of New Testament? If they have come out from catacombs then how did they selects 29 books out of many. Why they discard so many?.","date":"2015-10-14","mins":"4:43 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-212514","author":"sampath_fernando","post":"You may be correct OK but St. Thomas must have sent some sort to progress to Jerusalem (to James). So today we can’t read any of those historical documents from early church. Most probably those documents must have got destroyed in 70 AD..","date":"2015-10-14","mins":"5:28 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-212622","author":"sampath_fernando","post":"We are leaning from each other. So I respect everyone. Piero – And … if the Shroud had been a gift of the Magi? From where did they come to Bethlehem? How did Magi came to see Jesus. Did they walk? Did they come by Camels? or Did they come by some sort of Horse cart? No one knows definite answers to those question. Same way no one know how that linen cloth came to Jeruselem. Joseph of Arimathea must have paid paid a lot of money to buy that linen cloth. It must be very special one for him. He may have already bought that thing for his burial as he already had a newly constructed tomb. So he may have used that linen cloth to cover the body of Jesus as a respect. For me there is no doubt that the linen cloth came from Idia as confirm by DNA. Another thought is that when they covered the body of Jesus that linen cloth may very wet due to heavy rain at that time. So another possiblity that they did not washed the body of Jesus but they wrapped the body of Jesus using a very wet linen cloth..","date":"2015-10-15","mins":"9:16 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-212925","author":"sampath_fernando","post":"Dan please continue your blog. I learnt everything about the Shroud of Turin from this site..","date":"2015-10-18","mins":"3:45 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-212498","author":"sampath_fernando","post":"Why in 325 AD (about 300 years after death of Jesus) dominant Christians in Rome ignored or forget to imnclude mission of St Thomas in India? As Daveb said there was communication and transport between India and the Middle East, and consequently trade. Not only with India, middle East also had trade with Sri Lanka (Ceylon) as well..","date":"2015-10-14","mins":"3:45 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-212507","author":"sampath_fernando","post":"Sorry in New Testament..","date":"2015-10-14","mins":"4:59 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"}]
