[{"id":"comment-213975","author":"sampath_fernando","post":"Thank you Daveb. According to Jesus on Judgement Day or at Resurrection we get glorified bodies. My understanding is Angels are having Glorified Bodies. According to Hebrews 13:2 Do not forget to show hospitality to strangers, for by so doing some people have shown hospitality to angels without knowing it. According to that verse Jesus act like an Angel. According to that verse angels can have special type of body..","date":"2015-10-31","mins":"4:13 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-213951","author":"sampath_fernando","post":"As I mentioned sometime back Jesus told that at resurrection we get a body like Angel. (Matthew 22:30). After resurrection Jesus appeared to many as an Angel. So we have to get rid the conception of Jesus resurrected bodily. As Jesus had a body like Angel. Then at resurrection Jesus body had to be dematerialised. That is how neutrons were emitted uniformly from the body of Jesus..","date":"2015-10-30","mins":"6:40 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214022","author":"sampath_fernando","post":"We humans can’t imagine the resurrection activity and it process. As Mr. Rucker says neutrons must have emitted during the resurrection process. So in addition to neutrons what sort of radiation emitted from the Jesus body to create the image on his burial cloth?.","date":"2015-10-31","mins":"4:30 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214065","author":"sampath_fernando","post":"Hi ekmcmahon – I like the statement “Jesus changed from the Human body/God Soul to the God Physical Body/God Soul”. My imagination is the same. No scientist can understand or can explain the resurrection activity and the resurrection process. Answer to resurrection process has to come only from the Father God. I think in this situation we can’t use human logic. So far I have not heard from any scientists or any human how Jesus performed miracles or how Jesus raised 3 dead bodies or how Jesus commanded to stop the storm or how he feed 5000 men (excluding women and children).","date":"2015-11-01","mins":"3:56 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214122","author":"sampath_fernando","post":"Has anyone detected Radon Gas in soils/limestone around Jeruselam?.","date":"2015-11-03","mins":"1:34 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214211","author":"sampath_fernando","post":"Hi Daveb/mr. Green These are the possiblities: After the resurrection Jesus must have gone out from the tomb without moving the Stone Or. Angels must have moved the Stone Earth quake must have moved the Stone Soldiers must have moved the Stone to check the body of Jesus after the Earth quake. No one mentioned where the Stone was when Mary Madgelene reached the tomb. Only thing mentioned was it was moved. We don’t know whether Stone was fallen to ground or left next to the Tomb entrance..","date":"2015-11-04","mins":"4:08 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-200453","author":"sampath_fernando","post":"Hi Mr Farey – Everything depend on whether you believe in resurrection or not. If you believe in resurrection, then it is a unknown process to human beings and also the creating of an image on the Shroud is also and unknown process to human beings. If you are not believing in resurrection then the creation of the image is a forgery to human beings. That why Mr Freeman and his experts think it is a painting. Also controversial Carbon dating supports views of Mr. Farey and Mr. Freeman. But most of the Shroud researches proved that image on the Shroud is not a painting..","date":"2015-05-28","mins":"4:07 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-196453","author":"sampath_fernando","post":"Thank you OK. I can’t can’t imagine how forger included all these features into the image on the Shroud. Why forger believed Jesus was crucified by nailing through the wrists rather than the palm? IN 14th centuary what was influenced the forger to imagine Jesus was crucified by nailing through his wrists?.","date":"2015-04-15","mins":"4:45 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-209180","author":"sampath_fernando","post":"As I mentioned sometime back, we have not come across any person who is dead or alive leaving a image like TS on his burial cloth if dead or on his covered cloth if he is still alive. So far no human being has managed to explain how person can resurrect from dead or what reactions are happening during the resurrection process. Old or young doctors can give their own opinions based on their experience on dead or live human bodies. John what is the real meaning of Quantum Christ?.","date":"2015-08-27","mins":"11:06 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209172","author":"sampath_fernando","post":"Mr Green Jesus Christ, Jehovah, Allah– please include Brahma as well “We can accomplish miraculous things in the world by merging our faiths, and the time for such a movement is now. No longer shall we slaughter our neighbors over differences in reference to their God.”” What a wonderful saying Mr. Green. Thank you very much we must discard all sort of fundamentalism. (unlike Christians believe Jesus discarded all sort of fundamentalism).","date":"2015-08-27","mins":"8:49 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-212509","author":"sampath_fernando","post":"Mr.Farey your logic is correct. Otherwise they may have carried Jesus to tomb from cross by holding from his arms and legs. (how many people carried Jesus from Cross to Tomb? Did soldiers help them to carry Jesus body after hearing the words of Centurian..","date":"2015-10-14","mins":"5:16 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-212338","author":"sampath_fernando","post":"I don’t think they wash the body of Jesus. According to Synoptic Gospels they did not have time even to Anoint the body. As a result of that they wrap the body till Sunday morning to anoint the body and give a proper burial..","date":"2015-10-12","mins":"3:05 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-212400","author":"sampath_fernando","post":"Hi Louis – But there are no evidence from the Shroud of Turin to tell us that it was the same shroud used to transport Jesus body from the cross to the Tomb..","date":"2015-10-12","mins":"8:07 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"}]
