[{"id":"comment-192826","author":"sampath_fernando","post":"There is no difference between Atheists and skeptics of shrouds. You can’t convince them. They ignore all available data purposely..","date":"2015-03-08","mins":"4:01 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-192856","author":"sampath_fernando","post":"I am sorry Mr. Farey if I have hurt you. I never consider Carbon Dating as an accurate reading to condemn Shroud of Turin as a fake painting because the sample they took is not a representative one and also the sample took from that corner is not a good place take a one to test. Also considering the properties of the image such as a negative of a positive photograph and also wound at the wrists and the X ray properties of the bones of the palm and fingers convinced me that it is not a paint or a scorch. But in addition to above many scientists (not historians) published many scientific papers giving many clues to consider the image as an authentic one. God Bless You too..","date":"2015-03-08","mins":"9:20 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193090","author":"sampath_fernando","post":"Sorry if I am wrong. We don’t know from where and from whom Aramathia Joseph bought the linen to wrap the body of Jesus. So Cotton can be in the Shroud but do all of the cotton in the Shroud have the same age?.","date":"2015-03-10","mins":"10:36 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193143","author":"sampath_fernando","post":"Thank you anoxie. I believe same thing applies to the results of Carbon Dating of Turin Shroud as they overlooked the external contamination..","date":"2015-03-11","mins":"4:53 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193160","author":"sampath_fernando","post":"Thank you Louis for giving the link of the research paper. People need to talk about the image formation rather than finding material in the Shroud. No one can explain how this image was formed. That is a mystery..","date":"2015-03-11","mins":"9:01 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-152056","author":"sampath_fernando","post":"Yes According to Gospels Jesus appeared and then again disapeared. Also Gospels tells us Jesus entetred to completely closed room without opening the door? I can’t explain this with a material body..","date":"2014-09-17","mins":"7:39 pm","url":"https://shroudstory.com/2014/09/16/and-interview-with-lind-and-antonacci/","cat":"carbon_14_dating","title":"An Interview with Lind and Antonacci"},{"id":"comment-152067","author":"sampath_fernando","post":"Thank you daveb. Like Padro Pia NDE people also had this sort of out of body experience. That is mainly due to their spiritual bodies and not due to the material body..","date":"2014-09-17","mins":"8:40 pm","url":"https://shroudstory.com/2014/09/16/and-interview-with-lind-and-antonacci/","cat":"carbon_14_dating","title":"An Interview with Lind and Antonacci"},{"id":"comment-152108","author":"sampath_fernando","post":"Thank you Daveb That didn’t happen to Jesus. After his death, his body was living and tangible. This is what you are believing. However I believe that Jesus was raised with his Glorified Body rather than a Material body. Also at resurrection we will also recieve our Glorified bodies..","date":"2014-09-17","mins":"11:54 pm","url":"https://shroudstory.com/2014/09/16/and-interview-with-lind-and-antonacci/","cat":"carbon_14_dating","title":"An Interview with Lind and Antonacci"},{"id":"comment-152326","author":"sampath_fernando","post":"Thank you David “you will not be able to explain many things about God”. Yes, that is why each one of us are having our own opinions. Yes, I respect your opinions but only God knows whose opinion is true. None of the Gospels mentioned anything about the Image of Jesus on his Burial Cloth (TS). Why didn’t they mention it? As a result of that now we are speculating how his image got printed on his burial cloth. Still there are so many opinions and hypothesis but only God (or Creator) knows exactly how that image got printed..","date":"2014-09-18","mins":"6:04 pm","url":"https://shroudstory.com/2014/09/16/and-interview-with-lind-and-antonacci/","cat":"carbon_14_dating","title":"An Interview with Lind and Antonacci"},{"id":"comment-152048","author":"sampath_fernando","post":"1. Do parallel universes exist, or multi verses? 2. I might speculate for example that this universe in which we exist is actually a subset of a higher universe. Yes Jesus mentioned about many mansions. So may I speculate that there are material Universes as well as Spiritual Universes. Recent studies in NDE proves this. There is a spiritual body as well as a material body for each human. Even Jesus mentioned that at resurrection we are like angels. So I strongly believe that Jesus resurrected spiritualy rather than materialy. Image on shroud is an evidence for that. So dematerialisation of the material body by emiting radiation seems to be true for me..","date":"2014-09-17","mins":"7:12 pm","url":"https://shroudstory.com/2014/09/16/and-interview-with-lind-and-antonacci/","cat":"carbon_14_dating","title":"An Interview with Lind and Antonacci"},{"id":"comment-194061","author":"sampath_fernando","post":"Those who were responsible for sampling and testing should have done enough to do the proper sampling techniques, veryfying the internal and external contamination of the corner, rather than, now, skeptics of the shroud are trying their best to give all sort of explainations to justify the controversial results..","date":"2015-03-22","mins":"5:11 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-208895","author":"sampath_fernando","post":"Only engineers are considering representative sampling but not the scientists..","date":"2015-08-24","mins":"6:47 pm","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","title":"Food for Thought: An Important Paper on Radiocarbon Dating"},{"id":"comment-214114","author":"sampath_fernando","post":"Why Issaiah please read 4 Gospels and see how John contradicting with Matthew, Mark and Luke about the burial procedure of Jesus. Who told you that scriptures are telling the absolute truth. Scripyures tell some truth. Jesus asked you to read things with open eyes and open mind. By the way sampling procedure used get a sample to test Carbon Dating are not sccientific..","date":"2015-11-02","mins":"8:13 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-194305","author":"sampath_fernando","post":"Oh Oh on line Calculators? Garbage in Garbage out. Try your own calculation method using first principles. Do you know how they created on line Calcilator?.","date":"2015-03-24","mins":"5:02 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-214939","author":"sampath_fernando","post":"Ignorance of Mr. Jones. Rather than results he must concentrate on sampling procedure..","date":"2015-11-21","mins":"4:19 pm","url":"https://shroudstory.com/2015/11/21/computer-hacking-theory-for-carbon-dating-continues/","cat":"uncategorized","title":"Computer Hacking Theory for Carbon Dating Continues"},{"id":"comment-193968","author":"sampath_fernando","post":"Hi John Thank you very much for your excellent essay Sampath.","date":"2015-03-21","mins":"5:02 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","title":"John Klotz Delivers the Knockout"},{"id":"comment-178590","author":"sampath_fernando","post":"Other than using a contaminated piece to do the Carbon Dating Test and obtaining very controversial results, there are no other reasons to tell that Shroud of Turin is fake thing..","date":"2014-12-22","mins":"11:26 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","title":"Just Published:  What Went Wrong with the Radiocarbon Date?"},{"id":"comment-197346","author":"sampath_fernando","post":"From the Gospels we know that Jesus handed over his spirit to Father at his death. After that de died. As Jesus told at the cross, then the Soul (may be spirit) of Jesus went to paradise with the Soul of the thief. After three days Jesus Soul (or spirit) came back to his body. As I mentioned previously no one knows what sort reactions would happens during the resurrection process. During that resurrection process radiation could have happened. Todate, except the Father and Son no one knows about this process. Scientists are still struggling to create a living micro organisms in the lab. So far they failed to do that. However thay can create life with using another living organism. So to create new life from nothing they have to undertand the resurrection mechanism..","date":"2015-04-23","mins":"4:57 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","title":"Look at what happened between 1988 and 2015"},{"id":"comment-197615","author":"sampath_fernando","post":"Why people are ignoring Prof. Fanti’s dating results. Did anyone challenge his methodology and results?.","date":"2015-04-26","mins":"1:14 am","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","title":"Look at what happened between 1988 and 2015"},{"id":"comment-193231","author":"sampath_fernando","post":"Thank you Dave for the link. Best fit, Mean, Standard deviation, Chi Value Square interesting. First grab sample, then ignore internal contamination and external contamination. Coming to a conclusion of the date of Shroud by ignoring the 95% confidence level of Carbon Dating results and also condemning it as a medieval fake is a joke. How bad is this? Those scientists deceived the world. Thank you Louis for the link of Dr. Paolo Di Lazzaro interview. This convinced me that no medieval artists or technologist can make an image or painting like the image on the Shroud of Turin. Thank you again.","date":"2015-03-12","mins":"4:56 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-197682","author":"sampath_fernando","post":"Thank you Mr. Farey. So both C Dating results and Prof. Fanti’s results are controversial. However still people like to use controversial Carbon Dating results rather than Prof. Fanti’s results..","date":"2015-04-26","mins":"7:46 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","title":"Look at what happened between 1988 and 2015"},{"id":"comment-195017","author":"sampath_fernando","post":"I strongly believe in Resurrection and Science can’t prove the process of Resurrection. Same with the image as it got printed during the Resurrection process and it is beyond the sciencetific knowledge..","date":"2015-03-31","mins":"9:23 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-194734","author":"sampath_fernando","post":"Sorry, people like Mr. Farey don’t know how the image got printed, yet they openly state that Shroud is not authentic..","date":"2015-03-28","mins":"8:36 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-192585","author":"sampath_fernando","post":"Thank you Daveb. Why these inteligent people can’t understand the meaning of representative sampling? To justify their claims they purposely ignore this fact and give so many excuses to fool their followers. As an Envoronmental engineer, I never take the results of a grab sample to give a solution..","date":"2015-03-05","mins":"10:26 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193174","author":"sampath_fernando","post":"Hi Dave Sorry to troble you. Could you please give us a example explaining why Chi Value Square test failed in the case of the 1988 Radio Carbon Dating. Thank you..","date":"2015-03-12","mins":"12:51 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-154856","author":"sampath_fernando","post":"Skurka’s own theory takes Rogers’ scientific paper one step beyond, theorizing that the act of Christ’s “resurrection to a glorified body,” physically involved some sort of what we would call today a nuclear event. And that the effect of this on the cloth would result in a skewed radiocarbon reading. I am supporting Skurka’s Hypothesis. Yes, it is necessary to discard the New Testament writers opinion about the Bodily Resurrection to explain the image on the TS. I don’t have any doubt to accept that Jesus resurrected with a Glorified Body..","date":"2014-09-24","mins":"5:52 am","url":"https://shroudstory.com/2014/09/24/superparamagnetism/","cat":"carbon_14_dating","title":"Superparamagnetism"},{"id":"comment-172649","author":"sampath_fernando","post":"Thank you Dan for giving us this valuable information. Definitely those scientists used a contaminated sample (as well as Grab sample) and misled many..","date":"2014-11-23","mins":"5:17 am","url":"https://shroudstory.com/2014/11/23/paper-chase-the-shroud-of-turin-and-its-radiodating/","cat":"carbon_14_dating","title":"Paper Chase:  The Shroud of Turin and its Radiodating"},{"id":"comment-210429","author":"sampath_fernando","post":"What is this joke. Scientists are attacking each others work. As Daveb says there must be an agenda. Who is misinforming the world. Earlier eggs are bad now good for health. Coconut oil is worse now it is the best oil for health..","date":"2015-09-15","mins":"2:35 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-215069","author":"sampath_fernando","post":"Based on Gospel account I cannot agree on Bodily Resurrection. Looking at the properties of the Image on Shroud and image formation most probaly due to dematerilization of the body. As such I suuport Spiritual resurrection. That is why those who support bodily resurrection like to promote earth quake theory. It is not possible earth quake to form both frontal and dorsal image on the wrapped burial cloth..","date":"2015-11-24","mins":"6:21 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-214999","author":"sampath_fernando","post":"100% agree with Daveb. I don’t know why expert scientists are still accepting C14 results. Why can’t they understand sampling procedure was wrong. We never take grab samples to decide to get the clear picture of any event..","date":"2015-11-23","mins":"1:32 am","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215072","author":"sampath_fernando","post":"Louis, Where did I support earth quake theory? I never supported an earth quake theory as it never gives a dorsal and a frontal images. My hypothesis is dematerialization and emission of radiation from inside to outside. That is the only way you get both frontal and dorsal images..","date":"2015-11-24","mins":"8:09 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215101","author":"sampath_fernando","post":"Yes I saw De Liso images. But it is only oneside image. So that is why it is a possibility. If he providing wrong information then he is cheating..","date":"2015-11-25","mins":"3:35 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215094","author":"sampath_fernando","post":"Yes there is a possibility of anything. But this does not mean that I support that theory. From earth quakes you never get frontal and dorsal images..","date":"2015-11-25","mins":"1:23 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215107","author":"sampath_fernando","post":"No frontal and dorsal images can be formed by Earth Quake on a wrapped burial cloth. And that is why I did not support the earth quake hypothesis. I support only Dematerilization hypothesis..","date":"2015-11-25","mins":"5:52 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215110","author":"sampath_fernando","post":"I never changed my mind. You can decide what you want. I am not worried. According to your statements only Prof Fanti change his mind about Corona discharge..","date":"2015-11-25","mins":"7:26 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"}]
