[{"id":"comment-212113","author":"sampath_fernando","post":"From where Scientists took a sample to do Mass spectrometry and Carbon Dating. Is it a reliable sample. Why scientists did not take a representative sample from the Shroud? From where scientists took a sample to do DNA testing. Can we consider that sample as a representative one? However no one knows how the imaged was formed on the Shroud of Turin. Which scientist can prove that there is no God. I think same way no scientist can tell exactly how the image on Shroud was formed..","date":"2015-10-09","mins":"3:33 am","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-211931","author":"sampath_fernando","post":"Louis – Methodist Hymn book has picture of Syrian Cross dated 4th century found in Anuradhapura Sri Lanka..","date":"2015-10-06","mins":"6:40 pm","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-211920","author":"sampath_fernando","post":"Thank you Louis. Also must thank Dan for publishing this article. New Testament does not tell anything about mission of Thomas in India. However we know that Thomas came to India and spread the Gospel. Also we know that Thomas was killed in Chennai. Why Thomas was sent to India? During Jesus time many Jewish Traders visited India and Sri lanka. Also we know that there were some Jewish colonies in South India and Sri Lanka before the birth of Jesus and and also after the death of Jesus. Still there are Christians in India who believe that their church was established by Thomas. Most probably Joseph of Arimathia must have bought the linen cloth to wrap Jesus from a Jewish Trader who came from India to Jerusalem to sell various items during the passover..","date":"2015-10-06","mins":"4:56 pm","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-216043","author":"sampath_fernando","post":"Who is this Paul? Last Sunday I told my wife that I like Paul very much because of him only now you are submitting to me. Why Paul did not say husband must submitt to their wives. Also this Paul condemned homosexuals but Jesus always told us to love your neighbour as thyself. Unlike Jesus, Paul did not know about how people were created..","date":"2015-12-09","mins":"3:44 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-215925","author":"sampath_fernando","post":"According to John who asked Jesus to give wine? It is Mother Mary. Why did she asked Jesus?.","date":"2015-12-08","mins":"3:59 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-215929","author":"sampath_fernando","post":"Sorry I am telling about the first miracle stated in John. Jesus mother knew who Jesus was..","date":"2015-12-08","mins":"4:30 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216049","author":"sampath_fernando","post":"I don’t know why these Non Catholics abd Catholics are always deabating about Mother Mary. Shame and shame. Mother Mary is a very special person that is why God the Father selected her as mother of Jesus.. Mother Mary had only one Son and that that why at cross Jesus asked John to look after his Mother. If Jesus had own sibliings (not step brothers and sisters) Jesus would not have asked John to look after his Mother. How can those Christians who cannot understand virgin birth can accept resurrection of Jesus from death?.","date":"2015-12-09","mins":"4:12 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-215950","author":"sampath_fernando","post":"His mother said to the servants, “Whatever He says to you, do it.” According to John, Mary had great faith on Jesus. Yes those who are not believing in miracles can think Mary asked servants go and get money from Jesus to buy wine..","date":"2015-12-08","mins":"7:32 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216061","author":"sampath_fernando","post":"Loius – The New Testament is safe so far, as far as archaeology is concerned. Yes Louis you are correct. However I don’t agree with Paul’s ideas about wife must submit to your husband and condemning homosexuals. For some Christians Paul’s ideas like those are very important than virgin birth. They ignore Jesus’s new commandment. For me Gospels are the most important books from the new testament..","date":"2015-12-09","mins":"5:13 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216059","author":"sampath_fernando","post":"Who says you need Mary to be saved? I think Catholics are asking Mother Mary to pray for them as you Christians asking your priests and/or your so called Christian brothers and sisters to pray for you. Are there any difference? I am very sad when I hear these ignorant non Catholics are condeming mother Mary..","date":"2015-12-09","mins":"4:59 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216164","author":"sampath_fernando","post":"Thank you Rick and Louis. I agree with you Louis. I like Pope Francis. I thinkk he also not agreeing with Paul on many issues and that is why he told even Atheists can go to Heaven. I discard all sort of fundamentalism. That is why I meditate only on the teachings of Jesus. As Jesus taught us we must Love each other. When we think about us we have to think about others also. We must not not condemn any other religion. Jesus was teaching us only about Kingdom of God and how can we inherit that. He treated all as the children of God and never discriminated anyone who was following oter religions and faiths. Shame today Christians are condeming Catholics and not talking about the Kingdom of God. One day Shroud and Sudarium tell us more things about Jesus..","date":"2015-12-10","mins":"3:51 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216171","author":"sampath_fernando","post":"Thank you Louis..","date":"2015-12-10","mins":"6:51 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216189","author":"sampath_fernando","post":"Thank you Rick. One of my friend who is an Anglican saw 3 times Mother Mary in vision. Now he has started a charity (VACD) to help disable children in Sri Lanka (in Bandarawela area). Currently he is helping 150 children..","date":"2015-12-11","mins":"1:42 am","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"}]
