[{"id":"comment-206298","author":"sampath_fernando","post":"Thank you Thomas and Davebfor your valuble contribution to discard Shroud created as a liturgical tool as suggested by Mr. Freeman and supported by Mr. Farey..","date":"2015-07-21","mins":"5:02 pm","url":"https://shroudstory.com/2015/07/21/a-rare-piece-of-cloth/","cat":"history","title":"A Rare Piece of Cloth"},{"id":"comment-207733","author":"sampath_fernando","post":"About two weeks ago when I saw the shadow of that “Crown of Thorns” in Paris, I wondered why it is circlet. Thank you Daveb for your imagination and clarification..","date":"2015-08-08","mins":"3:18 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-171136","author":"sampath_fernando","post":"Yes I believe you Mr. Mc Mahon. Only very few people have experienced Guardian Angels. When you read Dan’s blog you can see that all the theories of painting, schorch, sweat are collapsing from the comments of experts. Skeptics always have points to disagree..","date":"2014-11-13","mins":"9:59 pm","url":"https://shroudstory.com/2014/11/13/over-at-history-todays-blog-space/","cat":"history","title":"Over at History Today’s blog space"},{"id":"comment-167735","author":"sampath_fernando","post":"Colin: Its exquisite response to 3 D enhancement is just one of them. Good on you Colin. Why Historian did not consider this fact..","date":"2014-11-01","mins":"4:43 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-208587","author":"sampath_fernando","post":"Thank you Dan for this publication According to the Gospel of Hebrews – “And when the Lord had given the linen cloth to the servant of the priest, he went to James and appeared to him” Then based on above, I think most probably, Jesus gave the linen cloth to the James (but not to Peter).","date":"2015-08-19","mins":"5:54 pm","url":"https://shroudstory.com/2015/08/19/who-is-addai/","cat":"history","title":"Who is Addai?"},{"id":"comment-165102","author":"sampath_fernando","post":"As an Engineer I felt that a Historian who doesn’t know how to paint or print that image on a piece of linen with current technology wrote that article in the Guardian to gain some sort of cheap publicity..","date":"2014-10-24","mins":"5:02 am","url":"https://shroudstory.com/2014/10/23/the-guardian-notes-the-history-today-article-by-charles-freeman/","cat":"history","title":"The Guardian Notes the History Today Article by Charles Freeman"},{"id":"comment-208714","author":"sampath_fernando","post":"Thank you Louis. I don’t know why we can read that sort of statement in Gnostic gospels. According to my understanding Jesus never consider anything as unclean like humans do. Jesus touch all sort of untouchable people. So there must be a reason why Gnostic gospels have mentioned the Shroud in second century and not the canonical gospels in the first century. As such I don’t want to ignore gnostic gospels as today many people can identify Shroud as a genuine object. Furthermore today many Churches are not only discarding Gnostic Gospels but also they discarding the Shroud..","date":"2015-08-22","mins":"5:06 am","url":"https://shroudstory.com/2015/08/19/who-is-addai/","cat":"history","title":"Who is Addai?"},{"id":"comment-208743","author":"sampath_fernando","post":"Louis you are a very good resource person. Thank you very much..","date":"2015-08-22","mins":"10:47 pm","url":"https://shroudstory.com/2015/08/19/who-is-addai/","cat":"history","title":"Who is Addai?"}]
