[{"id":"comment-206260","author":"sampath_fernando","post":"I like the number 1128 and finally it add up to 3. Yes some sort of electromagnetic waves were involved in creating the image on the shroud and it came out from the body..","date":"2015-07-21","mins":"4:34 am","url":"https://shroudstory.com/2015/07/18/blow-your-mind-3d-scanning-technology-and-what-it-could-mean/","cat":"3d","title":"Blow Your Mind 3D Scanning Technology And What It Could Mean"},{"id":"comment-209555","author":"sampath_fernando","post":"Yes Louis Colin has to go so far to get the exact image simillar to Turin Shroud. I admire Collin’s efforts, but his experiemnts are still in the infant stage. Pilot scale models are quite diffetent to prototype models. Shroud is the only prototype image we have for the last 2000 years..","date":"2015-09-03","mins":"9:59 pm","url":"https://shroudstory.com/2015/09/03/colin-berrys-latest-and-greatest-is-it-enough/","cat":"3d","title":"Colin Berry’s Latest and Greatest. Is it Enough?"},{"id":"comment-175430","author":"sampath_fernando","post":"Fully agree with Stan We think today technology is far more advanced than 2000 years or 600 years ago. Yet people with Doctorates in Science or Technology and also History and Archaeology cannot explain how those finer details recorded on the shroud. Instead of explaining how the whole image was formed, experts are giving only piece meal solutions. They give their opinions and/or hypothesis for only just minor aspect of the image. Today we have so many hypotheses of the image formation but none of the hypothesis cannot fully explains, all the details or aspects of the whole image. Why is that?.","date":"2014-12-09","mins":"7:10 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175796","author":"sampath_fernando","post":"No Mercury found so definitely it is not vermillion..","date":"2014-12-11","mins":"9:12 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-211846","author":"sampath_fernando","post":"Thank you OK for your interesting presentation. You are going in the correct direction OK. Today Astronomers get more information about our Universe from images. So image on the Shroud is giving us a lot of information. My interests go for the Slide 7 of Part 3. I think most probably either possibility of 1 or 2 or the combination of 1 and 2 was the cause for the formation of image on the Shroud of Turin. My imagination is during the process of Resurrection some sort of radiation emitted from the body of Jesus and that was the reason for the image formation..","date":"2015-10-05","mins":"4:18 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-212167","author":"sampath_fernando","post":"OK –In the case of the Shroud and 3 D effect, we suppose that there is a relation between image intensity and the distance between the cloth and supposed body wrapped within it. I am fully agreeing with you OK..","date":"2015-10-09","mins":"5:02 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-210612","author":"sampath_fernando","post":"Thanks OK. When you have an Agenda then you have to ignore Ethics..","date":"2015-09-17","mins":"9:55 pm","url":"https://shroudstory.com/2015/09/17/guest-posting-on-the-thermochimica-acta-editorial/","cat":"paper_chase","title":"Guest Posting on the Thermochimica Acta Editorial"},{"id":"comment-211997","author":"sampath_fernando","post":"“but is probably following the shortest path to the sheet”. – Yes that is a very good assumption. Thank you OK..","date":"2015-10-07","mins":"8:30 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-206578","author":"sampath_fernando","post":"Thank you Dan for publishing this very interesting and educating video. Nicely explained with Four points why Shroud is not a painting. “Shroud is actually not a painting”, “it so mysterious ” and “the blue print of the future”..","date":"2015-07-26","mins":"3:32 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","title":"1999 Interview with Isabel Piczek"},{"id":"comment-206623","author":"sampath_fernando","post":"On July 21, 2015 at 4:27 am – Mr. Farey wrote that he is agreeing with Mr. Freeman that Shroud is a painting and it was created for a liturgical purpose.","date":"2015-07-26","mins":"7:22 pm","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","title":"1999 Interview with Isabel Piczek"},{"id":"comment-206619","author":"sampath_fernando","post":"Thank you Daveb, my fellow engineer. Mr. Farey has to prove that Shroud is a painting. I am 100% gurantee that Mr. Farey never prove that Shroud is a painting..","date":"2015-07-26","mins":"6:04 pm","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","title":"1999 Interview with Isabel Piczek"},{"id":"comment-177364","author":"sampath_fernando","post":"Very interesting paper. Some believe that every living cell produce some sort of Bio Field (very faint electrical field). After the death this field vanishes due to extinguish of blood circulation. Recent research detected very weak electrical fields around the living things including plants. To my knowledge no one has resurrected from death except Jesus. So no one knows exactly what sorts of mechanisms are involved in this resurrection process. Furthermore no one knows, exactly, how much energy is required to start the blood re circulation after 3 days of death. If Jesus resurrected from death and his blood circulation started again, then at the inception of that blood circulation, there is a high probability that some sort of electrical field generated. No one knows how strong that electrical field is? This could have been the reason to print the image on the burial cloth of Jesus. Although not related, I want to mention the following: After reading Gospels I have realised that Jesus was a unique human being born to this world. He preached about the kingdom of God and also attacked the religion of Jews at that time. He used parables to explain the Kingdom of God and told that Kingdom of God is for everyone and not only for the Jews. That was the one of the reason reasons Jewish religious leaders killed him. According to Gospels Jesus did many miracles such as healing sick, casting out evils, walking on water, calming storms and feeding more than 5000 people from few fish and bread. Furthermore he raised 3 people from the dead and most famous one was raising Lazarus from the death. Unfortunately Lazarus did not have a burial cloth like Jesus. If he had a burial cloth like Jesus then his body image also would have got printed on that burial cloth. Before his death Jesus predicted that Jews will kill him and but he will resurrect on the third day from the death. According to gospels there are witnesses for his resurrection and also to the burial cloth..","date":"2014-12-17","mins":"6:29 pm","url":"https://shroudstory.com/2014/12/17/a-gedankened-image-forming-process/","cat":"image_theory","title":"A Gedankened Image Forming Process"},{"id":"comment-177411","author":"sampath_fernando","post":"Louis— What happened between the two events? Believe or not it is another miracle.","date":"2014-12-17","mins":"10:13 pm","url":"https://shroudstory.com/2014/12/17/a-gedankened-image-forming-process/","cat":"image_theory","title":"A Gedankened Image Forming Process"},{"id":"comment-206916","author":"sampath_fernando","post":"Thank you Dan for this amazing video. What a presentation. Oneday Science and Geometry will reveal more information of the image on the Shroud..","date":"2015-07-29","mins":"10:34 pm","url":"https://shroudstory.com/2015/07/29/a-new-astonishing-phenomenon/","cat":"image_theory","title":"A New Astonishing Phenomenon?"},{"id":"comment-206982","author":"sampath_fernando","post":"I like his hypothesis on hand movements during resurrection.","date":"2015-07-30","mins":"7:08 pm","url":"https://shroudstory.com/2015/07/29/a-new-astonishing-phenomenon/","cat":"image_theory","title":"A New Astonishing Phenomenon?"},{"id":"comment-193705","author":"sampath_fernando","post":"No one knows how “Big Bang” was happened. So there are many hypotheses for it. So far no one has given a reasonable explanation beyond any doubt. Same thing with the image on the Shroud of Turin, no one has given a explanation beyond any doubt. Who can give a correct explanation? No one. But there are so many people publishing articles and misleading the mankind. Is it the biggest sin they are doing?.","date":"2015-03-18","mins":"4:48 pm","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-199320","author":"sampath_fernando","post":"Colin may correct if it is a painting. As far as I am concern TS is not a painting. (according to word of mouth TS is not made by man). If painter is such a intelligent person then he will paint the image according to the way Colin think. He won’t miss those details if he considered the other unthinkable properties at that time. I have to agree with Thibault. It take years to find out how the TS image got formed..","date":"2015-05-17","mins":"3:17 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-201653","author":"sampath_fernando","post":"Blood stains are there. Is it a painting? Or is it created by Biological or chemical or radiation process? So far no one was able to give an reasonable answer to those questions. However Mr Freeman is 100% sure that it is a painting..","date":"2015-06-11","mins":"5:24 pm","url":"https://shroudstory.com/2015/06/11/comment-promoted-charles-freeman-comes-closest/","cat":"image_theory","title":"Comment Promoted:  Charles Freeman Comes Closest"},{"id":"comment-207731","author":"sampath_fernando","post":"That is interesting. Colin is trying hard to find out how the image was formed. If shroud is a fake, then creating an image on a piece of linen cloth 14th feet long and 3 feet wide was a responsibility of a technologist who lived either on 1st century or 14th century. However we know that that sort of technology was not available as there are no other linen clothes where we can’t find a image similar to the shroud..","date":"2015-08-08","mins":"2:44 am","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-208000","author":"sampath_fernando","post":"Hi Yannick Did STURP find the traces of burial products. Only Gospel John tells us that body was wound with the spices where as other 3 synoptic Gospels tell us that body was wrapped with a clean linnen and on Sunday women went to annoint the body of Jesus with spices..","date":"2015-08-11","mins":"6:17 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-207722","author":"sampath_fernando","post":"I don’t know what Paul meant by truckloads of linen. But today we have only one and only one piece of linen which have an unexplainable image of a crucified person with a sign of a crown of thorn and pierced wound on a chest. Furthermore also with a tortured body with scourge marks, and a dislocated shoulder..","date":"2015-08-07","mins":"8:54 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-208003","author":"sampath_fernando","post":"Thank you Louis. I want to find out whether the spices had any role in the formation of image on the Shroud..","date":"2015-08-11","mins":"8:32 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-208092","author":"sampath_fernando","post":"Thank you Mr. Farey and Louis and for the valuable information. Still I can’t understand why women went on Sunday morning to annoint the body of Jesus if that body was already annointed by Joseph of Aramathia on Good Friday..","date":"2015-08-12","mins":"4:46 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-208805","author":"sampath_fernando","post":"Yes Daveb you are absolutely correct. That is how image on TS was formed. These researchers are ignoring that basic fact..","date":"2015-08-23","mins":"3:54 pm","url":"https://shroudstory.com/2015/08/23/have-we-all-been-looking-in-the-wrong-place/","cat":"image_theory","title":"Have we all been looking in the wrong place?"},{"id":"comment-200827","author":"sampath_fernando","post":"I like to interpret the story of 3 monkeys in different way: 1.Hear only who support (or from experts who don’t want to divulge their names), 2.Speak (or write) only to get popular, 3.See (or read) only the area of your speciality..","date":"2015-06-01","mins":"11:04 pm","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?"},{"id":"comment-207918","author":"sampath_fernando","post":"I recomend scientists to study remote sensing and also images and photography before they comment anything on the properties of the Shroud of Turin.","date":"2015-08-10","mins":"6:33 pm","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","title":"It is really, really time to rethink what we think about 3D"},{"id":"comment-192144","author":"sampath_fernando","post":"Very interesting paper and it will help many to understand why different grey scales were produced of the negative image on the shroud of Turin. Furthermore it help to understand why the image on the Shroud of Turin cannot be produce by a painter..","date":"2015-03-02","mins":"12:41 am","url":"https://shroudstory.com/2015/03/01/new-paper-variations-in-image-due-to-amounts-of-burial-ointments/","cat":"image_theory","title":"New Paper:  Variations in Image Due to Amounts of Burial Ointments?"},{"id":"comment-214577","author":"sampath_fernando","post":"Hi Daveb – Yes there is a possibility to get images during seismic events with Radon. I don’t know whether De Liso managed to get both frontal and dorsal images from the experiments..","date":"2015-11-13","mins":"3:56 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","title":"Nevertheless, the images are real enough!"},{"id":"comment-192232","author":"sampath_fernando","post":"According to New Testament Jesus was resurrected but not the Herod. Image may have got printed during the resurrection process. Neither Average Human being nor a Scientist don’t anything about this resurrection process. That is why still we are stuggling to understand how the image was formed on the Shroud of Turin. Hope one day someone can find that process..","date":"2015-03-02","mins":"5:12 pm","url":"https://shroudstory.com/2015/03/01/new-paper-variations-in-image-due-to-amounts-of-burial-ointments/","cat":"image_theory","title":"New Paper:  Variations in Image Due to Amounts of Burial Ointments?"},{"id":"comment-192234","author":"sampath_fernando","post":"Sorry. Typo Neither Average Human being nor a Scientist don’t know anything about this resurrection process..","date":"2015-03-02","mins":"6:05 pm","url":"https://shroudstory.com/2015/03/01/new-paper-variations-in-image-due-to-amounts-of-burial-ointments/","cat":"image_theory","title":"New Paper:  Variations in Image Due to Amounts of Burial Ointments?"},{"id":"comment-196569","author":"sampath_fernando","post":"Daveb: What’s the answer? Our brains are so complex and goes in many directions. How can we minimise or maximise the Objective Function. But it is so complex that as there are so many variables and so many constraints. So we will never get an answer from the data availble. Based on my wisdom I think Image on the Shroud of Turin is not a man made one. If it a man made one then today with our knowledge in science and technology we would have produced more than Billions of Shroud of Turins. So only solution is, hope, one day Church authorities will allow scientists to do more testing to do to determine the age of the Shroud of Turin..","date":"2015-04-16","mins":"6:24 pm","url":"https://shroudstory.com/2015/04/16/rogers-impurity-layer-and-di-lazzaros-experiments/","cat":"image_theory","title":"Rogers’ Impurity Layer and Di Lazzaro’s Experiments"},{"id":"comment-155334","author":"sampath_fernando","post":"Charles : In short, this area remains open for further research especially through seeking expert opinion as to why the calcium might have been on the cloth in ‘large’ quantities. High quantity of Calcium – Most probably this could have occured as a result of the radiation of the body (read Skurka hypothesis). Ca would have come as a residue from the bones of the body..","date":"2014-09-24","mins":"7:24 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-195008","author":"sampath_fernando","post":"What is the most probable process to print/paint an image of a crucified man on 14 feet * 3 feet linen sheet? Does any such technology available in 1st centuary or 14 Centuary to create an image like that on linnen? Resurrection is really a miracle. That is what most (all) Christians believe. So creating a image simmilar to image on the Shroud of Turin is “out the realm of science”.","date":"2015-03-31","mins":"6:17 pm","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"},{"id":"comment-195169","author":"sampath_fernando","post":"Mr. Mo: Are you believing in resurrection?.","date":"2015-04-02","mins":"5:15 am","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"},{"id":"comment-170669","author":"sampath_fernando","post":"Those days Church Leaders killed the scientists, and today Historians are trying to do the same thing..","date":"2014-11-11","mins":"6:32 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-199723","author":"sampath_fernando","post":"Thank you Louis. Considering all the properties/aspects of the image of TS I am quite sure that it is not a man made thing..","date":"2015-05-20","mins":"4:42 pm","url":"https://shroudstory.com/2015/05/19/guest-posting-the-shroud-of-turin-an-x-ray/","cat":"uncategorized","title":"Guest Posting:  The Shroud of Turin – An X-Ray?"},{"id":"comment-199794","author":"sampath_fernando","post":"Daveb I do not believe it is necessary for high energy X rays to emanate from the bones of the person, which requires a miracle Yes resurrection is a miracle. But to get a image like TS radiation have to come from internally (from the body) and nor from externally.","date":"2015-05-21","mins":"4:24 pm","url":"https://shroudstory.com/2015/05/19/guest-posting-the-shroud-of-turin-an-x-ray/","cat":"uncategorized","title":"Guest Posting:  The Shroud of Turin – An X-Ray?"},{"id":"comment-199815","author":"sampath_fernando","post":"Hi Daveb – Shroud image is quite different to De Liso’s images. By his method he can’t get both Dorsal and Frontal images. To get frontal and dorsal images radiation has to come from inside...","date":"2015-05-21","mins":"10:16 pm","url":"https://shroudstory.com/2015/05/19/guest-posting-the-shroud-of-turin-an-x-ray/","cat":"uncategorized","title":"Guest Posting:  The Shroud of Turin – An X-Ray?"},{"id":"comment-199741","author":"sampath_fernando","post":"Jesus body did not decay it was in the tomb from Friday evening till Sunday dawn. According to experts who analyzed the Shroud image tells that the person who was wrapped in that Turin shroud was dead and also they did not find any signs that the body was decayed or decaying. Prior to Jesus death he told that resurrected bodies are similar to the Angels. According to Gospels we can read that Angels have bodies similar to humans. But Angels are quite different to humans. They can appear and also they can disappear. Angels also can sing, talk and carry things. Jesus never told that his resurrected body is same as the body he had prior to his death. Furthermore after the resurrection Jesus appeared and disappeared like Angels. Even Mary Magdalene and another two disciples couldn’t recognize resurrected Jesus. Mary recognized him from his voice but the other two disciples couldn’t recognize Jesus even hearing the voice of resurrected Jesus. Furthermore Jesus asked Mary not to touch his resurrected body as he has no being to the Father. Most probably, after being to the Father, resurrected Jesus ate. Jesus also has wounded scour marks on his resurrected body (Jesus asked Thomas to touch those) similar to the image on the TS. But resurrected body of Jesus is quite different to the body Jesus had prior to his death. As I mentioned previously no one knows about the resurrection process. If we assume Jesus resurrected bodily then we have to consider external energy sources (ie. Earth quakes) to form the body image on the shroud. If assume Jesus resurrected like an angel then we can consider internally generated energy sources (ie. Radiation, X Ray) to form the body image on the TS. As Gospel accounts supports both the bodily resurrection and resurrection with a body like Angels then we can consider both external (to body) and internal (from the body) energy sources to form the image. But based on the properties/aspects of the image on TS most probably an internal energy source is the reason to form an image on the TS..","date":"2015-05-20","mins":"9:21 pm","url":"https://shroudstory.com/2015/05/19/guest-posting-the-shroud-of-turin-an-x-ray/","cat":"uncategorized","title":"Guest Posting:  The Shroud of Turin – An X-Ray?"},{"id":"comment-199578","author":"sampath_fernando","post":"Thank you Dan for this posting. I am a strong believer that X Rays (or simmilar type of radiation) were emitted from the body of Jesus during the Resurrection Process and as a result of that image was formed on the burial cloth. As Jesus was the only one resurrected from death, it is impossible to stimulate that rwsurrection process. No one knows what sort of energy emitted during spirit (or/and soul) came back to the material body (or flesh) of Jesus..","date":"2015-05-19","mins":"4:33 pm","url":"https://shroudstory.com/2015/05/19/guest-posting-the-shroud-of-turin-an-x-ray/","cat":"uncategorized","title":"Guest Posting:  The Shroud of Turin – An X-Ray?"},{"id":"comment-199600","author":"sampath_fernando","post":"If X rays are the reason for forming the image, then as historians claimed TS is not a 14th centuary creation..","date":"2015-05-19","mins":"8:42 pm","url":"https://shroudstory.com/2015/05/19/guest-posting-the-shroud-of-turin-an-x-ray/","cat":"uncategorized","title":"Guest Posting:  The Shroud of Turin – An X-Ray?"},{"id":"comment-170294","author":"sampath_fernando","post":"Thank you OK for your very informative article. Thank you Dan for publishing it. To get an idea about grey scales historians must learn/study digital imaginary. Short course in remote sensing applications helped me to understand about grey scales and digital images..","date":"2014-11-10","mins":"2:15 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","title":"Guest Posting by O.K. on the Shroud as a Negative"}]
