[{"id":"comment-201935","author":"sampath_fernando","post":"PHPL: How can documents that sometimes don’t even agree with one another be described as accurate in the first place ? Thank you PHPL. I am having the same difficulty with the books of NT. But one day Shroud of Turin will reveal that Jesus died for fighting the injustice of the world (some say sins of the world) and the resurrection (created image on the shroud) will show that God sent the perfect human being to us to believe the message of Love and also to reveal God is in full control over the Universe..","date":"2015-06-14","mins":"4:29 am","url":"https://shroudstory.com/2015/06/13/also-because-of-the-shroud-of-turin/","cat":"press_coverage","title":"Also Because of the Shroud of Turin"},{"id":"comment-202080","author":"sampath_fernando","post":"Thank you Daveb. As engineer like you I have some difficulty between the teaching of Jesus and some theology of Paul. That is why I quote NT but not the Gospels..","date":"2015-06-14","mins":"4:25 pm","url":"https://shroudstory.com/2015/06/13/also-because-of-the-shroud-of-turin/","cat":"press_coverage","title":"Also Because of the Shroud of Turin"},{"id":"comment-202870","author":"sampath_fernando","post":"Thank you Louis. I am not agreeing or disagreeing with you. To understand Miracles, Resurrection, Creation of image on Turin Shroud, NDE, reincarnation we need some sort of divine inspiration..","date":"2015-06-19","mins":"9:39 pm","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","title":"BBC News Magazine:  The Perplexing Image"},{"id":"comment-202846","author":"sampath_fernando","post":"Thank you Louis. I went to Agra but I couldn’t go to see this monument. One day Stephen Hawking will reincarnate. Then he will realise that there is a after life. Actually I have met 3 people who remembered their past life. I hope that one day Catholic Church will certify that Shroud of Turin is a genuine burial cloth of Jesus or before that scientists will confirm it..","date":"2015-06-19","mins":"5:42 pm","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","title":"BBC News Magazine:  The Perplexing Image"},{"id":"comment-206427","author":"sampath_fernando","post":"Majority of people living on this earth are like Martin Saunders, They can mis guide many ignorant Christians. How can he condemned Shroud based on Carbon dating results. This ignorant guy knew only about the results but did not know how and from where the sample was taken to test. Also he did not know sample was contaminated or not. What a fool. Todate no one has given any conclusive idea how the image was formed on the Shroud of Turin. People like Martin Sauders write these articles only to earn money and also for the popularity. When you analyse 3 temptations Jesus overcame you can uderstand that how Jesus denied Popularity, Pride, Corruption, Material desires and Material Wealth..","date":"2015-07-23","mins":"4:54 pm","url":"https://shroudstory.com/2015/07/23/because-if-it-looks-unbelievable/","cat":"article","title":"Because If It Looks Unbelievable"},{"id":"comment-198567","author":"sampath_fernando","post":"Why Canonical Gospels have not mentioned anything about the Shroud. (also about the other disciples of Jesus)? According to Gospel of John we know that Peter and John saw the burial clothes of Jesus at the Tomb. But John did not write that they took the burial clothes with them. Why? Most probably they did not want to steal the clothes which were belonging to Joseph of Arimathea. During the last 3 months 3 reformed Christians (born again) condemned the Shroud of Turin because it is an image. They did so because they believe that Scriptures (Bible) are inspired by God. So is this the same reason Gospel writers did not want to mention the image on the burial cloth of Jesus? They may have thought their eye witness record (of resurrection) is more important than the image on the burial cloth. However according to Gospel of Hebrews Jesus gave the Linen Cloth to the Servant of Priest. Who is this servant? Most probably this servant is one of the other disciples not mentioned in the canonical Gospels (after Jesus death). Four canonical gospels are not giving any information about the other disciples after the death of Jesus. We can read only about Peter, John and Thomas before the ascension. There some names in John 21:1 3. We can’t read anything about Thomas who preached in India. Gospel of Hebrews was written in middle of the second century and the writer of this Gospel knew about the linen cloth. May the writers of canonical gospels did not know about it or just ignored it..","date":"2015-05-07","mins":"6:43 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198525","author":"sampath_fernando","post":"Before destroying Mr Wilson’s argument we can destroy the Paint hypothesis of Mr. Freemans. How painted image became a Negative Image after flaking off the pigments? Shroud of Turin image is not a painted one..","date":"2015-05-07","mins":"4:48 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-208395","author":"sampath_fernando","post":"If non scientists created the shroud image then why today’s expert scientists can’t create a similar image?.","date":"2015-08-16","mins":"8:23 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-198312","author":"sampath_fernando","post":"Mr Berry and Mr Freeman are helping us to believe in Shroud of Turin as a genuine one. I like Mr. Berry’s experiments. Still he struggling to achieve the features of Shroud of Turin. Furthermore Mr. Freeman’s hypothesis is very interesting. His painted image became a photographic Negative with 3 D coding. (painted pigments flaked off miraculously giving us a negative image). What sort of miracle is it..","date":"2015-05-04","mins":"6:04 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-208523","author":"sampath_fernando","post":"When Mr. Farey called Daveb is not an engineer, as an (civil/environmental) engineer I realised what is the real meaning of ignorance..","date":"2015-08-18","mins":"5:35 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-208524","author":"sampath_fernando","post":"Sorry When Mr. Farey called Daveb is not a scientist, as an (civil/environmental) engineer I realised what is the real meaning of ignorance..","date":"2015-08-18","mins":"5:37 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-208528","author":"sampath_fernando","post":"Yes everyday I am learning and undersatanding many things including people.","date":"2015-08-18","mins":"6:25 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-208642","author":"sampath_fernando","post":"Thank you Colin for your determination. However either on 1st century or 14th century no one had that sort of technology to print an imgage similar to image like Shroud of Turin. Shroud is 14 feet long and 3 feet wide. If they had the technology, today we could have seen many diferent type of images printed in either 1st or 14th century..","date":"2015-08-20","mins":"4:54 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-208532","author":"sampath_fernando","post":"Thank you Louis. That is an opinion of individual..","date":"2015-08-18","mins":"7:12 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-200455","author":"sampath_fernando","post":"Yes Louis Jesus did not go to India but according to legends St Thomas went to Kerala and later some Jewish traders went to Sri Lanka and established a small Christian community in 4th centaury. Recently they found a Nasrine or Persian cross in place call Anuradhapura and now that cross is in Anuradhapura (small) museum. However Sri Lankan Methodists printed a sketch of that cross in the front cover of their Hymn book. I am planning to go to Kerala to find more information about the mission of St Thomas..","date":"2015-05-28","mins":"4:32 pm","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"id":"comment-200472","author":"sampath_fernando","post":"Thanks Louis I have been that Church in Mylapore..","date":"2015-05-28","mins":"7:01 pm","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"id":"comment-200500","author":"sampath_fernando","post":"John confirmed in his Gospel that Jesus really died. Who is not believing that?.","date":"2015-05-29","mins":"5:18 am","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"id":"comment-200454","author":"sampath_fernando","post":"Thank you Daveb. Without knowing any scientific research (today), the fisherman John mentioned that the blood and water came from the body to prove that Jesus was really died on the cross. That is is why I like Gospel of John very much. It gives us a good summary of Jesus mission, his death and also the resurrection (including the burial clothes)..","date":"2015-05-28","mins":"4:21 pm","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"id":"comment-200637","author":"sampath_fernando","post":"Hi Louis I am going to Kerala in Jan 2016. However next month I am going to Spain. This time I can’t go to Oviedo. Where did they keep Sudarium in Seville? Any idea/.","date":"2015-05-31","mins":"12:05 am","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"id":"comment-200566","author":"sampath_fernando","post":"Miguel Lorente Acosta: Our hypothesis is that during the process of the preparation of the body, it was discovered that Jesus had not died on the cross. It is not an idea conceived beforehand nor is it a questioning of seemingly inexplicable specific events, but rather the consequence of the study of objective elements that appear on the Shroud of Turin. The arguments are to be found in the Shroud itself and have been divided under two broad headings: On the one hand, the signs that indicate that the body which produced the image was not that of a dead person, and, on the other hand, the evidence of signs that somehow reflect vitality in the elements of the Shroud. Good on you Louis. We can kill two birds in one stone: (Gospel John tells that Jesus really died) So what can we deduce from his hypothesis 1. Image was created during the process of resurrection (Louis – split second between death and life – or body started moving with the flow of blood??) 2. Blood is real Am I wrong?.","date":"2015-05-29","mins":"11:10 pm","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"id":"comment-200697","author":"sampath_fernando","post":"Thank you so much Louis. If I need more information I will email to you. Earlier when I wrote – “body started moving with the flow of blood” – I realy meant recirculation of blood inside the body and not flowing out blood from the body..","date":"2015-05-31","mins":"4:43 pm","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"id":"comment-201301","author":"sampath_fernando","post":"Shroud of Turin is the only evidence we have today to prove that Jesus really died on the cross. As most of us are suspecting Resurrection of the dead body of Jesus is the only reason to print an image on the Shroud. Furthermore we have never seen a piece of linen cloth had an printed image similar to the Shroud of Turin, from a wrapped body of a living person. If Jesus had not died on the cross then we never get an image on the Shroud of Turin. To prove Shroud of Turin as a fake item, then scientists have to create a image similar to the Shroud of Turin using a living person and also have to confirm that such technology was available in the 14th century..","date":"2015-06-08","mins":"3:42 am","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"id":"comment-200924","author":"sampath_fernando","post":"Hi Mr. Felzmann; Do you have any idea about the formation of the image on the Shroud if the man under the shroud must have still been alive?.","date":"2015-06-02","mins":"5:28 pm","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"id":"comment-195697","author":"sampath_fernando","post":"Hugh: Now, what is the probability that a Spanish cloth dating from the 8th century and a French cloth dating from the 14th century both wrapped the head of a man in the 1st century? I have no doubt that, it all depends on the amount of Contamination. Did anyone found that those two clothes are without any contamination and are on the original state? Who think those two clothes are suitable for Carbon dating to decide their age?.","date":"2015-04-08","mins":"3:54 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","title":"Easter Ink"},{"id":"comment-197774","author":"sampath_fernando","post":"Interesting Daveb. However you did not touch; reincarnation, eternal conciousness, results from regression therapies and NDE. Upanishads tell that at the begining all were with the Creator and they left the creator and finally all who left the creator wanted to unite with the creator again. In Revelation we can read about the fallen angels. According to parable of Prodigal son who is this son and why father is waiting for his return? That is why Jesus came to this world to take lost angels back to the kingdom of God. Jesus main message was “Love”. Look at the Shroud. You can see that Love there. See how much Jesus suffered tell us how much father is loving us. Until science tell me how the image got printed on that linen piece Shroud is real for me. I never believe controversial Carbon Dating results..","date":"2015-04-27","mins":"4:45 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197781","author":"sampath_fernando","post":"Thank you Daveb: I have not read in any other religions a person like Jesus. Jesus is only person died and resurrected. Most probably Shroud is the only witness to that..","date":"2015-04-27","mins":"6:42 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-212952","author":"sampath_fernando","post":"Hi OK – I am agrreing with you. But how can you explain the image formation of hair. Was it followed the shortest direction or the verticle direction?.","date":"2015-10-18","mins":"11:05 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-196348","author":"sampath_fernando","post":"If Gospels are true; Luke 23:46 (New International Version) Jesus called out with a loud voice, “Father, into your hands I commit my spirit.” When he had said this, he breathed his last. Mark 15:38 (New International Version) The curtain of the temple was torn in two from top to bottom. From the above we can see that when Jesus handed over his spirit to the Father, how much energy dispatched from his body. That energy was so powerful that even the curtain of the temple was torn in two from top to bottom. As I mentioned previously no one knows about the resurrection process and no one knows how much energy is required to enter the spirit of Jesus back to his dead body. Can anyone explain about this energy? What type? and What quantity?.","date":"2015-04-14","mins":"4:53 pm","url":"https://shroudstory.com/2015/04/14/interview-with-paolo-di-lazzaro/","cat":"article","title":"Interview with Paolo Di Lazzaro"},{"id":"comment-213029","author":"sampath_fernando","post":"Hi Mr. Farey – As a logical thinker I knew you are going to ask that question. Before giving my answer I must thank to Dan for this valuable and unique site on Shroud of Turin. I was exposed to Shroud on 1 April 2010 and after that I gave my leisure time to do research on Shroud and this Dan’s site helped me to learn almost all about the Shroud. It is nice and good experience to listen to all sort of people and absorb many positive as well as negative things about the Shroud. Mr. Farey, the blood on hair is the Trade Mark of Authenticity of the Shroud. It tells that image on Shroud is not a painting as well as not a contact process. Furthermore Blood on Hair tell us that image was formed due to some form of Radiation. This Blood on Hair confirmed that it is not a work of a forger. Resurrection is a unique incident in Human history. No one ever resurrected from the death after three days. So my imagination is that at Resurrection Jesus body got dematerialized and radiation emitted from the body including Hair. That is why we can see blood on Hair on the image. Scientific research on Shroud tells us that the body which was caused the image on Shroud never got deteriorated. Furthermore STURP research tells us that blood came first before the formation of image. Dr. Lavoie’s observation also confirmed that blood on cheeks came first before the formation of image. OK is 90% correct to say that image was formed by shortest distance due to some sort of emission of waves from the body. Dr. Lavoie is also 1 5% correct shroud was flat and vertical projection was the mechanism. Now I give the possible missing link (say 5% accuracy) Mr. Farey can you remember I posted a clip which shows that when radiating hair blows out. What can we get from that clip? This is my hypothesis: At resurrection Jesus body got dematerialized and radiation emitted from the body. Due to this radiation image was formed on the Shroud. During this process hair got blown out and as a result of that draped cloth expanded on the cheek area and image of hair got printed on the blood absorbed area of the cheek. Mr. Farey what do you think? Unlike Engineer Daveb, my communication is not that good because English is my second language..","date":"2015-10-19","mins":"4:23 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-192995","author":"sampath_fernando","post":"Dear Mr. Farey. Do you believe Image on Shroud of Turin was produced in 14th century based on Carbon Dating results of the shroud? According to your opinion how the image on Shroud of Turin was produced or formed? Thank you..","date":"2015-03-09","mins":"6:27 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"id":"comment-196354","author":"sampath_fernando","post":"At resurrection: Matthew 28:2 (New International Version) There was a violent earthquake, for an angel of the Lord came down from heaven and, going to the tomb, rolled back the stone and sat on it. At resurrection where this energy came from to have violent earthquake?.","date":"2015-04-14","mins":"6:30 pm","url":"https://shroudstory.com/2015/04/14/interview-with-paolo-di-lazzaro/","cat":"article","title":"Interview with Paolo Di Lazzaro"},{"id":"comment-213193","author":"sampath_fernando","post":"I think Shroud got expanded less than 30 degrees from the verticle plane. If Shroud is fully flat then blood marks goes outside the hair. Of course hair covered the ears..","date":"2015-10-20","mins":"6:34 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-212451","author":"sampath_fernando","post":"Every piece of these timber (or none) may not be from the true cross But how this brain washed John Calvin – second generation reformist – spread false rumours to attract people from Catholic Church to their new church?.","date":"2015-10-13","mins":"6:43 pm","url":"https://shroudstory.com/2015/10/13/more-carbon-dating-and-other-studies-of-christian-relics/","cat":"article","title":"More Carbon Dating and Other Studies of Christian Relics"},{"id":"comment-193023","author":"sampath_fernando","post":"Yes, to date no one knows or can explain how the image was formed on the Shroud of Turin. But we know that it is a negative photograph and in 14th Century no one had any technology to produce a such an image on 14 feet by 3 feet long sheet with three dimensional coding..","date":"2015-03-10","mins":"4:02 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"id":"comment-193078","author":"sampath_fernando","post":"When human can’t understand how image was created then we need help from heaven. As Christians we are believe in God the Father then we have to believe in his heavenly hosts including Guardian Angels. I believe in Guardian Angels. So Leon I believe you..","date":"2015-03-10","mins":"4:54 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"id":"comment-192989","author":"sampath_fernando","post":"Dear Daveb One skeptic says it is a painting. He says so, because he doesn’t know the difference between a painting and a negative photographic image. Other skeptics do not know how the image was formed. Some says it is a scorch. No one even Christians do not know what was involved in Resurrection Process. So without telling us how it was formed they tell us it is a fake. No one can produce any other image similar to image on shroud of Turin or can produce any other image which was produced in 14th Century or even 21st Century. Furthermore these skeptics can not understand the difference between Grab sample and composite sample. They don’t know what is the meaning of represetative sample. Even they don’t know what is the meaning of contamination. So Daveb please don’t give up. I have learnt many from you. Hope to learn more in the future. God Bless You..","date":"2015-03-09","mins":"5:03 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"id":"comment-207507","author":"sampath_fernando","post":"Very interesting discussion. I don’t know the person who created an image on the Shroud is a Scientist or Artist or Photographer or a any other person or the creater of this universe? However I can describe that person as a one of the greatest scientist as he created this image before highly developed science came to existence. Still so call scientists are struggling to explain how the image was formed..","date":"2015-08-05","mins":"5:42 pm","url":"https://shroudstory.com/2015/08/05/scientist-barrie-schwortz/","cat":"article","title":"Scientist Barrie Schwortz"},{"id":"comment-207521","author":"sampath_fernando","post":"Of course, the image is the work of that greatest scientice..","date":"2015-08-05","mins":"8:26 pm","url":"https://shroudstory.com/2015/08/05/scientist-barrie-schwortz/","cat":"article","title":"Scientist Barrie Schwortz"},{"id":"comment-199123","author":"sampath_fernando","post":"Today we know that the one who painted (scorched, chemist) the Image knew all the following information in 14th century: 1. Photographic Negatives 2. X Ray like properties 3. Nail was punched at wrist but not at the palm (innovation) 4. How blood is flowing (knowledge of Fluid Mechanics) 5. How to create the image only at top (thickness of 2nm) but blood has to penetrate first 6.Not a 2 D image but accurate measurement for a curved image (as sheet was covered the dead body) 7. Three Dimensional coding 8. Crown of thorn as a helmet like thing 9. One leg bent over the other leg (one leg is short) 10. To show 4 fingers (not the thumb) due to nailed the person from the wrist and not from the palm. 11. What type instrument used the beat the person 12. How to find suitable linen to create the image What a wonderful person is that painter (scorcher, chemist). If that person is born today he will do marvellous things as he can see many things which will come in the future. (What sort of innovator is he?.","date":"2015-05-14","mins":"4:55 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","title":"Too Great to Be a Work of Art"},{"id":"comment-208208","author":"sampath_fernando","post":"Hope one day Colin can get an image only on the top of a surface of a linnen giving 3 D coding..","date":"2015-08-13","mins":"10:25 pm","url":"https://shroudstory.com/2015/08/05/scientist-barrie-schwortz/","cat":"article","title":"Scientist Barrie Schwortz"},{"id":"comment-210000","author":"sampath_fernando","post":"As daveb says those who involved in taking the sample did not follow proper proceedure. They took a grab sample (no engineer do that sort of mistake) instead of representative sample and told the world that Shroud is a medieval forgerry. They may have adopted correct laboratory procedures but this do not imply that their results are correct. No one knows when the textile was woven. No one knows how the image got printed. No one knows whether they took the sample from an original linen cloth. Very interesting..","date":"2015-09-09","mins":"6:15 pm","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-199256","author":"sampath_fernando","post":"But TS is the only one have those properties..","date":"2015-05-16","mins":"2:51 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","title":"Too Great to Be a Work of Art"},{"id":"comment-199129","author":"sampath_fernando","post":"Mr Farey: Could you please explain how the image was created? Any idea?.","date":"2015-05-14","mins":"6:16 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","title":"Too Great to Be a Work of Art"},{"id":"comment-208451","author":"sampath_fernando","post":"I prefer the experiments done by Dr. P. Di. Lazzaro. Compared to the experiments done by other scientists, Dr. Lazzaro’s experiments give us some sort of food for thought to imagine how the image on TS was created. Definitely some sort energy dissipated from the dead body of Jesus as resurrected body of Jesus quite different to the body he had before his death..","date":"2015-08-17","mins":"7:30 pm","url":"https://shroudstory.com/2015/08/17/and-now-antonaccis-test-the-shroud-proposal-is-to-be-a-book/","cat":"books","title":"And Now Antonacci’s Test the Shroud Proposal is to be a Book"},{"id":"comment-192441","author":"sampath_fernando","post":"Confused people who don’t know how the image got printed (or cannot explain) on the burial cloth of Jesus (or Shroud of Turin) use Controversial Carbon dating results to prove their claims that TS is a fake..","date":"2015-03-04","mins":"7:09 pm","url":"https://shroudstory.com/2015/03/04/inside-the-popes-bedroom-and-more/","cat":"books","title":"Inside the pope’s bedroom and more"},{"id":"comment-198660","author":"sampath_fernando","post":"Mr. Mattingly going on a wrong path..","date":"2015-05-08","mins":"5:20 pm","url":"https://shroudstory.com/2015/05/08/new-book-by-stephen-mattingly-proposes-image-mechanism/","cat":"books","title":"New Book by Stephen Mattingly Proposes Image Mechanism"},{"id":"comment-214551","author":"sampath_fernando","post":"This is what I read in an article: I was puzzled by the fact that on certain photographs these letters were visible and not on others, so I consulted professional photographers. They told me that because the image is present only on the most superficial one to two fibers of the cloth, (each thinner than a human hair), the FOCUSING OF THE LENS (distance) by the individual photographers is of the utmost importance and that varies from photographer to photographer..","date":"2015-11-12","mins":"8:17 pm","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin"},{"id":"comment-210231","author":"sampath_fernando","post":"Thank you Louis. Even yesterday I told an Anglican that this is not an image to worship but to prove that resurrection is real. How lucky we are because non Christian, Barrie, is taking major role to tell the world that Shroud is not a man made image. When I am talking to Buddhists, Hindus and Atheists I am using Shroud to convince them that resurrection is real. Unfortunately still people can’t understand that any thing about negative image and today we don’t have any negative image man made negative image either in 13th century or 1st century. How a flaked out painting give us a perfect negative..","date":"2015-09-12","mins":"7:08 pm","url":"https://shroudstory.com/2015/09/12/new-barrie-schwortz-podcast/","cat":"radio_and_podcasts","title":"New Barrie Schwortz Podcast"},{"id":"comment-207120","author":"sampath_fernando","post":"Thank you Barrie for your honest explainations. I believe..","date":"2015-08-01","mins":"1:36 am","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Catholic Radio Indy"},{"id":"comment-210334","author":"sampath_fernando","post":"I am agreeing with you Mr. Freeman. But we do not have any evidence. To prove that we should have more images similar to Shroud of Turin..","date":"2015-09-14","mins":"12:43 am","url":"https://shroudstory.com/2015/09/12/new-barrie-schwortz-podcast/","cat":"radio_and_podcasts","title":"New Barrie Schwortz Podcast"},{"id":"comment-182208","author":"sampath_fernando","post":"Yes Mr Farey, today we have all this scientific knowledge. Other than TS do have any other painting to support your claim (painted in 14th or 1st century). TS is a unique image which no one can explain accurately how was created. I am believing in miracles and that is why I am follower of Jesus. No human can explain how Jesus did those miracles including the image printed on the Shroud. Today human’s can give all sort of theories or hypothesis about the creation of the TS image unfortunately no one was able to produce an exact image like TS which was revealing the passion of Jesus..","date":"2015-01-09","mins":"2:42 pm","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"id":"comment-182252","author":"sampath_fernando","post":"Zittau Veil is not a negative image. Furthermore if you take a negative photograph of those shadowy images that will never give you a positive image..","date":"2015-01-09","mins":"9:30 pm","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"id":"comment-214556","author":"sampath_fernando","post":"Hi Mr. Farey – Do you have any idea why those medieval painters (or scorchers) created a negative image rather than a positive image of battered body..","date":"2015-11-12","mins":"10:06 pm","url":"https://shroudstory.com/2015/11/09/because-i-dont-see-it/","cat":"video","title":"Because I Don’t See It"},{"id":"comment-214549","author":"sampath_fernando","post":"Thank you Louis. Here most interesting point is outsiders who do not know the language saw the letters. Later person who knew the language interpret it. If Ms Frale see the letters and translate it then it is real forgery. But in this case people who don’t know each other saw the letters and interprit it. I can’t see any forgery there..","date":"2015-11-12","mins":"7:41 pm","url":"https://shroudstory.com/2015/11/09/because-i-dont-see-it/","cat":"video","title":"Because I Don’t See It"},{"id":"comment-214542","author":"sampath_fernando","post":"Mr Farey – “the homogeneity of the image is one of the arguments in favour of a medieval creation” Mr Latendresse’s explanation is very interesting. Mr Farey there is no logic in your statement. Why the Artist or scorcher placed blood on hair? I don’t know why Mr. Freeman is blaming Ms Frale without any reason. As Louis said she did not see the letters but someone else saw it and sent it to her to interpret. Other interesting we get the mirror image of letters on the shroud and could see it only on the positive image..","date":"2015-11-12","mins":"4:13 pm","url":"https://shroudstory.com/2015/11/09/because-i-dont-see-it/","cat":"video","title":"Because I Don’t See It"},{"id":"comment-214546","author":"sampath_fernando","post":"Mr. Farey – “A bas relief covered with an acidic paste, on the other hand, would do the trick quite nicely, if the paste was thoroughly washed off” Has anyone done simmilar technique to a Proto Type Image – Full size image of a person for both frontal and Dorsal sides?.","date":"2015-11-12","mins":"6:06 pm","url":"https://shroudstory.com/2015/11/09/because-i-dont-see-it/","cat":"video","title":"Because I Don’t See It"},{"id":"comment-193300","author":"sampath_fernando","post":"Hi Daveb – logically you are correct. Only thing I can’t understand is why Jesus asked John to look after Mother Mary after his death. Usually mother stays with daughters or sons. That is why I thought those brothers and sisters are children of Joseph but not of Mary. No one knows about whether Mary had sexual relationship with Joseph or not. It is a private thing which no one discloses..","date":"2015-03-13","mins":"4:23 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"id":"comment-193247","author":"sampath_fernando","post":"Disciple John took Mother Mary to Ephesus in Turkey. According to word of mouth John made a small house for Mother Mary on a top of a mountain and I was lucky to visit that place.Furthermore I believe that Jesus had step brothers and sisters or cousin brothers and sisters..","date":"2015-03-12","mins":"6:33 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"id":"comment-193314","author":"sampath_fernando","post":"Hi Daveb – “disciple whom Jesus loved”. I don’t think that person is a family member. Jesus supported his disciples more than his brothers and sisters (read Matthew 12:46 50). Yes according to this passage Jesus supported his disciples more than his brothers and sisters (including the James the leader of church in Jerusalem). Jesus never asked James to look after his mother. Why? There must be a reason. Why mother Mary accepted that person as his son rather than her own children. Definitely disciple whom Jesus loved is not a family member of Jesus. That person must be the person who wrote Gospel of John..","date":"2015-03-13","mins":"6:42 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"id":"comment-192560","author":"sampath_fernando","post":"Skeptics never give sources because they are working on speculations. Why these people are ignoring published scientific work?.","date":"2015-03-05","mins":"4:14 pm","url":"https://shroudstory.com/2015/03/05/keeping-an-audience-in-suspense/","cat":"television","title":"Keeping an audience in suspense"},{"id":"comment-193444","author":"sampath_fernando","post":"I believe Gospel of John than other three Gospels as it is the only Gospel ention about the burial cloth of Jesus and as well as the face cloth. So I am alinged to believe this author that Mother Mary did not have any other children and that is the reason Jesus asked the disciple he loved most to look after his mother after his death. Furthermore Mother Mary accepted Jesus advise and accepted this person as her son. If she had other children by her own she never accepted the advise of Jesus..","date":"2015-03-15","mins":"4:58 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"id":"comment-212947","author":"sampath_fernando","post":"Thank you Dan. I like the explaination by Gilbert Lavoie about the showing of blood in the hair. ” It is not from hair but from cheeks. So it is a very good evidence to show that image is not a painting also not formed by a contact process”. I like his demonstation..","date":"2015-10-18","mins":"9:14 pm","url":"https://shroudstory.com/2015/10/18/raymond-arroyos-special-report-from-april/","cat":"video","title":"Raymond Arroyo’s Special Report from April"},{"id":"comment-211111","author":"sampath_fernando","post":"Hi Louis: Very interesting discussion. What is Sin? Doing something against your consciousness? Or Not loving your neighbor as thyself? Or Breaking the New Commandment of Love?.","date":"2015-09-24","mins":"5:42 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"id":"comment-211113","author":"sampath_fernando","post":"Hi Mr. Russ Breault and Mr. Simon Brown. Than you very much for that interveiw. This my understanding about the burial procedure. According to Gospels of Matthew, Mark and Luke, Joseph of Arimathaea and Nicodemus wrapped the body of Jesus with a clean linen cloth and Mary Magdalene and Mary the mother of Joses and also other women which came with him from Galilee were there. Furthermore those Gospels do not tell anything about applying spices. But John who was not at the tomb tell us that Joseph of Arimathaea and Nicodemus wound the body of Jesus with the spices. Furthermore Gospels Matthew, Mark and Luke tell us that these ladies came to tomb at the end of the Sabbath (at dawn) with spices to anoint the body. I think John who was not at the tomb on Friday evening assumed that Joseph of Arimathaea and Nicodemus anoint the body of Jesus spices and wound the body of Jesus with linen clothes. Contrast to the other synoptic gospels John does not tell that women went to tomb to anoint the body with spices. So what did John see at the tomb on the Sunday morning? He saw the face cloth, he saw the linen cloth which was used to wrap the body of Jesus and also he saw the other linen clothes which was not used but intend to use on Sunday, to wrapped the body of Jesus, after anointing the body with spices..","date":"2015-09-24","mins":"6:17 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"id":"comment-211116","author":"sampath_fernando","post":"Thank you Louis. But Jesus tells us “Spirit is willing but flesh is weak”.","date":"2015-09-24","mins":"6:38 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"id":"comment-211520","author":"sampath_fernando","post":"Very interesting article Daveb. Thank you..","date":"2015-09-29","mins":"8:11 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"id":"comment-211629","author":"sampath_fernando","post":"Thank you Louis. Question to Historians – Which one came first? Jesus mosaic in Sanliurfa ( ancient Edessa) or the Shroud of Turin?.","date":"2015-10-01","mins":"5:09 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"id":"comment-200211","author":"sampath_fernando","post":"Thank you Daveb I like Acetta’s original paper..","date":"2015-05-26","mins":"3:25 am","url":"https://shroudstory.com/2015/05/20/shroud-prompted-return-to-faith-for-august-accetta/","cat":"video","title":"Shroud Prompted Return to Faith for August Accetta"},{"id":"comment-208992","author":"sampath_fernando","post":"Wrong understanding Simon, to save we have to be like Jesus or have to love everyone (our neighbours) as ourselves like Jesus did (don’t discriminate any religion or any person). Please refer 1 John 4:17..","date":"2015-08-25","mins":"11:59 pm","url":"https://shroudstory.com/2015/08/25/simon-brown-video-of-barrie-schwortz-at-jalsa-salana-uk/","cat":"video","title":"Simon Brown Video of Barrie Schwortz at  Jalsa Salana UK"},{"id":"comment-209050","author":"sampath_fernando","post":"What is meaning of This Simon: “That means not by Allah, not by Mary, not by Buddha, but Jesus Christ of Nazareth alone, and not by being “loving and caring people.” alone.” Why did you discard, Allah, Mary and Buddha. Also by following the religions founded by others you can behave like Jesus and show your love to others..","date":"2015-08-26","mins":"6:22 pm","url":"https://shroudstory.com/2015/08/25/simon-brown-video-of-barrie-schwortz-at-jalsa-salana-uk/","cat":"video","title":"Simon Brown Video of Barrie Schwortz at  Jalsa Salana UK"},{"id":"comment-209075","author":"sampath_fernando","post":"Jesus never asked us to be a Christian or Catholic. His main message was Kingdom of Heaven is here “Repent” or change our ways. (or follow me and practice the concept of Love”.","date":"2015-08-27","mins":"1:34 am","url":"https://shroudstory.com/2015/08/25/simon-brown-video-of-barrie-schwortz-at-jalsa-salana-uk/","cat":"video","title":"Simon Brown Video of Barrie Schwortz at  Jalsa Salana UK"},{"id":"comment-202705","author":"sampath_fernando","post":"Yes Don radiation emitted from the dead body of Jesus and creating an image on the burial cloth is a miracle. No scientist can re enact the resurrection process..","date":"2015-06-18","mins":"7:50 pm","url":"https://shroudstory.com/2015/06/17/the-shroud-on-nbcs-today-show/","cat":"television","title":"The Shroud on NBC’s Today Show"},{"id":"comment-209079","author":"sampath_fernando","post":"All are children of God whether you are Christian or not and so anyone can born again..","date":"2015-08-27","mins":"2:46 am","url":"https://shroudstory.com/2015/08/25/simon-brown-video-of-barrie-schwortz-at-jalsa-salana-uk/","cat":"video","title":"Simon Brown Video of Barrie Schwortz at  Jalsa Salana UK"},{"id":"comment-209051","author":"sampath_fernando","post":"Louis I noticed the same thing. I could not believe the explanations given by Hugh to the community..","date":"2015-08-26","mins":"6:27 pm","url":"https://shroudstory.com/2015/08/26/youtube-of-barrie-schwortz-at-ahmadiyya-annual-convention/","cat":"video","title":"YouTube of Barrie Schwortz at Ahmadiyya Annual Convention"}]
