[{"id":"comment-191174","author":"sampath_fernando","post":"CF As Hugh has pointed out in the British Society bulletin there are major problems with the pollen on the Shroud. What are the major problems with the pollen on the Shroud? ..","date":"2015-02-16","mins":"4:00 am","url":"https://shroudstory.com/2015/02/15/important-new-pollen-discovery-on-the-sudarium-of-oviedo/","cat":"press_coverage","title":"Important New Pollen Discovery on the Sudarium of Oviedo?"},{"id":"comment-207282","author":"sampath_fernando","post":"Thank you Dan for publishing Mr. Breault’s interviews. For me Shroud and Sudarium is genuine. I agree with Yannick for further research to confirm those claims..","date":"2015-08-02","mins":"4:29 pm","url":"https://shroudstory.com/2015/08/02/interview-with-mark-guscin/","cat":"sudarium","title":"Interview with Mark Guscin"},{"id":"comment-198203","author":"sampath_fernando","post":"Thank you Dan giving us this translation. Day by day we are coming closer to the truth. Which one is more powerful Faith or Science (carbon dating results)?.","date":"2015-05-03","mins":"6:42 am","url":"https://shroudstory.com/2015/05/03/shroud-and-sudarium-blood-agreement/","cat":"2015","title":"Shroud and Sudarium Blood Agreement"},{"id":"comment-195765","author":"sampath_fernando","post":"Louis: Thank you for your interesting paper. I know, oneday some one will prove that both the Shroud of Turin and the Sudarium of Oviedo wrapped the same person in first centuary..","date":"2015-04-08","mins":"4:44 pm","url":"https://shroudstory.com/2015/04/06/new-paper-on-the-sudarium-of-oviedo/","cat":"sudarium","title":"New Paper on the Sudarium of Oviedo"},{"id":"comment-215514","author":"sampath_fernando","post":"As no one has seen the crucifixion and also the resurrection process people are making a lot of assumptions. Some assumptions may be correct and the other may be wrong. My assumption for the formation of image is dematerialization of the body and related radiation from it. As most of the Christians believe, Jesus did not resurrect bodily but resurrect only spiritually. Jesus resurrected with his spiritual body and discarded his material body. (Remember Jesus once said that spirit (or spiritual body) is willing but flesh (material body) is weak) So no one knows how the radiation initiated and also during that process how the body was reacted. Also no one knows what happen to the hair. My assumption is that most probably hair got blown out during this process. As I have previously stated the force of the blown out hair helped to raise the wrapped cloth such a way the image of the hair got printed on the formally blood tainted area of the cheeks. That was the main reason that image got blood in hair. This expansion of cloth in the face area is main reason for not to have image from the top of the head. No forger or no painter place blood in the hair. Blood in the area of the hair of the image is the trade mark of authenticity of the Shroud of Turin..","date":"2015-12-02","mins":"8:19 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215581","author":"sampath_fernando","post":"Thank you Mr. Carney. Yes I have meditated many times on Luke 24:39, then when I read the word Jesus “disappeared” from the site I couldn’t understand how a solid body able to disappear from the site or able to enter from the solid walls and locked door. I think like angles Jesus spiritual body also managed to gain material features when essential. This transformation body status is the most difficult thing to understand..","date":"2015-12-03","mins":"3:50 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215444","author":"sampath_fernando","post":"We engineers are trained to deal with forces. I think no one has ever seen a crucifixion. May be Jesus on the standing position initially but when time goes on he had to be on the hanging position. His legs couldn’t take the weight of his body after loosing blood That is why they nailed Jesus from wrists rather than from the palm..","date":"2015-12-01","mins":"3:40 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215606","author":"sampath_fernando","post":"Mr. Carney “It is also common Christian understanding that after our lives on earth, the resurrected body that we will eventually have will be physical but have far more capabilities (and permanence) than the sin laden one we have here”. Jesus never mention anything like this and from where this thought originated? Mr. Carney I also believe in Multiverse. Spiritual Universe and Material Universe have a common area. (intersection of set theory). That is why Guardian angles can take material bodies when they want. Sorry this is only a logical question. If Jesus died for our sins then why did he resurrect with same body? If he resurrected from the same body then purpose dying for our sins is lost..","date":"2015-12-04","mins":"2:58 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215599","author":"sampath_fernando","post":"Thank you Colin for this interesting information..","date":"2015-12-04","mins":"1:03 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"}]
