[{"title":"A Significant Criticism of STURP","post":"It is always an easy matter to criticise those who have gone before, while having the distinct advantage of hindsight, in the case of STURP now more than 30 years. \nThe earlier 1969-73 Turin Commission appointed by Cardinal Pellegrino had been a secretive matter, even the names of the members not being revealed until 1976, only some two years before the STURP team were granted their access to the relic.  The names of the Commission are now a matter of record, but they did include Professor Curto an expert on textiles and an agnostic, later replaced by Professor Gilbert Raes of Ghent, who was granted some significant samples.  It also included Noemi Gabrielli an art director, presumably knowledgeable on matters of art.  Conclusions of this Commission were quite indefinite.  The best they came up with was a set of recommendations for further testing, and that no fraudulent substance had been detected, and the results of the sticky-tape pollen sampling by Max Frei.  Attempts to analyse the bloodstain samples were quite fruitless, and had to await the later investigations by the STURP specialists.  \nThe imaging specialist on the later STURP team was Barrie Schwortz.  As well there were those with X-ray equipment, and various other radiant equipment, UV and IR.  The initial ignorance concerning the true nature of the image can be gleaned from Barrie’s later comments, that he imagined he was getting a free trip to Turin, discover that the image had been painted, he would see the sights, and return home.  And of course that is not how things turned out at all.  Even loose cannon Walter McCrone maintained to his dying day that the image had been painted.  That was the extent of the ignorance concerning the nature of the image in 1978.  It was only when STURP examined the cloth by back-lighting so that only the bloodstains remained visible, and when X-ray plates determined the absence of any heavy minerals, that painting could be conclusively excluded.  \nThe STURP project was carried out under tight constraints and protocols, not merely in time, only 72 hours being granted, but also the requirement of prior approval for their experimental programme.  There was therefore only limited opportunity for extending this predefined scope as a result of any fortuitous or serendipitous discovery during the project.\nIt may be true that the reasons for the image negativity with its left-right and light-dark reversals, because of the type of imaging process inherent in whatever process caused the image, whether by contact or other, was not understood and had not taken root.  But that insight has the advantage of a great deal more knowledge resulting from the work of the STURP project itself, and also the advantage of duration in time to reflect on its implications.\n\n","date":"July 30, 2014 at 7:50 am","url":"https://shroudstory.com/2014/07/30/a-significant-criticism-of-sturp/","cat":"other_blogs","id":"comment-141219","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Significant Criticism of STURP","post":"A superb rebuttal summarized perfectly in your final line.\n\n","date":"July 30, 2014 at 9:17 am","url":"https://shroudstory.com/2014/07/30/a-significant-criticism-of-sturp/","cat":"other_blogs","id":"comment-141232","author":"David Goulet","site":"shroudstory"},{"title":"A Significant Criticism of STURP","post":"As the days get darker and darker, the more we look at the Shroud, the more we can see.  The more we listen to the Shroud, the louder it speaks.\n\n","date":"July 30, 2014 at 8:35 am","url":"https://shroudstory.com/2014/07/30/a-significant-criticism-of-sturp/","cat":"other_blogs","id":"comment-141225","author":"Stan Wenninger","site":"shroudstory"},{"title":"A Significant Criticism of STURP","post":"I thought that the image on it was actually getting paler and paler so that it is now barely discernible to the naked eye . A sharp contrast to the medieval times where the image was so bright, so vivid, so intense .\n\n","date":"July 30, 2014 at 8:55 am","url":"https://shroudstory.com/2014/07/30/a-significant-criticism-of-sturp/","cat":"other_blogs","id":"comment-141229","author":"PHPL","site":"shroudstory"},{"title":"A Significant Criticism of STURP","post":"When people get together to play Bridge there is always a joker who wants to play another game.  STURP stayed the course with what they set out to do. Sorry, Colin, negativity is another subject. What you have to say is interesting but your unscientific bias against STURP is showing.\n\n","date":"July 30, 2014 at 9:10 am","url":"https://shroudstory.com/2014/07/30/a-significant-criticism-of-sturp/","cat":"other_blogs","id":"comment-141230","author":"Paulette","site":"shroudstory"},{"title":"A Significant Criticism of STURP","post":"“Negativity” is another subject, and misleading, hopefully they didn’t mention it in the summary of their conclusions.\n\n","date":"July 30, 2014 at 4:18 pm","url":"https://shroudstory.com/2014/07/30/a-significant-criticism-of-sturp/","cat":"other_blogs","id":"comment-141289","author":"anoxie","site":"shroudstory"},{"title":"A Significant Criticism of STURP","post":"Sorry Dan, This time I disagree with your title. This is an “insignificant criticism”, STURP’s objective was to examine “How the image was formed?” And not why? When? Or in what context. This was beyond the scope of their study and they shouldn’t be blamed for it.\n\n","date":"July 30, 2014 at 5:22 pm","url":"https://shroudstory.com/2014/07/30/a-significant-criticism-of-sturp/","cat":"other_blogs","id":"comment-141299","author":"Mike M","site":"shroudstory"},{"title":"A Significant Criticism of STURP","post":"“A Significant Criticism?”  Really?  I had promised myself I would spend no more time answering the unfounded claims of Dan Porter’s favorite skeptic, but once again, I find an obviously unresearched post filled with inaccuracies and ad hominem attacks being given a prominent place on this blog under an equally offensive headline. Under those circumstances, I cannot just sit here with my mouth shut while this skeptic’s claims are promoted as “significant.”\nMaybe the simplest way to dispute these false claims is to look at the members of the STURP team themselves. Who were they and what was their expertise?\nDon Lynn of NASA’s Jet Propulsion Laboratory (JPL) was director of imaging on the Voyager, Viking, Mariner and Galileo projects and probably the top imaging expert on our team. Jean Lorre was also an imaging specialist at JPL who continued working on NASA and SETI imaging projects until his untimely death in 2005.\nVern Miller was the Chief Scientific photographer for STURP and had spent many years working in the aerospace industry as a scientific photographer before coming to Brooks Institute to teach in 1970. Ernest Brooks was the president and owner of Brooks Institute and an acknowledged professional photographer in his own right.  Mark Evans was a graduate student at Brooks who specialized in microscopy and still works as an ophthalmologic microscopist and research photographer to this day.\nDon Devan was an imaging specialist at Oceanographic Services, Inc. In fact, his organization hired me as a photographic consultant for a seven month imaging project their company was doing for Los Alamos National Laboratory in 1976 (before STURP). It was Don Devan who eventually enlisted my participation in the Shroud project after we completed the Los Alamos research.\nJoseph Accetta (Lockheed), Steve Baumgart (Air Force Weapons Laboratory) and Tom Haverty (Rocky Mountain Thermograph) were infrared imaging specialists doing most of their work for various government organizations. Their work on the Shroud was excellent but hampered by the limited sensitivity of the infrared sensors circa 1978.\nBill Mottern (Sandia Laboratory), Ron London and Roger Morris (both from Los Alamos National Laboratory) were radiographic experts, a critically important form of imaging that we applied to the Shroud.\nFrankly, I was probably the LEAST qualified of all the imaging people on the STURP team.\nAs for the nonsensical statement the skeptic made about STURP ignoring the negative aspects of the Shroud image, that property was well known and documented since 1898 when Secondo Pia first made that claim, and which was further corroborated by Giuseppe Enrie when he again photographed the Shroud in 1931. Remember that the primary goal of the STURP team was to characterize the properties of the image on the Shroud. The negative aspects of the Shroud image were just one of the many unique image properties that were taken into account and integrated into all of our imaging experiments and was certainly mentioned in some of our imaging papers.  So I guess we are being criticized for simply not re-stating the obvious! \nIf the skeptic had taken the time to look at the list of STURP team members and their affiliations (http://www.shroud.com/78team.htm), he would have discovered that NEARLY HALF the team members who went to Turin to gather the data in 1978 were involved in some form of imaging! That is a FACT.\nI have no interest (or intention) of debating anyone on this topic as the facts speaks for themselves. Perhaps a better name for this article would be “An INsignificant Criticism!” Enough said!\n\n","date":"July 30, 2014 at 5:32 pm","url":"https://shroudstory.com/2014/07/30/a-significant-criticism-of-sturp/","cat":"other_blogs","id":"comment-141302","author":"Barrie Schwortz","site":"shroudstory"},{"title":"A Significant Criticism of STURP","post":"Perhaps, but with Meriiam-Webster at hand . . . \nsig·nif·i·cant adjective \\sig-ˈni-fi-kənt\\: \n–  large enough to be noticed or have an effect\n–  very important [ . . . ]\nI’m not questioning the expertise of the STURP team. I’m not buying into what Colin is saying. He is not my favorite skeptic by a long shot and readers of this blog know that. I don’t just report what is favorable to my belief in the shroud’s authenticity. We face a credibility problem when we simply say the facts speak for themselves and therefore we won’t address what skeptics have to say. What Colin had to say, IN MY OPINION, is significant,until shown otherwise, even if he is wrong.\n\n","date":"July 30, 2014 at 9:11 pm","url":"https://shroudstory.com/2014/07/30/a-significant-criticism-of-sturp/","cat":"other_blogs","id":"comment-141331","author":"Dan","site":"shroudstory"},{"title":"A Significant Criticism of STURP","post":"It may be significant observation (in your opinion) but it can’t be a “significant criticism to STURP” because it was beyond the scope of their study. It’s like a medical study for a glucose lowering drug to treat Diabetes being criticized for not addressing the effects of the drug on arthritis. It’s not fair to the study to claim any significance for such criticizim, IMHO.\n\n","date":"July 30, 2014 at 9:41 pm","url":"https://shroudstory.com/2014/07/30/a-significant-criticism-of-sturp/","cat":"other_blogs","id":"comment-141337","author":"Mike M","site":"shroudstory"},{"title":"A Significant Criticism of STURP","post":"Dan has my support for one simple reason: As a scientist with significant experience Colin has the right to question some of the things that he finds doubtful. What he should not do is to question facts that are established, as was the case when he questioned the negative properties of the Shroud image.\nThis is nothing more than fair play, given that Shroud websites and publications give both sides of the story, both pro- and anti-authenticity camps have room to express themselves there.\n\n","date":"July 31, 2014 at 8:09 am","url":"https://shroudstory.com/2014/07/30/a-significant-criticism-of-sturp/","cat":"other_blogs","id":"comment-141433","author":"Louis","site":"shroudstory"},{"title":"A Significant Criticism of STURP","post":"Barry, this is an excellent defense of the STURP team and its work. Don’t be too hard on Dan. Whenever he oversteps and offends Colin, as an act of contrition he usually kisses up to him in a blog posting soon after. Being a blogmeister is a ‘damned if you do, damned if don’t’ proposition.\n\n","date":"July 30, 2014 at 11:22 pm","url":"https://shroudstory.com/2014/07/30/a-significant-criticism-of-sturp/","cat":"other_blogs","id":"comment-141352","author":"David Goulet","site":"shroudstory"}]
