[{"title":"A STURP Sequel?","post":"Yes, it would certainly be appropriate to know under what  auspices people hold ‘private’ collections of material taken from the Shroud, not simply material originally removed on STURP’s 32 tapes and passed on to others  but also those distributed by Gonella and Riggi that are referred to in various articles.\n Is the original collection of 32 tapes still intact? This is an important issue as they represent different parts of the image and non-image areas of the cloth and so may be the best single record of the surface until further samples become available. An updated version of the Physics and Chemistry article on the Shroud, now over thirty years old, would be of benefit to all if the tapes are still available.\n\n","date":"October 2, 2013 at 11:26 am","url":"https://shroudstory.com/2013/10/02/a-sturp-sequel/","cat":"news_&_views","id":"comment-46015","author":"Charles Freeman","site":"shroudstory"},{"title":"A STURP Sequel?","post":"These privately held, almost secret, collections remind me of the book The Name of the Rose.\n\n","date":"October 2, 2013 at 2:05 pm","url":"https://shroudstory.com/2013/10/02/a-sturp-sequel/","cat":"news_&_views","id":"comment-46019","author":"David Goulet","site":"shroudstory"},{"title":"A STURP Sequel?","post":"It must be known if Rogers really identified “sprouting pollen grain” on the Shroud and, if so, why he didn’t publish this. Could his unpublished notes be lying in the cartons? As far as I know Rogers doubted if such old pollen grains could remain intact internally and thus serve to trace the route of the Shroud. As for Rogers’s agenda, the only visible sign is that mentioned more than once on this blog, a paper he co-authored in which the evolutionary process was (implicitly) judged to be sort of automatic, with no rationality behind it. Even Spinoza would have laughed the authors out of court if he had read this!\n\n","date":"October 2, 2013 at 2:32 pm","url":"https://shroudstory.com/2013/10/02/a-sturp-sequel/","cat":"news_&_views","id":"comment-46021","author":"Louis","site":"shroudstory"},{"title":"A STURP Sequel?","post":"There is still hope in case Max Frei Sulzer’s tapes have still not been delivered to a competent palynologist for examination. The pollen grains and debris vacuumed off the Shroud during the controversial Restoration are in the possession of the Archdiocese of Turin and the authorities there will have to demonstrate that it was not a dead-end job. It would be a good idea to bring both the collections together for comparison, and that decision would involve Dr. Alan Whanger, respected in Turin, and Archbishop Cesare Nosiglia. It may take some time to get the Pope’s approval, if needed. Right now the pontiff is locked up for a historic meeting with eight cardinals to decide how to begin vacuum cleaning at the Curia.\n\n","date":"October 3, 2013 at 12:12 pm","url":"https://shroudstory.com/2013/10/02/a-sturp-sequel/","cat":"news_&_views","id":"comment-46073","author":"Louis","site":"shroudstory"},{"title":"A STURP Sequel?","post":"Yes, Dr. Alan Whanger did purchase the pollens collected from the Shroud by Dr. Max Frei for about $50,000.  I visited Dr. Whanger at his home in North Carolina, and he has quite an impressive collection of materials devoted to the Shroud.  For myself, I have been doing inventory of the materials throughout the vast world of Shroud research, and have compiled this inventory in my free ebook, “Resurrection for Dummies”.\n\n","date":"December 23, 2013 at 2:10 pm","url":"https://shroudstory.com/2013/10/02/a-sturp-sequel/","cat":"news_&_views","id":"comment-65831","author":"Francis DeStefano","site":"shroudstory"},{"title":"A STURP Sequel?","post":"Note: before allowing this comment from Francis DeStefano, I sought additional confirmation from him. This, in part, is what he wrote to me:\n“Hi Dan,\n“I first learned from Kevin Moran that Dr. Whanger had purchased the collection of pollens from the estate of Max Frei.  \n“It was Kevin who told me that Dr. Whanger paid about $50,000 for these materials.\n“Ian Wilson in one of his books about the Shroud refers to “an American Shroud enthusiast” purchasing these materials, without mentioning Dr. Whanger by name.\n“When I visited Dr. Whanger at his home in early February of 2012, he explained to me that Max Frei’s pollen collection was stored inside a bank vault in the general vicinity of his home, and that he has made this collection available to qualified researchers on occasion.\n“Max Frei died before completing his study of these pollens, and, to my awareness, no team of pollen experts has ever completed a definitive examination of these pollens that is available in the scientific literature.\n[ . . . ]\n“As you probably already know, the Shroud was “vacuumed” during its private 33 day “restoration” so the Frei collection probably remains the definitive data set, when it comes to pollen research, imperfect as it is.\n“I hope this is helpful to all of you, and a very Merry Christmas to you all.”\n\n","date":"December 24, 2013 at 5:01 am","url":"https://shroudstory.com/2013/10/02/a-sturp-sequel/","cat":"news_&_views","id":"comment-66373","author":"Dan","site":"shroudstory"},{"title":"A STURP Sequel?","post":"Having read this, I had a look at David Rolfe’s first Shroud film, extracts of which are on his website. Following Home – Wall 1 – Pollens, we find an interview with Max Frei, in which the narrator (Kenneth More, I think) says:\n“Dr Frei was given an opportunity to study the Shroud at first hand when, in 1973, he was asked to authenticate photographs of the cloth, taken a few years earlier.” Frei continues:\n“I remarked, between the threads some dust particles, some of them looking like pollen grains, or spores. At higher magnification I was certain of it, and so I asked the competent authorities if it would be possible to take dust samples.” He says this while holding what is clearly a scanning electron microscope image of some fibres.\nLater on, he looks though an optical microscope but a number of SEM images are shown on  the film, which is presumably cinematographic licence. But what about those first photos, which he holds in his hands? Are they real, or are they cinematographic license as well?\n\n","date":"December 24, 2013 at 8:57 am","url":"https://shroudstory.com/2013/10/02/a-sturp-sequel/","cat":"news_&_views","id":"comment-66515","author":"Hugh Farey","site":"shroudstory"},{"title":"A STURP Sequel?","post":"The SEM photos that Frei holds in his hands are from the article “Aspetti ultrastrutturali al microscopio elettronico a scansione di fibre della Sindone di Torino” by Ettore Morano, in the Proceedings of the 1978 Turin conference (La Sindone e la Scienza, p. 201). Some photos are printed in the tables on pp. 379-384. In the previous pages 370-378 there are many SEM photos of pollen grains as illustrations of the article by Frei on p. 191. Also these photos were taken by Morano in a hospital of Vercelli. While the photos with the article of Morano are (supposedly) really from Shroud material, it would seem that the photos of pollen grains with the article of Frei are of fresh grains from herbariums or directly from flowers.\n\n","date":"December 24, 2013 at 1:32 pm","url":"https://shroudstory.com/2013/10/02/a-sturp-sequel/","cat":"news_&_views","id":"comment-66722","author":"Gian Marco Rinaldi","site":"shroudstory"}]
