[{"title":"STURP got its priorities entirely wrong. Result – no real scientific insights.","post":"My WordPress hit meter says 27 visits to this site today. But still no comment, no feedback. \nI take that as tacit acceptance I’m right about the TS body image. It’s a baked-on flour imprint (mid-14th century).\n","date":"January 31, 2018 at 7:55 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/11/27/sturp-got-its-priorities-entirely-wrong-result-no-real-scientific-insights/","cat":"uncategorized","id":"comment-10535","author":"Colin Berry","site":"colinberry"},{"title":"STURP got its priorities entirely wrong. Result – no real scientific insights.","post":"Interesting insights. Any more news on the blood – hemoglobin analyses?\n","date":"January 10, 2018 at 8:06 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/11/27/sturp-got-its-priorities-entirely-wrong-result-no-real-scientific-insights/","cat":"uncategorized","id":"comment-10491","author":"smilesandlight","site":"colinberry"},{"title":"STURP got its priorities entirely wrong. Result – no real scientific insights.","post":"News? Or thoughts?\nGoogle listings under (shroud of turin) are currently full of that claim for trauma blood having been detected by a physical, non-chemical scanning technique (revealing  “ferritin”, “creatinine” etc whose significance escapes me, even if really present – which I doubt).  Being like no other “chemistry” I’ve ever encountered before, I can’t really comment, except to say I find it somewhat worrying, indeed dispiriting,  that a submission to an open-access journal (PLOS) that by its own admission makes no attempt to select for papers for their likely ‘impact’, whose referees and their qualifications can only be guessed at, to be highly irregular. Who’s linking back and forth between so many internet sites to give that paper so much prominence on Google listings? Are we seeing SEOs at work (search engine optimizers) who email me from time to time, offering their services (whose emails I instantly delete). \nThere be something rotten in the state of pro-authenticity sindonology! It plays the internet and media like a fiddle… Where’s the money coming from?\n","date":"January 10, 2018 at 9:47 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/11/27/sturp-got-its-priorities-entirely-wrong-result-no-real-scientific-insights/","cat":"uncategorized","id":"comment-10492","author":"Colin Berry","site":"colinberry"}]
