[{"title":"STURP: Space-age Technology Unleashing Religious Propaganda!","post":"Eureka! I’ve finally discovered why it is I sometimes get a strong reverse-side image, or sometimes a weak one (the latter as per Shroud). And no, it’s not as I originally suspected to do with whether or not the vegetable oil  adjunct is used a a means of sticking the flour to the skin. It’s far more subtle than that! That’s not to say that oil may or may not play a secondary role (yet more experimentation  this weekend needed!).\nI’ll work the new experiment into the next posting,  hopefully early next week, reporting also on my findings with the two new microscopes, one of which at least copes far better with those 3D image threads and fibres that are difficult to get into focus with my existing ‘entry-level’  microscope.\nSee this link for the contemptible feedback this investigator received some 2 years ago from one of the so-called leading “scientists” of sindonology – on the subject of focusing his unsophisticated  microscope (with limited depth of field) onto a 3D subject:\nhttps://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/\n","date":"June 30, 2017 at 12:37 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","id":"comment-9601","author":"Colin Berry","site":"colinberry"},{"title":"STURP: Space-age Technology Unleashing Religious Propaganda!","post":"Thanks Dave\nI was able  some years ago to figure out why the Shroud Scope images looked so monochrome and washed-out through doing RGB analysis. But the same approach has not worked for Zeke, which as you say imparts ‘granularity’ for reasons I have yet to figure.\nAll I can say for now is that if I input my contrast-enhanced (restored?) Shroud Scope images-  some 20 in all – from all parts of the Shroud body image – then weak granularity here and there is returned as strong granularity. \nhttps://shroudofturinwithoutallthehype.wordpress.com/2012/06/25/shroud-scope-10-my-very-own-gallery-of-20-close-up-views-of-the-shroud-all-lightly-photo-edited-for-optimised-colour-differentiation-25/\n(See recently updated second installment).\nSo no,  I don’t think Zeke is generating artefacts. It is merely emphasizing  granularity wherever it appears.\n I have a hunch as to how it works. It’s to do with a mix of granular image ‘bittiness’ and surrounding  infilling ‘gunge’ . It filters out the gunge, maybe due to a slight difference in colour – but that’s  pure speculation on my part.\nMotto: experimental scientists should never be too quick to look a gift horse in the mouth –  Zeke included. We don’t immediately question how the visual centre of the brain processes images – relying from birth as we do on a learning curve as to what’s real v fantasy – so why not do the same for  the end-product of human-created computer graphics software? Trust one’s senses (and critical judgement)!\n","date":"June 28, 2017 at 5:16 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","id":"comment-9594","author":"Colin Berry","site":"colinberry"},{"title":"STURP: Space-age Technology Unleashing Religious Propaganda!","post":"Hi Colin,\nIt’s like a breath of fresh air to find a site about the shroud that isn’t blatent religious propaganda! Thanks for all your efforts.\nReading this latest post, my only concern is with your use of the Zeke filter. Although I’m not aware of the precise detail of what it does, I am concerned about the possibility that the effect of increasing contrast could produce image granulation where there wasn’t any in reality. Presumably some pixels will be lightened and some darkened to create the ‘enhanced’ image, which would create a more granulated image. Have you tested the Zeke filter on an image that has a smooth colour gradient to see if it will create granulation where there was none (obviously any image will have granulation at the image’s pixel level, so the check would be to see if the Zeke filtered image shows granulation of a larger size than pixel size where there was smooth colour graduation on the original)?\nBest regards,\nDave\n","date":"June 28, 2017 at 10:28 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","id":"comment-9592","author":"Dave","site":"colinberry"},{"title":"STURP: Space-age Technology Unleashing Religious Propaganda!","post":"Here’s another example of the extraordinary properties, to say nothing of utility, of that zeke filter, shown before v after application to my cross-section of Model 10 image fibres. Note darker cut ends of fibres, with patchy distribution of brown pigmentation in the interior of fibres,\n\nPS (added 25 June): new binocular stereomicroscope on order with USB connection for image capture.\n","date":"June 22, 2017 at 6:43 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","id":"comment-9552","author":"Colin Berry","site":"colinberry"},{"title":"STURP: Space-age Technology Unleashing Religious Propaganda!","post":"PS to sheona: have just inserted this mischievously swing-doctored image into the body of the present posting. It’s my mental image of the typical organizer of a Shroudie pseudoscience congress:\n\nApologies to any professional hypnotists who may be reading this.\nPPS: On a different subject, I see that rabidly pro-authenticity Stephen E.Jones quite shamelessly continues to dispense misinformation on that site of his (to which I refuse, tit-for-tat, to link to).  No, that late recruit to STURP, Alan D. Adler, was neither an expert on blood nor on bilirubin. He was an organic/physical chemist who specialized in porphyrins (cyclic tetrapyrroles), notably their synthesis from simple monopyrrole precursors. Porphyrins are ubiquitous in nature, not just animal blood, but plants too (e.g. chlorophyll). Bilirubin is an end-product of haem and porphyrin catabolism generated in the liver and spleen via ring-opening, loss of a bridging carbon atom as CO, then hydrogenation to leave a linear, i.e. non-cyclic tetrapyrrole with properties entirely different from those of the parent porphyrin.\nAlan D.Adler should have confined himself to characterizing the porphyrin of Shroud “blood”, e.g. confirming it was protoporphyrin IX. His highly reported, hugely over-hyped proclamations re ‘serum clot retraction”, ‘trauma bilirubin’ etc etc were almost entirely blue-sky authenticity-promoting speculation that were outside the realms of his specialist expertise. STURP should have recruited genuine blood and bilirubin experts, assuming there was enough material on Raymond Rogers’ sticky tape samples for detailed physical, chemical and physiological characterization (which there clearly was not: don’t take my word for it – read the account in John Heller’s 1983 book).\n","date":"June 6, 2017 at 9:04 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","id":"comment-9373","author":"Colin Berry","site":"colinberry"},{"title":"STURP: Space-age Technology Unleashing Religious Propaganda!","post":"Yes, by any reckoning, it’s a bizarre location for a so-called ‘international’ conference, sheona. I live an approx 45 min drive from one of the world’s major airports (London Heathrow). But a check on the internet shows that I would need to spend more than 18 hours airborne and in departure lounges to reach the Tri-Cities airport  and Pasco, Washington State, needing  to change at JFK New York AND Salt Lake City Utah.\nWe’re told the location was chosen for its high concentration of scientific research activity –  helping to bring new blood into Shroud research!\nYeah, right …\nIn fact, one look at the titles of the first few papers in the updated programme makes me relieved I did not send a registration fee. \nhttp://shroudresearch.net/program/\nWhat we see is a parody of science, a laughable aping of a real scientific congress. The Shroud is being deployed as a visual aid for a Bible studies class! Science it ain’t…\n","date":"June 5, 2017 at 10:52 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","id":"comment-9372","author":"Colin Berry","site":"colinberry"},{"title":"STURP: Space-age Technology Unleashing Religious Propaganda!","post":"You’ve been quiet for quite a long time, Colin. I do hope you’re not saving up anything worthwhile for this conference in the oversized garden shed in Pasco. Why do you suppose such an out of the way place was chosen? Is it so that just one Canuck setting foot across the border would make it “international”? Or are the organisers hoping that the vast amount of radioactive waste at Hanford might add some spark to what will otherwise be the usual stale repetition of dodgy “facts”.\n","date":"June 4, 2017 at 11:08 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","id":"comment-9361","author":"sheona","site":"colinberry"},{"title":"STURP: Space-age Technology Unleashing Religious Propaganda!","post":"This science defending/promoting, myth-destroying blogger is now returning to a previous topic of interest, namely Stonehenge and Silbury Hill.\n I may be gone a while..\nBut comments still welcome re the pseudoscience that continues to bombard the internet daily, promoting the ‘authenticity’ of the Turin Shroud.\nI say it’s a one-off medieval flour-powder imprint onto wet linen, subsequently oven-baked. But I might be wrong…\n\n(Halfway stage – lightly dusted with white flour while lying flat on back. Next step – imprint onto wet linen then oven-roast.)\n","date":"May 5, 2017 at 6:16 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","id":"comment-9024","author":"Colin Berry","site":"colinberry"},{"title":"STURP: Space-age Technology Unleashing Religious Propaganda!","post":"No, as for the King Agbar stuff having a full body image of Jesus. Even if it is, how do they know it’s the same one. Also it’s a little sketchy that some hidden document in the Vatican library etc says blah blah blah. I laughed when I heard Porter say the c14 was “a bust” because he wouldn’t have said that if it was dated to 1st century. He just assumes Ray Rogers was right based on his vanillin “dating” with those samples they illegally gave him. Funny how these repairers didn’t reweave the burn marks but just this small area that happened to be picked for dating.\nLastly, why didn’t they just do another carbon date on a place where they can all agree was original to the shroud? Repeat experiments are done all the time.\nAnyways thanks for your input. It just baffles me that in the age of reason, you have to dig so deep in order to find skepticism material on this stuff.\n","date":"April 20, 2017 at 3:20 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","id":"comment-8946","author":"Matt","site":"colinberry"},{"title":"STURP: Space-age Technology Unleashing Religious Propaganda!","post":"Also about the “snap crackle and pop”, I’m curious to why he says, “There is no need to appeal to miracles to explain the images. And claims that the Shroud is somehow evidence of a miracle, even specifically the Resurrection, is problematic.” although I agree given the many problems with the shroud, it just seems like he’s talking out of both sides.\n","date":"April 20, 2017 at 3:26 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","id":"comment-8947","author":"Matt","site":"colinberry"},{"title":"STURP: Space-age Technology Unleashing Religious Propaganda!","post":"The “No” in the beginning was supposed to be a “Now”\n","date":"April 20, 2017 at 3:47 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","id":"comment-8948","author":"Matt","site":"colinberry"},{"title":"STURP: Space-age Technology Unleashing Religious Propaganda!","post":"Sorry Matt. I don’t buy into any of this Edessa stuff and never have. It’s pseudo-history, a joined-at- the- hip accompaniment to all the fake science.  If the Turin Shroud’s iconic head-to-head double-body image, ‘shockingly’ naked, reasonably realistic-looking blood, had been around centuries before the Lirey display in the 1350s, then we would surely know about it, either from the written or artistic record or even oral traditions, aka folk memories. Why? Because each time the shroud changed hands or ownership it would have come with a bit of back-story, no matter how fragmentary or inaccurate. Would the de Charnys have gone to all the trouble of commissioning the Lirey badge to advertise the Shroud yet fail to divulge what they knew about its recent history, had there been any? Would they have had nothing persuasive to say to the local Troyes bishop and then Pope himself when challenged to defend its authenticity? Would they have been willing to lock it away for 30 years under papal instructions if there was even a shred of evidence to support its authenticity? Would they have agreed to the strict condition attached to its re-display after the ban was finally lifted, agreeing to each new showing being accompanied by an official statement to the effect it was just a representation, not to be mistaken for the real thing.\nHow likely is it that something that was around under less-than-ideal storage conditions all those  unaccounted-for centuries would re-emerge looking so relatively new, without a single spot of mildew?\n(The use of a hot oven to imprint the image explains incidentally the Shroud’s exceptional state of preservation, since the heat would have killed off all microorganisms, spores included, and also have chemically degraded one or more key nutrients (providing nitrogen, sulphur etc) needed to support microbial growth and reproduction, preventing re-colonization. That’s without considering any conjectured final wash to flush out remaining nutrients, leaving essentially sterile fabric.).\n","date":"April 20, 2017 at 6:11 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","id":"comment-8939","author":"Colin Berry","site":"colinberry"},{"title":"STURP: Space-age Technology Unleashing Religious Propaganda!","post":"Hey, nice post. I got another one for ya. So I found Ian Wilson’s claim that King Abgar was reportedly in possession of a cloth that shows Jesus’ ” whole body”. People are saying the Edessa image is the Shroud of Turin. I heard Joe Nickell address this but he kinda brushed off by referring to forgers confession and carbon dating (which is an accurate date). I was hoping for a more savage debunking of that claim. As far as I can see the Image of Edessa was only a face image. Then I go read Dan Porter and he’s saying thats absolute proof the Shroud was in Constantinople in the 8th century and Edessa in 5th century. Like usual, skeptical shroud material is always in short supply. Any thoughts on this one?\n","date":"April 20, 2017 at 2:56 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","id":"comment-8936","author":"Matt","site":"colinberry"},{"title":"STURP: Space-age Technology Unleashing Religious Propaganda!","post":"Apparently this is the sermon Ian Wilson cites,\nIntroduction\n# 1 A sermon by Gregory the Archdeacon and Referendarius of the great church at Constantinople, about how incredible things are not subject to the laws of praise, and about how three patriarchs have declared that there is an image of Christ which was brought from Edessa 919 years afterwards by the zeal of a pious emperor, in the year 6452 (944AD). Lord bless us. . . .\n. . . .But Jesus, undergoing the passion of his own free will, believing that human nature fears death – indeed death comes upon the very nature that was made to live – taking this linen cloth he wiped the sweat that was falling down his face like drops of blood in his agony. And miraculously, just as he made everything from nothing in his divine strength, he imprinted the reflection of his form on the linen. . . .\n# 21 He will do this straight away for us if we so desire, if we look upon the reflection and the immense beauty it is depicted with. For this is not the art of painting, which provides a door for the mind to consider the original and depicts images. This reflection was imprinted from a living original. Painting establishes a complete form with various beautiful colours, representing the cheeks with a blooming red, the encircling of the lips with red, it paints the beard with flowery gold, the eyebrow with shining black, the whole eye in beautiful colours, the ears and nose in a different way, overshadowing the flanks of the imprint with a compound of qualities and showing the chin with hair.\n#22 This reflection, however – let everyone be inspired with the explanation – has been imprinted only by the sweat from the face of the originator of life, falling like drops of blood, and by the finger of God. For these are the beauties that have made up the true imprint of Christ, since after the drops fell, it was embellished by drops from his own side. Both are highly instructive – blood and water there, here sweat and image. Oh equality of happenings, since both have their origin in the same person. The source of living water can be seen and it gives us water, showing us that the origin of the image made by sweat is in fact of the same nature as the origin of that which makes the liquid flow from the side .\n….\nI then went to DanPorters FAQ and I found a mix of bullshit and believable info. I thought his arguments for a bad C14 dating to be unconvincing and with his bilirubin mantra and the claim that the image is above the blood stains along with the dubious claim that Ray Rogers had discovered an invisible reweaving (lol). It just seems from someone, like me who is still learning, that Dan has it all figured out. Speaking from experience, I’ve found that people who I initially thought debunked me weren’t all that “figured out” as I thought. Is he bullshitting me? Forgive me for going on, its just I never heard of that Image of edessa and the sermon before and like I mentioned before, theres a lack of skeptical material on the net for this stuff.\n","date":"April 20, 2017 at 5:55 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","id":"comment-8938","author":"Matt","site":"colinberry"},{"title":"STURP: Space-age Technology Unleashing Religious Propaganda!","post":"Thanks for the quote Matt. Once again we see early mentions to the idea of sweat being able to create an imprint, no doubt with additional artistic inputs. That’s without the separate literature on the ‘legendary’ Veil of Veronica, a supposed pre-mortem face-only imprinting via the same mechanism. So if sindonology were to give more than its customary  quick brush-off to the idea of medieval forgers having set out to simulate a 1300 year old whole body imprint, you’d surely expect to see “sweat” mentioned. Instead, it’s ignored almost completely, bar those promising all-too-quickly abandoned early experiments of STURP’s Sam Pellicori with sweat-substitutes (oil, lemon juice etc).\nInstead we see the agenda-driven fixation with J of A’s linen being intended and used as a burial shroud (as distinct from temporary means of dignified transport), which then opens  a multitude of pseudoscience doors to what Dan Porter summarized  in a recent email  as the snap, crackle and pop school of sindonology , invoking high energy mechanisms of  image creation. Pity Dan waited till after closing his site before reaching for so colourful an expression, one that hits the nail on the head.\n","date":"April 20, 2017 at 6:47 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","id":"comment-8940","author":"Colin Berry","site":"colinberry"}]
