[{"id":"comment-60892","author":"john_klotz","post":"STURP Lives!! For a host of reasons too long to list here, STURP was a US centered operation although it intersected through Fr. Rinaldi with Ian Wilson, David Rolfe and thus Silent Witness, part of the proceeds of which helped finance STURP. (The money may have been “washed” in part through the Holy Shroud Guild.) And it was an American heir to a fortune that also provided financing to both. Riggi was adopted by STURP during the Turin examination. In the ensuing years there were conferences and interchanges among the STURP veterans and European scientists. Information was freely shared. Perhaps the epitome of that occured at the 2008 Ohio conference when Giulio Fanti shared presnted an American scientist from Los Alamos Shroud threads that Fanti had received from Riggi, I do not have definitive information from the individuals but I would make an educated guess that the yenta (marriage broker) between Kelly and Thibault was a STURP veteran with the inappropriate initials of BS. The politics of Turin, the Vatican and the rest of the world were quite complex. It would behoove everybody to celebrate the joint efforts now becoming the norm. It would also be behoove everybody to celebrate the accomplishments of STURP rather than engage in unnecessary attacks on it just because it was predominantly American. In 1978, at that time and place, the science that STURP applied was in fact miles ahead of any other place on Earth. The fact that the science was developed by the US nuclear and space programs, each unparalleled, is either high irony, or perhaps Divine Providence. Hey, you never know..","date":"2013-12-17","mins":"10:44 am","url":"https://shroudstory.com/2013/12/17/a-special-guest-posting-by-kelly-kearse-and-thibault-heimburger/","cat":"blood_studies","title":"A Special Guest Posting by Kelly Kearse and Thibault Heimburger"},{"id":"comment-200332","author":"john_klotz","post":"From his very look at an actual small fragment of blood he discerned in his labs high powered microscope with different mode of viewing, Heller describes what he saw as bright red. Adler later concurred. Explaining the bright red color was a challenge but they believed that it was the result of the torture Christ endured releasing bilirubin into the blood stream. They did not offer off the cuff anonymous opinions. They checked their findings with associates and received confirmation. They used multispectral analysis down to the nanogram level. They published in a peer review journal. NONE of the photographs taken of the Shroud are fine definition enough to visualize that level..","date":"2015-05-27","mins":"6:22 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200346","author":"john_klotz","post":"Correction: Not nanogram but nanometer. (gram relates to weight, meter relates to size.) A nanometer is 10 9 of meter, or one billionth of a meter.","date":"2015-05-27","mins":"10:59 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200417","author":"john_klotz","post":"Hugh, That there was antipathy between members of the STURP team and Ballone is well documented. Ballone and the Turin Confraternity resented the intrusion of the Americans into what the regarded as their monopoly. Here’s a freebie from my book. “Less than a week before the scheduled departure for Turin, Centro di Sindonologia cabled D’Muhala asking him to send the twelve hour protocol. D’Muhala immediately called Jumper and asked him what to do about the cable. Jumper replied: “The hell with it. Send them our ninety six hour protocol, and we will argue it out when we get there.” It ought to have been clear to the American scientists by this time, that they were facing a good deal of political intrigue in Turin and that many in the Centro were virulently anti American and resented the intrusion of the Americans. It also appeared that there were those in Turin and the Vatican who were welcoming the American initiative. The issue would be decided on the ground in Turin. “On September 28, the sudden death of Pope John Paul I added a whole new complexity to their situation. “The following day the STURP team embarked at Kennedy Airport for Turin. To have gotten as far as they did, in as good shape as they did, was a virtual miracle. It was also a combination of hard work, brilliant organization and a collaboration of some of the finest scientific minds in the world. In the UK, the talents of David Rolfe and Ian Wilson had contributed to the impetus for their mission by dramatizing their quest. Clearly, Frs. Rinaldi and Otterbein had found allies in Turin and the Vatican. Just as clearly were those there who wished them ill and resented the American intrusion into their world. “So, as their plane roared down the JFK runway, lifted into the air and tucked its landing gear away, no one could know with any surety what awaited them across the sea and whether they might not be totally frustrated in their endeavor. Maybe God knew although more than one member of the STURP team harbored doubts about whether He existed at all. Quantum Christ, p. 68.","date":"2015-05-28","mins":"6:32 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200504","author":"john_klotz","post":"Hugh, I have read the Sanborne article. Does the reactionary philosophy that Donald Sanborne espoused in that article reflect your view of Catholicism? That’s not an idle or impertinent question. Among other things he seems to be wedded to monogenesis and the teaching of the Scholastics that were totally uninformed by modern science. I am also confused by his reference to Christ’s “physical soul” and his claim that Benedict rejects the concept of a “physical soul.” So do I, if the concept of the soul is not illuminated by the issues of the quantum nature of intelligence and consciousness. Sanborne seems to be essentially what I identify as a fundamentalist Protestant ethic – we are saved by faith alone. That leads to a certain intellectual arrogance: the authenticity of the Shroud is not an important issue because I have “faith” and don’t need it to be authentic. The authenticity of the Shroud is important because it is a Revelation that gives physical substance to the Gospel accounts. In age where we have advanced so far in Science to be knocking on the door of the nature of consciousness and its survival as a part of the quantum information of the Universe, that is no small thing. One thing, in my opinion, the Gospels make clear: We are saved by love, but that’s another debate..","date":"2015-05-29","mins":"6:14 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200463","author":"john_klotz","post":"Hugh, I am of course indebted to Heller’s book. However, the same person who steered me to Heller’s book and who was a member of the STURP team told me the story of Ballone and his antipathy. I don’t choose to reveal my source but it’s a source I trust. One of the good things that has happened recently is the leadership role now being played by Bruno Barberis at Turin Centro. At one conference he held STURP as a model for future examinations of the Shroud but a “STURP” with true international membership...","date":"2015-05-28","mins":"5:32 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200513","author":"john_klotz","post":"Phew. It would be hard to teach physics otherwise. Glad we are on the same page on that score..","date":"2015-05-29","mins":"7:31 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-10539","author":"john_klotz","post":"I have what may be an ignorant question, but a question none the less. It is accepted that the image did not form where here was blood stains. The image on the Shroud is most pronounced on one side of the Shroud. My assumption is that the image appears on the side of he Shroud that was touching or adjacent to the body. I do not think here is really any question of that. That means that exterior of the Shroud in the tomb would be that part which was exterior as it wrapped (was lain across?) the body. There are some very faint markings of a few parts of the image on the exterior which for most of the Shroud’s recorded history was hidden behind the Holland lining. But what about evidence of blood stains? Has here been any identification of blood seepage through the cloth, interior to exterior?.","date":"2012-04-18","mins":"11:10 am","url":"https://shroudstory.com/2012/04/18/did-he-say-blood-underneath-the-hands-or-was-he-misquoted/","cat":"news_&_views","title":"Did he say blood underneath the hands?  Or was he misquoted?"},{"id":"comment-39941","author":"john_klotz","post":"Yannick scores again. This is an excellent post by Yannick who has made many excellent contributions. I am not sure this “debate” among the experts (Zugibe vs. Everybody else) is determinative of the essential issue: the authenticity of he Shroud, and beyond that the reality of the Resurrection. Occam’s razor is not a scientific principle but a philosophical one. For example, there is no simplest explanation of quantum mechanics. It does have its application in science. For example, the triumph of the Galileo Newton view over the Ptolemaic view of planetary and solar orbits. Ptolemy began with the view point that the Earth was the center of the Universe which was really a philosophical religious theory revelation. Thus the planets and the sun had to do a little loop in their orbits around the earth. Actually, the mathematics worked pretty well in making predictions of eclipses and such. However, it was simply wrong and it was simply wrong for more than a millennia. However, it was not wrong enough to spare Galileo the Inquisition and the danger of death at the stake. Newtonian physics became a philosophical position as well as a scientific one despite the questions it could not answer correctly. In fact that the duality of light as both wave and particle was demonstrated a century before the advent of quantum mechanics. Newtonians were aghast. I am not so concerned about how the lash marks were preserved as to when the body parted company with the Shroud. Does this debate have anything to offer on that issue? Although it is subject to some deviations, to me the most important thing about the image is this: the body of the Man in the Shroud shows signs of rigor mortis and no signs of putrefaction. Rigor mortis begins upon death and is released approximately 48 hours later. The evidence of putrefaction bi products emerge from the body approximately 48 hours later (there is a relationship between putrefaction of the muscle tisue and the release of rigor mortis.) The time of Christ’s death was Three PM Friday. 48 hours after Christ’s death would have been Three PM Sunday afternoon. Does anybody have any idea what might have happened to Christ’s body during that period of time? I do, and more than a billion people since that time have had the same idea. Applying Occam’s Razor to the mystery of the Shroud’s image and the evidence of the blood residue there is one simple explanation: the Resurrection. To paraphrase Rabbi Hillel: Every thing else is commentary..","date":"2013-07-28","mins":"7:23 am","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-52539","author":"john_klotz","post":"Colin, that is utter balderdash. There have been times when a comment or two of mine gets lost in cyberspace, but I do not believe it’s because of censorship. Like the time I revealed a deep, dark secret about you. It got lost. So what. Actually, I’m kidding. Or am I?.","date":"2013-11-23","mins":"3:48 pm","url":"https://shroudstory.com/2013/11/23/hugh-farey-on-the-possibility-of-image-color-under-bloodstains/","cat":"blood_studies","title":"Hugh Farey on the possibility of image color under bloodstains"},{"id":"comment-47619","author":"john_klotz","post":"Dan, We do not order our lives by proof beyond a reasonable doubt, Even so, some might believe that the evidence is beyond reasonable doubt. The advocates have a right to demand of skeptics: If not Him, who? There is not a scintilla of evidence of anyone else who could have been the Man in the Shroud. While the New Testaments accounts written several decades after the death of Christs have some inconsistencies, as to the most important facts they are remarkably consistent: Christ died and was buried. Some claim the issue is provenance: where was it? I say the issue is providence? How did it survive with it’s secrets locked in a mysterious image until an Italian photographer unlocked the first one: the image is a negative. Since that initial discovery, in fits and starts science has revealed more of the secrets of image. Thomas de Wesselow’s remarkable book “The Sign” demonstrates inadvertently the challenge of the Shroud. De Wesselow makes a convincing case for the Shroud’s authenticity but then speculates that the early Christians mistook the Shroud for a risen Jesus. He does so because as an agnostic he can not accept the possibility of the Resurrection. There’s the rub. The reason everyone, included some who believe in authenticity, are reluctant to state a conclusion, is because behind the issue of authenticity lurks the fundamental issue of our existence: the Resurrection. To paraphrase Jack Nicholson in A “Few Good Men,”They can’t handle the truth!” [The paraphrase is to substitute “they” for “you.”] PS: How do you italicize in a Comment?.","date":"2013-10-16","mins":"6:45 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","title":"Holding the Shroud to an impossible standard?"},{"id":"comment-52552","author":"john_klotz","post":"Collin, You are totally without real humor. I thought I made it clear enough that I was, as we say on this side of the pond, ‘jerking your chain.” Okay, I’ll admit it, I have no dark secrets about you and have never had a comment about you censored by Dan or anybody else. What you have seen is what you have got from me. I don’t think, however, I’ll will ever write anything as funny as the wonderful, Swiftian satires you have posted on his blog. How did you ever acquire that Swiftian gift of black humor. I mean, your claim hat he Shroud was really Jacques de Molay. What an imagination and to be able to convince people ala Swift that you were being serious. Bravo. I am in awe..","date":"2013-11-23","mins":"5:22 pm","url":"https://shroudstory.com/2013/11/23/hugh-farey-on-the-possibility-of-image-color-under-bloodstains/","cat":"blood_studies","title":"Hugh Farey on the possibility of image color under bloodstains"},{"id":"comment-9857","author":"john_klotz","post":"Although Catholic from birth, I do not think I have ever understood the Passion until a few years ago I saw the scourge marks on the Shroud of Turin. I felt such a surge of empathy for Him that has only grown as I viewed each revelation. I believe that it was in Ian Wilson’s latest book there was a description of Barbet’s work in determining the process of how the nails were driven through the wrist and how excruciating the pain of that “minor” detail must have been as the nail enlarged the natural passage. And how much more excruciating that pain was than if a nail was driven through the palm as usually depicted. Whatever empathy I felt reading that was a gift of science. But whatever my empathy, I could never actually feel such pain. But knowledge of the Shroud and what it reveals is a gift of Science. That some “scientists” still have eyes that do not see doesn’t detract one wit from the work of the scientists who have brought us this revelation. In my very first catechism lesson more than six decades ago, I was taught that we could never really understand God who was eternal. I quoted recently from Richard Wright’s Evolution of God. Wright is a professed agnostic but he ended his book describing the human understanding of God as being the merger of truth and love. Not a bad parlay at all..","date":"2012-04-02","mins":"5:48 am","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9884","author":"john_klotz","post":"It ought to obvious that the readers of this blog represent the diversity of the Christian community. There are profound differences. What brings us together is the Shroud of Turin.I hope we can respect each other even with our differences as to scripture and accept that there are differences. “Biblical exegesis” is a fancy phrase for how you read and interpret the Bible. Many, many biblical scholars are attempting to cull from scripture the nub of reality because much of scripture is metaphor and allegory. Some like John Crosson tend to throw out the baby with the bathwater, particularly on the issue of the Resurrection, but still regard themselves as Christians, Catholics even. Pope Benedict when he was Cardinal Ratzinger described original sin as a great problem for the Church. He rather directly wrote of the origin of Genesis as the compendium of creation myths from other cultures that actually changed in the first milenium BCE and did not reach its current form until the Babylonian captivity. A Howard Professor has written that original sin is original selfishness. I buy that. What we struggle with is the selfish residue of evolution and what marks humanity in Teilhard’s view is when. Alone among animals, it developed the awareness of self and introspection. Fundamentalists may find these ideas a long way from their faith, but it is at its core a deeply understood Christianity. We are not going to agree on theology and some may not even agree on the fact of evolution. Let’s concentrate on the Shroud and it’s message, the declaration of faith: Christ has died, Christ has risen. The third part, Christ will come again, is not a part of our debate for that coming may mean different things to different people. Let that be..","date":"2012-04-02","mins":"10:17 pm","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9903","author":"john_klotz","post":"Annie, Don’t go. The Genesis version of original sin was one the result of the patriarch centered pre Christian society which survives to this day. Think Taliban. For his time, Jesus was a radical feminist. Think the Samaritan woman at the well. Think, above all, of Martha and Mary..","date":"2012-04-03","mins":"6:34 am","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9910","author":"john_klotz","post":"He has already come in 1898..","date":"2012-04-03","mins":"8:09 am","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-208848","author":"john_klotz","post":"Let’s begin with one real error by the author that indicates either a certain ignorance or deliberate disingenuousness. Barrie was not “hired” to be a photographer. None of the STURP team were “hired.” Expenses were reimbursed when money was raised but they were not working for a fee. There is an arrogant attitude displayed by the authors in his dismissal of Barrie as a hired photographer. Barrie had a Masters degree from the leading photography school in the United States and had in fact done complex work with scientists who were dealing with photographs of nuclear explosions and readouts on analytical scientific devices. Photography is in fact an instrument of science. No where is that fact demonstrated more than the Pia photographs and the reactions to them. As there being “no sign of death on these clots” there were plenty of signs of death on the Shroud including the high levels of bilirubin and the seepages from the the wounds particularly the lance wound which has been identified as post mortem. Then there is the finding of rigor mortis by a slew of pathologists. But there is one thing that troubles me: it’s the authors use of Yiddish argot to depict the words of the scientists. There were Jewish scientists who worked with STURP, they were not a majority of the scientists. They were well educated and well qualified. Why the use of Yiddish? Is the author Jewish seeking to debunk Christ? Or is the author crudely anti semitic? Or is he simply a Don Rickles, Lenny Bruce fan? Much of contemporary American humor has it roots in the Jewish experience by comedians, who learned and honed their in the Catskills. None of them were a part of the STURP team. Then again, I sometimes feel that story of my life is like the punchline of Yiddish joke about a man who was offered a job by his Rabbi: a shekel a day to sit by the village gate and watch for the Messiah.”The pays not much, but the work is steady,” the Rabbi assured him..","date":"2015-08-24","mins":"5:31 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-208872","author":"john_klotz","post":"Colin, Do you check under your bed fo bogeymen at night? I know of no researcher who has tried to plant the idea that either Heller or Adler were a part of the STURP examination in Rome in 1978. Heller was a late addition to STURP but did not travel to Rome as is clearly indicated in Chapters “8” and “9” of my book Quantum Christ. They did work with fiber samples that were obtained by Ray Rogers in 1978. Eventually, Adler had access to fiber samples that were in possession of Prof. Gonella, scientific advisor to the Archbishop of the Turin. The fact is they had access to something you never have had: actual fibers from the Shroud. Your message is disingenuous becasue you seem to be trying to equate their access to Shroud fibers down to your non existent level..","date":"2015-08-24","mins":"10:30 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209420","author":"john_klotz","post":"Charles, I don’t know whether you’ve read my book but I discuss carbon dating in three Chapters. However, since publication of my book there was additional matters posted by Pam Moon. Also, Ray Rogers whose book on the Shroud was published after his death found physical evidence that took the Shroud out of medieval Europe and into the Mideast omg before 1355.. I am not going to regurgitate all of that on this post because I don’t think you’ve read Rogers book. When you have, get back to us..","date":"2015-09-01","mins":"5:53 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209440","author":"john_klotz","post":"You confirm my suspicion that you are only interested in artistic tomes that support with your predisposition. You are the parable of the blind men and the elephant personified..","date":"2015-09-01","mins":"2:09 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209572","author":"john_klotz","post":"It is amazing that what began as a rather supercilious post “Oy Veh” has resulted in a treasure trove of information from David, Louis and others. I have learned more about Jesus in Kashmir than I ever thought I needed to know – and did need to know..","date":"2015-09-04","mins":"5:41 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209579","author":"john_klotz","post":"Thanks for the clarification Louis. But whether we are talking about Jesus in Kashmir or any other place on the sub continent it’s a proverbial red herring distracting us from the tasks at hand which as you quite properly point out is dealing with the claim of Chrisit’s burial in family tomb in Israel which as been previously discussed on this blog..","date":"2015-09-04","mins":"7:47 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209103","author":"john_klotz","post":"“In particular, I was talking to a young surgeon last week who did not believe that the blood flow from the chest wound could have come from a body which had been dead for any length of time, based on his own recent experience with traumatic deaths.” Hugh, I have been impressed by what I perceive to be a more open skepticism on your part in the past month or so. However, I think your quote of a “young surgeon” to rebut Bucklin is a bit off the mark if you are seriously pitting his opinion against Bucklin’s. Your “young” surgeons statement is not very precise. What does “length of time” mean. Ten minutes? Two hours, a day? From the Gospel account we are told that a Roman soldier thrust a lance into Christ’s side and “blood and water” flowed out. What the pathologists have told us is that the water was in fact a clear fluid. It was in fact a signal of his death as the Roman soldiers probably knew from their experience as executioners. Christ was hanging on the cross at the time. How familiar was your young surgeon with the STURP findings and subsequent analysis. Had he scanned it once or twice or did he labor long hours into the night reviewing its multitudinous reports? How many autopsies has your young surgeon done? A ten? A hundred? a thousand? Bucklin had performed thousands. Is Bucklin’s report in inerrant scripture? Of course not. Zugibe has disputed among other things the cause of death as determined by his multiple predecessor pathologists – but Zugibe found a cause of death. He also critiqued the nail through the wrist finding which was frankly a matter of anatomical semantics. What we come down to is really a question of circumstantial evidence which in other contexts “atheist Pope” Richard Dawkins as decreed to be superior to eye witness testimony in many cases. The accumulation of circumstances can lead to a conclusion. We do not order our life by proof beyond a reasonable doubt but in the case of the death of the man in the shroud, doubt, in the totality of the circumstances, death is more than reasonable and beyond “reasonable” doubt. Jurors are sometimes told that “reasonable doubt” is a not a doubt “that come in the meddle of the night” but in the light of day. In law we have what are called “curbstone opinions.” That means someone asks a lawyer a question about the law when there is no lawyer client relationship. When the lawyer answers the questions he often ends with Of course, that’s my curbstone opinion.”What that means is “you are not my client and you can not rely on it.” An opinion identified by someone as only by “young surgeon” is a classic medical “curbstone opinion.” It’s like the guy in his kitchen performing research with his tea kettle. Another example of “curbstone opinions” is Charles Freeman’s unidentified experts who are free with their opinions but OMG don’t cite them by name. Circumstantial evidence about Christ is all that we have. The eyewitnesses are long gone. If I am sounding a bit too much like a lawyer, proving facts in real life is what we do. One of those facts often litigated is cause of death. In jurisdictions which still have a death penalty, circumstantial evidence can also cause death..","date":"2015-08-27","mins":"7:04 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209118","author":"john_klotz","post":"Hugh, The Islamic sect which sponsored Jalsa Salana accepts the reality of Christ but not his death on the Cross. There are, I am sure you know, a whole tradition of Christ in India – just as there is a tradition of Christ in Gastonbury before his public life. There is even a hymn about that (Jerusalem) based upon a poem by Blake that was song in movie Chariots of Fire. It was a favorite of my late son Michael. See http://johnklotz.blogspot.com/2007 10 01 archive.html In that piece I used scientific metaphors for that became the guts of “Quantum Christ.” I think the authenticity of the Shroud is a very, very important issue. I am beginning preparation of new work which will be essentially a palimpsest of “Quantum Christ.” I first saw the first word palimpsest in the opening credits of the movie version of “The Name of the Rose.” Umberto Eco is one of the foremost , if not the foremost, scholar of semiotics in the world. I just had to use it now..","date":"2015-08-27","mins":"8:58 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209138","author":"john_klotz","post":"Excellent post John. Do you have a specific reference for that quote from Francis? I look that the things he has accomplished and is trying to accomplish an I think: Someone has let the Holy Spirit lose. I alter found out that a classmate of mine who is pastor of an inner city Syracuse NY parish, had a banner hanging in hanging in the choir loft church: “Someone has left the Holy Spirit lose and “she” is wild.” There was no communication between us for years. Noosphere anyone?.","date":"2015-08-27","mins":"1:31 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-208866","author":"john_klotz","post":"Louis, A superb, scholarly piece. Thank you..","date":"2015-08-24","mins":"9:02 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209376","author":"john_klotz","post":"Interesting insight David. It makes the emergence of Pope Francis and his intent to designate third world Cardinals all the more important. One thing I have learned from this thread is the importance using “Jesus” instead of “Christ” when engaging in cross culture colloquies..","date":"2015-08-31","mins":"1:08 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209283","author":"john_klotz","post":"Ron, I think the dispute over whether Christ had died on the Cross or survived and was revived, is simply too serious to lend itself to ethnic humor. I have dealt sarcastically with some of the claims made here. For example that the man in the Shroud was actually Jacques de Molay. That is a claim that can be answered with scorn, maybe even satire. The issue of whether Christ was dead or alive is not such an issue becasue it goes to the very heart of Christian belief. I did not have the benefit of a “Jesuit” education. In law school one of my colleagues who had attended a Jesuit College stated that he had been told by a Jesuit priest that the only doctrine that was a sine qua non for a Christian was the Resurrection. Now there are some who regard themselves Christian who will argue with that but I think it is a fair statement. Others may disagree and that’s okay for in the final analysis our individual salvation is determined to our fealty to two great commandments of love. The bookend holy days that mark the Christian faith are the nativity which celebrates the transfiguration of the human spirit by the birth of God made man and Easter, which is the hope of our salvation. They have been both satirized cruelly and ignorantly in the past. So when you begin a discussion of the issue of the reality of Christ’s death and Resurrection with a rather crude ethnic patter, that’s just not okay. On the other hand, the reputation of the Islamic sect that has your adherence is very okay. There is more than one road to paradise but they are all paved with the same thing: love..","date":"2015-08-29","mins":"10:42 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209435","author":"john_klotz","post":"Typo errantly = inerrantly.","date":"2015-09-01","mins":"11:56 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209434","author":"john_klotz","post":"Louis, That is a fascinating article and I am in awe of the scope of your intellectual inquiries. Of course, neither you or I write errantantly. As important as Freud was, he is but a footnote in the march of philosophy and science when compared to Teilhard..","date":"2015-09-01","mins":"11:55 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209418","author":"john_klotz","post":"Hugh, Excellent post in many respects. It all comes down in my opinion, to the carbon dating. Without the carbon dating I submit the evidence for authenticity far out weighs the claims of inauthenticity, The carbon dating fails for a number of reasons. First its accuracy is over sold to begin with and second, and more importantly, was the abandonment of the protocols which had been the subject of discussion for several years before 1988. That responsibility lies ultimately with [St.] Pope John Paul II. Without acceptable protocols ANY scientific test is garbage. I have conducted an informal poll of a few individuals with experience in scientific testing. Simple question; have you ever applied for a grant without approved protocols. The answer is no. Can’t happen. The skeptics who claim intellectual superiority are either benignly or malevolently accepting of the flawed carbon testing. As far as the physical reality of the Resurrection, if it began with the physical body it could have left physical traces. It fact it did. They are in the Shroud of Turin..","date":"2015-09-01","mins":"5:32 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-10667","author":"john_klotz","post":"Yannick, Superb post and I really agree with virtually everything you said with one exception: that the image was created by a “miracle”. I believe that as our knowledge expands, that image maybe explained, perhaps by some quantum process. However, applying Occam’s Razor (or the Sherlock Holmesdisctum) it appears to me that the Resurrection is the simplest solutuon..","date":"2012-04-21","mins":"10:39 am","url":"https://shroudstory.com/2012/04/21/please-dont-forget-the-evidence-of-the-bloodstains/","cat":"blood_studies","title":"Please, don’t forget the evidence of the bloodstains !!!"},{"id":"comment-26515","author":"john_klotz","post":"Rudy Dichtl has made great contributions but there is a point where we have to make decisions on the evidence available. Based upon all the evidence available, the Shroud is a burial cloth of Jesus Christ. It is a matter of probabilities. How many Jews were crucified in 30 33 CE who claimed to be the Messiah? That is the specific event we are considering. Best bet is probably only one, but I would like to be challenged on that with specific cases if they exist. Saying there MAY have been others when there is no historical evidence of any others in that time period does not create doubt, reasonable or otherwise. Yes, there were other individuals who claimed to be the Messiah, but how many were crucified by the Romans circa 30 CE (AD). The Roman historian Tacitus noted that “Christus” was executed by Pontius Pilot at that time period but that the execution didn’t put an end to his superstition which spread to Rome where 20 or so years later Nero launched his persecution of the Christians that ultimately took the lives of Peter and Paul. IS THERE ANY OTHER CULT WHICH SPREAD TO ROME AFTER ITS FOUNDER WAS EXECUTED BY PONTIUS PILATE? NAMES PLEASE!!!! It’s circumstantial evidence – you betcha. But every year in the United States where the standard is proof beyond a reasonable doubt, people are convicted of crimes and sometimes executed on the basis of circumstantial evidence. We do not order our lives by proof beyond a reasonable doubt. The circumstances are such that they establish the authenticity of the Shroud, and, I believe, beyond REASONABLE doubt. Reasonable doubt is a not a lingering suspicion that comes in the middle of the night. Where the facts point so strongly in one direction, reasonable doubt must then be based on facts. When evidence is adduced that a certain event probably happened, doubt not based on facts is not reasonable. There is no authentic doubt about the Shroud once it is established that it is a linen cloth that once enwrapped the body of a crucified man who was scourged, beaten, nailed to a cross and his side pierced with a post mortem (after death) spear wound. There is even evidence that he carried the cross bar on his shoulders and walked through streets that had limestone stone dust compatible with the streets of Jerusalem. There is also evidence that he fell and because he was carrying the cross bar, he couldn’t break his fall, injuring a knee and the tip of his nose. The accumulation of facts is overwhelming. The question that nobody has ever answered, given the circumstances is: If not HIM, who?.","date":"2013-03-05","mins":"10:49 am","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone"},{"id":"comment-26522","author":"john_klotz","post":"What I would ask for is for any evidence that such a double twin existed outside of Muslim lore. Tacitus was not a Christian and he thought them an ignorant, superstitious lot. If it were a trial, and a man was found with a gun, which matched the bullets which killed somebody, and he was seen with the victim a few minutes before shots were heard. If he were to claim that it was twin brother who he had loaned the gun to for five minutes that wouldn’t fly if in fact, he produced no evidence indicating that he had, in fact, a twin brother..","date":"2013-03-05","mins":"11:30 am","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone"},{"id":"comment-35596","author":"john_klotz","post":"Execellent posting Yannick. One thing though, be careful not to entangle the blood issue with the image issue. There is so much speculation about the image “transfer” mechanism that all turns out to be wrong. One thing I belive can be stated as a FACT: the image has nothing to do with the blood. They just happen to be from the same body but the processes creating the “blood” stains are well documented. Not so the image. We have the result and we have the subject but the process that transferred the body image to the cloth is simply unkown and perhaps, for the time being, unknowable. (By the way, I first saw that dichotomy between the iamage and the “transfer” mechanism in John Heller’s memoir. He was the one who recruited Adler for the Shroud study.).","date":"2013-06-01","mins":"6:51 am","url":"https://shroudstory.com/2013/06/01/the-orphaned-manuscript-and-the-color-of-blood/","cat":"blood_studies","title":"The Orphaned Manuscript and the Color of Blood"},{"id":"comment-212347","author":"john_klotz","post":"Dave has really nailed it with his post. I would point out that my source was primarily Heller who although not personally in Turin, did participate in the follow up conferences and interviewed the participants. Obviously the primary source for this information is Sam Pellicori. Right now, I can not comment further. I have pressing professional commitments that require around the involvement. As far as the Shroud is concerned I am content with the evidence of authenticity and I am moving on to the issue of the providence of the Shroud’s survival among other things. But most importantly, humanity is literally on the brink of irreversible processes leading to its extinction, a real not a metaphorical apocalypse. I have dubbed it the Apocalypse of Selfishness and the epitome of selflessness for me remains Christ on the Cross. The working title of what will be a palimpsest of “Quantum Christ” is “The Apocalypse, the Pope and the Shroud.” See Chapter 17 of “Quantum Christ.” A lot has happened since I wrote that. Frankly, Shroud skeptics are in my mind like the neighbors of Noah who couldn’t understand why he was building that big boat..","date":"2015-10-12","mins":"5:20 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-212360","author":"john_klotz","post":"John, The Old Testament is not recorded history. It’s stories though reflect human experience in a metaphorical form. As far as worldwide flood, I am in perfect agreement with you. However, at the end of the last Ice Age there were in fact floods of apocalyptic size. The Persian Gulf was once an idyllic land, perfect for a hunter gather society. Are you denying that ocean levels rose dramatically after the end of the last Ice Age?.","date":"2015-10-12","mins":"8:28 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-212434","author":"john_klotz","post":"Look, it’s a myth, a metaphor, a parable. But it has a certain value as a myth or metaphor or parable. Much of scripture, particularly Genesis should not be read as a scientific or historical tract but as a reflection of humanity coming to terms with itself and its divided nature which aspires to the divine while yielding to the basic drives that drove evolution. But the simple historical and scientific fact is that at the end of the last Ice Age humanity was in fact inundated by huge floods and rising tidal waters. The Persian Gulf was once an idyllic place where hunter gathers could prosper: A veritable lost Eden perhaps. The legend of a hero overcoming the flood sent by the God(s) exists in more than one ancient culture. They may be a tiny spark of truth in those legends. That there was a Noah who saved all the living creatures by taking them two by two aboard an huge Ark is neither history nor scientific fact..","date":"2015-10-13","mins":"9:28 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-212367","author":"john_klotz","post":"Louis, I covered the pre scripture origins of the Noah story in Quantum Christ. The prevalence of flood myths indicates that while the hero may be mythic, the apocalyptic floods were not. Take a look at any map of the Earth during the Ice Age and you will see that vast stretches of what are not ocean bottom were once dry land. That includes the Persian gulf. For example: http://www.iceagenow.com/Sea Level During Last Ice Age.htm.","date":"2015-10-12","mins":"10:03 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-212368","author":"john_klotz","post":"Typo: are not ocean bottom = are NOW ocean bottom..","date":"2015-10-12","mins":"10:08 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-212375","author":"john_klotz","post":"Louis, My point would be that the Gilgamesh and other ancient texts are reflections of a vestigial memory and oral traditions probably handed down generations by people who survived them. Also, cf noosphere which may reflect quantum information of the universe as it was later hypothesized after Teilhard’s death. I am ducking in and out of this as I deal with other matters of a pressing matters totally unrelated to the Shroud except that I am beginning to pull together my published material and some recent critical publications (meaning extraordinarily important) relevant to The Apocalypse, the Pope and the Shroud. For example, last December Scientific American quoted a study that 2014 was the hottest year on record.and the in August a study that the first seven months of 20155 were the hottest on record and that 2015 was on track to be the hottest year of record. Then again there was an excellent blog in the NY Time blog about how the man made destruction of the Amazon rainforest will in fact cause the atmosphere to become drier, reducing precipitation worldwide. Oceans rise while desertification spreads. I can’t believe that the condo market in Florida is booming..","date":"2015-10-12","mins":"11:27 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-212379","author":"john_klotz","post":"Stay tuned.","date":"2015-10-12","mins":"12:40 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-187401","author":"john_klotz","post":"Kelly, You just saved me a great deal of distraction and effort to draft a reply. Colin having claim that pious pathologists should be doubted because of their piety put his own beliefs on the table. Does his world view have room for the reality of the Resurrection? If not he is not a skeptic seeking truth but an agnostic atheist seeking to justify his world view. Or should we accept a scientific opinion by a pathologist because he has the integrity of his profession and years of experience in examining dead bodies and reaching scientific conclusions.(See e.g. Bucklin) It’s not the the Resurrection is a sine qua non for expressing an opinion. But if a skeptic can not deal with the authenticity of the Shroud, his or her opinion must also be suspect by Colin’s standard..","date":"2015-01-30","mins":"5:46 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187195","author":"john_klotz","post":"That’s a nice theory but the examination of the blood stains has not revealed anything but metahemoblobin (ancient blood) and no paint connected to the stains (not to mention the serum halos). Also, the redness of the blood was attributed to bilirubin in the blood caused by trauma. Blood added in the Middle ages (or even a few decades maybe even days) would have lost its vital redness unless also charged with bilirubin, not a likely scenario. I applaud Colin’s ingenuity but I don’t think it answers any questions about the blood. That is of course only my opinion..","date":"2015-01-29","mins":"7:31 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-14271","author":"john_klotz","post":"Yannick, You have truly written a masterpiece explaining the over whelming evidence supporting the Shroud’s authenticity. Congratulations. Anyone who is interested in the Shroud from any perspective should read this article. Of course, one can expect the pseudo skeptic trolls who seek to distract us, and avert our eyes (and theirs) to the truth revealed by the evidence will be soon best us with the pseudo facts and pseudo science. But before the fog rolls in, be advised that this is a clear and documented paper that sets the bar for the rest of us high, very high indeed..","date":"2012-07-28","mins":"6:56 am","url":"https://shroudstory.com/2012/07/28/yannick-delights-with-another-great-paper/","cat":"blood_studies","title":"Yannick Delights with Another Great Paper"},{"id":"comment-137634","author":"john_klotz","post":"A hypothesis: If the image is related to the process of Resurrection, then the image would consist of what was being resurrected. Blood that had left the body and created stains would not be a part of the process. It does appear that the blood stains which were “left behind” did block the information THAT that the process recording the Resurrection. [Sill on vacation]..","date":"2014-07-13","mins":"10:30 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-14500","author":"john_klotz","post":"I think it’s time to end this string. C’est fine! Merci..","date":"2012-08-05","mins":"9:44 am","url":"https://shroudstory.com/2012/07/28/yannick-delights-with-another-great-paper/","cat":"blood_studies","title":"Yannick Delights with Another Great Paper"},{"id":"comment-14272","author":"john_klotz","post":"Correction: “beset us” not “best us”.","date":"2012-07-28","mins":"6:58 am","url":"https://shroudstory.com/2012/07/28/yannick-delights-with-another-great-paper/","cat":"blood_studies","title":"Yannick Delights with Another Great Paper"},{"id":"comment-46613","author":"john_klotz","post":"Oh, it makes me soooo mad. (Lou Costello, circa 1950)..","date":"2013-10-09","mins":"6:54 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","title":"You guys are brutal"},{"id":"comment-13975","author":"john_klotz","post":"The only value in Colin Berry’s comments is that they engender inspired posts like this one. Berry is a classic pseudo skeptic. He has a belief system that can not tolerate the existence of the Shroud as a true artifact. So he swings wildly and pontificates on matters far beyond his expertise. The downside to Berry’s posts is the time we often waste paying attention to them. Yet, we must confront the pseudos head on in the marketplace of ideas. In this time and place,.","date":"2012-07-19","mins":"6:41 am","url":"https://shroudstory.com/2012/07/19/yes-blood-on-the-shroud-really-could-be-really-old/","cat":"blood_studies","title":"Yes, Blood on the Shroud Really Could Be Really Old"}]
