[{"id":"comment-34408","author":"john_klotz","post":"Dan, The most evocative use of the the”silent witness” phrase was in the title of David Rolfe’s film released on Easter Monday 1978. Rolfe’s film that ubdoubtedly paved the way for the STURP team to Rome. An Italian version was issued a few weeks later. The movie was written by Rolfe, Ian Wilson and Harry Lincoln. Perhaps David or Ian might enlighten us who the idea for the movie name came from. Perhaps not, it is what it is. Small plug: you can get a copy of Silent Witness and two subsequent Rolfe films about the Shroud on DVD from Amazon. Silent Witness was the first and the best. Five stars. ***** Anyone who is interested in the Shroud who hasn’t seen it, must see it. Really..","date":"2013-05-23","mins":"4:59 am","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","title":"A kind of witness?"},{"id":"comment-34470","author":"john_klotz","post":"When it comes to witnesses of the Resurrection, the interesting fact is that the Gospels posit the first witness as a woman: Mary Magadalin. In Corinthians, St. Paul only writes of male withnesses. St. Petter and then 500 brothers. Several writers including N.T. Wright have concluded that the fact that the Gosples have a woman as the first witness is evidence that the Gospel traditions pre date Corinthians. Woman were not even allowed to be witnesses in court in most circumstances. If you want to know the status of women at the time of Christ, think Taliban..","date":"2013-05-23","mins":"10:58 am","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","title":"A kind of witness?"},{"id":"comment-83033","author":"john_klotz","post":"I was honored to be there and actually, finally, press the flesh with Barrie after two years of extended contact via the web and telephone. But someone in attendance was an echo of the Shroud’s past history that was totally unexpected, It was a wisp of the Shroud in history that I had already referenced in my manuscript citing in John Walsh’s book on the Shroud published after WWII.. She introduced herself to Barrie. She had, like others at the presentation, corresponded with Barrie but never met him personally. She identified herself as the grand niece of Rev. Peter R. Beecher. Beecher was an Irish cleric who wrote the first Shroud book in English. Vignon’s 1902 book had been translated into English from French circa 1902, but Beecher’s was written in English circa 1930. He sallied forth to do battle with English Jesuit Herbert Thurston and Beecher was a lively presence to the branch of his family who were in the US (as was his antipathy to Thurston). We are in the study and debate about the Shroud dealing with cosmic issues. By some “accident” of history, Barrie has become the leading of voice for the authenticity of the Shroud. The packed presentation at St. John’s attests to that. There is something distinctively Jewish in his presentation, particularly in is world wise humor which makes it so lively. (Let us mourn the passing of Sid Caesar). Did I write “accident.” Make that providence. Or better Divine Providence..","date":"2014-02-27","mins":"7:34 am","url":"https://shroudstory.com/2014/02/27/barrie-schwortz-at-st-johns-from-skepticism-to-belief/","cat":"event","title":"Barrie Schwortz at St. John’s:  From Skepticism to Belief"},{"id":"comment-83095","author":"john_klotz","post":"Annette, If everybody Barrie has helped in the past twnety years attended, they wold have needed Madison Square Garden..","date":"2014-02-27","mins":"12:09 pm","url":"https://shroudstory.com/2014/02/27/barrie-schwortz-at-st-johns-from-skepticism-to-belief/","cat":"event","title":"Barrie Schwortz at St. John’s:  From Skepticism to Belief"},{"id":"comment-193545","author":"john_klotz","post":"Sampath, Human history is replete with things that were “miraculous” and later explained. The volcano did not explode because Tiki god was hungry for human sacrifice. I believe it may very well have been providential that the Shroud survived until the time when science could unlock its mysteries. We have now the face of Jesus and the scientific investigation has given us more knowledge and awareness of how he suffered than ever before. And, I believe that ultimately we will understand the process of image formation and when we do we will understand more deeply the Resurrection. That lies in the future. Probably not in my lifetime but maybe in yours. The march of science, whether those scientists who are atheists understand it or not, is the march of humanity to its creator..","date":"2015-03-16","mins":"6:17 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193707","author":"john_klotz","post":"My statement is based upon the work of Nobelist Sir Roger Penrose and Stuart Abramoff. To keep it short, I suggest you see my positing at Michael Redux: Quantum mechanics, consciousness and love http://johnklotz.blogspot.com/2012 08 01 archive.html There is a video that you can review cited. The URL which is in the post is http://vimeo.com/39982578. Do serious scientists dispute their claim. Yes. Do they adhere to it yes. Hameroff probably goes further than Penrose in connecting consciousness through the quantum to “paranormal” phenomena. There is link in that post to an October 2007 post. That was before I began to delve more deeply into the quantum..","date":"2015-03-18","mins":"5:10 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193490","author":"john_klotz","post":"It was a typo, otherwise it makes no sense. It was a specious claim that the Shroud was a photograph created by Da Vinci that was one factor that caused Barrie to found shroud.com.","date":"2015-03-16","mins":"7:04 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193595","author":"john_klotz","post":"Louis, Wilson may have noted the photographic quality of the Shroud but not that it was an actual medieval photograph in the way that others have claimed it be. It was a telephone call from a friend that had seen in a news magazine sold in a supermarket that the Shroud was a photograph created by Leonardo Da Vinci that convinced Barrie that he needed to create the web page that became Shroud.com. There is a remembrance of that by Barrie that was published by the BSTS and I do not have the time to dig it out right now. It’s on shroud.com My yellow lab Bogie needs a walking and I have struggling with how to cram a thirteen page paper on Finding Jesus into a web posting and retain its formatting and several great images. And occasionally actually practice law..","date":"2015-03-17","mins":"6:55 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193530","author":"john_klotz","post":"The trouble with this blog is that people are constantly discovering the wheel or claiming what has been demonstrated hasn’t been demonstrated. The findings of STURP were peer reviewed and published. For, let say, an art historian to cast doubt n those peer reviewed scientific findings without anything but his own in credulousness is an exercise in navel gazing. I believe that Richard Dawkins may have coined the phrase “argument from incredulity” to describe fundamentalists who reject evolution because they can’t believe it. He certainly used it. Blood was discovered on the Shroud. One of the processes used was multi spectral analysis. Initially it was identified as primate blood but further investigation it was determined to be human. As important to its identification as blood were invisible serum halos around the major stains, particularly the spear wound were detected. It would not have been possible or conceivable for a forger to do this without the use of real human blood. Heller asked medieval art experts whether they were aware of any artists who used blood and the universal answer was no. Perhaps Charles could enlighten us as to any medieval artist who used human blood and where we might find EXISTING examples that have survived from Medieval times. The blood on the Shroud exists today. Mc Crone came up with serial explanations for the “painting” of the blood all of which were conclusively rebutted buy the scientific analysis. This is one of the areas where science and history merge. The conclusions to be drawn have theological impact. It’s a triple header If there are any of the skeptics who refuse give credibility to the peer reviewed findings of STURP and the facts documented by photographs and other scientific devices and not just in their written reports, you’ll excuse me if my patience is exhausted. After Lee’s great blunder at Gettysburg resulted in the Confederate debacle of Picket’s charge he was heard to lament, Too Bad, Oh too bad! God forgive me but my response to the pseudo skeptics who populate this site is “Too f*** bad.” Now I have to make a Novena. Anyone know the Catholic joke about making a novena. It’s language is pristine..","date":"2015-03-16","mins":"2:06 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193479","author":"john_klotz","post":"Hugh, I do not believe in miracles, I believe there are things we don’t understand. The Shroud attests to the FACT that within three days of his crucifixion, the body of Jesus Christs parted company with his burial cloth. Science will some day explain that. The sum of the evidence for that fact is overwhelming. All that stands in the way is the blind faith that accepts the results of the carbon dating which Thomas de Wesselow tabbed a “fiasco” in “The Sign.” But de Wesselow than fantasizes that ALL the reported appearances of Christ post Resurrection were observations of the Shroud because his agnosticism can not accept the Resurrection. . Some scientists are already discovering that in quantum phenomenon there is an explanation of eternal life. Concepts such Teilhard’s noosphere and Jung’s collective unconsciousness are getting rolled into the concept of the quantum information of the universe. Stuart Hameroff and Nobelist Sir Roger Penrose hypothesize that the brain is quantum computer functioning through quantum entanglement – action at a distance. Einstein originally rejected entanglement as “spookie.” As predicted by Teilhard, science and faith are now converging and will run on parallel paths. Each will educate the other. Some are more comfortable with a blind faith. I prefer faith with eyes wide open. These are exciting times and right in the middle of it is the Shroud of Turin. I will blog on the carbon tests in a few days.”Do you have eyes, and not see, and do you have ears, and not hear?” Mark 8:18.","date":"2015-03-16","mins":"5:58 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193500","author":"john_klotz","post":"I have taken a lecture course on Quantum mechanics in preparation for writing this book but have had a life long interest in science which includes the Quantum. In the past four years my library expanded by about 125 books, many of them many of them on science and several of them on the quantum. AT 17, I learned how to make a tesseract (a four dimensional analog of three dimensional cube). My interest in science is is more than seven decades old. Did you ever experiment with vinegar and baking powder in a corked bottle as a child? I got my first chemistry kit age 8 or thereabouts. Did you ever hear of Boltzman Brains? Just asking. By the way, there is no impertinence about asking for qualifications. But like the Shroud, Quantum Christ speaks for itself. I will post a piece on my blog in the next few days critiquing CNN’s Finding Jesus episode on the Shroud. Here’s a brief preview: “Teilhard de Chardin in The Phenomenon of Man anticipated a convergence of science and religion leading to a scientific analysis of the actions and direction of God in creating the existence that we know. Nowhere is that convergence more evident than in the study of the Shroud of Turin. There are a trio of intellectual disciplines that must be included in any analysis: Science, History and Theology. Any one who attempts to address the issue of the Shroud’s authenticity who doesn’t understand this trio is akin to one of the blind men describing an elephant: It’s a snake, no it’s a tree, no it’s a wall. “Anyone seeking to comment on the Shroud must not just nod to the trio, he or she must develop some understanding of each as it relates to the Shroud. Unfortunately, the first episode of CNN’s “Finding Jesus” broadcast Sunday, March 1, addressed the issue of the authenticity of the Shroud of Turin was a concoction of largely blind men (and women) defining an elephant.”.","date":"2015-03-16","mins":"8:39 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193591","author":"john_klotz","post":"Charles, Your personal reassurance isn’t an issue. I suspect you are very self assured (or deluded) as the case may be. No where in any place or position that I can think of it is anyone going to make a decision based upon your personal reassurance when on the other side of the scale are thousands of hours of documented, publicly available research and apparently none of your reassuring experts have the confidence to place their names on their advice. In law, we have what’s called a “curbstone opinion.” A lawyer comments on something gratuitously and is free to say what he thinks because the individual is not a client. In law, a curbstone opinion is worthless. A person who relies on a curbstone opinion can in some circumstances end up in jail. An expert who will not place his name or reasoning in the public arena so that it may be weighed and evaluated is essentially doing the same thing: giving a curbstone opinion, and as with lawyers the opinion is essentially worthless. You have no idea how little personal assurance from anonymous experts means so little to the mass of humanity or any identifiable fraction thereof. Or to quote a commercial for a hamburger chain in the US some years ago: “Where’s the beef?”.","date":"2015-03-17","mins":"6:08 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193692","author":"john_klotz","post":"Piero, Did the article mention that as a young priest Pious XI climbed the Alps with Paul Vignon who was the “father” of Shroud Silence. Vignon was the first to apply scientific principles to Pia’s photographs. He published a book in 1902 which was translated into English. Among other things he found the image was created by some kind of action at a distance although his theory of a “vapor graph” has been largely discounted..","date":"2015-03-18","mins":"11:49 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193511","author":"john_klotz","post":"John Green, The nature of out consciousness is one of the great frontiers and relates directly to religious issues. One of the places where it becomes relevant is in the issue of what are commonly referred to as paranormal phenomena. The scientists who study these phenomena are often derided by the main stream but the pehenomena are real. One example. During the Vietnam war, woman awoke in the middle of the night to the sound of a rifle shot. It was inexplicable in he normal course of events where she lived. She later learned that her husband had been killed in Vietnam and when she received details discovered that it happened by a rifle shot at the precise time she had been awakened in the night. I have a coleaugue who had been married but divorced. His ex wife moved to Florida. They had a dog who had passed away. One night he had dream about the dog had died. He came to him in the dream barking as if he should wake up and do something. His sense was that it involved his exwife. It was totally inexplicable. He called his ex wife the next day and asked if she was okay. She told him she was getting married that day. That marriage didn’t turn out well.. Then there is the case of Hans Berger Berger which I discuss in Chapter 15 of Quantum Christ: Consciousness, Evolution and the Genesis of Good and Evil ————————————————————————————————————— Who is right about human consciousness: the neo Newtonians or those who find consciousness to be a quantum phenomenon? Perhaps we should begin with the “incredible,” and ultimately tragic, saga of Hans Berger. C.Hans Berger and his magic machine Hans Berger was born May 21, 1873 in Neuses, a small Bavarian town that was eventually absorbed by the City of Coburg. He was the son of a well to do physician. His father’s wealth freed Berger from the day to day struggle of the less fortunate to just survive. He had interests, but no extraordinary ambition. Hans was not interested in pursuing a career in medicine and settled, initially, on a career in Astronomy. He enrolled as a mathematics student at the Fredrich Schiller University of Jena to prepare him for that career, but the pace of life in the city held no allure. He left college and began a year of military training to sort things out. It was while in the cavalry, that an incident occurred, that not only changed the course of his life, but the course of what we call neuroscience, the study of the nervous system, including the brain. One morning, he was thrown from his horse during a training exercise. He landed on the road in the path of a fast approaching team of horses pulling a heavy gun carriage. His thought was quite explicit: “I’m going to die.” Fortunately, the drivers of the gun carriage were able to rein in their team of horses and it stopped short of Berger. Shaken, but not injured, he returned to his exercise and his duties. That evening, when he returned to his quarters, he found a telegram from his father inquiring about his welfare. That morning, his sister had become quite hysterical because she felt that Hans had been in an accident and died. His father inquired anxiously if he was all right. Berger promptly responded but he was amazed that his sister had an attack of hysteria at the moment of his grave peril when he consciously thought he was about to die. It was a life changing moment for Hans Berger. His attention turned to neuroscience. He concluded that the brain must in some way think and process electromagnetic waves and that in some way his thought of his impending death had been transmitted to his sister with whom he had a close relationship. Needless to say, as he advanced in his study of neuroscience, contemporary colleagues were quite dubious and treated his ideas with derision. Undeterred, he developed a machine to measure “brain waves.” More derision, but in 1924, his machine began to achieve acceptance. It was dubbed the Electroencephalograph, the EEG, which was a breakthrough in the analysis and treatment of brain disorders. Berger’s life continued on a troubled plane. He never received what he regarded as his proper recognition. The next two decades would see the rise of Adolph Hitler and the Nazi party. There is some controversy about whether Berger was a Nazi collaborator. In any event, he retired from the University of Jena in 1939. In 1940, plagued by ill health and his failure to achieve what he regarded as his proper place in the scientific pantheon, he committed suicide. Today, there are research organizations in neuroscience that have either adopted his name or sponsor conferences in his name. The EEG, which was a scientific breakthrough of the first order, has been in some respects replaced by the magnetic resonance imaging (MRI) which allows analysis not only of the brain but the entire body or selected parts of it. Professors Bruce Rosenbaum and Fred Kuttner, of the University of California Santa Cruz, writing in The Quantum Enigma: Physics encounters Consciousness, claim that “One third of our economy” involves products based upon quantum mechanics and go on to describe four of them: the laser; CC Ds (charge coupled devices that, among other things record images in digital cameras); the transistor; and the MRI. The scope of these four devices that use quantum mechanical methods indicates the distinction between the reflective consciousness of humanity and the consciousness of all other life on earth. Mastering quantum mechanics is one of the greatest accomplishments of humanity’s reflective consciousness. Most importantly, that reflective consciousness is the reason we, as distinguished from all other forms of life on earth, are constrained in our actions by ethics and morality. All other living creatures answer to unfettered instinct. The natural world is a violent, nasty place. Is humanity different? If so, why? —————————————————————————————– There will be those who find precursor attributes in the animal kingdom such as empathy and perhaps even a kind of ethics. Also, animals clearly have access to quantum phenomena. The migration of birds is alleged to guided by access to the quantum. That is a debate that would lead us to far from the issue at hand. Some might argue about my description of Neo Newtonians as deterministic, This is probably not the place to debate those issues. There are others devoted to philosophy who made resent the intrusion of hard science into philosophical issues. I would also direct attention to the hypotheses of consciousness being advanced by former Astronaut Dr. Edgar Mitchell who once co authored a piece with – gasp – Sue Benford. I do not adopt or advocate any of these necessarily. But there is a direction and of both science and religion and we are being pulled in that direction. I guess when push comes to shove I am a “Chardinist” (as in Teilhard de Chardin). (I was so labeled in private correspondence by a contributor to this blog who as a degree from the Harvard Divinity School and thought my ideas Chardinian)..","date":"2015-03-16","mins":"11:05 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-207334","author":"john_klotz","post":"Weird but interesting. And I am reminded of Pope Francis startling statements: You am I to judge? … We are all sinners..","date":"2015-08-03","mins":"7:04 am","url":"https://shroudstory.com/2015/08/03/byob-exhibition-of-the-shroud-of-turin-in-toronto/","cat":"exhibition","title":"BYOB+ Exhibition of the Shroud of Turin in Toronto"},{"id":"comment-22754","author":"john_klotz","post":"Thurston the Shroud skeptic who made Pia and Vignon miserable, stated that it is either the Shroud of Jesus or a forgery intended to be Jesus. He opted for the forgery. The story of Christ’s crucifixion has survived nearly two millennia. If the skeptics have another candidate tell us who he is. You can’t because only one figure in history was treated the way Christ was and there is not the slightest scintilla of evidence that anyone else was. Frankly, I feel sorry for those who are so embittered against Christianity (for some very good reasons by the way the Fourth Crusade is maybe reason enough) that they can not recognize the truth that is before them, truth that is proven BY SCIENCE..","date":"2013-01-26","mins":"4:07 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","title":"Eric J. Jumper to Speak on the Shroud of Turin"},{"id":"comment-49174","author":"john_klotz","post":"Brace your self Mr. Freeman, I agree with much of what you have written. However, I don’t think an Oxford style debate is appropriate, I think a lively two or three sided panel discussion with contrasting views would be. However, I am not planning the St. Louis Conference. I think you haven’t been acquainted withe the “debates” that have occurred and whose evidence is on Shroud.com. I believe that Dan Porter could point out the number of posts from individuals who reject the early Edessa scenario espoused by Ian Wilson and supported by many.and dismissed by some. As far as the Knights Templar are concerned, I am uneasy that hey have the “usual suspects” of history. I think Wilson deserves an immense amount of honor for the pioneering work he has done on the Shroud. Have you seen the 1978 award winning documentary by David Rolfe. It originated with an concept submitted by Wilson to Rolfe in circa 1975. . As an historian, you could have much to contribute and I think in explaining your proposal you have already made a contribution. I can assure you that are ideas which will be presented at this conference that are in fact controversial among Shroud advocates and some of them can be very dogmatic and/or heated in making their arguments. I’ll go you one further in the science field. If a participant in the C14 carbon dating would make an appearance for a free wheeling discussion of the findings of Rogers et al, that would be really a plus. I don’t think any would accept the challenge to participate in an open forum although Charles Ramsey of Oxford has been the most open. I would love to see Richard Dawkins participate in a conference. He might learn something. Maybe that the C14 dating isn’t “rock solid.” John Klotz klotzlaw@gmail.com http://johnklotz.blogpsot.com http://quantumchrist jck.blogspot.com/.","date":"2013-10-30","mins":"5:20 am","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-49188","author":"john_klotz","post":"Colin, I agree with the thrust of your comment. So, in fact did Ray Rogers and others on the authenticity side. However, it’s not within your or my control. Maybe a thrust of the conference ought to be a discussion of the requirements for new C14 testing more in line with STURP’s original recommendations 30 years ago. Gove and the C14 labs were so intent on denying STURP involvement that metaphorically shot themselves in the foot by spurning advice on site selection. “The fault dear Brutus lies not in our stars but in ourselves” Unlike Brutus the fault does lie in our stars, but at events that STURP couldn’t control..","date":"2013-10-30","mins":"7:14 am","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-49192","author":"john_klotz","post":"It was their decision to proceed with a flawed protocol. But the elimination of STURP was a determined campaign by the labs orchestrated by Gove. Have you read his book?.","date":"2013-10-30","mins":"8:18 am","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-49240","author":"john_klotz","post":"Georgio, AMSTAR was founded in 1996. Its President was Tonm D’Malaha, the last president of STURP. The carbon dating occurred in 1988, 8 years before AMSTAR came into existence. There was a lead up to the Carbon dating of nearly six years. Other than STURP, the only other American involved was Bill Meacham and he attended all the principal conferences. Gove in his memoir stated while he was disappointed, who took satisfaction from having eliminated STURP from the process..","date":"2013-10-30","mins":"2:45 pm","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-49177","author":"john_klotz","post":"Colin, Rae Rogers was published in a peer reviewed scientific journal before he died. Also, a book he wrote with the assistance of Barrie Schwortz was published two years post mortem. It come down to Ray Rogers because he’s right and often misunderstood (as I ini tially misunderstood). The issue isn’t that the cotton skewered the date, it’s that linen in the patch was of medieval origin and substantial different than the lined in the other parts of the Shroud. But enough of this. The topic is Freeman’s inquiry about he nature of conferences and I merely applaud both his question and the concept of his question. I think from his question, if he is sincere, he might have much to add as an art historian..","date":"2013-10-30","mins":"6:09 am","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-49253","author":"john_klotz","post":"Colin, I was replying to a message that Georgio had posted to correct the record. I would agree that the time is long past for further non intrusive scientific examination of the Shroud. The problem is that neither you nor I, nor apparently anybody else, can get Turin to budge. I believe there may be an element in the Church that prefers the Shroud remain a mystery. If the Shroud’s authenticity is established then it becomes no less than a Revelation with a capital R. We will know more about the real Jesus that at any time in history. Also, it will be an accessible revelation. There may be some in the Church who would prefer that not happen. Holy icon, yes. New Revelation, No. I am not sure about how Pope Francis would feel if he addressed the problem. He seems somewhat obsessed with serving the poor and downcast. I don’t know where he got that from. (I’m kidding, of course I know where as does any other Christian). In some circles, I am regarded as a liberal or worse. I like to say that I am slightly to the right of JC. The only person on this blog who is directly involved in organizing the St. Louis conference is Joe Marino. I expect he is reading this thread. Actually, I am some what excited by what people are writing. I think we owe a debt to Charles Freeman for kicking this off. Maybe a theme for the conference should be “What next?” Excuse me for mentioning STURP again, but it gained unprecedented access to the Shroud. It was a unique confluence of energy that caused that to happen. First and foremost, perhaps, was Father Peter Rinaldi who was an Turin born priest serving in the United States who in a figurative sense was the one who brought the shroud to America. Then there were was Silent Witness, the David Rolfe film based upon an concept by Ian Wilson. Then there was Ian’s first book. And, although it rubs my populist grain the wrong way, there was the exiled King of Italy, Umberto. And there was of course, John Jackson, who caught fire (almost literally) and with the help of Eric Jumper organized STURP. When you appreciate this confluence, you might add another factor and please don’t groan: the Holy Spirit. It’s enough to make one believe in the Trinity. It was and is a fantastic story. The challenge is to repeat it. Maybe the first stop is St. Louis although it must be a truly international effort. However, I believe the Shroud doesn’t belong to Turin, or the Church but to humanity..","date":"2013-10-30","mins":"4:31 pm","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-49298","author":"john_klotz","post":"Charles, I really regret that neither of these conferences fits into you schedule. I do not believe that your concept of a single lab no matter how well qualified taking possession of the Shroud for testing would fly. Although the sample selection for the carbon testing was flawed, the fact is that the three labs were supposed to test there samples and not consult about their results. That simplest part of the protocol was not honored, but the concept having three independent tests as a check on each other was a valid one. A single commercial investigator isn’t likely, particularly when the advocate of that approach can’t fit the conferences into his schedule. We all have choices to make. This summer, I put aside most of the time I intended to spend on Shroud because I had an eight year defamation case to try. My obligation to my client had to come first. (Incidentally, we won). To study the issues raised by the Shroud is a time consuming process. Maybe a book at the end of the trail may pay some compensation but that can be a long shot gamble. Very long. But I believe the mystery of the Shroud is worth the extraordinary time and effort it takes. I am reminded of the parable of the wealthy young man who approached Christ and said that he had been faithful to the commandments all his life. What more should he do to obtain salvation? Christ replied, “If you would be perfect, sell every thing you have, give the money to the poor and come and follow me.” The young man turned away, for he was very wealthy. [Quoted from memory.] I believe that the scientific study of the Shroud has been a revelation and the challenge of the Shroud compels something more than tea kettle experiments. The dialogue on this blog can be pretty contentious but I have to credit Colin Berry bringing something to my attention that I had over looked. That forensic pathologist Zugibe concluded among very many other things that the image showed sign that Christ may have suffered from Marfen’s syndrome. Actually, that was in an earlier work by Zugibe published in 1981 and his last work that I had did not discuss Marfan but cited two books that did in the bibliography. However, I now think it may be worth a deeper analysis. As noted by some, it might explain the fact that Christ’s relative quick expiration on the cross surprised Pilate. [The husband of my wife’s cousin died unexpectedly and it was suspected that he may have suffered from Marfan’s.] There is a comment in Martin Kemp’s “Christ to Coke” book on icons that comes to mind. I have to travel out the Mineola courthouse today, and I am, of course way behind on my manuscript, but I felt this digression is necessary. I wish you well, but a single commercial provider taking possession of the Shroud for tests isn’t going to happen. Right or wrong, that is a fact of life and history..","date":"2013-10-31","mins":"6:16 am","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-49175","author":"john_klotz","post":"Correction – http://johnklotz.blogspot.com.","date":"2013-10-30","mins":"5:24 am","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-49373","author":"john_klotz","post":"Charles, I wish you well. The Shroud is unlike any other relic because if it is authentic it is both an artifact of Christ himself and a possible witness to the Resurrection. Unlike many people of a religious bent, I do not believe there is a distinct line between faith and religion. I take my guidance from Teillhard in that regard who wrote that there is an inevitable conjunction of the two. Science has explained so much of what was once considered the province religion. It has now come to the edge of some intrinsically, cosmic, religious questions. I believe that science attempting to define human consciousness is science defining the soul. I do not think that it a bad thing. By the way, the working title of my work in progress (about 75% complete is: The Coming of the Quantum Christ: the Shroud of Turin and the future of Science and Humanity. It’s a “take” on something Isabel Pizcek said at a Shroud conference: the Shroud reveals the future of science..","date":"2013-10-31","mins":"6:12 pm","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-49265","author":"john_klotz","post":"I only wish that those who forget the past are doomed to repeat it were true. Therefore, those who want to get forget STURP and its accomplishment might repeat them. Unfortunately, forgetting STURP which was successful is not a productive pathway to the future. I do not know what I wrote that would engender a snide remark from you. But dare I say it’s tiring. I know this may seem like nonsense to you, but maybe if you put away the snide and the quick retort you might learn something, even from me. Would you like to take dueling IQ tests? Once when I was a little discouraged and wondered if I had “lost” it, I took the MENSA test. I passed it. I assume you would too. Point is you should open your mind to the experiences of the past that worked. Whatever you may think, as a scientific collaborative studying the Shroud, STURP was a singular accomplishment. John Heller, who did the later blood work was advised as an undergraduate at Yale by Einstein. If you want to know how a student at Yale was advised by Einstein at Princeton? Buy his book on Amazon and read it. In the past two years I have obtained about eighty or so related books because I had a lot to learn. How many books on the Shroud have you read? Are you too proud to learn? Are you just faking it? Anyone in your past equal to Einstein? Show some respect for everybody on this blog, not just me. You want to slam the door on my ideas, go ahead. But you may just be missing a chance for some sage consultation. As Lee said after Pickett’s charge failed: “Oh too bad, too bad.”.","date":"2013-10-30","mins":"5:52 pm","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-49187","author":"john_klotz","post":"Please do not take offense Mr. Freeman. It’s just that one worries about a Trojan Horse. Your introductory comment was very pointed and helpful taking to account its necessary brevity. I am all for pushing it through the gates..","date":"2013-10-30","mins":"7:06 am","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-49266","author":"john_klotz","post":"This message was meant for Colin.","date":"2013-10-30","mins":"5:59 pm","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-48880","author":"john_klotz","post":"Dan, I’m glad you’ve seen the light on this. I have never met Mark Anatonocci but I heard reports about his conduct at Jumper’s Notre Dame seminar that were quite disturbing in that he hectored Jumper who was had in fact retracted his previous acceptance of the C14 results. The reason Jumper now accepted authenticity as reported to me was the work of Ray Rogers. That apparently was anathema to Antonocci. Confession: I am a 50% Rogers fan and have problem with him his work on image formation. But nobody has solved image formation yet although there are many theories. The ability to produce an image using modern techniques doesn’t decide the issue of what happened in that carved rock tomb 1,983 years ago. I may be a newcomer, but that my way or the high way attitude towards individuals seeking he same truth but by a different path in the Shroud community is more than unacceptable, it’s boorish. That being said, I’d be interested in what he has to say. I’d even be interested in the what Colin Berry would have to say. The only caution to the more strident (and I have been that occasion): If you’re going to give it, you have to take it..","date":"2013-10-27","mins":"6:32 am","url":"https://shroudstory.com/2013/10/27/meet-me-in-saint-louie-louie-meet-me-at-the-fair/","cat":"event","title":"Meet me in Saint Louie, Louie. Meet me at the fair."},{"id":"comment-157179","author":"john_klotz","post":"It was a Salesian seminarian named Peter Rinaldi who, while still studying in Italy, wrote an article for a US Catholic publication (the Sign) in 1934 that in many ways brought the Shroud to the United States. Later, as a priest in the United States, it was his connections to his home town of Turin and the status of an uncle as “blessed” that was crucial to the formation of the STURP team and its access. He also advised and used his connections to expedite the production of Silent Witness. Another reprise from my book. It’s coming, it’s coming..","date":"2014-09-27","mins":"6:40 am","url":"https://shroudstory.com/2014/09/27/new-video-ad-for-the-2015-exhibition/","cat":"2015","title":"New Video Ad for The 2015 Exhibition"},{"id":"comment-51062","author":"john_klotz","post":"Typo alert in the first sentence. “the depth of YOUR knowledge.”.","date":"2013-11-13","mins":"6:55 am","url":"https://shroudstory.com/2013/11/12/of-enchiladas-listerine-and-dont-mess-with-texas/","cat":"event","title":"Of Enchiladas, Listerine and Don’t Mess with Texas"},{"id":"comment-51122","author":"john_klotz","post":"Louis, Don’t be too quick to conclude there is no wisdom in Genesis. It would foolish of course to expect that the ancient writers write an essay on quantum mechanics. But as I deal with these questions I am sometimes edified how their allegories some times hit on a truth although not in the explicit way they describe. For example, our universe from cosmic chaos which suddenly produced an ordered event. I find an allegorical “truth” in the words of opening words of Genesis: “GENESIS 1 In the beginning, God created the heavens and the earth. 2 The earth was without form and void, and darkness was over the face of the deep. And the Spirit of God was hovering over the face of the waters. 3 And God said, “Let there be light,” and there was light. 4 And God saw that the light was good. And God separated the light from the darkness. 5 God called the light Day, and the darkness he called Night. And there was evening and there was morning, the first day.” Before the Big Bang there was no organization and the principal forms of existence and the laws of physics evolved in an incredibly brief instant, I have difficulty finding the definition of what existed prior to the Big Bang. I would call it cosmic chaos unless there is already a definition of that which would exclude the state from which a singularity came to be which caused the creation of our universe. The state by definition is timeless but things happened..","date":"2013-11-13","mins":"12:12 pm","url":"https://shroudstory.com/2013/11/12/of-enchiladas-listerine-and-dont-mess-with-texas/","cat":"event","title":"Of Enchiladas, Listerine and Don’t Mess with Texas"},{"id":"comment-51123","author":"john_klotz","post":"As far as the snake and all that, the ancients were grappling with the innate selfishness of humanity that was at war with the instinct to love. I find less in that. However, selfishness was a driving force of evolution and the moment when the human species acquired the consciousness with the power of reflection is the moment in Teilhard’ view that we became human. That power “made us like God” but only a shadow of him. “Let us create man in our own image and likeness.” Of course, the most relevant story in Genesis in my humble opinion is the story of Cain and Abel. From Cain’s snarling question: “Am I my brother’s keeper, evolves the two great commands of love upon which everything else depends. I am involved in another chore now, and I’d best return to it..","date":"2013-11-13","mins":"12:20 pm","url":"https://shroudstory.com/2013/11/12/of-enchiladas-listerine-and-dont-mess-with-texas/","cat":"event","title":"Of Enchiladas, Listerine and Don’t Mess with Texas"},{"id":"comment-51144","author":"john_klotz","post":"Daveb Where did thatjoke come from?.","date":"2013-11-13","mins":"4:34 pm","url":"https://shroudstory.com/2013/11/12/of-enchiladas-listerine-and-dont-mess-with-texas/","cat":"event","title":"Of Enchiladas, Listerine and Don’t Mess with Texas"},{"id":"comment-51189","author":"john_klotz","post":"Louis, Please don’t take my rhetoric personally. I am aggressive in debate and maybe over do the rhetoric sometimes. Then too, when I put a proposition out, I want to see intelligent criticism like yours. This blog is a learning experience so long as you can separate the wheat from the chafe. As far as the book is concerned, I estimate I am about 80% complete. I have received some nice comments from those who I have worked with on it so I am hopeful. I don’t want want to be too boastful, but when anyone with an open mind reads my chapters on really happened with the carbon dating, they will understand just what a fiasco it was. I am about finished with the Shroud part. The quantum part will be shorter and because it will theoretical it will not involve the tangle of personalities and events involved in the Shroud part. By the way, the working title is “The Coming of the Quantum Christ: The Shroud of Turin and the Future of Science and Humanity.” I really believe the Shroud is a Revelation revealed by science..","date":"2013-11-13","mins":"11:32 pm","url":"https://shroudstory.com/2013/11/12/of-enchiladas-listerine-and-dont-mess-with-texas/","cat":"event","title":"Of Enchiladas, Listerine and Don’t Mess with Texas"},{"id":"comment-50984","author":"john_klotz","post":"I just read a comment to a piece in the National Catholic Reporter where the commenter made the passing remark that we didn’t even know if Christ even existed. Dawkins made the same kind of quibble his book “The God Delusion.’ We are losing thousand of Christians by the day. Those who believe that the “gift” of faith is what matters can sniff at them and they, like the Pharisee” in the parable, thank God they are not like others. I believe the Shroud is more than an relic or artifact, it is a revelation for our time that as been waiting two millennia for science to reveal its mysteries. In ancient times, some found faith through he preaching St. Paul. In our times, science may in fact be delivering the gift of faith to a faithless age. It is my opinion, it is not sufficient to sit back and tut tut all the faithless when there is at hand a miracle, but a miracle that is being revealed by science. That’s appropriate, because at the very beginning of human history, there was no dividing line between religion and science. The first scientists were the priests. Witness for example the complex, but brutal civilization of Maya’s which practiced human sacrifice. We may abhor their practices, but the same priests who offered up the sacrifices where the “scientists” who studied the stars and made incredible discoveries and predictions. Some the greatest “scientists” of medieval and Renaissance times were in fact priests and ministers. On my manuscript, I will give Teilhard a go. He was a Jesuit priest who was and anthropologist who foretold a convergence of science and religion. Do I think the Shroud is authentic? Yes. My belief and the Shroud are what we call a positive feed back. The Gospels, much maligned by Dawkins et al demonstrate the authenticity of the Shroud and the Shroud demonstrates the authenticity of the Gospels. The mystery of faith in Catholic Church until the recent, scatter brained change of it was : Christ has died, Christ has risen; Christ will come again. The Shroud authenticates the first two items, and be in at least a metaphorical or allegorical sense, the fullfilment of the final item. Oh Happy day!.","date":"2013-11-12","mins":"4:06 pm","url":"https://shroudstory.com/2013/11/12/of-enchiladas-listerine-and-dont-mess-with-texas/","cat":"event","title":"Of Enchiladas, Listerine and Don’t Mess with Texas"},{"id":"comment-51061","author":"john_klotz","post":"Dave, The depth of our knowledge is truly amazing. Thanks for the education but the issue would be when in a particular culture science, religion and now I’ll add governance separated from each other. I have always had a small quibble with Alvin Toffler and the his masterpiece The Third Wave. Writing in seventies, Toffler believed that there three era of history that each supplanted the other in succession: agriculture, industrialization and now information. Some of his predictions about the Information era seem a bit far out and still are, but basically, he nailed it. My quibble in this, control of information has always been an element of power, even in ancient agriculture societies. I mentioned in my post the Maya. Certainly in Egypt, there was enormous power in the priesthood class that was exerted over the Pharaohs. What’s the old epigram: Knowledge is Power! Now that I think of it, the actual the core of all Revelation is knowledge. The [P]ower of the Shroud is the knowledge it reveals to us. I know that I am not alone when I say that there was a moment when studying the Shroud, I felt for the first time, I began to understand the suffering that resulted from the passion and crucifixion of Christ. And I believe, that the FACTS revealed by the Shroud point to only one direction: the Resurrection. (For example: the existence of rigor mortis, the lack of evident putrefaction and the image in itself) Applying Occam’s Razor to the Shroud, the Resurrection is the simplest explanation of the Shroud. Really..","date":"2013-11-13","mins":"6:54 am","url":"https://shroudstory.com/2013/11/12/of-enchiladas-listerine-and-dont-mess-with-texas/","cat":"event","title":"Of Enchiladas, Listerine and Don’t Mess with Texas"},{"id":"comment-51064","author":"john_klotz","post":"Typo alert in first sentence: “The depth of YOUR knowledge”.","date":"2013-11-13","mins":"6:56 am","url":"https://shroudstory.com/2013/11/12/of-enchiladas-listerine-and-dont-mess-with-texas/","cat":"event","title":"Of Enchiladas, Listerine and Don’t Mess with Texas"},{"id":"comment-56298","author":"john_klotz","post":"It ought to be obvious that it will be important for the Shroud community to get its “stuff” together. It appears the Turin conference and the St. Louis conference are perfectly timed for that. I just open the processes are open. I know we can trust Joe and his colleagues for that in St. Louis..","date":"2013-12-04","mins":"7:56 am","url":"https://shroudstory.com/2013/12/04/official-an-extraordinary-exposition-of-the-holy-shroud-in-2015/","cat":"event","title":"Official:   An Extraordinary Exposition of the Holy Shroud in 2015"},{"id":"comment-28272","author":"john_klotz","post":"Dan, II have been kind of diverted today, by another interest of mine – JFK. For the past two years we have been celebrating day by day the 150th anniversary of events in the Civil War. This year is of course huge. There is the horrific Union loss at Chancellorsville followed by the turning point victories at Vicksburg and Gettysburg in July, followed by the Gettysburg address at which redefined our Nation, turning us toward the fundamental values of the Declaration of Independence. This is also the fiftieth anniversary of two events of the JFK presidency. The first was the June speech at American University in DC where he first publicly proposed a ban on the atmospheric testing of Atomic weapons. Both he and Khrushchev and looked into the abyss the previous year during he Cuban Missile Crisis and knew the desperate path the World was trodding toward nuclear anihilation. Kennedy’s speech is best remembered by this phrase about the need for Us Soviet cooperation: For in the final analysis, our most basic common link is that we all inhabit this small planet. We all breathe the same air. We all cherish our children’s future. And we are all mortal. Kennedy lost the White House on November 22, 1963. There is substantial evidence that he did plan to pull of Viet Nam after the 1964 election and already had drafted an order to pull back our commitment. All that ended in Dallas, His successor gave the military industrial complex the war it wanted. Lincoln finally won is war in 1865. He visited vanquished Richmond but a week later he too was assassinated. I have come to believe the enduring truth of the Christian faith (or myth, if that suits you) is not the resurrection but its transfiguring of all human experience into the divine. Lincoln and Kennedy both enjoyed great triumphs before their assassins struck. The cheers in Dallas were still ringing in JFK’s ears when all went black. Today is Palm Sunday when Jesus rode into Jerusalem on the back of an ass. Cheers were ringing also n his ears. Then came the crucifixion and three days of black for his disciples. And then cam Easter morning and the witness of Mary Magdalene that some thing had marvelous had happened. Today is Palm Sunday and we can not forget even as we celebrate that Good Friday lies only five days in the future. But then two days more and it is Easter. I close with a quotation from Elaine Pagels, autyher of the Gnostic Gospels: “In its portrait of Christ’s life and his passion, orthodox teaching offered a means of interpreting fundamental elements of human experience. Rejecting the gnostic view that Jesus was a spiritual being, the orthodox insisted that he, like the rest of humanity, was born, lived in a family, became hungry and tired, ate and drank wine, suffered and died. They even went so far as to insist that he rose bodily from the dead. Here again, as we have seen, orthodox tradition implicitly affirms bodily experience as the central fact of human life. What one does physically—one eats and drinks, engages in sexual life or avoids it, saves one’s life or gives it up—all are vital elements in one’s religious development. But those gnostics who regarded the essential part of every person as the “inner spirit” dismissed such physical experience, pleasurable or painful, as a distraction from spiritual reality—indeed, as an illusion. No wonder, then, that far more people identified with the orthodox portrait than with the “bodiless spirit” of gnostic tradition. Not only the martyrs, but all Christians who have suffered for 2,000 years, who have feared and faced death, have found their experience validated in the story of the human Jesus.” We in this generation are blessed with a new revelation: His Shroud which not only registers the fact of His crucifixion, but whispers the hope of His Resurrection (and ours),.","date":"2013-03-24","mins":"12:05 pm","url":"https://shroudstory.com/2013/03/24/palm-sunday-jesus-triumphal-entry-into-jerusalem/","cat":"event","title":"Palm Sunday: Jesus’ Triumphal Entry into Jerusalem"},{"id":"comment-198764","author":"john_klotz","post":"Notice where and how the cleric in upper left hand corner of the photograph is gripping the Shroud..","date":"2015-05-10","mins":"6:17 am","url":"https://shroudstory.com/2015/05/10/picture-for-today-getting-ready-for-the-shroud-exhibition-in-1931/","cat":"exhibition","title":"Picture for Today:  Getting Ready for the Shroud Exhibition in 1931"},{"id":"comment-198765","author":"john_klotz","post":"OOPS right hand as viewed..","date":"2015-05-10","mins":"6:21 am","url":"https://shroudstory.com/2015/05/10/picture-for-today-getting-ready-for-the-shroud-exhibition-in-1931/","cat":"exhibition","title":"Picture for Today:  Getting Ready for the Shroud Exhibition in 1931"},{"id":"comment-33704","author":"john_klotz","post":"Lord save You (and me) from your friends. One of the peersistent aspects of the Shroud controversy since the time of Pia has been over reaching which is totally unnecessary. Speculation that strays from the known facts is fodder for those who reject the Shroud. There is miracle enough in the facts. There is no need to extemporize and go off the page..","date":"2013-05-15","mins":"6:46 am","url":"https://shroudstory.com/2013/05/15/review-of-the-holy-shroud-exhibition-in-seville/","cat":"event","title":"Review of the Holy Shroud Exhibition in Seville"},{"id":"comment-85846","author":"john_klotz","post":"Dan’s comment was right on the money. There is a conference scheduled in October in St. Louis. That might be an ideal place to discuss how to go about new tests. I have my own drum to bang: multi spectral digital analysis of the entire Shroud which could preserve for all time the data on the present composition of the shroud and actually allow it to be shared in study centers around the world. One person Dan didn’t mention in his comment was Father Peter Rinaldi. He was unique combination of Turinese altar boy and American priest. In 1933 as a seminarian in Turin he actually was an interpreter at the informal scientific discussion that emerged. We don’t have that now and a single individual’s petition project will not change things. Bruno Barberis who had some interesting things to say at the Valencia Conference in 2012 is the head of Turin Centro and will be in St. Louis. I may be a bit optimistic or naive but when they say “all roads lead to Rome,” I think as far as the Shroud is concerned, “All roads lead to Rome via St. Louis.”.","date":"2014-03-07","mins":"7:36 am","url":"https://shroudstory.com/2014/03/07/several-mark-antonacci-talks-in-st-louis-starting-next-week/","cat":"event","title":"Several Mark Antonacci  Talks in St. Louis  Starting Next Week"},{"id":"comment-48785","author":"john_klotz","post":"I may be wrong about this, but I think Mark Antonacci is dismissive of the Benford Marino Rogers patch hypothesis. Therefore, one might expect that the presentations at the conference are not going to be in lock step with anyone’s particular agenda. In doing some research this morning I ran across some interesting items that may even be of interest to Colin. One of the items was a Randy Foundation report on its website of Michael Minor’s controversial press release of 2005 01 19 seeming to take credit by AMSTAR for Rogers’ work, What followed was criticism by the skeptical readers of the Randi forum which I would hope even Colin might find at least some absurd – including a plea for information from the redoubtable scientific genius Joe Nickell’s – I kid you not!!!! See for yourself. It begins with a complete copy of the Michael Minor press release on Rogers’ findings. Http://forums.randi.org/archive/index.php/t 33828.html.","date":"2013-10-26","mins":"10:12 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","title":"Some thoughts on the St. Louis conference announcement"},{"id":"comment-48786","author":"john_klotz","post":"In case anyone is interested, here’s the BBC report on Rogers: http://news.bbc.co.uk/2/hi/science/nature/4210369.stm.","date":"2013-10-26","mins":"10:21 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","title":"Some thoughts on the St. Louis conference announcement"},{"id":"comment-48799","author":"john_klotz","post":"I think that Antonacci’s image is very confusing. There’s always a left right mirror non mirror image problem when describing the Shroud. I wonder if the cut out portion at the bottom of the page is in fact the Raes C14 sampling area. That would mean that the image is not a mirror image (or visa versa). One of the problems with the 2002 “restoration” may have been the removal of the area altogether thereby arguably protecting the C14 results from further challenge, although I really believe the C14 is a dead issue for a host of reasons we need not discus in this thread. As far as Antonacci’s theory, while I may differ from Rogers on the ultimate answer to image, realizing that the solution is still beyond the horizon (that’s a pun but I what explain it now) I am not ready to accept some people who insist on the truth of their various theories and express disdain for those who disagree. That’s different from disdain for a specific theory because it doesn’t work but the critic admits not having a lock on the image process himself. That actually Rogers position even as he criticizes others if you read him carefully. He knocks down other theories while admitting his is incomplete. We don’t have the theory that answer to the mystery of image creation yet. However we may have a direction..","date":"2013-10-26","mins":"11:37 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","title":"Some thoughts on the St. Louis conference announcement"},{"id":"comment-48812","author":"john_klotz","post":"In my research, I am now at the Dallas 2005 conference disaster. What is clear to me is that no individual is so knowledgeable as to set either the agenda or the tone of the meeting. A conference to work as to be open to conflicting ideas. I trust Joe is, even though he is one of the authors patch hypothesis which even today is vigorously disputed by some (like Antonacci) even though it is not incompatible with his thesis. If he’s right the patch is irrelevant. As far as following so close on Bari, I suspect that if you fear control by people with an agenda then Bari will be less your cup of tea than St. Louis. Also, I suspect that St. Louis will be more economically feasible for many people. Hey guys and gals, lighten up. Save your energy and your spleen for the conference..","date":"2013-10-26","mins":"1:54 pm","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","title":"Some thoughts on the St. Louis conference announcement"},{"id":"comment-9816","author":"john_klotz","post":"OMG faith is on the march. “God Delusion” was full of rhetorical tricks that passed as reasoned analysis. For example: : “It is even possible to mount a serious, though not widely supported, historical case that Jesus never lived at all, as has been done by, among others, Professor G. A. Wells of the University of London in a number of books, including Did Jesus Exist? “Although Jesus probably” existed, reputable biblical scholars do not in general regard the New Testament (and obviously not the Old Testament) as a reliable record of what actually happened in history, and I shall not consider the Bible further as evidence for any kind of deity.” Notice that there is no logical flow to this at all, only the slick spiel of a used car salesman. His use of “probably” to modify existed means that there is doubt and he then jumps to a complete rejection of the Bible as any kind of deity. Why the tortured logic and why the increasing cowardice to confrontation? I have a simple suggestion: the Shroud of Turin. At the very least Shroud science removes doubt about the existence of Jesus Christ. The science of the the Shroud is finally recovering from the flawed carbon dating analysis. Atheists like Dawkins are now in a bind. Given the fact that there are resources now to debunk the carbon dating available universally on the Internet, it’s impossible for them to assume a dismissive air. The issue of the Shroud’s authenticity is now again on the table. Some have called the Shroud the Fifth Gospel. It’s that and more. It is a Revelation. It is the resurrection of the Resurrection. Courtesy of Science, it is a second coming in the information age. Happy Easter..","date":"2012-03-31","mins":"7:55 am","url":"https://shroudstory.com/2012/03/31/speaking-of-issuing-challenges-to-dawkins/","cat":"event","title":"Speaking of issuing challenges to Dawkins"},{"id":"comment-9839","author":"john_klotz","post":"Susana, I think you and I would have a profound agreement on the two issues that concern this blog: (1) the Shroud is the authentic burial cloth of Jesus Christ and (2) It offers some proof of his Resurrection. As to the rest, many theologians, both Catholic and Protestant have views on scripture that may differ from you and me. St. John wrote that God is love and that is good enough for me. The generation before Christ, Rabbi Hillel was challenged by a gentile that he were convert to Judaism if Hillel could teach him all he needed to know about the Torah in the time Hillel could stand on one leg. Hillel replied: “Do not do unto others that which is distasteful to yourself. All the rest is commentary.” That was a very controversial statement by Hillel. His rivals claimed that there were 613 commandments of God, each one of which had to be obeyed to the letter, all were equally important. Christ was challenged by one of those who sought to trap Him by asking him “Which was the greatest commandment?” He replied (in words from the Torah) “to love God with your whole heart, mind and soul.” and then continued: “And the second is like unto this: To love your neighbor as yourself. Upon these two is are based all the law and the prophets.” In the parable of the Last Judgment (parable is Pope Benedict’s word) Christ tells us that the only measure is what we do for the least of God’s brethern.” It’s the one commandment of love. That’s a pretty big agenda right there. I believe that Science is not only proving the authenticity of the Shroud, but through quantum mechanics we are seeing the reality of love. I am sure that to some that may appear to be out there. But to me it’s in here. We are on the verge of a new Revelation through Science. For those who have no interest of such, God Bless..","date":"2012-04-01","mins":"5:17 pm","url":"https://shroudstory.com/2012/03/31/speaking-of-issuing-challenges-to-dawkins/","cat":"event","title":"Speaking of issuing challenges to Dawkins"},{"id":"comment-9835","author":"john_klotz","post":"I think Dawkins has anointed himself as the “Atheist Pope.” The jacket for God Delusion modestly described Dawkins as “the world’s most prominent atheist.” “The world numbers about eight billion individuals and climbing. What a terrible burden it is for Dawkins to be the foremost atheist among the eight billion. That being said, when it comes to the slaughter of innocents in Canaan, I tend to agree with Dawkins that this was inexcusable barbarity. I remember watching a History Channel program on ancient generals two or three years ago which recorded Joshua’s slaughter of women and children in Jericho after “the walls came tumbling down.” I was appalled. When I discovered that Joshua was acting on a divine command, I decided that I could not worship such a God. I was deeply saddened when a Jewish friend of mine gave the human reasoning behind that. Leaving the women and children alive would have resulted in the leaving the seeds of idolatry to blossom and grow. That came to mind a year or so later, when on another History (or Military Channel rebroadcast) I heard a Himmler speech to the German Generals as the WWII ground to its close and the Third Reich was collapsing. “We had to kill the children,” he said, “because they would grow up to seek revenge upom us killing their parents.” Much of Bible is rationalization for human endeavors. Of course, that argues against it not being history. Some of its history is sad. But I highly recommend the direction of religions which is the basis of Richard Wright’s “The Evolution of God.” Jesus challenged the Pharisees” “What do you think of the Messiah [Christ}, whose son is he?” Wright is somewhat dismissive of the universality of Jesus message adopting the “Paul did it view.” But I think the last paragraph of his book sums up not only the direction of religious thought, but of Christianity itself: “Though we can no more conceive of God than we can conceive of an electron, believers can ascribe properties to God, somewhat as physicists ascribe properties to electrons. One of the more plausible such properties is love. And maybe, in this light, the argument for God is strengthened by love’s organic association with truth—by the fact, indeed, that at times these two properties almost blend into one. You might say that love and truth are the two primary manifestations of divinity in which we can partake, and that by partaking in them we become truer manifestations of the divine. Then again, you might not say that. The point is just you wouldn’t have to be crazy to say it.” * Amen, Mr. Wright, amen. *(Wright, Robert (2009 05 20). The Evolution of God. Little, Brown and Company).","date":"2012-04-01","mins":"7:43 am","url":"https://shroudstory.com/2012/03/31/speaking-of-issuing-challenges-to-dawkins/","cat":"event","title":"Speaking of issuing challenges to Dawkins"},{"id":"comment-31059","author":"john_klotz","post":"In the past two years, I have been fortunate to have had the friendship, and tutelage, of Barrie Schwortz. His is one of the most remarkable stories of our time and the world has been blessed not only with his talents but his heart. Were it not for Barrie, and Shroud.com, Sue Benford and Joe marino would not have gotten the hearing their work deserved. But it was his friendship with Ray Rogers who initially challenged Benford Marino that was a pivotal moment of the 2000 year old history of the Shroud. Rogers tests of their theory transformed him from skeptic to advocate. Were it not for Barrie Schwortz it is doubtful we would be where we are today where all but militant atheists realize the carbon dating of the Shroud was not the answer but a question..","date":"2013-04-17","mins":"7:53 am","url":"https://shroudstory.com/2013/04/17/ted-comes-to-the-vatican-with-gloria-estefan-and-barrie-schwortz/","cat":"event","title":"TED Comes to the Vatican with Gloria Estefan and Barrie Schwortz"},{"id":"comment-23147","author":"john_klotz","post":"Joe Marino’s book “Wrapped in the Shroud” referenced by Jumper is not about the maillard reaction. It was Sue Benhem and he unraveling the C 14 tests because the repair of the corner from which the C 14 samples were taken..","date":"2013-02-01","mins":"7:20 am","url":"https://shroudstory.com/2013/01/31/the-eric-jumper-lecture-at-notre-dame-how-did-it-go-anyone/","cat":"event","title":"The Eric Jumper Lecture at Notre Dame:  How did it go? Anyone?"},{"id":"comment-23101","author":"john_klotz","post":"It’s too bad he can’t stick around a bit. When reading the into on what happened with STURP, he displayed a talent for making correct, decisive decisions under many trying circumstances. We might ave much to learn from him, but I think of us could say “thank you for what you did.” JCK.","date":"2013-01-31","mins":"3:18 pm","url":"https://shroudstory.com/2013/01/31/the-eric-jumper-lecture-at-notre-dame-how-did-it-go-anyone/","cat":"event","title":"The Eric Jumper Lecture at Notre Dame:  How did it go? Anyone?"},{"id":"comment-23150","author":"john_klotz","post":"Correction “Sue Benford” My apologies to Joe..","date":"2013-02-01","mins":"8:45 am","url":"https://shroudstory.com/2013/01/31/the-eric-jumper-lecture-at-notre-dame-how-did-it-go-anyone/","cat":"event","title":"The Eric Jumper Lecture at Notre Dame:  How did it go? Anyone?"},{"id":"comment-52537","author":"john_klotz","post":"There are none so blind as those who will not see. The Shroud is a Revelation. Note the caps..","date":"2013-11-23","mins":"3:44 pm","url":"https://shroudstory.com/2013/11/23/the-evidence-of-things-not-seen/","cat":"event","title":"The evidence of things not seen"},{"id":"comment-164299","author":"john_klotz","post":"One thing the St. Louis Conference demonstrated is that Russ is an accomplished, entertaining and very serious lecturer of the Shroud..","date":"2014-10-21","mins":"6:11 am","url":"https://shroudstory.com/2014/10/21/what-next-stadiums/","cat":"presentation","title":"What Next?  Stadiums?"},{"id":"comment-47547","author":"john_klotz","post":"Colin, You seem to have been stricken with an surfeit of reasonableness. Please don’t take the cure. Of course, Shroud.com offers an historical archive on Shroud materials and Barrie’s frequent up dates are phenomenal, but an electronic conference with all the presentations on line. That really makes me tingle. My problem is that the third week in September is an annual “retreat” for a group of married couples sans children (and grandchildren) at a beach house in Delaware. We’re old enough that the numbers are beginning to dwindle. My wife and I go back 43 years with one couple. Maybe, someone might suggest to the IEEE a simulcast on the web. Skype anyone??.","date":"2013-10-15","mins":"7:55 am","url":"https://shroudstory.com/2013/10/14/update-on-the-ieee-workshop-september-in-italy/","cat":"event","title":"Update on the IEEE Workshop: September in Italy"}]
