[{"id":"comment-73299","author":"john_klotz","post":"I really appreciate the effort that has gone into this and other posts but I wonder if this issue of the Shroud’s early provenance will ever be resolved definitively. The question is: how much should this bother us? While it would be a lot easier if we had warehouse receipts and shipping labels, we are never going to have in my opinion, a definitive provenance of the Shroud from the tomb to Constantinople and I doubt we will ever have a definitive provenance from Constantinople to Lirey. It does make for great debates though. Personally, I have a tendency to doubt the details of the Templar theory. The Templar’s have become the “usual suspects” of medieval history. While we may never know the complete provenance of the Shroud., we have learned a great deal. Most importantly in my view, we have two related physical facts: the blood stains and the image. Science has come a long way in unlocking these mysteries. It is definitely blood, but the nature of the mechanism that transferred the image from the body of tortured, crucified man to the Shroud remains a mystery. Science has gone along ways toward resolving the issue of the blood and identifying what the image is not: it was not created by any process we have been able to discern. Just as science has given us a definite answer to the blood issue (and it has), science may one day give us a definite solution to the image issue. I suspect that when it does, the answer will be the Resurrection. And unlike some, I like Teilhard, see science as an ally not an enemy of religion. I also believe that somewhere in the chaotic world of quantum mechanics will lie solutions to the many religious mysteries and the answers will not be bad for religion. I am reminded of Rabbi Hillel’s formulation of the Golden Rule and then adding: “Everything else is commentary.” As far as the provenance issue is concerned, solving the problem of image formation is paramount. Giving the impossibility of resolving the issues of where the Shroud was when it twice disappeared for literally hundreds of years is commentary. I have enormous respect for Ian Wilson and what he has done in his work on the Shroud. I don’t know if this is common knowledge, but it isn’t a secret. David Rolfe’s 1978 landmark “Silent Witness” began with a proposal by Ian Wilson circa 1974. Outside of that, I personally believe that Ian’s most important contribution, may be in bringing the Vignon markings to a greater audience. I also believe, as illusive as they may seem, the Vignon markings in art outside of the Shroud itself, are the most compelling evidence of the pre Constantinople provenance of the Shroud with the emergence of the markings as an artistic convention. I find this debate interesting, but I honestly believe that the pre Constantinople provenance of the Shroud has disappeared into the mists of time. But just like the bones of a dinosaur discovered today, the physical existence of the Shroud testify to its previous existence..","date":"2014-01-14","mins":"8:19 am","url":"https://shroudstory.com/2014/01/14/arculfus-shroud-a-guest-posting-by-o-k/","cat":"history","title":"Arculfus’ Shroud:  A Guest Posting by O.K."},{"id":"comment-73310","author":"john_klotz","post":"Thanks for the compliment and I agree in part. Yes, we should have another carbon dating but under a real protocol and only in conjunction with tests that the sample area(s) are not anomalous. Also, since 1978, scientific analysis has made great strides. A new examination now might be to STURP as STURP was to Secondo Pia. (Slight exaggeration, but only slight)..","date":"2014-01-14","mins":"10:21 am","url":"https://shroudstory.com/2014/01/14/arculfus-shroud-a-guest-posting-by-o-k/","cat":"history","title":"Arculfus’ Shroud:  A Guest Posting by O.K."},{"id":"comment-17285","author":"john_klotz","post":"I find the use of the word “heretic” to be an anachronism. Galileo, for example was a heretic and escaped the stake by retracting his truth. Can we have an intelligent discussion without some true believer claiming that others are heretics. And by whose definition: Pius Xii, John xxiii, Benedict XVI or Jerry Falwell? Please, let’s determine the facts to to best of our ability and the implications of those facts. Frankly, for anybody to attempt to win an argument by declaring some else a heretic is, well, asinine. Quit the braying fool! (Do I sound angry?)..","date":"2012-10-07","mins":"10:34 am","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-69224","author":"john_klotz","post":"One of the problems with this blog, and possibly its strength, is that all opinions are treated equally and contrary authorities easily trashed equally. Thus Gary Wills and John Meir are both cited and then renounced. Maybe Garry Wills is too much a popularizer of religion for some tastes. But no one can deny that John Meier is a very serious scholar. He started out two write a three volume history of Christ and now he’s working on volume five with no end in sight. I have found N.T. Wright helpful but he writes hundreds of pages to every dozen for Wills. We are in a very blessed generation. For nearly two millenia the Shroud has been among us but its lessons were undecipherable until unlocked by Secondo Pia’s camera and the thousands of hours of scientific study that have ensued. I believe that the demonstrated facts square with the Gospel accounts and create a positive feedback. Excuse the following sentence in all caps. THERE IS NO OTHER HISTORICAL EVIDENCE OF CRUCIFIXION OF ANYBODY THAT MATCHES WITH FACTS OF THE SHROUD OTHER THAN JESUS CHRIST. Please, no speculation. We have a name and we have time established, by the way, by a pagan Roman historian – Tacitus. The Shroud is a Revelation, that the proposition is not entirely devoid of reason that perchance it is THE Revelation. Christ is being brought to us by the scientists in their white lab coats. As anybody noticed that the four horseman are loose again. The again, they seemed to have been loosed on most generations. Humanity suffers and Christ returns..","date":"2013-12-27","mins":"6:21 pm","url":"https://shroudstory.com/2013/12/25/did-jesus-talk-funny-and-when-was-he-born/","cat":"history","title":"Did Jesus Talk Funny and When Was He Born?"},{"id":"comment-68281","author":"john_klotz","post":"Daveb, Did you ever see Band of Brothers, a several part HBO television series. It followed a company of US paratroopers from the US to England to combat in Europe to peace. When the paratroopers were getting ready to board their aircraft for their Normandy jump, there was an interchange between a US Trooper and an Aussie over a German Luger the Aussie had and the GI thought the Aussie was giving it to him as the gift. The language and the minds didn’t meet. Having been raised singing Waltzing Matilda and totally bummed out by On the Beach, I was surprised by the “pure” Aussie dialect employed by the writers of Band of Brothers for that sequence. It really was unintelligible to these stateside ears. Side note on the the JFK thing. When Oswald was in Russia everybody in the interior took him for a native Russian but with a Leningrad accent. Pretty good trick for a HS dropout who self taught himself Russian listening to phonograph records. Somehow I kind of doubt it. I have nephew who was military attache to the American Embassy in Moscow for a part of his career. He was a Rhodes Scholar with an Oxonian degree. He ended up speaking Russian quite well but he didn’t do it by listening to phonograph records in a barracks. He had months of personal instruction. Russian, I am told is difficult for English speakers because it doesn’t have the common German, Latin admixture that English has.That Oswald, must have been a genius..","date":"2013-12-26","mins":"10:00 am","url":"https://shroudstory.com/2013/12/25/did-jesus-talk-funny-and-when-was-he-born/","cat":"history","title":"Did Jesus Talk Funny and When Was He Born?"},{"id":"comment-69237","author":"john_klotz","post":"Louis, I hadn’t noticed his statement about the Resurrection. I think he wrote that about Virgin birth not being within the scope of his work. Obviously he is concerned about the theological impact of his work and that limits his scope. However, if he is to draw the curtain on the essential mysteries of Christ, why bother? He certainly demurred from the High School explanation I received that “brothers and sisters” didn’t mean “brothers and sisters” but cousins. I think it’s quite clear: You should know the truth and the truth shall make you free. To the extent he averts his gaze, he surrenders the field to “naturalists” like Crossan who I demur from..","date":"2013-12-27","mins":"6:53 pm","url":"https://shroudstory.com/2013/12/25/did-jesus-talk-funny-and-when-was-he-born/","cat":"history","title":"Did Jesus Talk Funny and When Was He Born?"},{"id":"comment-69427","author":"john_klotz","post":"I want to make it clear that I have found Meier’s work extremely interesting and helpful. The only thing about him that bothers me is his drawing a curtain on certain items like Virgin Birth and the Resurrection. I’m not sure the Virgin Birth is nearly as important as the Resurrection. There are no conception stories in Mark and John. I anxiously await he completion of is task which in the beginning contemplated two volumes. I expect the next, Volume Five will be the last. Meier made a statement that one of the difficulties in writing about Jesus is that he left no artifacts. Excuse me, this is the precise issue we are dealing with. The Shroud is an artifact, certainly of his death. The issue is whether it is an artifact of what he refuses to deal with for is purposes of avoiding “pure” faith issues such as :the Resurrection. That is the final challenge of the Shroud to scientists … and theologians..","date":"2013-12-28","mins":"6:51 am","url":"https://shroudstory.com/2013/12/25/did-jesus-talk-funny-and-when-was-he-born/","cat":"history","title":"Did Jesus Talk Funny and When Was He Born?"},{"id":"comment-68583","author":"john_klotz","post":"Daveb, Did you ever read Garry Wills: What the Gospels Meant? It distinguishes among the four Gospels in approximately the way you do. (he also wrote “What Jesus meant” and “What Paul Meant.”.","date":"2013-12-26","mins":"6:56 pm","url":"https://shroudstory.com/2013/12/25/did-jesus-talk-funny-and-when-was-he-born/","cat":"history","title":"Did Jesus Talk Funny and When Was He Born?"},{"id":"comment-65548","author":"john_klotz","post":"I was in the middle of a lengthy comment on this when my computer decided to take me to another screen. My draft was lost. So a short one. There is no simple answer to these questions which have been asked and debated before. Go look it up. I might suggest going to shroud .com as a starter. Https:\\\\shroud.com It has a great search function on its home page. There is simply no simple answer to your questions although I expect you will get “trust me I know it all” from some of the bloggers..","date":"2013-12-23","mins":"8:16 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","title":"Did the Apostles Notice an Image on the Cloth?"},{"id":"comment-66477","author":"john_klotz","post":"Dave, There comes a time when all good (and bad) scientists and philosophers seemed compelled to cite Okkam’s (Occam’s) razor: The simplest solution is probably the correct one. I have a radical application to the mystery of the image that is in keeping with all the evidence except pseudo skeptics dominated by a world view that excludes my simplest explanation will probably start chewing the rug: My solution depends on a mysterious processes. No, not the Resurrection, but quantum mechanics. The simplest solution is the Resurrection..","date":"2013-12-24","mins":"7:52 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","title":"Did the Apostles Notice an Image on the Cloth?"},{"id":"comment-66529","author":"john_klotz","post":"Hugh, Try it with the Grey Coupon, although frankly, stateside, I prefer Gulden’s Yellow..","date":"2013-12-24","mins":"9:06 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","title":"Did the Apostles Notice an Image on the Cloth?"},{"id":"comment-67350","author":"john_klotz","post":"Dave, You are among the most, if not the most, articulate and knowledgeable contributors to this blog. Reading your posts is not just an education, it’s edifying. Merry Christmas..","date":"2013-12-25","mins":"8:23 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","title":"Did the Apostles Notice an Image on the Cloth?"},{"id":"comment-67345","author":"john_klotz","post":"When I shared with another writer whose work on the shroud is legendary, he replied that when I began my E Mail with “Dear XXX, I am a lawyer,” his first thought was, “Oh no, not another lawyer.” Then after he read the enclosure, he changed his attitude and has since said some very nice things. That was two years and a lot of research ago. The six month time frame I gave my self is now going to be two years + but maybe Ash Wednesday and certainly by Holy Week 2014. I introduce this comment with that story, because horrors of horrors, I am now going to say something as a lawyer. The most complex thing of all is fraud. “Oh what tangled webs we weave, when first we practice to deceive.” By the way, I just this instant learned something. I would have though that line was from Bobby Burns, but it was from Sir Walter Scott. (he was Scottish too) During my career, I instigated or was principal instigator of several investigations for fraud. Two of them standout, one was an international financier who stole more than a billion dollars during the course of his career. I once said to his lawyer, that my client would settle its claims for two million dollars. He said “It’s hard to talk two million dollars with you when you are the one who put my client out business.” He hesitated and then continued on with obvious anger , “There is no question about it: Miami, Atlantic City, you are the one who put him out of business.” My response was unspoken: “From you lips to God’s ear.” I say that not to simply blow my horn but to indicate when I say that fraud, and the proof thereof, is a complex thing, I write from some experience. Incidentally, a former FBI agent who has been in the international news this week once told me over breakfast in Miami. “It’s pleasure to help you. I know who you are what you have meant to the Bronx. In his memoir of the Shroud, John Heller who was advised by Einstein when he was an undergraduate at Yale introduced me to the “gededenkenexperiment.” (thought experiment). That means to think through a proposition taking into all the knowns and applying science to them. The great ting about the gededenkenexperiment, Einstein told his young student, “it doesn’t require much of a budget.” Heller and Adler conducted a gededenkenexperiment on forging the Shroud, they ended up painting with a 12 foot or so paint brush looking through a telescope as they painted with a brush whose hair was a hundredth or so finer than any ever manufactured. When you say the Resurrection is the most complex of all explanations you are betraying not a scientific fact but an existing bias. Marcello Truzzi who was one of the founders of Center for Skeptical Inquiry quit after a couple of years because he discovered that most of his colleagues were not interested in the dispassionate search for truth but only to validate pre existing assumptions such as there is no God and no miracles. My point is simple. If you eliminate the possibility of the Resurrection, you are going to come up with proposed solutions which are all false and really, more complex than the Resurrection. The Shroud is the artifact of the transformation of Christ’s body into another form. We have yet to ken the process. My belief is that it is a whole lot simpler than forgery or inventing photography four centuries ahead of time or using a crucifix to produce a bas relief. This comment is a little longer than it probably should be. I really appreciate the chance of using the blog as a sounding board before a critical audience. But his morning I arose to wrap the last few presents. We celebrate the birth of Christ whose birth transfigured human nature. But as we contemplate that transformation we must recall, the horrible death that awaited him 33 years in the future. Isabel Pizcek has called the Shroud an “event horizon.” I happen to agree, as I shall explain. Hopefully before Easter. My favorite Christmas carol has a line that I think sums up the joy of the day to me and I think everyone whether they realize or not: “Long lay the world, in sin and error pining, till he appeared and the soul felt its worth.” Merry Christmas.","date":"2013-12-25","mins":"8:15 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","title":"Did the Apostles Notice an Image on the Cloth?"},{"id":"comment-101275","author":"john_klotz","post":"There are four accounts that generally concur in describing the crucifixion of Jesus. And they are written. They were not written contemporaneously but were based upon oral traditions that were contemporaneous. Paul wrote his epistles circa 50 CE which was only three decades after the crucifixion. And the there is Roman historian Tacitus who wrote later than St. Paul but described the persecutions of Christians by Nero and the reasons for it. Essentially he despised Christians and Christianity as any self respecting Roman noble would: From Chapter Two of my manuscript: “Writing nearly 80 years after the death of Jesus Christ, he [Tacitus] leaves little doubt, that from the pagan Roman perspective, there was in fact a Christ, he was in fact executed, and the cult that surrounded him did not end with his death but survived and flourished. “The occasion for Tacitus’ reference to Christ and Christians was the aftermath of a fire during the regime of Nero that destroyed much of Rome. To counteract rumors that Nero, himself, was responsible for the fire, he blamed the burgeoning Christian sect in Rome and commenced a pervasive, sadistic persecution of the Christians: “’Consequently, to get rid of the report, Nero fastened the guilt and inflicted the most exquisite tortures on a class hated for their abominations, called Christians by the populace. Christus, from whom the name had its origin, suffered the extreme penalty during the reign of Tiberius at the hands of one of our procurators, Pontius Pilatus, and a most mischievous superstition, thus checked for the moment, again broke out not only in Judaea, the first source of the evil, but even in Rome, where all things hideous and shameful from every part of the world find their centre and become popular.’ “John Meier finds that the Tacitus report in Annals is authentic and not a Christian forgery.” Ostrich like agnostics and atheists can stick their head in the sand is they prefer. But as to the physical reality of Christ and his death, one simple message: deal with it..","date":"2014-04-19","mins":"11:12 am","url":"https://shroudstory.com/2014/04/19/happy-easter-from-discovery/","cat":"history","title":"Happy Easter from Discovery"},{"id":"comment-101282","author":"john_klotz","post":"Typo alert : “sand is they prefer” should be “sand if they prefer.”.","date":"2014-04-19","mins":"11:21 am","url":"https://shroudstory.com/2014/04/19/happy-easter-from-discovery/","cat":"history","title":"Happy Easter from Discovery"},{"id":"comment-101403","author":"john_klotz","post":"Well stated as usual Dave..","date":"2014-04-19","mins":"4:59 pm","url":"https://shroudstory.com/2014/04/19/happy-easter-from-discovery/","cat":"history","title":"Happy Easter from Discovery"},{"id":"comment-77234","author":"john_klotz","post":"Annette, His arms did not become “conveniently relaxed.” The rigor mortis was forcibly broken when he was taken down from the cross so that he cold be buried. The was no “convenience” about it. As a matter of fact, displacement in his shoulders may have indicated the deliberate forcing of the arms into the position seen on the Shroud. There is an enormous amount of literature on the subject and one book that’ available on Kindle is the last one by forensic pathologist, the lat Fred Zugibe. The interesting ting is that Zugibe differs from Bucklin and other pathologists on the way the mechanism of crucifixion cause death. However, here seems to be a consensus that the image shows a state of rigor mortis and that as Zugibe explains, the movement of the arms to the position demonstrates the “breaking of the rigor mortis. As to Baden, he is the forensic pathologists of choice for elites dealing with uncomfortable questions. For example, he testified in favor of the “lone gunman theory” of the JFK assassination. There is significant evidence testified to by other pathologists that the wounds to JFK’s head were not caused by a single billet from the back of JFK. Among those who held that opinion was(is) Cyril Wecht. The issue with Baden is how much time did Baden actually spend on examining the Shroud and where did he publish? I would like to know. Is he a member of Scientific Investigation of Claims of the Paranormal (CSICOP) which has been dedicated to disproving claims of paranormal events. Among their targets has been the Shroud of Turin and they have written much nonsense about the Shroud and they believe in the discredited carbon dating as much as some believe that Christ didn’t die on the Shroud but traveled to India after the Crucifixion. Kind of a “Cook’s Tour” I guess. In any event, some excerpts from Zugibe’s final book. “If a person is in complete rigor mortis, the only way to change the position of a limb at a joint is to break the rigor, a term referring to the forcible bending of a limb at any joint. For example, if an elbow is in rigor mortis and bent to an angle of 45 degrees, straightening the arm is possible by forcibly straightening it. The greater the muscular development, the greater the force required to break the rigor.” * * * “This fact has medico legal significance to determine if a body has been moved after rigor mortis set in. For example, if a body was found lying flat with the legs suspended in the air, it would be immediately obvious that the body was moved from a position where the legs were resting on something.” Frederick T. Zugibe. The Crucifixion of Jesus, Completely Revised and Expanded: A Forensic Inquiry (Kindle Locations 2311 2313). Kindle Edition..","date":"2014-02-07","mins":"8:26 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78276","author":"john_klotz","post":"This thread has gotten quite long and maybe this has been covered before, but it seems to me that David Mo and perhaps others are not factoring in one obvious fact, and I do mean fact whatever your theory of image creation: The blood stains and the image were created at different times. First came the blood stains and then as much as 48 hours latter, likely no more than, 40 hours, the image came into existence by a yet unknown process. Trying to create a unified picture of blood and the image can only go so far. Yes there are blood stains in positions consistent with the image. That doesn’t mean they were created simultaneously.. If the image was created an instant when the body and the Shroud “parted company” then it is clear the blood stains were, to borrow a phrase from our fundamentalist brothers and sisters, “Left behind.” Because of writing I have been dealing with multispectral digital imaging (MSDI) for a couple of weeks. Of weeks. I think it may very well be that with MSDI we can strip away layers of accretions from the Shroud and get a definitive picture of the Shroud even before there were any markings on it.; the markings at the time Christ was first wrapped in the Shroud and the markings when the image was created. OMG.","date":"2014-02-11","mins":"5:51 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77343","author":"john_klotz","post":"David, I apologize if I was a little short in my response to last posting. I have been working on this controversy over the shroud for more than two years. I know there are a lot of people who’ve spent much more time on this and I have. What I don’t have time are issues that are clearly leading up blind alleys and may in fact be planted as deliberate distractions. I believe that Jacques De Molay and Leonardo da Vinci when it comes to the shroud are distractions. It is time for them when it comes to the shroud to be assigned to the dustbin of history. I also have a feeling that the propagators of these theories may be distracting us on purpose. De Molay and Leonardo and become “usual suspects of mystery.” That’s a paraphrase of one of the widely quoted lines from the movie Casablanca. Inspector Renault (Claud Rains) having just witnessed Rick (Humphrey Bogart) shoot SS Major Strasser, says to a car full of his policemen that pulls up: “Major Strasser has been shot, round up the usual suspects.” It today’s parlance, one might say that line has become viral. For someone to gain attention, it’s always great to say the Templars, or Jacques de Molay and Leondardo did it. It’s always good for some attention and some book sales. But it is a distraction. Leonardo did not photograph the Shroud and De Molay who was roasted on a spit and then burned at the stake is not the man in the Shroud. My concern is that the proponents of these theories have their own agenda besides just making a few bucks or pound sterling. They want to distract us from the fundamental truth that Jesus Christ existed and that he suffered a horrible death. His crime was to preach love and, to many, his Resurrection gives courage to persevere in love no matter what the cost. Now I have to get back to the real story..","date":"2014-02-07","mins":"6:22 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77702","author":"john_klotz","post":"Hugh, You are a classic pseudo skeptic. You have a pre existing determination rejecting authenticity and you then refuse to accept any contrary opinion on an important issue such as rigor mortis. Dan began this thread with a citation of several individuals who are well qualified and some of whom have spent decades dealing with the medical evidence that exists on the Shroud of a horribly beaten, tortured man who died by crucifixion. Neither you nor I possess their medical qualifications. We do possess a library card or access to the web. The does not make us expert in this SPECIFIC case. I believe based upon your posts that there is no evidence you will accept supporting authenticity of the Shroud. One thing your pseudo skepticism has done is produce some interesting and relevant posts from individuals with experience in the medical field. That’s a plus. The only support you have is a statement from Michael Baden who was fired as NYC Medical examiner by Ed Koch. I did 10 seconds of research on this for this post because I came across an entry, which for people on this side of the Pond says it all: “He is also the Forensic Science Contributor for Fox News Channel.” There have been surveys that have found Fox News viewers to be the most ill informed class of Americans. Others have pointed out the inconclusive nature of his opinion. Against the weight of authority cited by Dan Porter and the very informative posts in this thread from individuals trained in medicine and one with hands on EMT experienced dealing with trauma victims, you can only cite “I read a book” and the books you cite have nothing to do with the crucifixion of the Man in the Shroud as far as I can tell. There are exciting things happening in the world of the Shroud in the next two years and we may be able to influence them. Take the concept of multispectral digital imaging for example. Now there is something worthy of discussion..","date":"2014-02-09","mins":"5:42 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78020","author":"john_klotz","post":"Annette, I have this vague feeling that you are native French speaker. Could you let me know what your E Mail address is. I may have something on the Shroud where I could use some advice on French. I can not share it with he blog for another few months or so..","date":"2014-02-10","mins":"7:57 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77762","author":"john_klotz","post":"Mike M. Thanks for the comment. One of the weakness of he blogosphere is that someone can make a comment that can be refuted with relative ease – if you take the time. Baden is a rich, controversial dish. To do a thorough debunking of him would take time. Then the issue is whether it’s worth the time? By chipping in with a bit of truth here and I bit of truth there, we can often get it done. I am impressed by the fact that with this particular issue, there have been so many insightful contributions. Maybe not just impressed but humbled, too..","date":"2014-02-09","mins":"10:30 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77745","author":"john_klotz","post":"Hugh, Personal insults aside, I do find that you have a very narrow perspective. Charles Freeman is one person with a definition. His limited definition is how the term first came into parlance. However, on this side of the Atlantic we have a great deal of back and forth about the nature of skepticism and one the prime philosophers of skepticism is Marcelo Truzzi. You can read an essay of his on skepticism at http://www.anomalist.com/commentaries/pseudo.html Truzzi is deceased so i assume everybody so minded can pile on him in safety. However, there is one statement that appears to have originated with him that is communally attributed to Carl Sagan who uttered it on TV some years after Trunzi first wrote it: “Exceptional claims demand exceptional evidence.” Someone told me that the statement sprang f=rom the work of the English philosopher Hume although I have not investigated it further than the Truzzi quote. I think when it comes to the Shroud the issue is, given the evidence, what is the exceptional claim? Authenticity or in authenticity. Once you understand the facts that defeat the carbon dating, you might very well argue, that based on all the facts, the exceptional claim is in authenticity. By the way, I have found some Charles Freeman posts to be enlightening even when I disagree with him. But when it comes to his rather limited definition of pseudo skeptic, at least on his side of the Atlantic he is wrong..","date":"2014-02-09","mins":"9:09 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77757","author":"john_klotz","post":"Hugh, I believe that the claim that Shroud is of medieval original is not only exceptional but false. Can I prove the Resurrection at this point? Probably not although there some who have a reasoned proof. The point of Truzzi is that if I can’t “prove” the Shroud is authentic, that does not mean the Shroud has been proven to be inauthentic. It means that the claim of authenticity is unproved. There’s an important distinction there. Outside of the disputed, and in my belief flawed,carbon dating, what proof do you have that the Shroud is inauthentic?..","date":"2014-02-09","mins":"10:04 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77888","author":"john_klotz","post":"Mike M, What a terrific post. To borrow a phrase from Annette, You’ve earned a “standing O.”.","date":"2014-02-09","mins":"7:17 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77244","author":"john_klotz","post":"Louis, Many thanks for the link debunking Jesus in India nonsense. I find it very valuable..","date":"2014-02-07","mins":"9:51 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78023","author":"john_klotz","post":"Hugh, Have you conducted a search for naked portraits of Christ? That would seem to be a relevant inquiry for a skeptic. It this case of the Shroud we see his naked buttocks and his hands cover the front genitalia. No modest loin cloth. As a matter of fact, David Rolfe when he was preparing the final cut for release of Silent Witness lost the support of his major backer when he refused to pull illustrations of a naked Christ hanging on the Cross from the film. I believe they call the issue verisimilitude..","date":"2014-02-10","mins":"8:04 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77261","author":"john_klotz","post":"David, The bas relief scorch theory is intellectual junk and its principal proponent on this blog is also the principal proponent of the de Molay theory which is also intellectual junk. Your and he are of course entitled to your own opinion, but as they say, you are not entitled to your own facts..","date":"2014-02-07","mins":"10:41 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-10858","author":"john_klotz","post":"The author’s conclusions are reasonable and lend a great deal of credence to Ian Wilson’s theory of the Edessa provenance of the Shroud that fills the first one of the two gaps in the Shroud history, the second one being Constantinople to Lirey, FR..","date":"2012-04-26","mins":"8:28 am","url":"https://shroudstory.com/2012/04/26/hymn-of-the-pearl-description-of-the-shroud-of-turin/","cat":"history","title":"Hymn of the Pearl: Description of the Shroud of Turin?"},{"id":"comment-185938","author":"john_klotz","post":"Where are the poker holes? I assume that like STURP the scientists who make this claim will publish there back up data and the methods they used to examine this copy. Also, Colin was able to sharpen the image of the Turin Shroud. Did he try do the same with the image in question or satisfy himself with the image at hand?.","date":"2015-01-24","mins":"6:40 am","url":"https://shroudstory.com/2015/01/24/new-paper-on-the-shroud-of-arquata/","cat":"history","title":"New Paper on the Shroud of Arquata"},{"id":"comment-171386","author":"john_klotz","post":"I do not advocate this position, but there is at least one biblical scholar who advocates Mary Magdalene as the the beloved disciple. See Leonard Swidler, Jesus Was a Feminist: What the Gospels Reveal about His Revolutionary Perspective, Sheed & Ward, 2007 It is an interesting proposition but one that is not either faith affirming or denying. I do not believe that but I do believe that for his time and place Jesus was a feminist, and a radical one at that. But married to Mary M.? Unfortunately, that concept is the basis of all sorts of nonsense memorialized by Holy Blood, Holy Grail (HBHG) and the Da Vinci Code, neither of which qualify as serious scholarship. I really, really don’t believe that Europe is waiting to crown a new king – even the one who is the grandson son, eighty times removed of Christ. (That was the real revelation of HBHG. Turns out the documents relied on by HBHG were forged by the putative descendant of Jesus. Frankly, simple is better. Christ has died, Christ has risen. Christ will come again. To borrow a quote from Rabbi Hillel: “Everything else is commentary.”.","date":"2014-11-15","mins":"7:40 am","url":"https://shroudstory.com/2014/11/15/john-of-john-the-servant-of-the-priest-that-also/","cat":"history","title":"John of . . . , John the . . . ,  Servant of the Priest? That Also?"},{"id":"comment-40512","author":"john_klotz","post":"What makes the Shroud unique is the medically accurate, yet inexplicable, image of crucified body in rigor mortis (0 48 hours after death normally) and the blood “residues.” Trying to bootstrap other relics unto the back of the Shroud doesn’t work becasue it is truly unique and casts doubt on the Shroud through guilt by association..","date":"2013-08-05","mins":"12:57 pm","url":"https://shroudstory.com/2013/08/05/no-bogus-shroud-of-turin-here-huh/","cat":"history","title":"No bogus Shroud of Turin here. Huh?"},{"id":"comment-42206","author":"john_klotz","post":"There is something astir. We are getting an avalanche of new insights into the Shroud and interest. Brothers and sisters, “fasten your seat belts.” This is going to be a glorious “bumpy ride.” [Apologies to Bette Davis and “All about Eve.”].","date":"2013-08-28","mins":"7:05 am","url":"https://shroudstory.com/2013/08/28/not-proof-of-but-instead-best-explained-by/","cat":"history","title":"Not Proof Of But Instead Best Explained By"},{"id":"comment-21049","author":"john_klotz","post":"I find this whole conversation a unnecessary detour from the real issues we face in the Church. It is an accurate observation that there was a reaction against the Shroud epitomized by Thurston and Chevalier. But that was then and this is now. I don’t anyone would confuse me with a conservative but I find that the evidence for the authenticity of the Shroud is overwhelming and that the issues raised by the Shroud are quite germane to the direction of the Church and science. It would not surprise me if it were some conservatives who might be dragging there heels now. The Shroud is a revelation that will ultimately be beyond the control of any particular faction of the Church or society. It leads us towards profound issues of consciousness and existence at the quantum level. It is no accident that most of the analytical devices that have revealed so much about the Shroud in fact function at the quantum level. It was the photon that ushered in quantum mechanics and it is photons of light we receive and analyze from the Shroud. The only comparison as to its impact as revelation I can make is probably Guttenberg’s bible. Hang on to your hats brothers and sisters, it may be a bumpy ride..","date":"2012-12-24","mins":"2:17 am","url":"https://shroudstory.com/2012/12/23/paper-chase-the-conspiracy-against-the-shroud/","cat":"history","title":"Paper Chase:  The Conspiracy Against the Shroud"},{"id":"comment-6318","author":"john_klotz","post":"I don’t know what drum Mr. Hamon is beating but if it’s the Templars what the about the Cathars? Don’t forget them :) The Templars, like Da Vinci, are “usual suspects” of history. Cf Holy Blood, Holy Grail and Dan Brown. If someone has two pictures that prove the Templar theory, times awaisting. Let’s see them and explain how they prove the Templars had it. Oh, by the way, did anybody note the evidence that the Templars were not an official presence at the sacking of Constantinople although there may have been a handful free booting Templars there, does anyone know their names?. The Fourth Crusade wasn’t their show. Not every French knight was a Templar..","date":"2011-12-30","mins":"7:18 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008"},{"id":"comment-15558","author":"john_klotz","post":"This is a superb paper that summarizes much of the forensic evidence that supports the Shroud’s authenticity. Particularly impressive is Prof. Joseph’s challenge to the revisionist school of Christian theology that would deny anything miraculous and divine about Christ and reinterpret him as an interesting personalty who had some good (and bad) ideas. Personally, I believe that some day we shall meet the story at the quantum level where the primordial self conscious from which our existence sprang has left its fingerprints. Isn’t therre an old hymn: Lets Gather at the River? David Rolfe has challenged Richard Dawkins and by extension the militant atheist cult. But, Prof. Joseph as done in a much needed explanation of how the Shroud also challenges theologians. The Shroud is here. It’s real. It’s not going away..","date":"2012-08-29","mins":"10:15 am","url":"https://shroudstory.com/2012/08/29/paper-chase-distinctive-features-of-the-shroud-that-have-yet-to-be-explained-and-their-correlation-with-historical-jesus-research/","cat":"history","title":"Paper Chase: distinctive features of the Shroud that have yet to be explained and their correlation with Historical Jesus research."},{"id":"comment-201078","author":"john_klotz","post":"Yes.","date":"2015-06-04","mins":"11:03 am","url":"https://shroudstory.com/2015/06/04/picture-for-today-shroud-on-the-steps-of-the-cathedral-by-enrie-1931/","cat":"history","title":"Picture for Today:  Shroud on the Steps of the Cathedral by Enrie, 1931"},{"id":"comment-201051","author":"john_klotz","post":"Thomas, No, it wasn’t displayed that way in Constantinople. It was displayed vertically. The frame wasn’t added until the 19th Century. However, beginning in in Medieval times it was displayed by four or so bishops or priests grasping it on the top as horizontally displayed in this picture without frame. (There are dozens of surviving paintings of the displays made before the invention of photography.) One thing to note is the clear indication that the upper two corners of the edging strip had been removed. The Rayes and carbon dating samples were taken just below the the upper left hand corner (as viewed) The frequent viewings caused the corners to fray. The edge was removed and the fraying required repair. The carbon samples were taken from the repaired area. The FACT of the repairs has been confirmed by recent expert analysis. Skepics might want to check my article published on Shroud.com http://www.shroud.com/pdfs/klotzcnn.pdf It is a critique of CNN’s Finding Jesus program on the Shroud. I cite in footnotes 27 & 28: http://www.shroudofturinexhibition.com/Shroud of Turin exhibition/Thomas Ferguson files/Updated report on  the Consideration to the Uniformity and Effects of the Fabric in the Shroud of Turin 5 1.pdf http://www.shroudofturinexhibition.com/Shroud of Turin exhibition/Three threads files/BL%20 Sebastian%20for%2 0website%201.pdf.","date":"2015-06-04","mins":"4:59 am","url":"https://shroudstory.com/2015/06/04/picture-for-today-shroud-on-the-steps-of-the-cathedral-by-enrie-1931/","cat":"history","title":"Picture for Today:  Shroud on the Steps of the Cathedral by Enrie, 1931"},{"id":"comment-48674","author":"john_klotz","post":"This is a fascinating observation. It raises some interesting questions for which I may have no answer and may even lack the expertise to ask: 1. Is it correct to imply from these materials that the Shroud may have been in Gnostic hands at very early stages of Christianity? The theosophists (Madame ‎Helena Blavatsky et al) who I believe trace their roots through the Gnostics are great believers in secret wisdom. 2. What would have been the transition from Gnostic control to orthodox control? 3. Would Gnostic control be some explanation for the Shroud’s missing years? I don’t want to get too deep into this because I think the physical evidence of the Shroud’s attributes establishes it’s reality and it’s emergence from the mists of ancient time is a function of modern science. There will never be a “proven” pedigree. However, sometimes with the Gnostic sources we may be not clearing the mists totally but parting them enough to glimpse truths that may have been hidden and/or disguised by complex metaphor or allegory..","date":"2013-10-25","mins":"12:15 pm","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","title":"Paper Chase: Thomas & The Hymn of the Pearl"},{"id":"comment-201060","author":"john_klotz","post":"I believe the Le Cari remembrance is pretty clear on that. What the spectators were seeing was just the front image not the back. The back image displays His naked buttocks and would have been a scandal. Also, John Jackson identified crease marks on the Shroud consistent with folding for that kind of display. The image of Christ is buck naked on the Shroud. Joseph of Arimathea and Nicodemus had to break rigor mortis becasue his arms at the time death were outstretched on the cross and he in fact hung on the cross for some indeterminate time after he died. The image is consistent with the rigor mortis being broken at his shoulders an his arms being drawn down and covering his genitals. As a matter of fact, as I recall the all too many wakes I have attended, the fully clothed body of the corpse had its hands crossed as displayed in the image. Often at a Catholic wake with a rosary in the hands..","date":"2015-06-04","mins":"5:53 am","url":"https://shroudstory.com/2015/06/04/picture-for-today-shroud-on-the-steps-of-the-cathedral-by-enrie-1931/","cat":"history","title":"Picture for Today:  Shroud on the Steps of the Cathedral by Enrie, 1931"},{"id":"comment-201052","author":"john_klotz","post":"The footnote URL’s have a break in the middle and don’t work. These should: http://www.shroudofturinexhibition.com/Shroud of Turin exhibition/Thomas Ferguson files/Updated report on  the Consideration to the Uniformity and Effects of the Fabric in the Shroud of Turin 5 1.pdf http://www.shroudofturinexhibition.com/Shroud of Turin exhibition/Three threads files/BL%20 Sebastian%20for%2 0website%201.pdf.","date":"2015-06-04","mins":"5:06 am","url":"https://shroudstory.com/2015/06/04/picture-for-today-shroud-on-the-steps-of-the-cathedral-by-enrie-1931/","cat":"history","title":"Picture for Today:  Shroud on the Steps of the Cathedral by Enrie, 1931"},{"id":"comment-201053","author":"john_klotz","post":"Apparently the URLS are two long to work in the format of the blog and disconnect with a line break. If you are interested, you can copy them and eliminate the line break manually. Then they will work. If you have doubts about the repairs, it’s worth the effort. I can E Mail anyone who has difficulty and is interested, klotzlaw@gmail.com.","date":"2015-06-04","mins":"5:10 am","url":"https://shroudstory.com/2015/06/04/picture-for-today-shroud-on-the-steps-of-the-cathedral-by-enrie-1931/","cat":"history","title":"Picture for Today:  Shroud on the Steps of the Cathedral by Enrie, 1931"},{"id":"comment-207143","author":"john_klotz","post":"Incidentally, on the Lumiere web site is a video explaining the process as developed by them. It is copyrighted so you will have to see for yourself. They apply their work to paintings but I believe the multi spectra digital imaging is certainly applicable to the Shroud. Watch the video and reach your own conclusion if you are interested. Lumiere is not the only company that does it. Http://www.lumiere technology.com/.","date":"2015-08-01","mins":"7:28 am","url":"https://shroudstory.com/2015/08/01/remembering-an-earlier-posting-about-the-seamless-robe/","cat":"history","title":"Remembering an Earlier Posting About The Seamless Robe"},{"id":"comment-207142","author":"john_klotz","post":"If there was ever any doubt that the survival of the Shroud of Turin was a singular event and an act of providence (Divine or otherwise) it’s the fate of the seamless robe(s) should remove it.. While the Savoy family did in fact make gifts of pieces of the Shroud, they were quite small, taken from the edges and apparently they avoided the image area and the blood. Not a big fan of royalty but it’s had not to see the hand of providence in the survival of the Shroud until a time when science could unlock its secrets. What happened to the seamless robes(s) is what I call the Central Park Effect. It has been said that if everything ever proposed for Central Park had been approved, the Park would have been cemented over 50 times or so. Incidentally there has been some uninformed critique of the Quad Mosaics that they were originally black and white and them colorized. Microspectral digital imaging begins with black and white images also BUT the three images are taken with RGB filters and then combined for single color image. IT’S THE FILTERS THAT COUNT. So please no self proclaimed scientists objecting that the original photos were just black and white. Am I wrong? I would appreciate an informed correction about the process. Don’t believe me? Check out the Lumiere site. Http://www.lumiere technology.com/ Luminere’s work on the Mona Lisa at the ouvre was epic. (I cover it in some depth in Chapter 14 of Quantum Christ.).","date":"2015-08-01","mins":"7:02 am","url":"https://shroudstory.com/2015/08/01/remembering-an-earlier-posting-about-the-seamless-robe/","cat":"history","title":"Remembering an Earlier Posting About The Seamless Robe"},{"id":"comment-207153","author":"john_klotz","post":"Disagreements are what makes for horse races someone once said. I find t not at all unusual that someone who accepts the conclusions of the Warren Commission would accept the carbon dating..","date":"2015-08-01","mins":"9:38 am","url":"https://shroudstory.com/2015/08/01/remembering-an-earlier-posting-about-the-seamless-robe/","cat":"history","title":"Remembering an Earlier Posting About The Seamless Robe"},{"id":"comment-14694","author":"john_klotz","post":"Who is this guy/gal? Right on!! http://johnklotz.blogspot.com.","date":"2012-08-10","mins":"7:28 am","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","title":"Imagine the image as part of the resurrection and not the result of the resurrection"},{"id":"comment-207263","author":"john_klotz","post":"Hugh, I didn’t intend to equate the 1978 Quad Mosaics quality and detail to the results of Lumiere’s process which is much more complex and involves 13 spectral photographs instead of 3. The Lumiere study of the Mona Lisa was more than 25 years later. The science of multispectral digital imaging had advanced. The Lumiere system measured composition across the complete light spectra from invisible infrared to invisible ultraviolet. A comparison of the Luimiere process to the Quad Mosaics is like comparing a 2015 Rolls Royce to a 1917 Model T Ford. An explanation of the process of the Quad Mosaics’ creation can be found at http://www.shroud.com/pdfs/quad.pdf. While I referred to the three spectra as R/G/B, the article by Barrie Schwortz reverses the three spectra as B/G/R. That being noted, you had another complaint about the Quad Mosaics has evidence of repair because other corners of the Shroud also showed a marked bluish color. We now know why thanks to the publication of a history of the Savoy family’s guardianship of the Shroud that the Savoy’s gifted favored individuals with a fiber of the Shroud sometimes contained in small elaborate reliquaries which were themselves works of art. A copy of the Shroud with fibers from the Shroud embedded at its corners apparently was given to the Portuguese Royal Family on the occasion of a Savoy princess’s marriage to the Portuguese king. See http://www.shroud.com/pdfs/fatima2011.pdf For documentation of the fact that the Oxford sample was from an apparently anomalous portion of the Shroud see: http://www.shroudofturinexhibition.com/Shroud of Turin exhibition/Thomas Ferguson files/Updated report on the Consideration to the Uniformity and Effects of the Fabric in the Shroud of Turin 5 1.pdf http://www.shroudofturinexhibition.com/Shroud of Turin exhibition/Three threads files/BL%20 Sebastian%20for%20website%201.pdf In sum, the 1978 Quad Mosaics were in fact the result of an examination of the spectra of the Shroud using three filters B/G/R. There is evidence that samples of the Shroud cut primarily from the frayed corners were gifted by the Savoy’s to those royal houses and individuals it favored. I would think that you would agree that a carefully conducted, non intrusive multi spectral digital image examination of the Shroud conducted to standards such as those used by Lumiere would be of enormous value, not just to scientists, but to history..","date":"2015-08-02","mins":"8:22 am","url":"https://shroudstory.com/2015/08/01/remembering-an-earlier-posting-about-the-seamless-robe/","cat":"history","title":"Remembering an Earlier Posting About The Seamless Robe"},{"id":"comment-14647","author":"john_klotz","post":"I do not believe that this is “off topic” because the issue goes to the heart of existence both before and after the big bang. Christ is the intermediary between the consciousness from which existence spring (GOD) and the multiple consciousnesses which spring from that existence.The Shroud is not just an artifact it is a revelation by science for our time..","date":"2012-08-09","mins":"6:43 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?"},{"id":"comment-11649","author":"john_klotz","post":"The good Bishop seems to assert that the Shroud is fake (carbon dating again) and that is why de Wesselow is wrong. Lord save us from our friend..","date":"2012-05-27","mins":"11:30 pm","url":"https://shroudstory.com/2012/05/27/methodist-bishop-refutes-claims-against-bodily-resurrection/","cat":"news_&_views","title":"Methodist Bishop Refutes Claims Against Bodily Resurrection"},{"id":"comment-10494","author":"john_klotz","post":"Teilhard predicted a convergence of science & religion and that seems to me where we are going. I think the bias against science as a grounds for faith expressed by some represents a misunderstanding of where science is heading. Scientific and philosophical determinism dominated science until the beginning of he 20th century when the incongruities of quantum mechanics revealed destroyed the basic assumptions of determinism and revealed realty to be conscious driven and devoid of “common sense.” The Determinists included Newton, Darwin, Freud, Marx and Adam Smith. The end result was that free will was discarded as a myth and we acted in accordance with a myriad of circumstances that determined our action. The seeds of quantum mechanics were planted around the turn of the twentieth century, at the same time that science through Pia’s photography demonstrated the image on the Shroud to be the image of a tortured and crucified man who could only be Jesus Christ. The complaint about the Shroud is that it lacks “provenance” – a demonstrated history. But the physical facts of the Shroud demonstrate through scientific examination establish its authenticity. When one places the collapse of determinism that is intrinsic in quantum mechanics along the side the development of Shroud Science, the question arises is not provenance, but providence. (Some determined atheists may argue that quantum mechanics does not refute determinism, but their arguments smack more of desperation than logic.).","date":"2012-04-17","mins":"10:41 am","url":"https://shroudstory.com/2012/04/17/the-shroud-as-reasons-to-believe-in-the-resurrection/","cat":"news_&_views","title":"The Shroud as Reasons to Believe in the Resurrection"},{"id":"comment-142954","author":"john_klotz","post":"There are two extraordinary “facts” or “miracles” about the Shroud (take your pick). 1. It exists at all and 2. It has survived to a time when science cold unlock its secrets. Blnd luck or providence?.","date":"2014-08-08","mins":"7:03 am","url":"https://shroudstory.com/2014/08/08/from-shroud-encounter-the-day-the-shroud-foiled-hitler/","cat":"history","title":"Revised: The Day the Shroud Foiled Hitler"},{"id":"comment-142956","author":"john_klotz","post":"Blnd = blind. Now back to proofing my 400+ page manuscript.","date":"2014-08-08","mins":"7:06 am","url":"https://shroudstory.com/2014/08/08/from-shroud-encounter-the-day-the-shroud-foiled-hitler/","cat":"history","title":"Revised: The Day the Shroud Foiled Hitler"},{"id":"comment-142957","author":"john_klotz","post":"Cold = could.","date":"2014-08-08","mins":"7:06 am","url":"https://shroudstory.com/2014/08/08/from-shroud-encounter-the-day-the-shroud-foiled-hitler/","cat":"history","title":"Revised: The Day the Shroud Foiled Hitler"},{"id":"comment-13266","author":"john_klotz","post":"It’s Sunday morning and I really shouldn’t be thinnk this way, but does this guy have a phallic complex or what?.","date":"2012-07-01","mins":"7:24 am","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-13449","author":"john_klotz","post":"Corrected copy: What I find amazing is the Asimov article which is a part of blog that started this discussion. It’s Medieval (maybe not so medieval). He adopted of the language and analysis of the Inquisition. Thus we have “orthodox” science defending us against the heretics who dare to publish without imprimatur. It is a very elitist view and anti democratic. It’s not that scientific issues should be decided by a majority vote. It’s that even crackpots have a right to free access to what Madison called “the market place of ideas.” The essence of the Asimov view is that only approved ideas can be shared. Given the scientific investigations of the Shroud of Turin and the published results of those investigations anyone who still argues or tosses off the opinion that the Shroud is, or must be studied as, a painting, is either lazy or a fool, or both. They are also what Marcello Truzzi called “pseudoskeptics.” They are not seeking to discover truth but to sustain their predetermined point of view. They are truly “true believers.” And yet in the posts to this blog the pseudoskeptics label those who take the scientific findings concerning the Shroud seriously “believers” as if that were a curse word. When it comes to “belief” those who maintain the Shroud is a painting and attack the credibility of those who deny that are the Taliban of science..","date":"2012-07-04","mins":"8:55 am","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-13446","author":"john_klotz","post":"What I find amazing is the Asimov article which is a part of blog that started this Medieval (maybe not so medieval) adopted of the language of analysis of the Inquisition. Thus we “orthodox” science defending us against the heretics who dare to publish without imprimatur. It is a very elitist view and anti democratic. It’s not that scientific issues should be decided by a majority vote. It’s that even crackpots have a right to free access to what Madison called “the market place of ideas.” Given the scientific investigations of the Shroud of Turin and the published results of those investigations anyone who still argues or tosses off the opinion that the Shroud is, or must be studied as, a painting, is either lazy or a fool, or both. They are also what Marcello Truzzi called “pseudoskeptics.” They are not seeking to discover truth but to sustain their predetermined point of view. They are truly “true believers.” And yet in the posts to this blog the pseudoskeptics label those who take the scientific findings concerning the Shroud seriously “believers” as if that were a curse word. When it comes to “belief” those who maintain the Shroud is a painting and attack the credibility of those who deny that are the Taliban of science..","date":"2012-07-04","mins":"8:04 am","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-44955","author":"john_klotz","post":"I think that people who demand “conclusive” proof about this or that do not understand how we prove things in the real world. As the atheist pope, Richard Dawkins pointed out in one of books, circumstantial evidence can be more reliable than direct evidence of an observer. Fingerprints have been used to identify individuals with as many as few as 1`2 points of comparison. The issue resolves to probabilities. How probable is it that two items would have the same identical points? There comes a point when the circumstances are sufficient to change the burden of proof. That is, the burden is on the skeptic to offer facts that contradict the conclusion, not simply hypothesize as to what could be. This is the problem of the Shroud deniers. Once you establish the points of similarity to the Gospel accounts, taking into account the variances in the four Gospels, it is not enough to say maybe it was someone else. You have to answer if not him, who? As far as the Pray Codex is concerned, we have several points of comparison. It is clearly a shroud. Is there any other work of art or artifact that has more points of comparison to the Pray Codex than the Shroud. If so, I haven’t seen it. Has anyone?.","date":"2013-09-21","mins":"7:33 am","url":"https://shroudstory.com/2013/09/21/so-is-that-the-shroud-of-turin-depicted-in-the-hungarian-pray-codex/","cat":"history","title":"So is that the Shroud of Turin depicted in the Hungarian Pray Codex?"},{"id":"comment-43284","author":"john_klotz","post":"Next he will explain how Da Vinci fabricated the Shroud of Turin. However, I note that he placed the Shroud in the same category as the Dead Sea Scrolls. Has there ever been a claim that the Dead Sea Scrolls were a fake?.","date":"2013-09-08","mins":"8:30 am","url":"https://shroudstory.com/2013/09/08/so-is-the-vinland-map-fake-after-all/","cat":"history","title":"So is the Vinland Map fake after all?"},{"id":"comment-43287","author":"john_klotz","post":"(In case anyone noticed) The author the main article was not a he but a “she.” The author of the Vinland map theory what she quotes was a “he.”.","date":"2013-09-08","mins":"9:03 am","url":"https://shroudstory.com/2013/09/08/so-is-the-vinland-map-fake-after-all/","cat":"history","title":"So is the Vinland Map fake after all?"},{"id":"comment-16765","author":"john_klotz","post":"Yannick, I don’t think it was necessary to digress on the Edessa theory in response to Steve’s post. The Shroud exists in the here and now where ever it was. It would be helpful in these discussions if everybody would concentrate on the issue at hand and not waste time riding their particular hobby horse in response to every post, whether relevant or not. The icons exists today as material objects. The Shroud exists today as a material object. I don’t care if it was used as a towel by King Clovis’s wife and then was carried off by elves. It is here and now in Turin. Dare I say there will never be a clear province established form the Tomb to Turin. So what? The physical evidence of the Shroud as it exists today and the comparisons to the early icons (including the Justinian coins) are sufficient to establish its identity as existing as early as the Fifth Century and being important enough in those times to cause the images of Christ to be changed from a beardless Adonis to the bearded man of the icons. There are other physical attributes of the Shroud, as it exists today, that take it back to the Tomb the Sunday after the Crucifixion. QED.","date":"2012-09-22","mins":"6:21 pm","url":"https://shroudstory.com/2012/09/22/stephen-jones-is-up-with-part-10-of-his-critique-of-charles-freeman/","cat":"history","title":"Stephen Jones is up with Part 10 of his critique of Charles Freeman"},{"id":"comment-10790","author":"john_klotz","post":"I am s o o o disappointed. I thought Colin had really made an intelligible post. Of well, as Scarlett O’Hara said: Tomorrow is another day..","date":"2012-04-23","mins":"7:33 pm","url":"https://shroudstory.com/2012/04/23/the-cluny-medal-with-shields-of-geoffrey-de-charny-and-jeanne-de-vergy/","cat":"history","title":"The Cluny Medal with shields of Geoffrey de Charny and Jeanne de Vergy"},{"id":"comment-13574","author":"john_klotz","post":"Freeman’s selective sources. In his introduction Freeman states that “I decided to leave out the Shroud of Turin. Relic cults come and go and the Turin Shroud is very much a cult of the past fifty years, not a medieval one.” That is an incredible statement. Let’s assume that we are all wrong, let’s assume that the Shroud is a hoax (It isn’t, but lets’s assume that, as they say, arguendo.) How then to explain the badge at the Clony Museum in Paris or the paintings of the Shroud and its exposition to thousands prior to the Pia photograph of 1898. (More than 50 years ago assuming my math is accurate.) Medieval artist did indeed copy it and certain artistic conventions that appear on the Justinian coins, for example indicate they came from the Shroud image. (Check the “V” forelock) The contention that Freeman ignored the Shroud because it wasn’t a medieval cult is pure baloney. He ignored because he can’t deal with it as a object of scientific inquiry. The Shroud is a real object existing in this time and this place. It has been subjected to more than a quarter million hours of scientific investigation. Art historians like Freeman are on the wrong track because whatever the Shroud is, it is not a painting and it is not art. The answers lie in science. But it is a challenge as the errant carbon dating shows. Even science can lie. But the discussion must be of science. I have enormous respect for Ian Wilson and the contributions he has made. His theory Edessa theory is intriguing. However, the issue is not where the Shroud was in antiquity, the issue is what the Shroud “is” now..","date":"2012-07-07","mins":"7:05 am","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","title":"The Shroud of Turin: A Modern Relic Cult?"},{"id":"comment-76456","author":"john_klotz","post":"Colin, I have avoided asking a question of you because it might lead into an irrelevant morass. But your fixation on de Molay and your disdain for Rogers (his pique) leads me to ask it: Were you ever a member of the Order of de Molay? or any other organization dedicated to his memory. There are skeptics of the Shroud who unfairly, and inaccurately , depicted STURP as a band of fanatic Christian soldiers. There were many Christians on the STURP team. There were also Jews, agnostics and perhaps some atheists. Thus that attribution was wrong. However, were the member of STURP all been Christian fanatics, or Opus Deii members, that would be a legitimate question of whether their Christian fanaticism colored their science. I will confess, I am a Roman Catholic although I’m not so sure of the Roman part sometimes. I guess I am like Pope Francis: A Vatican Council Catholic, The Pope has described himself a Vatican Council priest. It is a fair question when challenging me that I am Catholic. It also a fair question to ask a skeptic challenging the Shroud whether he is an atheist. Neither atheism nor Catholicism should disqualify any one from studying and discussing the Shroud and its science. But when someone comes off the wall, such as describing the Lirey badge as a hidden tribute to Jacques de Molay, it is a fair question to ask if he was a member of the Order of de Molay and perhaps had access to information not generally shared with the public. I await your answer and expect vituperation. But if the vituperation surrounds a answer, I’m a big boy. I can take it..","date":"2014-02-04","mins":"8:52 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76457","author":"john_klotz","post":"A rough analogy for my question. If you were a Yale graduate, and a member of Skull & Bones, their rules would require not an answer, but that you leave the “room.” That you leave the room is not my intention at all..","date":"2014-02-04","mins":"8:56 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76477","author":"john_klotz","post":"Louis, Of course your right but I wanted Colin to answer without getting into a discussion of the FM word (Free Masons) I do think, given Colin’s cult like devotion to an idealized Jacques Molay it’s a legitimate suggestion. What happened to de Molay was despicable but the reason were rather pedestrian. There’s an old saying “on the street.” You loan me $10 you own me. You loan me $100,000, I own you. De Molay was too generous with the King of France and he didn’t realize who owned who. I think everyone who was ever burned at the stake, be that saint, heretic or sinner were grievously wronged. There is one theory that it wasn’t as horrible as we believe because the fire drew in all the oxygen and the victims were asphyxiated before their flesh was burned. I don’t really know and I am not anxious to find out..","date":"2014-02-04","mins":"9:58 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76495","author":"john_klotz","post":"You don’t surprise me with your response but you disappoint. Didn’t you once ask Davidb if he was trained by the Jesuits, or some such? He responded with a detailed answer. If someone were to suggest that my belief in the authenticity of the Shroud sprung from my membership in the Knights of Malta and/or the Knights of Columbus, I would simple deny both of such memberships. Were I be asked if I were a member of Opus Dei, I would also deny it. Not because membership in any of the three organizations is a disqualification but membership in any one of the three might define my sense of the Catholic Church. I am not been a member of any of the three, by the way. Honestly, Colin, there is only one other person who I ever had a discussion with on de Molay that I can recall. It was in college and I spotted a pin on one of colleagues lapel. I asked him what it was for and he said the Order of de Molay. I asked who he was and he explained it was a Masonic youth order and de Molay was a martyr to free speech. I put that into my mental file and forget folder along with the Rosicrucians who advertised in the back pages of magazines such as Popular Science. The alleged assassin of Robert Kennedy was identified as having dabbled with a Rosicrucian society and that led me on a trail that wound up with Holy Blood, Holy Grail (HBHG). It was an interesting read but as I do with most conspiracy books I ignored the principle premise of the book (an obscure Frenchman was a blood descendant of Jesus Christ and was seeking to institute a new really European Empire) and concentrate on the verifiable facts reported. It was an interesting read on the history and I was fascinated by the fact that Madame Calve, the prima diva her time was supposed to be a member of the Pre de Sion, the uber conspiracy that ruled the world. Madame Calve in the nibneteen twenties had invited my Aunt Pauline, a very great soprano to come to Paris and be her protégé. She didn’t and her story can be found at http://www.johnklotz.com/billy.htm along with some other family history. The grain of salt I took about the Priory of Sion was big enough to choke a horse. Dan Brown used the allegations of HBHG as the inspiration of his “The da Vinci Code” and believe it or not, one of the writers of HBHG was also one of the writers of “The Silent Witness.” That doesn’t make HBHG true or Silent Witness false. Each work must stand on its own. Bottom line, I am a little more knowledgeable about Jacques de Molay than I was 55 years ago. I guess CB, you are afraid to give an honest answer to the question. If you weren’t so defensive, maybe we could get a new insight. “There might be giants” and there might be conspiracies. Of the two, conspiracies might be more probable. Then again, some might think that existence is a conspiracy, or at least a hologram. Cf Lawrence Krauss in the” Real Face of Jesus” video..","date":"2014-02-04","mins":"10:59 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76519","author":"john_klotz","post":"David, If you believe that you meant something opposite to what your metaphor implies. To say that something has a snowball’s chance in hell means that it is impossible. If you are saying that there is even the slightest chance that the de Molay theory is plausible then you have my sympathy but as we say in New York, I have a bridge you might be interested in buying. Don’t worry, it’s between Manhattan and Brooklyn and Chris Christie can’t get his hands on it. CB’s theory is devoid of reality. It has a snowball’s chance in hell which means it has no chance. To debate it is a distraction from really important debates. In my scheme of things, the CB’s de Molay theory is not worthy of a minute of debate. Carbon dating must be dealt with and I guess I am writing a hundred pages or so on it. It’ll take more than the ramblings of an individual who refuses to answer a reasonable question about where he’s coming from before I turn my attention to that claim. It is beneath rebuttal..","date":"2014-02-04","mins":"12:06 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76898","author":"john_klotz","post":"David Goulet, When I was in grammar school at St. John the Baptist in Syracuse, one bitter winter day the good Sister was upset because one or more members of the school safety patrol (they worked at corners outside and had white “Sam Brown” belts) complained that it was too cold to work. She said: “What are they going to do in the freezing cold of Hell, that’s right the freezing cold of Hell.” That was 1949. I have to appreciate the nuns who gave their lives to the Church and wound up teaching ingrates like me, But when I was active in community organization and politics in the Bronx some years later many of the nuns were already right on activists. I got one of them in trouble with the Chancery, I was handling New York issues for the Fred Harris in 1975 1976 Presidential Campaign and I asked Sister Pat if she wanted to be a candidate for delegate to the Democratic National Convention. When Mickey Carrol of the NY Times was doing a series of articles on delegate selection, he called her because it thought it would be a good story tracking a select few candidates for delegate and he (a good Irishman) thought sister Pat would be a good story. He asked her how she got to be a delegate and she replied (and he printed in the Times) John klotz called me and asked I wanted to be a candidate.” That was in the morning edition of the Times and by the afternoon the Chancery had ordered her out of the race. (I think the story is in the New York Times circa 1975 1976) Oh well, we didn’t elect any Harris delegates anyway. And you’re right, Hell can be freezing cold, except maybe we don’t really know what Hell is. I have a direction in which I am heading which is actually not far from some theologians: The worst pain of hell is knowing that we have eternally separated ourselves from the love which was the primordial cause of our existence. That and/or oblivion. Falling through darkness into a black pit for eternity. That God is love is not exactly an original idea of mine. There was another fellow named John who wrote the same thing about 2000 years ago.. And to bring it home, the greatest material evidence of God’s love is the Shroud of Turin. The most subversive thing anyone can preach is love. It is preaching it that sealed Christ’s doom. Note that I said “material” evidence. There are two meanings to the word (at least) and I mean them both..","date":"2014-02-06","mins":"12:28 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76429","author":"john_klotz","post":"Hugh, Don’t keep the blog in suspense. The sindology site and Google translate by the way, translate the inscription as “The Shroud of Jesus.” I will be writing about Occam’s Razor this week and its egregious misuse by Walter Mc Crone but I do think that applying it, “The Shroud of Jesus” is the simplest solution and the most appropriate. Of course, I am a little disappointed. Based upon the posts of one of the expert bloggers here, I would have thought it would have been: “The Shroud of Saint Jacques de Molaqy.” Oh, oh, I’m bleeding. My tongue just pieced my cheek. I really have to tone it down..","date":"2014-02-04","mins":"7:28 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76576","author":"john_klotz","post":"The only mileage in a Jacques de Molay theory is the distance from where I am to the nearest mental hospital..","date":"2014-02-04","mins":"6:42 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76431","author":"john_klotz","post":"Typo alert “Molaqy” = “Molay” St. Jacques forgive me..","date":"2014-02-04","mins":"7:30 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-28075","author":"john_klotz","post":"Gabriel, I read your post with as a deeply ironic comment..","date":"2013-03-22","mins":"2:14 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28055","author":"john_klotz","post":"I made it!!!! I made it!!! I made Colin Berry’s “stuff” list. I am sooooo honored..","date":"2013-03-22","mins":"9:55 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28074","author":"john_klotz","post":"CB Obviously, you don’t know what “stuff” is a euphemism for. More to the point, I am asking questions and making what I believe to be informed speculations. The book of knowledge is not closed. You are one of those skeptics who refuse to recognize that some things are beyond the present grasp of the scientific process as narrowly defined by skeptics. That’s changing. When you learn to respect those who disagree with you then you may find that you will in turn garner respect. What puts you beyond the pall in my view is your demeaning the credentials of scientists like John Heller and Al Adler. These men were giants in their field. Heller wrote books – only one about the Shroud and that was in a nature of a memoir as well as a description of the 1978 STURP investigation. I ask again: have you read it? In my humble opinion, when you attack the professional standing of the STURP team, you are a mouse snarling at lions..","date":"2013-03-22","mins":"2:12 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-25391","author":"john_klotz","post":"These speculations by Colin Berry are not pseudo science, they are trash science. The only science involved is ophthalmology and the only conclusion is that Berry needs a new pair of glasses..","date":"2013-02-23","mins":"7:47 am","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","title":"To hide away and suppress the Cluny Medal"},{"id":"comment-27895","author":"john_klotz","post":"Inspired by this post, I ahve posted a piece on my own blog: http://johnklotz.blogspot.com I ask the question: The image on the Turin Shroud: Is a laser like light the explanation?.","date":"2013-03-20","mins":"8:59 am","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","title":"Was the Shroud of Turin a Tablecloth?"},{"id":"comment-214383","author":"john_klotz","post":"Dan, one thing you are missing is the “ancient document” rule of evidence that gives some, but limited credence to statements in ancient documents that lack the normal proof of authenticity (such as certification by a county clerk). Also, in the brief synopsis you don’t make some obvious connections. One of the things as a youngster I found confusing is how we label a century a year after its calendar dates. The “eighteenth century” is circa 1700 1799. The twentieth century was 1900 to 1999 and the 21st century is our current epoch. I make this aside because the date of the decorative panels of the chest means that the whole chest can be traced to 1300 1399, encompassing the precise period of the first public exposition of the Shroud in 1355 and its “vagabond travels” in the 14th 15th centuries including a stop at the de la Roche castle. In Quantum Christ on page 37 I have the following footnote: “5 The best evidence is that the Shroud was a part of the booty that was seized by French knights who participated in the sack of Constantinople in 1204 during the abortive Fourth Crusade. Ian Wilson has postulated that it became the property of the Knights Templar. Others postulate that it became the property of Othon de la Roche, a French knight who became Duke of Athens as a reward for outstanding services during the Constantinople sack. De La Roche was the great grandfather of Jeanne de Vergy, Geoffrey’s wife. See the note by Cesar Barta,” Orthon de la Roche” BSTS News Letter, October 5, 2008 (http://www.shroud.com/pdfs/n67part6.pdf). If true, when Geoffrey I’s (and Jeanne de Vergy’s) daughter married Ortho de la Roche’s great grandson (reinforcing the blood line ownership of the Shroud) and then moved the Shroud to the de la Roche castle, the Shroud was returned to a previous home.” [These facts were brought to my attention by Annette Cloutier] It definitely appears that the Shroud was in the De la Roche castle and it is no surprise that they would have made a suitable chest for its storage. Because of the fact that the Shroud was in constant motion during this period of time it makes sense that the original chest which brought the Shroud from Constantinople to France would have become a bit shop worn and needed replacement. But the bottom was preserved. Is this proof of anything? Not conclusive perhaps, but the claims of the De La Roche heirs as represented in the pedigree of the Chest are consistent with known facts..","date":"2015-11-08","mins":"6:13 am","url":"https://shroudstory.com/2015/11/08/what-am-i-missing/","cat":"history","title":"What am I missing?"},{"id":"comment-214385","author":"john_klotz","post":"Our knowledge of the Shroud’s vagabond ways before it became the property of the House of Savoy comes from the meticulous research of Ian Wilson. I cited him for the the following: “The Vagabond Shroud “After the death of Geoffrey II, on May 22, 1398, the ownership of the Shroud passed to his daughter Margaret. The Shroud became somewhat of a vagabond. On July 6 1418, the continuing wars with England caused the Shroud to be moved to the Castle of Montfort, owned by Margaret’s second husband, Humbert, Count de la Roche. A few years later, it moved again to St. Hippolyte sur Doubs, in Alsace Lorraine. At Doubs, an exposition of the Shroud was held annually on Easter Sunday.11”.","date":"2015-11-08","mins":"6:29 am","url":"https://shroudstory.com/2015/11/08/what-am-i-missing/","cat":"history","title":"What am I missing?"},{"id":"comment-36945","author":"john_klotz","post":"At times, I feel sorry for those who are so dedicated to disbelief in either the concept of a deity or the authenticity of the Shroud so as to either ignore or disregard the evidence before us. I believe the main issue of the Shroud is not provenance but providence. The Shroud’s near misses with oblivion including at least three times barely escaping consumption by fire may not be “miraculous” but is certainly “providential.” And now we have a narrow escape from Nazis that were hunting for it. But the most important sign of providence is that it waited for science to catch up with it. Pia’s photographs were only a relatively crude overture to the depth of the quantum examinations of STURP. Now even more vastly improved measurement devices functioning at the quantum level are available. And we are being hit with circumstances apparently unrelated that are focusing attention on the Shroud. Certainly any reference to the Shroud will in Rosenberg’s diary will be a big, big story. Yet, it will only be a part of an inexorable tide of interest that is sweeping across the world. In Thus Spake Zarathustra, Friedrich Nietzsche celebrated the death of God. It had happened in the extreme end of the Universe but the news was traveling to the world. Nietzsche wrote in the Nineteenth Century. The news arrived not with a bang, but many bangs in the Twentieth Century. I realize that some of our agnostic or super physicist who read this blog may be upset by this statement: God is being reborn in this time and place through the instrumentality of the Shroud. The news has arrived. Http://quantumchrist jck.blogspot.com/.","date":"2013-06-14","mins":"8:23 am","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","title":"Will the Alfred Rosenberg Diaries Tell Us Anything?"},{"id":"comment-72396","author":"john_klotz","post":"With all due respect for the enormous effort to trace the Shroud’s provenance back to Edessa or any other place, they are essentially legends. Physical facts are not legends they are facts. That is why the scientific examinations of the Shroud are crucial and determinant. I think Wilson’s work on the Vignon markings was very important. Both the markings on the Shroud and its artistic progeny are again physical facts. I am more comfortable relying on those..","date":"2014-01-06","mins":"6:56 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-37074","author":"john_klotz","post":"Doubting Thomas went on to preach the Good News (Gospel) and tradition says he was martyred in India. He believed becasue he saw. “Behold the signs of the tines.” The Shroud is a sign for our times. We live in an era when militant atheisim has Cristianity under attack, science is its cudgel. So in this time and place we have a sign that can only be realized completely throgh science. That IMVHO is Providence..","date":"2013-06-15","mins":"3:46 am","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","title":"Will the Alfred Rosenberg Diaries Tell Us Anything?"}]
