[{"id":"comment-175357","author":"john_klotz","post":"I am a little bit confused by what has been “proven” about the Shroud except to confirm that its image has distance information. Colin by creating a scorch from a three dimension object has shown that it will have similar properties to the Shroud. As they say in Yiddish: Neu? [So?] I am not Jewish but 45 years in the Bronx will gives you an appreciation of Yiddish. His example is interesting but it represents the difference in distance as difference in color. The Shroud, like his scorch is monochromatic – a single color. The three dimensional representation that appears in the VP 8 is not caused by a difference in color but a difference in intensity or density of the image. Color (place on the spectrum of light) is different from intensity. Actually, Colin is about where Ray Rogers was. Rogers maillard reaction is a kind of scorch at low temperature but he realized that it wasn’t enough. There is that troublesome presence of real unscorched blood on the Shroud. Life is simple if you can accept the carbon dating tests. But, I submit, particularly after the Pam Moon presentation at St. Louis of the paper on the Oxford sample, that you can’t. Merely calling people like Wesselow or Heller or Adler names, doesn’t due the trick. De Wesselow was trained at the Courtlandt Institute. John Heller had amazing credentials including be chosen by Yale to be advised by Einstein at Princeton when he he was an undergraduate at Yale. Adler was Jewish. Yet, how often are the STURP scientists denigrated as Christian fanatics. The differences in intensity (density) of the image was noted by Vignon were the reason for his “action at a distance” theory. Sorry Dan, but once you understand that the image of the Shroud is monochromatic, you are back to action at a distance caused by a variation of image intensity, not color. Brightness is a function of intensity or density of the image. So too is “darkness.” Indeed, my scientific adviser referred to the VP 8 as a darkness map. (Ph.D. Carnegie Mellon, Emeritus University of Florida, Gainsville and a career studying writing about lasers, i.e. Light) He was also impressed by the scholarship of the STURP paper by Jackson, Jumper et al on the nature of the image. I have the distinct impression that Colin has reinvented the wheel..","date":"2014-12-09","mins":"7:07 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175694","author":"john_klotz","post":"Thank you Colin. You learn something every day. I thought the pillars were French and the painting was the fleurs de lis..","date":"2014-12-11","mins":"7:47 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-38941","author":"john_klotz","post":"I am little concerned about the commercialization of the Shroud (says he who is working on a manuscript). But if you accept that the Shroud is authentic (spoiler alert: I do) than selling an Apple app becomes problematical in my opinion. It limits access to those who can pay for app and then, as I understand it, Apple charges for downloading???? Does “simony” still mean something..","date":"2013-07-12","mins":"2:14 pm","url":"https://shroudstory.com/2013/07/10/catholic-mom-75000-people-using-hal9000-images/","cat":"news_&_views","title":"Catholic Mom: 75,000 People Using HAL9000 Images"},{"id":"comment-22510","author":"john_klotz","post":"Can you tell me briefly the facts you rely on to dispute Aragonite issue? Ganriel, I do not know your professional background, but every day in courtrooms in the United State people are convicted of crimes on the bases of circumstantial evidence. We do not order our lives by proof beyond a reasonable doubt. I would like to know the facts upon which you base your opinion. Mine include scientific examination of the aragonite and charts indicating matching spectra.between Jerusalem and the Shroud. Do you have any aragonite spectra from other than Jerusalem to compare? And what are the locations??.","date":"2013-01-24","mins":"8:06 am","url":"https://shroudstory.com/2013/01/24/a-most-avuncular-posting/","cat":"image_theory","title":"A most avuncular posting"},{"id":"comment-22520","author":"john_klotz","post":"I have the BAR article and it contained charts. Also, Wilson published then in his 2010 book, the Shroud. Setti Levis used a scanning ion microprobe with which the wavelengths emitted by the two different samples could be readily compared. Ian Wilson (2010 03 20). The Shroud (Kindle Location 1401). Transworld Digital. Kindle Edition. I may have overstated about the uniqueness of the aragonite to Jerusalem except that it is there and it’s not everywhere. But its on the sole of a foot, his knee and nose and that is compatible with the story of his falling while carrying the cross. What are the odds that a medieval forger would use aragonite dust on his masterpiece of fraud that just happened to match the aragonite in Jerusalem. The point of circumstantial evidence is that no single item may determine the issue but an accumulation of circumstances can lead to a virtually unerring conclusion. I give you quotations I use from Richard Dawkins, the “Atheist Pope” in my manuscript: As a result, Dawkins finds more reliable are inferences drawn from facts; in contrast to the dictionary, he places little weight in eyewitness testimony. “The dictionary definition of a fact mentions ‘actual observation or authentic testimony, as opposed to what is merely inferred’ (emphasis added). The implied pejorative of that ‘merely’ is a bit of a cheek. Careful inference can be more reliable than ‘actual observation’, however strongly our intuition protests at admitting it.” Dawkins, Richard (2009 09 18). The Greatest Show on Earth (p. 15). Free Press. Kindle Edition. Given the fact that in his study of evolution, Dawkins most often deals with ancient artifacts, and there is a paucity of other evidence available other than the artifacts, it makes sense. “Obviously, the vast majority of evolutionary change is invisible to direct eye witness observation. Most of it happened before we were born, and in any case it is usually too slow to be seen during an individual’s lifetime. The same is true of the relentless pulling apart of Africa and South America, which occurs, as we shall see in Chapter 9, too slowly for us to notice. With evolution, as with continental drift, inference after the event is all that is available to us, for the obvious reason that we don’t exist until after the event.” Dawkins, Richard (2009 09 18) (pp. 15 16). Free Press. Kindle Edition. Then, Dawkins goes on to make an intriguing analogy: “We are like detectives who come on the scene after a crime has been committed. The murderer’s actions have vanished into the past. The detective has no hope of witnessing the actual crime with his own eyes. In any case, the gorilla suit experiment and others of its kind have taught us to mistrust our own eyes. What the detective does have is traces that remain, and there is a great deal to trust there. There are footprints, fingerprints (and nowadays DNA fingerprints too), bloodstains, letters, diaries. The world is the way the world should be if this and this history, but not that and that history, led up to the present.” Dawkins, Richard (2009 09 18). The Greatest Show on Earth (p. 16). Free Press. Kindle Edition. Like a stopped watch, Dawkins is right a couple of times a day – maybe..","date":"2013-01-24","mins":"9:08 am","url":"https://shroudstory.com/2013/01/24/a-most-avuncular-posting/","cat":"image_theory","title":"A most avuncular posting"},{"id":"comment-22528","author":"john_klotz","post":"I really do not believe it appropriate to attack someone’s published work in the BAR and then say you can’t publish the source. Is your private source going to publish? I’d really like to see it. However, this I believe we do know: the man in the Shroud had dirt on the sole of an exposed foot, on his knee and on his nose. It’s been identified as aragonite by “scanning ion microprobe.” Even if it wasn’t aragonite, the dirt locations originally revealed by spectographic analysis are compatible with a fall (that’s compatible with my experienced walking my dog). Perhaps your unidentified source could comment on the charts as published in Wilson’s book. By the way, for the record, the late John Heller reported on the dirt findings in his book Report on the Shroud of Turin written very fresh after the STURP analysis and published in 1983. Heller was not in Turin but was a member of STURP and investigated thoroughly what happened there..","date":"2013-01-24","mins":"9:53 am","url":"https://shroudstory.com/2013/01/24/a-most-avuncular-posting/","cat":"image_theory","title":"A most avuncular posting"},{"id":"comment-22538","author":"john_klotz","post":"Do you have any information to indicate that either Witowski or Setti Levi are unreliable or disreputable individuals? These individuals have come forward and put their name on their work. Wilson has published their chart. What information do you have to indicate these people are less than truthful?.","date":"2013-01-24","mins":"11:26 am","url":"https://shroudstory.com/2013/01/24/a-most-avuncular-posting/","cat":"image_theory","title":"A most avuncular posting"},{"id":"comment-32891","author":"john_klotz","post":"Okay, so he did a bust. Now for the whole torso, front and back and a cap, not a medieval crown , of thorns. Oh, and how many minute wounds from a Roman whip was that? And don’t forget the blood with the bilirubin of a tortured man mixed in. And the scraped nose and knee. Musn’t leave them out. Are those cheeks swollen unequally as on the Shroud? Give me a break. No forger of medieval, or modern times, could develop the model from which to engage in the process described. The model itself would have been a great work of art if such coulld have been created. But the medical knowledge to even approximate the Shroud detail lay five or six centuries in the future in 1350 CE. Thise who are skepitical of the shroud are pseudo skeptics and the tea pot science they espouse is pseudo science..","date":"2013-05-04","mins":"1:04 pm","url":"https://shroudstory.com/2013/05/04/a-mysterious-work-of-art/","cat":"image_theory","title":"A mysterious work of art?"},{"id":"comment-171706","author":"john_klotz","post":"Just one thought on why there are so few double images copies of the Shroud. I do not think I am the first to point out that the image of the back of Christ contains literally his naked “backside.” That and the fact a double image is twice as long and unwieldy as single representation of the front side made it both practical and modest to simply recreate the front side. To some in medieval times, it not most, Christ’s naked buttocks would be a scandal. Indeed, David Rolfe lost a promised $100,000 in financing for the post production costs of “Silent Witness” when he refused to show Christ on the cross with a modest loin cloth. At that was 1978, not 1352..","date":"2014-11-17","mins":"7:55 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-171542","author":"john_klotz","post":"Dan, While I appreciate your comments on Occam’s razor posted earlier (see e.g. Quantum theory) along comes Colin to make the opposite point. His complex theories and speculations all dance around a point he is beginning to prove but can not accept: the Shroud is authentic. Authenticity really is the simplest solution..","date":"2014-11-16","mins":"6:09 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-171855","author":"john_klotz","post":"Hugh, On the Shroud itself, you know that thing in Turin, there are burn holes. On the Ventral image (front) there three holes on the left as viewed and four on the right. Coincidence? Come one. Get real and stop searching frantically for theories that disprove authenticity. Some day, I would like to see a simple acknowledgment that something does indicate authenticity. Is this similarity conclusive? Of course not. But is it another circumstance pointing in admittedly oblique way o the existence of the Shroud as a model.\\? To quote the former governor of Alaska: “You betcha.”.","date":"2014-11-18","mins":"6:44 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-171567","author":"john_klotz","post":"Your problem Charles, is you regard the Shroud as something subject to an art historian’s analysis. The only thing that an art history can truly conclude is that there is no existing precedent for the Shroud discernible in art history. Despite repeated challenges you have not produced a single existing work of art dating to medieval times which comes within a “country mile” (forgive my Americanism) of the Shroud.The reason is that science has demonstrated that it is not a work of art. As long as you stand on a pedestal proclaiming your art historian credentials without taking a serious examination of the science – and showing just a tad respect for qualified scientists like Ray Rogers and John Brown, then your opinions are worthless. The issue of the Shroud’s authenticity passed beyond an art history’s purview into the realm of physics decades ago..","date":"2014-11-16","mins":"8:46 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-203339","author":"john_klotz","post":"I have a new posting: The Pope, the Apocalypse and the Shroud which may be in point. Http://quantumchrist jck.blogspot.com/ (It’s free!!).","date":"2015-06-23","mins":"6:39 am","url":"https://shroudstory.com/2015/06/23/a-shameless-plug/","cat":"image_theory","title":"A Shameless Plug"},{"id":"comment-23325","author":"john_klotz","post":"David, If you lay off the name calling, you are really pretty good. I am beginning to define God as the primordial consciousness. Teilhard describes the process of evolution and marks the emergence of humanity as that point when our species acquired the power of reflection or self consciousness. We are oon a journey from the Alpha to the Omega – and back..","date":"2013-02-03","mins":"2:53 pm","url":"https://shroudstory.com/2013/02/03/be-sure-to-read-the-comment-by-thibault-heimburger/","cat":"image_theory","title":"Be sure to read the comment by Thibault Heimburger"},{"id":"comment-23338","author":"john_klotz","post":"David R. And I agree, but I certainly am curious about whether you are reading an expurgated version of he Gospel of John. My Confraternity Edition of the New Testament, that the good Brothers at CBA made me pay a buck for in 1950, begins the Gospel of St. John as follows: 1 “In the beginning was the Word, and the Word was with God; and the Word was God. 2 “He was in the beginning with God. 3 “All things were made through him, and without him was made nothing that was made.” I do believe that it makes perfectly clear at least from John’s perspective that Word is involved in the creation of the Universe. The Incarnation of the Word as a human came later. Except perhaps for Psalm of course: “Before the Day star I begot thee.” Ancients probably read that as the Sun. I read it as the Big Bang. It is not until the 14th verse of John, after a digression on John the Baptist, that we read “and the Word was made flesh.” I want to emphasize that quantum mechanics is knocking on the door of this mystery. Scientists now write of a quantum fluctuation creating by (or being) a singularity that began the Universe and the resultant the laws of physics that govern “our” universe and empowered the evolution of life. It was a close thing and the Universe at its creation was at the Big Bang was in fact finely tuned to support its existence and to ultimately evolve life and ultimately evolve consciousness. This is not an argument for Intelligent Design as advanced by some fundamentalists. It grander than that..","date":"2013-02-03","mins":"4:56 pm","url":"https://shroudstory.com/2013/02/03/be-sure-to-read-the-comment-by-thibault-heimburger/","cat":"image_theory","title":"Be sure to read the comment by Thibault Heimburger"},{"id":"comment-23306","author":"john_klotz","post":"What a beautiful simplistic world the skeptic lives in. Stupid is a judgment. Some circumstances it may be called for: “The Grand Canyon is an artifact of Noah’s flood.” That’s stupid. In others, not so much. How about there was a man named Jesus who was crucified by Pontius Pilate, buried, and before the third day his body disappeared from his tomb. Stupid is refusing to admit the possibility let alone historical probability of that statement. There exists a linen cloth that bears evidence of just such a scenario. Stupid is claiming that fact is false and that the person believing it is stupid. You may disagree, but it is not stupid to believe that. In fact it is in accord with scientific evidence – a quarter of a million hours or so of research. Stupidity is blindness. You can dispute any fact you want. But before you call somebody “stupid” you better have your facts straight. Colin Berry’s unproven speculations may not, or may be, correct. However, it is not stupid to refuse to accept them as facts. The fact is, that neither Colin nor any other skeptic has come within a country mile of explaining, much less duplicating, the image on the Shroud. Is there blood on the Shroud?Yes, that’s a scientific fact. Was the man on the Shroud in a state of rigor mortis? Most, if not all, the forensic pathologist who have reviewed the evidence believe that is true. Is there any evidence of putrefication of the body? Again, the overwhelming consensus is that there is none. Maybe you disagree with these scientifically reported facts because they challenge your core belief hat there is no God and there was no Jesus. Okay, but it isn’t stupid to reach a contrary result. It is stupid to call those who disagree with you, stupid..","date":"2013-02-03","mins":"8:29 am","url":"https://shroudstory.com/2013/02/03/be-sure-to-read-the-comment-by-thibault-heimburger/","cat":"image_theory","title":"Be sure to read the comment by Thibault Heimburger"},{"id":"comment-23339","author":"john_klotz","post":"Thibault, If Colin wasn’t out for you, I’d worry..","date":"2013-02-03","mins":"4:59 pm","url":"https://shroudstory.com/2013/02/03/be-sure-to-read-the-comment-by-thibault-heimburger/","cat":"image_theory","title":"Be sure to read the comment by Thibault Heimburger"},{"id":"comment-23316","author":"john_klotz","post":"David, Excuse me if I am puzzled by your position and frankly have little time for it and will move on. Your critique initially seemed to espouse an agnostic/atheist position and blind reliance on science. Now you demure from being an atheist. I don’t get it and don’t have time for it..","date":"2013-02-03","mins":"12:26 pm","url":"https://shroudstory.com/2013/02/03/be-sure-to-read-the-comment-by-thibault-heimburger/","cat":"image_theory","title":"Be sure to read the comment by Thibault Heimburger"},{"id":"comment-20207","author":"john_klotz","post":"I have an inquiry. As we know the Shroud image is a negative. What is the observaton about the coins? It is a positive or negative image? I am not being cute. In trying to determine how the image was created, that’s a reasonable question. For example, the blood is a positive image on the Shroud. That marks the blood formation independent of the process that created the image. If there are coins, whether the images are negative or positive would be important..","date":"2012-12-11","mins":"10:18 am","url":"https://shroudstory.com/2012/12/11/coins-on-eyes-issue-again/","cat":"image_theory","title":"Coins on Eyes Issue Again"},{"id":"comment-198691","author":"john_klotz","post":"Is anyone keeping track of the number of final solutions that Colin has proposed?.","date":"2015-05-09","mins":"5:46 am","url":"https://shroudstory.com/2015/05/09/colin-berry-has-it-all-figured-out-sort-of-maybe/","cat":"image_theory","title":"Colin Berry Has It All Figured Out, Sort Of, Maybe"},{"id":"comment-170061","author":"john_klotz","post":"This has been an interesting thread, but maybe its time to reach for the Occam razor. Amid all the tumult an debate, I think that applying Occam’s razor, the simplest solution, requiring the fewest assumptions is that the Shroud is what it purports to be, the burial cloth of Jesus Christ. The ONLY contrary fact is the carbon dating to middle ages and that process has been thoroughly debunked. All the attempts to come up with another explanation are theories floating in mad air without substantial facts to the support them. That includes Mc Crone. The image is its own best proof of its authenticity. Now we have not painted but “smudged.” Can anyone point me to a Charles Freeman explanation of the serum halos around the blood that were not visualized until STURP in 1978?.","date":"2014-11-09","mins":"6:16 am","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-169818","author":"john_klotz","post":"Colin, You have a theory but is there any historical precedent or examples of your theory? Even if someone could create a fake Shroud using your theory, that would not prove that the Shroud is a fake. There is a rather famous case in American jurisprudence about a high State Department official Alger Hiss who passed on documents to the Soviets in the 1930’s. His wife retyped them on a Woodstock typewriter. There was expert witness that the documents which were retyped on a specific Woodstock typewriter owned by Hiss because of certain anomalies in the type faces. After Hiss was convicted, during the defense hired a typewriter expert, Martin Tytell to duplicate the typewriter with the same tell tale anomalies. It took two years but he finally did it. Except the evidence was rejected. The fact that the government could have created a fake Woodstock didn’t mean the government did create a fake Woodstock. Assume you are right, that someone could have used the method you suggest. That doesn’t mean that someone did use it. And you still have not solved the whole issue of the blood stains. You may believe that the authenticity of the Shroud has not been proven, but to prove it was inauthentic requires something more than proof it might have been faked. Of course that’s where the carbon dating comes in. If you accept that, then it’s clear that the Shroud is a fake. But, I believe that the carbon dating has been impeached and assigned to the “dust bin of history.” Hiss partisans will know where that quote comes from. I am not, and never have been, a Hiss partisan. Known a few though, including the late Martin Tytell..","date":"2014-11-08","mins":"6:59 am","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-169845","author":"john_klotz","post":"Louis, Thanks for the cite. A superb interview..","date":"2014-11-08","mins":"8:13 am","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-200756","author":"john_klotz","post":"To paraphrase the Momma of the esteemed philosopher Forest Gump: stoopid is as stoopid does. I am in awe of Colin’s incredible arrogance. He expects to make a point by calling all those who disagree with him “stoopid”? Stop calling people and ideas you disagree with names, Colin. Anyone who has studied even Freshman rhetoric knows it one of the oldest logical fallacies: the ad hominem attack. Stupid is as stupid does. John Heller had Albert Einstein as an advisor when he was a college student. Were they both stoopid? Who advised you in college Colin: Walt Disney? Maybe I missed his point, but if so the subtlety escaped me..","date":"2015-06-01","mins":"5:09 am","url":"https://shroudstory.com/2015/06/01/colin-berry-its-the-negative-image-with-3d-properties-stoopid/","cat":"image_theory","title":"Colin Berry:  It’s the negative image with 3D properties, stoopid"},{"id":"comment-199959","author":"john_klotz","post":"I am not sure which way this cuts (no pun intended) but remember that the pathologists agree that the body was in a state of rigor mortis at the time of the image formation (and assumedly from the time of death to that point at least.) That would mean that his chest cavity was elevated at an angle (slumping forward while on the cross would be an elevation when laid out in the horizontal.. Post mortem blood flows would mimic that after rigor mortis set in. There are illustrations of that I haven’t got the time to dig up right now. Maybe somebody might have one at their fingertips. (originally posted on Blind Men thread).","date":"2015-05-23","mins":"7:11 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-200233","author":"john_klotz","post":"The above was addressed to Thomas.","date":"2015-05-26","mins":"6:48 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-200232","author":"john_klotz","post":"Have you connected any experiments demonstrating your idea of why those differences occurred? Do you have any calculations of image density variations or are you relying ion your visual observations? Which photographs of the Shroud are you relying on? Have you ever met anybody with bushy eyebrows? Have you ever measured a hair that had no dimension of thickness?.","date":"2015-05-26","mins":"6:47 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199336","author":"john_klotz","post":"I am amazed at the incredible expertise of Colin. Who’d have thought that not only is he a world renowned physicist, he a forensic pathologist skillfully deflating those pathologist dolts who examined the Shroud image with the meager combined experience of many thousands of autopsies. I am in awe..","date":"2015-05-17","mins":"6:32 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199435","author":"john_klotz","post":"Daveb makes an excellent point about scientists. They may disagree on details and sometimes “pride” results in derogatory comments about their colleagues. Therefore while there is general agreement about 95% of the pathological findings, that doesn’t prevent a little debunking about minutiae. One example is Zugibe’s coming up with a fine tuned explanation of the manner in which crucifixion cause death that differed from his colleagues. Perhaps he and Bucklin are debating this heaven even as we write. : ).","date":"2015-05-18","mins":"6:23 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199337","author":"john_klotz","post":"Typo correction: I am in awe [of his arrogance]..","date":"2015-05-17","mins":"6:39 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199377","author":"john_klotz","post":"DAVE, I would like to have a discussion with you. Please E Mail me at klotzlaw@gmail.com.","date":"2015-05-17","mins":"7:43 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199512","author":"john_klotz","post":"David, You flunk on your first point. As far as the history of medicine is concerned, the Shroud image exhibits attributes that could not possibly have been know to a medieval forger. That’s not my opinion, it is the conclusion of scientists who have examined the image in depth. You see David, my book as over 500 footnotes and includes citations to many sources. It includes an Appendix of sources which includes the writings of skeptics and well as supporters of authenticity. The available results of expert examinations of the Shroud are staggering. Are you a medical historian? I would bet you dollars (or pounds) to donuts that medical history is covered in the curriculum of any medical school that is not a diploma mill. Among other things one can bet they study Galen. Have you ever studied Galen? Please cite the texts or trade book on medical history that support you positions and deal with an actual physical examination of the Shroud or a detailed examination of the high resolution photographs of the Shroud. By the way there is one forensic pathologist who tried to cast doubt on the Shroud blood flows but it appears he only examined pictures in a magazine and it is not revealed how much study he did of the history of crucifixion before he gave his opinion. I believe it was zero. The relationship of the blood flows to the crucifixion process is one of the matters that the forensic pathologists who have published discussed in detail..","date":"2015-05-19","mins":"7:11 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-207555","author":"john_klotz","post":"Is it really science to claim that the Resurrection is outside of science thus any explanation involving the Resurrection must ipso facto be discarded? That not’s science that’s agnostic bias or atheistic predisposition. Assume arguendo that the resurrection event was a transfer of the body into another dimension or universe. It would probably make sense than that the body traveled both up and down simultaneously AS WE WOULD PERCEIVE IT. In the final analysis, Piczek’s description of the the Shroud being an event horizon may just be the best description or metaphor for what happened..","date":"2015-08-06","mins":"6:55 am","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-207564","author":"john_klotz","post":"A prediction. Science constrained as you describe it will NEVER explain the image on the Shroud. It’s been trying for 117 years and has come up empty..","date":"2015-08-06","mins":"8:03 am","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-207887","author":"john_klotz","post":"Louis. I tend to accept the case for the Mandylion and the Shroud being to separate objects. Jack Marquadt made a very persuasive argument on that at the St. Louis conference. Also, the Mandylion appears to have disappeared during the French Revolution which was four centuries after the Shroud was displayed in Lirey. There was no secret how the Mandylion came to Sainte Chappelle, Louis IX purchased it..","date":"2015-08-10","mins":"1:35 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-52470","author":"john_klotz","post":"Actually Colin, the analogy between the JFK assassination and the Shroud, is the manner in which the mainstream press attacked, and still attack, those who believe that LHO was not a lone gunmen. The fact is that the Shroud is continually debunked by reference to the carbon 14 teats which have considerably less credibility than the magic bullet theory. The US media and government circles can not cope with the fact that a conspiracy was involved in JFK’s murder (and the conspirators nearly got what they wanted, an invasion of Cuba, I believe) Johnson frustrated them on that, Johnson resisted the hawks about Cuba but he gave them Vietnam. The order to begin planning pulling out of Vietnam had already been drafted for Kennedy’s signature There are two possibly apocryphal quotations. LBJ, the “peace” candidate in 1964: “I’ll give them their damn war, but first I have to be elected.” JCK a month before the assassination: “I’ll pull out of Vietnam, but first I have to get elected.”(I “JFK and the Unspeakable” 20 years ago I did a lengthy Op Ed for Newsday which was picked up by the Washington Post news wire. I was optimistic hat the collapse of the Warren Commission story would pave the way for a hard look at the assassination. I was wrong. Http://www.johnklotz.com/new jfk.htm.","date":"2013-11-23","mins":"12:36 am","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","title":"First Annual Bertrand Russell Award in Sindonology"},{"id":"comment-11385","author":"john_klotz","post":"My emotion in viewing this image is the same as when I first realized the view of the scourge marks and the Passion was more real for me than it had ever been. This is truly a magnificent accomplishment..","date":"2012-05-16","mins":"8:07 am","url":"https://shroudstory.com/2012/05/16/impressive-3d-color-images-of-the-shroud-of-turin-on-french-website/","cat":"image_theory","title":"Impressive 3D Color Images of the Shroud of Turin on French Website"},{"id":"comment-200766","author":"john_klotz","post":"It is absolutely amazing the way the pseudo skeptics swallowinq whole any din bat, unathenticated theory as long as it “proves” the Shroud a fake. As I understand the Freeman position as reported uin the article uoted: all iot will take is for the vtican to authprixze tests diretd towrds hi one theory to solve the whole mu=ystery. All it would take for a pig to fly is for it to sprout wings. I am still waiting for an identification of the existence in present time of an “art object” that has the physical properties of the Shroud mimicked to the molecular and the atomic level..","date":"2015-06-01","mins":"6:49 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?"},{"id":"comment-200767","author":"john_klotz","post":"Typos dinbat = dingbat vtican = Vatican authprixze = authorize mu=ystery = mystery I can’t believe I am over caffeinated this early in the morning..","date":"2015-06-01","mins":"6:52 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?"},{"id":"comment-17480","author":"john_klotz","post":"I think the takeaway is this: If Freeman thinks it is unfair to challenge Dawkins without full access to the Shroud etc., how is it he can so blithely opine on the Shroud without the same?.","date":"2012-10-11","mins":"9:17 am","url":"https://shroudstory.com/2012/10/11/it-is-thus-but-may-not-berichard-dawkins-should-ignore-the-challenge/","cat":"image_theory","title":"It is thus but may not be–Richard Dawkins should ignore the challenge"},{"id":"comment-200770","author":"john_klotz","post":"Louis, You are presuming that Charles is an academic. Does he have an academic position?.","date":"2015-06-01","mins":"7:24 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?"},{"id":"comment-31497","author":"john_klotz","post":"Hugh, Thank you for your comment. I am not prepared to go much further into this at this time since I am dealing with the C 14 aspects and awaiting a copy of David Sox’s 1981 book. I already have his 1988 book. Sox played an interesting role in the C 14 process and instigated the C 14 labs to push STURP out (not that they needed much encouragement.) In any event, I find Adler’s account interesting. I think I learned something. But when it comes to a “natural” explanation of the image on fall back to Heller: “We do know, however, that there are thousands upon thousands of pieces of funerary linen going back two millennia before Christ and another huge number of linens of Coptic Christian burials. On none of these is there any image of any kind. A few have some blood and stains on them, but no image.” Heller, Report on the Shroud of Turin I do not believe that any image explanation advanced thus far employing a “natural” process can account for the resolution of the Shroud. Almost all of them would result in diffusion of some kind and that would have prevented the finely detailed image. I will be returning to this issue. What I am “playing” with is this concept: If you apply Occam’s razor, you may discover that the simplest explanation is the Resurrection. To simply reject it, is perhaps what Richard Dawkins has dubbed “an Argument from Personal Incredulity:” Just because you can’t believe it doesn’t mean it isn’t so. Of course, he wouldn’t admit its application in this regard. See Dawkins, Richard (2008 01 16). The God Delusion (p. 155). Houghton Mifflin Harcourt. Kindle Edition..","date":"2013-04-21","mins":"7:17 pm","url":"https://shroudstory.com/2013/04/21/john-klotz-new-quantum-christ-blog/","cat":"image_theory","title":"John Klotz’ new Quantum Christ Blog"},{"id":"comment-58305","author":"john_klotz","post":"There is among those who have studied a the Shroud a fallacious intellectual modesty. We do not order our lives by reasonable doubt, but I believe the doubt as to the Shroud’s authenticity and the Resurrection is arguably unreasonable. Faith not founded on fact is not faith but superstition. That’s fighting words to some. Similarly, skepticism not founded on fact is not true skepticism but pseudo skepticism. The atheist and the agnostic reject the possibility of Resurrection, but the Resurrection is, or is not, a fact. The faith that the Resurrection is real is founded on facts as reported in five written accounts and in the sudden transformation of a group of cowering disciples who became inflamed with great courage unto death. And then there is the Shroud of Turin. Is the evidence circumstantial: yes. But other than the unprecedented nature of the event what is the proof that it did not happen. The Universe was created when a incredibly tiny “singularity” blossomed into a tiny bit of matter of incredible, virtually immeasurable heat and began the expansion that we are still experiencing to date. Anybody witness that? Where’s the proof? Does any one have the power to repeat it? Yet most educated humans and scientists now accept it as a fact. I certainly do. The Shroud of Turin is a fact. I believe it’s authenticity has been established as a fact and that authenticity is as the burial cloth of a person whose existence is an historical fact. There are some fundamentalist and even some not so fundamentalist who still protest to faith that is not science and therefore believe on faith. If that comforts you, that’s fine. But the time as come to understand that science and religion are no longer running on parallel courses. The issues science is grappling with including, inter alia, the nature of human conscience are religious issues. A reporter for Rolling Stone who covered the STURP team in Turin in 1978 wrote that apart from proposed carbon dating, there was as much room for doubt as to the authenticity of the Shroud as there was on a “crowded microdot.” And he rejected Christ’s divinity. That was before the STURP team published its results and before the C14 fiasco. There is no substantial evidence that the Shroud is a forgery and there is no evidence of any kind that it was other than the burial cloth of Jesus,we call Christ. The microdot is even more crowded today..","date":"2013-12-12","mins":"6:42 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-31517","author":"john_klotz","post":"Hugh, I happen to believe that all things are natural, even the primordial consciousness we call God. We attach words like “paranormal” to events we do not understand and comprehend. Because an event is singular does not mean it is “unnatural.” And I would frankly demur from your description of the Resurrection as more complicated than fraud. Fraud can be a very complex event. Exhibit Number One might be the Redford Newman movie “The Sting.” The Not so Right Rev. David Sox referred to the Shroud as “greatest forgery of all time.” If it were a forgery he would be close to correct. The intricate details of the Shroud and its complex imagery were beyond the capabilities of any forger at any time of history. The non Resurrection hypotheses of image formation, given the very special time frame involved, all falter on the same fine points because no one has proposed a workable theory that doesn’t involve a process of image diffusion, and the image is too fine for diffusion to have occurred. If I am wrong, show me a sharply defined image that arose on a burial cloth within 48 hours of death. Of course, I am begging a very important question: What is the Resurrection?.","date":"2013-04-22","mins":"10:39 am","url":"https://shroudstory.com/2013/04/21/john-klotz-new-quantum-christ-blog/","cat":"image_theory","title":"John Klotz’ new Quantum Christ Blog"},{"id":"comment-58347","author":"john_klotz","post":"Charles, The second part of my book will explore the issues raised in a piece I blogged sometime ago: http://johnklotz.blogspot.com/2012/08/michael redux quantum mechanics.html.","date":"2013-12-12","mins":"8:11 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-58522","author":"john_klotz","post":"Michael, Pope Benedict that well known radical has written about Genesis as allegory and expressed concern about the doctrine of original sin. At least one Catholic academic has called original sin original selfishness which was one of the driving forces of evolution. Science has much to teach us. Just as we have to “put aside childish things” as we mature, we have to come to grips with actual, not allegorical history. I do not fear for either the Church or Christ. Becsue where science is heading whether it realizes it or not is the universal creative power of love. Yup, I wrote love. By the way, my screen is distintegrtaing before my very eyes so I hope this transmits well..","date":"2013-12-12","mins":"5:06 pm","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-58308","author":"john_klotz","post":"Correction: We do not order our lives by PROOF BEYOND reasonable doubt..","date":"2013-12-12","mins":"6:47 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-58827","author":"john_klotz","post":"Correction: original scene – original sin.","date":"2013-12-13","mins":"9:54 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-58834","author":"john_klotz","post":"Michael, I agree with you but unlike others, I believe that science will one day explain the image but it will be a day when it recognizes the fact of Resurrection. So much of what we j know today was previously explained by superstitions that science put aside. The volcano did not rfruupt because the volcano god was angry. Science is pushing the envelope when it studies human consciousness and finds itself looking at quantum process (as some do). Hameroff uses quantum entanglement or action at a distance to theorize near death experiences. The best may be yet to come. Make that is to come..","date":"2013-12-13","mins":"10:07 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-58333","author":"john_klotz","post":"Another correction: “human conscience” = human self consciousness.","date":"2013-12-12","mins":"7:40 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-58861","author":"john_klotz","post":"Louis, I assume you are referring to: “That humanity was not scarred by an original scene of eating forbidden fruit is in my mind a given. But that our human nature was corrupted by the selfish intrinsic in the evolutionary process is something I can accept.” There is a reference for that is currently on the web is http://americamagazine.org/issue/350/article/evolution evil and original sin Domning also wrote a book with his colleague the late Moinka K. Helwig:: Domning, Daryl and Hellwig, Monika K., Original Selfishness: Original Sin and Evil in the Light of Evolution (Ashgate, 2006);.","date":"2013-12-13","mins":"11:20 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-58824","author":"john_klotz","post":"Louis, I am not sure where you are coming down on this. One thing Benedict did was reference the work of Teilhard which had been banned by the Church under Pius XII. I think the story of creation Evolution to be a glorious one. Sometimes we limit the power of the Creator by reading Scripture too literally when so much of it is allegory or metaphor. That humanity was not scarred by an original scene of eating forbidden fruit is in my mind a given. But that our human nature was corrupted by the selfish intrinsic in the evolutionary process is something I can accept. This is speculative metaphor, but perhaps it as if selfishness was the mold from which life evolved and when it came to humanity the mold had to be smashed. Christ was the Good Shepherd who laid down his life for his sheep. To do so as an a the ultimate act of love. No greater love has anyone than he lay down his life for another. The Resurrection is the promise that sacrificing selfishness for love is not the way of death but ultimately eternal life..","date":"2013-12-13","mins":"9:53 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-58328","author":"john_klotz","post":"Charles, Doubt as to facts must itself be based on facts. I approach the proof of facts as someone schooled in law. Even Richard Dawkins accepts, even advances, proof by circumstantial evidence. The issue is when does the burden of proof change. When proven facts lead to a conclusion, to rebut that conclusion, you need proven contrary facts. Of course, you may reject some facts has unproven. However, save for the C14 tests which have been rebutted conclusively IMVHO (in my very humble opinion expressed as irony) there are no other facts except the argument that Dawkins scoffs at: Argument from Incredulousness. I am trying to get the first and by far longest part of my manuscript concluded, at the outside by Christmas. Then comes the second, shorter part: Christ and the Quantum. By Ash Wednesday perhaps I’ll be ready for at least Kindle, Nook or other E Book formats. Then will the fur fly (hopefully). Now I have to run to a required CLE course so that I can continue my registration as an attorney in NYS – probably for the last time..","date":"2013-12-12","mins":"7:26 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-58949","author":"john_klotz","post":"Louis, When the issue is the Resurrection, anything said today is speculation but the issue is whether the speculation is grounded in facts or just a stab in the dark. We have two great mysteries: the nature of the image of the Shroud and the Resurrection. Because I believe that the facts establish the authenticity of the Shroud, I do not believe it’s a stab in the dark to hypothesize that the two mysteries are related. It’s a reasonable hypothesis – if you accept the possibility of Resurrection. When Hameroff hypothesizes that that human consciousness is created by the microtubules of the brain function through a quantum phenomenon, and that explains near death experiences then how many steps away are we to hypothesizing the Resurrection?.","date":"2013-12-13","mins":"2:27 pm","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-27967","author":"john_klotz","post":"Continued I am such a klutz, I launched prematurely. My conclusion, not yet proven or capable of proof, perhaps for now, is that through the Shroud of Turin, primordial consciousness is communicating with us. While I do not ascribe to the bible as history fundamentalism, I am struck by the reference to light in both Genesis and John. My thoughts are an “educated” speculation not capable of scientific proof. Not yet anyway, but tomorrow?.","date":"2013-03-21","mins":"7:36 am","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","title":"Of laser like light and scorching"},{"id":"comment-27964","author":"john_klotz","post":"Dan, I really can’t say I am on a different wavelength or not. I believe there is place where existence interfaces with the God, I refer too as the primordial self consciousness from existence as we know it sprang..","date":"2013-03-21","mins":"7:17 am","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","title":"Of laser like light and scorching"},{"id":"comment-27968","author":"john_klotz","post":"Max, That does not explain the image which is unique in history. There is no artifact from any burial is any period which as produced such an image with such exquisite detail. Surviving blood stains, yes. Surviving detailed image: No. If I am wrong, and I am sincere in this request, cite me an example and any reference to the same hat I can check..","date":"2013-03-21","mins":"7:41 am","url":"https://shroudstory.com/2013/03/21/of-laser-like-light-and-scorching/","cat":"image_theory","title":"Of laser like light and scorching"},{"id":"comment-49094","author":"john_klotz","post":"Hugh, I really don’t think I have any dispute with this. I do accept Rogers work on the age issue but the issue of image formation process is wide open. Where I have trouble is people who object to the process being “natural.” The self conscious entity from which our existence sprang and which we call God, was the first naturalist. Go back far enough, everything is natural. Resurrection is beyond our experience, so it is disdained as unnatural. I think it’s simply unique. But that uniqueness holds out a promise to all of “woman born.” (I still haven’t gotten over the imaginative production of Mac Beth I saw Sunday.) My belief is that the Shroud is a finger print of the primordial consciousness..","date":"2013-10-29","mins":"7:39 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49053","author":"john_klotz","post":"Paulette, Why is everyone so afraid of some process involving resurrection causing the image? Such a process would be “natural.” For all the averting of our glances from the Resurrection, the fact remains that the Shroud is without historical precedent or antecedent. So is the Resurrection. I hate to keep beating the Abramoff drum, but if our consciousness is a quantum function and the brain functions through action at a distance quantum entanglement and at death, as Abramoff theorizes, the quantum information of our brain is discharged (reunited) with the quantum information of universe, than what’s the big deal with Resurrection? Of course there ares several steps in what I just wrote BUT each one of the steps is a question that at least some scientists are dealing with today. Scattered about the scientific landscape like a child’s collection of Legos the elements of science approaching these problems. The problem is putting them together. The basic theories that Abramoff is espousing came from work he did with Nobel prize winning physicist Sir Roger Penrose. Penrose doesn’t carry the ideas as far as Abramoff but he partnered with Abramoff has they started down the trail. This brothers and sisters, this is not woo woo. It isn’t pseudo science. To paraphrase Churchill it isn’t the end of the trail, nor is it even the beginning of the end. It is the the walk from the parking lot to the beginning. Alas, too many minds have stayed in the car in parking lot and rolled up the windows lest the bears come for them and disturb their comfortable agnosticism or atheism that demands nothing and justifies everything. Dawkins it is reported defending pederasty in English boarding schools, for example. There may be risks but the trail is there, not altogether clearly marked but promising an exhilarating trek. Roll down the windows, get out of the car and get moving..","date":"2013-10-28","mins":"9:26 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-48975","author":"john_klotz","post":"Colin, Disappointed you caught your typo. We could have needled you on that for years. : ) However, as to your “bas relief” theory, I would merely paraphrase that renowned Englishman Ebeneezer Scrooge: “Bas relief? Bah, humbug.” What you are proposing is not a bas relief of a head but a bas relief o an entire body, front and back; a bas relief that is accurate to extremely minute details. One that would be five – six feet tall give or take. It never happened. Can you point to any bas relief that is comparable at any time in art history? Could Charles Freeman? The creator of the bas relief would have been not only been one of the greatest artists of human history but one of its greatest, way ahead of his (or her) time, forensic pathologists. Centuries of progress in medicine would have been short circuited. The image of the Shroud is of a real human body of someone who was tortured, scourged and crucified. And the image by any reasonable manner was created within 48 hours of his death. Those are facts. Any idea who it might have been? I am not sure you even deserve an “E” for effort. Strictly an “F” for fantasy. (If there any typos in this, as there are in many in my posts, I just wanted Colin to know, he is not alone). Love can make symbols real, but not fantasy. Would like to meet you and others in Ohio. Think about it. You could put faces on your antagonists. I promise not to jeer (God willing I can make it.) And has to charcoal, a piece of charcoal with a tip fine enough to create the details of the image doesn’t exist. Neither, by the way is there such a paint brush. Heller covers that in his book..","date":"2013-10-28","mins":"7:02 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-141418","author":"john_klotz","post":"Because Colin is a Brit (British with affection and respect, too bad about Yorktown) I choose to paraphrase Winston Churchill (the Brit, not the American historian) on Allied Victories n North Africa in WWII): STURP was not the end of the Scientific study of the Shroud, it wasn’t even the beginning of the end, it was the beginning of new era of Shroud research. I think we can all agree that Shroud science began with the Pia photographs. That first published scientific study of the Shroud was Paul Vignon’s 1902 book on the Shroud that was translated into English. I think it is fair to say, that it culminated in STURP’s 120 hours of scientific examination of the Shroud in Turin in 1978. The scientific tests used by the Shroud team and by scientists in the aftermath (cf Heller and Adler) were in fact based on the advances of quantum mechanics. For example, that certain aspects of the Shroud are fluorescent when bombarded by certain wave lengths of light that the object being bombarded discharges light of a certain wave length. The image itself is not fluorescent. Heller and Adler used an early microscopic digital image analyzer. It was, if you were read their work, a very exacting process, dependent on the use of tiny portions taken from the Shroud. There work occurred in the US on samples of Shroud fibriles taken during the 120 hours. Today, digital spectral imaging cameras can examine an artifact and if carefully controlled is absolutely non intrusive. A French firm was able to use one in the Louvre and unlock the original appearance of the Mona Lisa. An explanation of how they did it and the results can be found on t their web site: http://www.lumiere technology.com/ Unlike WWII, Scientific study of the Shroud will never end. So maybe it is better to think of STURP as not the end, the beginning of a new era. To look back 36 years at STURP and carp about what they were able to do in it’s remarkable 120 hours is well, as the Brit’s would say “a bit much.” What they accomploshed was ground breaking. It was clearly the beginning not of the end but a new ea which, hopefully will end only when humanity does. And then again, according to science that may be sooner, rather than later. “.","date":"2014-07-31","mins":"7:12 am","url":"https://shroudstory.com/2014/07/31/okay-maybe-i-shouldnt-have-used-the-word-significant/","cat":"image_theory","title":"Okay, maybe I shouldn’t have used the word ‘Significant’"},{"id":"comment-141419","author":"john_klotz","post":"PS, I am in perfect accord with Colin’s basic point: that it’s time for a new “STURP” team study of the Shroud,.","date":"2014-07-31","mins":"7:15 am","url":"https://shroudstory.com/2014/07/31/okay-maybe-i-shouldnt-have-used-the-word-significant/","cat":"image_theory","title":"Okay, maybe I shouldn’t have used the word ‘Significant’"},{"id":"comment-33862","author":"john_klotz","post":"When it comes to the Shroud, unlike Russell’s teapot we know it exists and the issue is: What kind of teapot.? That’s where Science comes in, or at least should come in. And it has. We not only know that the teapot exists but by analyzing the Shroud accross multiple disciplines, Science can state with some assurety that it is the image of a crucified man with woulds consistent with the New Testament and that the images was most likely created within 48 hours of death. That’s a lot of teapot. This teapot even has actual bloodstains. In all of human history, there is been reports of only one human being that matches those circumstnces. (Hint, his intials are JC). Some debate that he was not a human being; they are called Gnostics or Jansenists. It’s clear, that the man in the Shroud shed real blood. Is there doubt? Perhaps, but it is reasonable doubt? In a courtroom we would say the burden has shifted. The circumstances DEMONSTRATED BY SCIENCE allow a more than reasonable inference. All of the attempts to explain around the Shroud have failed. The skeptics have had more than a century now to produce their evidence and they have failed. Spare me the D’Arcis memorandum. That is hearsay on hearsay. In other words, not ebidence. Carbon dating? Let me quote Thomas de Wesellow: “The carbon dating of the Shroud will probably go down in history as one of the greatest fiascos in the history of science. It would make an excellent case study for any sociologist interested in exploring the ways in which science is affected by professional biases, prejudices and ambitions, not to mention religious (and irreligious) beliefs. ” Wesellow clains to be an agnostic and. Beacsue he is, he cameup with an imaginative explanation of the Resurrection. That’s a different debate. But yes, Bertrand Russell there is teapot and it is an ancient piece of linen in Turin, Italy. Sorry you never got to see it..","date":"2013-05-17","mins":"7:43 am","url":"https://shroudstory.com/2013/05/17/revisited-argumentum-ad-ignorantiam-mea-natibus/","cat":"image_theory","title":"Revisited:  Argumentum ad Ignorantiam, mea natibus?"},{"id":"comment-48992","author":"john_klotz","post":"Colin, Are you aware that some have claimed that the American President Abraham Lincoln displayed symptoms of Marfan’s Syndrome” It is the subject of some debate. Without sounding condescending or neo colonial (I have a Chinese Granddaughter who has brought joy to our family) “What has that [Zugbe’s diagnosis of Christ] have to do with the price of tea in China? By the way, Lincoln has been described as the greatest of American Presidents. He certainly was one of the greatest members of humanity to occupy the White House. Has Steven Spielberg’s “Lincoln” crossed the pond yet. I am reminded just now, searching for words to describe Lincoln (and having seen a new production of Mac Beth yesterday at Lincoln Center of Shakespeare’s)epitaph of Brutus (delivered by Mark Anthony) “He only, in a general honest thought And common good to all, made one of them. His life was gentle, and the elements So mix’d in him that Nature might stand up And say to all the world ‘This was a man!’:” Strange, but the more I think about, Jansenistes aside, those words might also apply to the Man in the Shroud..","date":"2013-10-28","mins":"10:40 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-196615","author":"john_klotz","post":"Rogers indicated that the mailiard reaction alone was not an answer to the issue of image formation. I wonder if the answer maybe quite simple. It was light. Originally the linen shroud was white. Agreed? Over the ages it darkened and the fading of the “image” is in part at least to a lost of contrast as the linen darkened. Am I wrong that one thing that can darken linen is light, just ordinary see it every day sunlight. Once as a child I toyed with developing photographs. They has to be “fixed” lest they faded. The impact of light on any object would depend on its chemical composition. Other times light might bleach a material. Sometimes it would darken, sometimes it could bleach. When the drawing called “La Bella Principessa” was subjected to Multispectral Digital Imaging (MDI) they had to use special lighting designed to prevent damaging the drawing. St. Paul’s claimed the appearance of Christ to him was in a bright blinding light. When it comes to the Shroud I am reminded of the Gospel of John: “And the light shines in the darkness and the darkness comprehended it not.”.","date":"2015-04-17","mins":"6:14 am","url":"https://shroudstory.com/2015/04/16/rogers-impurity-layer-and-di-lazzaros-experiments/","cat":"image_theory","title":"Rogers’ Impurity Layer and Di Lazzaro’s Experiments"},{"id":"comment-27639","author":"john_klotz","post":"Dear CB, Heller while an undergraduate at Yale, was advised by Einstein at Princeton. One or twice a year year he would travel from New Haven to Princeton to be counseled. In his book, Report on the Shroud of Turin (have you ever bothered to read it) he tells how he and Adler adopted the technique he learned from Einstein of the Gedenkenexperiment (thought experiment). Thinking the problem through as to what a forger must have known and done to create the Shroud, they concluded that it was not a forgery. Tell me CB, how many Nobel Prize winners mentored you while an undergraduate? They might have had a problem since you your head seems be permanently stuck where the sun don’t shine..","date":"2013-03-18","mins":"9:23 am","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","title":"Scorching Theory: Pseudoscience or Miracle?"},{"id":"comment-196627","author":"john_klotz","post":"Hugh, Isabel Piczek described the image as an “event horizon.” I have written that event horizon is an appropriate metaphor for death. Perhaps its more than a metaphor. According to St. Paul, Christ appeared to him in a bright light that blinded him. Then there is Christ’s warning to Mary Magdalene when he appeared to her outside the tomb Sunday morning. “Do not touch me.” I would be a fool to claim I have solved the mystery of the Resurrection but not a fool to point out the known circumstances of the image are consistent with the Resurrection – The body transforming or transporting into a different dimension or level of existence. The image which appears to have been created in a micro second (Rogers) would be the last instant before that transformation or transportation was complete. A literal event horizon becasue we can not today view or even comprehend where the the body went or how it was transformed. There are some who insist that science can never get to that point. I would suggest that the history of science particularly in the last two centuries has pushed the boundaries of science far beyond what was imagined previously. Evolution is one such but we know that the Darwin’s survival of the fittest is only a partial answer to the process of evolution. Someone was labeled my thoughts as Chardinian as in Pierre Teilhard de Chardin (I believe it was a compliment). I plead guilty for Teilhard envisioned a coalescence of science and faith both dependent on the other, both illuminating the other. What is the history science but an exploration and revelation of the wonder and magnificence of our existence; a journey that has not been concluded and may never end. I expect to be blogging on this in the near future for there is one thing I have concluded: that Shroud is authentic and what that means. Some may disagree..","date":"2015-04-17","mins":"8:12 am","url":"https://shroudstory.com/2015/04/16/rogers-impurity-layer-and-di-lazzaros-experiments/","cat":"image_theory","title":"Rogers’ Impurity Layer and Di Lazzaro’s Experiments"},{"id":"comment-27544","author":"john_klotz","post":"Andy, I do not believe that the “scorching” if that is the answer by any transfer method that we can presently establish with certainty although it certainly points a towards a process involved in the Resurrection. That’s what drives the pseudo skeptics to their inanities. On page 139 of his memoir (“Report on he Shroud of Turin”), John Heller made the following observation about Roger Gilbert’s presentation at Santa Barbara conference concerning the spectrometer findings: “There was too much information for us to digest at one sitting, but one fact did become clear: the color of the lightest scorch area was similar to the color of the images of the man. What his meant, I had no idea.” When I read in an article about the taking of the Shroud samples for C 14 testing, that the Turin authority objected to the bright lights because of the potential for damage to the Shroud, the thought occurred to me that a scorch by light may be a solution. Can light scorch? In the Boy Scouts we learned you could start a fire by using a magnifying glass to capture the sun’s rays. However, identifying the the image as akin to a scorch doesn’t answer the question, because any light based process doesn’t allow for the high definition of the image except one – the laser. OMG.","date":"2013-03-17","mins":"11:17 am","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","title":"Scorching Theory: Pseudoscience or Miracle?"},{"id":"comment-27542","author":"john_klotz","post":"There is one glaring historical error or assumption in CB’s latest screed. Now he ASSUMES that “its first recorded owner postponed display until he was safely beyond the reach of the hooded men with the hot tongs, the thumb screws, the hammered wedges, the finger/toe nail extractors, your bigger than average barbecue etc etc.” Would Colin care to enlighten is as to when the Inquisition ended? Before 1350? The Templars were safe to come out of hiding by then? It was blessed by the Church that the canons of Lirey could honor the relic of a man burned at the stake a scant four decades before. The objections to the Shroud from the hierarchy, in so far as their were objections was not that it was the relic of Jacques de Molay but that from the very beginning it was being pedaled as THE burial cloth of Christ. The claim that it was EVER anywhere publicly proclaimed to be a relic of de Molay and that a medallion was forged in his honor for public display is hog wash. No speculation please, names dates places documents connecting the Shroud to de Molay and that someone in 1350 who sought to honor a relic of de Molay would, among other things, be honored to carry the standard of the King of France into battle. I believe the fact is clear that after the King Phillip purge of the Templars, the Templars as Templars were not seen or heard from again. Unless you want to count the Masons who claimed to be their progeny. There was a youth organization in the Masons called the Order of de Molay that I first encountered in college when an acquaintance was wearing a lapel pin for that organization. That was circa 1956. (And it didn’t look a bit by like the Lirey Medallion, as I recall.) In fact, all I learned was that he was a martyr to the Catholic Church’s suppression of freedom. (My acquaintance’s words, not mine.) A pseudo skeptic is one who does not seek truth but merely to debunk anything that threatens his or her unshakable beliefs, a pseudo scientist is one who seeks to dress his prejudices and bias in a scientific veneer. A pseudo historian is one who engages in elaborate, inane speculation unfettered by facts. There now, I’ve wasted a good 25 minutes replying our pseudo skeptic scientist historian’s latest inanity..","date":"2013-03-17","mins":"10:52 am","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","title":"Scorching Theory: Pseudoscience or Miracle?"},{"id":"comment-171020","author":"john_klotz","post":"At some point, many of us will part company with fundamentalists who insist on the “inerrancy of scripture.” The extreme position are those that believe “creation” as set forth in Genesis occurred a scant 6,000 years ago, give or take a millennium. I find Genesis revealing and relevant not as history of creation but as the history of humanities grappling with the mystery of its own existence. Even St. Augustine regarded it as metaphor. As you advance through scripture from Genesis, however, it becomes clear that the metaphorical gets mixed in with actual historical events. Disentangling the metaphor from the actual history becomes a complex process. I think it is quite clear that the authors of the New Testament by and large did not believe they were writing metaphor but compiling history from pre existing traditions or lost original texts. If there is one thing an authentic Shroud does, it is to confirm in great detail, the four Gospel accounts of Christ’s death and point towards his Resurrection. However,we must be careful in our scriptural exegesis to not take wild assumptions and leaps of faith and disguise them as revealed truth. Some fundamentalists do that and the construction of “Jesus took the Shroud with him” is one of those constructs that is actually a theory. Added to the problem are the apocryphal writings that were rejected when the current canon of the New Testament took it present form. One example of biblical exegesis run wild are the recurring apocalyptic prophesies of impending doom. Some Christians at the end of the first millennium were convinced that 1000 AD [CE] would be the year of the Apocalypse. Repeated claims of Apocalypse have been made throughout history since that time. Of course, I must confess that I am now a believer in an approaching Apocalypse but it is based not on Scripture but science. The Apocalypse we face is not necessarily an act out of the blue of the judgment of God. It is the result of humanity’s selfishness. And there is one prophet of the Apocalypse of Selfishness that has been quite outspoken. He recently moved to Rome and his name is now Francis. ” If we destroy creation, creation will destroy us.”* *As quoted in Chapter 17 of the “Coming of the Quantum Christ.”.","date":"2014-11-13","mins":"6:55 am","url":"https://shroudstory.com/2014/11/13/something-colin-berry-wrote-this-morning-reminded-me-of-this/","cat":"image_theory","title":"Something Colin Berry wrote this morning reminded me of this"},{"id":"comment-34354","author":"john_klotz","post":"Maybe we should recognize that everything is “natural” but there are some things that we simply can not understand and that science can’t explain yet. Science has been creeping up on phenomena that have previosly been beyond our ability to rationalize. The sublime issue is the nature of our consciouness and does it have a capacity to function beyond time and space. If it is a quantum phenomena that it most likely does. The paranormal will ultimately be explained. In the meantime, I agree with the proposition that the simplest explanation of the Shroud image is the Resurrection. Some day, probably not in my life time, science will explain it. I am not kidding. See http://vimeo.com/39982578.","date":"2013-05-22","mins":"2:16 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-171846","author":"john_klotz","post":"Colin better be careful. Having decided that the Shroud is not a painting, he now advances new hypotheses, none of which ultimately make sense. Ultimately in the darkest recesses of his mind, an alien thought will take hold and he will resist this terrible idea until he is totally intellectual exhausted: the Shroud is authentic..","date":"2014-11-18","mins":"5:27 am","url":"https://shroudstory.com/2014/11/18/the-conspiracy-of-the-faux-sweat-imprint/","cat":"image_theory","title":"The Conspiracy of the Faux-Sweat Imprint"},{"id":"comment-149053","author":"john_klotz","post":"I do not believe in miracles. I only believe in things we can not explain. Threre is an arbirary divide in our thinking between was “natural” and what is and what is “supernatural or unnatural” If something happens we can not explain, that does not mean it is suprenatural or unnatural”,” it simply means that we cannot explain it. The image on the shroud of Turin has yet to be explained. It that sense it is by definition “supernatural.” But it exists so no one can deny that it is “natural” either. All op the evidence surrounding the image, points in one direcrtion: the Resurrection. Can it be said to “prove” the Resurrection. Maybe not, but the experiments in Italy and other places all point towards some kind of radiation (Sorry Ray R.). There is nothing in antiquity of which I am aware that exhibits the same characteristics and for which radiation seems to be the simplest solution. The fact that we can not explain the radiation by current science does not mean at some future date it will not be explained. Ancients marveled at all kinds of things that we subsequently explained such as solar and lunar eclipses. Scientists are exploring the issue of human consciousness. It has yet to be explained. Science is not an enemy of religion which posits a primordial conscientiousness from which our universe sprang. Science is the enemy of religion that trembles in fear at a solar eclipse because God has taken away the sun or that to prevent the volcano from erupting we must sacrifice a human being. Something happened in that Jerusalem tomb circa 30 CE. It is reported that Christ rose from dead. If so, then something in that process, undoubtedly some kind of radiation caused an image to be created. I can understand an agnostic who doesn’t believe it’s been proven. But the atheist who claims it never happened, is well, a fool..","date":"2014-09-06","mins":"9:57 am","url":"https://shroudstory.com/2014/09/06/the-man-who-liked-to-dip-pickle-spears-in-his-beers/","cat":"image_theory","title":"The Man Who Liked to Dip Pickle Spears in His Beers"},{"id":"comment-149092","author":"john_klotz","post":"I just don’t have time to dig into this right now. Rogers in his book and other places recognized there was some x factor besides the malliard reaction. It’s the big unknown. That doesn’t mean it won’t be solved but it isn’t solved now..","date":"2014-09-06","mins":"1:01 pm","url":"https://shroudstory.com/2014/09/06/the-man-who-liked-to-dip-pickle-spears-in-his-beers/","cat":"image_theory","title":"The Man Who Liked to Dip Pickle Spears in His Beers"},{"id":"comment-149070","author":"john_klotz","post":"I really apologize for the typos but I am deep into converting my 500+ footnotes into Reference table which looks like it will have 300 +/ entries..","date":"2014-09-06","mins":"11:25 am","url":"https://shroudstory.com/2014/09/06/the-man-who-liked-to-dip-pickle-spears-in-his-beers/","cat":"image_theory","title":"The Man Who Liked to Dip Pickle Spears in His Beers"},{"id":"comment-34204","author":"john_klotz","post":"I started a comment on this but felt I was going a stray from the main piece. It’s dels with how the Main Stream Sceientific Community (the MSSC) must marginalize those who support the Shroud authenticity – at least those parts who find the Shroud’s authenticity incompatible with their atheism/agnosticism. See http://quantumchrist jck.blogspot.com/ It’s called The Shroud, Dr. Pangloss and Sammy Glick..","date":"2013-05-21","mins":"9:24 am","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","title":"The pig experiment was not Barrie’s experiment"},{"id":"comment-34203","author":"john_klotz","post":"The Shroud lives! The most interesting thing about this controversy seems to be the FACT that the militant atheists can’t escape the Shroud and so must destroy its authenticty. They can not accept a world (or esistence) in which the Shroud of Turin proves not only that Christ existed, but that in three days his body parted company with his burial cloth. I have a lot more to say about the Shroud and the media but becasue it goes off topic I posted it on my Quantum Christ blog: http://quantumchrist jck.blogspot.com/.","date":"2013-05-21","mins":"9:15 am","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","title":"The pig experiment was not Barrie’s experiment"},{"id":"comment-183564","author":"john_klotz","post":"Excellent post Thibault, but this is getting tiresome. Freeman is the epitome of pseudo critic, (as defined in the US) he feigns honest skepticism while his actions reveal an unalterable doubt of authenticity. The more outrageous his s[speculations, the more clearly he marginalizes himself. There are many people who simply can not fit an authentic Shroud into their world view..","date":"2015-01-15","mins":"3:54 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-167153","author":"john_klotz","post":"It wold be nice if before he comments that Colin acquaint himself with the breadth of of the STURP study. Dark spot anomalies were discovered among on the the foot and kneww. They have been subsequently analysed as limestone consistent with limestone found in Jerusalem. I recall that Berry’s expertise and career involved analysis of issues related to nutrition? If so, I would suggest that he get his head out of his …oven. It would be nice if Colin has a sense of humor but he will probably have a snit about my analogy..","date":"2014-10-31","mins":"5:35 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","title":"Those Dark Specks in the Mark Evan’s Photographs"},{"id":"comment-183477","author":"john_klotz","post":"David, With all due respect, and I do mean respect, your response begs several serious questions. One of those is the fineness of the detail of the image. Assuming arguendo a block print, or a painting, the image is too fine for any known method of reproduction. Also, there is the blood problem. It did not go negative and is shown in all its red glory, preserved according to Adler by the presence of bilirubin. A quick look at recent studies on the Internet confirm that stress does in fact increase bilirubin. Those studies were of mental stress that was used to excite the production of bilirubin. Can you imagine the stress of torture and crucifixion? As one correspondent to this blog has pointed out its the combination of the blood (image???) and the body image that refute any painting or block printing theory. It isn’t one factor that determines the legitimacy of the image as being created by an as yet unknown process. It’s an accumulation of circumstances. I know some people sneer at circumstantial evidence but ALL evidence concerning the Shroud, including the carbon dating is circumstantial. Among the foremost advocates of using necessity and reliability of circumstantial evidence in studying ancient materials is (gasp) Richard Dawkins.See Dawkins, Richard , Greatest Show on Earth , p. 106. (Kindle Edition) One of the humorous anecdotes in John Hellers’ book on STURP was when he and Addler conducted what Einstein called a “gededenkenexperiment,” – thought experiment – to determine if the Shroud image could be forged.. Their conclusion: it couldn’t be done. See John Heller, Report on the Shroud of Turin, p. 201. While their concentration was on painting Mc Crone was still attempting to debunk the Shroud, as to the fineness of the image, It stands to refute printing the image as well. Show us a medieval block image of the fineness of the Shroud image..","date":"2015-01-15","mins":"7:10 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-167155","author":"john_klotz","post":"Kneww = knee..","date":"2014-10-31","mins":"5:36 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","title":"Those Dark Specks in the Mark Evan’s Photographs"},{"id":"comment-167214","author":"john_klotz","post":"Take up your arguments with Ian Wilson. See “The Shroud” pp 66 68. Among the individual scientists who examined the limestone were Roger and Mary Gilbert, Sam Pellicori,, Dr. Joseph Kohlbeck and Dr. Ri Ricardo Levi Setti. The Gilberts were pioneers in spectrographic analysis. During the 120 hours of the STURP examination, that analyzed every millimeter of the Shroud. They were stumped by anomalies in certain areas beginning with the feet. The anomalies were examined under high powered magnification and found to be “dirt.” That dirt was then analysed and found to aragonite. No one found black cookie or bread crumbs. It as absurd a hypothesis as Berry’s early hypothesis that the man in eh Shroud was Jacques de Millay. It is easy to hypothesize when you do not know the facts. Unfortunately the facts get in the way..","date":"2014-10-31","mins":"8:56 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","title":"Those Dark Specks in the Mark Evan’s Photographs"},{"id":"comment-167161","author":"john_klotz","post":"And another thing. Http://johnklotz.blogspot.com/2013/01/clumsy me and shroud of turin.html I note in that post that limestone dirt speck as found on the Shroud were “exclusive” to Jerusalem. There may be some controversy about that but there is no question that the limestone variety was found in Jerusalem particularly along the Via De la Rosa – the Way of the Cross. And by the way, they have been subject to spectrographic analysis..","date":"2014-10-31","mins":"5:48 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","title":"Those Dark Specks in the Mark Evan’s Photographs"},{"id":"comment-73370","author":"john_klotz","post":"Dave has given us another excellent post and another mystery, except maybe no more mysterious than the image itself. The simplest natural explanation is the one of the one’s proffered by Dave: another cloth on top of the head. But we just don’t know if in fact such a cloth existed and except for the Sudarium which appears authentic and which if properly analyzed by new scientific tests could, or could not be, matched. By that I mean the kind of deep “quantum” analysis that was performed by Heller and Adler on the blood from the Shroud. Matching spectra? But here is something that is beyond theory and into the area of speculation. However when it comes to the process of image formation, everything for now is speculation. The importance of the image is that the image “is”. Is it a part of the great mystery of Christ’s “I am?” We should know better but we tend to still think of the Resurrection in our three dimensional “physical” universe. Many decades ago, before I went to college, I remember seeing at the magazine section of a local drug store, a copy of a magazine that popularized scientific issues a cover proclaiming an explanation of time as the fourth dimension. The cover included an illustration of Salvador Dali’s “Persistence of Memory” famous for its drooping watches. When I looked inside the magazine, the entire article was just a few lines referencing the Dali painting. I was disappointed. A few years later, I was at a cadet in the Civil Air Patrol attending a two week encampment at Samson Air Force Base at Seneca Lake, We slept in barracks and ate the Air Force food. There are two things that I remember vividly. One was a fellow cadet calling out in the middle of the night “You know that stuff they put in the food?” and then answering the question “It doesn’t work..” The other was a fellow cadet, Melvin Weinstein, from Albany NY who had won a Westinghouse prize at some level or other. I asked him about it and he said “I made model tesseracts.” “What was that? I asked. “It’s a four dimension cube,” he replied. “Want to make one? Get some straws.” I did and we did. If you have ever drawn a three dimensional cube on paper which is essential two squares with four corners joined by a slanted lines at the corner, you might be able to visualize what we did. We constructed two three dimensional cubes from straws and then connected the eight corners by straws. I was amazed because it reminded me of a stroboscopic picture I had seen in Life magazine of Ted Williams swing a bat. It was as if the cube was moving through space. The distance traveled being the length of the connecting straws. Time was the fourth dimension, Freidman cautioned me that the model of a four dimension cube we had created was not the most accurate. Actually, the cube moving though time expanded in all directions. The proper representation was one cube inside a larger one, joined at the corners. That would have been tough to do with soda straws. Assume arguendo the reality of the Resurrection. Something happened to Christ’s body that has no precedent. Dame Isabel Pizcek has referred to the Shroud as an “event horizon.” Perhaps she is right and perhaps that explains the image. We would tend to think of the body as moving through the cloth in a singular direction. But if it was moving into another dimension, or existence, it would have been moving from our perspective in all “directions” or no direction at all. I would suggest that these are issues of quantum mechanics. On the other hand, applying Occam’s Razor, the existence of a head band, as proffered by Dave, may be the simplest solution. : ).","date":"2014-01-15","mins":"8:34 am","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-6997","author":"john_klotz","post":"Perhaps the something that is missing is the one thing that the so called scientific method refuses to recognize: the Resurrection..","date":"2012-01-15","mins":"8:46 am","url":"https://shroudstory.com/2012/01/15/tough-questions-from-sciencebod/","cat":"image_theory","title":"Tough Questions from Sciencebod"},{"id":"comment-7022","author":"john_klotz","post":"I think it is a truncated scientific process that leaves no room for the inexplicable. You can build a nice little box for yourself with “rational” scientific method but the fact is that most scientific progress has occurred on the margins. In fact, I might suggest that nothing of importance is ever accomplished by a “rational” mind. Einstein’s theory of relativity, the electromagnetic properties of the brain, the big bang theory of the universe creation, were all derided as irrational and lunatic in their time. If you have read anything about it, you would know that even the most rational of scientific minds know how to use quantum mechanics but admit that the functioning of quantum mechanics defies logic and reason. You might also know that many scientists believe (contrary to other scientists) that human consciousness functions at the quantum level and is a quantum phenomenon. That opens doors for unimaginable realities to the human mind. Have you ever heard of Boltzman brains?.","date":"2012-01-15","mins":"11:17 pm","url":"https://shroudstory.com/2012/01/15/tough-questions-from-sciencebod/","cat":"image_theory","title":"Tough Questions from Sciencebod"},{"id":"comment-77781","author":"john_klotz","post":"Dan, For one thing this technology allows the identification of the chemical composition of any particular point on the Shroud were it employed on the Shroud. It does so essentially without affecting the Shroud and the results available in a digital format are then available indefinitely. There were similar studies made by STURP. The Quad mosaics were a rough analogy but they did not have the ability to allow specification of materials, only differences in gross composition. A rough analogy would be the ability of the VP 8 analyzer to convert differences of intensity into a tree dimensional representation of the object. The most directly relevant STURP test may have been Heller and Adler using the spectrum of Methemogloben to identify ancient blood. It might also be possible to identify the the presence or absence of Vanillin at various places on the Shroud. Maybe we could do Arizona’s remaining sample and whatever is left of he Gonella hold back. The process would work on large areas or microscopic. It would all be one digital file recording the chemical composition of each point of the globe. We might also be able to back track and create views at various points of its history. It would require some adaptation of the equipment. Incidentally., a presentation of this methodology was made 14 years ago at a Shroud conference. Http://www.shroud.com/pdfs/grndfest.pdf Two years ago, I was examined for a tear on my retina. It wasn’t until I saw the Grunfest article a few months ago that I realized that digital spectrum photography was used in identifying the problem and directing the hand of the ophthalmologist that operated on my eye. I am believe that this was one of the proposals to Turin that was never acted upon..","date":"2014-02-09","mins":"12:12 pm","url":"https://shroudstory.com/2014/02/09/what-might-we-learn-about-the-shroud-of-turin/","cat":"image_theory","title":"What might we learn about the Shroud of Turin?"},{"id":"comment-22302","author":"john_klotz","post":"When is a scorch a scorch? I am beginning to think that the whole issue of a “scorch” is a tempest in a Oxonian tea pot. If the intent is to prove that that the Shroud could have been faked by a “scorch”, so what? Some hypothesize that the image was caused by a burst of energy or light. An Italian scientist claims to have come closer than anyone else through the use of a laser process. Essentially, a light scorch. Let me introduce you to a former neighbor of mine in Riverdale, the late Martin Tytell. Martin was a questioned document examiner and a forensic expert on typewriters. He was retained by the defense team of Alger Hiss to demonstrate that the stolen cables from the State Department that were retyped by his wife on an Woodstock typewriter could have been faked because it was possible to duplicate the attributes of the Underwood. The claim was the FBI framed Hiss by so doing. By God he did it, although it took two years and the Courts appear disinterested in the results of his labor. Because something can be forged, it doesn’t mean that the thing has been forged. In the case of the Shroud, there is yet no evidence of how the Shroud in toto could have been forged. Perhaps Collin Berry should adjust his goals. If his intent is to prove the Shroud is a fake because he can forge a copy, he has failed miserably. IF his intent to to come up with a process explaining how the image was made, he should keep on, keeping on. There are many in the Shroud world who are ready to accept a “natural” explanation of the image. But then we arrive at a question: what is natural? No one as yet come with in a country mile of duplicating the Shroud image by a natural process. We can get copies made to day that imitate he Shroud but they are copies of the Shroud. The creation process of the image remains a mystery. No one has produced an original image from scratch that duplicates the Shroud. I think there is a corollary of sorts to Occam’s Razor. Exceptional events require exceptional explanations. The Shroud image is an exceptional event. All the frustrated labor that has gone into attempts to create an “original” duplicate have been in vain. By original duplicate I mean a double image of the body of a crucified man with his wounds in exquisite detail created with a maximum of 48 hours that is not a copy of the Shroud itself. Hasn’t been done yet. If you have to ask me why 48 hours, the answer is simple. The forensic pathologists who have reviewed in detail the Shroud have concluded that it shows evidence of rigor mortis and no evidence of putrefaction. Rigor mortis freezes the muscles soon after death but releases normally in 48 hours. Similarly, putrefaction begins to exude all kinds of nasty stuff after 48 hours. Strange coincidence: all four Gospels have Mary Magdalene discovering the empty tomb on Sunday morning at day break – roughly 6:00 AM, approximately 39 hours after Christ expired on the cross. I believe that mystery of the image will be finally be resolved, if ever, by reference to a process on the quantum level – the laser, for example, being essential a quantum mechanical application. Is that way out? How about this quotation from a well known, screwball publication (now known as Bloomberg Business Week.) “Developing quantum theory was ‘the crowning intellectual achievement of the last century,’ says California Institute of Technology physicist John Preskill. It’s the underlying principle for many of today’s devices, from lasers to magnetic resonance imaging machines. And these may prove to be just the low hanging fruit. Many scientists foresee revolutionary technologies based on the truly strange properties of the quantum world.” Business Week, March 15, 2004 Cited in: Rosenblum, Bruce; Kutter, Fred (2011 07 01). Quantum Enigma : Physics Encounters Consciousness (Kindle Locations 1862 1866). Oxford University Press. Kindle Edition..","date":"2013-01-20","mins":"11:34 am","url":"https://shroudstory.com/2013/01/20/whats-in-a-linen-fi-ber/","cat":"image_theory","title":"What’s in a linen fiber?"},{"id":"comment-73374","author":"john_klotz","post":"Correction: My long ago friend may have been “Friedman” instead of “Weinstein.” It was 61 years ago,.","date":"2014-01-15","mins":"11:09 am","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-77837","author":"john_klotz","post":"Barry was involved professionally with Dr. Grundfest whose presentation is cited above (http://www.shroud.com/pdfs/grndfest.pdf). I would hope that it might be something to be addressed at the St. Louis conference in October...","date":"2014-02-09","mins":"3:37 pm","url":"https://shroudstory.com/2014/02/09/what-might-we-learn-about-the-shroud-of-turin/","cat":"image_theory","title":"What might we learn about the Shroud of Turin?"},{"id":"comment-22304","author":"john_klotz","post":"TYPO: I refer to the Hiss typewriter as an “Underwood” once. It was a Woodstock.”.","date":"2013-01-20","mins":"11:40 am","url":"https://shroudstory.com/2013/01/20/whats-in-a-linen-fi-ber/","cat":"image_theory","title":"What’s in a linen fiber?"},{"id":"comment-8047","author":"john_klotz","post":"Bravo. I think we are getting close. Right now we are dealing with theory that fills the gap of known facts. This is the point to paraphrase Teilhard de Chardin science and religion mergers. One fact that as impressed me is the thinness of the image. According to Ray Rogers it is only the coloration of the outer wall of single cells. ANY photograph process would have required an emulsion of some kind which would be far thicker. Ultimately the answer, I believe, will be found at the quantum level. Isabel Picsek was right. “The Shroud of Turin is the future of science.”.","date":"2012-02-08","mins":"9:06 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","title":"Why do we think the Resurrection was a process? What if it was not?"},{"id":"comment-8051","author":"john_klotz","post":"The reason I mentioned photography is that we already know it was not painted and we have claims it was a camera obscura etc. None of which makes sense. The only thing that makes sense is that it was a process we do not yet understand but we may be getting close. Of course, I have little time to debate with anybody who refuses to recognize the irrelevance of the blown carbon dating or relevance of the evidence for the existence of the Shroud in Constantinople at the turn of the last milenium. The Shroud speaks for itself, or as we pain in the neck lawyers might say, res ipsa loquitor..","date":"2012-02-08","mins":"11:19 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","title":"Why do we think the Resurrection was a process? What if it was not?"},{"id":"comment-170596","author":"john_klotz","post":"Charles Freeman: I once challenged the skeptics to identify an analogous work of art to the Shroud. No response. Let’s renew the challenge a little more broadly. Identify ANY painting or “daubing” or such from medieval times that under FTR will not exhibit direction as explained by Lynn Lorre in 1977. You stated that your preferred method of “painting” or daubing or whatever would not exhibit direction. Can you give us one example of any work of art that is painting or daubed or whatever that lacks direction under a Fournier analysis. If you could identify one, then perhaps OK or somebody who has access to the analytical devices could perform an analysis. OK chose what to examine; to be fair, you chose what to examine. Then we can determine if is is fairly analogous to the Shroud or not. I want to give you an opportunity to do it. Otherwise your “historical” analysis is simply a facile pseudo analysis by a pseudo skeptic. I use the word “pseudo” in the technical sense as defined on this side of the Pond. That is one who pretending to be a skeptic is in reality is defending a point of view. That is the definition propounded by Marcello Truzzi. I believe I have the right to use American English..","date":"2014-11-11","mins":"7:10 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170783","author":"john_klotz","post":"David Mo, As a matter of fact the analytical device used by Heller and Adler to identify blood on the Shroud was a precursor to the Multispectral Digital Imaging (MDI) used to analyze La Bella Principessa. I discuss Heller and Adler in Chapter 9 of my book, The Coming of the Quantum Christ. The device they used was a microspectrophotometer. (MSP). The MSP produced a digital read out of the spectrum of the object. MDI records the spectrum data in a permanent digital file which is then available for detailed examination. All of the spectra including the invisible ones (infrared and ultra violet) are recorded. In essence, MDI combines the Quad Mosaic information with the spectrum information. The actually photographs until processed are black and white similarly to the Quad Mosaic process. There is an excellent presentation of this information on the Lumiere Technology web site which analyzed both the Mona Lisa and La Bella Principessa. See http://www.lumiere technology.com/discoveries.html. I include a discussion of Lumiere’s work in Chapter 14 of my book which deals with the Shroud’s provenance. The drum I am beating right now is for the use of MDI to analyze the Shroud. (Chapter 18 of my book, its conclusion).It is generally non destructive. However, the light used to illuminate the work has to be filtered to prevent light pollution. While the microspectrophotometer may appear “primitive” today, Heller and Adler were able to identify the spectrum of methemoglobin on samples obtained from the Shroud and that meant it was real, very ancient, degraded hemoglobin. But actually this is something we agree on: The utility of employing MDI to analyze the Shroud. The result might be several terabytes or so of data well with the capability of even desktops now. The programs that analyze the data are sophisticated but available. Moreover, an MDI data base of the Shroud would allow for research and examination world wide without interference. Also, the database would allow peer review and criticism of the results of any analysis – unlike the basic carbon lab data which the labs have refused to release. Pam Moon had to use a British FOIA process to get copies of the Oxford sample. You see David, when it comes to an MDI analysis of the Shroud being appropriate; you and I are on the same page. ..","date":"2014-11-12","mins":"5:34 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170792","author":"john_klotz","post":"O.K. A Fourier transform has been done and the results published. I believe an MDI study would be very worthwhile. In fact it maybe the one thing that cold be done with the least fuss in the least time and the results could then become universally available. And I repeat one thing from my last chapter: the results of any study of the Shroud are the intellectual property of all humanity. Those, as they say, are “fighting words.”.","date":"2014-11-12","mins":"6:09 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170830","author":"john_klotz","post":"OK In this interconnected world we live in, no question has a simple answer. If you were to get into an argument with Charles and used personal invective, you would have to look at the defamation laws of your country and England to arrive at a conclusion. Because he is English, he is protected by libel laws much harsher than in some other countries like the US. Between the US and England, the US is most protective of the speaker and England more protective of the object of the statement. A general rule which others may disagree with is this: in the United States the libeled person must prove the statement false. In England, the speaker must prove the statement is true. I haven’t a clue as to what the law maybe in other countries. As a US resident however, I am protected by US law to the extent that this “burden of proof” is a constitutional issue relating to free speech. A judgment obtained in England for libel may not be enforceable in the US unless I appear in England to litigate it if the wrong burden of proof is applied. That being said, even in the US I would be careful about a flat statement of “deliberate deception.” You might say is reasoning is shoddy or totally mistaken. But I would be leery of ever saying it was deliberately deceptive. If it goes to his profession or livelihood, you are in an entirely different arena even in the US. I am not giving you legal advice because we do not have a lawyer client relationship. I am only commenting on the general law. I could have many sharp criticisms of Charles and the shifting sands of his “proof.” I would not say he is being deliberately deceptive in any country. But that’s just my opinion..","date":"2014-11-12","mins":"10:07 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170785","author":"john_klotz","post":"Better link: http://www.lumiere technology.com/Pages/Services/services2.htm.","date":"2014-11-12","mins":"5:39 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170597","author":"john_klotz","post":"I forgot to check the box that says “Notify of new commenst via email.” Now I have..","date":"2014-11-11","mins":"7:12 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-157181","author":"john_klotz","post":"Dan, Your gut may tell you “it’s real” but the existence of the image and it’s attributes are facts. They are an important link in the chain of circumstantial evdience that supports the Shroud’s authenticity. People go to jail on conclusions derived from circumstantial evidence and plaintiffs collect big judgments. There are some who believe that in the final analysis, all evidence is circumstantial except eyewitness evidence and even Richard Dawkins finds that circumstantial evidence may be more reliable than eye witness evidence. (I didn’t want to write this in this post, but I can’t resist. It’s in the book. Note that I no longer refer to it as a manuscript.).","date":"2014-09-27","mins":"6:47 am","url":"https://shroudstory.com/2014/09/27/why-the-shroud-is-not-a-painting/","cat":"image_theory","title":"Why the Shroud is not a Painting"},{"id":"comment-57633","author":"john_klotz","post":"Thank you.","date":"2013-12-10","mins":"7:30 am","url":"https://shroudstory.com/2013/12/10/how-to-insert-an-image-in-a-comment/","cat":"news_&_views","title":"How to insert an image in a comment"},{"id":"comment-34420","author":"john_klotz","post":"One of the problems with some Christians including many Popes is that they are continually insisting on faith as independent from science. It isn’t. Some scientists now posit the brain as an kind of quantum computer and that conscience thought are in fact a non local process – another phrase for quantum entanglement. I believe that love is a quantum entaglement of consciousnesses. Fifty years ago Tennessee Williams stated in an interview with Mike Wallace: The most important moments of life are when we break out of our own egostical shell and really sense the rpesence of another person. I thpought then that he was defining love. I think now, science is catching up with Williams. Time for religion to do the same..","date":"2013-05-23","mins":"5:31 am","url":"https://shroudstory.com/2013/05/23/resurrection-what-happens-with-quantum-entanglement/","cat":"science","title":"Resurrection:  What happens with quantum entanglement?"},{"id":"comment-170357","author":"john_klotz","post":"Bravo! This is an amazing post in that it deals quite substantially, and scientifically, with the issue at hand. One of the problems I see is that we have too many “experts” in one field spouting off in areas in which they are not expert. Charles Freeman is an art historian. That does not make him an expert on physics. His “learned” opinions on things such as negativity are simply not in his area of expertise. His opinions are really speculations. Now a word for the hated class of humanity – lawyers, especially litigators. Evaluating expert testimony is a part of what we do on a regular basis. I have one case where representing a plaintiff, I recently used an expert accountant to assess a damage issue. Whether that expert was appropriate is now an issue on appeal by the losing (so far) side. I once remarked that an expert is someone with a point of view and a library card. My son Michael corrected me: “an expert is someone with a point of view, a library card and a check.” In writing my manuscript, I had the advice of a Ph D in physics who advised me on the image issues. He was adamant about one thing: the image is not a holograph because it lacks a “phase” component. He also understood what Jackson and Pete Schumacher have written: the VP 8 creates a brightness map. (Actually, my adviser preferred a “darkness” map which is the other side of the same coin. His tongue may have been slightly in cheek.) Point is, that when dealing with the image, reference must be made to physics, not the speculations of an art historian publishing in a history journal, peer reviewed, I expect by other historians, if at all. One more point, although I have occasionally twitted Colin (really without malice, it’s a Yankee thing I guess) his latest contributions have been remarkable and productive although we differ on the ultimate issue. OK’s post is physics. It must be rebutted, if at all, on the basis of physics..","date":"2014-11-10","mins":"6:07 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","title":"Guest Posting by O.K. on the Shroud as a Negative"},{"id":"comment-176641","author":"john_klotz","post":"It seems to me that someone ought to define what a “scorch” is. If you mean something caused by heat, the existence of the blood indicates that the process whatever it was that cause the image did not involve heat. A “light” scorch of some kind is one possibility. A malliard chemical reaction is another. Fact is, no one has yet to come theory that conclusively harmonizes the blood and the scorch. Jackson believes he has. I am not convinced although I am not opposed either. Unlike others on this blog, I just don’t know, Although, it seems evident to me that the image itself and therefore possibly its formation mechanism, are consistent with a resurrection event. PS: Charles, spare us your blather about painting. Science has proven it’s not a painting. Unfortunately that takes it out of your of expertise. I am really jammed today and for the next three weeks so I may have time for any further in depth comments. Any silence on my part will not mean consent..","date":"2014-12-15","mins":"7:37 am","url":"https://shroudstory.com/2014/12/15/is-fluorescence-still-in-question/","cat":"science","title":"Is Fluorescence Still in Question?"},{"id":"comment-92284","author":"john_klotz","post":"Daveb, Dave, I agree with the priest quoted by Rev. “Kim” Dreisbach in the 2007 presentation read after his death at the Shroud conference in Perugia, Italy. Http://www.shroud.com/pdfs/dreisbach4.pdf He quotes a Catholic priest on page 10 of the PDF: “Fr. Anthony Delessi of the Monastery of the Holy Spirit in Conyers, Georgia has so wisely observed: “We Roman Catholics have been its custodians for the last eight hundred years after stealing it from the Greeks (i.e. Orthodox) who performed that function for the first twelve centuries. But in truth, it belongs to no one denomination – maybe not even to Christianity. Rather, it is in actuality ‘God’s love letter in linen to all mankind.” The Shroud does not belong to the Church, it holds it in trust for all humanity. I hope that the Pope Francis agrees..","date":"2014-03-23","mins":"10:14 am","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","title":"So then, why is there an image?"},{"id":"comment-186229","author":"john_klotz","post":"It was the confluence of several processes and individuals that got the STURP examination done. I might point out that the “Turin Authorities” report to the Pope who owns the Shroud and has the ultimate authority. The current Pope is not above doing things his own way. In Chapter 17 of my book, that Pope Francis is virtually a prophet of an Apocalypse of Selfishness. He is also the most ecumenically minded Pope in recent history. I have posted the Chapter 18 of my book at http://quantumchrist jck.blogspot.com/ states the challenges the Shroud poses for the Church, Science and Humanity. It includes a quotation from Fr. Anthony Delessi: “We Roman Catholics have been its custodians for the last eight hundred years after stealing it from the Greeks (i.e. Orthodox) who performed that function for the first twelve centuries. But in truth, it belongs to no one denomination – maybe not even to Christianity. Rather, it is in actuality ’God’s love letter in linen to all mankind.’” I have appended a paper by Kim Dreisbach on the ecumenical implications of the Shroud which may be read on Shroud.com at http://www.shroud.com/pdfs/dreisbach4.pdf Pope Francis is giving more than lip service to ecumenism INCLUDING THE GREEK ORTHODOX WHO MAY BE NURSING A CLAIM OF THEIR OWN that has been on the back burner for 900 years or so. Is there anyone with the slightest experience with either politics or academic intrigue that does not see a picture here? There is a tide flowing. Let me close with a bit of Shakespeare: “There is a tide in the affairs of men. Which, taken at the flood, leads on to fortune; Omitted, all the voyage of their life. Is bound in shallows and in miseries.” If you wish to order The Coming of the Quantum Christ: Create Space https://www.createspace.com/5049060 A hard copy full color version can be order from Create Space: Smashwords https://www.smashwords.com/books/view/509210 There are eight different formats that you can download on Smashwords and actually read a free sample. Epub can be read by Nook and Adobe Digital Editions. Mobi can be read by Kindle. You can also order the print version or E Book from Amazon and Barnes and Noble Search for “Quantum Christ and Klotz” on their web sites: http://www. Amazon.com and http://www.barnesandnoble.com/.","date":"2015-01-25","mins":"5:08 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"},{"id":"comment-186163","author":"john_klotz","post":"ONE factor is missing from discussion : Pope Francis who apears to have a commitment to ecumenism. Like I wrote above. This is a political problem with a small “p”..","date":"2015-01-25","mins":"9:36 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"},{"id":"comment-186402","author":"john_klotz","post":"David, No one has more respect for Barrie than I do. Seriously. However, when STURP got approval there was a confluence of factors that created the impetus. Foremost was Fr. Rinaldi who bridged the world of Turin and the US. Although some in STURP may be reluctant to recognize it, there was also the impact of Silent Witness which was screened on Italian TV before the final approval was given for STURP (and there was extraordinary support for Silent Witness by Fr. Rinaldi who opened doors in Turin for David Rolfe.) I am curious as to whether the wild card in this deal might indeed be the Greek Orthodox. If we win the support of the Greek patriarchs for renewed testing, that might be a voice that Francis would listen too. Their position might be “You can keep the Shroud but you have to allow more scientific examination for you hold it in trust for humanity.” That might be a pipe dream but, maybe not. And there are also other ecumenical leaders who might be recruited. Frankly, I am clueless how and who to do that. But its the kind of strategy that might have promise. The argument that the Shroud is held in trust by the Pope for all humanity is the foundation for further testing. It is also an argument which might appeal to Pope Francis. Think ecumenical..","date":"2015-01-26","mins":"10:34 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"},{"id":"comment-186113","author":"john_klotz","post":"Dan, Speculating on why the images haven’t been shared is pointless since all we have is speculation. Does anyone know the dots per inch of the images..","date":"2015-01-25","mins":"4:35 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"},{"id":"comment-187476","author":"john_klotz","post":"Colon, Spare the ignorant insults. Your evident disdain for everything Roman Catholic gets in the way of your presumed scientific judgment. The Pontifical Academy is in fact ecumenical. The conference last Spring on climate change included the Nobel prize winner who discovered the Antarctic Ozone hole and at least postponed that Apocalyptic event. The person selected to give the final summing up to the conference was a NY Times reporter (of Jewish heritage, I believe.) Indeed, the most strident and listened to voice warning that human greed is threatening humanity’s extinction is, gasp, a Pope no less, the one named named Francis.. If it wasn’t for the House of Savoy and the Catholic Church the Shroud would have vanished centuries ago. It certainly would not have survived the Reformation and/or the French Revolution. Most of its copies were in fact lost. None of this excuses the debaucheries of the Medici popes or the persecution of schismatics. But it was Henry the Viii who executed Sir Thomas Moore. The excesses of Catholic Queen Bloody Mary were more than matched by those of her Protestant successors and Cromwell. Given your attitude, I doubt that you will ever get within a country mile of individuals engaged in serious research on the Shroud with little time for self involved navel gazing speculations..","date":"2015-01-30","mins":"12:26 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"},{"id":"comment-186123","author":"john_klotz","post":"Thank you Andrea for your response. I would still like to know the precise definition of the images. Frankly we have a political problem. How do we influence Turin to move which really resolves to how do we influence the Pope to move?.","date":"2015-01-25","mins":"5:45 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"},{"id":"comment-187477","author":"john_klotz","post":"Colin, excuse the typo in your name. I assure it was not intentional..","date":"2015-01-30","mins":"12:27 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"},{"id":"comment-30750","author":"john_klotz","post":"Can anyone tell me how a “few hundredths of a millimeter” relates to something “13 μm diameter thick” I have read that is the diameter of a linen fiber..","date":"2013-04-14","mins":"9:25 am","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-30765","author":"john_klotz","post":"Dear all, Thanks for your response. The reason for the question was just how far into the Shroud you could go with the new App. Does a “few hundred’s of a millimeter cover .013mm. I wo9uld guess not quite. I feel like Heller trying to figure out how to measure particles for blood that are too small for analysis. Of course first I have to get an I Pad or I Phone which I do not anticipate doing..","date":"2013-04-14","mins":"11:44 am","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"}]
