[{"id":"comment-116056","author":"john_klotz","post":"The bruised shoulder had been noted before, but the extent of the bruise and its relationship to saintly revelations has not been discussed. That’s the intriguing part of the story. Also, it goes much deeper into other conditions that I do not recall having been extensively analyzed. Here’s what Bucklin had to say in http://www.shroud.com/bucklin.htm “An interesting finding is noted over the shoulder blade area on the right and left sides. This consists of an abrasion or denuding of the skin surfaces, consistent with a heavy object, like a beam. Resting over the shoulder blades and producing a rubbing effect on the skin surfaces.”.","date":"2014-05-10","mins":"9:01 am","url":"https://shroudstory.com/2014/05/10/a-grievous-wound-more-painful-than-the-others/","cat":"other_blogs","title":"A Grievous Wound More Painful than the Others"},{"id":"comment-214345","author":"john_klotz","post":"The physical evidence of the Shroud is consistent with the Resurrection (evidence of rigor mortis but no putrefaction byproducts). The body and the Shroud parted company therefore at a very early time after death. Whatever conditions of the tomb (dampness, cool temperature) that would have extended the time of rigor mortis and delayed putrefaction are almost irrelevant because there is no evidence of such having occurred. So if the conditions of the tomb would have extended the time from 48 hours to several days means only that the event of Resurrection could have occurred later that the approximately 30 hours or so of the Scripture accounts. (9 hours on Friday, 24 hours on Saturday and six hours to daybreak on Sunday). That putrefaction is delayed by cool temperature is a well known fact. In Rogers & Hammerstein’s musical Oklahoma there is a song “Poor Jud is Dead.” The last the verse is: “He’s lookin’ oh so purty and so nice He looks like he’s asleep It’s a shame that he won’t keep But it’s summer and we’re runnin’ out a’ ice” Isabel Piczek described the image as an event horizon. Scientifically, the most commonly known event horizon is the observable last gasp of matter as it is sucked into a black hole. Actually a sunset is a rough metaphor. The sun sinks below the horizon but we know of its presence because the horizon remains light for some moment of time. I think that when it comes to image formation that Jackson’s probably on the right track. None of the theories of image formation that claim to be purely natural work and any theory that obdurately refuses to take into account the Resurrection, probably won’t work. Christ’s body was transforming from state of existence that we know to another that we can’t really explain – yet. The complex theories of consciousness and quantum theory intrude deeply into basic questions that were in the past reserved for religion. Some of them tend towards solipsism – nothing exists until it is perceived and then only in the consciousness of the viewer. Those who insist on a natural explanation for the image formation process without reference to the Resurrection are doomed to fail. Ray Rogers who advanced the theory of a maillard reaction admitted that it alone did not explain the image. The image is miraculous. That only means that we can not explain it yet..","date":"2015-11-07","mins":"7:03 am","url":"https://shroudstory.com/2015/11/07/a-guest-posting-by-o-k/","cat":"guest_posting","title":"A Guest Posting by O.K."},{"id":"comment-214349","author":"john_klotz","post":"OK, I don’t have time to go into particulars and I am not sure what you mean. I will explain what I know in lay person’s terms. A black hole isn’t really a hole. It’s a collapsed star with resulting extraordinary gravity. Objects approaching it that fall within the influence of its gravity are pulled into it. The gravity of the collapsed star is so large that even light can not escape its grasp. Thus it is black. However, there is a point before it is lost in the hole that an approaching object becomes distorted by the gravity and assumes new shapes. The point at which an object’s light can last be observed is called the event horizon. On the case of the Shroud, the image is of a dead Christ. It was formed in a micro second. Whatever, the process, the image is of the last instant of the body of Christ before/as it was transformed and brought to life and/or entered a new dimension or universe of existence. The event horizon is an apt metaphor for what happened and for the time being as good as it gets..","date":"2015-11-07","mins":"8:29 am","url":"https://shroudstory.com/2015/11/07/a-guest-posting-by-o-k/","cat":"guest_posting","title":"A Guest Posting by O.K."},{"id":"comment-214346","author":"john_klotz","post":"Typo: 30 hours = 39 hours.","date":"2015-11-07","mins":"7:06 am","url":"https://shroudstory.com/2015/11/07/a-guest-posting-by-o-k/","cat":"guest_posting","title":"A Guest Posting by O.K."},{"id":"comment-39775","author":"john_klotz","post":"I hate to keep citing the same video clip but I think Hameroff’s discourse on the quantum processes that constitute our consciousness and their potential relationship to Near Death Experiences (NDE) is instructive and I expect for many (like me) a break through in understanding. Http://vimeo.com/39982578. My only addition (and I have discovered not necessarily original) is that love is in the nature of a quantum entanglement between two conscious entities. Now for the real speculation, not entirely out of thin air. Christ is in fact the mediator between our consciousness and the primordial consciousness from which our existence sprung. All who truly love entangle themselves with the creator. I caution those who rely too heavily on theology divorced from science. The original scientists were the ancient priests and ancient societies were in many ways ruled by their “priests.” I might suggest the Maya, the Egyptians and stone age culture that survive today where the witchcraft and the shaman are the ultimate authority. I believe in my first year of catechism lessons, it might have even been the first one (I was seven) I was instructed that God exists eternally in place separate from our existence that we can never really understand Him. Having taught me at age seven that the divine is inscrutable, the Church has spent my last 69 years explaining God to me. I have a problem with that I guess. In a previous post I referred to the quantum as the “fingerprint” of God. That was written in haste. What I believe is that the quantum is the “interface” with the primordial consciousness we call God. The Shroud is His fingerprint..","date":"2013-07-26","mins":"6:55 am","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"id":"comment-39866","author":"john_klotz","post":"To me the importance of NDE is elemental and simple: the human consciousness (I’ll call it the soul) has the capability to operate independent of the normal constraints of space and time. Hameroff defined it in terms of “uploading” consciousness to the quantum information which pervades existence and upon recovery, the consciousness being retrieved (downloaded) Kind of like cloud computing. Those are very rough analogies and extraordinary speculations. But the NDE experiences lend to support. I really hope that “People of Faith” don’t get too hung up demanding that the reality MUST correspond to their faith and reject the intrusion of science into areas they have reserved for the faith. There was priest who has since passed away who was close to our family. In discussing he evolution creationist struggle, I remarked to him that the creationist who dismiss evolution unless it is consciously directed deny the primordial consciousness (God) the great glory that is his due. He agreed. We function according to laws that we hardly understand. The increasingly accelerated advance of science into the “quantum enigmas” does not make God its adversary. Instead, it is a Te Deum of intricate beauty and complexity..","date":"2013-07-27","mins":"4:07 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"id":"comment-206695","author":"john_klotz","post":"I am attempting to reach a lay, non academic audience. That doesn’t mean I can fudge it. I thank those who have taken the time to comment. It’s food for though and it’s what I wanted. Keep it up. Now if someone will explain what the Quantum Information of the Universe is..","date":"2015-07-27","mins":"3:17 pm","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-83046","author":"john_klotz","post":"The simple fact is that Apollonius lived to the ninth decade of the first century CE. By that time Paul had written his epistles and suffered a martyr’s death and the Gospels had been (or were being written). Tacitus reported Nero scapegoating the followers of Christus who had been excecuted by Pilate. All the Apollonius claims demonstrate is the length pseudo skeptics will go to deny the authenticity of Christ,as well as his Shroud. An authentic Shroud is something they can not live with because it impeaches their world view..","date":"2014-02-27","mins":"8:26 am","url":"https://shroudstory.com/2014/02/27/apollonius-of-tyana-proof-or-doom-for-christianity/","cat":"other_blogs","title":"Apollonius of Tyana:  Proof or Doom for Christianity?"},{"id":"comment-11555","author":"john_klotz","post":"I think it’s time to redefine “rational.” Given all the actual evidence of the Shroud itself, is it “rational” to doubt its reality? Or does such doubt reflect an inability to deal rationally with facts that are not in one’s own cosmic view of existence? Reality is far more complex than a “rationalist” might admit. For example, there are many scientist s who admit that some aspects of Quantum Mechanics defy “rational” explanation. Simplistic rejection of any idea of existence a not being “rational” is shorthand for “Don’t bother me with the facts or any idea that confronts my assumptions with which I am comfortable.” If one looks back through the history of science one is struck at how many advances that ultimately became accepted truth were initially rejected because they were not “rational” according to the wisdom of the time and that includes Einstein (who himself initially rejected much of quantum mechanics because it was not rational. One might even conclude that nothing of importance can be accomplished by a “rational” man or woman..","date":"2012-05-23","mins":"10:40 am","url":"https://shroudstory.com/2012/05/23/becky-garrison-article-in-killing-the-buddha/","cat":"other_blogs","title":"Becky Garrison Article in Killing the Buddha"},{"id":"comment-65045","author":"john_klotz","post":"I think there is a two step process with the Shroud. One step I do believe is proven beyond the a reasonable doubt. The other is so far consistent but not proven I do believe for reasons many have stated that the Shroud is the authentic burial cloth of the historical figure, Jesus of Nazareth. To say something is true beyond a reasonable doubt does not mean that there is no doubt. But it is the doubt that comes in the middle of the night at two o’clock in the morning that we must reject. We need Napoleon referred to as two o’clock in the morning courage. Sunrise is a curative of doubt. But what of the Resurrection? Does the Shroud “prove” the Resurrection. I do believe that it is consistent with Resurrection. That is it does not disprove the Resurrection. But the great unknown s the process of image formation. I think there are twp poles here. One is represented by Jackson, Fanti et al who argue that the process involved in the creation points towards Resurrection and the other by the late Ray Rogers who insisted that he didn’t believe in miracles and searched, fruitlessly for a natural explanation he never successfully articulated (as he himself admitted). So we are at an impasse. But that is not to say the impasse that will never be broken. Science has shed light much of what humanity used to be believe was a miracle. Indeed, Science may in fact be doing God’s handiwork in revealing the true majesty and glory of existence. As Science opens avenues of existence to explore, we should not be too surprised if at the one of those avenues we glimpse the Creator. In Shroud, I think I spy him already..","date":"2013-12-22","mins":"11:49 am","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-65554","author":"john_klotz","post":"Mathias, Very well done. I might add one story that was related to me: The wife of an officer serving in Viet Nam woke up to the sound of a rifle shot. No such event had ever occurred to her before. It turned out that at the exact time she woke up to the sound of a rifle shot, her husband had been killed in Viet Nam. Such stories abound. I believe that so called miraculous events that relate events in our own reality will leave “fingerprints” the Shroud being the greatest finger print of all..","date":"2013-12-23","mins":"8:26 am","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-65352","author":"john_klotz","post":"With all due respect, if you believe that Colin and company have supplied plausible image formation theories, there is a bridge over the East River in NYC I can sell you. There is nothing plausible about Colin’s theories. Don’t forget the one about the Man in the Shroud being Jacques de Molay..","date":"2013-12-23","mins":"2:21 am","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-65062","author":"john_klotz","post":"Charles, You have written that you accept the finding of the carbon dating labs unless disproven. Anyone who still accepts those findings after the work of Ray Rogers and his colleagues is not a skeptic but a true believer in pseudo science. I strongly suggest that you read Emanuella Marinelli’s excellent 30 page discussion of the carbon tests. If you still accepts those results of the carbon dating until disproved I would appreciate a point by point rebuttal. Anyone who is so intent on avoiding unpleasant truth such as the authenticity of the Shroud of Turin, is not a skeptic but a fool. .Get used to it. Christ was born, Christ was crucified and Christ was buried – in the Shroud now in Turin. Marinelli’s treatise is available for free on some website you may have visited for a few seconds: https://www.shroud.com/pdfs/marinelliv.pdf Incidentally, Martinelli’s paper runs thirty single spaced pages. If you are serious, what we need is a point by point rebuttal, not some statement from the top of a Olympus as a art historian. The problem is that the Shroud it is not a work of art. An art historian has little to add. Neither does any expert on relics who has been too busy to explore and write on it. It was created by a yet undiscovered process but it is clear that it was not a work of art. It bears no marks of human creation. For example: If it was a work of art, was the artists left or right handed? That’s just the first question. I think most art historians examining a medieval piece could answer that question about a medieval piece. About something not created by an artist, I think not. [PS. If anyone is so bold as to believe that just got a peek at my manuscript you are half right. I haven’t written that piece yet. It’s still a week or so in the future. It might be that (a) I am preparing for post publication controversy or (b) belling the cat].","date":"2013-12-22","mins":"12:35 pm","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-65993","author":"john_klotz","post":"Bravo Louis. The Knights Templar and Da Vinci have become the “usual suspects” of history. See Capt. Renault (Claude Rains in Casablanca). Everytimne4 a craclpot writer needs a buck it’s round up and the Knights Templar and Da Vinci. Of course of of them has sold over 100,000 million books..","date":"2013-12-23","mins":"6:11 pm","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-65998","author":"john_klotz","post":"Correction: strike the million. Does any one know the exact figure for Dan Brown?.","date":"2013-12-23","mins":"6:21 pm","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-65989","author":"john_klotz","post":"To be honest, I find Hugh’s calculation without merit at all. Of all those crucified, how many fairly contemporaneous accounts of the specific crucifixion of a specific individual are there? How many specific accounts of sch specific individual being buried in a linen shroud. How many specific written accounts of such specific individuals are that that that the specific individual was wrapped in a Shroud and place in a tomb hewn from rock? How many specific accounts of women finding the specific individual’s tomb empty? How many answers to even one of those questions are there? And one more, how many references by a Roman historian are there to a specific executed individual of a cult in Judea that spread to Rome even after there was an attempt to quash it by his execution? I can think of only one individual who meets those criteria. Names please (and sources). Hugh stated in referenced cases “anyone of then might have merited a mock helmet.” Point is there is no record of any of them being crucified with a mock helmet. Here we have written accounts of crucifixion with a mock crown which at the time would have been in the form of a cap rather than a medieval circle of gold or other metal of only one individual. Guess who? There seems to me to be a certain arrogance of true believers who have the “gift of faith” and no need of science. Therefore, they do their best to destroy a scientific road to faith for others. The study of the Shroud is the study of science. I am a Teilhardest in that I believe that science and religion can no longer trod separate paths. The basic issues of religion including the potential for eternal life of the self consciousness are now subject of scientific inquiry. It appears that some “salvation by faith alone” people are threatened by that. Why? “You shall know the truth and the truth shall make you free.” Does anyone have a problem with that. We find truth through science..","date":"2013-12-23","mins":"6:01 pm","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-66034","author":"john_klotz","post":"Hugh, I don’t have your E Mail, and I don’t know whether Dan will pick up my posted Christmas comment on my blog, but Merry Christmas to you. And good luck on the BSTS Newsletter..","date":"2013-12-23","mins":"7:29 pm","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-65066","author":"john_klotz","post":"Kelly, I respectfully quibble. We have an historical figure Jesus Christs who by five historical accounts (The four Gospels and St. Paul) was crucified circa 30 CE. Tacitus the Roman historian recites that fact of Christ having founded a cult which surprisingly did not vanish when he was executed by Pontius Pilate, What science has demonstrated are facts about the Shroud for whom that fit only one historical figure. Those facts: the blood stains and the diagnosis of the Man in the Shroud as a crucifixion victim are scientific facts. The conclusion that it is Jesus Christ is a conclusion drawn from those scientific facts. Inferences drawn from established facts occur every day in courts throughout the United States. Indeed, Richard Dawkins claims that circumstantial evidence is superior many times to eye witness testimony which can be seriously wrong..","date":"2013-12-22","mins":"12:48 pm","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-208031","author":"john_klotz","post":"I believe that the statement has also been made by his predecessors that the question of authenticity is not a matter of faith but science. I believe, and I don’t want to start the debate all over, that science has demonstrated its authenticity. Some may disagree. That debate on this blog has been endless. But if you can accept the authenticity there is a deeper question: What is the meaning of its image and blood? The word “icon” has more than one meaning and does not necessarily in its mean a work of art. Here’s one multiple definition from the web: noun 1.a. An image; figure; representation b, any of various stylized figures, as displayed on a microcomputer screen, representing available functions or resources 2. EASTERN ORTHODOX CH. An image or picture of Jesus, Mary, a saint, etc., venerated as sacred 3, any person or thing that is revered 4. Someone or something regarded as embodying the essential characteristics of an era, group, etc. Http://www.yourdictionary.com/icon I think it is fair to say that calling something an “icon” does not necessarily mean it is an artistic representation. Take the numbers “3” and “4” meaning For example: Alec Guinness is an icon of movie comedy Laurence Olivier is an icon of acting Christ is an icon of personal sacrifice Christ is an icon of love. Each of those statements is fair and depending on your view, all may be true..","date":"2015-08-12","mins":"5:38 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-10812","author":"john_klotz","post":"Confess Dan! You are obviously the Grand Master of the Priory of Zion and have been been waiting two centuries to show your true colors, biding your time playing gin rummy with Victor Hugo. I read a book about it, so it must be true..","date":"2012-04-24","mins":"10:04 am","url":"https://shroudstory.com/2012/04/24/conspiracy-theory-anyone/","cat":"other_blogs","title":"Conspiracy Theory anyone?"},{"id":"comment-196698","author":"john_klotz","post":"For some reason I commented here on another post which I recommend. Apologies. But it was a great post. See http://tofspot.blogspot.com/2013/08/button button whos got button.html.","date":"2015-04-18","mins":"8:49 am","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-197127","author":"john_klotz","post":"Charles, Your tendency to quote your anonymous colleagues who agree with you is getting a bit old. The burn holes are the finger prints of the Shroud. They were fequently replicated in copies of the Shroud. The difference between the Shroud and the copies is that holes are really holes in the Shroud and were surrounded with rings of charred material. You read about my paper on published on Shroud.com Go ahead, it’s free. Https://www.shroud.com/pdfs/klotzcnn.pdf As commentators on this blog have noted, the odds are that the repetition of the burn holes on a depiction of the burial of Christ is not related to Shroud are astronomical. And since you are an art historian, please, cite us any other works of art that display that pattern of holes which precisely match the pattern of the burn holes on the Shroud..","date":"2015-04-22","mins":"12:20 am","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-197128","author":"john_klotz","post":"Hugh, Light is radiation too. Depending on the chemical composition of where it falls it darken or it can bleach. When they did the multi spectum digial imaging of the Mona Lisa they had to use a soecially designed light source that would not damage the painting..","date":"2015-04-22","mins":"12:26 am","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-196683","author":"john_klotz","post":"Can’t say I welcome back Colin primarily because his post is totally off the mark. The thrust of the TOF post was history, not science. I look forward to informed comments in this chain on history pre Lirey of the Shroud including expected skeptical denials. – even from Colin. I would hope the skeptics would supply reason for that refutation of the history discussed at length in the TOF post with something more than invective. One of the comments on TOF blog itself was the claim that the posting had plagiarized Markwardt and Scavone. That would be difficult because Markwardt and Scavone have a scholarly disagreement about the timing of the arrival of the Shroud in Constantinople. Markwardt places it there earlier than either Scavone or Wilson has written. Moreover, you can’t plagiarize history. One case on that point was Harry Lincoln’s ill fated lawsuit against Dan Brown. Lincoln was one of the four authors of Holy Blood Holy Grail (HBHG). He claimed that Brown had plagiarized HBHG in the Da Vinci Code because he wrote of the Knights Templar having possession of the Shroud at some point. Brown won the law suit because of a very simple legal proposition: You can’t plagiarize history. What can’t be plagiarized are the author’s words if they are uniquely his or hers. Brown, Scavone and Wilson are writing historical texts. Any event that they report as an historical event can be reported as history by another author, but the second author can not do so in the original author’s unique own words without attribution. Incidentally, to accuse an author of plagiarism without a factual legal basis might be actionable slander. For example, I quote Tacitus, Boris Pasternak and Elaine Pagels in quotations of paragraph length or more in my book Quantum Christ with proper attribution and in Pagel’s case with her explicit permission. The other two authors were deceased at the time of my writing. Were someone to criticize me for saying I plagiarized those authors, that would potentially be a slander. Were they say I had just copied Tacitus or Pasternak, that would not be slander. One omission from the TOF post which is very relevant is a discussion of the Justinian coins that demonstrate “Vignon markings.” Both Wilson and Markwardt have written of them. You can read or download Markwardt’s presentation at the 2014 St. Louis conference at http://www.shroud.com/pdfs/stlmarkwardtpaper.pdf It is documented with 251 footnotes. Skeptics beware!.","date":"2015-04-18","mins":"6:24 am","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-171205","author":"john_klotz","post":"Hugh, Your statement is seriously false. Do you know Pam Moon? Have your read Rogers’ book? What about Carlos Evarista’s? The sample site contained anomalous material. The line in the site was dramatically different from the linen in the rest of the Shroud. Don’t rebut me rebut Ray Rogers’ meticulous book: A Chemist’s Perspective..","date":"2014-11-14","mins":"9:40 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"id":"comment-171196","author":"john_klotz","post":"Charles, We do not order our life by proof beyond a reasonable doubt (Quantum Christ, Introduction). In fact, particularly with ancient objects, we must rely on circumstantial evidence (See Dawkins, Richard). When there is a body of circumstantial evidence pointing in one direction, then that body of evidence may allow us to, and in law may force us, to reach a conclusion in that direction. It is an issue of probability, but at the quantum level of existence, everything is an issue of probability. There are well over a scores, it not more than a hundred, of hard facts from which a inference of authenticity. Maybe someone can do the math, I have to make a trip to the law library this morning, but what are the odds that a coin when flipped will come up heads or tails? For one flip it’s 50%. What are the odds that a coin when flipped will come of heads 80 times in a row. I believe the odds are in the line of one in the millions. Your speculations or theories are not facts. A hard fact might be the production of an existing similar object but even that would not be determinant. The only hard fact arguing against authenticity, is the carbon dating. However, that process was so deeply flawed as to become a non fact. As an analogy, in a trial, after extensive examination and testimony, it would probably be excluded from evidence. Seriously. I hate to sound/write like a lawyer, but proving facts by evidence is what I do for a living and have done for more than 50 years. I will confess though that when i graduated from high school I won four gold medals. History, Oratory, Religion and Science. That doesn’t make me a scientists obviously. In fact I chose a career in which history and oratory predominate. Maybe that was a mistake. Maybe a big one. But one of the saving graces of living and working in New York City is that my “hometown” paper is the New York Times. Their coverage of science is outstanding. And I have a library card for one of the world’s finest library systems. And there is the Internet. Let me ask you a question: what do you think of the concept of Boltzman Brains? It’s a little crazy, but it’s not totally irrelevant to the Shroud because it deals with the hypothetical existence of disembodied consciousness. I read about it in several places but you can read about in NY Times, if you wish. “Big Brain Theory: Have Cosmologists Lost Theirs?” N.Y. Times, January 15, 2008. I am not advocating for Boltzman Brains, but hey, as they say in the Lottery ads, “You never know.” [Irony intended].","date":"2014-11-14","mins":"8:07 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"id":"comment-171203","author":"john_klotz","post":"The issue for any scientific opinion is whether they have done the work. There is a tendency of the agonostic/atheist scientific community (not all scientists) to accept the carbon dating at face value because it comports with their world view and they can not deal with an authentic relic of Christ. In my manuscript I give as an example the late Carl Sagan writing in his posthumously published book “Billions and Billions.” “ ‘If we can measure the amount of radioactive parent material and the amount of daughter decay product in a sample, we can determine how long the sample has been around. In this way we find that the so called Shroud of Turin is not the burial shroud of Jesus, but a pious hoax from the fourteenth century (when it was denounced by Church authorities)…'(Emphasis added) “The basis of Sagan’s curt brush off of the Shroud was the D’Arcis memorandum discussed in Chapter 4. As noted, it is doubtful that the memorandum was ever delivered to Pope Clement and it was entirely based upon a hearsay statement uttered years before. D’Arcis claimed that his predecessor as bishop was told by an artist that he had painted the Shroud. Yet, the Shroud is not a painting. If there is a hoax at work, it is the claim that the Shroud is a painting. That hoax has been thoroughly debunked. “The scientific evidence that the Shroud is not a painting is overwhelming. It is obvious that those who still claim it is such have not taken the time to review the evidence with an unbiased eye. ” Quantum Christ, Chapter 18: The challenge of the Shroud. “.","date":"2014-11-14","mins":"9:34 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"id":"comment-10633","author":"john_klotz","post":"I posted this morning to the questioned blog: If your atheism is founded on the same reasoning that leads you to post that the Shroud of Turin is a medieval fake, than you have a problem. The medieval origin of the Shroud is preposterous. End of story. The image can not be replicated by any process demonstrated to have been used in the Middle Ages, actually, no process has been demonstrated today that can duplicate it. And the FACT is that the examination of the Shroud by forensic pathologists (are you one, or do you know one?) demonstrate physical conditions that are compatible with today’s science, but incompatible with known science until the turn of the last century. That is, until 1900 or so no artist – including Da Vinci – had the knowledge of anatomy to accurately depict in minute detail the condition of a tortured, crucified man – right down to analysis the content of his blood indicating stress and torture. Your medieval faker was not only a genius of not yet invented technology, he/she was a master of not then discovered physical and anatomical processes which could only be meaningfully analyzed again, at the turn of the last century. (1900) Among the autopsies published on the web is http://www.shroud.com/bucklin.htm There is a plethora (a lot) more information at http://shroud.com I don’t feel sorry for your ignorance, but I do feel sorry for those you mislead. Your arrogance is not merited. If I am harsh, it just that Shroud deniers who cite medieval origin for the Shroud are right up there with those proclaiming Obama is a Muslem. He isn’t and the Shroud is not a fake. Http://johnklotz.blogspot.com klotzlaw@gmail.com.","date":"2012-04-20","mins":"7:22 am","url":"https://shroudstory.com/2012/04/20/how-not-to-get-people-to-comment/","cat":"other_blogs","title":"How not to get people to comment"},{"id":"comment-10651","author":"john_klotz","post":"Guess what? I commented as above on the atheist blog and it didn’t get posted. I think we should award the site the Pope Richard Dawkins “let’s not get carried away with this free speech thing” Medal..","date":"2012-04-20","mins":"3:28 pm","url":"https://shroudstory.com/2012/04/20/how-not-to-get-people-to-comment/","cat":"other_blogs","title":"How not to get people to comment"},{"id":"comment-144527","author":"john_klotz","post":"What does this have do with 1350 CE? Medieval sources please..","date":"2014-08-18","mins":"7:03 am","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","title":"Into a World Not Cut Off from Reality?"},{"id":"comment-204044","author":"john_klotz","post":"To paraphrase Bill Clinton it depends on what the meaning of the word “:relic” is. Granted that one definition is more or less identical to artifact. However, it also has a more limited definition as meaning something connected to a particular figure often a saint. It might have a secular meaning even in that regard. Ben Franklin’s eye glasses would be a relic more than just an artifact. Do we have Washington’s wooden teeth? Brutus’s knife would be a relic more than a artifact but I don’t believe such exists. There is of course the arm of St. Francis Xavier that is a relic more than just an artifact. If the Shroud is authentic, than it would probably be the most studied relic in the limited definition of a relic..","date":"2015-06-29","mins":"6:18 am","url":"https://shroudstory.com/2015/06/29/is-the-shroud-really-the-most-studied-whatever-in-history/","cat":"comments_promoted","title":"Is the Shroud Really the Most Studied Whatever in History?"},{"id":"comment-201385","author":"john_klotz","post":"Marino and Benford had not published in a peer reviewed journal when Rogers first read their work. They had given a presentation in in Italy which was published on Shroud.com. Later they did publish in a peer reviewed journal but that was after Rogers’ death..","date":"2015-06-09","mins":"4:49 am","url":"https://shroudstory.com/2015/06/09/it-helps-to-read-what-you-cite/","cat":"other_blogs","title":"It helps to read what you cite"},{"id":"comment-54159","author":"john_klotz","post":"I am still waiting for Dave B to post something that is not well thought out and reasonable. Well done Dave, as usual..","date":"2013-11-30","mins":"9:05 am","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","title":"It may not suit the scientific mind-set"},{"id":"comment-201424","author":"john_klotz","post":"The “error” aside, you article was an excellent presentation of the issues and their resolution by the pioneering work of Sue Benford and Joe marino..","date":"2015-06-09","mins":"2:42 pm","url":"https://shroudstory.com/2015/06/09/it-helps-to-read-what-you-cite/","cat":"other_blogs","title":"It helps to read what you cite"},{"id":"comment-54200","author":"john_klotz","post":"We do not order our lives by proof beyond a reasonable doubt, let alone proof beyond any doubt. The scientific standard is a mirage. Take for example the enigmas of quantum mechanics. Every few years some one announces a new interpretation of quantum mechanics which explains everything and refutes prior interpretations. In began with the Copenhagen interpretation, I believe we are up to eight now, the ;latest one being announced this year “proves” that the others are false – at least the scientists who propounded it said. I really feel sorry for some one who insists on absolute proof which I guess is how some define scientific proof. There are no absolutes. We must live by reasonable belief. Even the criminal standard of proof beyond reasonable doubt allows room for unreasonable doubt. To believe only in absolute truth is to believe in nothing. Do you have faith in God. Is it the anthropomorphic God who walked and talked with Adam and Eve in the Garden of Eden? Do you believe that the disparity of human language was created by human hubris in attempting to build a Tower of Babel? Do you believe in Noah’s Ark in which very animal in the world was saved from a flood ordained by God in a single boat? Do you believe in a God who ordered Joshua to slaughter the women and children of Jericho? I don’t. I believe as St. John wrote: God is love. I believe also that truth will makes us free. And that liberating truth comes from love. I believe that all the commandments and prophecy are founded on love. The embodiment of that love was cruelly tortured and crucified – and rose from the dead by a process we do not yet understand. The scientific evidence of the authenticity of the Shroud demands a response. Not a speculation but one founded on reasonable facts. The only item that approached that was the carbon dating and that has been scientifically rebutted. I believe that the Shroud is a revelation left for this scientific era. The best is yet to be..","date":"2013-11-30","mins":"2:53 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","title":"It may not suit the scientific mind-set"},{"id":"comment-12034","author":"john_klotz","post":"I am fully in accord with he concept of peer reviewed research. However, the pace of science today and the necessity of collaboration, makes peer review the end of the process, not its beginning. The history of Science is replete with examples of important advances that were ridiculed and rejected by “scientific peers.” If we are to wait for peer reviewed journal articles before examining theories and the facts underlying them, we will seldom advance our knowledge into new theories or unexplained mysteries. One of the errors of the Vatican, was its repression of ideas deemed threatening to orthodoxy. I believe that the biggest tragedy of the Vatican’s forbidding Teilhard de Chardin to publish was a limitation on his ability to fully vet his ideas and through vigorous dialogue harmonize them more completely. The National Institutes of Health (NIH) is reviewing its own peer review process. Obviously a peer reviewed journal article has more authority than research results published on the Internet. However, it is important to both the researcher and and those interested in his research to be informed at in early stage. Critiques addressed to the specific findings or procedures are important and can be very helpful. Whether I agree with all the conclusions of the French researchers or not, I appreciate learning of their work and having an opportunity to examine it now, instead of months if not years down the line. After all, it was “peer review” of by the French Academy of Science, of the work of Yves Delage and his protege Paul Vignon that sunk initial scientific investigation of the Shroud of Turin for for decades. They had to wait three decades until 1930 for their vindication. For Delage, it came a decade too late. He passed away in 1920. ..","date":"2012-06-07","mins":"8:43 am","url":"https://shroudstory.com/2012/06/07/marcel-alonso-on-rogers-impurity-layer/","cat":"challenge","title":"Marcel Alonso on Rogers’ Impurity Layer"},{"id":"comment-155718","author":"john_klotz","post":"Reality is far more complex than the “rationalists” would ever admit. Their response to anything that doesn’t square with their dogged agnosticism or atheism is to simply write it off has a hoax. Some decades ago, we had in my hometown (Syracuse) a weeping Mary frenzy that indeed was a a hoax. A pubescent young girl claimed that she had dropped a statute that broke and when she picked it up the head and kissed it, it wept. (It might have been St. Anne, Mary’s putative mother). There was no scientific investigation to speak of for and after a few weeks or a couple of months of hysterical viewings it was found to be a hoax. Later, when I was in high school, one of classmates, who was from the same neighborhood, remarked, “If she kissed me, I would have cried too.” It wasn’t a comment on her looks. Anyone, who dismisses the Shroud image as other than an image of a horribly tortured, crucified man that was by all probability created within three days of his death, is a fool whatever his credentials. Science demonstrates that it IS. (caps not a typo) And the cause of science is not advanced by “scientists” who attack a particular religious belief without doing the science. You wonder why the fundamentalist “young earthers” reject science? The arrogance of lumping all religious belief together with known absurdities may be one reason. It is far easy for them to cling to error than accept the judgment of others that reject willy nilly all religious thought. In the case of climate change, the atheists and agnostics who proselytize for atheism instead of sticking to scince, are as big a danger as those who are driven to reject scientific proof by the arrogance of some scientists. And thn the question arises, whose paying for the opinion? See Dan Klotz, http://newswatch.nationalgeographic.com/2014/09/22/cannot save climate without trees/.","date":"2014-09-25","mins":"6:36 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","title":"Mars, Weeping Mary and the Shroud"},{"id":"comment-155868","author":"john_klotz","post":"Hugh, I find your post insulting. Are you familiar with Psalm 14: “14 The fool hath said in his heart, There is no God. They are corrupt, they have done abominable works, there is none that doeth good.” Perhaps you should write an outraged letter to King David, although you would be a little late. Actually, when i was in high school, one of my teachers quoted that as “only a fool says there is no God.” Do they quote scripture at the school where you teach? I don’t know how old you are, but at the time of the Martin incident I was 12 or 13. Not yet in high school. I remember well the hysteria which while it did not amount to thousands clogging the streets, it did include a crowd gathering to watch her kiss the statute. Granted I was not there for the viewing (or ostentation as it were.) I am afraid if you find my definition of rationalist offensive. TFB (The initials stand for something i will not write, at least not in this blog. Perhaps RTB would be more appropriate Really too bad.) TFB might have been what Lee might have said were he a bit more earthy in the Patton mode after Pickett’s charge disastrous climax at Gettysburg. Frankly, I find those who would sip and savor their ideas as if they were fine wine too be be both boring and often wrong. One of my favorite lines from Shakespeare was Mac Beth’s defiant challenge to Mac Duff: “Lay on, Macduff,. And damned be him that first cries, ‘Hold, enough!'” As far as scientists who while eminently qualified but are dead wrong on the Shroud I’ll give you two: Richard Dawkins and the late Carl Sagan. I discuss both in my manuscript. You’ll have to buy the book when it’s out. Maybe it’ll be a free bee of sorts in St. Louis if you are there..","date":"2014-09-25","mins":"10:34 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","title":"Mars, Weeping Mary and the Shroud"},{"id":"comment-155884","author":"john_klotz","post":"Hugh, Your comment reminds of the old childhood chant. “I am rubber you are glue, what you say about me bounces off me and sticks on you.” You asked me to name scientists, I named two. I am sure you know who they are and how well credentialed they are. That does not correct the foolishness of their comments on the Shroud. Dawkins once noted skepticism about the carbon results and then late described the carbon dating as “rock solid.” Any one who believes that at this point in time has rocks in their head. Sagan made a remark in his final book about carbon dating being a wonderful process by citing it as debunking the Shroud. The book was published posthumously before the avalanche of science proving the carbon dating defective for a variety of reasons. He can be excused. I discuss both in my book. (It’s coming, it’s coming) You can be skeptical about the Shroud if you wish, but citing the carbon dating is not skepticism but asininity. I use that word to describe the statement at the carbon press conference that “someone got a piece of linen and just flogged it.”.","date":"2014-09-25","mins":"11:01 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","title":"Mars, Weeping Mary and the Shroud"},{"id":"comment-155952","author":"john_klotz","post":"How much of the later science have you read. Can you give me anthology that supports your position? There will be more than few in my book..","date":"2014-09-25","mins":"12:51 pm","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","title":"Mars, Weeping Mary and the Shroud"},{"id":"comment-155918","author":"john_klotz","post":"Hugh, Read his book. He praised carbon dating and called the Shroud of Turin “a pious hoax.” [IMVHO the only hoax was the D’Arcis claim.] “If we can measure the amount of radioactive parent material and the amount of daughter decay product in a sample, we can determine how long the sample has been around. In this way we find that the so called Shroud of Turin is not the burial shroud of Jesus, but a pious hoax from the fourteenth century (when it was denounced by Church authorities)…” Carl Sagan, p. 21, Billions and Billions: Thoughts on Life and Death and the Brink of the Millennium (Random House, New York 1997) Given the books posthumous publication, there was apparently intended irony in its title..","date":"2014-09-25","mins":"11:55 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","title":"Mars, Weeping Mary and the Shroud"},{"id":"comment-157177","author":"john_klotz","post":"I had earlier named two scientists that had used the carbon dating to debunk the Shroud: Carl Sagan and Richard Dawkins. When challenged, I easily found the Carl Sagan quote, it was from last book and I quoted it. This morning reviewing my manuscript I found the Dawkins quote. It wasn’t from a book but from a posting on his web site. For information purposes here it is: “However two years later, on his foundation’s web site, he seemed quite self assured that the Shroud is a fake. In attempting to rebut the finding of Italian scientists’ “new evidence” that demonstrated that image of a crucified man on the Shroud could not be faked, he wrote: “The new ‘evidence’ amounts to yet another ‘Argument from Personal Incredulity’: the Italian scientists cannot understand how it could have been faked. By contrast, the carbon 14 evidence that the shroud’s linen is much too young to be the shroud of Jesus is rock solid. Three independent labs, in Arizona, Zurich and Oxford, were each given four samples, making 12 dating in all” (p. 13, Coming of the Quantum Christ).. That he got his facts wrong, implying that there were twelve samples carbon dated is a given. That he ignores the evidence of the anomalous nature of the sample site is an inconvenient fact that he does not either know or chooses to ignore – or rebut. In any event, he, as I stated my previous post, used the carbon “rock solid” carbon dating to debunk the Shroud. D=I do’t mean to str a debate but I just wanted to get the record straight..","date":"2014-09-27","mins":"6:32 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","title":"Mars, Weeping Mary and the Shroud"},{"id":"comment-155909","author":"john_klotz","post":"I missed your typo just as I often miss mine..","date":"2014-09-25","mins":"11:43 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","title":"Mars, Weeping Mary and the Shroud"},{"id":"comment-155908","author":"john_klotz","post":"John, I am not as simpleminded as I may appear on occasion. There are obviously many people who disagree with me and they are not fools. That would be a foolish statement. However, we do not order our lives by proof beyond a reasonable doubt. Some one who purports to be a scientist who doubts the authenticity of the shroud on the basis of the carbon dating without digging deeper is either disingenuous or a fool. Note I said “on the basis of the carbon dating” and “purports to be a scientist.” I would be happy to debate in any forum anyone who is a “scientist” and who rejects the authenticity of the shroud “on the basis of the carbon dating.” Right now however, after registering for the St. Louis conference, my travel budget is a bit constrained..","date":"2014-09-25","mins":"11:41 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","title":"Mars, Weeping Mary and the Shroud"},{"id":"comment-190370","author":"john_klotz","post":"I don’t know if our friend across the Pond is into Bob Dylan but is most oft quoted lyric is this: “You don’t have to be a weatherman to know which way the wind is blowing.” Or to wrench out of context a line from Peter Paul and Mary’s biggest hit: “The answer my friend is blowing in the wind.” I expect we will get a big wind answer, but it will be probably like the “Big Wind from Winnetka.”.","date":"2015-02-09","mins":"8:05 am","url":"https://shroudstory.com/2015/02/09/maybe-the-trickster-did-it/","cat":"other_blogs","title":"Maybe the Trickster Did It"},{"id":"comment-190373","author":"john_klotz","post":"Typo alert “Big Noise from Winnetka often misquoted as Big Wind. The lines is (2nd Repition) “Big noise blew in from Winnetka, “Big noise blew right out again”.","date":"2015-02-09","mins":"8:51 am","url":"https://shroudstory.com/2015/02/09/maybe-the-trickster-did-it/","cat":"other_blogs","title":"Maybe the Trickster Did It"},{"id":"comment-190423","author":"john_klotz","post":"Runner3350 I hope you realize when I referred to the Big Noise from Winnetka, I wasn’t referring to you but to a perennial skeptic who posts from England (the other sided of the Pond [Atlantic Ocean]).","date":"2015-02-09","mins":"1:30 pm","url":"https://shroudstory.com/2015/02/09/maybe-the-trickster-did-it/","cat":"other_blogs","title":"Maybe the Trickster Did It"},{"id":"comment-190408","author":"john_klotz","post":"One of the problem with this blog is at times, people don’t due irony (or humor). I find Paulette to be a master of irony. Thank God we have done a way with gender specific, stereotypical appellations. I once asked a female temp at my office (then in the Empire State Building) what her profession was and she said “Actor.” I thought that was odd for a moment and then validated it in my mind. So Paulette is a master of irony. And the Stumbler is a welcome addition to the Shroud community..","date":"2015-02-09","mins":"11:52 am","url":"https://shroudstory.com/2015/02/09/maybe-the-trickster-did-it/","cat":"other_blogs","title":"Maybe the Trickster Did It"},{"id":"comment-190443","author":"john_klotz","post":"Runner3350 has exposed an issue I have avoided for the specific reason if I true, the analogy would throw a monkey wrench into what I was going to do with the study of the Shroud. (I did manage to sneak one of JFK’s most elegant quotes from his speech an American University in Section C, The Challenge to Humanity in Chapter 18, the Challenge of the Shroud “For in the final analysis, our most basic common link is that we all inhabit this small planet. We all breathe the same air. We all cherish our children’s futures. And we are all mortal.” John F. Kennedy American University June 10, 1963 The point is there exist establishments that can not, or will not, deal with facts that are incompatible with their world view. In the Kennedy case it is, among others things, much of the mainstream media. In 1993, I wrote a two page Op Ed for Newsday about the phenomenon entitled “Why the Media Want the Inquiries to end.” It was placed by Newsday on the Washington Post LA Times news wire and has been referred to by one Warren report skeptic as the “best short summary of our position.” It may still be cited by other web pages on the Internet See http://www.johnklotz.com/new jfk.htm In the piece I wrote about the NY Times initial attitude about the Warren Report: “When the Warren report was issued in September, 1964, the media greeted it with universal praise. Its most popular edition was published by The New York Times. The introduction, written by Assistant Managing Editor Harrison Salisbury, pronounced, ‘No material question now remains unresolved, as far as the death of President Kennedy is concerned.’ To critics of the Warren Commission, Salisbury flashed a contemptuous warning: Those who spread irresponsible rumors about the assassination were either seeking to sow distrust and confusion among the public or intent on conveying to foreign countries the ‘image of a violent America, helpless in the face of dangerous forces.'” The issues are different and so is the establishment seeking to still threatening voices. In the Shroud’s case it is that part of the the Scientific establishment that can not deal with the possible reality of Jesus Christ and his purported Resurrection. When it comes to the Shroud, JFK is an aside, except what it can teach us about how establishments political or scientific – react to challenges to their world view. The fancy word for the process is “marginalization.” It is certainly at work in the study of the Shroud and the credibility wrongfully bestowed on the carbon dating continues to be the principal method of marginalizing Shroud studies. Yet, in neither the Kennedy casen or the Shroud, has the marginalization ended debate or study. Thank God! More power to you Runner3350..","date":"2015-02-09","mins":"4:28 pm","url":"https://shroudstory.com/2015/02/09/maybe-the-trickster-did-it/","cat":"other_blogs","title":"Maybe the Trickster Did It"},{"id":"comment-26987","author":"john_klotz","post":"Excellent questions..","date":"2013-03-10","mins":"10:23 am","url":"https://shroudstory.com/2013/03/10/old-video-ancient-secrets-of-the-bible-the-shroud-of-turin/","cat":"other_blogs","title":"Old Video: Ancient Secrets of the Bible – The Shroud of Turin"},{"id":"comment-72274","author":"john_klotz","post":"Mazel tov, You’ve earned it..","date":"2014-01-05","mins":"6:35 am","url":"https://shroudstory.com/2014/01/05/paper-chase-the-role-of-the-internet-in-the-future-of-shroud-research-way-back-in-1998/","cat":"other_blogs","title":"Paper Chase: The Role of the Internet in the Future of Shroud Research way back in 1998"},{"id":"comment-52379","author":"john_klotz","post":"Being cautious is not being duplicitous. While I can be critical of various popes, I think this is a bad rap. If anything, the Church is too often sweeping with a broad brush in its pronouncements. Georges Lemaitre was a priest scientists who first proposed the big bang theory of the creation of the Universe. He was for many ears the subject of scorn from other scientists. The atheists agnostics wanted a Universe that always was and was never never. Pope Pius XI wrote to Lemaitre that he has “proven” Genesis and the creation of the Universe by God. Lemaitre demurred. He cautioned the pope to be careful. Any scientific theory that is true today may be disproved tomorrow. Pius XI was indeed a remarkable man. As a young priest he had climbed the Alps with a young French man named Paul Vignon. That was before Vignon had a breakdown from which emerged the man we (at least all most all of us) honor for his work on the Shroud.Pius XI also wrote an encyclical attacking the Hitler and the Nazi’s that was released in late 1938 after his death. But Lemaitre was right, the Church must be careful before declaring any work of scholarship as true or false as a matter of faith. Again, I believe that it has been too quick to reveal truth at times. What it must be is open. The case of Galileo is an excellent example. Then too, there was Joan of Arc. Garry Wills placed St. Peters martyrdom at the time of Nero. He may have been a flaming torch at a Nero bacchanalia. He was probably betrayed by other Christians. So too was Paul. I realize that there are other scholars much more knowledgeable than I who on this blog who might have differing views, But I find the Church’s attitude of cautious reverence to be quite appropriate. On the other hand, the bones of St. Peter are not the singular Shroud of Turin. The Crucifixion of Christ as “King of the Jews” was a singular event. There were undoubtedly in sum thousands of martyrs. There are thousands of martyrs being suffering this day at the hands of radical Islamists (not all Moslems by any means). The claims of crucifixion and the details of crucifixion are set forth in four written accounts that date to traditions which arose at the time of his death and resurrection. We may have lost the earliest written accounts but the existence of the traditions is attested to not just the Gospels but by the martyrdom of those who proclaimed the Resurrection and faced sure death as a result. I may be on dangerous found here, but I am not willing to accept on as a matter of faith the opinion of one scholar as to the identity of St. Peter’s bones. That’s not duplicity. That’s caution..","date":"2013-11-22","mins":"8:06 am","url":"https://shroudstory.com/2013/11/22/quote-for-today-13/","cat":"other_blogs","title":"Quote for Today"},{"id":"comment-52380","author":"john_klotz","post":"Typo: found = ground.","date":"2013-11-22","mins":"8:09 am","url":"https://shroudstory.com/2013/11/22/quote-for-today-13/","cat":"other_blogs","title":"Quote for Today"},{"id":"comment-153732","author":"john_klotz","post":"To say that something can be forged is not evidence that it was forged. It’s merely speculation. I repeat my previous challenge to all those busy pseudo skeptics. Before you claim you have an answer, show me an example of the application of your answer circa 1530 or before. And don’t forget the variations in intensity that can be used to create a 3d representation of the image data. Without being able to illustrate your argument with a reasonable historical precedent your speculations are so much blather. They really are..","date":"2014-09-22","mins":"3:30 pm","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","title":"Samuel Johnson Meets His Match"},{"id":"comment-153482","author":"john_klotz","post":"Do I detect an new openness on CB’s part? Could this be the greatest conversion since John Newman. Oops. Sorry Dan..","date":"2014-09-22","mins":"4:31 am","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","title":"Samuel Johnson Meets His Match"},{"id":"comment-208606","author":"john_klotz","post":"The typography of this piece shows (a) it was created early in the morning and (b) edited inartfully. I will try to correct it so that it is more uniform. JCK.","date":"2015-08-20","mins":"6:43 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","title":"The End if Near"},{"id":"comment-208679","author":"john_klotz","post":"From Wright, Robert (2009 05 20). The Evolution of God (p. 335). Hachette Book Group. Kindle Edition: “Such parallels between the Bible and the Koran shouldn’t surprise us. Muhammad’s basic claim was that he was a prophet sent by the god who had first revealed himself to Abraham and later had spoken through Moses and Jesus. (One slightly ambiguous Koranic verse seems to say that he is the last in this lineage—the “seal of the prophets.”) The Koran is full of stories from the Bible and allusions to the Bible, including a monotheistic declaration that seems to come right out of Isaiah: “There is no God beside me.” 17 I once had an Iranian immigrant client who was Pharsi. He introduce to me the concept of “The people of the book.” That meant Muslims, Christian and Jews whose religions were all due respect. I suppose 1,000 years of religious strife including the Crusades and Muslim conquest of the Holy Land and invasions of Europe put a damper on “People of the Book” but a 2008 novel at that name tells a fictionalized story of the Sarajevo Haggadah. Ironically, one of the characters in the novel was a fictionalized Max Frei who found botanical artifacts on the Shroud of Turin in 1973 & 1978..","date":"2015-08-21","mins":"9:55 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","title":"The End if Near"},{"id":"comment-147539","author":"john_klotz","post":"What an awesome presentation. Petrus Soons and that photographer guy have made an invaluable contribution to the Shroud story..","date":"2014-08-31","mins":"9:16 am","url":"https://shroudstory.com/2014/08/31/shroud-4-kids-great-site/","cat":"other_blogs","title":"Shroud 4 Kids: Great Site"},{"id":"comment-208627","author":"john_klotz","post":"One of the messages of the Old Testament I believe is that God is essentially unknowable. Certainly that is a part of Christian theology. I have noted before, one the first lessons in catechism class (if not the very first) when I was seven was that becasue God exists beyond time and space we can never really understand and know him. He is a mystery. Having taught me that at seven, the Church has not spent seven decades teaching me all about God. I sense a conflict there. “In my Father’s house are many mansions: if it were not so, I would have told you.” John 14.2 The aberrant form of Islam practiced by ISIS does not represent the entirety of Islamic thought. Like Al Qaeda, they may kill more Muslims than Christians. In Appalachia, there are Christians who handle poisonous snakes thinking that faith in Christ will protect them. Every so often He doesn’t. Than there are Christian sects that turn their backs on modern medicine and refuse vaccinations and blood transfusions. Henry the VIII’s bloody tyranny in the name of Protestantism was matched by bloody Mary Stuart in the name of Catholicism. Queen Elizabeth’s reign was no walk on the beach either. ISIS is a plague on the face of the Earth for both Muslim’s and Christians. There are Islamic sects that are stuck in medieval times. Yet Islamic scholars in the Middle Ages were far advanced of Christian scholars in many areas including mathematics. Do not judge anyone by the label you hastily attach to him or her. “cast out first the beam out of thine own eye; and then shalt thou see clearly to cast out the mote out of thy brother’s eye.”.","date":"2015-08-20","mins":"10:46 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","title":"The End if Near"},{"id":"comment-208628","author":"john_klotz","post":"Typo alert “not spent seven decades” = “now spent seven decades”.","date":"2015-08-20","mins":"10:48 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","title":"The End if Near"},{"id":"comment-149415","author":"john_klotz","post":"Circumstantial evidence is a collection of coincidences that eventually can not be refuted by speculative surmise. If I roll two dice once and get two sixes (12) , it tells me little about the dice. But if I roll the dice ten times and get 12 each time, than the conclusion that the dice are skew becomes quite reasonable. If the dice never roll anything but 12s, then it’s pretty conclusive. It’s an application of the law of probabilities. It’s the accumulation of circumstances involving the Shroud that lead to the conclusion that it is authentic. Can there be doubt? Of course. Is it reasonable? Weigh the probabilities..","date":"2014-09-08","mins":"6:11 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-38510","author":"john_klotz","post":"Bravo!!!.","date":"2013-07-02","mins":"7:00 am","url":"https://shroudstory.com/2013/07/02/the-most-obvious-synthesis-of-all-the-evidence/","cat":"news_&_views","title":"The most obvious synthesis of all the evidence"},{"id":"comment-40053","author":"john_klotz","post":"Thomas de Wesellow labeled the carbon dating of the Shroud a “fiasco.” But it’s still there and the skeptics’ incantations awaken it every so often to haunt us again. It remains an easy out for those who can’t deal with the reality of Jesus Christ and the possibility the Resurrection is real. In my manuscript in progress, I have just finished Chapter 10 which deals with it and I am contemplating whether to release in some way which will not hurt the whole project which is “rounding the far turn and heading for the finish line.” Unfortunately, I have a jury to pick tomorrow in a difficult case that dragged along for more than seven years while the defendants slowed things down, hoping my client and I would just go away. We haven’t and as difficult as the case may be I have a duty to finally get it to trial. In the meantime if you haven’t read it yet I touch in a cursory fashion on the issue in my Quantum Christ blog. See “The Shroud of Turin: Henrietta Lacks and ASM Carbon Dating.” http://quantumchrist jck.blogspot.com/2013/05/the sgroud of turin henrietta lacks and.html There’s a typo in the URL but it works. But “Oh, to be torn twixt love and duty.” Anyone know where that comes from? Not to worry, I will not forsake the Shroud..","date":"2013-07-29","mins":"3:05 pm","url":"https://shroudstory.com/2013/07/29/the-shroud-of-turin-and-c14-case-closed-or-perhaps-not/","cat":"other_blogs","title":"The Shroud of Turin and C14:  Case closed. Or, perhaps, not."},{"id":"comment-38516","author":"john_klotz","post":"Occam’s Razor is a philosophical principle (not a sientific rule) that skeptics like to cite: the simplest solution is usually the correct one (or in a more complex form: the solution requiring the fewest assumptions is most likely the correct one) When it comes to the Shroud and the franatic efforts of skeptics to duplicate it, isn’t the simplest solution the Resurrection? Or to paraphrase Bill Clinton’s 1992 campaign theme: “It’s the Resurrection, stupid!”.","date":"2013-07-02","mins":"9:18 am","url":"https://shroudstory.com/2013/07/02/the-most-obvious-synthesis-of-all-the-evidence/","cat":"news_&_views","title":"The most obvious synthesis of all the evidence"},{"id":"comment-40210","author":"john_klotz","post":"Dave, You are a true Renaissance man. You never cease to amaze me with your vast trove of knowledge. On the other hand: Did you have to “google” it?.","date":"2013-07-31","mins":"4:19 pm","url":"https://shroudstory.com/2013/07/29/the-shroud-of-turin-and-c14-case-closed-or-perhaps-not/","cat":"other_blogs","title":"The Shroud of Turin and C14:  Case closed. Or, perhaps, not."},{"id":"comment-156777","author":"john_klotz","post":"I think Colin as identified himself as troll when it comes to this site. It is one think to argue against authenticity, it is another to paint with a broad brush those who disagree with you as ignorant or superstitious. That really is unacceptable and it provides no room for debate. If there is one thing the members of the STURP team were not it was “ignorant or superstitious.” The late John Heller when he was a Yale undergraduate was chosen in a special program to be advised by Einstein in Princeton 150 miles or so south of Yale. He began his work on the Shroud convinced that the Shroud was a fake. He changed his mind. It was not ignorance or superstition that changed his mind but the blood analysis that he and Al Adler did. They were fanatic about checking their observations with other colleagues for critiques. (So was Ray Rogers.) In my book, I quote from his memoir a moment when they reached out to other colleagues to check on their results: “Heller decided to check the results with at least two other top hemoglobin experts and see if they would be a sure as he and Adler were. “Adler got on the phone immediately and read the coordinates to his chosen specialist. The answer – old acid methemoglobin. Then they called Bruce Cameron on a speaker – phone. His double doctorate was dedicated to hemoglobin in all its many forms. After they had given him the numbers and plotted them, Cameron was a little sharp. ‘You both should know what it is. It’s old acid methemoglobin. I don’t know why you wanted to bother me with something you know as well as I do. . . Hey, wait a minute. Are you two idiots working on the Shroud of Turn?’ “Indeed they were.” Quantum Christ, p, 138 Copyright John Klotz 2014 The book will hopefully be available on line before October 9, 2014..","date":"2014-09-26","mins":"9:05 am","url":"https://shroudstory.com/2014/09/26/to-be-lost-in-a-sea-of-trolls-and-spam/","cat":"other_blogs","title":"To be lost in a sea of trolls and spam"},{"id":"comment-59837","author":"john_klotz","post":"We are at a real defining moment for the Catholic Church with the elevation of Pope Francis. He has already let be known that Catholics aren’t the only ones in Heaven (Whatever Heaven is. The eye has not seen etc.) And it was Pope Paul VI, not a loose canon reformer like the soon to be Saint John XXIII or this Francis guy (Thank God for loose canon popes!) who decreed that Jews could go to Heaven, too. Anyway, I can’t resist an old joke and I will make the principal of this story a female Episcopalian priest. Let’s call her Martha. Martha dies and goes to heaven and because of her work with the poor she is honored to be given a guided tour of the Celestial Realm by St, Peter. He points out to her the various rooms reserved in heaven. “In this room we have the Methodists. And in this room the Baptists and in this room, shh be quiet.” She obeys but as they have passed on she asks, “Why did we have to be quiet?” “Well that’s the Catholics’ room and they think they are the only one here.” My apologies for those demented Episcopalians who actually think that they are Catholics. There are some. Actually, anyone who lives a life of love is a Catholic, including not just Episcopalians, but Muslims, Jews, Buddhists, Taoists, secular humanists etc. At least that’s my opinion and I believe that’s Pope Francis’s also..","date":"2013-12-15","mins":"9:03 am","url":"https://shroudstory.com/2013/12/15/well-no-you-cant-call-him-a-catholic-wingnut-wingnut-yes/","cat":"other_blogs","title":"Well, no. You can’t call him a Catholic Wingnut. Wingnut? Yes!"},{"id":"comment-59840","author":"john_klotz","post":"A small additional note. There was an American President named Abraham Lincoln (and his successors) who played a role in Mexican independence. That America’s later record in Latin America is somewhat reprehensible is of no doubt. But one of JFK’s principal accomplishments was the Alliance for Progress and one of the little reported stories was the ferocious internal struggle with those who regarded all Latin American reformers as Communists. Later on it was “Christian soldiers” of the CIA who put Pinochet in power in Chile. Sometimes I think that not only does Christ weep, he sobs..","date":"2013-12-15","mins":"9:11 am","url":"https://shroudstory.com/2013/12/15/well-no-you-cant-call-him-a-catholic-wingnut-wingnut-yes/","cat":"other_blogs","title":"Well, no. You can’t call him a Catholic Wingnut. Wingnut? Yes!"},{"id":"comment-59883","author":"john_klotz","post":"Louis, That’s an interesting story. There were some razy claims a few decades back that a picture actually showed Greer shooting at Kennedy. That was pure nuts. But the article you posted makes an interesting point. (1) Was Greer a conspirator,(2) just badly trained, or (3) did his slowing down have nothing to do with Kennedy’s wounds. I end to (2) and (3) because there has to be a limit to the size of the conspiracy and I don’t know whther he car was solwed down at the time of the third (and possibly simultaneous fourth) shot. That ripped his skull open. That might make some sense but it contemplates a conspiracy so vast that it would boggle even my mind. If I live long enough maybe I’ll tackle JFK again. However, my decision two years ago was to tackle the Shroud not JFK. The primary reason being that I think any contribution I may make will be longer lasting if not “eternal.” (How’s that for Holy Hubris). In any event for anyone interested, my JFK piece which some long time JFK students have called the “best short summary of our position” ever printed. Http://www.johnklotz.com/new jfk.htm The best piece I ever did was about Candoleeza Rice two weeks before GWB was inaugurated in 2001. It more or less warned that the lack of Internet savvy and the concentration on unilateral rather than bilateral solutions to foreign policy underestimated the power of the Internet and was arguable prophetic of 9/11 “In some cases, superpowered individuals have the capability to wreak havoc on a scale unimagined before: witness terrorist leader Osama Bin Laden. In other cases, humanitarian goals have been advanced by coalitions of nongovernmental groups that national states, even the United States, ignore at their peril. Witness Jody Williams, who organized agitation for the land mine treaty, or the coalition of environmentalists, human rights activists and organized labor that stopped big power negotiations at the World Trade Organization dead in its tracks in both Paris and Seattle.” http://www.johnklotz.com/nlj10108.htm.","date":"2013-12-15","mins":"11:44 am","url":"https://shroudstory.com/2013/12/15/well-no-you-cant-call-him-a-catholic-wingnut-wingnut-yes/","cat":"other_blogs","title":"Well, no. You can’t call him a Catholic Wingnut. Wingnut? Yes!"},{"id":"comment-198758","author":"john_klotz","post":"Yannick’s paper’s paper was, and remains, a master piece,.","date":"2015-05-10","mins":"5:22 am","url":"https://shroudstory.com/2015/05/10/yannick-clment-on-colin-berrys-latest-hypothesis/","cat":"guest_posting","title":"Yannick Clément on Colin Berry’s Latest Hypothesis"},{"id":"comment-198782","author":"john_klotz","post":"Perhaps your refinement could include an example of the technique you are refining was actually used in medieval times..","date":"2015-05-10","mins":"12:32 pm","url":"https://shroudstory.com/2015/05/10/yannick-clment-on-colin-berrys-latest-hypothesis/","cat":"guest_posting","title":"Yannick Clément on Colin Berry’s Latest Hypothesis"},{"id":"comment-198790","author":"john_klotz","post":"If I am correct, you now admit can never offer any proof that your current hypothesis (one of several) that you are now working on could never be proven becasue it was an “one off” procedure and a hidden secret never to be revealed. Seriously? What a waste of time your efforts have been. Who do you seek to convince that your hypothesis has any historical reality? It looks to me you are simply trying to justify your skepticism..","date":"2015-05-10","mins":"2:07 pm","url":"https://shroudstory.com/2015/05/10/yannick-clment-on-colin-berrys-latest-hypothesis/","cat":"guest_posting","title":"Yannick Clément on Colin Berry’s Latest Hypothesis"}]
