[{"id":"comment-213764","author":"john_klotz","post":"Hugh, You supply an amazing amount of disinformation. Rogers had access to fibers from both sample and non sample areas and published the same. Where did you get the information they were never weighed?.","date":"2015-10-28","mins":"2:11 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"id":"comment-213743","author":"john_klotz","post":"All kidding aside, see infra, the authorities cited concur with Ray Rogers observation that there was a significant difference in the weight of the fibers in the samples and the weight of the fibers in the main body of the Shroud. Thank you EK.","date":"2015-10-28","mins":"6:08 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"id":"comment-213742","author":"john_klotz","post":"If the goal of the those that repaired the corner was an invisible repair that they would per force have replicated the banding where necessary. There is an old joke about Hong Kong tailors that illustrate the point. If some find it a little politically incorrect, I apologize. In the days before GB ceded sovereignty to the Chinese People’s Republic, tailors in Hong Kong were credited with legendary prowess. (I recall some decades ago receiving direct mail solicitations for Hong Kong suits tailored to my specifications. Never did it though) In any event, a businessman visited Hong Kong on the eve of an important meeting discovered that he had burned a cigarette hole into the sleeve of his suit, He was a aghast so he sought out a Hong Tailor and wanted him to replicate the suit and told him he needed it immediately but he wanted it exactly like the suit with the cigarette burn in the cuff. The tailor asked “Exactly?) He replied, “yes, perfectly.” The next day the suit was delivered and when tried his new suit on discovered that it had a burn hole in cuff..","date":"2015-10-28","mins":"6:00 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"id":"comment-48396","author":"john_klotz","post":"Hugh, The issue is interwoven Cotton. Rogers looked for it and did not find in any areas other than the C14 sample area. I am have an appointment so I can not comment further. And if you are relying on Mc Crone for anything, you really aren’t as smart as I thought you were. Mc Crone made it quite clear to Gove that he was interested in enhancing his reputation by proving the Shroud a fake, I am astonished by your seeming claim that no one examined the non sample area for cotton. Really. Rogers did and the entire STURP team did not find cotton in 1978. But you are simply factually wrong..","date":"2013-10-22","mins":"9:23 am","url":"https://shroudstory.com/2013/10/22/comment-promoted-is-cotton-unique-to-the-c14-sample-area/","cat":"carbon_14_dating","title":"Comment Promoted:  Is cotton unique to the C14 sample area?"},{"id":"comment-48437","author":"john_klotz","post":"Hugh, You seem to be dodging a point: the linen in the sample was subsatntially different than the rest of the Shroud. The distinction was found in the existence of vanillin in the sample but not in the rest of the Shroud. If a fire incident was responsible for excessive heat altering vanillin levels, the existence of significant vanillin in the sample and none in the rest of the Shroud would mean that the sample quite likely was not added to after the 1532 fire. The level of cotton was not a major factor in determing the age of the samples. The relative “youth” of the sample linen was far more important. I can not add anything to the post of O.K. As I am writing this from library but I thank him for his contribution. As far as I know Hugh you have never conducted experiments or eaxaminations of Shroud fibers. Neither have I. But you seem insistent that those who have such as Rogers are somehow incompetent or charlatans. Do you really think you are a better scientist than Rogers? If so, maybe we need more information about your publications and other scientific accomplishments. Since yousdenigrate the work of Rogers, Brown and Villarreal is that such an unreasonable request?Their credentials are a matter of public record. I once determined when I first starting practicing law that an expert was someone with a library card and a point of view, My son Michael later corrected me: an expert is someone with a library card, a point of view and a check. The only ones with a check in this case were the C14 labs. Packing up and heading home.","date":"2013-10-22","mins":"2:35 pm","url":"https://shroudstory.com/2013/10/22/comment-promoted-is-cotton-unique-to-the-c14-sample-area/","cat":"carbon_14_dating","title":"Comment Promoted:  Is cotton unique to the C14 sample area?"},{"id":"comment-48450","author":"john_klotz","post":"Colin, You ignore the established fact that Rogers did consult with colleagues including John Brown, Arnoldi, and Villarreal along with several of Villarreal’s associates..","date":"2013-10-22","mins":"5:58 pm","url":"https://shroudstory.com/2013/10/22/comment-promoted-is-cotton-unique-to-the-c14-sample-area/","cat":"carbon_14_dating","title":"Comment Promoted:  Is cotton unique to the C14 sample area?"},{"id":"comment-48469","author":"john_klotz","post":"Hugh, You are working awfully hard to impeach Rogers’ work. “There are a number of possible reasons for this, but I don’t know enough about them, yet, to be able to account for it. I note that a description of madder root dye, which Rogers also found, says that it contains three coloured chemicals (alizarin, purpurin and xanthin) and also lignin, gum, sugar, resin, and various other minor chemicals. I wonder if that could be the source of the vanillin?” The lignin is the source if the vanillin. Rogers gave a standardized test for vanillin which he tells us is actually the standard test for for lignin. .Are you playing possum? Asking a questions for which you think you have an answer? It would be nice if you could spare us the suspense and cite some authority for your speculation. If you can’t you are clearly in the area of pseudo skepticism, searching wildly for an explanation for facts you just can’t accept. I really think at this point, barring an explanation with citations to scientific authority as to why an experienced master chemist (which he was) like Rogers would be so ignorant as to not recognize the truth you may be withholding and mistake these seemingly disparate chemicals for vanillin which he has identified. That test was zero for the Shroud and quite high for the C14 and Raes samples. Are you saying the positive result for the test was caused by these chemicals. If you don’t have authority for that proposition, this discussion is over for now. Rogers documented for us in his article and book the steps he took and the tests he used to detect vanillin which is the standard test to identify lignin. No disrespect, but I have other fish to fry..","date":"2013-10-22","mins":"8:56 pm","url":"https://shroudstory.com/2013/10/22/comment-promoted-is-cotton-unique-to-the-c14-sample-area/","cat":"carbon_14_dating","title":"Comment Promoted:  Is cotton unique to the C14 sample area?"},{"id":"comment-48471","author":"john_klotz","post":"Okay. Once more into breach. Bravo Andy, bravo. There is no interwoven cotton on the Shroud in chief. That is the quite positive determination of the STURP team. Whether the interwoven cotton in the C14 sample itself was sufficient to skew the C14 results, the fact is that Rogers identified the linen in C14 as being of medieval or later manufacture. The initial impulse to think the cotton was the principal skewing agent was incorrect. It was the medieval manufacture of the patch with new European linen that was the principal cause. The test for vanillin by Rogers on the fibers from the Shroud in chief was negative – zero. The presence of vanillin in the sample taken from this woebegone corner was positive. They were not the same material. What you have pointed it reinforces the fact that the cotton would not have been in the Shroud when obtained by Joseph of Arimathea. As a devout Jew he would not have purchased a mixed item. As a matter of fact, when it was purchased by Joseph the science supports the conclusion that there was no cotton in the Shroud. Transient cotton contamination was observed. Not interweaving and splicing as occurred on the C14 sample. The interwoven and spliced cotton is an important marker, but the principal proof of age is the vanillin tests. PS: This discussion has really helped me sharpen my view. But it is really time to move on..","date":"2013-10-22","mins":"9:17 pm","url":"https://shroudstory.com/2013/10/22/comment-promoted-is-cotton-unique-to-the-c14-sample-area/","cat":"carbon_14_dating","title":"Comment Promoted:  Is cotton unique to the C14 sample area?"},{"id":"comment-48370","author":"john_klotz","post":"QED, maybe. I posted to Hugh as I recall, someone can check, that Rogers tests had determined a difference in vanillin between C14 fibers and fibers from the rest of the Shroud. I would be interested in any tests demonstrated contrary results in the non C14 areas from the main portion of the Shroud.. That test was limited to the linen fiber content of both C14 area and non C14 areas. Has anyone replicated those tests or shown them to be in error? I also recall that explanations that the vanillin content being non existent may have been caused by the fire in 1532. That of course would mean that the anomalous C14 area was certainly much younger than than the main body. Now the vanillin content may be a rough indicator compared to other methods of measuring age, but the difference between existence and non existence is pretty absolute. Let me quote Rogers directly: “Sometimes it is simpler to do an experiment. The fire of 1532 did that experiment for us. Any heating at the time of the fire would decrease the amount of vanillin in the lignin as a function of the temperature and time heated. Different amounts of vanillin would have been lost in different areas, depending on the temperature and how long the temperature took to return to normal.. No samples from any location on the Shroud gave the vanillin test. Since the Shroud and other very old linens do not give the vanillin test, I believe that we can be confident that the cloth is quite old. It is very unlikely that the linen was produced during medieval times. See Chapter IX for an explanation of the difference between the radiocarbon age determination and the observations on the linen’s production technology and composition.” (Rogers, p. 43, A Chemist’s Perspective on the Shroud of Turin, Barrie Schwortz, Florrisant, CO., 2008) (Barrie was the editor and publisher of Rogers’ book which is available on Lulu.com) What this may mean is a direct connection between the Margaret of Austria’s will and the patch is not likely. However, that was a theory or speculation. The key is the difference in composition, whatever the cause. The fact is that we do not know, and will probably never know, how many times the Shroud was altered or mended. Enzo Delorenzi, a member of the Turin Commission that studied the Shroud in 1969 and 1973, wrote: “…I should like to mention the impression I received during the course of my examination, namely, that more pairs of hands have carried out the darning than is suggested in the historical records (the four Clarissas of Chambery, the Blessed Valfre and the Princess Clotilde).” Because the only interwoven cotton verified on the Shroud is in the anomalous area of the C 14 testing, what Berry and Freeman have demonstrated is that the anomalous area is in fact of medieval origin. QED Does anyone have any evidence of this cotton interwoven in any other area of the Shroud? Rogers had fibers from non Raes C14 areas of the Shroud and checked those against his findings of he Raes sample. They were different and he did not find interwoven cotton. I think I cam agree with Berry and Freeman: the C14 area contained medieval cotton and linen inter woven. To prove that it is not anomalous, demonstrate were else on the Shroud such interwoven fibers exist? Do they exist throughout the Shroud? Note, there are other patches but only some are documented. Evidence other Mde Fleury Luxemburg’s visual observations is necessary because the contrary evidence is “deep” scientific examinations. Until someone does, I’m moving on although I will cover this in a post to my blog sometime this week if I have a chance to do it right. Let me state, I appreciate these interchanges. I will adjust my thoughts when appropriate. There is great deal of romance to the Margaret of Austria will theory. It appears that it will never be proven. It also appears that while Rogers and his associates proved the anomalous nature of the C14 area, he may have may disproven the will theory..","date":"2013-10-22","mins":"7:09 am","url":"https://shroudstory.com/2013/10/22/comment-promoted-is-cotton-unique-to-the-c14-sample-area/","cat":"carbon_14_dating","title":"Comment Promoted:  Is cotton unique to the C14 sample area?"},{"id":"comment-48552","author":"john_klotz","post":"Dave, Thank you..","date":"2013-10-23","mins":"4:23 pm","url":"https://shroudstory.com/2013/10/22/comment-promoted-is-cotton-unique-to-the-c14-sample-area/","cat":"carbon_14_dating","title":"Comment Promoted:  Is cotton unique to the C14 sample area?"},{"id":"comment-48386","author":"john_klotz","post":"Colin, I think I made myself clear in my last post. There have been detailed scientific examinations of the Shroud particularly in 1978. None of the STURP scientists found interwoven carbon in the parts of the Shroud they were examining. The lower corner that was frequently handled throughout the public expositions of the Shroud through 1933 was not an object on interest because they were concentrating on the image and blood stains, none of which were in that corner. There is an interesting papers by Mark Oxley that covers the water front. Http://www.shroud.com/pdfs/oxley.pdf One thing I learned from the Oxley paper that I had not noticed before is a comment by Rogers that the procedures for cleaning the samples prior to the C14 tests would have removed the evidence of the dye that he found. Rogers samples were not decontaminated and therefore the evidence of the dye was still there. I would appreciate your not arguing this point with me. None of my research is original and I rely on published sources. Read the sources such Oxley’s article and then if you have counter sources or observations state them. But the Shroud is a physical object and there is an enormous amount of published data on its scientific examination. Seat of pants observations or “trust me, I am a physicist,” without citation to that data, just don’t cut it. That certainly applies to art historians who carefully opine with out any detailed reference to the scientific data. As I noted in an earlier post today, the rapture that you have proven that the interwoven cotton was of medieval origin only proves that the patch is newer than the main body of the Shroud which lacks such interwoven cotton. QED I am sorry that my request to Freeman to produce his resources offended you. I think my language while sharp was appropriate. I sure you are aware, given your background, of the old adage: “If you can’t stand the heat, get out of the kitchen.” Perhaps my work at sometime will invoke a more public debate beyond this blog. I certainly hope so..","date":"2013-10-22","mins":"8:37 am","url":"https://shroudstory.com/2013/10/22/comment-promoted-is-cotton-unique-to-the-c14-sample-area/","cat":"carbon_14_dating","title":"Comment Promoted:  Is cotton unique to the C14 sample area?"},{"id":"comment-48388","author":"john_klotz","post":"At some point, I will address the difference between pseudo skeptics and skeptics in depth, but not today. The difference is that the a true skeptic will recognize when the burden of proof shifts. I believe the enormous volume of literature demonstrating the anomalous nature of the C14 sample area has shifted the burden. The scientific examinations of actual samples of fibers from other parts of the Shroud demonstrate no interwoven carbon. If you maintain that the C14 site is not anomalous, demonstrate the places apart from the C14 site where interwoven carbon exists and where there is comparable amounts of vanillin to the patch era. Please pseudo skeptics understand that the burden has shifted and Rumpelstiltskin tantrums will not change that fact. The ball is in your court..","date":"2013-10-22","mins":"8:49 am","url":"https://shroudstory.com/2013/10/22/comment-promoted-is-cotton-unique-to-the-c14-sample-area/","cat":"carbon_14_dating","title":"Comment Promoted:  Is cotton unique to the C14 sample area?"},{"id":"comment-41245","author":"john_klotz","post":"This is a fascinating blog by someone well versed in Catholic theology and history (or so it appears to me). It is amazing the number of good, dedicated people who study the Shroud. Then, there are some strange, not so well motivated. See the “da Vinci did it” advocates. [It is also amazing that it took me a year or so to discover how the spell checker works on this blog.].","date":"2013-08-14","mins":"6:11 am","url":"https://shroudstory.com/2013/08/14/or-it-is-the-first-century-burial-cloth-of-yussuf-schmoe/","cat":"other_blogs","title":"Or it is the first century burial cloth of Yussuf Schmoe?"}]
