[{"id":"comment-216036","author":"max_patrick_hamon","post":"To David Goulet, it is far from proven that Luke was a physician (“doctor”). Reminder: Luke in Greek is Loukas and Lucius in Latin, from the verb luceo, lucere, “to shine”. Yaïr is the Hebrew for Luke/Loukas/Lucius and Yaïr is transcripted Iairos in Greek, which is very close to Iatros. Now in Greek the cursive “t” can easily be mistaken for a cursive “i” and iairos turn into iatros, “physician”. Actually, no Biblical scholar worth his/her salt can tell for sure whether or not iatros is just a mistranscription in Greek of the Hebrew given name Yaïr..","date":"2015-12-09","mins":"1:31 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216054","author":"max_patrick_hamon","post":"David, thank you for your kind lexis (sorry, I mean word)..","date":"2015-12-09","mins":"4:35 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216065","author":"max_patrick_hamon","post":"Nabber, you may be right STILL in the NT, Yeshu’a’s choice of language (in his logia) do not give him away or make him a carpenter at all! Not even once in the whole NT he alludes to carpentry or use the carpenter jargon ,whether literally or figuratively. Using the same method as you use for Luke, shall we deduce Yeshu’a was not a carpenter? His choice of language apparently is much akin to that of a fisherman or a builder/stone cutter. Myself I can currently use the medical language and yet I am not a physician. Actually I can use the marine office language too yet I am not a marine officer (my father was)..","date":"2015-12-09","mins":"5:41 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216066","author":"max_patrick_hamon","post":"Typo: naval officer.","date":"2015-12-09","mins":"5:47 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"}]
