[{"id":"comment-34652","author":"max_patrick_hamon","post":"Reminder for Russ (which was also adressed to Jason): Second Temple period gardeners used to wear a sindon (or achiton/hemation) next to the skin as workwear… Hence Yeshua’ long (inner) burial or sindon was not even left behind in the cave tomb as most likely he was draped in it when he appeared to Mary of Magdalene. Augustine of Hippo’s exegesis is also a clue to a better understanding of the famous scene. Unfortunately, the exegesis bias came in with John Chrysostom who most probably saw the shroud and included it into the empty tomb scene for liturgical purpose. For additional clues, you should also study Yeshua’s hemation/sindon Byzantine and Medieval iconography in conjunction with the empty tomb scene, his apparition to Mary Magdalene on ‘that morning’, descension to hell to free those held captive by sin and ascension to heaven. + of course..","date":"2013-05-24","mins":"1:53 pm","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","title":"A kind of witness?"},{"id":"comment-34436","author":"max_patrick_hamon","post":"In criminology “the silent witness” is the dead (not the resurrected)..","date":"2013-05-23","mins":"7:08 am","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","title":"A kind of witness?"},{"id":"comment-34437","author":"max_patrick_hamon","post":"Russ why don’t you ask Augustine of Hippo about the empty tomb scene? Was Yeshua’ naked when he appeared to Maria Magdalene?.","date":"2013-05-23","mins":"7:19 am","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","title":"A kind of witness?"},{"id":"comment-34438","author":"max_patrick_hamon","post":"Most Christians rely on a totally biased exegesis of the empty tomb scene..","date":"2013-05-23","mins":"7:22 am","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","title":"A kind of witness?"},{"id":"comment-8848","author":"max_patrick_hamon","post":"I am quite aware I go against the consensus, thak you. In terms of indulging in bad tempered gratuitous abuse, you definitely are the best Dave!.","date":"2012-03-01","mins":"6:12 am","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"},{"id":"comment-8855","author":"max_patrick_hamon","post":"Is it a Christian virtue?.","date":"2012-03-01","mins":"8:52 am","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"},{"id":"comment-8849","author":"max_patrick_hamon","post":"In my eye, A MAN named YôHanan created the Book of Revelation. He wrote it while in deep mystical meditation in front of Rabbi Yeshua’s Shroud. Yôhanan was both a disciple of Yeshua and a former high priest (AD 36 37) sent in exile. His high priest name was Yônatan. He was one of the five sons of a former high priest named Hanan. In his book, the destruction of the Temple of Jerusalem is prophesised. The cryptic reference (666) is not so much to Nero as to “Herodotos” (a generic Greek name to refer to the Herodian dynasty). I must admit it may be futile to some Christians’ eyes to hear about it..","date":"2012-03-01","mins":"6:37 am","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"},{"id":"comment-8851","author":"max_patrick_hamon","post":"Correction: “I must admit an archaeocryptologist’s opinion may sound futile to some Christian’ ears. All the more so as it goes against a Christian consensual ready to think”.","date":"2012-03-01","mins":"7:35 am","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"},{"id":"comment-8850","author":"max_patrick_hamon","post":"Ron you wrote: “my simpleton mind tells me the Lord would definately not create his book so ‘cryptic’ as for only the studied few to understand, but ‘simple’ for all to understand!!” How then will you account for the Shroud being “an on going mystery”? How will you account for the Book of Revelation not to be clearly readable by most Christians till today? Have you ever heard of cryptochristianism? Why don’t you or Dave, as Christians, recur to the Holy Spirit and give us the right way to read the Book of Revelation and solve the Shroud mystery?.","date":"2012-03-01","mins":"7:04 am","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"},{"id":"comment-8871","author":"max_patrick_hamon","post":"Correction: “Are you harbouring any ill rancour”.","date":"2012-03-01","mins":"6:06 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"},{"id":"comment-8868","author":"max_patrick_hamon","post":"Allow me to disagree (once more) with you Ron.The Shroud of Turin might well be compared to/identified with a fifth Gospel written with the very flesh and blood of Rabbi Yeshua. Besides any genuine leap of faith cannot just rest on half truths, received ideas and the like that litters the Turin Shroud topic. As an archaeological truth quester, I am just trying to give “my opinion” as a different viewpoint on the Shroud even if it may go against the Christian or non Christian “well thinking” conservative consensus. Not a very easy task with people like you or Dave all too ready to ad hominem attacks! No wonder if I strike back! I have welcomed many an opinion other than mine on the Shroud since I got interested in the issue but it does seem you, most unfairly, prefer to only retain the opinions I totally disagree with. Are you harbouring any personal rancour against me, Ron just because twice or thrice I told you I thought you were totally wrong?.","date":"2012-03-01","mins":"4:21 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"},{"id":"comment-8649","author":"max_patrick_hamon","post":"TURIN SHROUD: AN ARCHAEOPERCEPTIVE GAME FOR CHILDREN? BTW, do you know the very name of “Christopher” comes from the Greek “kristos phoros” and might well be understood in the light of the Turin Shroud as a cryptic reference to “Christ[‘s burial Shroud] bearing [his flesh & blood image]. Cannot you ears hear? All the more so as the legendary saint is described, in the late antique hagiographic key scene, as A GIANT IN MIDSTREAM carrying the INFANT JESUS on his shoulders. Cannot your eye see? (To see the scene, first take a look at the whole front image on the Turin Shroud held in a vertical position. At scale 1/1, doesn’t the Shroud man look like a GIANT? Then just consider the zigzag weave patterned lengthy sheet. Cannot it evoke the iconographic reduction of a river or ford? VVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVV VVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVV Now, look at the back and front discontinuous images of the head and squint. Cannot you find where the infant Yeshua is? Etc. ; ).","date":"2012-02-23","mins":"9:10 am","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"},{"id":"comment-8873","author":"max_patrick_hamon","post":"Can you judge yourself with the same measure you judge me?.","date":"2012-03-01","mins":"6:24 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"},{"id":"comment-8872","author":"max_patrick_hamon","post":"Ron, you just cannot help making ad hominen attacks. Another of your Christian virtues I guess. I do remember you telling me outright my exegesis of Rabbi Yeshua’s burial made no sense. Were you then arrogant, ignorant or both?.","date":"2012-03-01","mins":"6:16 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"},{"id":"comment-8862","author":"max_patrick_hamon","post":"About careful discerment and the Christian’s duty to the truth: 1 Thessalonians 5:19 22 “Do not quench the Spirit; do not despise prophetic utterances. But examine everything carefully; hold fast to that which is good”..","date":"2012-03-01","mins":"12:10 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"},{"id":"comment-8793","author":"max_patrick_hamon","post":"Dave wrote: Tempting thought BUT: Legend of St Christopher dates from the third century, possibly a little early to be a cryptic reference to the Shroud as I suspect it would not be adequately known about until the sixth century. Dave, Actually “Sindonocryptography” might well have started as early as the 3rd century and even before i.e. In parallel with cryptochristianism. My opinion is most if not all of late antique Christian hagiographic legends and apocalyptic visions have a sindonocryptographic substratum (I have done quite a research work on this. E.g. John’s Revelation can be read in cryptic conjunction i.e. In “primary visualisation” with the Shroud image as oversized Rorschach. Too bad it was damaged in the 1532 fire (meaning a few of John’s visions “sindonocryptographically” are now lost on us)..","date":"2012-02-28","mins":"6:58 am","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"},{"id":"comment-8650","author":"max_patrick_hamon","post":"Corrections: “and might well have to be understood” “flesh & blood image]? “Cannot your eyes see?”.","date":"2012-02-23","mins":"9:25 am","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"},{"id":"comment-8835","author":"max_patrick_hamon","post":"Dave whether you like it or not,I do think you are totally off track with your “ready to think” exegesis of the Book of Revelation. Whether you look or not for the features I mentioned, I could not care less since I know you to be a “nihilistic illiteralist”. In Hebrew my family name means “Universe”, “Vast World” and I have lived and worked on four of the five continents, thank you to remind me “there is a wider world out there”! Your full sentence: “We tend to see on this site commentators with their own narrow specialised focus, complete with their own jargon calculated to intimidate others, which they claim is the only legitimate way, a product of an academic age perhaps, but there is a wider world out there.” Have I really to justify the reason why I find it more accurate to speak about “sindonocryptographic substratum” and “archaeoperception” when it comes to describe my own specific approach? Shall I feel guilty to be an archaeocryptologist? I m not here on this blog to use a jargon calculated to intimidate others but only to share and advocate a different viewpoint on the Shroud with those who care to hear it and be as synthetic as possible… I wish you REALLY had “a more open frame of mind” than you claim you have….","date":"2012-02-29","mins":"7:27 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"},{"id":"comment-8823","author":"max_patrick_hamon","post":"In my opinion, the Book of Revelation can be read as a cryptic allusion to Yeshua’s Shroud not only as a substitute to the curtain or veil of separation that hung in the Tabernacle/Temple and divided the latter into the Holy and the Holy of Holies but also as a substitute to the Tabernacle/Temple itself as the symbolic place where G.d in His grace came down and met man. The Temple/Tabernacle as “the dwelling place of G.d” can be rendered in Hebrew by « Gar ‘El » (literally “G.d dwells” and “G.d shines forth” > old French « Graal ») and in latin by « Deus Habitet » (Tabernacle). In the eyes of early Christians, Yeshua’s Shroud might well have been the Tabernacle of Tabernacles as it had received the translucid flesh and blood image of the High Priest of High Priests (see the Epistle to the Hebrews). From a Late Antique “archaeoperceptive” viewpoint, far from being an actual straightforward description of the Shroud image, YôHanan/John’s visions read more like something with “sindonocryptographic” undertones. As an “archaeoperceptive starter”, what if I tell you that, in “primary visualisation”, you can see in the Shroud front image, Yeshua/Jesus wearing a garment soaked with blood (upper part of front image) while riding a white horse (lower part of front image)? Although this is the easiest apocalyptic key vision to detect on the Shroud, you still may have some hard time to see the front horse pareidoliac image from the pelvis legs image area. A good trick if you want to see it is to squint through semi closed eyelids. I am perfectly aware this archaeoperceptive image goes against the dominant pseudo rationalistic exegesis surrounding The Book of Revelation you advocate. I am perfectly aware it just will not fit with what many Christians wish to/can see. Eppure si può anche vederlo….","date":"2012-02-29","mins":"9:10 am","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"},{"id":"comment-17630","author":"max_patrick_hamon","post":"Charles, for once we may well agree. Shroud reseachers should investigate the possibility for the TS to have been in Italy (Rome then Ravenna) before 500 just before it reached Edessa (the Parthian Rome)..","date":"2012-10-14","mins":"11:40 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17631","author":"max_patrick_hamon","post":"Addition: before it reached Edessa via Cyprus..","date":"2012-10-14","mins":"11:42 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17757","author":"max_patrick_hamon","post":"Reply to YC: The latter wrote: ‘THERE IS ABSOLUTELY NO HISTORICAL INDICATION THAT THE SHROUD OF TURIN EVER SPENT ONE DAY IN EDESSA…” My PERSONAL research and studies on the TS allowed me to identify the partial decal of a Syriac text in Nestorian style just below the TSM’s beard. My finding is in keeping with the very first version of the Abgar legend. I shall further investigate the fragment to know whether it may be or not referable to Yeshua’s apocryphal letter to the Parthian king. This is a palaeographic piece of evidence/”indication” the TS could have been in the Parthian Rome namely Edessa… To this is should be added, I aslo found archaeopareidolias of infant, child adolescent faces in conjunction with the TSM’s face. The second finding is ALSO in keeping with the Image of Edessa connection re a most secret Nestorian Easter liturgical ritual (see my flash illustrated paper). The vast nimbus like discoloration surrounding the TSM’s face, is also consistent with the Image of Edessa Christological iconography not to mention the latter designation both as a “rakos tetradiplon”, (an old piece of stained/soiled cloth/rag with holes) and a “himation” (a long rectangular cloth). The very Greek word himation can translate the Hebrew Tallith and is also a synonym of the Greek Sindon, a term referable to a bed sheet, a night wear AND a …burial cloth. THUS THERE ARE AN ARCHAEOCRYPTOLOGICAL, PALAEOGRAPHICAL LITERARY, ICONOGRAPHIC & PHILOLOGICAL PIECES OF EVIDENCE INDICATING THE SHROUD OF TURIN COULD HAVE SPENT MORE THAN ONE DAY IN EDESSA..","date":"2012-10-17","mins":"4:03 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17759","author":"max_patrick_hamon","post":"Mistyping: Therefore WHEN PUT TO GETHER, THERE ARE ENOUGH ARCHAEOCRYPTOLOGICAL, PALAEOGRAPHICAL LITERARY, ICONOGRAPHIC & PHILOLOGICAL PIECES OF EVIDENCE TO MAKE A CRUCIAL EVIDENCE: IN ALL LIKELIHOOD, THE SHROUD OF TURIN WAS ONCE KNOWN AS THE IMAGE OF EDESSA..","date":"2012-10-17","mins":"4:16 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17663","author":"max_patrick_hamon","post":"Charles and all, I have achieved the palaeographic dating of the Turin Sindon image and even succeeded in accurately reconstructing via numismatic eidomatics, two Pilate coin obverses from partial faint tiny (brown to carmin brown) hematic coin decals left on the TS man’s eye areas..","date":"2012-10-15","mins":"12:53 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17682","author":"max_patrick_hamon","post":"I deplore too many Shroud scholars non qualified in the 4 relevant fields of expertise (namely Roman and Byzantine Art History, archaeological image analysis and cryptanalysis) tackled the pre 10th c. CE Roman and Byzantine Christological iconography issue and imposed their biased views..","date":"2012-10-16","mins":"6:55 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17679","author":"max_patrick_hamon","post":"When it comes to pre 10th Roman and Byzantine Christological iconography, one shall be able to discriminate between true and false accidental characteristics (A Ch) all the more so as no mre than 2 3 clearly copied true A Ch can work as tiny pieces of evidence, which once put together make a crucial evidence much akin to fingerprints..","date":"2012-10-16","mins":"6:39 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17683","author":"max_patrick_hamon","post":"Mistyping: “non qualified in AT LEAST ONE of the 4 relevant fields of expertise”.","date":"2012-10-16","mins":"7:03 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17685","author":"max_patrick_hamon","post":"Mistyping: “pre 6th c. CE Roman and pre 12th c. CE Byzantine Christological iconography”.","date":"2012-10-16","mins":"7:14 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17687","author":"max_patrick_hamon","post":"Not to mention 11th 12th c. CE Benedictine Christological iconography. (Pray codex miniatures)..","date":"2012-10-16","mins":"7:20 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17688","author":"max_patrick_hamon","post":"… or Civate wall frecoes).","date":"2012-10-16","mins":"7:22 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17689","author":"max_patrick_hamon","post":"Most curiously, no one has ever seriously considered the possibility for a specific burial ritual to (also?) contaminate the TS….","date":"2012-10-16","mins":"7:36 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17765","author":"max_patrick_hamon","post":"Just in case Yannick Clément missed my last post: YC wrote: ‘THERE IS ABSOLUTELY NO HISTORICAL INDICATION THAT THE SHROUD OF TURIN EVER SPENT ONE DAY IN EDESSA…” The facts is my PERSONAL research and studies on the TS allowed me to discover several pieces of evidence implyng the TS image could have been known as the image of Edessa: 1/ I dentified the partial decal of a Syriac text in Nestorian script just below the TSM’s beard. I shall further investigate the fragment to know whether it may be or not referable to Yeshua’s apocryphal letter to king Abgar (see the earliest version of the Abgar legend) 2/I detected archaeopareidolias of infant, child adolescent faces in conjunction with the TSM’s face. This is also in keeping with the Image of Edessa connection re a most secret Nestorian Easter liturgical ritual (see my flash illustrated paper). 3/ I also detected a vast nimbus like discoloration surrounding the TSM’s face. This is also consistent with the Image of Edessa Christological iconography. 4/ The Image of Edessa’ is described both as a “rakos tetradiplon”, (i.e. An old piece of stained/soiled cloth/rag with holes folded/doubled in four) and a “himation” (a long rectangular cloth about 420cm long and 140cm wide for a man 5ft 8″ 6ft2″ tall like the TS Man). Now the very Greek word himation can translate the Hebrew Tallith and is also a synonym of the Greek sindon,; a term referable in turn to a bed sheet, a night wear AND a …burial cloth. Although my findings still need some refinement and extension, a fact remains: WHEN PUT TO GETHER, THERE ARE ENOUGH ARCHAEOCRYPTOLOGICAL, PALAEOGRAPHICAL LITERARY, ICONOGRAPHIC & PHILOLOGICAL PIECES OF EVIDENCE TO MAKE A CRUCIAL EVIDENCE TO WIT IN ALL LIKELIHOOD THE SHROUD OF TURIN WAS ONCE KNOWN AS THE IMAGE OF EDESSA..","date":"2012-10-17","mins":"5:28 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17796","author":"max_patrick_hamon","post":"I mean Archaeo CRYPT Ology (hence CRYPT Ohistory). In this light, philological, iconographic epigraphical, literary, perceptive archaeological facts are NOT speculations! REMINDER for a close minded Geographer tackling History: The latter CAN/DID/DOES RECEIVE LIGHT from archaeology. Do your home work, try to think by yourself and stop parroting Green and set minded pro domo Art historians….","date":"2012-10-18","mins":"9:00 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17800","author":"max_patrick_hamon","post":"BTW, how can you tell my dectection of the partial decal of a Syriac text in Nestorian script is a speculation? Why don’t you ask instead a specialist of Semitic languages and especially Syriac? He could tell you. You cannot. What do you REALLY know about epigraphy? What do you REALLY know about philology? What do tou REALLY about Late Antique & Medieval iconology? What do you REALLY know about Late Antique & Medieval legendary literature? What do you REALLY know about Late Antique & Medieval image/text archaeological analysis and cryptanalysis? Who’s speculating?.","date":"2012-10-18","mins":"9:36 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17797","author":"max_patrick_hamon","post":"…ease off the pathologic speed pedal about Wilson’s mistakes too (Although the matter may have been 75% wrong, he also was quite insightful once or twice)..","date":"2012-10-18","mins":"9:14 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17802","author":"max_patrick_hamon","post":"You cannot even recognize a himation when you see one in a wall fesco or a mosaic!.","date":"2012-10-18","mins":"9:42 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17798","author":"max_patrick_hamon","post":"Nobody’s perfect. “Miiss Typing”: pleadse read “the latter” (instead of the matter).","date":"2012-10-18","mins":"9:17 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17786","author":"max_patrick_hamon","post":"Mistyping: IN ALL LIKELIHOOD, AT SOME POINT OF ITS HISTORY, THE TSI WAS KNOWN AS THE IMAGE OF EDESSA..","date":"2012-10-18","mins":"7:33 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17791","author":"max_patrick_hamon","post":"This says SOM Ething. Unless you ask British & Italian Art historians respectively Davor Aslanovki & Andrea Nicoletti, Birish historian Charles Freeman, French Canadian Geographer Yannick Clément etc.","date":"2012-10-18","mins":"8:20 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17784","author":"max_patrick_hamon","post":"Mistyping: please read “EPIGRAPHICAL” (instead of “PALAEOGRAPHICAL”).","date":"2012-10-18","mins":"7:26 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-198479","author":"max_patrick_hamon","post":"Most interesting. Thanks Paolo..","date":"2015-05-06","mins":"9:36 am","url":"https://shroudstory.com/2015/05/06/cis-conference-program/","cat":"conference","title":"CIS Conference Program"},{"id":"comment-198480","author":"max_patrick_hamon","post":"Hmm Thanks Piero….","date":"2015-05-06","mins":"9:36 am","url":"https://shroudstory.com/2015/05/06/cis-conference-program/","cat":"conference","title":"CIS Conference Program"},{"id":"comment-152411","author":"max_patrick_hamon","post":"Reminder: the Turin Shroud image is translucent (> structural pigment).","date":"2014-09-19","mins":"2:49 am","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf"},{"id":"comment-152413","author":"max_patrick_hamon","post":"Typo: read structural colour instead of structural pigment.","date":"2014-09-19","mins":"2:56 am","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf"},{"id":"comment-152418","author":"max_patrick_hamon","post":"Curiosity: In which feather the greater part of the colour is based upon structural coloration? In the peacock feather (of which pattern is reminiscent of the TS herringbone weave pattern). Now in Late Antique and medieval symbolism, which animal is the symbol besides the all seeing eye of God, of resurrection and immortality of Christ: the peacock. Now the TS is linked with Christ’s resurrection and immortality….","date":"2014-09-19","mins":"3:35 am","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf"},{"id":"comment-25860","author":"max_patrick_hamon","post":"YC wrote: “we must be careful” and before even finishing his sentence most peremptorily asserts in the name of science: “science WILL NEVER BE ABLE TO PROVE WHAT WAS THE IDENTITY OF THE SHROUD MAN” (his bolds). Who is YC to speak so LOUD in the name of science? How can he tell for sure? Perhaps (in the same vein of its very first comment) it is worth considering the possibility (as Kelly would mildly put it) that ‘his own views may be casting a (rather big) shadow of doubt here as to the relevance of his status as spokesman for Science on such an issue?.","date":"2013-02-27","mins":"6:22 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral"},{"id":"comment-152409","author":"max_patrick_hamon","post":"The true fact is textile mordanting and pre mordanting of colour without pigment) does look like a very light scorch or “pre scorch”..","date":"2014-09-19","mins":"2:40 am","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf"},{"id":"comment-152428","author":"max_patrick_hamon","post":"Addition: In the TS dorsal image of the back of the head for instance, we can see ocellated (little eye shaped like) blood spots, which seen in conjunction with the 3:1 twill weave pattern are reminiscent of a peacok’s ocelli..","date":"2014-09-19","mins":"4:18 am","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf"},{"id":"comment-27086","author":"max_patrick_hamon","post":"Typo: (Heb. Sophereth; Gr huperethen, “servant/assistant/auxilary short for huperethen hermeneutes).","date":"2013-03-11","mins":"1:49 pm","url":"https://shroudstory.com/2013/03/08/pope-benedict-says-shroud-of-turin-authentic-burial-robe-of-jesus-it-doesnt-matter-what-science-says-about-its-authenticity/","cat":"event","title":"Pope Benedict says Shroud of Turin authentic burial robe of Jesus & it doesn’t matter what science says about its authenticity"},{"id":"comment-27083","author":"max_patrick_hamon","post":"– What if the long inner burial cloth just sort of gradually got taut again and unstuck from stiff rigid bloodied corpse via a purifying & DRYING ritual? Once dried on (speedy) purification ritual, how could you still tell ‘the body get out of the shroud without the cloth being unwrapped’. What should be the evidence? The cloth was unwrapped. – What about the fact his (purified) burial cloth(es) was(were) kept by Yeshua’s disciples? – Which bona fide Biblical exegete worth his salt can REALLY hold as a compelling fact, the large ‘sindon’ was still lying on the tomb bench as one of the ‘othonia’ while the latter Greek word is in the DIMINUTIVE plural to ONLY refer to DIMINUTIVE shrouds and bandages? Reminder: Greek othone is the synonym for Greek sindon (linen tunic/garment/sheet) whereas othonion (diminutive of sing. Othone & plur. Othonia) just refers to smaller linen/shrouds (such as face cloth, skull cap, napkin and bandages). Mark: evangelist surname secret meaning (in conjunction with the Sindon as burial garment) Yo Hanan/Yonathan or Yo Hanan (Ham )Maqqaba (John Mark), as he is often called, was then (ca. 29 33 CE) a young Kohen from Maccabean descent (from the Aramaic maqqaba “hammer/ferocious [in battle]”), a son and assistant secretary/stenographer/scribe (Heb. Sopehereth; Gr hapurethen, “servant/assistant/auxilary short for hapurethen hermeneutes) of the Judean High Priest Hanan. Some scholars (see NEW CATHOLIC ENCYCLOPEDIA, second edition, vol. 9, p. 9) maintain that the surname is a shortened form of the Hebrew maqqab yahû (from naqab, ‘‘to mark, to designate’’), meaning ‘‘the one designated by Yahweh” (referring to a High Priest descendent from the Maccabee family). Actually John’ s surname can be read as an elaborated/‘plurivocal pun’ in Hebrew Aramaic from the verb naqab. “The one [keeping a garment] with holes” and “the one cursed [by his own father/family]” can also render Maqqaba as a surname for a priest named Yo Hanan/Yonathan (his High Priest name) ben Hanan who was one of Yeshua’s first secret disciples, wore the (High Priest) petalon in 36 37 CE and resigned (my etymological cryptanalysis is supported by Genot Bismuth and Tresmontant’s research works on the Hebrew and Aramaic substrata of John’s & Mark’s Gospels + Acts of the Apostles + John’s Book of Revelation + Patristic literature). Mark/Maqqaba, “The one cursed (and exiled?)”, “the one [keeping a garment] with holes”, ring bells? According to Jerome & the Gospels of the Hebrews fragment: ‘Yeshua gave his sindon to the servant/auxiliary/assistant of the (High) Priest’ implies he had NOT left it in his tomb (in all likelihood, the servant/ auxiliary here can be identified either with John Mark as High Priest Hanan’s assistant secretary/stenographer or Joseph of Arimathea as Sanhedrin member/High Priest’s auxiliary of Justice)..","date":"2013-03-11","mins":"1:36 pm","url":"https://shroudstory.com/2013/03/08/pope-benedict-says-shroud-of-turin-authentic-burial-robe-of-jesus-it-doesnt-matter-what-science-says-about-its-authenticity/","cat":"event","title":"Pope Benedict says Shroud of Turin authentic burial robe of Jesus & it doesn’t matter what science says about its authenticity"},{"id":"comment-27151","author":"max_patrick_hamon","post":"Reminder 2 for Paul: The TS man’s body was laterally compressed with Judean fresh medical plants mostly head flowers (Gr. Aromaton) used as insect repellent + Judean ferocious plants (e.g. Gundelia tournefortii, a type of thorny thistle from the sunflower family) to bind the back and front sides of the inner burial cloth together + solid objects such as a cane of Arundo donax, a cord or rope, a linen headband (with writings both in Latin and Greek); three wooden pieces (sawn off the Yeshua’s trilingual titulus damnationis to make a small ‘jawbox’: two placed underneath on each side of the head and the shorter one on top under the chin and used in conjunction with a small face cloth and a skull cap on top of it all to tightly shut the long burial sheet at head level). (This can be deduced from the Greek conjugated verbs used in the Gospels to describe Yeshua’s burial, the Turin Sindon’s absence of lateral body image; Israeli botanist, Avinoam Danin’s, Italian paleographer, Aldo Marastoni’s, French optic engineer, late André Marion’s and my personal findings)..","date":"2013-03-12","mins":"4:36 pm","url":"https://shroudstory.com/2013/03/08/pope-benedict-says-shroud-of-turin-authentic-burial-robe-of-jesus-it-doesnt-matter-what-science-says-about-its-authenticity/","cat":"event","title":"Pope Benedict says Shroud of Turin authentic burial robe of Jesus & it doesn’t matter what science says about its authenticity"},{"id":"comment-27152","author":"max_patrick_hamon","post":"Addendum: + Judean ferocious plants (e.g. Gundelia tournefortii, a type of thorny thistle from the sunflower family) to bind the back and front sides of the inner burial cloth together and fasten the bandages from underneath..","date":"2013-03-12","mins":"4:57 pm","url":"https://shroudstory.com/2013/03/08/pope-benedict-says-shroud-of-turin-authentic-burial-robe-of-jesus-it-doesnt-matter-what-science-says-about-its-authenticity/","cat":"event","title":"Pope Benedict says Shroud of Turin authentic burial robe of Jesus & it doesn’t matter what science says about its authenticity"},{"id":"comment-27097","author":"max_patrick_hamon","post":"+ Typo: – Reminder: Greek othone is the synonym for Greek sindon (linen tunic/garment/sheet) whereas othonion (diminutive of sing. Othone) via its plur. Othonia just refers to smaller linen/shrouds (such as face cloth, skull cap, napkin and bandages). – According to Jerome quoting a passage from the lost Gospel of the Hebrews:.","date":"2013-03-11","mins":"5:13 pm","url":"https://shroudstory.com/2013/03/08/pope-benedict-says-shroud-of-turin-authentic-burial-robe-of-jesus-it-doesnt-matter-what-science-says-about-its-authenticity/","cat":"event","title":"Pope Benedict says Shroud of Turin authentic burial robe of Jesus & it doesn’t matter what science says about its authenticity"},{"id":"comment-27148","author":"max_patrick_hamon","post":"Reminder for Paul: Archaeo(crypto)logically speaking, my opinion is the bloodied image was formed by a body to cloth contact and gradual loss of contact process. The image does correspond to subjecting the tightly wrapped up stiff rigid body (laid out in extra height on two raised stones; first on the left and then the right side) to fumigation (the long inner burial sheet being soaked in an aqueous alkaline solution). This purification ritual is totally consistent with four out of the five main Judean burial core procedures namely speedy burial, wrapping in shrouds, purifying and drying (anointing was not performed as the women were not allowed to grind solid/granulised spices to make spicy oily perfumes on Sabbath)..","date":"2013-03-12","mins":"4:01 pm","url":"https://shroudstory.com/2013/03/08/pope-benedict-says-shroud-of-turin-authentic-burial-robe-of-jesus-it-doesnt-matter-what-science-says-about-its-authenticity/","cat":"event","title":"Pope Benedict says Shroud of Turin authentic burial robe of Jesus & it doesn’t matter what science says about its authenticity"},{"id":"comment-37336","author":"max_patrick_hamon","post":"I am not saying there was a ‘plot’. I am just saying the expertise was oriented by (at least) two claimed anti authenticists (namely Tite + Hall)..","date":"2013-06-18","mins":"5:27 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","title":"Shroud of Turin Talk in Gilroy, California"},{"id":"comment-194992","author":"max_patrick_hamon","post":"Hugh as long as you still can think ‘your 1260 1390 CE forger’/’painter’ could have (so) easily fooled all the medical examiners/forensic pathologists who CLOSELY examined the TS bloodied body image along with Art Historians such as De Wesselow, Kitzinger and Belting — just to name a few –, I do think you are the one indulging in wishful realities..","date":"2015-03-31","mins":"3:39 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-37337","author":"max_patrick_hamon","post":"Typo: globally oriented.","date":"2013-06-18","mins":"5:42 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","title":"Shroud of Turin Talk in Gilroy, California"},{"id":"comment-37339","author":"max_patrick_hamon","post":"Reminder: on August 7, 2012 at 7:43 am ( #9 Reply), I also wrote: “When it comes to CONCLUSIVELY carbon date claimed old burial linens, history of their conservation conditions (and first and foremeost the specific burial rite they were subjected to) is vital information.”.","date":"2013-06-18","mins":"5:51 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","title":"Shroud of Turin Talk in Gilroy, California"},{"id":"comment-37366","author":"max_patrick_hamon","post":"Re Ramsey’s famous quote : “[T]he radiocarbon dating results putting it at 1260 – 1390 AD were reliable, and that the suggestions of contamination or medieval repair were unlikely.” Reminder, on January 4, 2012 at 11:56 am (#7 Reply), by way of comment, I wrote: “Actually Ramsay is “right to a certain extent”. Such a high contamination does not imply a medieval repair in terms of microreconstructions. XI Xth century microreconstructions are most likely (either by the princess Clothilde of Savoy Bonaparte or the Master of upholstery in the Royal court of Savoy, in 1863).” In my 2007 research paper, I also wrote: “Technique de pointe et facteurs (trop) humains Quant au fil extrait à partir de l’échantillon du Coin de Raës prélevé dans une zone à la fois adjacente à celle de l’échantillon officiel du Linceul de Turin et contiguë à la longue bande supérieure du drap, sa datation à deux extrémités très hétérogènes (I Ie XI Ie siècle) par le laboratoire de l’Institut de Technologie de la Californie en 1982, pourrait bien avoir été une datation qu’à moitié aberrante. Elle ne ferait que refléter la réalité d’un fil ayant subi une épissure bout à bout présentant l’une de ses deux sections composée des fibres d’un fil (tardo antique) authentique, vierge ou pratiquement vierge de toute fibre étrangère, et l’autre composée de 33 à 50% de fibres étrangères beaucoup plus tardives (du XI Xe siècle) et mêlées aux fibres du lin originel. Taille réelle moyenne de chacun des trois sous échantillons du Linceul de Turin datés en 1988 On aurait, en effet, bien tort de perdre de vue ici que toute la valeur réelle de la datation C14 de 1988, ne repose que sur trois sous échantillons ne s’avérant, en moyenne, pas plus grands qu’un timbre poste de 1,69 x 1,32 cm et pesant chacun, toujours en moyenne, 52,83 mg. Le poids unitaire du Linceul étant estimé à 0,023 g/cm2 ± 10%, au sein de l’échantillon parent C14 pesant 158,5 mg ± 0,3mg, il suffirait au pire d’un remplacement soit d’à peine 106 millièmes de gramme ± 10% de fibres textiles originelles du Ier siècle par une quantité égale de fibres beaucoup plus récentes issues de réparations invisibles effectuées entre 1858 et 1988 (estimation haute selon Jackson), soit de seulement 79 millièmes de gramme ± 10% (estimation basse selon Évin) pour que la relique présumée de « 1260 1390 » soit définitivement enlevée au Moyen Age et se retrouve placée à l’époque coloniale romaine. Autant dire qu’à l’échelle de la réalité matérielle de l’objet archéologique analysé, il suffirait de presque rien20. Vingt années de contre expertises plus tard, un noyau irréductible de faits avérés nous conduit donc à affirmer que les échantillons, dont furent mesurées en 1988 les teneurs carbone 14 résiduelles, n’étaient pas uniquement composés de carbone présent à l’origine dans le matériel daté mais intégraient des matières carbonées secondaires (dites de pollution) issues d’activités humaines postérieures à la formation du lin. Que ce soit par les deux experts textiles « commis d’office » pour superviser le prélèvement ou bien par les trois laboratoires retenus pour réaliser la datation officielle du Linceul de Turin, ces carbones plus récents (essentiellement « de remplace ment ») ne furent ni détectés ni éliminés.” Re Mme Metchild Flury Lemberg’s opinion, I commented in a note: ” 10. – Lorsque l’on sait que de petites reconstructions invisibles à l’œil nu et à la lumière naturelle du jour pouvaient se trouver très circonscrites au cœur même du site de l’échantillon carbone 14 daté, on est pour le moins étonné qu’une experte textile de la valeur de Mme Metchild Flury Lemberg, sans même avoir jamais examiné de visu ledit cœur de l’échantillon ni avoir pris connaissance de la photographie précise et contrastée d’Enrié, puisse affirmer sans ambages que la texture dudit échantillon était uniforme et intacte. Partant du principe qu’un expert textile se devait d’être très attentif à l’origine (et à la représentativité) des fils qu’il observe, de toute évidence, il demeure difficile pour Mme Metchild Flury Lemberg d’accepter un seul instant l’idée que des confrères aient pu, juste avant la découpe de l’échantillon brut, ne pas procéder, à l’aide de loupes, compte fils et binoculaires, à l’examen des fils de chaîne et de trame au cœur même du site de prélèvement.”.","date":"2013-06-19","mins":"6:35 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","title":"Shroud of Turin Talk in Gilroy, California"},{"id":"comment-37368","author":"max_patrick_hamon","post":"Notes re Tite & Bowman’s statistical sleight of hand: “4. – Lissage qui ressemble plus à un tour de passe passe statistique par l’utilisation de la fameuse méthode statistique de Wilson et de Ward dont la capacité à rendre homogène des résultats hétérogènes est bien connue des spécialistes. 5. – Annoncé officiellement à 5 % (soit juste le seuil de validité admis), le niveau de signification (ou degré de cohérence) des résultats interlaboratoires, une fois recalculé, s’avéra être totalement faux. Il était, en fait, de 1,04 % c’est à dire bien en dessous du seuil critique impliquant, soit qu’une erreur systématique avait été commise au cours de l’analyse (ce qui n’était pas le cas) soit que l’échantillon n’était pas homogène (ce qui était précisément le cas). Ainsi, “par obligation de résultat”, Mme Sheridan Bowman, la responsable de la partie statistique de l’expérience, avait elle « arrondi » ce chiffre de 1,04% » à 5%. On ne peut que regretter cet excès de zèle par complaisance envers son patron, le Dr Michael Tite. Celui ci n’avait, en effet, jamais fait mystère qu’il ne croyait pas à l’authenticité du Linceul de Turin.”.","date":"2013-06-19","mins":"6:44 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","title":"Shroud of Turin Talk in Gilroy, California"},{"id":"comment-37449","author":"max_patrick_hamon","post":"The true fact is, the geometrical fourfold series of blackened rimmed L shaped burn holes could date back PRIOR TO 390 CE (see the apse of Santa Pudenziana with the mosaic of Christ in majesty)..","date":"2013-06-20","mins":"6:04 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","title":"Shroud of Turin Talk in Gilroy, California"},{"id":"comment-37369","author":"max_patrick_hamon","post":"Actually, the 1988 Turin Shroud radiocarbon dating is nothing but a textbook case of bad archaeology and the way a scientifically non conclusive result (originally biased by a conflict of interest (AMS Radiocarbon Dating method promotion) and two anti authenticists’ intersubjective denial (Tite & hall)) can be turned into a conclusive result with at least 95% confidence..","date":"2013-06-19","mins":"7:01 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","title":"Shroud of Turin Talk in Gilroy, California"},{"id":"comment-37452","author":"max_patrick_hamon","post":"In the C14 corner, the image is not that of a rusty thumbtack at all but the mark left by a measuring instrument (Riggi di Numana’s) in 1988..","date":"2013-06-20","mins":"6:27 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","title":"Shroud of Turin Talk in Gilroy, California"},{"id":"comment-37326","author":"max_patrick_hamon","post":"It was no random sampling. The true fact is it was deliberately meant to reach a four star result in order to prove the Turin Shroud a fake! In 2007, I wrote a paper entitled: LINCEUL DE TURIN : FAUSSE RELIQUE OU FAUSSE DATATION Carbone 14 ? and subtitled: (Contre enquête sur un fiasco scientifique). Here is a relevant excerpt: “L’Académie pontificale des sciences fut exclue du projet au profit du seul British Museum pour la coordination et la réalisation finale du test. Or, depuis le canular de « l’Homme de Piltdown » (création de toute pièce, par deux scientifiques, du « chaînon manquant » dans la chaîne de l’évolution du singe à l’homme), le British Museum de Londres n’était pas un institut au dessus de tout soupçon. De plus, non seulement le directeur de son laboratoire, le Dr Michael Tite, coordinateur du projet de datation par la méthode du radiocarbone, ignorait tout ou presque de l’histoire et de la complexité de la relique mais celui ci était aussi un « anti Suaire » déclaré qui entendait bien prouver qu’il s’agissait d’un faux du XI Ve siècle. À l’instar de Tite, les deux experts textiles et les directeurs des trois autres laboratoires n’étaient pas des spécialistes du Linceul de Turin qu’ils virent pour la première fois, le 21 avril 1988, le jour même du prélèvement de l’échantillon. • Le refus de toute interdisciplinarité Le groupe de recherches multidisciplinaires à l’origine même du projet de datation par le radiocarbone et composé d’une quarantaine de spécialistes américains de la relique, ne fut pas invité à prendre part à l’expérience par le cardinal Anastasio Ballestéro, custode pontifical de la précieuse toile de lin et ce sur l’avis de son conseiller scientifique le Pr Luigi Gonella († 2007) qui subissait la pression du Dr Tite et de son « petit groupe carbone 14 ». Raison officielle invoquée a posteriori par le Pr Jacques Évin porte parole de l’expertise : “[…] chaque discipline scientifique qui étudiait la célèbre pièce de tissu se [devait] de rester indépendante sauf à démontrer qu’une cause d’impression de l’image [avait] entraîné un changement de la teneur en radiocarbone”. De fait, il eut été indispensable de relativiser le fameux résultat “1260 1390” au regard de ceux déjà obtenus par des techniques de mesure d’âge plus directes et plus concrètes qui, elles, n’étaient pas du tout en contradiction avec une datation de près de deux mille ans. Restreindre une problématique à un domaine d’étude qui en interdit le véritable dénouement est, en soi, une faute de méthode. • Une expertise non archéologique et « anti Suaire » globalement orientée Avec l’aval de l’Église, le Dr Tite (qui était donc hostile à l’authenticité du Linceul de Turin) avait fait prélever sur la relique un échantillon d’un seul tenant et en avait fait mesurer la teneur en radiocarbone par la seule méthode de la Spectrométrie de Masse après Accélération ce dans le souci évident d’obtenir les mesures les plus homogènes possibles entre les trois laboratoires et un résultat final “quatre étoiles” « prouvant » que la relique était fausse. Or, la contre expertise le démontre bien : le matériel daté censé n’être pas ou que très peu pollué, avait subi non seulement un dégât des eaux et une pyrolyse locale lors de l’incendie de 1532 mais aussi une teinture et une réparation invisible (voire même deux) avec un remplacement substantiel de lin par du coton beaucoup plus récent (sur les quatre seuls fils prélevés au hasard au niveau de l’échantillon parent C14 pour analyse en 1982, 1988 et 2002, pas moins de trois avaient fait l’objet d’une épissure bout à bout avec un fil d’origine différente). Pour toutes ces raisons – et une ou deux autres cumulative(s) qui reste(nt) encore à être explorées expérimentalement –, il est parfaitement abusif aujourd’hui, du point de vue de la simple honnêteté intellectuelle, d’annoncer comme incontestable la datation médiévale de la relique quand, de fait, celle ci pourrait être beaucoup plus ancienne. Pour être véritablement exemplaire, la datation au 14 C, eût demandé des conditions beaucoup mieux adaptées à la complexité matérielle de l’objet textile et, de la part du coordinateur du projet, une approche plus impartiale et plus prudente des mesures de la teneur en radiocarbone des trois sous échantillons.”.","date":"2013-06-18","mins":"2:34 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","title":"Shroud of Turin Talk in Gilroy, California"},{"id":"comment-37327","author":"max_patrick_hamon","post":"Reminder: on August 7, 2012 at 10:19 am ( #12 Reply), I wrote: “Statistically speaking, the true reliability of 14c dating is only about 70% (from Barta’s, Meacham’s and Voruz & Meanen’s studies). It is even lower for textile samples.”.","date":"2013-06-18","mins":"2:41 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","title":"Shroud of Turin Talk in Gilroy, California"},{"id":"comment-37329","author":"max_patrick_hamon","post":"Additional excerpt: “Sous estimation de la complexité matérielle de l’objet archéologique à dater Tout rapiécé à l’aide de morceaux de corporal (ou nappe d’autel) et consolidé par une doublure en toile de Hollande suites aux dommages qui lui furent causés lors de l’incendie de la Sainte Chapelle de Chambéry, en 1532, le Linceul de Turin est tout sauf une pièce de tissu homogène. Si l’échantillon carbone 14 officiel, fut choisi loin (et encore pas si loin) de tout rapiéçage visible et de toute zone carbonisée, deux imprudences « de taille » perçaient cependant dans cette première procédure mise en place. Pour savoir si l’on se trouvait ou non en présence d’un échantillon typique du Linceul, une information fondamentale sur la structure de son lin originel aurait due impérativement être vérifiée in situ par les deux experts textiles chargés de superviser le prélèvement de 1988 : celle de la normalité de ses irrégularités de tissage. Pour ce faire, il eut été nécessaire de procéder, sous un éclairage rasant et en fluorescence UV, à une observation minutieuse à la loupe, au compte fil et à la binoculaire non seulement des abords mais aussi au niveau même du cœur du site de prélèvement de l’échantillon carbone 14 afin de lever toute ambiguïté possible en ce domaine. On négligea totale ment cette dernière précaution. Or, tel qu’il apparaît sous fluorescences UV et sous éclairage rasant, – et donc tel que ne le virent jamais les deux experts textiles –, le fragment prélevé empiétait, par le bas sur une grande auréole d’eau dentelée vestige de l’incendie de 15329 tout en mordant en plein, dans deux aires hautement suspectes de réparations. Abstraction faite des zones carbonisées, la première de ces deux aires, au cinquième à cheval sur le pli barrant à la verticale le site de prélèvement, offrait, un aspect nettement plus raide et plus sombre que sur tout le reste de la surface du drap. Il s’agissait ici soit d’un dépôt de salissures graisseuses résultant des nombreuses manipulations de ce coin de la toile, soit d’une teinture locale destinée à camoufler, selon l’art des tapissiers, une restauration à l’identique de la texture, soit des deux. Dans la seconde aire plus claire et à droite de ce même pli et à gauche d’un pli courbe, on pouvait distinguer tout aussi nettement une anomalie structurelle : comme un réseau de fils plus dense de forme serpentine caractéristique d’une zone d’accroc ou de cisaillage ayant fait l’objet de micro reprises. Vues dans ces conditions très particulières d’observation, cette pollution et ces anomalies d’aspect ne sauraient être confondues avec une simple ombre portée, un pli du tissu ou bien une irrégularité normale apparue au cours du tissage10. Ainsi, dès le départ, la validité du résultat final se retrouva t elle être très sérieusement hypothéquée. De toute évidence, les deux experts textiles, les représentants des trois laboratoires et le coordinateur du projet n’étant pas des spécialistes du Linceul de Turin, ignoraient que dans sa composition matérielle même, la relique s’avère beaucoup plus complexe qu’il n’y paraît à première vue. Il faut, en effet, savoir que, lors des ostensions et afin de garantir aux observateurs présents la vision la plus parfaite et la plus logique de la double empreinte du Crucifié, la relique était déployée entièrement à l’horizon tale. Une bande de couture bourrelée courant sur toute sa longueur avait été confectionnée permettant une meilleure préhension du drap. L’échantillon parent, extrait d’un seul tenant entre 8 à 10 cm du bord supérieur du coin gauche et le long de la couture de repli du tissu sur lui même, se superposait donc presque parfaitement à la zone où – depuis au moins le XI Ve siècle et jusqu’au XI Xe siècle – la grande étoffe de lin avait été tenue en tenaille entre le creux de la paume et trois ou quatre des doigts de la main droite de plusieurs générations de dignitaires ecclésiastiques officiant à mains nues. Ainsi, à cet endroit très précis du drap, la toile, tantôt soumise à de fortes tensions et à des pressions répétées d’extrémités onglées plus ou moins coupantes, tantôt exposée aux griffures du chaton des bagues d’évêques et d’archevêques, avait elle fini, un jour, par être abrasée, accrochée, cisaillée et/ou trouée et faire l’objet d’une (voire même de plus d’une) microreconstruction(s) fil à fil invisible(s) à l’œil nu hors examen ad hoc. Or, pour dater correctement au carbone 14 un objet textile ancien – un étudiant en archéologie aurait pu le savoir –, il était tout sauf recommandé de prélever un seul et unique échantillon de tissu dans une telle zone. Il eut été beaucoup plus avisé et moins destructeur de procéder à un échantillonnage de quelques fils en plusieurs endroits beaucoup plus fiables en vue d’assurer, par intercomparaison, la représentativité de la datation.”.","date":"2013-06-18","mins":"3:00 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","title":"Shroud of Turin Talk in Gilroy, California"},{"id":"comment-162077","author":"max_patrick_hamon","post":"Or if he is man enough..","date":"2014-10-13","mins":"3:59 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","title":"\"Just the facts, ma’am.\""},{"id":"comment-162317","author":"max_patrick_hamon","post":"Mr Nicolotti why worry about a speck in Fanti’s eye when you have a log in your own? Actually there are two types of Shroudsciences: genuine sindonology and sindono N Ology. What is praticed by BOTH authenticists AND anti authenticists is mostly sindono N Ology. On december 2012 I wrote the TS was not only the most studied ancient object in history but also the most badly studied. Mr. Nicolotti is a sindon N Ologist in essence as he just ignores or totally overlook suffice it to syntactically piece together several corroborating 944 1207 CE testimonies and eyewitness descriptions, from Gregory Referendarius’ (Archdeacon of Hagia Sophia), to Nicholas Mesarites’ (overseer of the treasuries in the Pharos Chapel of the Boucoleon Palace of the emperors) via Robert de Clari’s (Fourth Crusade Picard knight), and a few others, to build a strong if not crucial evidence the Turin Shroud and Constantinople Sindon could be one and the same object..","date":"2014-10-14","mins":"8:30 am","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","title":"\"Just the facts, ma’am.\""},{"id":"comment-128926","author":"max_patrick_hamon","post":"Louis wrote: “His (Geoffrey de Charny’s) wife, Jeanne de Vergy, was a direct descendant of Othon de la Roche and it is in this link that the mystery lies.” On May 22, 2013 at 6:26 pm, May 23, 2013 at 5:02 am and May 23, 2013 at 5:07 am, I wrote: “Have (you) ever heard of the De Molay De Vergy family? If not see Acta Templarorium or La prosopographie des templiers by Jean luc Alias.The fact is no medieval historian really know Jacques de Molay’s place of birth. There are 3 possibilities… and one of them is directly linked with the De Molay De Vergy family. Hence there may have been a known family connection between the De Molay and De Vergy families.”.","date":"2014-06-12","mins":"8:36 pm","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-129056","author":"max_patrick_hamon","post":"Charles, you most misleadingly wrote again and again: “And it does not take long to dismiss the Pray Codex there is a stepped pyramid pattern on the tomb cover, not a herringbone, and the holes are circular not ragged as the poker holes on the Shroud are. The ROUND holes are found in several depictions of the tomb lid as there were actually round holes drilled into the Sepulchre in Jerusalem which were copied by artists.” Actually, it doesn’t take you long to totally miss… two crucial clues: The Turin Shroud INNER SIDE weave pattern looks a herringbone pattern when viewed AT SCALE ONE. However when seen AT MACRO or MAGNIFYING SCALE, the same weave pattern can be drawn in iconic reduction (= for simplification’s sake) as FLAT SQUARE (= non loopy/non semi circular) top stepped pyramid pattern. The Pray codex pen & ink drawing does show the same flat square top stepped pyramid pattern as characteristic weave pattern unit evocative of the TS inner side bearing the image. In medieval times, a protective marble sarcophagus with portholes used to protect the unction stone. In the Entombment of Jesus, by Nicholas of Verdun (1130–1205) in Klosterneuburg Abbey, this is precisely this sarcophagus type that cryptically features Yeshua’s burial bench.The two series of 4 5 SMALL round holes are NOT the portholes “drilled into the Sepulchre in Jerusalem” AT ALL. Are you kidding or blind? On September 12, 2013 at 6:52 am, I already wrote: “Charles, with due respect, iconologically speaking, it does seem you just cannot discriminate between drawing holy sepulchre portholes and small holes in the twilled linen fabric known as the Turin Shroud and are also not very familiar with medieval Benedictine monk cryptic art to say the least. (…) Methinks Fundamentalism and Arrogance are father and mother of Ignorance.”.","date":"2014-06-13","mins":"6:48 am","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-128513","author":"max_patrick_hamon","post":"Re the word sindon, on July 3, 2012 at 12:02 pm and August 10, 2013 at 5:58 am, I wrote: “Writers (e.g., Martialis/Martial) used the Greek word sindon in LATIN as early as the 1st century CE in accounts of very fine linen, silk and sea Byssus veil/head covering from head to toes). In 4th century CE LATIN (e.g., Vulgata), THE SAME LATIN WORD comes to also refer to the linen/burial cloth of Rabbi Yeshua of the synoptic gospels (Matthew, Mark and Luke).” “Thus it must be reminded that the LATIN sindon can refer to BOTH Yeshua’s linen/burial cloth AND his Byssus face veil (Aramaic mindil) or head covering from head to toes (Aramaic sudara). One must bear in mind besides Syriac and Greek, Latin was one of the three main languages used in Edessa while Greek only took over Latin not until the seventh c CE in the Byzantine Empire. Both the confusion between the Greek Mandylion (as a very fine Byssus veil, Aramaic mindil) and Sindon (as Yeshua’s linen/burial cloth) could then find here its philological explanation and also be consistent with the very fact, in one point in time, the apotropaic Image of Edessa could have referred to two clothes/contact relics placed over one another and kept within one and sole reliquary tablet with central oculus showing the Holy Face with open eyes and mouth in the transparent byssus/‘mindil’ covering Yeshua’s bloody death mask on his long burial linen sheet.”.","date":"2014-06-11","mins":"11:34 am","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-129019","author":"max_patrick_hamon","post":"See Acta Templarorium, page 269.","date":"2014-06-13","mins":"4:08 am","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-129067","author":"max_patrick_hamon","post":"For the earliest depiction (586 CE) of the flat square top stepped pyramid pattern in conjunction with Yeshua as crucifixion victim, see the earliest crucifixion in an illuminated manuscript, from the Rabbula Gospels, Biblioteca Medicea Laurenziana, Florence, Italy.","date":"2014-06-13","mins":"7:37 am","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-129075","author":"max_patrick_hamon","post":"Addendum: in conjunction with both Yeshua’s crucifixion AND EMPTY TOMB scenes..","date":"2014-06-13","mins":"8:24 am","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-129073","author":"max_patrick_hamon","post":"Re earliest (symbolic) depiction of the blackened rimmed burn holes, on October 16, 2013 at 10:24 am I wrote: “For another 390 400 CE mosaic cryptically and symbolically featuring the blackened rimmed burn holes, see the Santa Pudenziana apse mosaic of Christ in majesty: black L (for Lumens Christi) marks the latter’s pallium (= Greek himation, a very large rectangle of fabric that can be draped as a shawl, a cloak, or a head covering; a current 4,20×1,40m for a 5ft 9 6ft tall man was the correct size; a size much like the TS man)”..","date":"2014-06-13","mins":"8:12 am","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-161960","author":"max_patrick_hamon","post":"I just love Jeffrey’s photographic montage (even if I disagree with his neutron activation theory)!.","date":"2014-10-13","mins":"7:55 am","url":"https://shroudstory.com/2014/10/11/chart-of-conference-well-so-far-anyways/","cat":"st_louis_2014","title":"Chart of Conference. Well, So Far, Anyways"},{"id":"comment-166182","author":"max_patrick_hamon","post":"To sum it up, you do believe in fairy tale and wants us to believe it is on medical ground; This is not serious!.","date":"2014-10-28","mins":"8:42 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-166195","author":"max_patrick_hamon","post":"Re what Second Tmple period gardener looked like, see e.g. Joachim Jeremias, Jerusalem zur Zeit Jesu, 1923. They sed to wear a sadin (heb for gr. Sindon) or inner garment draped as workwear. I am no speculating, YOU are..","date":"2014-10-28","mins":"9:55 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-166202","author":"max_patrick_hamon","post":"A receding hairline – gibeach as opposed to the uncleanliness of bald patches (nesokin)..","date":"2014-10-28","mins":"10:39 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-166200","author":"max_patrick_hamon","post":"How long shall I repeat Second Temple period gardeners had a hairless face and hairless forehead (i.e., a receding hairline – gibeach) to be seen from afar? See the rabbinic literature..","date":"2014-10-28","mins":"10:29 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-166208","author":"max_patrick_hamon","post":"Second Temple tanners who were used to handling dog’s dung as ingredient of tan, had a hairless face and forehead too..","date":"2014-10-28","mins":"10:52 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-164040","author":"max_patrick_hamon","post":"As a real possibility and in light of the post resurrectionem Gospels’ narratives, methinks along with moustache and beard total alopecia and spot baldness on the brow (through systematic rubbing), partial or total eyebrow alopecia could have resulted from extremely stressing violent death followed by return to physical life + tugging, pulling and friction of removing the encrusted blood from the hair..","date":"2014-10-20","mins":"10:25 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-166219","author":"max_patrick_hamon","post":"Reminder: when I mean alopecia here, I mean post oppressaem et ad vitam reditum quick extreme alopecia PLUS (NOT ONLY) tugging, pulling and friction of removing the encrusted blood from the hair (with or without water)..","date":"2014-10-28","mins":"11:18 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-166667","author":"max_patrick_hamon","post":"Eric, You wrote:”This will be my last post discussing the matter until you can cite me (any!) medical literature supporting your hypothesis. Only then we can get “serious” about this topic.” Which means you don’t want nay just cannot discuss the matter : 1/neither on Rabbinic/Talmudic literary ground 2/ nor on Second Temple period History and archaeological ground 3/ or fairly current fact of experience ground (the fact of not being able to recognize at first sight somebody who is very familiar to you just because he shaved up his beard and moustache and partially or totally shaved his head too). In other words you want to discuss the matter on medical ONLY that s where you think your are comfortable). To reduce the apparition of Yeshu’s to Mary Magdalene to the cross section of medical literature; THIS is NOT serious! Now I have asked you the question: “how many cases of people declared dead of a violent death and returning to life/resurrecting have you studied or heard of as far as alopecia is concerned?” I am still waiting for you reply to that very simple question. If your answer is NONE (which is most likely!) how then can your medical opinion be reliable or even serious? It just cannot..","date":"2014-10-29","mins":"4:21 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-162704","author":"max_patrick_hamon","post":"To drastically reduce and even cure stomach acidity, better just eat two bio bananas a day and drink 2 4 ounces of organic, stabilized, aloe vera juice every day (with or withou trusted herbs). Don’t you rely on drug therapy with side effects..","date":"2014-10-15","mins":"5:20 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-166670","author":"max_patrick_hamon","post":"…while being on ‘your own ground’ yourself think you are the most comfortable! Why are you asking me to citing some medical literature when yourself, irrespective of alopecia, are totally incapable, in all the medical literature, to cite just ONE post oppressaem et ad vitam reditum or violent death and return to life known or reported case?.","date":"2014-10-29","mins":"4:34 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163161","author":"max_patrick_hamon","post":"Re the neutrons released from Jesus’ body in the resurrection to have his bloodied bodied recorded on his large burial wrapping, methinks (like a few others) not only the Shroud but the tomb and a large part of Jerusalem would have been destroyed in the so called ‘imaging process’, which is not the case as the shroud and Jerusalem still exist….","date":"2014-10-17","mins":"12:39 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163158","author":"max_patrick_hamon","post":"Nabber, Are you kidding? I can read the facts reported in the Gospels all right as far as they are reliable as such. I am NOT ‘amazingly unaware’ of the fact Mary Magdalene did not recognize Jesus’. On this very blog I even provided an explanation regarding the way Second Temple period gardener look like along with a sensible reason why Mariam Magdalene mistook her master for the gardener! Nabber, methinks YOU haven’t got the foggiest notion of what Second Temple period gardener looked like… Methinks too Sampath Fernando was just referring to Jesus’ resurrection and his apparitions to his disciple after his death. Besides, if you advocate the TS image process is supernatural, this implies Yeshu’a resurrected not just physically but with a new or ‘glorified body’. Last but not least, could you tell me WHAT ‘a glorified body’ really is and WHEN exactly Yeshu’a mortal body turned into a ‘glorified body’ since you seem to know about Yeshu’a’s?.","date":"2014-10-17","mins":"12:22 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-162979","author":"max_patrick_hamon","post":"Sampath Fernando wrote: “Most probably this is the best hypothesis to explain the Glorified body according to Gospels.” Reminder for Nando: According to John’s Gospel Mary Magdalene did mistake Yeshu’a for a gardener i.e. An everyday man NOT an angel /divine messenger or a man with a ‘Glorified body’… Don’t you make too much of the Gospels, please..","date":"2014-10-16","mins":"8:17 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163168","author":"max_patrick_hamon","post":"Hi Louis ! Why on earth, could not Yeshua’s ‘change of appearance’ be just physical? What about his post Passion relative disfiguration? What about a possible very rapid alopecy/psilosis due to post violent (apparent or real) death and return to (apparent or real) physical life?.","date":"2014-10-17","mins":"1:05 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163180","author":"max_patrick_hamon","post":"Reminder: oftentimes in the resurrected Christ late Antique and Medieval iconography, Yeshu’a looks like a moustacheless, beardless and younger..","date":"2014-10-17","mins":"1:58 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163173","author":"max_patrick_hamon","post":"Yeshu’a might even have looked younger without his beard and moustache….","date":"2014-10-17","mins":"1:36 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163181","author":"max_patrick_hamon","post":"Typo: Yeshu’a looks like a moustacheless and beardless youngman..","date":"2014-10-17","mins":"2:02 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163228","author":"max_patrick_hamon","post":"Eric, Firstly, I have never seen God King;Rise of Xerxes. Secondly, this idea occurred to me in 1988 (i.e. More that a quarter of a century ago not ‘lately’) My question: how many cases have you ever studied/heard of POST VIOLENT (apparent or real) death and return to (apparent or real) physical life very rapid medio facial (that is partialis not totalis) psilosis/alopecia? Reminder: e.g. Postpartum hair loss – severe, RAPID, localized hair loss that can develop into bald spots..","date":"2014-10-17","mins":"5:30 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163230","author":"max_patrick_hamon","post":"Louis, I am not implying Yeshu’a never really die. Scientifically AND spiritually it shall remain an open question..","date":"2014-10-17","mins":"5:33 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163240","author":"max_patrick_hamon","post":"BTW, as they manipulated manure, Second Temple period gardeners were HAIRLESS (i.e. Wore no beard and no moustache and most of the time were bald or nearly bald) so that e.g. Jerusalem Temple priests (in their preoccupation with the Halakah laws of impurity and defilement) could recognize them from afar..","date":"2014-10-17","mins":"5:58 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163243","author":"max_patrick_hamon","post":"…and avoid defilement..","date":"2014-10-17","mins":"6:03 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163249","author":"max_patrick_hamon","post":"Eric, Re ‘an informed opinion’, since Mary Magdalene mistook Yeshu’a for the gardener AND Second Temple period gardeners were moustacheless and beardless (and most of time bald or nearly bald as they used to shave their heads), if Yeshu’a has not lost any hair, how then could you account for Mary Magdalene having mistaken her master for the gardener and not an angel while recognizing and angel for an angel? Waiting for your reply..","date":"2014-10-17","mins":"6:12 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163258","author":"max_patrick_hamon","post":"Eric, And what about ‘post oppressaem et ad vitam reditum’ (post apparent/real violent death and return to life) alopecia/psilosis?.","date":"2014-10-17","mins":"6:40 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163406","author":"max_patrick_hamon","post":"Hi Eric, In a case of ‘oppressae et ad vitam reditus’ i.e. (apparent/real) violent death and return to life, I STILL think very rapid dramatic alopecia at least in medio facial region (loss of beard and moustache blood encrusted hair ) is a real possibilty and could explain the reason why Mary Magdalene mistook Yeshu’a for the gardener (and Not an angel). BTW you still haven’t answer my question: since Mary Magdalene mistook Yeshu’a for the gardener AND Second Temple period gardeners were moustacheless and beardless (and most of time bald or nearly bald as they used to shave their heads) and if Yeshu’a has not lost any hair as you claim, how then could you account for Mary Magdalene having mistaken her master for the gardener (i.e. A man with a hairless face not say bald or nearly bald) and not an angel while recognizing and angel for an angel? Besides Second Temple period hairless faced gardeners were draped in their sindon/achiton (or inner garment) as workwear… What about the real alternative possibility of Yeshu’a’s long inner shroud or sindon missing in the tomb and him appearing — not stark naked to Mary Magdalene! — but draped in it like a gardener? This could account for Yeshua appearing to the Magdalene wearing a sindon as if stained with red earth in the manner of a gardener. Reminder two: RED earth staining a sindon does look like bloodstains and is best earth for fruit trees and vegetables. Just think of a hairless (i.e. At least with no moustache and beard any longer) Yeshu’a draped in his bloodstained sindon/shroud AND all the pieces of the Yeshu’a’s first appearance to Mary Magdalene puzzle fit together. Still methinks if you “miss that”, you just cannot really account for Mary Magdalene identifying the divine messengers/angels as divine messengers/angels yet mistaking at first sight her very own master for the gardener… Shall I repeat in Second Temple period, gardeners wore no moustache and no beard and were partially or totally bald. As they manipulated manure, STP gardeners were HAIRLESS so that Judeans and especially priests on their way to the Jerusalem Temple andin their preoccupation with the Halakah laws of impurity and defilement, could easily recognize them from afar and avoid impurity and defilement..","date":"2014-10-18","mins":"5:58 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163170","author":"max_patrick_hamon","post":"The TRUE fact in John’s Gospel is Mary of Magdalene is reported to have seen an angel already in the tomb AND a gardener coming from outside. She DID NOT mistake her master Yeshua’s for an angel but for… a gardener! This makes a world of a difference. Mary Magdalene could tell the difference between an angel and a gardener, which means Yeshua’s looked like a gardener i.e. A human being NOT an angel! First she thought he was the gardener and THEN (by means of his voice calling her by her surname) she finally recognized Yeshu’a not as an angel but as her master (rabbuni)….","date":"2014-10-17","mins":"1:28 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163175","author":"max_patrick_hamon","post":"Methinks there are many red flags in your (and Nabber’s) interpretation of the John’s Gospel resurrection scene..","date":"2014-10-17","mins":"1:51 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163252","author":"max_patrick_hamon","post":"Do I identify “G od” as YHVH? To me G od, YHWH/Adonaï, D eus, Th eos etc are all words that refer to the power of manifestation of the infinite intelligence of life in the human being and in all the manifest world..","date":"2014-10-17","mins":"6:24 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163720","author":"max_patrick_hamon","post":"Louis, my reply to you question (Do I identify “G od” as YHVH?) “To me G od, YHWH/Adonaï, D eus, Th eos etc are all words that refer to the power of manifestation of the infinite intelligence of life in the human being and in all the manifest world.” The human being’s body is G od’s Temple. Louis haven’t you read the NT?.","date":"2014-10-19","mins":"5:48 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163718","author":"max_patrick_hamon","post":"Eric, relying mostly and too much methinks on Daniel’s (Daniel 10:5 6) vivid description of an angel: “I looked up and there before me was A MAN DRESSED IN LINEN (my upper cases), with a belt of fine gold from Uphaz around his waist. His body was like topaz, his face like lightning, his eyes like flaming torches, his arms and legs like the gleam of burnished bronze, and his voice like the sound of a multitude”, you wrote (re the angels at and in Yeshu’a’s tomb: “They were extraordinarily luminous, blindingly so” and Mary was so much bedazzled she just could not even recognize her own master AND YET mistook him for the gardener implying she could not mistook him for any of Yeshua’s disciples who might have come over as well to the tomb (besides John and Peter). You explanation neither fits logic and John’s gospel narrative. When Mary Magdalene saw Yeshu’a on that early morning, most likely she was sitting on her knees still weeping at the low cave tomb opening and looking in. She turned her head as Yeshu’a’s body draped in a sindon was silhouetted against the rising sun between two columns with two more pillars projecting from either side of the monumental/main entrance. She could have mistaken him for a divine messenger too according to ‘your speculation’, which is definitely not the case: she mistook him for a gardener implying ‘the man she saw’ looked an everyday man weaing a red earth stained sindon draped as workwear and his face was hairless (if not to say bald or nearly bald). Besides the word for angels can refer here either to divine messengers or mere human messengers (e.g. Yeshu’a’s secret disciples from Essenean background) or else divine messengers resembling human form. Indeed if in in Heb. 1:14, we are told angels are not composed of physical matter but are spirit beings created by G od; the true fact remains angels can resemble human form when G od permits or wills it (see Gen. 19) and when they appear in a human form in the Bible, they are always a man even if angels are neither male of female and they appear as such NOT TO FRIGHTEN real human beings, which is in drastic contrast with ‘your speculation’. Reminder the angel’s word in the tomb: “Don’t be afraid!”. Thus what do you make of the fact Second Temple period gardeners’ face was hairless? NOTHING! What do you make of the fact the resurrected/glorified Christ Late Antique and Medieval iconography depicts him with no hair and no moustache at times while depicting him with a beard and moustache before resurrection and glorification ON THE SAME iconographic program (see e.g. The famous Hungarian Pray Ms bifolium)? NOTHING! This is not serious refutation..","date":"2014-10-19","mins":"5:36 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163726","author":"max_patrick_hamon","post":"More typo: she could not HAVE MISTAKEN him for any of Yeshua’s disciples etc..","date":"2014-10-19","mins":"6:18 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163719","author":"max_patrick_hamon","post":"Typo: most likely she (Mary Magdalene) was sitting on her knees OR SQUATTING.","date":"2014-10-19","mins":"5:38 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163989","author":"max_patrick_hamon","post":"Eric , Then again you explanation does not fit the reported facts (see the Four Gospels) and facts of experience. 1/ Had Mary Magdalene really seen an angel in its heavenly form i.e. As described in Daniel’s ‘fancy description’ (Daniel 10:5 6) and not in a human form AND IN THE TOMB: – firstly she would have fallen on her face instantly – secondly she should have not even noticed “the gardener” looming behind her in the rising sun (most likely between two monumental cave tomb entrance columns) as she was squatting at the low tomb opening looking in and consequently she should not have had to adjust to a sudden change in lighting experience since lighting was both within (an alleged “luminous angel” in the tomb) and without (Mary Magdalene turning her head and facing the rising sun). 2/ Re Matt 28: 1 4 we read: “Now after the Sabbath, toward the dawn of the first day of the week, Mary Magdalene and the other Mary went to see the tomb. 2 And behold, there was a great earthquake, for an angel of the Lord descended from heaven and came and rolled back the stone and sat on it. 3 His appearance was like lightning, and his clothing white as snow. 4 And for fear of him the guards trembled and became like dead men. – firstly you most misleadingly mix up THREE DIFFERENT EPISODES as Matthew (for dramatic emphasis’ sake) mixes two episodes into one namely the resurrection per se that occurred in the middle of the night (AND NOT at dawn!) with an angel descending from heaven (that is from outside the tomb AND NOT from the inside!) and Mary Magdalene coming at the tomb toward dawn first WITH OTHER WOMEN AND THEN with Mary Magdalene’s RETURN to the empty tomb by herself and seeing an angel IN the tomb. – Besides ‘the Archangel of Lightning’ as Anthropomorphic Personification trope was currently used in popular ancient Jewish culture for literary dramatic emphasis. To mistake literary device for fact is just naive. – thirdly, shall I endlessly repeat, in the Bible and Rabbinic literature, angels are spiritual beings without bodies of flesh and bones THOUGH they apparently have the ability to appear in human form (Gen. 19:1 22). Reminder: physical Matter is the lowest vibration of spiritual Energy (or Spirit) and spiritual Energy (or Spirit) is the highest vibration of physical Matter 3/ you wrote: “it is unlikely that he (=Yeshu’a) would have experienced extreme hairloss in a couple of days especially localized hair loss and that diffuse hair loss is not enough to make somebody a “complete stranger”. Question one: when was it last you medically studied or hear of a moustached, bearded and long haird man returned to life/resurrected after experiencing a very traumatic/violent death to totally rule out the possibility of a case of ‘post oppressaem et ad vitam reditum’ quick extreme alopecia (loss of beard and moustache and partial loss of Yeshu’a’s long hair blood encrusted hair)? Had you ever gotten long hair and worn a moustache and beard and one day had to have all your hair shaved on the head and all around the mouth in a place with no mirror and all of a sudden, while passing from a place with no mirror to a place with a mirror, been brought face to face with your own new reflection in the mirror, you could have not even recognized yourself at first sight and should have needed a time to adapt and become familiar with your new face image! Even a very good friend from childhood could not have recognized you unless you would have addressed him using his surname. Once I made this very disturbing experiment. I could not even recognize a very good friend of mine from childhood just standing in front me as he had no moustache no beard any longer and wear very short hair, which I was not familiar with! Most likely, this could explain why Mary Magdalene was unable to recognize her own master as she mistook him for a hairless faced, sparse haired and red earth encrusted bare footed gardener draped in his red earthstained sindon used as workwear. You also wrote: “You of all people should be aware of the identifications with pagan deities and the influence that could have on the way that people that never saw him visualized him.” In the specific case of the Hungarian Pray Ms bifolium I gave as an example, most likely the illustrator did SEE the crucifixion victim image on the Constantinople Sindon. Still it is reported by eyewitnesses “the ‘not made by hand’ image of Christ and G od, draped with a white/pure linen cloth he had worn, was sufficiently in lieu of the vision of the Lord coming into the flesh to those who had not corporally seen him”. Too bad you of all people are amazingly unaware of the corroborating 944 1207 CE testimonies and eyewitness descriptions of the TS image. Your refutation is still not serious and does not fit with the Gospels, the known (in terms of facts of experience) and the most comprehensive and logical explanation for Mary Magdalene mistaking her own master for the gardener..","date":"2014-10-20","mins":"6:33 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-164007","author":"max_patrick_hamon","post":"Addendum: In Matthew 28, his personification of lightning as natural/supernatural phenomenon (‘The Archangel of Lightning’) is a figure of speech (trope).","date":"2014-10-20","mins":"7:55 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-164012","author":"max_patrick_hamon","post":"Yahweh’s manifestation (=theophany) is accompanied by thunder and lightning..","date":"2014-10-20","mins":"8:04 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-165371","author":"max_patrick_hamon","post":"Eric, you wrote: “So far I have not found any trouble rebuffing your arguments back”. Methinks the main flaw in your argument is encapsulated in the very fact you STILL can mistake lightning for an angel. Myself I see ‘angels in clouds’ with or without lightning!.","date":"2014-10-25","mins":"4:00 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-165381","author":"max_patrick_hamon","post":"Eric, don’t you (mis)take the Bible TOO literally and mishmash fairytale with medical matters, please!.","date":"2014-10-25","mins":"4:37 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-165389","author":"max_patrick_hamon","post":"On fairy tale, I did. Re people resurrecting? I didn’t (not enough cases to study)..","date":"2014-10-25","mins":"5:03 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-165420","author":"max_patrick_hamon","post":"Eric, In other words, how many cases of people returning to life/resurrecting after violent death have you studied as far as alopecia is concerned? NONE. What about the real possibility the tug, pulling and friction of TOTALLY removing the encrusted blood from the hair could have resulted in TOTALLY losing moustache and beard hair and partially losing eyebrow and head brow hair making Yeshu’a look like a hairless faced gardener? Are you aware the TS man’s hair was as hard and stiff as cardboard and his eyebrows, moustache and beard all encrusted with dried blood? Methinks you’re amazingly UNAWARE. You wrote: “The only difference between my “fairy tale” and yours is that I readily admit that it is nothing more that speculation, nothing more than a thought exercise, while you claim that yours is the truth based on something as subjective as it appearing to be “logical”. I’m not telling ‘fairy tale’ at all. YOU are (re lightning you most naively mistake for an angel!). First read Jewish popular literature as far as the so called ‘Archangel of Lightning’ is concerned (actually it refers to a very old deity!) before passing comment. Besides re preoccupation with impurity then arising from a concern for defiling at the contact of gardeners used to handle manure, how long will you TOTALLY overlook the FACT Second Temple period gardeners had a hairless face and their head was clean shaved or half shaved to be easily spotted from afar? This is NO fairy tale at all! You also wrote: “The shorud depicts a man with full hair, so if it is real, that is a problem for your theory.” This is not a problem for me but for YOU as Yeshu’s is reported to have appeared in flesh and bones, not as a ghost and even ate with his disciples! You have no CLEAR logical explanation to provide for Yeshu’a returning to life/resurrecting NOT in spirit but in his physical body and STILL not being recognizable at first sight by most if not all of his disciples..","date":"2014-10-25","mins":"6:52 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-26008","author":"max_patrick_hamon","post":"The shoud S (the Turin Shroud, Oviedo Sudarium, Cahors Headdress and Manoppello Veil) are sign(s). In Greek the word othonia for ‘shrouds’ plays with the Hebrew phrase ‘oth yonah’ i.e. “sign of Jonah/Jonas. Ring a bell?.","date":"2013-03-01","mins":"8:10 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26012","author":"max_patrick_hamon","post":"(it is called a regressive xenometathesis by the purists).","date":"2013-03-01","mins":"8:34 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26454","author":"max_patrick_hamon","post":"Dave you wrote: Mark 14:53 56: “They led Jesus off to the high priest; and ALL THE CHIEF PRIESTS AND THE ELDERS AND THE SCRIBES ASSEMBLED THERE. [Peter warms himself at fire] THE CHIEF PRIESTS AND THE WHOLE SANHEDRIN were looking for evidence against Jesus on which they might pass the death sentence. SEVERAL indeed brought false evidence against him, but their evidence was conflicting. …” And you comment: “It is plain from Mark that there were rather more present than the three rostered members of the Sanhedrin.” The TRUE fact is this is ONLY PLAIN FROM the above CURRENT TRANSLATION. Is the CURRENT TRANSLATION from the ancient koine Greek version accurate? I very much doubt so. What about the most likely Galilean Aramaic substratum? The same text can be understood in a quite different way, it just depends of the translation strategy (word for word translation vs. Sense for sense translation/source oriented translation vs. Target oriented translation, direct translation vs. Oblique translation (by Vinay & Darbelnet), adequacy vs. Acceptability, formal equivalence vs. Dynamic equivalence (by Eugene Nida), semantic translation vs. Communicative translation (by Peter Newmark), overt translation vs. Covert translation (by Juliane House), documentary vs. Instrumental translation (by Christiane Nord), foreignization vs. Domestication (by Lawrence Venuti), etc. While these binary oppositions have much in common, they reflect different perspectives and emphasize different translation aims and effects). The TRUE fact is the same text can be translated according to a time perspective more consistent with the real chronology in terms of Yeshua’s trial by the Sanhedrin. The same sentences can be read as follows: 1 They led Jesus off to the high priest 2 And It was there all the chief priests and elders and the scribe WOULD assemble (…) 3 The chief priests and the whole Sanhedrin HAD BEEN looking for evidence against Jesus on which they might pass the death sentence. Several (witnesses) indeed HAD BROUGHT false evidence against him, but their evidence was conflicting. Reminder for Dave: Yeshua has ALREADY been judged and sentenced to death in absentia. To confirm a death sentence in presentia ONLY 3 Sanhedrin members were needed..","date":"2013-03-04","mins":"7:27 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26461","author":"max_patrick_hamon","post":"Typo: Reminder for Dave: Yeshua HAD ALREADY BEEN judged and sentenced to death in absentia..","date":"2013-03-04","mins":"8:03 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26458","author":"max_patrick_hamon","post":"PS The only sb nag is you just cannot find it in Encyc. Brit. (this my opinion. Reminder: I took part at the creation of the CELT in the faculty of Arts of the University of Riyadh. CELT is the acronym for Centre for European Languages and Translation).","date":"2013-03-04","mins":"7:47 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26464","author":"max_patrick_hamon","post":"Reminder for Dave about translation strategies: researchers agree on a few defining characteristics of a translation strategy: 1) it is goal oriented; 2) it is problem centered; 3) it requires making coordinated decisions; 4) it is potentially conscious; and 5) it involves text manipulation..","date":"2013-03-04","mins":"9:03 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26517","author":"max_patrick_hamon","post":"Addendum: you’d better read books on Yeshua’s trial S (with an S), before passing comments..","date":"2013-03-05","mins":"11:00 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26510","author":"max_patrick_hamon","post":"Reminder 1 for Dave: I am a professional cryptologist who he used to apply cryptology to historically/archaeologically enigmatic/ ‘non evident’, inscriptions, images AND TEXTS. Reminder 2: when I wrote “I took part at the creation of the CELT in the faculty of Arts of the University of Riyadh”, I implied I had developed translation skills from Semitic languages (e.g. Modern Standard Arabic and Syrian Aramaic) into European languages (e.g. French) Reminder 3: The earliest piece of external, direct evidence for the Marcian tradition comes to us from Papias, bishop of Hierapolis, (c. 60 130) via Eusebius. It seems trustworthy, because it is an old tradition quoted by a usually reliable anthologist and it agrees with the internal evidence. Reminder 4: The TRUE fact is Semitic syntactical features influence the form of Kepha/Peter’s memoirs. It does show off through John Mark’s word for word/accurate translation and transcription of Peter’s (oral) memoirs as eyewitness accounts. Immediacy is one of Peter’s (oral) memoirs features in translation koine Greek (as opposed to ‘mediacy’). You should keep in mind that Kepha/Peter was a Galilean Aramaic native speaker. He did not have enough facility in Greek to write in a higly literay style (e.g. In terms use of the pluperfect). When he was in Rome, his Greek was most likely aramaicised with the related loss of subtleties in his Greek spoken skills. How long will you keep ignoring it? Reminder 5: Neither Nicodemus nor Joseph took a hand in Yeshua being sentenced to death. What do you make of it? Reminder 6: I say it once I say it twice (just in case you did not quite get the real purport of it): Yeshua HAD ALREADY BEEN judged and sentenced to death IN ABSENTIA. To confirm a death sentence IN PRESENTIA ONLY 3 Sanhedrin members were needed. Haven’t you checked out in the Gospels and the Talmudic/Rabbinic literature? Had you, you should have been aware my point is quite substantiated and has valid ground. What do you make of it? Just nothing because it just doesn’t fit into your ‘Ency. Brit. Ready to think’ picture of the event. (First check out and then constructively criticize ONLY IF NEED BE, PLEASE! Thank you to refrain from gratuitous critiques).","date":"2013-03-05","mins":"10:02 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26521","author":"max_patrick_hamon","post":"Addendum 2: Just forgot to tell you both Aramaic and Hebrew do not have a specific way of communicating a pluperfect tense..","date":"2013-03-05","mins":"11:30 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26523","author":"max_patrick_hamon","post":"E.g. Hebrew/Aramaic students would translate the “vav consecutive preterite” verb as a pluperfect. This is exactly what we have with Mark 14:53 56..","date":"2013-03-05","mins":"11:35 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26525","author":"max_patrick_hamon","post":"What do you make of Galilean Aramaic to Ancient koine Greek translation entropy? Nothing I guess since you are not even aware of it!.","date":"2013-03-05","mins":"11:45 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26537","author":"max_patrick_hamon","post":"Typo: This accounts for the sentence about the ‘Hanan House’ and that about ‘Yeshua’s trial in absentia’ as informative interpolate clauses aimed at non Jews..","date":"2013-03-05","mins":"3:29 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26558","author":"max_patrick_hamon","post":"Dave you wrote: “Are you able to say that nowhere in the gospel of Mark is the pluperfect ever used? In that case it would be a telling piece of evidence supporting your assertions”. I confirm as far as Mark’s original Gospel ancient koine Greek version is concerned. The pluperfect use issue is crucial to correctly put the Mark’s gospel events in a more consistent narratological perspective. Reminder 4bis: we can distinguish three categories of pluperfect in Hebrew narrative (Genesis through Kings): that expressed by a perfect verb form; that expressed by a wayyiqtol verb form consequent on a perfect (= imbedded storyline); and that expressed by a wayyiqtol form without previous signals. The same goes with Galilean Aramaic and Judean Aramaic. Dave you also wrote:” If Mark’s gospel was only intended for Roman Gentile Christians, why then was it not written in Latin?” Greek was widely spoken in Rome in the first century CE ( see Juvenal, Sat., 3.60 61; 6.187 99) and Martial, Epig., 14.58). Absent the fact Mark was thinking that a Greek gospel would be more useful in the Roman world than a Latin one, Greek was the most common language spoken in the Roman empire. It was also widely spoken in Rome in the first century CE ( see e.g. Juvenal, and Martial). Hence most likely/naturally Mark thought Greek could be more useful as written medium in the Roman world than Latin. Thank you for ‘pushing me’ to spell it out for you (and for me). Do hope a few more than the two of us got hooked on the issue..","date":"2013-03-05","mins":"8:05 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26536","author":"max_patrick_hamon","post":"Addendum 3: The intended readers of the Gospel of Mark were Roman gentile Christians. This account for the ‘Hanan House and Yeshu’s trial in absentia’ two sentences as informative interpolate clauses aimed at non Jews..","date":"2013-03-05","mins":"3:25 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26083","author":"max_patrick_hamon","post":"Paul dictated it while Luke translated it in written form..","date":"2013-03-01","mins":"2:54 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26014","author":"max_patrick_hamon","post":"Typo: a PR Ogressive xenometathesis.","date":"2013-03-01","mins":"8:37 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26084","author":"max_patrick_hamon","post":"Rephrasin Paulus/Shaul dictated it in Aramaic/Hebrew while Lukas/Yair translated it into written Greek..","date":"2013-03-01","mins":"2:58 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26086","author":"max_patrick_hamon","post":"(most likely).","date":"2013-03-01","mins":"3:01 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26085","author":"max_patrick_hamon","post":"(sent to hellenised Judeans).","date":"2013-03-01","mins":"3:00 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26093","author":"max_patrick_hamon","post":"Typo: I meant (most U Nlikely).","date":"2013-03-01","mins":"3:57 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26091","author":"max_patrick_hamon","post":"(or else the reverse: since Paulus/Shaul was a Judean who was Hellenised and also a Roman citizen, he could have dictated the letter in Greek and had Lukas/Yair translated into written Hebrew/Aramic).","date":"2013-03-01","mins":"3:49 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26092","author":"max_patrick_hamon","post":"Typo: translated it.","date":"2013-03-01","mins":"3:49 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26206","author":"max_patrick_hamon","post":"Once again Dave you got it all wrong (as received idea). John Mark/Yo Hanan Maqqaba was faithfully JUST word for word translating Peter/Kêpha Galilean Aramaic into koinê Greek (if you see what I mean). John Mark was the translator (the hermeneutes i.e. Translator, stenographer) of not only Kêpha/Peter but ALSO Pauls/Shaul. Is Encyclopedia Britannica your ‘sole reference’ in terms of palæochristian philological analysis/textual archaeology?.","date":"2013-03-02","mins":"9:48 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26106","author":"max_patrick_hamon","post":"“Paul was fluent in Greek and needed no translator. Luke himself was more comfortable in Greek than in Hebrew”. Indeed? What exactly makes you think so? Question for Dave: how come then Paulus/Shaul first took Yo Hanan/John as HIS personal translator and scribe/secretary on his first travels?.","date":"2013-03-01","mins":"5:39 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26154","author":"max_patrick_hamon","post":"Dave you wrote: “His need for John Mark as a translator is an assumption. He may very well have been needed to carry the bags.” 100% wrong. BTW do you know the Greek word for translator? Ring any bell when rereading the Greek version of the Acts of the Apostles? Come on!.","date":"2013-03-02","mins":"7:57 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26245","author":"max_patrick_hamon","post":"The/your case is very weak indeed..","date":"2013-03-03","mins":"8:12 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26248","author":"max_patrick_hamon","post":"Typo: really started HALF a century ago.","date":"2013-03-03","mins":"8:28 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26247","author":"max_patrick_hamon","post":"Dave, BTW in which year was your Encyclopedia published? Given research work on the Hebrew/Aramaic substratum of the NT started nearly a century ago, just guess how many scholarly research works on the NT you are totally ignoring..","date":"2013-03-03","mins":"8:27 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26250","author":"max_patrick_hamon","post":"Reminder: I don’t share Maryam Ebrahimpour et al’s paper solution. In my opinion it is non conclusive..","date":"2013-03-03","mins":"8:34 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26064","author":"max_patrick_hamon","post":"The Holy of Holies of the Jerusalem Temple also struck Roman Emperors as an empty place hidden away/separated from the rest of the Temple by a LINEN veil with TWO FIGURES of cherubim (angels) embroidered onto it. Ring another bell? If none just see the Book of re VE Lation….","date":"2013-03-01","mins":"12:15 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26262","author":"max_patrick_hamon","post":"To Dave: Most likely Yo Hanan (later to be called Maqqaba)/John (Mark) was formerly a High Priest servant (Hebrew ebed/eved/Gr. Huperethen). The Hebrew word sophereth (assistant secretary, scribe) can be rendered in Greek by huperethen, “assistant’. Most likely John (Mark) was ‘the (High Priest) servant’ that let Kêpha/Peter in the High Priest house the night before the Passion. Most likely, as stenographer, he was also the one who registered the dialogue between ‘Yeshua and High Priest Hanan on that very night. Most likely too Yeshua’s gave his Sindon to John (Mark) (or Joseph of A. His uncle as first/second best candidate)… (this is my opinion. My claim is definitely NOT ‘unsubstantiated assertions couched in obscure circumlocuitous arcanery’ as you most ignorantly put it)..","date":"2013-03-03","mins":"12:03 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26281","author":"max_patrick_hamon","post":"John (Mark) as hermeneutes, Greek for ‘translator, stenographer’ (first Peter’s) + huperethen, Greek for ‘assistant, servant’ (then Paul’s) = ‘sophereth, Hebrew for ‘assistant secretary’ as High Priest/Chief Rabbi’s translator and stenographer..","date":"2013-03-03","mins":"3:09 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26263","author":"max_patrick_hamon","post":"John (Mark) also was Kêpha/Peter’s hermeneutes (translator, stenographer)..","date":"2013-03-03","mins":"12:05 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26065","author":"max_patrick_hamon","post":"Or see the Letter to the Hebrews..","date":"2013-03-01","mins":"12:16 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26264","author":"max_patrick_hamon","post":"Most likely, as Paulus/Shaul’s huperethen/assistant/servant, John (Mark) was his personal assistant secretary. Got it?.","date":"2013-03-03","mins":"12:10 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26268","author":"max_patrick_hamon","post":"Typo: Hebrew to Greek language translation entropy.","date":"2013-03-03","mins":"12:31 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26265","author":"max_patrick_hamon","post":"Dave you claimed: “He (Yo Hana Maqqaba/John Mark) may very well have been needed to carry the bags (and nothing else)”. What a blatant ignorance of Greek Hebrew language translation entropy!.","date":"2013-03-03","mins":"12:20 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26294","author":"max_patrick_hamon","post":"I say it again (just in case): John (Mark) as hermeneutes, Greek for ‘translator, stenographer’ (first Peter’s) + huperethen, Greek for ‘assistant, servant’ (then Paul’s) = ‘sophereth, Hebrew for ‘assistant secretary’ as High Priest/Chief Rabbi’s translator and stenographer. This would explain many things Dave (and even his Bible like Ency. Brit. Companion as prompter) would be quite at a loss to REALLY account for. If you really think John Mark was “Paul’s bags carrier”, good to you. However you must be reminded your opinion is even FAR MORE “unsubstantiated” than mine as far as Hebrew, Greek and Translation entropy is concerned. Besides you cheap hypothesis is “based on uncited assertions, regardless of any claims to some expertise in (such a) matter (…)” as you would put it against me. You also mentioned “the possible healing of his wounded ear, if indeed it was Mark”. What a funny idea of yours. I never claimed John Mark was/could be identified with Malchus (a High Priest Servant in arms)?! You are totally off the ‘mark’ (pun intended)..","date":"2013-03-03","mins":"6:11 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26296","author":"max_patrick_hamon","post":"BTW as a professional cryptologist, I am used to proceed to cryptogenetic analyses applied to texts whose author(s) or persons mentioned in it have apparently no evident identification or are apparently of unknown identity. I do think I have some expertise in this most specific field..","date":"2013-03-03","mins":"6:26 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26391","author":"max_patrick_hamon","post":"Reminder 3: Mark’s Gospel is totally based on Peter’s memoirs NOT Nicodemus & Joseph of Arimathaea’s..","date":"2013-03-04","mins":"9:26 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26297","author":"max_patrick_hamon","post":"Typo: applied to texts whose author(s) or persons mentioned in THEM have apparently no evident identification or are apparently of unknown identity..","date":"2013-03-03","mins":"6:27 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26390","author":"max_patrick_hamon","post":"Dave, you wrote: “… so that it’s if Mark who runs off naked, then clearly it’s not Mark who has his ear cut” as if I had ever claimed the contrary?! This is pretty obvious and was NOT the real issue under discussion! What I don’t really get is the reason why you had the ear cut incident come into the debate. You also wrote: “It would seem that the only really good reason for asserting that Mark was the Sanhedrin’s secretary, was that all other three gospel accounts of the trial adhere to Mark’s version fairly closely, albeit with some minor additions. But both Nicodemus & Joseph of Arimathaea could also have provided oral accounts which all four gospels could have then followed.” Reminder 1: According to Papias: ‘the Elder’ (Presbyter) used to say this, ‘Mark became Peter’s interpreter [hermeneutes, Greek that can also be rendered by ‘translator’ and/or ‘stenographer’] and wrote accurately (Peter’s memoirs). Reminder 2: from a close scrutiny of the High Priest House nightly episode and knowledge of Sanhedrin procedures, the Sanhedrin could only be composed of 3 members.Thus the odds for “Nicodemus & Joseph of Arimathaea” to be both in attendance that very night are very weak. Now if we base our deduction from Hebrew to Greek translation entropy (Gr. Hemeneutes + Gr. Huperethen (applied to the same person namely John Mark) < Heb. Sophereth, 'assistant secretary/assistant scribe = a young man), John (Mark) as High Priest Hanan's assistant/servant secretary (stenographer) does make more sense. Most likely he was the one to let Kêpha/Peter in and reported the dialogue between Yeshua and Hanan. Maybe we can go as far as deducing 'the young man who runs off naked' was John (later to be called) Mark. Maybe. The fact is this crypto exegesis is totally consistent with our knowledge of Second Temple period Sanhedrin procedures, Aramaic/Hebrew to Greek translation entropy and NT Greek Version..","date":"2013-03-04","mins":"9:24 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26394","author":"max_patrick_hamon","post":"Most likely..","date":"2013-03-04","mins":"9:37 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26392","author":"max_patrick_hamon","post":"The two direct witnesses on that night (The High Priest Hanan House scene) were Peter AND John Mark..","date":"2013-03-04","mins":"9:31 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26423","author":"max_patrick_hamon","post":"As long as it is good for you, it’s ok. However there is something quite ‘missing beyond faith’, I mean true facts..","date":"2013-03-04","mins":"2:39 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26425","author":"max_patrick_hamon","post":"Mary Magadalene mistook Yeshua for a gardener and not for an angel (a messenger). This clearly implies he could be mistaken for an everyday man. Can now a Christian clearly answer these two very simple questions in conjunction with the empty tomb and the funerary linen: 1/ Was Yeshua dressed or naked when he appeared to Mary Magdalene? 2/What did a Second Temple period gardener look like? (Of course I have my own idea about the most likely answers to both questions. Still I’d like to know how you Christians interpret Yeshua’s first apparition).","date":"2013-03-04","mins":"2:53 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26403","author":"max_patrick_hamon","post":"Yannick you wrote: And here’s the most important signs of the Ressurection (for me at least): “1 The testimonies of the disciples after the apparitions of the resurrected Christ. 2 The empty tomb (don’t forget that the empty tomb is a real historical FACT because even the ennemies of Jesus never denied it but instead, they explain it differently). 3 (which I put on the same level than the empty tomb).” OK for the first sign but what about the two other alleged ‘signs’? 1/ Neither Maria of Magdalene long with the other women nor Peter or even John himself (if we can read Church Doctor Augustine of Hippo) considered the empty tomb in se as a ‘Resurrection sign’. 2/ Was the Shroud lying ‘empty’ in the empty tomb? The true fact is John only mentioned shroud S not THE shroud. Thus it is not even a proven fact the long inner burial sheet still was lying in the empty tomb along with the other smaller shrouds. Reminder: on the morning of the first day of the Judean week, Yeshua appeared first to Mary Magdalene. Was he dressed or naked? What did a Second Temple period gardener look like? Just have a guess… ..","date":"2013-03-04","mins":"11:24 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26439","author":"max_patrick_hamon","post":"0/ How can Mary Magdalene discriminate between an angel and a gardener?.","date":"2013-03-04","mins":"5:32 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26438","author":"max_patrick_hamon","post":"Yannick, you wrote: “Of course he was dressed! Have you ever seen a gardener naked?” “In that context, I think Mary Magdalen mistook the man she had in front of her as a gardener not because of his dressing but more likely just as a logical deduction determined by the location of the tomb and the time of the day. Who else than a gardener can you expect to see in a garden very early in the morning?” 1/Re your “logical deduction”, do you expect to see ‘angels’ too? 2/Re “a logical deduction” while your having ‘no idea’, ever thought Second Temple period gardeners could be easily recognisable?.","date":"2013-03-04","mins":"5:23 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26440","author":"max_patrick_hamon","post":"4/Don’t you think he might as well be the owner of the cavetomb (Yossef Ha Ramathaym?.","date":"2013-03-04","mins":"5:38 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26443","author":"max_patrick_hamon","post":"Typo: he might as well have been.","date":"2013-03-04","mins":"5:43 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26442","author":"max_patrick_hamon","post":"…or a guard?.","date":"2013-03-04","mins":"5:38 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26444","author":"max_patrick_hamon","post":"5/How can Mary Magdalene discriminate between an angel and a gardener and still not being able to recognise her own Rabbi?.","date":"2013-03-04","mins":"5:52 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26452","author":"max_patrick_hamon","post":"Yannick, Ddon’t you think Yeshua’s first apparition to Mary Magdalene is a far cry from “the resurrected Christ in all his glory package” most Christians try to sell us?.","date":"2013-03-04","mins":"6:59 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26447","author":"max_patrick_hamon","post":"6/How can Mary Magdalene discriminate between an angel a gardener, the landlord, a gard and still not being able to recognise her own Rabbi?.","date":"2013-03-04","mins":"5:54 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26404","author":"max_patrick_hamon","post":"Typo: YC wrote: “3 The empty Shroud (which I put on the same level than the empty tomb).”.","date":"2013-03-04","mins":"11:29 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-36444","author":"max_patrick_hamon","post":"O.K., Methinks it is rust (dye) and the touch up can be Late Antique or High Medieval. Fanti and Jaworski may have mistaken rust micro traces for paint since no direct observation is possible only through the glass panes..","date":"2013-06-08","mins":"12:16 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36438","author":"max_patrick_hamon","post":"O.K., try to get macrophotographs of BOTH the Veil face an the Tilma face for a comparative study. None of the eyes is painted. On February 26, 2013, I wrote: “In 1997, I was allowed by the Friar Capuchin curator, to examine and study “face to face” the Holy Face of the Veil of Manoppello for more than an hour (both in naturally transmitted light outside the church and at macrographic level through the glass panes). I then jotted down as observations: « the presence of a “preparatory mordanting” as outline to be dyed in grey lead is noteworthy and is how an artist would have worked. Most likely the Veil is authentic (as burial face cloth placed over TS enshrouding the head and pressed and fastened via a skull cap on top) but most likely affected by a Late Antique (much in the vein of the Fayum portraits) or High Medieval ‘micropointillistic like touch up’ » (my translation from French).” In reply to Falcinelli’s question (“The Veil of Manoppello: work of art or authentic relic?”), I once wrote: “It is BOTH. My opinion actually is it is a mussel silk veil that most probably was ingeniously dyed with natural rust and grey lead very fine powder mixed with water + ammonia or vinagre. It was meant to complete/enhance/touch up pre existing blood stains and facial pressure imprint left on a genuine burial relic of Yeshua: the marine byssus sudarium that was placed and pressed on top of the Sindon enshrouding his head on burial. (This “sudarium” shall not be mistaken for two other famous sudarii namely the pre burial Sudarium of Oviedo and the Cahors skull cap/headdress). I challenge Falcinelli (and anybody) to try and demonstrate/convince any Art Historian worth his salt that the present official Veronica is the same relic that became popular in 1208 when Innocent III chose to have the Veronica processed in a reliquary of gold, silver and gems through the streets of Rome. The Veronica “Veil II” disappeared/was stolen during Charles V’s “sack” of Rome in 1527 CE and unofficially resurfaced in Manoppello in 1608 CE. Falcinelli claimed it is ‘a 16th c. Painting’a and, what is more, the self portrait which Dürer then gave to Raphael and « painted in water colours, on byssus, so fine that it was transparent, and finished without using white lead, the fabric itself serving for the whites and the fine threads being used to represent the hairs of the beard/to form the lights of the picture, and when held up to the light it was transparent all over ». If so, could Falcinelli answer the following questions : 0/How can the written source (Vasari) he relies on tells it is a self portait by Dürer and then, « on Falcinelli’s personal careful iconographic analysis », the painting turned out to be a self portrait by Raphael ? This is rather confusing if not suspect to say the least. 1/Can he forensically and conclusively demonstrate the Durer’s and Manopello Veil Man’s features perfectly match ? 2/ How could Dürer have “painted” it when already ca 1430 CE (i.e. More than a century and half beforehand), the Master of Flémalle had already painted the same Manoppello Veil aka Veronica on oakwood? 4/How could Dürer have “painted” the Face “in” the Manoppello Byssus Veil when marine Byssus/mussel silk definitely just cannot be painted but only dyed? 5/Does he know of any other similar piece of art be still extant? Re conclusive material identification of Manoppello Veil with pre 1527 Rome Veronica, true material facts are still to be fully cross investigated namely – the very Veronica reliquary of the 1350 Jubilee, with its broken glass panes still preserved in St. Peter’s treasure as it was reported (by German Jesuit art historian, Joseph Wilpert) to still retain in its very frame a piece of transparent cloth. – the piece of glass (reported by Pfeiffer) to be still stuck on the veil.The risk though would be to open the Manoppello Veil monstrance as the latter has not been opened since the vey day it was put between the two glass panes i.e. Since the first mid 17th C.E., the risk being the relic just turns into…dust. The Veil having been trimmed in the early 1600’s by the Capuchin monk, Father Clemente, is there any hope to recover the cut hanging threads in order to analyse and C14 date them? Were they kept or trashed? And if ever kept by whom and where?” As far as the eyes of the “Virgen” are concerned, they are even more intriguing. Besides looking like “living eyes” with most tiny intriguing patterns, their colour do look as if made of “nothing”..","date":"2013-06-08","mins":"11:20 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36445","author":"max_patrick_hamon","post":"I repeat marine Byssus just cannot be painted only dyed..","date":"2013-06-08","mins":"12:18 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36452","author":"max_patrick_hamon","post":"I 100% agree with Fr. Pfeiffer as far as the placing of the face cloth (aka Veil of Manoppello) over the TS is concerned. As a still extant symbolical/mimetical parallel presentation, “the Lateran palace image (…) was the image of an enthroned Christ with a crossed halo, featured as the Teacher holding the scroll of the Law in his left hand while his right is raised in benediction. The face completely changed when Pope Alexander III (1159–1181) had the present one, painted on silk, PLACED OVER the original WITH THE HEAD SOLE APPEARING as if in LANDSCAPED FRAME (2×1) the rest of the icon being covered with an embossed silver plate and precious stones.”.","date":"2013-06-08","mins":"2:13 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36446","author":"max_patrick_hamon","post":"Louis, i didn’t said it was “a painting”. Most likely it is both ‘not man made’ in terms of genuine facial pressure imprint on a burial face cloth and ‘man made’ in terms of grey lid and rust dyed portrait..","date":"2013-06-08","mins":"12:23 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36453","author":"max_patrick_hamon","post":"In the twelfth c. CE, were there two different silk veils, one in Rome, another in Constantinople known as the Holy Face of the Holy Mandylion and then, from early thirteenth c. CE to 1527 CE, were the two in Rome?.","date":"2013-06-08","mins":"2:19 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36456","author":"max_patrick_hamon","post":"O.K. You wrote: “can we say 100% that the Veil is made of byssus, since it has not been removed from behind the glass since 18th century?” See Jaworski’s 2010 paper (“Properties of byssal thread, the chemical nature of their color and the Veil of Manopello”)..","date":"2013-06-08","mins":"2:36 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36519","author":"max_patrick_hamon","post":"O.K., the true fact is the first time I saw the original MV, I did think myself it was linen Byssus. Now with Pr Jaworski’s studies, it might be marine Byssus as well (Pr Jaworski ‘almost’ convinced me). More independent research is needed though, I do agree. Grey lead and rust as pigments can be dyed not just painted..","date":"2013-06-09","mins":"7:15 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36514","author":"max_patrick_hamon","post":"Here are the Conclusions of Prof. Jaworski Regarding Marine Byssus (Sea Silk) and the Veil of Manoppello: “The brown color of byssus threads originates from the pheomelanin pigments; its marker (BTCA) was detected by HPLC after degradation. Degradation of byssus threads (chemically by some oxidants in proper media) results in changes of the brown color: bleaching to pale straw color, to colorless and to reddish. It looks highly probable that the image on the Veil of Manoppello (at least in most parts) was formed by modifications of pheomelanin, natural pigment of byssus. Thus, there is an additional similarity with the image on the Shroud of Turin, which was “created” by oxidation dehydration processes of cellulose of the linen. Byssus properties are responsible for some unique properties of the Veil of Manoppello, like the transparency after strong illumination. Future detailed investigations on byssus properties (including color changes) are desirable and they are possible even if the examination of the original Veil of Manoppello will not be available.”.","date":"2013-06-09","mins":"6:23 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36520","author":"max_patrick_hamon","post":"O.K., the quote is from Jaworski’s paper as given at the Frascati Conference on the Scientific Approach to the images of Turin, Manoppello and Guadalupe held in May 2010..","date":"2013-06-09","mins":"7:29 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36530","author":"max_patrick_hamon","post":"It may be Jaworski’s paper first/intermediary version..","date":"2013-06-09","mins":"8:09 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36524","author":"max_patrick_hamon","post":"Addendum: On October 24, 2012 at 3:04 pm (#3 Reply), I wrote: “(…) Forensically speaking (and WELL EVEN BEFORE the Manopello Veil face was scientifically examined), the slight deviation of the fleshy tip of the TS man’s nose was detected (in the1970s). Iconographically speaking, the same feature happens to be ALSO detectable on the MV face. In the mortuary/morgue, corpses with “skewed nose tip” are a well known fact. It is mainly due to having a corpse fit in in a zipped up body bag that was originally too small and and has caused excessive pressure on the defuncted’s face. This is additional evidence the TS man was tightly wrapped up in his burial shrouds. ..","date":"2013-06-09","mins":"7:38 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36517","author":"max_patrick_hamon","post":"Reminder: The visual fact is, anyone observing the TS man’s face will (at first and maybe even second and third sight) see an ‘almost’ normal nose. However a very close examination of the face in terms of geometrical projection made from a life size photograph tells us ‘a quite different story’: To the sole exception of the bony areas of the eye sockets and nasal septum, all the rest of the face shows irregular features and displacements. Once carefully overlaid (at scale 1 :1), the two holy faces (Manoppello Veil and Turin Shroud) do reveal the face of a man with a ‘skewed nose’. This is confirmed by Byzantine numismatics in nearly a dozen of extant gold coin obverses featuring a ‘Shroud Veil like’ Christ Pantocrator..","date":"2013-06-09","mins":"6:52 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36529","author":"max_patrick_hamon","post":"A slight curve effect (e..g, along the nose) can also result from the sustaining medium (i.e., the very Byssus trellis) that has these curves sort of ‘printed in’ in the hypothesis the MV is a burial face cloth that originally was placed over and fastened at head level around the TS man. Almost the same curve effect can also be seen in Allen’s and Guaraschelli’s reconstructions (positive/negative face close ups). Now the MV face is also sort of a reconstruction as most likely it was affected by a Late Antique (much in the vein of the Fayum portraits) or High Medieval (‘micropointillistic like) touch up’ ».","date":"2013-06-09","mins":"8:04 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36538","author":"max_patrick_hamon","post":"Iron water/rust solution + vinagre or ammonia can be used to dye marine byssus..","date":"2013-06-09","mins":"10:09 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36536","author":"max_patrick_hamon","post":"O.K., you wrote: “According to Pfeiffer, the Image of Camoulia was sent to Rome in 705, just before the first iconoclasm began”. Methinks (as far I can reconstruct their history) TWO PAINTED COPIES ON CLOTH (one full length on linen, another with just a face painted on silk) each one known as “the Image of Camoulia” were sent to Rome in 705 and were known as “The Uronica” and “The Veronica (I)”. Reminder: “Pope Alexander III (1159–1181) had the present face, PAINTED ON SILK, PLACED OVER the original Lateran palace image on fine fabric, probably LINEN of an enthroned Christ with a crossed halo, featured as the Teacher holding the scroll of the Law in his left hand while his right is raised in benediction. THE HEAD SOLE APPEARING as if in LANDSCAPED FRAME (2×1) the rest of the icon being covered with an embossed silver plate and precious stones”. Respectively, they were painted ‘copies’ on cloth of the original Holy Himation/Sindon tetradiplon and the Holy Face of the Holy Mandylion. Don’t you forget about a third Byzantine ‘miraculous’ image of Christ: The Holy Face of the Holy Keramydion/Keramion. Most likely the Keramydion/Keramion was a ‘negative copy’ (of the Himation face) on brick known afterward as the Holy Brick and the Mandylion a ‘positive copy’ (of the same Himation face) dyed on a marine byssus face cloth known afterward as the Holy Mandylion. You wrote: “One “Holy Towel” from Constantinople was purchased by king Louis IX, transferred to Sainte Chapelle in France in 1247, destroyed in 1792 during French Revolution.” On June 26, 2012 at 10:50 am (#44 Reply) I wrote: “I wrote: Holy Face of The Holy Mandylion’s precious empty reliquary/casket being housed in the Holy Chapel at Paris as: “San(c)tam toellam/trellam tabule insertam” (“La sainte Treille [d’argent surdoré]/une bouette, de vingt deux pouces de long sur quinze de large, […] couverte de lames d’argent et garnye de quelques pierres précieuses […] insérée à la table[ reliquaire] ; au dedans de lad[ite] boîte, le fond est revêtu de lames d’or dans tout le contour, et dans le milieu […] est l’apparence/la représentation d’une effigie/la sainte face de N.S.J.C ou la Véronique ; lad[ite] trelle comme consommée contre lad[ite] table[ reliquaire], autour, environ et dans lad[ite] effigie/face”)… Toellam/Trellam = Trelle. In 14th 17th c. CE gothic script, the “r “& “o” letters are absolutely identical. Hence the good lesson here in descriptive context is “the Sainte T Relle” (not “the Sainte T Oelle”). This was a precious empty flat box/reliquary table.The Holy Face of the Holy Mandylion as real sweat towel WAS NOT WITHIN THE BOX, just a representaion of it… Besides, on June 26, 2012 at 5:48 am (#32 Reply) I wrote: “Most likely the “relic” known as the “Sainte T Relle/Véronique/Mandylion” once kept in the Paris Sainte Chapelle Treasure was THE EMPTY RELIQUARY (a silver gilt treillised flat box shaped reliquary with a portrait painted inside on a board). It looked like the Holy Face of The Holy Veronica then in Rome aka the Holy Face of the Veil (shortened in size) now kept in Manoppello aka most likely the Holy Face of the Holy Mandylion once kept in Constantinople. On June 25, 2012 at 10:44 am (#36 Reply), I also wrote: “The MV face does appear desembodied as the Holy Mandylion faces of Laon, Novgorod etc The Holy Mandylion faces are either looking straight in front or on the left or the right. This is a tel tale detail. I went twice to Manopello. The first time (in May 1997), I was allowed to proceed to a very close examination of the Holy Veil for more than an hour. No matter how close and wherever I stood looking at “the face in it”, IT was looking back at me straight in the eyes… It was a quite strange and unforgettable experience. The visual effect of always looking at me/you whatever position you adopt to see the Holy Veil face is actually due to the MV man’s eyes’ slightly convergent strabismus..","date":"2013-06-09","mins":"10:06 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36540","author":"max_patrick_hamon","post":"Rust (and grey lead) are real pigments..","date":"2013-06-09","mins":"10:39 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36424","author":"max_patrick_hamon","post":"The sole true exception to the rule of nature may be the Guadalupe Tilma Face (I saw it once as I lived nearly two years in Mexico). It has “living eyes” neither the Holy Face of the TS nor the Holy Face of The Manoppello Veil have (I personally made a macrographic study of the latter’s eyes. There are man made. The difference is quite striking with the “living eyes” of the Virgen of Guadalupe)..","date":"2013-06-08","mins":"5:05 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36553","author":"max_patrick_hamon","post":"Louis, you asked “How could Chiara Vigo judge that it is byssus just because of the shine?” Chiara Vigo can discriminate between marine and linen byssus. Most likely she is referring to the famous golden shine of sea silk as a crucial discriminating characteristic..","date":"2013-06-09","mins":"12:05 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36554","author":"max_patrick_hamon","post":"So much so, in full day light, the face cloth with the Christic face in it can…shine as gold!.","date":"2013-06-09","mins":"12:15 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36586","author":"max_patrick_hamon","post":"O.K., you wrote: “One “Holy Towel” from Constantinople was purchased by king Louis IX, transferred to Sainte Chapelle in France in 1247, destroyed in 1792 during French Revolution.” The true fact is various medieval reliquaries, including the grande châsse, were despoiled of all their gems and/or pearls and then were melted down. Only one or two Byzantine reliquaries were spared. None of the relics were destroyed..","date":"2013-06-09","mins":"8:35 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-125702","author":"max_patrick_hamon","post":"June 30th or May 30th (i.e. Today)?.","date":"2014-05-30","mins":"7:52 am","url":"https://shroudstory.com/2014/05/30/today-june-30th-is-the-last-day/","cat":"event","title":"Today, May 30th, is the last day . . . Well No.  Make that tomorrow."},{"id":"comment-47622","author":"max_patrick_hamon","post":"….While CB’s mummy leech et al scorch ‘theory’ would not even have been lamented..","date":"2013-10-16","mins":"7:06 am","url":"https://shroudstory.com/2013/10/14/update-on-the-ieee-workshop-september-in-italy/","cat":"event","title":"Update on the IEEE Workshop: September in Italy"},{"id":"comment-47623","author":"max_patrick_hamon","post":"…but only laughed at..","date":"2013-10-16","mins":"7:08 am","url":"https://shroudstory.com/2013/10/14/update-on-the-ieee-workshop-september-in-italy/","cat":"event","title":"Update on the IEEE Workshop: September in Italy"}]
