[{"id":"comment-14584","author":"max_patrick_hamon","post":"For the Oviiedo Sudarium carbon dating see the César Barta Gil paper, Datacion radiocarbonica del Sudario de Oviedo, proceedings of the/Actas del “II Congreso Internacional sobre el Sudario de Oviedo” (2007), pp. 137 155..","date":"2012-08-07","mins":"10:03 am","url":"https://shroudstory.com/2012/08/02/how-good-is-the-match-up-between-the-sudarium-and-the-shroud/","cat":"blood_studies","title":"How good is the match up between the Sudarium and the Shroud?"},{"id":"comment-14585","author":"max_patrick_hamon","post":"Statistically speaking, the true reliability of 14c dating is only about 70% (from Barta’s, Meacham’s and Voruz & Meanen’s studies). It is even lower for textile samples..","date":"2012-08-07","mins":"10:19 am","url":"https://shroudstory.com/2012/08/02/how-good-is-the-match-up-between-the-sudarium-and-the-shroud/","cat":"blood_studies","title":"How good is the match up between the Sudarium and the Shroud?"},{"id":"comment-31674","author":"max_patrick_hamon","post":"Most likely, the sudarium is only a pre burial cloth and was not subjected to a purifying and drying ritual whereas the long inner shroud as a burial cloth was..","date":"2013-04-23","mins":"6:19 pm","url":"https://shroudstory.com/2013/04/23/new-video-on-the-sudarium-of-oveido/","cat":"news_&_views","title":"New Video on the Sudarium of Oveido"},{"id":"comment-14569","author":"max_patrick_hamon","post":"When it comes to CONCLUSIVELY carbon date claimed old burial linens, history of their conservation conditions (and first and foremeost the specific burial rite they were subjected to) is vital information. Now both for the Turin Sindon and the Oviedo Sudarium much of the information is lacking.","date":"2012-08-07","mins":"7:43 am","url":"https://shroudstory.com/2012/08/02/how-good-is-the-match-up-between-the-sudarium-and-the-shroud/","cat":"blood_studies","title":"How good is the match up between the Sudarium and the Shroud?"},{"id":"comment-14526","author":"max_patrick_hamon","post":"There is one more thing CB seems also not to be much aware: bloodstains and other body fluids on old linens shall be studied AT LEAST not only from reflected but also transmitted and raked light images + UV and X ray images.His approach is totally unscientific..","date":"2012-08-06","mins":"6:31 am","url":"https://shroudstory.com/2012/08/02/how-good-is-the-match-up-between-the-sudarium-and-the-shroud/","cat":"blood_studies","title":"How good is the match up between the Sudarium and the Shroud?"},{"id":"comment-14527","author":"max_patrick_hamon","post":"Mistypings: There is one more thing CB seems not to be much aware of:.","date":"2012-08-06","mins":"6:33 am","url":"https://shroudstory.com/2012/08/02/how-good-is-the-match-up-between-the-sudarium-and-the-shroud/","cat":"blood_studies","title":"How good is the match up between the Sudarium and the Shroud?"},{"id":"comment-190809","author":"max_patrick_hamon","post":"Shall I repeat, forensically speaking BOTH typological AND accidental characteristics (whether it be just bloodstains or coin blood decals) have to be taken into account to REALLY build a crucial/gun smoking evidence. Personnally, I haven’t studied the TS in light of the OS yet but did study and analyze configurations of very tiny bloodstain patterns (about 0.4 0.8 mm high) recorded at right and left eyesocket and eyebrow level. In light of two eidomatic reconstructions of two Roman colonial coin obverses (Pilate coins struck in the regnal years of Tiber), at least two of the tiny haematic configurations at right and left eyesocket level did prove to be VERY GOOD (if not perfect) matches (one at scale nearly 1:1; another at scale 3/4 due to subsequent slight shrinking of the stretched textile receiving surface) in terms of both TYPOLOGICAL and current ACCIDENTAL characteristics evidenced by extant (existing/available) coins..","date":"2015-02-12","mins":"7:19 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-216025","author":"max_patrick_hamon","post":"Hugh, shall I endlessly repeat: if the rare word tetradiplon is isolated in the Acts of Thaddeus (9th c. CE ms, Paris, Bib. Nat., 548 gr.), the same rare word is specified by rakkos (torn piece of cloth, towel or rag) in three derived texts (see above). Actually the astute reader has to FOCUS ON ALL the descriptions made of the Edessa cloth bearing the image of Yeshu’a’s face (see historical texts AND legends) not just one text and make a synthesis of the said descriptions. Then and only then, he could see they do point at a himation (i.e. A sindon about 4x1m) doubled in four layers or folded four times that looked like a clean towel, dirty rag or large kerchief with the ‘moist secretion’ (degraded sweat and blood, –see the two traditions first just sweat then sweat and blood–in The book of ceremonies / Constantine Porphyrogennetos) of Yeshu’a’s face imprinted/impressed onto/into the sindon tetradiplon. Archeaolgically speaking, the Turin Himation/Sindon Edessa Himation/Sindon/Tetradiplon/Rakkos connection works indeed!.","date":"2015-12-09","mins":"12:19 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-216031","author":"max_patrick_hamon","post":"Methinks you cannot read my English. For sure I won’t repeat anything..","date":"2015-12-09","mins":"12:44 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-216032","author":"max_patrick_hamon","post":"Reminder for Hugh (just in case he still could not get it): the himation (garment draped around a human body) looked like a rakkos (a torn piece of cloth/towel/rag) 110cm long and 55cm wide (i.e. Two cubits long and one cubit wide) when doubled in four layers..","date":"2015-12-09","mins":"12:49 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-216052","author":"max_patrick_hamon","post":"The Edessa cloth is described BOTH as a himation AND a rakkos in the corpus of the texts and legend that describe the relic, that’s a fact. To solve the apparent contradiction, the very synthesis of the descriptions of the Edessa cloth does imply the himation/sindon 4x1m can look like a towel/rag when doubled in four layers see PLEASE WATCH Ian Wilson’s video for an illustration of this at 03:37 till 03:52. Without even his knowing it, Ian Wilson proves via its reconstruction, the TS when doubled in four layers, does prove the Turin Sindon/Himation can look like a towel much like rag about 110 LONG and 55cm WIDE bearing scars of time such as a set of L or slanted P shaped like hole burns, an apparently “cut and resewn” lateral band, a roundish stain front and back and stains of ‘moist secretions”/human body fluids (degraded blood and sweat). What about you? Can you account for the Edessa cloth being described in the same corpus of historical texts and legends that describe the relic as BOTH a himation AND a rakkos/towel/rag or can’t you? BTW this is the third time I’am asking you! How long will I wait for your an answer? You are good to ask questions but not as good to provide answers!.","date":"2015-12-09","mins":"4:25 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-216053","author":"max_patrick_hamon","post":"Typo: How long will I wait for your to answer my question? You are good at asking questions but not as good to provide answers!.","date":"2015-12-09","mins":"4:27 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-216068","author":"max_patrick_hamon","post":"No Hugh. An article is not a corpus of testimonies. Besides, the two traditions can be right! The only snag with you is you have to dismiss data that doesn’t fit into your pre conceived idea as if the either/or decoding was the sole answer the both/and decoding could not prevail for the Edessa cloth just because you are unable to cope with ALL the data (intellectual laziness)..","date":"2015-12-09","mins":"6:02 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-216070","author":"max_patrick_hamon","post":"Or just because you think the TS is a 14th c. CE fake!.","date":"2015-12-09","mins":"6:05 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-216071","author":"max_patrick_hamon","post":"Hugh, methinks you should study Yeshu’as/Christ’s himation and loros Byzantine iconographies. They could tell you how the loros once symbolized Yeshu’a’s himation/sindon doubled lenghwise in two layers and used as a long ceremonial scarf draped around the body much alike a himation..","date":"2015-12-09","mins":"6:23 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-216073","author":"max_patrick_hamon","post":"Reminder for Hugh: The Byzantine loros a lavishly adorned long ceremonial scarf (worn only by the Imperial family, twelve of the most senior officials and archangels) was symbolic of Yeshua’s burial shroud bearing his transluscent body image and blood imprint. Now the first representations of the loros are on coins from the reign of Justinian II (r. 685–695 CE and 705–711 CE). Besides, on a late 13th c. CE altar antependium, the loros worn by two archangels (Michael and Gabriel) each time shows exactly the same herringbone pattern as the TS and is draped around each archangel’s body in the same way an himation was. Ring some bell?.","date":"2015-12-09","mins":"6:56 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-216074","author":"max_patrick_hamon","post":"Hugh, you won’t be right as long the facts won’t go away! I mean substance and out of intellectual laziness and prejudice, you’re just dimissing a literary data on a ‘take and leave’ fact. For what do you make of the Edessa cloth described of old as a himation (a 4x1m sindon): NOTHING since the description (an himation/sindon) fits too well with the Turin Shroud (436x111cm – 440x113cm)! YOU got it all wrong! Go to bed lazy intellectual!.","date":"2015-12-09","mins":"7:09 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215836","author":"max_patrick_hamon","post":"“Charles wrote: “As the Turin Shroud has nothing whatever In common with the Edessa image. I cannot see the relevance”. Actually the Shroud image ALIKE the Image of Edessa (in Yeshu’a’s likeness) can be described as “an imprint” and “a moist secretion with no paint or artistic craft, transferred with no artistic intervention onto the cloth”. Another historian, Ian Wilson, can see the relevance re the two characteristics if Charles Freeman just can’t Besides ALIKE the cloth of Edessa, (see The Acts of Holy Apostle Thaddaeus, –6th Century CE– that calls the cloth a tetradiplon (cloth doubled in four layers), a Greek term that only appears twice in historical texts, and both times refers to the Image of Edessa, the Turin Shroud was doubled in four layers (see the symetrical burn marks as proof). Can some bell ring in a British Roman Historian’s deaf ear? Has the word “relevance” a real meaning in British English?.","date":"2015-12-07","mins":"5:35 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215837","author":"max_patrick_hamon","post":"Besides The Edessa cloth was described in turns as a “rakkos tetradiplon” (it already had the symetrical series of burn holes and was , a “himation” (implying a piece cloth about 4m x 1m) and a… “SINDON”!.","date":"2015-12-07","mins":"5:40 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215842","author":"max_patrick_hamon","post":"Daveb, I am not of the view that the Mandylion and the Shroud were the same object. However at some point in time, methinks they were closely kept together in one reliquary as the Holy Face of the TRANSPARENT Holy Mandylion (now kept in Mannopello) was placed over the Shroud face. Hence the resulting confusion between a sudarium and a sindon (see the French word “suaire” that can be applied BOTH to a small face cloth and a larger shroud). Methinks Charles cannnot disicriminate between “tetradiplon” (re the result = folded/doubled infour layers) et “tetraplon” (re the process = folded/doubled four times = 16 layers)..","date":"2015-12-07","mins":"6:29 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215843","author":"max_patrick_hamon","post":"BTW Charles, can you account for the use of the Geek words tetradiplon (“folded in four layers”), rakkos (a rag most likely soiled and with holes), himation (implying a piece of cloth about 4.20 x 1.20 m to drape and adult man) to describe the Edessa cloth bearing Yeshu’a’s earthly likeness if the latter was a “small face cloth”? Show me what is your historical common sense really consist in, please. If the Edessa cloth is the Turin Shroud, all the above descriptions do make sense, if ever the phrase “to make sense” has a real meaning in British English!.","date":"2015-12-07","mins":"6:47 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215844","author":"max_patrick_hamon","post":"Sorry for all the typos..","date":"2015-12-07","mins":"6:51 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215910","author":"max_patrick_hamon","post":"To Charles: You wrote: “Wilson’s images show it doubled three times into eight so he is clearly out of the running on this one.” Thank you, I was the first, in this very blog, to draw your attention on this very contradiction re Wilson’s alleged ‘reconstruction’ of the TS folding in Constantinople! The Image of Edessa could have been stored with and without the touched up transparent burial face cloth (today most likely known as the Veil of Mannopello and most unfortunately reduced in size). Reminder: most curiously and strikingly, the Edessa cloth image iconography does show us Yeshu’a’s face BOTH with AND without a neck alike the Turin Shroud face image (apparently recorded with a ‘neck’ and looking like a bearded adult) and the Manoppello Veil face (without a neck an looking like a slightly bearded young man). Most likely, “doubled onto itself in four layers” (see Greek tetradiplon, in reference to the result of the folding process), the Edessa cloth aka Turin Shroud was used as an altar cloth on Easter. Indeed, the TS four sets of symmetrical burn holes do document this specific folding mode. Besides the same Greek word tetradiplon could have also referred not so much to the result of the folding process as to the process per se and meant “doubled onto itself four times” so as to get 4 X2 layers and have Yeshu’a’s face at the center of the folded large linen cloth kept in a ‘monstrance’ (reliquary with an agatha pearl rimmed vast central oculus for the face only to be seen in conjunction or not with the touched up transparent byssus cloth face placed over the Sindon face). Most likely this latter folding mode was used both in the periods between its exposures to the public and during solemn processions. Can you PLEASE account for the Edessa cloth being described as a himation (i.e. About a 4x1m sindon used to drape the body of a man)? Can you tell us how come the Turin Sindon set of four geometrical burn holes do refer to the same specific folding for a Byzantine altar cloth “folded onto itself in four layers” = tetradiplon? How come the Turin Shroud bearing the image of crucifixion victim’s face, alike the Edessa cloth bearing the face of Yeshu’a, can be seen as a dirty “old rag” (rakkos)? You STILL haven’t replied to my questions!.","date":"2015-12-08","mins":"1:02 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215846","author":"max_patrick_hamon","post":"The practice of covering the face of the dead (the Shroud face as face of a crucifixion victim can be regarded as equivalent to a “death mask”) is referenced in the Talmud (Moed Katan 27a). This could account for the placing of a transparent touched up small burial face cloth over the Shroud face (Yeshu’a’?) for display..","date":"2015-12-07","mins":"7:22 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215914","author":"max_patrick_hamon","post":"Correction: How come the Turin Shroud bearing the image of crucifixion victim’s face can be describes as a dirty “old rag” (rakkos) alike the Edessa cloth bearing the face of Yeshu’a?.","date":"2015-12-08","mins":"1:35 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215911","author":"max_patrick_hamon","post":"Still can you tell me the difference between “tetraplon” and “tetradiplon”, or can’t you?.","date":"2015-12-08","mins":"1:25 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215919","author":"max_patrick_hamon","post":"Hi Hugh, for the Greek word rak(k)os (=, “torn, pierced old “rag” or “rag moisted with secretion”) in conjunction with the word tetradiplon to describe the Edessa cloth see the three texts derived from “The Teaching/Acts of Addai/Thaddai” and Dobbschutz, p.48** bis PG 121,345 C..","date":"2015-12-08","mins":"2:59 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215934","author":"max_patrick_hamon","post":"Typo: The Edessa cloth bearing Yeshu’a’s face is described of old BOTH as a dirty kerchief and a sindon about four meters long and one meter wide that was moisted with human body fluids and doubled in four layers..","date":"2015-12-08","mins":"5:01 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215931","author":"max_patrick_hamon","post":"Charles, You wrote: “There is nothing to link the Shroud of Turin with the Image of Edessa”. Oh really? You mentioned Greek “words beginning with tetra” …but have “no idea” of what is the difference in meaning between tetraplon and tetradiplon and fail to see how relevant or irrelevant it is to the TS Edessa cloth connection issue, which speaks volumes on how reliable your understanding of the word tetradiplon is! At some point in time, the TS was doubled in four layers and so used as a “tetradiplon” altar cloth. Ring some sindonological bell? The Edessa cloth is described (see three ms derived from The Teaching/Acts of Addai/Thaddai” and Dobbschütz, p.48** bis PG 121,345 C) as tetradiplon in conjunction with the Greek word rak(k)os meaning “torn, pierced rag” “dirty kerchief/rag moisted with secretion” (= human body fluids). Ring some sindonological bell? You have “no idea” either why the Edessa cloth is described as a sindon and a himation too, which speaks volumes how thoroughly you studied “the relevance” of Edessa Image to the Turin Sindon! Answer: it was described as a himation because its was a sindon about four meters long and one meter wide i.e. The very length and width to drape a man’s body! Ring some sindonological bell? The Edessa cloth bearing Yeshu’a’s is described BOTH as a dirty kerchief and a sindon about four meters long and one meter wide that was doubled in four layers and his moisted with human body fluids. Ring some sindonological bell? Etc. Methinks the real pity is in your non applying some more common sense and professionalism to the TS Edessa cloth connection issue..","date":"2015-12-08","mins":"4:52 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215936","author":"max_patrick_hamon","post":"Addendum: dirty kerchief/towel/rag.","date":"2015-12-08","mins":"5:16 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215941","author":"max_patrick_hamon","post":"Hugh, you wrote: “Max’s idea that rakkos/rhakos means “torn, pierced rag” or, even more extremely, “dirty kerchief/rag moisted with secretion” is wildly over interpretative.” In Mat 9:16 and Mk 2:21, rhakos/rakkos means “torn/ragged piece of cloth”. The etymology of te English word rag is definitely the Greek word rhakos/rakkos! Besides in the Lexicon of Patristic Greekby Lampe, rhakos/rakkos refers to a large kerchief to wipe out a monk’s tears of compunctio! Methinks Hugh’s idea that is has nothing to do with human body fluids and a dirty old rag/lage kerchief/towel is wildly sub interpretative..","date":"2015-12-08","mins":"5:38 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215942","author":"max_patrick_hamon","post":"Hugh, It is not because you cannot find the three references as variants from the Acts of Thaddeus that the word rakkos is not used in conjunction with tetradiplon to describe the Edessa cloth! Are you kidding? See the Vienna ms (hist. Gr. 45) + liturgical intructions (August 16th, Holy Mandylion day) + Georges Kedrenos’ relation in his Synopse des Histoires..","date":"2015-12-08","mins":"5:50 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215943","author":"max_patrick_hamon","post":"Addendum: the Lexicon of Patristic Greekby Lampe, rhakos/rakkos refers to a large kerchief to wipe out a monk’s tears of compunctio (PG 65, 105 C)..","date":"2015-12-08","mins":"5:52 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215945","author":"max_patrick_hamon","post":"Hugh, could you tell why is the Edessa cloth is described IN TURNS as a sindon, a himation (i.e. A piece of cloth about 4x1m) and a rakkos (a ragged cloth used as a large kerchief, towel or bandage)?.","date":"2015-12-08","mins":"6:02 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215946","author":"max_patrick_hamon","post":"Typo: a large kerchief, towel or bandage to receive or wwipe out human body fluids?.","date":"2015-12-08","mins":"6:03 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215976","author":"max_patrick_hamon","post":"Hugh, you wrote: “No, Max, you’re wriggling. There is no way that Mark and Matthew use the word ‘rakkos’ to mean tatty, dirty, pierced, ‘moisted’ or unclean.” No, I am not wriggling at all. Once more you’re attempting to put words in my mouth. Rakkos/rhakos per se DOES refer to a torn piece of cloth or rag. That’s a fact. In a historical text (see e.g. Ian Wilson’s video “The Case for the Turin Shroud” at 22:20 and 22:35), the Edessa cloth face image of Yeshu’a is described as an “imprinted/impressed” and “moist secretion”. That’s another fact. If the word rakkos/rahkos can refer to a clean new piece of cloth just cut off from a larger cloth, it can refer to a dirty torn (cut and resewn on the main body of cloth?) old piece of cloth or rag TOO. The word can be used BOTH pejoratively AND deprecatorily. That’s another philological fact you most curiously dismissed. Besides, out of intellectual laziness, you misleadingly wrote: “This kind of stuff: “See the Vienna ms (hist. Gr. 45) + liturgical instructions (August 16th, Holy Mandylion day) + Georges Kedrenos’ relation in his Synopse des Histoires,” is unhelpful. Can I ask, again, who, if anybody, referred to the image of Edessa or the cloth of Addai as a ‘rakkos tetradiplon’? Methinks you NEVER heard before or read the three texts I mentioned referring to the Edessa cloth not only as tetradiplon bur as rakkos too. That’s a real shame for an alleged “Shroud scholar”/shroudie. Had you, e.g. Read Dubarle’s Histoire Anciene du Linceulde Turin jusqu’au XIIIème, pp. 105 106, you would have known the Edessa cloth is referred both as tetradiplon and rakkos in the Vienna ms (hist. Gr. 45), in the Menaia i.e. The liturgical texts for celebrations (in reference to the annual fixed cycle of services in the Eastern Church) and in Patristic chronicles (see George Kedrenos’s chronicle, PG 121,345 C! All the three texts are derived from the Acts of Thaddeus. That’s another fact yu want to dismiss.Yes, shame on you! After dismissing all the above It ca facts, you wrote: “I do not think a rakkos could possibly define a cloth as large as the Shroud, and its use to describe the image of Edessa or the cloth of Addai, if it was ever used, means that these artefacts could not be the Shroud.” Wrong! It can. Just take the TS, doubled it onto itself in four layers (tetradiplon) and you’ll get a long towel or rag (about 110x55cm) with scars of time such as a set of L or slanted P shaped like hole burns (see Ian Wilson’s same video at 03:37 till 03:52) and an apparently “cut and resewn” lateral band. Hugh, you can be wrong in your opinion NOT in your facts!.","date":"2015-12-09","mins":"6:58 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215940","author":"max_patrick_hamon","post":"Stephen Jones wrote: “A commenter on Dan Porter’s Shroud of Turin blog pointed out what I had previously realised, but had forgotten, that Dan’s “Tetradiplon” graphic illustrating how the Shroud of Turin, when “four doubled” (Greek tetradiplon), with Jesus’ face uppermost, results in Jesus’ face only within a rectangle, in landscape aspect (exactly as in the oldest copies of the Image of Edessa), has a flaw in that it only shows three doublings of the Shroud (see above).” Charles, just guess who it was? Methibks alike Stephen Jones you “had previously realised, but had forgotten” till I pointed it out in words for you!.","date":"2015-12-08","mins":"5:29 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215977","author":"max_patrick_hamon","post":"Typo: The word (rakkos) can be used BOTH pejoratively AND negatively. That’s another philological fact you most curiously dismissed..","date":"2015-12-09","mins":"7:00 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215978","author":"max_patrick_hamon","post":"Sorry, typing in haste: The word (rakkos) can be used BOTH positively AND pejoratively. That’s another philological fact you most curiously dismissed..","date":"2015-12-09","mins":"7:01 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215980","author":"max_patrick_hamon","post":"Hugh, BTW, on December 8, 2015 at 6:02 pm I asked you: Could you tell me/us why is the Edessa cloth is described IN TURNS as a sindon, a himation (i.e. A piece of cloth or sindon about 4x1m) and a rakkos (a torn piece of cloth used as a large kerchief, long towel or bandage when doubled in four layers (tetradiplon)? STILL waiting for you reply!.","date":"2015-12-09","mins":"7:13 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215983","author":"max_patrick_hamon","post":"I wrote: Just take the TS, doubled it onto itself in four layers (tetradiplon) and you’ll get a long towel or rag (about 110x55cm) with scars of time such as a set of L or slanted P shaped like hole burns (see Ian Wilson’s same video at 03:37 till 03:52) and an apparently “cut and resewn” lateral band + stains of ‘moist secretions”/human body fluids (degraded blood and sweat). In the Hungarian Pray codex, the TS doubled in four layers i.e. Tetradiplon (as an altar cloth) is steganocally/cryptically depicted as a sarcophagus box oddly topped with a tilted slab..","date":"2015-12-09","mins":"7:34 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-216028","author":"max_patrick_hamon","post":"Charles, do you infer the HP ms is not a Benedictine production? Are you just kidding or just ignorant of the fact? Do your historian homework unless you are just having me on, so funny!.","date":"2015-12-09","mins":"12:42 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-216044","author":"max_patrick_hamon","post":"Charles, Question for question, first how can you tell it is NOT a Benedictine production when you are totally ignorant of Benedictine monks’s medieval cryptography, steganography and iconography? What are your sources/criteria? On which ground can you assert the HP ms is not a Benedictine production, I very much like to know! What do you mean exactly by your most cryptic “NO DESCRIPTIONS (upper cases mine again) of it (= the HMP ms illustrations) SUGGEST (upper cases mine) it is a Benedictine production). Can you substantiate your assertion or are your words just words of contradiction? Substance, please!.","date":"2015-12-09","mins":"3:57 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-216009","author":"max_patrick_hamon","post":"Charles, what exactly do you know about Benedictine monk use of steganography and cryptography applied to medieval images an illustrations? NOTHING!.","date":"2015-12-09","mins":"10:54 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-216008","author":"max_patrick_hamon","post":"NO Hugh, bad try in light of the historical text that describes the Edessa cloth face image per se as “impressed/imprinted and a “moist secretion” in conjunction with the Greek words rakkos, tetradiplon, sindon and himation (an about 4x1m sindon used to drape a human body) used to describe the cloth per se, a sceptic observer can see the latter as a dirty towel or rag 110x55cm or a precious relic of Yeshu’a’s blood and body. You wrote; “And I disagree with your opinion about a ‘rakkos’ being as large as the Shroud. You don’t make a small cloth by folding up a large one.” Don’t you put words in my mouth and distort my opinion when actually I do mean an himation i.e. A sindon about 4x1m that makes a small cloth showing a set of burn hole in conjunction with a round stain and body secretion (degraded blood and sweat) by folding the roughly 4m long and 1m wide sindon. Whether the observer is an anti authenticist or an authenticist he will tend to see the cloth folded onto itself in four layers as a dirty rag or a clean towel. Both readings are possible AND can be subjectively justified. See e.g. The following site http://www.rotten.com/library/religion/relics/shroud of turin/ Its first sentence reads: “The Shroud of Turin: a dirty cloth, a work of art or a miraculous relic?” Still putting words in my mouth and distorting my opinion, you misleaddingly wrote: “The WORD (upper cases mine) as used by the other sources you mention is not derived from the Acts of Thaddeus.” I NEVER say the word (rakkos) was derived from the Act of Thaddeus BUT that it was found in three texts derived from the Acts of Thaddeus. Can you get it right or can’t you to clutch at less than straws? The TS whether doubled in four layers or folded onto itself four times to get 4×2 layers can look like a towel (roughly 110 long and 55cm wide) with a set of hole burn hole back and front + an apprently ‘cut and resewn’ lateral band + “moist secretion(s)” (degraded blood and sweat) + a round stain back and front or a large kerchief (55 high and 110 wide) bearing “the moist secretion” of Yeshu’a’s “imprinted” face. Can you account for the Edessa cloth being called a himation and sindon since a himation is a roughly 4x1m sindon? YOU JUST CAN’T unless you admit it can refer to the TS in light of additional pieces of textual and archaeological evidence (reconstruction of the specific folding)! In conclusion, you wrote: “And the Pray Codex, of course, shows no such thing, cryptosteganographically or otherwise.” Actually it does to the eye and brain of somebody familiar with Benedictine steganoraphy and cryptography, medieval images and has a very good descriptive knowledge of the TS in light of the HP ms illustrations. You may excel as a Teacher of the Science of the Earth, indeed you’re a very poor medieval Benedictine monk image crypanalyst or steganalyst. You have NO EYES for steganographic forms no question..","date":"2015-12-09","mins":"10:48 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"}]
