[{"id":"comment-40630","author":"max_patrick_hamon","post":"Dan, late in June I had decided to cease my comments on this blog just because of the most unfair and most discriminating way you treated me and systmatically censored my replies. In the ‘mean’ time you begged for CB’s friendship and comments while you completely blocked me from posting comments for one month (till this posting of yours). In the latter, and much to my utter surprise, you were asking me for more information about the thread count for the Shroud of Turin! Since I have arboured no ill rancor in spite of your most unfair and discriminating treatment, I willingly answer your request (and take up my comments too MUCH because of Louis’ kind words). I myself used Rae’s, Vial’s and Vercelli’s data to reach an average thread count. The latter is confirmed by Yves Saillard who also based his thread count on the same three authors. See: – G. Vial Etude technique, Actes du Symposium Scientifique International, Paris 7 8 Septembre 1989, O.E.I.L., Paris (1990). – P. Vercelli, The cloth of the Holy Shroud, in the Turin Shroud, past, present and future, International Scientific Symposium, Torino 2 5 March 2000. Effata Editrice, Torino (2000). Y. Saillard, L’inexplicable image, Etude critique d’un véritable défi scientifique, R.I.L.T., n°33/34, Avril 2010. Hope it can help..","date":"2013-08-07","mins":"6:11 am","url":"https://shroudstory.com/2013/07/23/max-anyone-thread-count-for-the-shroud-of-turin/","cat":"science","title":"Max? Anyone? Thread count for the Shroud of Turin"},{"id":"comment-40632","author":"max_patrick_hamon","post":"This is a come lately post. It was actually written on August 3, 2013. Sorry..","date":"2013-08-07","mins":"6:49 am","url":"https://shroudstory.com/2013/07/23/max-anyone-thread-count-for-the-shroud-of-turin/","cat":"science","title":"Max? Anyone? Thread count for the Shroud of Turin"},{"id":"comment-32214","author":"max_patrick_hamon","post":"The true fact is the disciple whom Yeshua loved hesitated as he was a priest and could not run the risk of being defiled in the presence of a corpse..","date":"2013-04-29","mins":"8:50 am","url":"https://shroudstory.com/2013/04/29/paper-chase-the-seam-and-missing-corners-of-the-turin-shroud/","cat":"news_&_views","title":"Paper Chase: The seam and missing corners of the Turin Shroud"},{"id":"comment-41266","author":"max_patrick_hamon","post":"THUMB DOWN! O’Floinn keeps rehashing received ideas: “RECALL too that in the gospel accounts, the body of Jesus was put away in great haste because it was a Great Sabbath (a Sabbath that fell on Passover) and the body was not washed or otherwise prepared.” The true fact is Yeshua’s burial was NOT dispatched (in about half an hour). It DID last at least 2h30 once they had reached the tomb (most likely time frame). In the koine Greek Gospels it is clearly said the buriers wounded/encircled, compressed/tightly wrapped up, bound/fastened his body in linen clothes with spices, as the manner of the Judeans is to bury. WHERE is it written his body was just draped over? NOWHERE! He also wrote: “The women would need to get at the body to wash and anoint it come Sunday morning. Also in most burials, the deceased generally did not get up afterward and leave the shroud behind neatly folded up. ” In the Gospels NOWHERE it is written either the women were to wash Yeshua(’s wrapped up) body. It is just written they were to anoint it (most likely with oily spicy perfumes). NOWHERE it is written either “the shroud was left behind neatly folded up”! It’s patently false! Besides, he most misleadingly also wrote: “some of the lettering on the coins, when examined, falls in the spaces between threads, so they’re clearly spurious.” When the suspected right and left eye areas are CORRECTLY examined from 3 D, digital squeeze and red paint brush images, this is not what one can observe at all as three printed letters are complete/not fragmented and five are pieces of letters..","date":"2013-08-14","mins":"12:56 pm","url":"https://shroudstory.com/2013/08/14/or-it-is-the-first-century-burial-cloth-of-yussuf-schmoe/","cat":"other_blogs","title":"Or it is the first century burial cloth of Yussuf Schmoe?"},{"id":"comment-32216","author":"max_patrick_hamon","post":"Most likely, Yo Hanan Maqqaba (“John Mark”) was a priest and assistant secretary/scribe to the High Priest. Most likely, the man who wrote the 4th Gospel was not a Galilean fisherman but a priest and scribe..","date":"2013-04-29","mins":"8:58 am","url":"https://shroudstory.com/2013/04/29/paper-chase-the-seam-and-missing-corners-of-the-turin-shroud/","cat":"news_&_views","title":"Paper Chase: The seam and missing corners of the Turin Shroud"},{"id":"comment-32217","author":"max_patrick_hamon","post":"The author of the fourth gospel, generally identified as the disciple who Yeshua loved, lay on his breast at the Last Supper as he was the one to receive Yeshua (and his disciples) in his house in Jerusalem. He is the one who took Mary (Yeshua’s mother) with him and became his son and was afterwards to be identified as John Mark the son of Mary (Acts 12:12)..","date":"2013-04-29","mins":"9:12 am","url":"https://shroudstory.com/2013/04/29/paper-chase-the-seam-and-missing-corners-of-the-turin-shroud/","cat":"news_&_views","title":"Paper Chase: The seam and missing corners of the Turin Shroud"},{"id":"comment-32322","author":"max_patrick_hamon","post":"Reminder for Dave: the 2nd Gospel is Peter’s memo in koine/translation Greek NOT John Mark’s stricto sensus.Actually it is a literal translation of Peter’s oral Galilean Hebrew by both Peter himself and John Mark acting as an assistant translator and secretary). Methinks you shall discriminate between the true author (Peter) and his assistant translator scribe (John Mark)..","date":"2013-04-30","mins":"6:15 am","url":"https://shroudstory.com/2013/04/29/paper-chase-the-seam-and-missing-corners-of-the-turin-shroud/","cat":"news_&_views","title":"Paper Chase: The seam and missing corners of the Turin Shroud"}]
