[{"title":"An Email from David Rolfe to the Shroud Science Group","post":"What does this sentence mean? “The challenge is already accepted and made possible is scientific terms by Prof. Giulio Fanti, of Padua University.”\nThat is an actual sentence from David Rolfe’s challenge page. Has Dawkins accepted? I would think this would be big news. I suspect it is a typo. \nThe letter to Dawkins still reads, “In your Shroud blog …” But Dawkins doesn’t have a Shroud blog. He has a Richard Dawkins Foundation blog. Within that blog he has a single posting about the Shroud. How is this challenge to be taken seriously with such errors?\nI will say it again. It is regrettable that Rolfe used Fanti’s paper for image criteria. The paper might be useful were it not for a sophomorically subjective, arbitrary and obviously biased scoring method put forth as an attempt to convince everyone that the image was formed by corona discharge. It was a serious mistake to make this very unscientific paper so readily available on Rolfe’s website. Will anyone take this challenge seriously?\nI agree with simplifying the image criteria statements to remove any assumptions about the image being formed by a real body. You cannot ask Richard Dawkins or anyone to solve the mystery of the image with such a blatant imposition of religious belief into what should be simply scientific facts.   \nThis challenge, if poorly implemented, will reflect poorly on Shroud science.\n\n","date":"April 18, 2012 at 3:28 pm","url":"https://shroudstory.com/2012/04/18/an-email-from-david-rolfe-to-the-shroud-science-group/","cat":"news_&_views","id":"comment-10547","author":"Paulette","site":"shroudstory"},{"title":"An Email from David Rolfe to the Shroud Science Group","post":"Paulette, I am 1000% with you.\n\n","date":"April 18, 2012 at 5:31 pm","url":"https://shroudstory.com/2012/04/18/an-email-from-david-rolfe-to-the-shroud-science-group/","cat":"news_&_views","id":"comment-10560","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Email from David Rolfe to the Shroud Science Group","post":"Paulette, thanks for this observation.  My language is somewhat clumsy.  It was a positing about the Shroud on Dawkins blog that I was referring to my “your Shroud blog” might be a little too pithy.  Sorry for the confusion but hope that would not diminish the challenge itself. Prof Giulio Fanti had already “stepped up to the plate” with his publication and readily accepted the challenge when I put it to him.   So far, Dawkins has not.  If you go to the page now you will see that the Challenge is on hold pending the outcome of these open discussions from as many qualified interested parties as possible.  Professor Fanti has kindly accepted this process and the forthcoming Valencia conference has agreed to provide a forum for the conclusion of the criteria consolidation process.    Once this has happened I hope you and as many other visitors to this blog will apply whatever pressure they can on the Dawkins and his foundation to accept.  Ron’s K.I.S.S. approach could well makes a lot of sense.\n\n","date":"April 19, 2012 at 5:43 am","url":"https://shroudstory.com/2012/04/18/an-email-from-david-rolfe-to-the-shroud-science-group/","cat":"news_&_views","id":"comment-10580","author":"shroudenigma","site":"shroudstory"},{"title":"An Email from David Rolfe to the Shroud Science Group","post":"I think this is where KISS (Keep it simple stupid) comes in. Just ask that an image be created on linen that corresponds to the scientifically “known” attributes of the Shroud. I think STURP listed these as “A” rated findings. Of course any materials or methods used must conform to what we know was available in the12th,13th or earlier centuries.\nR\n\n","date":"April 18, 2012 at 3:55 pm","url":"https://shroudstory.com/2012/04/18/an-email-from-david-rolfe-to-the-shroud-science-group/","cat":"news_&_views","id":"comment-10552","author":"Ron","site":"shroudstory"},{"title":"An Email from David Rolfe to the Shroud Science Group","post":"Sorry should read as 13th, 14th or earlier centuries.\nR\n\n","date":"April 18, 2012 at 3:57 pm","url":"https://shroudstory.com/2012/04/18/an-email-from-david-rolfe-to-the-shroud-science-group/","cat":"news_&_views","id":"comment-10553","author":"Ron","site":"shroudstory"},{"title":"An Email from David Rolfe to the Shroud Science Group","post":"just replcate the image period use all the modern tools available. A body needs not be involved as long as the final product replicates the shroud and all it’s attributes. a negative etc. etc. can not be done\n\n","date":"April 18, 2012 at 8:36 pm","url":"https://shroudstory.com/2012/04/18/an-email-from-david-rolfe-to-the-shroud-science-group/","cat":"news_&_views","id":"comment-10571","author":"paul","site":"shroudstory"},{"title":"An Email from David Rolfe to the Shroud Science Group","post":"“Just replicate the image period use all the modern tools available” Guess that would work too. Simplifies it even more….and would take away any ideas that may arise, such as the cloth may have been produced more recently.\nR\n\n","date":"April 19, 2012 at 4:10 pm","url":"https://shroudstory.com/2012/04/18/an-email-from-david-rolfe-to-the-shroud-science-group/","cat":"news_&_views","id":"comment-10612","author":"Ron","site":"shroudstory"},{"title":"An Email from David Rolfe to the Shroud Science Group","post":"Quote from the message : “Bloodstains appear on and outside the body image, indicating that some blood drained from the corpse to the fabric.”\nThat’s not proven at all !!!  In fact, that statement is most probably in contradiction with the way Barbet and Adler estimates most of the blood transfers on the Shroud !  \nHere’s just another way to see the blood stains outside the body image on the Shroud : If we take the blood outside the right elbow (letf elbow on the positive photo) on the Shroud, that stain could have been done while the persons involved in the burial were moving the corpse from the preparation table in the tomb (called “Onction stone” in the Holy Sepulchre) to his final resting place in another place in the tomb (probably a vaulted arch like you can see in the 3rd photo of this page : http://www.interbible.org/interBible/decouverte/archeologie/1999/arc_990305.htm).\nImagine this scenario :  Jesus died and wasn’t transferred to the tomb right away.  At the time his body reached the tomb, almost all of the blood stains on the body had enough time to clot and were completely dried.  Then, inside the tomb, the persons involved in the burial put the body inside the Shroud and draped the Shroud losely over the body without any linen strips to tied the body.  They would have done this operation in a central room inside the tomb dedicated for that kind of job.  Then, for an unknown reason, imagine the body resting there for 30 minutes, one hour, or more.  That time off could have been enough for many clotted blood stains to get humid at their surface (because of what Pierre Barbet called “an aqueous environment” in which the body inside the Shroud was submit (remember that a dead body can still emit water vapor from every pore of the skin).  Then, after that delay that cause an humidification of many blood clots at their surface, the persons involved in the burial took the body (still draped inside the Shroud) and move him with great care to his final resting place, on a stone tablet (probably inside a vaulted arch).  This movement of the body could well have cause the Shroud to touch for a short time the back of the right elbow and cause the blood stain we see outside the body image, simply because a re-arangement of the draping of the Shroud could have been done after the displacement of the body to his final place in the tomb.  At that point, the Shroud could have been draped again nicely over the body (still losely draped without the use of any linen strips) with the result of moving this fresh blood stain on the cloth far enough from the right elbow that, when the body image formation occured (later), this blood stain wasn’t affected at all by it and the body image of the right elbow was formed away from the stain, giving the impression that the blood stain outside this elbow was the result of “some blood drained from the corpse to the fabric”.  \nIn fact, if my scenario is correct, the statement above is incorrect.  One thing’s for sure :  this statement is far from being proven !\n\n","date":"April 18, 2012 at 5:07 pm","url":"https://shroudstory.com/2012/04/18/an-email-from-david-rolfe-to-the-shroud-science-group/","cat":"news_&_views","id":"comment-10556","author":"Yannick Clément","site":"shroudstory"},{"title":"An Email from David Rolfe to the Shroud Science Group","post":"Yannick I think you missed the point. Which is that by one assuming the bloodstains ran from a body, that a body was present. One cannot start from that position in explaining the Shroud image. One must start, if one is to replicate it by using methods in which it can be reproduced, as a work of art in whatever manner possible, be it, paint, scorch, bas-relief, whatever. But not to assume a body was involved. But then that has been claimed also; that a human cadaver may have been used.\nNow getting to the thought of the blood running from the body, ASSUMING there was a body actually enfolded in the Shroud, it makes perfect sense the blood articles outside and underneath the body could have come from post mortem blood. ( I don’t think the blood outside the elbow did mind you), but others may have; the flow outside the heel of one foot or even the trail of blood on the lower back!….Blood can flow from a corpse, especially from gaping wounds, this is not rocket science. \nR\n\n","date":"April 18, 2012 at 5:26 pm","url":"https://shroudstory.com/2012/04/18/an-email-from-david-rolfe-to-the-shroud-science-group/","cat":"news_&_views","id":"comment-10558","author":"Ron","site":"shroudstory"},{"title":"An Email from David Rolfe to the Shroud Science Group","post":"Yes, the post-mortem bleeding have flowed in the shroud.  I think this is perfectly logic and Barbet talk about that.  But for the blood outside the right elbow or some scouge marks outside the back of the legs, that’s a totally different story because those came from decal of clotted blood that was humid at their surface.  We have to find a scenario for those blood stains that don’t involved any blood in liquid form.  That’s what I tried to say.  Thanks for your comment !\n\n","date":"April 19, 2012 at 8:31 am","url":"https://shroudstory.com/2012/04/18/an-email-from-david-rolfe-to-the-shroud-science-group/","cat":"news_&_views","id":"comment-10595","author":"Yannick Clément","site":"shroudstory"}]
