[{"title":"David Rolfe challenge to Richard Dawkins embedded in PJ Media article","post":"I could agree that there ought to be scope for both Christians and Jews to come to a type of common understanding about Jesus, but there would always be areas of disagreement.  I believe there would be very little evidence for Jesus seeking to remove the yoke of the Romans from the Jewish people. \nThere was a yoke, but I believe he saw it being imposed more by the Jewish authorities, Pharisaic Laws and the Saducees, rather than the Romans.  An objective view of history might come to the conclusion that the Jewish people never had it so good under the peace inaugurated by Octavian Augustus, and even the Idumean Herods were great benefactors, and relatively benign, despite the gospel accounts and the aversion of the Jews to their Edomite governance.  \nThe gospels seem to reflect an expectation that the Messiah would be some kind of political liberator, but nowhere is that apparent in Jesus’ life-mission.  The political reality of the Jews, sandwiched between the Romans and the Persians or Parthians, would make any prospect of their being any kind of a buffer state unrealistic, and the Romans were by far the best choice of any options they had.  The rebellions commencing about 66AD, eventually proved disastrous. \nIf there is to be any kind of acceptance of Jesus within the Jewish tradition, it must I think be seen in his prophetic role within the tradition of the later prophets, in proclaiming an option for the poor, the underprivileged in his demands for justice, and his condemnation of immorality. It is consistent with and echoes such calls as those of Amos, Micah and Malachi. Jesus’ condemnation of the Pharisees and Saducees, as a “brood of vipers” and “hypocrites” is foreshadowed by their somewhat similar condemnations. \nJohn Dominic Crossan’s “Power of Parable” provides some fascinating insights into what appears to be a double-edged sword of Jesus’ message, a theme in Rabbi Boteach’s work. Thus early in Matthew’s gospel he condemns slandering and abuse of others, yet later he fulminates against the authorities with his “hypocrites” and “brood of vipers”.  A further aspect mentioned by Crossan is that the Synoptics, particularly Gentile Luke, paint Jesus as the victim of the Jews, with their saying “His blood be on us and upon our children”, which has provided unjust rationalisation of historical anti-semitism.  However in John’s gospel, Jesus is not the victim, but is the one in control of his situation. The decisions are his, even the choice of his moment of death. \nHis answer to the question of the temple tribute to “Render unto Caesar” doen not betoken a political liberator. But he clearly intended to be the liberator of those who were in fact heavily burdened, and had little interest in the misplaced Jewish nationalism of that time!\n\n","date":"September 10, 2013 at 7:39 am","url":"https://shroudstory.com/2013/09/10/david-rolfe-challenge-to-richard-dawkins-embedded-in-pj-media-article/","cat":"press_coverage","id":"comment-43599","author":"daveb of wellington nz","site":"shroudstory"},{"title":"David Rolfe challenge to Richard Dawkins embedded in PJ Media article","post":"One wonders if it is worthwhile quoting J.D,Crossan, who believes that Jesus’ dead body was eaten by wild dogs and encouraged — you said it! — Jacobovici. Then he wants to know what kind of manifestation of God Jesus could be.There are more serious and respected scholars: Father Joseph A. Fitzmyer, Professor Luke Timothy Johnson, Monsignor John P. Meier, Professor Larry Hurtado, to name just a few.  \nAs for the Jewish hero and risen Lord, we have the excellent study “The One Who Is To Come”, by Father Fitzmyer, not written from the point of view of faith. Yet, it is only part of the story, which goes to show that there is a lot more in the box, a part of the mysterium Christi.\n\n","date":"September 10, 2013 at 9:28 am","url":"https://shroudstory.com/2013/09/10/david-rolfe-challenge-to-richard-dawkins-embedded-in-pj-media-article/","cat":"press_coverage","id":"comment-43607","author":"Louis","site":"shroudstory"},{"title":"David Rolfe challenge to Richard Dawkins embedded in PJ Media article","post":"Louis, I am adequately aware of Crossan’s doctrinal short-comings. It has been a persistent error of history that MEN were condemned, whereas it would have been more enlightening if it had only focused on the ERRORS they taught.  “Hold on to that which is good!” (I Thess. 5:21). I found much that is good in Crossan’s “Power of Parable”.  To attack everything that a person teaches, because of other errors, is I consider a form of “Ad hominem” argument and a “Non sequitur”.  Concerning my principal argument that Jesus sought to be a liberator of those who were genuinely suppressed, I find it interesting that Pope Francis is apparently seeking to revive an acceptable form of Liberation theology.  I am an advocate of John P Meier’s historical approach.  I do not see anything in the gospels or in Paul, supporting the idea that sees Jesus as any kind of a political liberator from Roman imperialism, as apparently argued by Rabbi Boteach. The Book of Revelations written in the shadow of persecution, might see it differently.\n\n","date":"September 10, 2013 at 4:10 pm","url":"https://shroudstory.com/2013/09/10/david-rolfe-challenge-to-richard-dawkins-embedded-in-pj-media-article/","cat":"press_coverage","id":"comment-43641","author":"daveb of wellington nz","site":"shroudstory"},{"title":"David Rolfe challenge to Richard Dawkins embedded in PJ Media article","post":"David, the trouble with Pope Francis is that he is concentrating most of his attention on the problem of hunger, homelessness and so on as though the Church is a Buenos Aires slum. Not that he is not right in calling the attention of the faithful to these problems, it is the concentration on this alone that is the problem and there are other serious topics to be addressed. It is because of reasons like these that the South American (Catholic) clergy is now facing the problem of thousands leaving the fold, many of these founding their own “churches”, one in every corner, with “pastors” who have not gone beyond high school, learning the Bible in six months, stressing “theology of prosperity”, tithes, buying imported cars, living in mansions and what not. This was even noticed by Robert Runcie, the head of the Anglican Church, who spoke his mind when he visited the region years ago. The sense of community should have been stronger, replacing the social club mentality prevalent in the parishes.   .   \nThere are indeed weak points in John P. Meier’s approach, as Luke Timothy Johnson pointed out. He received two gold medals for excellence in biblical studies while studying in Rome and is admired and quoted by Benedict XVI. Father Fitzmyer is a better scholar in some ways,but Ratzinger never seemed to like the historical-critical method adoped by him, Fathers Raymond E. Brown and Roland E. Murphy. Their “Jerome Biblical Commentary” is an excellent source for any one who wishes to go deeper into biblical studies.\nAs for Rabbi Boteach, he does have some good things to say, and is trying to make Jesus more relevant to Jews, but it does lead to distortions. That was also the case with Geza Vermes. After all the books he published Vermes never went to the synagogue (London’s Liberal Synagogue) and preferred to listen to “that little voice” while walking in the garden of his Oxford home.\n\n","date":"September 10, 2013 at 10:26 pm","url":"https://shroudstory.com/2013/09/10/david-rolfe-challenge-to-richard-dawkins-embedded-in-pj-media-article/","cat":"press_coverage","id":"comment-43681","author":"Louis","site":"shroudstory"},{"title":"David Rolfe challenge to Richard Dawkins embedded in PJ Media article","post":"On the Dawkins challenge, if RD and his mates in various departments in Oxford, did come up with a solution , how would ‘the people’ decide on it. Worldwide vote? Shouldn’t there be an independent committee of experts , including art historians and the relevant scientists, set up who be prepared to assess any claim by Dawkins?\nWhat if someone else, somewhere else in the world, comes up with a solution- can Dawkins appropriate it – does that count?\n\n","date":"September 11, 2013 at 3:15 am","url":"https://shroudstory.com/2013/09/10/david-rolfe-challenge-to-richard-dawkins-embedded-in-pj-media-article/","cat":"press_coverage","id":"comment-43712","author":"Charles Freeman","site":"shroudstory"},{"title":"David Rolfe challenge to Richard Dawkins embedded in PJ Media article","post":"Charles, as far as I know the Church has appointed some scientists to verify the origin of the Shroud. Right now it seems Pope Francis is busy cleaning up the house and we can hope that eventually he will have time to listen to proposals about forming an independent committee of experts to assess any claims made by RD or someone else. If RD does make some proposal with claims and these are rejected, who knows, given his bias, he may then say that it contracted a viral infection because the Church, in his view, is a virus.\n\n","date":"September 11, 2013 at 10:28 am","url":"https://shroudstory.com/2013/09/10/david-rolfe-challenge-to-richard-dawkins-embedded-in-pj-media-article/","cat":"press_coverage","id":"comment-43766","author":"Louis","site":"shroudstory"},{"title":"David Rolfe challenge to Richard Dawkins embedded in PJ Media article","post":"I am sorry Dawkins has been silent on this. If I were him, I would at least clarify the terms of the challenge and how it was to be judged and then I am sure if he circulated it on his e-mail contact list with a promise that he would pass on some of the £20,000 to anyone who came up with a solution it would be worth the chance. He has nothing to lose.  There may well be someone out there in a lab with some new imaging technique that could be adapted for the purpose.\n\n","date":"September 12, 2013 at 4:34 am","url":"https://shroudstory.com/2013/09/10/david-rolfe-challenge-to-richard-dawkins-embedded-in-pj-media-article/","cat":"press_coverage","id":"comment-43898","author":"Charles Freeman","site":"shroudstory"},{"title":"David Rolfe challenge to Richard Dawkins embedded in PJ Media article","post":"Fair enough, Charles, however RD does seem to be somewhat unwilling to reject the relic outright and that may be the reason for the hesitation.\n\n","date":"September 12, 2013 at 9:56 am","url":"https://shroudstory.com/2013/09/10/david-rolfe-challenge-to-richard-dawkins-embedded-in-pj-media-article/","cat":"press_coverage","id":"comment-43922","author":"Louis","site":"shroudstory"}]
