[{"title":"David Rolfe’s Website","post":"Enigma indeed. The three-d figure shown at the top of David Rolfe’s website could not possibly have transmitted the images as we know them.\n\n","date":"December 7, 2015 at 6:49 am","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","id":"comment-215788","author":"Charles Freeman","site":"shroudstory"},{"title":"David Rolfe’s Website","post":"I think it’s an important footnote to Silent Witness that it was a proposal by Ian Wilson to David Rolfe that was the start of the movie and the beginning of Rolfe’s interest in the the Shroud.\nThere was also interplay between Rolfe and Jackson-Jumper that fed the efforts to formalize STURP.\nI believe that the release of Silent Witness and its broadcast in Italian was the final impetus for the approval of the STURP testing of the Shroud. And hovering always in the background was the enormous energy and influence of Father Rinaldi,\nSynergy anyone? Holy Spirit anyone? Cf election of Pope Francis.\n\n","date":"December 7, 2015 at 6:55 am","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","id":"comment-215789","author":"John Klotz","site":"shroudstory"},{"title":"David Rolfe’s Website","post":"That’s a beautifully simple website.  I like it and hadn’t been there in a while like the others.\n\n","date":"December 8, 2015 at 8:35 am","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","id":"comment-215893","author":"Dcn Andy","site":"shroudstory"},{"title":"David Rolfe’s Website","post":"Hello there Dcn Andy,  the film David Rolfe made, Silent Witness was very well done.   The clips with Dr. Robert Bucklin and Dr. Max Frei alone make this worth watching.   For whatever it is worth,  and on this blog site that would not be much, but after watching the film I went to the online Gematria calculator and just typed in Silent Witness.  It equaled 1128.  Then I typed in Enigma of the Shroud it was also 1128.\nGematria  is an Assyro-Babylonian system of numerology later adopted by Jews that assigns numerical value to a word or phrase in the belief that words or phrases with identical numerical values bear some relation to each other or bear some relation to the number itself.   I made a film about it that is doing very well on youtube. \nI leave it up to the viewer to decide whether they think it is a coincidence or not.  Those are the only 2 possibilities.   It is a coincidence or it is not. \nSilent Witness=1128\nEnigma of the Shroud=1128\nShroud of Turin=1128\nJesus of Nazareth= 1128\nThe Shroud of the Lord=1128\nGenuine Ancient Relic=1128\nA Sacred Winding Sheet=1128\nShroud is Genuine=1128\nA Picture of Jesus=1128\nCloth Image of Jesus=1128\nI could add 40 more to this list,  all things relating to the Shroud of Turin.\nMost people on this blog site would say  “they are coincidental matches”  Alrighty then. \nThe odds of this happening by coincidence and incredible good luck is conservatively 1 in 900 million. \nThe only reason DNA evidence is compelling,  is because there are so many numerical match points it makes it possible to accurately quote odds of probability of chance that the match points are coincidental.  Accurate to the millionth of a percent. \nA numerical match point is a numerical match point, be that in Gematria or any other thing.\nWhen you have numerous “coincidences”  it makes it possible to calculate the odds of probability chance that the matches are coincidental. \nThis is a way to be certain of something beyond a reasonable doubt.  \nThere was a time when they were not sure if The Boston Strangler committed all of the different murders in the city that looked as though they were done by the same person. As in all of such cases, DETAILS OF THE CRIME WERE NOT RELEASED TO THE PUBLIC. When the Boston Strangler was interrogated by the FBI, He was able to give them details of the crime scene that only someone who was there could possibly know. HE KNEW DETAILS OF THE CRIME NOT RELEASED TO THE PUBLIC. Later when DNA became more sophisticated it was confirmed again that way as well.\nA line of questioning might go something like this.\nWhat color was the dress did she had on?\nWhat position was the body in?\nWhat was she holding in her hand?\nWhat color was the carpeting in the living room?\n What kind of books or magazines were on the bed?\nWhat kind of cigarettes did she smoke? \nSome of these questions are “trick questions”   As in a question such as “What was she holding in her hand?”  \nWhich assumes she was holding something when in fact she was not holding anything, if the witness can also confirm that, they know they have a credible witness.\nBoston Stranger was able to accurately answer these types of questions and knew details of the crime scene that only a person that was there could know.  In that time they did not have DNA. It is another way one can be certain of something beyond a reasonable doubt. Again, numerical match points are used.   Sometimes the Police are not convinced the person who is confessing is actually the person who committed the crime, so they will question the suspect using a number of different tactics to get to the truth. Since they claim to have done the crime they should know details of the crime scene.  \nAgain what convinces a person beyond a reasonable doubt  is the amount of numerical match points. \nOne could argue that when The Boston Strangler correctly answered questions about the details of the crime scene  he just got incredibly lucky and guessed and just happened to be right,  even though he did not commit the murder and was not at the crime scene. \nThe Shroud of Turin is a witness.   (A Silent Witness)    Knows details of a crime scene that only someone who was at a genuine crime scene could possibly know. \nFor starters, knows that a plain weave white linen was not used as would normally be used in Jewish burial. That was info not released to the public. It states only Joseph purchased fine linen, it does not say what kind of linen. Shroud tells us what kind of linen Joseph purchased, Herringbone weave.\nOnly someone who was present at the crime scene would know such a odd detail.  Odds of probability and chance heavily favor that possibility. \nIf any man set out to make a Jesus image on a burial cloth he or she would use plain weave linen unless they actually wanted their work to be rejected and not look authentic.\nAdd numerous other points to the Shroud that went against how all people falsely perceived how the crime against Jesus took place.  In fact it is because of the Shroud we know more about crucification.   Shroud is a credible witness. \nOften times forensic evidence tells a story about a murder that does not make sense,  and it is the opposite of what forensic detectives expected to find.   What happens in genuine reality and how one perceives a event transpired are often completely different and the opposite of what one would expect.   The herringbone weave linen is one of those things that seems out of place in the crime scene and would not be what one expected to find. \nSpirit of God, like the Police DID NOT RELEASE DETAILS OF THE CRIME TO THE PUBLIC, MEANING THE GOSPEL ACCOUNT\nThe Gospel account is in fact a very vague account of events, without much detail, as you would see in a write up in a newspaper about a murder. What is written in the papers or covered in the media about a murder, will not disclose the details or like I said may release false/vague info. What is written in the Gospel account does not include the details of the crime/death and burial of Jesus.\nSHROUD KNOWS THE DETAILS OF THE CRIME AND THE BURIAL. FORENSIC EVIDENCE MATCHES SCRIPTURE AND THEN GOES BEYOND AND DISCLOSES THE DETAILS OF THE CRIME,  DETAILS ONLY SOMEONE WHO WAS AT THE CRIME SCENE COULD POSSIBLY KNOW. \nEXAMPLES, THE Shroud…\n1.Knows what part of beard section was removed/plucked out.\n2. Knows what kind of plant was used to make crown of thorns\n3.Knows what kind of weapon was used to make scourge wounds\n4.Knows the width of a Roman hasta, spear, that made side wound\n5.Knows the names of  plants growing in the area where the crime took place\n6.Knows how long Jesus was in the tomb (between 48 and 72 hours) Knows his stomach became swelled due to gas formation 2-3 days after death\n7. Knows that the nail wound went into wrist not into the palms\n8. Knows how tall Jesus was\n9. Knows Jesus had long hair and was put in a pony tail at burial\n10. Knows that Jesus was buried nude\n11. Knows how many scourge wounds were applied\n12 Knows Jesus was scourged by 2 people, one taller than the other\n13.Knows which parts of his face were beaten, right side more than left\n14. Knows that one of his eyes (right side) was swollen shut\n15.Knows one of his feet made complete impression on the linen, Knows Jesus was buried with his knees raised and body not lying flat\n16.Knows that when a nail is driven into wrist thumb moves inward\n17. Knows that blood stains will form serum contraction rings\n18. Knows that side wound will flow vertically and then horizontally across lower back\n19. Knows Jesus was scourged on nearly every square inch of his body\n20. Knows one knee is more damaged than the other\n21. Knows the name of a rare calcite found in tombs around Damascus Gate and knows the feet, knee and the tip of the nose of Jesus made contact with it.\n22. Knows Jesus had type AB blood\n23. Knows blood of Jesus had elevated levels of bilirubin\n24. Knows that the nose of Jesus was abraded.\n25. Knows how much Jesus weighed  (appx 175 lbs)\n26. Knows the exact angle/ position of the arms when Jesus died  on the cross\n27.Knows plain weave linen was not used in the burial\n28.Knows the width and length of nearly every part of the anatomy of Jesus, \nThere is no other image in the world depicted of Jesus, a life size image, with the vast amount of detail that The Shroud of Turin has.  Not even remotely close.  \nWhat is more probable?\nThe Shroud of Turin was at the crime scene and recorded these details\nThe Shroud of Turin is a man made image and a person made a list such as the one above and said to himself,  “I want all these details of my image” \n“I want Jesus nude even though I don’t know if he was or not,  I am just guessing”\n“I want some rare calcite from Jerusalem on the tip of that nose and I want it abraded”\n“I want the blood from the side wound to flow vertically across the lower back”\n“I am not going to illustrate thumbs, I have no idea why”\n“I am going to illustrate the stomach swelled slightly so if a forensic pathologist studies this it will look as though the body has been dead for 48 to 72 hours”  \n“I want serum contraction rings around the blood stains even though I do not know what serum contraction rings are” \n“I want the hair in a pony tail and his right eye swelled shut”\n“I want it to look like Jesus was scourged by 2 people,  one taller than the other”  \n“I want pollens from a thistle plant around the head area and I want it on that head cloth in Spain as well” \n“I want Jesus to be abnormally tall for a person from 1st century”   \n“I don’t want to be acknowledged for my painstaking detailed work,  I don’t like money” \n“I want it to be a total color inversion image even though I don’t understand what that means and have never seen one before”\n\n","date":"December 15, 2015 at 3:05 am","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","id":"comment-216544","author":"Dave Hines","site":"shroudstory"},{"title":"David Rolfe’s Website","post":"One has to assume that David Rolfe has finally abandoned his ‘Enigma Challenge’. But why was it addressed initially to Richard Dawkins only? Did he seriously imagine there was a chink in Dawkins’ atheist armour through having no ready explanation as to how the image was formed?  Is that how he sees the TS – as a means of striking back at the godless, correction, a particular high profile  (allegedly godless) spokesman famous for espousing that position, one guaranteed to generate another award-winning documentary had Dawkins agreed to participate (which sensibly he didn’t).\nMy advice to David Rolfe, which I’m sure he’ll ignore, is to concentrate on the science and shelve the theology. We could do with a “Silent Witness update – 40 years on”, one that re-examined  in detail all the gee-whizz/”Well I’ll be darned” claims made in the initial documentary. Maybe there’s been more progress than he is prepared to admit if still hankering, as I suspect, for some clinching evidence in favour of authenticity that he hopes might serve as a catalyst, reversing the decline in church attendances, restoring respect for the Anglican Church, at least in his stratum of English society.\n\n","date":"December 8, 2015 at 9:39 am","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","id":"comment-215897","author":"Colin Berry","site":"shroudstory"},{"title":"David Rolfe’s Website","post":"TYpically, Colin engages in personal faulderawl without addressing the merits of the post by Dave. Amazing isn’t it? David Rolfe who has made three movies on the Shroud, has seen it and photographed it at high resolution. Dealt personally with Turin authorities including the late Professor Luigi Gonella hasn’t turned to Colin Berry for advice?\n\n","date":"December 15, 2015 at 8:12 am","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","id":"comment-216563","author":"John Klotz","site":"shroudstory"},{"title":"David Rolfe’s Website","post":"That inconveniently long memory of mine also recalls a despairing Dan Porter saying he would allow no more of David Hines’ repetitive postings on numerology.. Yet here is John Klotz, on the sombre day that Dan announces his retirement and termination of this blog. attempting to give a new lease of life to David Hines, while clearly using him as a ventriloquist’s dummy for his own take-no-prisoners arch-conservative views.\nDo you not consider that a little disrespectful John Klotz, today of all days, not to say manipulative?\n\n","date":"December 15, 2015 at 8:38 am","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","id":"comment-216568","author":"Colin Berry","site":"shroudstory"},{"title":"David Rolfe’s Website","post":"A brilliant post with one bridge too far: Maybe\nDavid Hines post on shroudstory.com is a brilliant post although its leading point may be bridge too far – difficult to accept because it’s an exercise in what some of us would dismiss as numerology.  Yet what makes the post so important is his marshalling of many of the circumstances of the crucifixion exhibited on the Shroud that would be beyond the competence or knowledge of a medieval forger or any forger without extensive historical, medical, biological, horticultural and scientific knowledge unknown until the nineteenth and twentieth centuries. It is an exhibition of circumstantial evidence that is not only compelling, but in my viewpoint conclusive as to the authenticity of the Shroud of Turin as burial cloth of Jesus Christ.\nPart of his posting contains the listing of 28 items exhibited by the Shroud that are clearly “circumstances” of the Shroud pointing to its authenticity. You may quibble (as I do) about some of the circumstances and their implication but unless you can defeat all 28 circumstances you are left with the conclusion that an important body of circumstantial evidence that supports authenticity. How many” 24?, 20?, 10?, 5?, 3?\nHow many circumstances must a prosecutor prove that someone is guilty of murder once you have the body of a dead person killed by a gunshot.?\n(1) We gun that fired the fatal bullet (proven) by ballistics.\n(2) We have an accused fingerprints on the gun.\nThere is no convincing evidence of circumstances exonerating the accused (alibi etc).\nMaybe someone would demand more circumstances, but on appeal, I do not think a jury verdict of guilty would be overturned.\nAs to that part based on ancient numerology, I would have difficulty using it as proof. Than again in this era of Quantum Mechanics where some are trending towards a solipsism of a universal intelligence, I will not bet against it and simply let it pass for now. \nLet’s give Shakespeare the last word.\nThere are more things in heaven and earth, Horatio, Than are dreamt of in your philosophy.”\nHamlet, Act One, Scene 5\n\n","date":"December 15, 2015 at 8:03 am","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","id":"comment-216562","author":"John Klotz","site":"shroudstory"},{"title":"David Rolfe’s Website","post":"One of us here, cursed with a long memory, recalls John Klotz requesting David Hines (then boringly bombarding us with his easy-to-debunk numerology, as he still is) to get in  email contact. \nMight be be seeing the fruits of that liaison right now, with David Hines having added new pages to his tedious script, supplied to him free of charge by …  guess who?\n\n","date":"December 15, 2015 at 8:21 am","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","id":"comment-216565","author":"Colin Berry","site":"shroudstory"},{"title":"David Rolfe’s Website","post":"Colin,\nYour assumption that I have colluded with David Hines on his posting is as much related to reality as your ordinal proposition that the man in the Shroud is Jacques deMolay. My last contact with David was more than 7 months ago and I had nothing to do with his posting or the contents of it. Are you sure you weren’t a member of the Order ofDeMolay.\nI think in my main comment I made it clear that I do not share all of David’s thoughts or I might add all of the circumstances as he describes them. There are 28 listed. Instead of attacking me why don’t you tackle the 28 and give us your rebuttal. I have problems with some of the 28 but by enlarge it is a nice encapsulation of many of the circumstances of the Shroud that point towards its authenticity.\nWell done, David.\n\n","date":"December 15, 2015 at 9:49 am","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","id":"comment-216576","author":"John Klotz","site":"shroudstory"},{"title":"David Rolfe’s Website","post":"typo; “ordinal” = origioal\n\n","date":"December 15, 2015 at 9:51 am","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","id":"comment-216577","author":"John Klotz","site":"shroudstory"},{"title":"David Rolfe’s Website","post":"Hello Mr. John Klotz:  thanks for responding to my post!  For some time I have been trying to locate the film, “The Silent Witness”   and I saw  the title on this Blog Site and thanks to Dan I finally found it.   \nIt is really well made film.  I have not looked at Gematria for months.  There are other aspects of the case file that are much more interesting to me,  but while watching the film, I got a intuitive nudge to type  in Silent Witness on a Gematria,calculator, and I thought, “there is no way it is going to equal 1128”  It did, and then the other,  Enigma of the Shroud, again 1128, I thought it was a odd “coincidence”  Since this post was in regards to the film Silent Witness the majority of my comments were on that subject line.\nThe Gematria display is useful, it is not unlike  a appetizer we offer,  before we serve the main meal of evidence and other numerical match points. \nAbout my post.   \nYou wrote,. “It is an exhibition of circumstantial evidence that is not only compelling, but in my viewpoint conclusive as to the authenticity of the Shroud of Turin as burial cloth of Jesus Christ”\nI could not agree with you more.   \nI have seen many cases with far less evidence in which a jury was able to make a decision and be certain  beyond a reasonable doubt a particular person was responsible for a crime. \nI saw a recent murder case where they did not have the body, but found just a few drops of the  person’s blood at the bottom of a Refrigerator and a witness that claimed they saw the defendant put the body in that refrigerator.    It was enough to be able to bring the case into a court of law in front of a jury.\n:Person was found guilty beyond a reasonable doubt.   There are many such wrongful death cases, where the party that committed the crime was brought to justice even though they did not have the body. \nShroud of Turin case also is a case without the actual body, but is much more compelling evidence of a wrongful death than just 1 witness and few drops of blood. \nI’ve said this before, but take the name of Jesus out of this and The Shroud is authentic.  Not one person would question its authenticity in terms that a actual dead body that was scourged and crucified made contact with the cloth. \nThe Shroud of Turin case file is the only case in forensic history that the conclusions drawn by no less than 3 forensic pathologists in agreement were not accepted and for one reason and one reason only.   The name of Jesus is involved.    Put in most any other name and it is authentic.\nNo one has to admit guilt if it is another name or have to face the reality that there really is going to be a judgment day and each person will be held accountable for their actions or lack there of .\nGreat book, I just got started with it.   Thanks again. 7 months later.\n\n","date":"December 16, 2015 at 6:38 am","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","id":"comment-216643","author":"Dave Hines","site":"shroudstory"},{"title":"David Rolfe’s Website","post":"David,\nI would not willy-nilly write off anything at this point and that includes your number analysis although I think the “coincidence” of the same number is not going to be accepted by many, if not most readers.\nIn Quantum Christ I quoted Sir Roger Penrose (Nobel Laureate) and Dr. Stuart Hameroff:\n“Consciousness implies awareness: subjective experience of internal and external phenomenal worlds. Consciousness is central also to understanding, meaning and volitional choice with the experience of free will. Our views of reality, of the universe, of ourselves depend on consciousness. Consciousness defines our existence.”  (Emphasis added)\nTeilhard de Chardin defines the human species as the singular species which has a reflective consciousness. Not just that we are aware of our existence but that we are aware that we are aware. Sir Bertrand Russell was wrote that solipsism   – the belief that the only relevant existence is that we consciously perceive and thus create – is the only defensible philosophy.\nThere is a legendary anecdote that has been reported in different guises that a woman wrote him to express her gratitude for his enunciating his position because “I thought I was the only one ho believed that.”\nSolipsism is my opinion is the underlying explanation for Ayn Rand’s  Egoism and Friedrich Nietzsche’s nihilism. I fled from it. In my book “Quantum Christ” I defined God as the primordial consciousness from which our existence sprang. I do not retreat from the definition but now I think I can clarify it further: God is the primordial solipsist. He is the big box of consciousness into which all the little boxes of consciousness are contained and that includes each of us. \nSome years ago I read that quantum science was demonstrating that underlying our existence was the law of probability theory. Incidentally, Richard Dawkins agrees with that. I was aghast and so was Einstein before he died. But I asked myself a question: Whose law is the law of probability?\nI think I am challenged now to write this more explicitly. Maybe I am being challenged by that great solipsist in the sky to do it? Perhaps, I should get a grip.\nYour use of ancient numerology is difficult to accept carte blanche. But to quote my current hero Pope Francis: “Who am I to judge?”\nWe’ll see.\n\n","date":"December 16, 2015 at 9:08 am","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","id":"comment-216648","author":"John Klotz","site":"shroudstory"},{"title":"David Rolfe’s Website","post":"Good Evening Mr. Colin Berry:   It’s 7:43 your time,  here it is afternoon. Hoping all is well for you in great and rich country of Great Britain.  I would like to have some of their gold here in Central America.  We could use it.  I had no idea Dan was taking a break from all this.   Hats off to Dan Porter for coming up with some of the most obscure fascinating info on the Shroud and giving both sides of the Shroud debate a voice.    I totally understand why he is taking a break.  The purpose of the Gematria display is to draw attention to numerous “coincidences” that link the cloth to Jesus.\nThat is all.  It is either coincidence or not. \nSame as the Shroud, it either is authentic or it is not. \nThe inspiration for my post actually came from Barrie Schwortz,  he was talking to a Muslim woman with the full size replica and he was pointing out details of the image to her. \nHe pointed out things I had never noticed before.   Simon Brown was filming him at the big event in the UK. It was a video on youtube. \nThe other inspiration of what I wrote comes from Investigation Discovery and Forensic files,  those are the only TV shows I watch.   I like to see genuine crime scene photos, and live videos of  crime scenes,,  suspects being interrogated, real life situations.  Fascinating,  I highly recommend both programs. \nSince I just learned Dan is taking from break this,  I am going go close saying a BIG THANKS to Dan Porter for doing an incredible job.    I have learned much about the Shroud because of his time and effort.    \nThe most valuable thing another person can give us is their time.   Dan gave us the very valuable gift of his time.  Thank you Dan!\nI am reminded of the movie called “Never Say Never Again”  when Dan says he is not coming back.\nI wish him  great success,\nEverybody on this Earth has a right to be happy.   I think it is important that we acknowledge the good works of others.    Dan Porter has done a lot of good.   Jesus Christ made a incredible sacrifice,  I believe it is critically important that his sacrifice is acknowledged,    I see the Shroud as a witness to what happened to him,  A Silent Witness, but when questioned the information starts pouring out of him, one detail after another. \nWe all have different destiny’s to follow.    I think we are all doing are best under less than desirable circumstances in this day and age.\nLet’s acknowledge the good works of Dan,  I don’t want this post to be a distraction to that event.  \nPerhaps at some other time we will discuss the Shroud again.\nI prefer to make a video and speak out as opposed to writing on a forum like this.\n\n","date":"December 15, 2015 at 3:10 pm","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","id":"comment-216603","author":"Dave Hines","site":"shroudstory"},{"title":"David Rolfe’s Website","post":"It’s already been explained to you, DavidH, by more than one person, why your particular calculations seem to “work”. Yet you’ve turned a deaf ear, then returned again and again touting  the same old glorified card trick (which is essentially what it is)  as if each time was the first. Dan asked you politely to desist, you persisted and were then finally shown a red card (soccer symbolism).\n Yet here you are, yet again, on the very day that Dan announces he’s bowing out, with an even longer screed repeating yourself all over again, with this fatuous claim of the English language having magical properties. No, it doesn’t. It just has a fairly random distribution of the most frequently used letters along a lengthy 26 point numerical scale , which is why that scoring system of yours seem to  “work like magic”. But it’s not magic. It’s all about probability theory.. \nMaybe you don’t understand probability theory and statistics. But one assumes you can understand plain simple English. Can you not just give it a rest please, and spare us more of this needless distraction from the real business of this site, sadly now closing shop, namely the Shroud of Turin. Kindly show some maturity and social good sense. Thank you.\n\n","date":"December 15, 2015 at 4:14 pm","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","id":"comment-216611","author":"Colin Berry","site":"shroudstory"},{"title":"David Rolfe’s Website","post":"I am convinced that the Spirit of God invented the English language and gave it to man and left behind numerical clues/codes in the language in regards to matters he deems to be important.     The Shroud of Turin being one of those things.  Mainly because the Shroud involves the sacrifice of his Son and is related to the subject of eternal inheritance.\nThe video we made presenting this evidence  has done very well, it gets high audience retention,  good approval rating and is increasing in views all the time. Majority of people like the display.   Spirit of God likes it,  He wanted that video made, so I made it.  That is the only authority I answer to and the only approval I need. I don’t need your approval or Dan Porters or any other person for that matter.\nI shared it on this blog site and did so with good intention.  Our views do not increase as a result of posting here.   People come to our videos by attraction not promotion.  We do extremely well reaching up to 2000 people a day on the subject of the Shroud of Turin. 500 minimum a day.  We are in every country in the world now and views expanding worldwide.\nYou are in the minority group that does not like the Gematria Display.  My recent post was not about Gematria, it was on another subject line altogether you freaking idiot,.\nDo me a huge favor, never speak to me again, I want nothing to do with you,  I love you, but I don’t like you.\n\n","date":"December 16, 2015 at 5:40 am","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","id":"comment-216641","author":"Dave Hines","site":"shroudstory"},{"title":"David Rolfe’s Website","post":"Good Evening Mr. John Klotz:  \nPlease accept my apologies for the delay in my response.   I rent vacation homes on the Gold Coast of Costa Rica.  This time of year is crazy.  I have been working 12 hours a day non stop to prepare for guests.  Sales exploded this year.  That is why my response is so delayed.  \nI am more than interested in thoroughly reading your book.    Congratulations again on completing and getting it published.  I am so glad I have it. \nI recently acquired  a isolated private house in the mountains of Costa Rica,  It has been thoroughly cleaned and prepared so I have a place to retreat and continue Shroud research and make films without distraction. A place I can read your book without one person bothering me.  I purchased the life size Shroud replica from Barrie and recently brought it into this location.   To actually see the whole 14′ cloth laid out is completely different than seeing it on internet.  It is truly a amazing sight to actually see up close and personal, The Shroud of Turin in extreme detail.\nI brought The Shroud into each property that I represent.   I have record breaking sales this year.  Double and triple what I normally do.  Are the events related or coincidence?  I really don’t know.\n Last night I brought The Shroud to this remote location where people told me  “no one will rent a house in this area”  “you are wasting your time”  “no one will rent that house”   My phone rang this afternoon while at the location,   I booked the house solid throughout the holiday season, at a price higher than anyone has ever rented it before.   The Shroud of Turin was in the house.  Either the events are related or they are not.   Coincidence or not. \nThe purpose of the Gematria display was to bring attention to the subject of “Coincidences”    Not so much as to talk about numerology. \nI will be in contact with you again when all the smoke has cleared from the rental sales done this year. Quite a financial blaze. \nWishing you and everybody else here on the Dan’s Blog site a Merry Christmas and a Happy New Year!   Yes, that includes all the skeptics,  “God Bless Every One of Them!”\n\n","date":"December 22, 2015 at 9:54 pm","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","id":"comment-217083","author":"Dave Hines","site":"shroudstory"},{"title":"David Rolfe’s Website","post":"David,\nMy E-Mail if Klotzlaw@gmail.com Stay in touch.\n\n","date":"December 27, 2015 at 5:22 am","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","id":"comment-217277","author":"John Klotz","site":"shroudstory"},{"title":"David Rolfe’s Website","post":"It is a beautiful website. \nThe documentary is very well done. The French version is also very well written. One downside though, is the historical part with the Templars. This is a very speculative scenario. There is almost no historical documents to support it.\n\n","date":"December 15, 2015 at 4:14 pm","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","id":"comment-216610","author":"Mario Latendresse","site":"shroudstory"},{"title":"David Rolfe’s Website","post":"Not long ago I commented that the Turin Shroud would not answer all our questions and Joe Marino agreed with me. It was no surprise. After all, he is a theologian.\nThere are people who find it difficult to accept the authenticity of the Shroud because they feel that the basic questions have not been answered. They are right to an extent. After this recent (October) interview with a renowned biblical archaeologist I at least am even more convinced that the Bible, particularly the creation story will have to be reinterpreted in the light of modern science:  https://www.academia.edu/18994343/The_key_role_of_Biblical_Archaeology_in_Exegesis_An_Interview_with_Professor_Israel_Finkelstein\nIan Wilson jokingly mentioned rewriting Genesis in his last Shroud book.\n\n","date":"December 16, 2015 at 9:41 am","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","id":"comment-216650","author":"Louis","site":"shroudstory"},{"title":"David Rolfe’s Website","post":"Thanks for posting the photo of the archeologist , but I would have preferred to see a photo of my friend Louis.\n\n","date":"December 16, 2015 at 11:08 am","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","id":"comment-216655","author":"PHPL","site":"shroudstory"},{"title":"David Rolfe’s Website","post":"Hello Philippe\nPhotographs generally accompany my interviews and articles. The one you are referring to was the one I took.\nWell you can get my photo if you contact me by email, and although I don’t look like Clark Gable!\n\n","date":"December 16, 2015 at 11:22 am","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","id":"comment-216657","author":"Louis","site":"shroudstory"}]
