[{"id":"comment-58816","author":"michael_jude","post":"I appreciate the kind words and offer to buy the book, however, that is not any degree of priority with me whatsoever. I am the first to confess the book is NOT an easy read and would need some rewriting to make it more commercially viable. For this and other reasons I unwittingly throw out ‘teasers’. Then there is the matter of ‘what’ inspired me to write the book. The book is a first hand, factual account of an event that involved the supernatural and what I later came to recognize as cosmology. The event redefines the word bizarre but did capture the interest of 2 Jesuit priests and an associate of one of theirs who specialized in religious phenomena..","date":"2013-12-13","mins":"9:40 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-58820","author":"michael_jude","post":"Even with the accompanying accoutrement of nails in the hand, coins over the eyes, radiation, carbon dating, recitation and interpretation of biblical verses/passages and whatever else can be found in the ‘kitchen sink’ of sindonology, trying to determine how the image was made, where it originated from by focusing solely on the image alone is akin to trying to explain how a car moves by only explaining what a spark plug is.","date":"2013-12-13","mins":"9:44 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-58821","author":"michael_jude","post":"Jesus once said ” i have many more things to tell you but you cannot bear to hear them now.","date":"2013-12-13","mins":"9:45 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-208303","author":"michael_jude","post":"About 2 years ago I found this blog at which time I made my initial statement saying that I understand how the image was formed. I come back to it from time to time to see if anyone else has even alluded to certain aspects of the shroud necessary to understanding it. I’ve yet to see even one. The closest anyone has come is the theory held by Isabel Piczek. However, through no fault of her own it is a very far cry from being a total explanation. In fact, just a few months ago I inadvertently found her theory one day on line and was pretty much taken aback by what she said. If you read what she said and what I wrote in my book, Thirteenth Apostle: The Coming Transubstantiation 14 years BEFORE she even developed an interest in the Shroud it would raise some eyebrows. I am NOT saying that she knowingly or unknowingly took what I wrote and expounded on it in her own way but it would be hard NOT to at least entertain the idea. Except for the placement of one or two words, literally, our explanations, at first blush, are identical. However this placement of words makes a difference that is immeasurable………………[contact information removed].","date":"2015-08-15","mins":"5:00 am","url":"https://shroudstory.com/2015/08/15/from-out-of-the-strong-came-forth-the-sweet/","cat":"image_theory","title":"From out of the strong came forth the sweet?"},{"id":"comment-58954","author":"michael_jude","post":"Funny you should mention Tielhard. In 1988, when I spoke to a certain Jesuit priest here, in the Philadelphia about my lifes experiences and the one in particular which led to the writing of my book he said I reminded him of / sounded like Plato, Catherine of Sienna and De Chardin……who knew?.","date":"2013-12-13","mins":"2:35 pm","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"}]
