[{"id":"comment-65036","author":"michael_jude","post":"I’ve often wondered what a Buddhist, Hindu or someone who is a follower of a religion that does not associate miracles or the possibility of a physically resurrected human physical body with Christianity what they think of the Shroud?.","date":"2013-12-22","mins":"11:22 am","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-58826","author":"michael_jude","post":"Many years ago I sent a copy of my book to Ian Wilson. Citing his initial reaction he said words to the effect that it is complex and must be read more than once to understand it. I later wrote back asking if he began to read it. This time he said, again, words to the effect, he pretty much will not read it as we are not coming from the same place. Not a problem with me. Did he read something that will finally put the Shroud mystery to rest? I claim to understand the mechanism involved and all of its ramifications and all that it entails. For me as I’ve written on here the Shroud of Turin is not something I knowingly took an interest in. Given my level of education and erudition, actually disqualifies me from such a venture. The Shroud was one of MANY subjects in my book that came to my attention but a relatively short time before and found it way into the book resting comfortably within a body of knowledge I fortunately acquired. To this day it still remains a mystery to me why I was involved. Although……..all of this started early in childhood.","date":"2013-12-13","mins":"9:53 am","url":"https://shroudstory.com/2013/12/13/update-at-the-holy-shroud-guild/","cat":"other_blogs","title":"Update at The Holy Shroud Guild"},{"id":"comment-58813","author":"michael_jude","post":"Is Fr. Frank Brinkman still associated with the Holy Shroud Guild? Many years ago I wrote him about the Shroud insisting he investigate one specific area of concern that has been overlooked. He responded by saying ‘ you have my full attention’. I still have a print out of the email. I’d love to correspond with him again..","date":"2013-12-13","mins":"9:35 am","url":"https://shroudstory.com/2013/12/13/update-at-the-holy-shroud-guild/","cat":"other_blogs","title":"Update at The Holy Shroud Guild"}]
