[{"id":"comment-198011","author":"michael_jude","post":"The arguments go back and forth and beyond due to the fact that, except, perhaps, one or two people were meant to understand the ‘miracle’ of the Shroud from day one of their birth.","date":"2015-04-30","mins":"9:37 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-192323","author":"michael_jude","post":"Naturally……………the CNN show, Finding Jesus, revealed absolutely, positively and most assuredly nothing new. I’ve had the answer to the Shroud for years..","date":"2015-03-03","mins":"5:34 pm","url":"https://shroudstory.com/2015/03/01/from-a-small-news-segment-on-cnn/","cat":"press_coverage","title":"From a small news segment on CNN"},{"id":"comment-197991","author":"michael_jude","post":"I can and, in fact, DID explain how the image was formed in my book THIRTEENTH APOSTLE: THE COMING TRANSUBSTANTIATION. When I wrote about it, I had heard of the Shroud but a few days before. The nature and measure of information I wrote up until that time was so comprehensive the idea of how the image was formed took on the role of being a mere footnote, the logical conclusion in a divine syllogism.","date":"2015-04-30","mins":"6:06 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-58986","author":"michael_jude","post":"The image itself is perfect, not by human standards nor definition of the word but perfect in that it is perfect because it is in its original state of being…….the cloth is a material, physical object, imperfect by human standards and definition, subject to time/space…….the image came into the physical realm, made contact with an imperfect entity…….ultimately affecting containing all aspects of jesus’ whole ‘identity’….thus the image and cloth became subject to being ‘diluted’ and rendering no conclusive true chronological assessment.","date":"2013-12-13","mins":"4:03 pm","url":"https://shroudstory.com/2013/12/13/please-only-discuss-michael-judes-book-and-claims-here/","cat":"books","title":"Please Only Discuss Michael Jude’s Book and Claims Here"},{"id":"comment-59015","author":"michael_jude","post":"The resistance to any new idea is in proportion to the square of its importance….thank you to those who accept and do not accept….peace to all.","date":"2013-12-13","mins":"5:27 pm","url":"https://shroudstory.com/2013/12/13/please-only-discuss-michael-judes-book-and-claims-here/","cat":"books","title":"Please Only Discuss Michael Jude’s Book and Claims Here"},{"id":"comment-59363","author":"michael_jude","post":"Dan….I will refrain from any further comments. I have a Twitter account and will relegate myself to that. Thank you for your involvement..","date":"2013-12-14","mins":"11:27 am","url":"https://shroudstory.com/2013/12/13/please-only-discuss-michael-judes-book-and-claims-here/","cat":"books","title":"Please Only Discuss Michael Jude’s Book and Claims Here"},{"id":"comment-59257","author":"michael_jude","post":"One year after my book was published, I took on another project. I decided to produce and market a brochure. Because certain parts of the book are, admittedly, not an ‘easy read’, I wanted to take one of the many many topics of the book and write about/explain it in simpler terms. I decided upon the Shroud of Turin for its high profile even among people who are not interested in religion, philosophy, etc. I also wanted the context and syntax of the brochure to be such that it mimicked the ‘ here it is, read it and just believe it without thought’ style of so many organized religions. I convinced one book store to stock it and it sold there for about a year when I decided to pull it off the shelf. I had an opportunity to speak with the owner of the chain of stores. He told me the brochure had great potential and suggested I find a distributor for it. I tried to find a distributor but could not seem to cut through all of the red tape necessary for me to contact them vis a vis. I’ve often thought of resurrecting the brochure…..","date":"2013-12-14","mins":"6:34 am","url":"https://shroudstory.com/2013/12/13/please-only-discuss-michael-judes-book-and-claims-here/","cat":"books","title":"Please Only Discuss Michael Jude’s Book and Claims Here"},{"id":"comment-70740","author":"michael_jude","post":"In my exploits as one who has written about the subject, in recent years I happened to discover that third dimension holographs were being used to enhance the face of Jesus as it appears on the Shroud of Turin. Describing a revelatory vision I experienced ( one of two ) whose influence later enabled me to concisely explain how the image was formed I wrote in my 1990 book ( page 29 ) titled Thirteenth Apostle: The Coming Transubstantiation, the following….” my affiance to the task implacable, it came to pass that I was to resolve the mystery of his appearance and other areas on concern regarding his presence through the distinct manner of his posture as He first appeared to me. For in the premonition His physical wounds via His crucifixion seemed to be emphasized, accentuated, set apart from the rest of his physical form as though they were being in a third dimension holographic style”. In December 2013 I contacted the person who is considered to be the innovator of using 3 D holograms for such a purpose and asked when he first initiated the process. When he wrote back saying the year was 2004 I wrote him again asking if the idea of doing so had previously existed. He responded saying, verbatim, ” no, nobody ever thought of that possibility and that surprised me too in 2004″. Again, my book was written 14 years before…..","date":"2013-12-31","mins":"10:17 pm","url":"https://shroudstory.com/2013/12/13/please-only-discuss-michael-judes-book-and-claims-here/","cat":"books","title":"Please Only Discuss Michael Jude’s Book and Claims Here"},{"id":"comment-59382","author":"michael_jude","post":"I am on twitter, My twitter account is Michael Jude @bookforall13.","date":"2013-12-14","mins":"12:08 pm","url":"https://shroudstory.com/2013/12/13/please-only-discuss-michael-judes-book-and-claims-here/","cat":"books","title":"Please Only Discuss Michael Jude’s Book and Claims Here"},{"id":"comment-58966","author":"michael_jude","post":"Thank you Dan, not for me but for following your instincts on this and doing what I cannot.","date":"2013-12-13","mins":"3:06 pm","url":"https://shroudstory.com/2013/12/13/please-only-discuss-michael-judes-book-and-claims-here/","cat":"books","title":"Please Only Discuss Michael Jude’s Book and Claims Here"},{"id":"comment-71070","author":"michael_jude","post":"I left out the word PORTRAYED in the above comment….the line should read ” as though they were being portrayed in a third dimension, holographic style” if anyone took the time to read it, I apologize for the error.","date":"2014-01-02","mins":"7:19 am","url":"https://shroudstory.com/2013/12/13/please-only-discuss-michael-judes-book-and-claims-here/","cat":"books","title":"Please Only Discuss Michael Jude’s Book and Claims Here"},{"id":"comment-58968","author":"michael_jude","post":"Something the nature of carbon dating WOULD be expected to produce inconsistent results for we have the presence of a perfect, timeless thing( the image ) involved with an elementally imperfect implement, subject to the ravages of time which is the whole process of carbon dating….the image comes from a place, a ‘material’, that is timeless and perfect….for those who prefer scientific lingo replace timeless with ‘a place where time does not move as it does in our own physical plane.","date":"2013-12-13","mins":"3:11 pm","url":"https://shroudstory.com/2013/12/13/please-only-discuss-michael-judes-book-and-claims-here/","cat":"books","title":"Please Only Discuss Michael Jude’s Book and Claims Here"},{"id":"comment-58969","author":"michael_jude","post":"The ‘material’ from which the image emanates from is timeless and perfect and is the same material from which the human body and all things emanates from and in the case of Jesus was instrumental in making his physical body whole and complete and perfect in the sense it was restored, instaurated ( all this typing……I need an aspirin ).","date":"2013-12-13","mins":"3:14 pm","url":"https://shroudstory.com/2013/12/13/please-only-discuss-michael-judes-book-and-claims-here/","cat":"books","title":"Please Only Discuss Michael Jude’s Book and Claims Here"},{"id":"comment-198012","author":"michael_jude","post":"And so it continues…………...","date":"2015-04-30","mins":"9:38 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-59258","author":"michael_jude","post":"Actually, I’ve seen the book for sale on the internet upwards to 130.00. Don’t know how or why this is, but I’ve been advised on it…..go figure.","date":"2013-12-14","mins":"6:37 am","url":"https://shroudstory.com/2013/12/13/please-only-discuss-michael-judes-book-and-claims-here/","cat":"books","title":"Please Only Discuss Michael Jude’s Book and Claims Here"}]
