[{"id":"comment-61092","author":"anonymous","post":"And what this means? This means that the conclusion that the bloodstains on the Shroud are real bloodstains is the strongest evidence that this cloth is a real burial shroud of a real crucified man that was tortured in the same way as Jesus of the Gospel. The implications that come from the solid conclusion that the bloodstains on the Shroud are real bloodstains are very important regarding the question of whether or not this is Jesus’ authentic burial cloth. Because of this, it is pretty evident to me that it is truly is real burial cloth. My conviction is much more based on the evidence coming from the blood and serum stains than anything that can come from the body image (even though there are a lot of good evidences also in there that point in the same direction)..","date":"2013-12-17","mins":"4:37 pm","url":"https://shroudstory.com/2013/12/17/a-special-guest-posting-by-kelly-kearse-and-thibault-heimburger/","cat":"blood_studies","title":"A Special Guest Posting by Kelly Kearse and Thibault Heimburger"},{"id":"comment-61836","author":"anonymous","post":"Let’s take the opposite approach done by Thibault and Kelly for a second… Imagine the bloodstains on the Shroud would NOT be made of real blood material. Question : If that would have been the case, how in the world independent professionals like Baima Bollone and Heller and Adler would all have been fooled and never been able to determine its real « non blood » nature? This is so ludicrous as an idea that it’s well enough to understand that the conclusion that the bloodstains on the Shroud are really made of blood material (most probably coming from the man who left an imprint on the cloth) has to be considered as one of the most solid data that ever came out of Shroud research. And if you want to know the implications of such a solid data, please read this paper : http://www.shroud.com/pdfs/n76part5.pdf Note : the same reflection is also true if the bloodstains on the Shroud would be made of a mix of real blood and some sort of pigments. In such a case, the same question can be asked : How in the world independent professionals like Baima Bollone and Heller and Adler would all have been fooled and never been able to determine that there were some evident « non blood » material in the bloodstained areas? Ludicrous idea!.","date":"2013-12-18","mins":"5:35 pm","url":"https://shroudstory.com/2013/12/17/a-special-guest-posting-by-kelly-kearse-and-thibault-heimburger/","cat":"blood_studies","title":"A Special Guest Posting by Kelly Kearse and Thibault Heimburger"},{"author":"anonymous","post":"I read that type AB is the newest of blood types. Mostly starting only ten or twelve centuries ago. Is this true and what data supports this claim?.","date":"2011-06-24","mins":"9:56 AM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n"},{"author":"anonymous","post":"Hi, I've been researching the Eucharistic Miracle of Lanciano, the Sudarium of Oviedo, and Shroud of Turin and came upon the claim of all blood becoming AB over time, so I searched for that and found your posting. I also found information on blood types of ancient Egypt and curiously, of the types listed in the research cited, AB is one of the least prevalent. Somehow, I don't think mummification would preserve the blood type that well if it is true that all blood eventually becomes AB over time. If it did, it seems it would do a better job preserving the rest of the body. Of course, I'm no scientist, but that's the way it seems to me. The only places on the internet that I have been able to find claims of all ancient blood types reverting to AB is in reference to the Shroud and links to other Jesus related evidence. Curious, isn't it?.","date":"2011-07-03","mins":"12:42 AM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n"}]
