[{"author":"anonymous","post":"Hi Stephen, I could not go on your cherished website this morning. Was there a temporary problem ? All the best Patrick.","date":"2017-03-29","mins":"4:09 PM","url":"http://theshroudofturin.blogspot.com/2017/03/chronology-of-turin-shroud-ninth-century.html","title":"\nChronology of the Turin Shroud: Ninth century \n"},{"id":"comment-77329","author":"anonymous","post":"What is much more problematic for the scorch “theory” David is the evidence coming from the blood and serum stains, as well as the ultra superficiality of the image everywhere, no matter if it’s a dark zone or a lighter one… Much more problematic….","date":"2014-02-07","mins":"4:36 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-79048","author":"anonymous","post":"For a Jew killed legaly by the Romans around Jesus time Max, I don’t think we have any proof that this was really the case… And even if some form of burial was allowed by the Romans for such a criminal in Judea, it’s not sure at all that he could have been buried elsewhere than inside a common tomb instead of a family tomb. I would like you to give us some references to back up your claim….","date":"2014-02-13","mins":"2:02 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-79110","author":"anonymous","post":"Again, to my knowledge (if my memory is correct), I think there is still a debate among expert on that question and I think it is simply because we don’t have any clear texts about the way the Romans were allowing the Jews to buried someone they just crucified….","date":"2014-02-13","mins":"5:39 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-79432","author":"anonymous","post":"It’s not evident to be sure how those who were legally killed by the Romans in Palestine during Jesus time were buried (if they were at all). I think it’s wise to remain very prudent about that and not making sure claims. By the way, I’m not Yannick, I’m his phantom..","date":"2014-02-14","mins":"4:38 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78124","author":"anonymous","post":"Mario, I think you’re right. And such a crucifixion position that was maintained because of the rigor mortis can well be the most important (if not the single) cause of the apparent lack of scourge marks at the base of the buttocks area. Instead of putting forward special assumptions to explain this particularity of the scourge marks (like Thierry Castex’s idea of a smaller cloth lying under the buttocks area), I think the hypothesis of a crucifixion position that was maintained because of the rigor mortis, which would have elevated this part of the buttocks area away from the underlying shroud (thus preventing the transfer of many scourge marks) is much more plausible and rational in the context of the Shroud. I’m sure my friend Occam would agree with me on this one because such a conclusion doesn’t rely on special assumptions like it is in the case of Castex hypothesis..","date":"2014-02-10","mins":"4:44 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78140","author":"anonymous","post":"The natural position of crucifixion described by Barbet is consistent with a elevation of the lowest part of the buttocks (or the upper thighs if you prefer) from a cloth lying on a flat surface IF the rigor mortis came soon enough that it would have kept the body in this position while he was still nailed to the cross after the death of the Shroud man. I don’t think we need more explanation than this rational one….","date":"2014-02-10","mins":"5:35 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78144","author":"anonymous","post":"Personally, I do for the explanation concerning the bloodstain off the right elbow and the bloodstains that are looking to be in the hair, while they were probably in the cheeks area. This highly suggest that some form of manual compression happened during the burial procedure, which placed many parts of the Shroud for a short time in direct contact with the bloodstained body, thus causing a discrepancy between the apparent location of some bloodstains on the cloth versus the body image and their real location on the corpse. The same explanation is also very good to explain the presence of some scourge marks under the knees while there is absolutely no body image there… And to me, this form of manual compression probably happened when they transferred the enshrouded body from a central place inside the tomb (where the corpse was first placed Inside the Shroud) to a final resting place (probably a stone bench carved out in one of the tomb’s wall). All this sound highly logical and rational to me and suggest a real first century Jewish burial….","date":"2014-02-10","mins":"5:42 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78145","author":"anonymous","post":"All you need is love… Sorry… All you need is rational thinking. ; ).","date":"2014-02-10","mins":"5:43 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78331","author":"anonymous","post":"Max, both conclusions can be correct in the sense that it could well have been a change of configuration (from a compressed one to a looser configuration at the end of the burial procedure) but without any compression being applied to the lowest part of the buttocks area (or the upper thighs area if you prefer). This total absence of a strong compression there would explain why there are much less scourge marks in this area, while it would not discard the hypothesis proposed by Lavoie and others that there were a strong compression of the cloth on other areas of the body (like, for example, the right elbow and the face) for a short time during the burial procedure. Personally, I think the body was first placed inside the shroud in a loose way and then, during a short transfer of the enshrouded body from a central place inside the tomb to a final resting place (i.e. Stone bench carved inside a wall of the tomb), there were many parts of the body that became strongly compressed with the cloth (thus causing many bloodstains and scourge marks on the cloth) and then, finally, after the enshrouded body was laid on his final resting place, the shroud could have been replaced in the same looser configuration it was right after the body was placed in it..","date":"2014-02-11","mins":"11:32 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"author":"anonymous","post":"If there is overwhelming evidence that the Shroud is authentic , why is it then that so many people, some of them very intelligent and very cultured, say that the shroud is a medieval fake ?.","date":"2015-02-19","mins":"9:06 PM","url":"http://theshroudofturin.blogspot.com/2015/02/locations-of-shroud-turin-shroud.html","title":"\nLocations of the Shroud: Lirey c.1355 - Chambéry 1471: Turin Shroud Encyclopedia \n"},{"author":"anonymous","post":"'And He knew as knowing the heart, and asked to wash Himself; and a towel [Gk. Tetradiplon] was given Him; and when He had washed Himself, He wiped His face with it. And His image having been imprinted upon the linen [Gk. Sindon], He gave it to Ananias, saying: Give this, and take back this message, to him that sent you: Peace to you and your city!\"So this is clearly not referring to a should but a cloth with an image of Christ's face on it that Christ asked to be given to the city of Edessa. Can you explain how it could be a shroud?.","date":"2012-09-15","mins":"8:05 PM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","title":"\nTetradiplon and the Shroud of Turin\n"},{"author":"anonymous","post":"So it really was the Shroud and the clergy knew this but they put out the story that it was an image of the face of Christ while alive? At what point was the truth revealed? In 944 or later?.","date":"2012-09-16","mins":"4:52 PM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","title":"\nTetradiplon and the Shroud of Turin\n"},{"author":"anonymous","post":"This part of the story is false:Jesus asked for a towel to wash himself and then wiped the cloth on his face. With his image imprinted upon the towel, Jesus gave it to Ananias and t.. Thaddeus to guide the king and the city The Shroud is a 14 foot long burial cloth but it has the image of Jesus on it (very faint actually). The image imprinted after Jesus died and it is not from washing his face.Legends obscure facts. The legend of the Veronica cloth (she supposedly wiped his face on the way to crucifixion) is false (there is no Veronica cloth) It was widely told for centuries. It is based on the Mandylion (never made by human hands therefore not an icon)The Mandylion (the Shroud) was often described as a facial image because it was displayed as folded (not the full length) and that is where the story of a face cloth came.There is a face cloth (the Sudarium) but it too is a death cloth and its stains match the Shroud (Sindon) and so at one point both clothes were together (te grave). They each have type AB blood.Type AB is the rarest (less than 3% have it) and blood typing was discovered in 1907. So blood tyhpe help to corroborate the relationship of the cloths..","date":"2013-09-15","mins":"12:17 AM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","title":"\nTetradiplon and the Shroud of Turin\n"},{"id":"comment-52022","author":"anonymous","post":"I agree with you Dave and I think that, concerning the Shroud, the weight of evidence in favor of authenticity is huge..","date":"2013-11-19","mins":"11:30 am","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-52023","author":"anonymous","post":"As I always say: concerning the Shroud, we must always look at the whole picture given by all the most solid data coming from the cloth and not just focussing our attention on one single point, while forgetting all the others (or some of them)..","date":"2013-11-19","mins":"11:31 am","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-52025","author":"anonymous","post":"Quote: “The information derived from TS dimensions, “accidently corresponding to the units of measure used in the ancient Middle East is not a final proof of its authenticity, but neither it is meaningless, as the sceptics try to convince us, and can be used as an argument for pro authenticity.” I agree with you to some extent. But it’s surely not the most important data coming from the Shroud that point in favor of authenticity, for the simple reason that there are too many unknowns related to it (what was the original dimensions of the Shroud?, what was the real dimensions of the cubit unit that was potentially used by the persons who have manufactured the Shroud, etc.). Let’s say that this 2 X 4 cubits dimensions is one circumstantial evidence that must be backed up by other more solid évidences in order to really mean something versus the question of authenticity..","date":"2013-11-19","mins":"11:38 am","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-52048","author":"anonymous","post":"Is there other ancient cloths of the same dimensions as the Shroud that have been found or that have been preserved?.","date":"2013-11-19","mins":"3:50 pm","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-55802","author":"anonymous","post":"“Is it a bit of a stretch?” Answer: No. It is a very big stretch and not a “bit of a”..","date":"2013-12-03","mins":"2:02 pm","url":"https://shroudstory.com/2013/12/03/translation-when-you-come-bring-the-shroud-of-turin/","cat":"history","title":"Translation: When you come, bring the Shroud of Turin"},{"id":"comment-55868","author":"anonymous","post":"There is absolutely no clear indication of the presence of a Shroud of Christ in Turkey before the middle of the 11th century (in Constantinople, not in Edessa where there was just a false relic, most probably painted, of the face of the living Christ until 944). These are the historical facts. At the time of Paul, the most logical place where the Shroud was is in some hidden place and probably still in the Jerusalem area (where the Christian Community was still present in good number until the first Jewish revolt)..","date":"2013-12-03","mins":"4:40 pm","url":"https://shroudstory.com/2013/12/03/translation-when-you-come-bring-the-shroud-of-turin/","cat":"history","title":"Translation: When you come, bring the Shroud of Turin"},{"id":"comment-55870","author":"anonymous","post":"Of course, my last sentence is only a hypothesis but, to me, it is the most probable in regard of the fact..","date":"2013-12-03","mins":"4:40 pm","url":"https://shroudstory.com/2013/12/03/translation-when-you-come-bring-the-shroud-of-turin/","cat":"history","title":"Translation: When you come, bring the Shroud of Turin"},{"id":"comment-55871","author":"anonymous","post":"In regard of the facts… Sorry..","date":"2013-12-03","mins":"4:41 pm","url":"https://shroudstory.com/2013/12/03/translation-when-you-come-bring-the-shroud-of-turin/","cat":"history","title":"Translation: When you come, bring the Shroud of Turin"},{"id":"comment-72410","author":"anonymous","post":"If the letters are not real, then there is NO GOOD REASON to suspect the Shroud folded in 8 parts could have been in Edessa. If the letters are not genuine, then the Mandylion (which is a later addition to the legend) has very good chances to be non genuine too. This is pure logic..","date":"2014-01-06","mins":"11:41 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72411","author":"anonymous","post":"And I love the motto of his New Testament class, which is DOUBT EVERYTHING!!! When you are doing real historical research (whether it concern the New Testament, the Shroud or anything else), this is the best motto to keep in mind….","date":"2014-01-06","mins":"11:44 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72412","author":"anonymous","post":"To me, the letters as well as the Mandylion are both forgeries that were probably not done at the same time (the letters clearly pre dates the Mandylion in written accounts) but I really think they both served the same purpose: To back up the “orthodoxy” of the main Church in Edessa and to serve as powerful tools in his fight against heretic movements like the Monophysite Church that was present in Edessa (these people were denying the reality of God’s incarnation in Jesus Christ’s flesh). The historical context of the first few centuries in Edessa strongly suggest that both the letters and the Mandylion were forgeries done for that purpose….","date":"2014-01-06","mins":"11:50 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72416","author":"anonymous","post":"In my mind, what is very important to understand when we try to analyze the probability of Wilson being right or wrong with his idea that the Mandylion was the Shroud folded in 8 parts is the HISTORICAL FACT that the letters were the whole base of the Abgar legend and, only later on (possibly a few centuries later), the whole concept of an « image of Jesus not made by human hands » was ADDED to the original legend. In such context, if all the independent scholars (independent versus the question of the Shroud authenticity) agree to conclude that those letters were not genuine at all, I think the most rational conclusion is to, at the very least, also seriously doubt the possibility that the Mandylion could have been the same cloth as the Turin Shroud..","date":"2014-01-06","mins":"12:48 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72425","author":"anonymous","post":"Since history is not an “exact” science, it is open to all kind of spéculations and many people in the pro Shroud world are experts when it comes the time to turn things around always in favor of the authenticity of the Shroud (at all cost I should say). But take a wide bunch of historians specialized in the first centuries of Christiandom (those from outside the pro Shroud world) and I can assure you that there would not be a lot to buy the idea that the Abgar legend (and the letters that were used to back it up at the same time it was created or a bit later) could, near or far, be rooted in real historic facts related to Jesus of Nazareth and King Abgar V of Edessa because it is a well accepted conclusion that the first Christian church in Edessa only appeared during the second century. Listen carefully to what prof. Dale Martin say about the total absence of any recognition of Jesus Christ by non Jewish kings during the time he preached or even during the first few decades after his death and resurrection, and you’ll understand easily that he’s one expert among a majority of unbiased scholars who don’t trust anything regarding the possibility that the Abgar legend and the 2 « attached » letters could be authentic in any way….","date":"2014-01-06","mins":"3:40 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72426","author":"anonymous","post":"The fact is this: there are absolutely no ancient record of the presence of a burial shroud of Christ in Edessa. Nothing at all. And you seem to dismiss the FACT that the Mandylion was a much later addition to the Abgar legend than the 2 letters. So, again, I’ll ask you : If the letters are false, then why not the Mandylion, who appeared in the legend much later?.","date":"2014-01-06","mins":"3:42 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72433","author":"anonymous","post":"Be careful folks (and Dave), because it is a well known fact that Markwardt, on the contrary to many scholars who doesn’t believe that the Abgar legend, the letters or the Mandylion were genuine, is an active pro shroudie… I don’t say that this necessarily equal “bias”, but personally, when it come to historical researches that can be somewhat related to the Shroud history (like the legend of Abgar and the letters and Mandylion associated with it), I will always tend to give more credit to historians that have no interest whatsoever in questions regarding the Shroud….","date":"2014-01-06","mins":"5:44 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72746","author":"anonymous","post":"I have personally studied this paper and I found out many signs of bias in it. Of course, pro shroudies around here won’t agree with me but I don’t care. Believe me or not, Scavone, just like Wilson and Markwardt are completely biased about this wild hypothesis that the Shroud and the Mandylion were one and the same. No serious historians that are impartial versus the question of the authenticity of the Shroud agree with these people… This speaks to me louder than anything pro shroudies can say on this subject. The bottom line is this: if we want to really trace the Shroud before the middle of the 11 century in Constantinople, we must look elsewhere than in the crazy hypotheses of Wilson, Scavone and Markwardt….","date":"2014-01-09","mins":"11:43 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72749","author":"anonymous","post":"If people don’t believe me, just give me the name of one credible scholar from without the pro Shroud world who agree with Wilson or Scavone or Markwardt… I’m aware of no one..","date":"2014-01-09","mins":"11:51 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72742","author":"anonymous","post":"Great comment….","date":"2014-01-09","mins":"11:39 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72902","author":"anonymous","post":"Wilson’s ideas are not supported by credible scholars because he don’t follow properly the historical method by making wild speculations, extrapolations and suppositions in order to confort his preconceived notions about the Shroud’s early history. Be certain that this is the correct and true reason why his ideas are not supported by credible scholars..","date":"2014-01-10","mins":"11:50 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72916","author":"anonymous","post":"On the contrary to what you say Dave, I really think Wilson know what he’s talking about when it comes to the Abgar legend and the Mandylion, but unfortunatelly, he prefers to believe in the wild extrapolations he made over the years to comfort his personal preconceived notions than to acknowledge the reality with honesty, which is that this relic that was in Edessa is most certainly not the same thing as the Shroud. I think Wilson came to a point where he had gone too far in the defense of his hypothesis so that he can’t retract, even though in the deepest part of his soul, I’m sure he came to realize at one point during his researches as well as me that the Mandylion cannot be the same thing as the Shroud… He simply has not enough balls to say : you know what folks? For the last 35 years or so, I’ve followed a dead end road and I encourage you to start searching a better answer than mine in order to explain rationally the Shroud’s obscure years!.","date":"2014-01-10","mins":"2:16 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72937","author":"anonymous","post":"Dave say : “The Image of Edessa was said not to have been made by human hands!” And I answer: Yeah, yeah, yeah! And one of the two letters related to the Abgar legend was said to have been written by the hands of Jesus in a very good Greek! If you believe everything that the Church of those turbulent years of christianity said, then you’re more naive than I thought… Dave say: Does Anonymous then concede that the Mandylion was some such kind of miraculous image? And I answer: Of course not! I’m not a fool to believe everything the Church is saying as being automatically an absolute truth… I am a free minded Christian who has not put aside his own conscience along the way! I don’t even believe that Mary was a Virgin and there are a lot of other “truths” proclaimed by the Church I don’t believe… Now, concerning the “image not made by human hand” slogan, this was simply what the “orthodox” Church of Edessa wanted to make people believe to support his battle against the heretical groups of Christians that were present in the region of Edessa (namely the Monophysite and Nestorian Churches)..","date":"2014-01-10","mins":"4:49 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72943","author":"anonymous","post":"Probably a Pantocrator like icon of the face of the living Christ… And what was the model for this Pantocrator Christ? I would say, with some prudence, the Shroud image but maybe just indirectly via a sketch or something similar… So, you see, in the end, the Mandylion is important because it is probably the copy of a copy of a copy of the face we see on the Shroud….","date":"2014-01-10","mins":"5:17 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-73095","author":"anonymous","post":"Or simply because depicting gruesome details we see on the Shroud would have been seen as scandalous for the susceptibilities of the era in which the Mandylion and the Pantocrator icon were created… Dave, you remind me a great deal of Wilson in the sense that you seem to forget good and important parts of the historical context in which those images of Christ came to be known publicly, especially the fact that, in those days, depicting a bloody and suffering Christ was not at all part of the normal way to depict him and the fact that, in those days, around Edessa, there was a big battle that was raging between the Orthodox Church and some heretic movements like the Monophysites and the Nestorians… All those things could explain very well the making of a false relic like the Mandylion by the Orthodox Church of Edessa and can also explain very well why the Mandylion face was showing a living Christ without injuries or bloodstains. Also, concerning this last topic, you MUST also consider the FACT that all the versions of the Abgar legend up until the so called discovery of the Mandylion in Edessa (probably during the second half of the 6th century) ALWAYS located the action BEFORE the Passion of Christ! Again, it’s a big point you seem to forget in your analysis! In such a context of a miraculous image supposedly done by Christ before his Passion, don’t you think it is normal that the forger was not inclined to had bruises and bloodstains on his painted image of Christ, even though it is possible that he based is work on the Shroud image? I really think so! In that context, every time, I will expect to see an image of the living Christ with his eyes wide open and that’s exactly what we could see on the Pantocrator icon and on all the Mandylion depictions..","date":"2014-01-11","mins":"7:20 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-73094","author":"anonymous","post":"What is much less consistent though is the FACT that EVERY depictions of the Mandylion ALWAYS show the face of Christ without any signs of injuries or bloodstains… Can we please start looking at other possibilities to explain the Shroud’s obscure years? The Mandylion, the Mandylion, the Mandylion… There are other possibilities folks..","date":"2014-01-11","mins":"7:07 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-73097","author":"anonymous","post":"Here’s a suggestion for all of you who want to comment on historical topics related to the Shroud: Do your homework before writing and try to ALWAYS keep in mind the socio cultural and religious CONTEXT of the time. Or else, you will have great chances to completely miss the target… Any good historical research is always based on the context of the time..","date":"2014-01-11","mins":"7:32 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-73182","author":"anonymous","post":"Answer: I highly recommand that you read this previous comment of mine: https://shroudstory.com/2014/01/06/yannick clment on the letters between jesus and king abgar/#comment 73095 Important note: the historical context I refer is the one that prevailed around the time the Pantocrator and the Mandylion came to be known (during the 6th century) and not the context surrounding the transfer of the relic from Edessa to Constantinople in 944….","date":"2014-01-12","mins":"7:49 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-73243","author":"anonymous","post":"Considering the historical context in which the Mandylion come to be publicly known, it is possible that, at first (at least during the 6th century and maybe during the 5th century), the painted image on a towel was considered as such: i.e. A painted image of Christ done by the official artist of king Abgar (this is in the first versions of the Abgar legend) and then, it is possible to think that the whole concept of an image “not made by human hands” came to light only around the start of the iconoclast debate inside the Church, at the beginning of the 8th century. Of course, we talk about suppositions here (but suppositions that were proposed by serious historians), but this would fit nicely with the evolution of the Abgar legend during these centuries..","date":"2014-01-13","mins":"4:28 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-73244","author":"anonymous","post":"In other words: At first, the image of Edessa would have not been considered miraculous at all but manmade (which fits with the first few versions of the Abgar legend) and then, a long time after this, when the iconoclasm debate was starting in the East, those Inside the Church who wanted to preserved the holy icons would have invented the concept of an image “not made by human hands” concerning the Mandylion. This “tag” would have helped them to comfort their position by saying that God himself wanted the presence of holy icons inside the Church. This is a true possibility that is far more possible regarding the known historical context of the time (and the known evolution of the Abgar legend) then to think the Mandylion was the Shroud folded in 8, while no one in Edessa would have ever found out the truth about it!.","date":"2014-01-13","mins":"4:35 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-73250","author":"anonymous","post":"Look at fact #9 in this very good paper: https://shroudofturin.files.wordpress.com/2012/06/clc3a9ment questions about the mandylion hypothesis of wilson 2012 06 28.pdf First, this is, for me, one of the main historical fact that clearly indicate that the Shroud and the Mandylion were two separate objects and second, this is one important clue that tell us that, at the beginning of the 8th century, there were people Inside the Church who were aware of the presence of a relic known to be the Shroud of Christ. But, of course, the question that remains is: Was this shroud the same as the one in Turin? There is no way to be sure about that since Damascene did not describe it. Nevertheless, if we presume this was the same Shroud, we can think that around the time the Mandylion came to be known publicly (around the 6th Century), it is truly possible that the authentic Shroud of Christ was kept and well preserved by the Church elsewhere (probably around Jerusalem at that time, since we have no record of a shroud of Christ in Constantinople before the middle of the 11th Century). The testimony of Arculf (around 670) seem to confirm a bit more this possibility. And if this is true, then we must assume that this Shroud was not often exposed publicly to veneration because there is absolutely no record from that era which talks about a Shroud of Christ with a body image and bloodstains on it….","date":"2014-01-13","mins":"5:42 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-73314","author":"anonymous","post":"Quote: “Although largely abandoned, it makes sense, after a few assumptions, but I find Mandylion track more reliable.” Answer: If you read well the point #9 of the paper written by Yannick Clément, how in the world can you still favored the Mandylion hypothesis? Don’t you realize that, at the beginning of the 8th century, while the Mandylion was still present in Edessa and, if we believe Wilson, no one was supposed to know that it was the real Shroud folded in 8, there were people in the Church (like St John Damascene) who were aware of the presence of a Shroud of Christ as a relic venerated by the faithful (Damascene don’t say where this veneration was taking place but this cloth had nothing to do with the Mandylion), while at the same time, who were also aware of the presence of the Mandylion in Edessa as a DIFFERENT cloth not related to the Passion of Christ? This testimony of Damascene is impossible to discard for all the partisans of Wilson’s wild ideas and that’s why no one ever talk about that, not even Wilson himself (to my knowledge)….","date":"2014-01-14","mins":"11:44 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-73313","author":"anonymous","post":"I’m not Yannick… I’m his phantom. I said it many times….","date":"2014-01-14","mins":"11:29 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-73315","author":"anonymous","post":"The main point I try to make here is this: While Wilson and others pro shroudies think that the various changes that occurred over the centuries concerning the Abgar legend were due to a progressive understanding of the real nature of the Mandylion (which would have been the Shroud of Christ folded in 8), I propose that most of these changes (if not all) took place because of the evolution of the theological views and battles that were going on inside the Church and in particular, in the region of Edessa, and later on, after the Mandylion came in that city, in Constantinople..","date":"2014-01-14","mins":"11:47 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-73316","author":"anonymous","post":"Here’s a complementary question concerning my previous post : If Wilson was correct and the various changes of the Abgar legend were due to a progressive understanding of the real nature of the Mandylion, then why in the world there is absolutely no version of the Abgar legend that clearly indicate that this cloth was a burial cloth and why there is absolutely no version of the Abgar legend that locate the miraculous imprint AFTER Jesus death on the cross? And why there is absolutely no depiction of the Mandylion that show bruises and bloodstains? If the understanding of the real nature of the relic would really have increase over the centuries, there is absolutely no doubt in my mind that, at some point, the truth would have come out regarding the burial aspect of the relic! Since you can’t find anything clear about that anywhere (whether in art or in written sources), then we must conclude that the Mandylion was not showing any signs of the Passion of Christ and therefore was not the Shroud of Turin… To me, this is clear..","date":"2014-01-14","mins":"12:48 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-73479","author":"anonymous","post":"Quote: “Anyway, the testimony of Damascene does not solve here anything, and does not exclude the possibility of Mandylion being TS.” Answer: Oh yes it does and very well! Why? Because Damascene doesn’t included the Mandylion in his list of relics related to the Passion! For Damascene, the Mandylion was related to an event in Jesus life before his death, just like the legend told us… From the Damascene writings alone (and even more when you take all the other evidences together as a whole), it’s EVIDENT that the Mandylion was just like the copies we have, i.e. An image of the LIVING Christ, which had nothing to do with his death and burial. But of course, since we don’t have the original Mandylion no more, everybody can take such good pieces of evidence and found a way to save Wilson’s idea… And you’re free to do so. But I will never follow you on this track. There are just too many solid pieces of evidence that the Mandylion had nothing to do with a burial shroud and too many very good clues that Wilson is not always honest in his inquiry that I’m far from being ready to accept his conclusion….","date":"2014-01-16","mins":"5:39 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-73545","author":"anonymous","post":"The thing is this: If you take the writings of Damascene and you compare them with the Acts of Thaddeus, you find out that BOTH AUTHORS made a CLEAR DISTINCTION between the cloth that received the imprint of the face of the living Jesus (Mandylion) and the burial cloth(s) that was(were) found in the empty tomb! And I really don’t think this is due to the idea that both authors were mistaken by the reality of the Mandylion… You read those texts (which were writen by Christian authors that surely had a good idea of what was the Mandylion and what was the burial cloth(s) of Jesus) and it is EVIDENT that, for BOTH WRITERS, the Mandylion was a small towel showing the face of the living Christ without any marks of injuries or bruises and that such a cloth had NOTHING TO DO with the burial cloth(s) that was(were) found in the tomb and this is in total agreement with all the depictions of the Mandylion that have survived to this day. I don’t think we have to go further to understand that the Mandylion was NOT the Shroud of Turin. Now, was it the same cloth as the one we found in the Arculf account? This is impossible to say. We’ll never know, unless a new important discovery could be done, which would give us some clue. Personally, I think the dimension given by Arculf for the Shroud of Jerusalem is interesting and should be seen as a potential clue to believe that, in fact, it really was the Shroud that was kept there. But, again, in the present state of our knowledge, we can tell for sure..","date":"2014-01-17","mins":"11:46 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-73546","author":"anonymous","post":"We can’t tell for sure… sorry..","date":"2014-01-17","mins":"11:50 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-73550","author":"anonymous","post":"I have a friend in France who is doing right now an extensive research on the subject and, after a while, he came out with the conclusion that, instead of being due to a progressive improvement in the understanding of the real nature of the Mandylion (Wilson’s idea), the numerous changes concerning the Abgar legend that we can detect over the centuries (including the introduction of the whole concept of an image “not made by human hands”) are most probably due to the evolution of the theological views of the orthodox Church in the Middle East, along with the great battles and debates that were going on between this Church and the various heretical groups of Christians that were living in the same region. From an historical point of view (which take into account the religious and socio cultural context), such a conclusion is the most probable and, therefore, the idea that the Mandylion was the Shroud folded in 8 and that a progressive understanding of the real nature of the cloth would have caused many changes in the Abgar legend doesn’t stand. I agree 100% with such a conclusion….","date":"2014-01-17","mins":"12:49 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-79108","author":"anonymous","post":"This was written many centuries after the time of Jesus and this apply to Jews who killed other Jews. There is no ancient reference (to my knowledge) that clearly mention that the Roman authorities in Judea were allowing the family of someone they executed legally to buried him in a family tomb. Would like to see such a mention somewhere in a manuscript dated before the end of the second temple….","date":"2014-02-13","mins":"5:36 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"}]
