[{"id":"comment-52276","author":"anonymous","post":"In the image you created, there are obvious zones real dark and other zones much more pale. This microscope photo came from which one? And is it possible to have 2 photos side by side to compare the result at fiber level of a very dark zone and a much paler zone? In my mind, it is theoretically impossible for a technique like that, to produce the same very subtle coloration at fiber level in both a dark zone and a pale zone. Remember that on the Shroud, that’s exactly the reality of the coloration at fiber level. No more penetration and the same kind of subtle yellowing of each colored fiber, no matter if this fiber come from a dark zone or a much paler zone..","date":"2013-11-21","mins":"11:50 am","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-52277","author":"anonymous","post":"Note: When I say “In the image you created”, of course I mean the body image of Jesus coming from a crucifix. I did not mean the microscopic image above….","date":"2013-11-21","mins":"11:51 am","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-52393","author":"anonymous","post":"In the end, even if by whatever miracle Colin would come up with a scorched image presenting all the characteristics of the Shroud image, I would still believe 100% that this is not how the Shroud image was produced. Again, what make me so confident about that is the evidence coming from the blood and serum stains. I just can’t see a forger taking a real bloodstained burial cloth and making a perfect body image (forensically speaking) around those stains without disturbing or damaging them and which would look in perfect sync with those biological stains. This kind of scenario is far beyond what my rational brain can take..","date":"2013-11-22","mins":"11:48 am","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-52394","author":"anonymous","post":"Complement: I would summarize my thoughts like this: The Shroud image can look like a light scorch but I’m certain that it is not..","date":"2013-11-22","mins":"11:50 am","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-52402","author":"anonymous","post":"I don’t care what you believe Hugh. I don’t care at all. You can believe that an elephant can fly. I don’t..","date":"2013-11-22","mins":"12:32 pm","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-52404","author":"anonymous","post":"To answer your question: Since Adler, Baima and a bunch of forensic and medical experts all agreed to conclude that the blood and serum stains on the Shroud came from a highly traumatized person (most certainly the Shroud man itself). Sorry for you Colin, nice try! But you just cannot throw all these positive conclusions on the garbage. You just have no right to do so… Unless you could give us a sure proof that all those experts were wrong in their analyses (visual, chemical, spectral, etc.). I know you can’t. Maybe a future series of direct tests on the Shroud could do this, but I just don’t see this happening..","date":"2013-11-22","mins":"12:36 pm","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-52405","author":"anonymous","post":"By the way, I still wait for you to show me side by side 2 microscopic images from a very dark and a very pale area..","date":"2013-11-22","mins":"12:40 pm","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-52282","author":"anonymous","post":"Unlike some persons around here think, someone doesn’t need to have a Phd to make rational reflections and to ask pertinent questions….","date":"2013-11-21","mins":"12:25 pm","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-52442","author":"anonymous","post":"Quote: “It’s beyond anyone’s rational brain. This is why Colin, Hugh, etc believe the ‘blood’ stains were applied after the image was created.” EXACTLY RIGHT DAVID! And guess what? To do just that, Colin, Hugh, etc., while constantly saying they are real scientists, have to go AGAINST THE ACCEPTED FACT THAT THERE IS NO COLORATION UNDER THE BLOOD AND EVEN UNDER THE SERUM STAINS. Not great for supposed scientists… If there would be some conflicting evidence about this topic, they would have the right to disagree with Adler’s conclusion, but right now, no one who analyzed the Shroud up, close and personal has ever found coloration under a blood or a serum stain. Because of this, we have no good reason (except if you really want to defend a man made forgery hypothesis at all cost) to doubt such a conclusion that the blood was on the cloth first, then the body image was formed..","date":"2013-11-22","mins":"5:38 pm","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-52443","author":"anonymous","post":"The best question Chris is this: Why a medieval or more ancient forger would take such a complicated technique to forge a very faint body image, while a painting would have done the job and why there is no other image like that from the same period in the history of art? Just asking the question show you how crazy this scenario really is..","date":"2013-11-22","mins":"5:43 pm","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-52283","author":"anonymous","post":"By the way, you should tell us from where exactly the photo above came (a pale zone or a dark one)?.","date":"2013-11-21","mins":"12:27 pm","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-51440","author":"anonymous","post":"Interesting image that can look a bit like the Shroud, BUT… WHERE ARE THE BLOOD AND SERUM STAINS??????????? If someone pretend to replicate the Shroud, he MUST replicate not only the body image but the blood and serum stains and I really don’t know how Colin will manage to do that. ; ) I’ll say it again and again: The evidence coming from the blood and serum stains alone is enough to reject any form of man made forgery concerning the Shroud image, including the use of a scorch technique. PERIOD..","date":"2013-11-15","mins":"9:33 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51467","author":"anonymous","post":"I see it and was disappointed that you still put the “bizarre spectal properties” of the bloodstains again on the table to try to deny the fact that there is real bloodstains on the Shroud. This is like using only the C14 result to dismiss the Shroud’s authenticity while forgetting all the others data that all point in favor of authenticity. The blood on the Shroud is blood BUT IT IS NO ORDINARY BLOOD! When are you going to understand this? It is exudates of highly traumatized blood clots that include a high level of bilirubin, which not only have influenced the visible color of the stains (redder than normal aged blood) but most probably also the spectral properties of it. And think about that: because of the fact that the Shroud’s blood is no ordinary blood, if the spectral properties of the Shroud’s bloodstains would end up being normal, that’s when we would have some reasons to be doubtful! But since the spectral properties as well as the visible color of the blood and as well as the chemistry of the blood are all extraordinary versus the idea of a normal blood that would have stained the cloth in liquid form, I don’t see any problem at all with the fact that the spectral properties of the blood on the Shroud seem to be abnormal. Not at all and I think you should feel the same..","date":"2013-11-15","mins":"11:54 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51443","author":"anonymous","post":"Ho I forget one important point : If Colin is crazy enough to think he can replicate the blood and serum stains that are on the Shroud in a so perfect manner that he could fool every medical and forensic experts, I remember him that first, he must create a new image because we know for a FACT that the blood and serum stains were on the cloth BEFORE the formation of the image. If someone (Colin or anyone else) pretend to be serious about repoducing the Shroud, he TAKE INTO ACCOUNT EVERY DATA coming from the Shroud and replicate all of those PERFECTLY. Or else, I’m sorry to disappoint you but you cannot pretend to any kind of success and surely, you cannot use words like « replicate » or « reproduction » or something of the same nature because your work is not..","date":"2013-11-15","mins":"9:40 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51463","author":"anonymous","post":"No it is the Phantom of Yannick! ; ).","date":"2013-11-15","mins":"11:46 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51470","author":"anonymous","post":"Of course he did! Read this paper please: http://holyshroudguild.org/uploads/2/7/1/7/2717873/2013 01 10 yannick clment reflections on ray rogers shroud work.pdf Use the “research engine” with the word “scorch” and you see a ton of quotes in Rogers’ writing where he completely put aside this particular hypothesis. And remember that he check this very close because, at first, he thought that the Shroud image could well have been created that way. But after a long analysis of all the pertinent data, he came to the conclusion that we must definately reject this hypothesis. Note that he don’t even used the “bloodstains” argument like I do to dismiss this particular hypothesis, which is very telling….","date":"2013-11-15","mins":"12:26 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51471","author":"anonymous","post":"Complement: very telling that the Shroud image is certainly not the product of a scorch. (that’s what I meant).","date":"2013-11-15","mins":"12:28 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51476","author":"anonymous","post":"Regarding the uniqueness of the Shroud, you must look at the whole picture David, which include the blood and serum stains (most of them coming from exudates of highly traumatized blood). It’s only when you consider the presence of the Shroud body image AND the blood and serum stains together on one single piece of cloth that was certainly used at one point in its history to covered the dead body of a crucified man that it’s alright to say that the Shroud is unique in the world… Always keep in mind this advice: Always remember the whole picture given by all the data when you analyze one specific property of the Shroud… It’s very important to do so..","date":"2013-11-15","mins":"12:48 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51477","author":"anonymous","post":"Important additional note : IT’S NOT BECAUSE THE SHROUD IS UNIQUE IN THE WORLD THAT THIS RELIC CAN BE USED TO BACK UP THE IDEA THAT IT MUST BE DIRECTLY RELATED WITH JESUS RESURRECTION!.","date":"2013-11-15","mins":"12:59 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51487","author":"anonymous","post":"I want to say to Hugh and anyone else that the most compelling evidence that the blood on the Shroud is real blood is the simple fact that almost every medical and forensic expert who have analyzed the Shroud closely have all conclude that it is blood (especially while taking into account the presence of serum around most stains) and that the blood flows are perfectly consistent with someone who died in the vertical position of crucifixion and who was transferred to a tomb and laid in the Shroud in an horizontal position. To me, all this speak truth much louder than anything else. No forger could have succeed to artifically formed those bloodstains… These could not have come from anything else than a real crucified corpse..","date":"2013-11-15","mins":"2:01 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51503","author":"anonymous","post":"Your disbelief of what is as obvious as the nose in anyone’s face is discouraging Hugh and I don’t have any more time to lose trying to show you all the solid data that PROVE (yes, prove) the blood is blood. And I really don’t know how you can deny the FACT that there are serum stains around most stains. This FACT was first described by Barbet and it has been confirmed by Miller and Pellicori UV analyses..","date":"2013-11-15","mins":"4:27 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51504","author":"anonymous","post":"Serum stains: their presence has also been scientifically confirmed by Adler’s chemical analyses. I don’t know why you still want to deny obvious facts like that, which are the most solid and compelling evidences that the Shroud is a real burial cloth of a real crucified man..","date":"2013-11-15","mins":"4:28 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-49025","author":"anonymous","post":"Read this please: http://www.shroud.com/pdfs/n74part3.pdf This has been written by Italian nuclear physicists who are real experts in radiations and their possible effects. These researchers have carefully analysed all the most pertinent data coming from the Shroud and have concluded, just like Ray Rogers, that only a very mild and NATURAL process involving some form (still undetermined) of a weak release of energy from the corpse (heat and/or post mortem gases are the most probable scenarios for these experts) could have caused the formation of the very superficial and discontinuous image on the Shroud. Here’s one important part of their paper: “Successively, we have shown that the natural mechanism that led to the latent image is able to explain the chemical and physical characteristics of the Shroud body image[8]. This confirms that the attempts described in [3,4] produce images that are different from that obtained by a natural process [1,8].” Now, we got not only Rogers (who was a great expert in radiation) who say to us that we can forget any hypothesis involving some form of man made forgery or some form of supernatural process involving a form or another of energetic radiation but you also got some true experts in radiation from Italy who are completely INDEPENDENT from Rogers and who reached the VERY SAME CONCLUSION! I think the Shroud world should open up his mind a little bit more and listen carefully to what those Italian EXPERTS (no wanna bes there) have to say, while also keeping in mind what Rogers had to say about the Shroud image….","date":"2013-10-28","mins":"4:53 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49472","author":"anonymous","post":"“do you think he would discount Colin’s experiments or theories?” OF COURSE!!! Read this paper please: http://shroudnm.com/docs/2013 01 10 Yannick Cl%C3%A9ment Reflections on Ray Rogers Shroud Work.pdf And especially all the quotes concerning the FACT that the Shroud image is NOT a scorch. Why Rogers would lose one minute (if he was here today) testing something he has already tested and anlayzed carefully and came out convinced it was NOT consistent with all the known characteristics of the image? All the quotes in the paper above are there to prove my point! And by the way, I think you should read again this other good paper: http://www.shroud.com/pdfs/n76part5.pdf You’ll see that the evidence coming from the bloodstains ALONE are enough to discard any man made forgery (at least, if you use your judgment correctly). Why is it so? Read again this previous comment of mine: https://shroudstory.com/2013/10/28/of those big meaning words superficial half tone and striated/#comment 49196 You’ll see that once you accept the fact that the bloodstains on the Shroud really came from a crucified man (most certainly the same as we see the image on the cloth), then any kind of man made forgery scenario become ludicrous!!!! Finally, I think you should always keep in mind this truth: Rogers’ most important conclusion versus the image (which was indepedently confirmed later on by true experts in radiation named Fazio and Mandaglio) is this one (at least, to me): he was categorical on one point: the Shroud image, with all its very particular characteristics (especially the discontinuous distribution of colored fiber in the image area and the extreme superficiality of the colored fibers), cannot be the result of any kind of high energetic radiation, nor of a scorch. Now, you’re free to believe the claims made by others, but personally, I have no reason to doubt this expert conclusion, especially because it has been, since, completely backed up by 2 other experts in radiation who have studied the Shroud image carefully for at least a decade now..","date":"2013-11-01","mins":"3:46 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49476","author":"anonymous","post":"I have just one advice to you David since it’s evident that you have no preconceive ideas about the Shroud and that you only seek truth regarding this relic: Try to always keep in mind the whole picture of the Shroud even when you will look a some tiny détails. And this whole picture tells you that the Shroud is not a man made forgery (the only forgery it can be would be through the use of a real crucified corpse that would have beared all the stigmata of Jesus), nor the product of a high energetic radiation. Those “theories” simply do not fit with the whole picture given by the data collected by STURP and some other reliable researchers. We must look elsewhere for a proper answer and this “elsewhere” MUST be related with a natural phenomenon most probably in direct link with the biological state of the Shroud man’s corpse during the time he was enveloped into that cloth (no more than 48 hours). I’m affraid there is no other viable road to follow if someone really want to find truth regarding the image formation. Rogers knew this and he was one of the first to really try some lab testings to check out his Maillard reaction and the truth his this: HE SUCCEED to reproduce the kind of coloration we see in the image area on the Shroud with a linen sample prepared the old fashion way and some release of ammoniac gas, which is truly interesting (see his book for details). Of course, he did not succeed to reproduce an image with all the characteristics of the Shroud but this was a great step in the right direction. Other researchers should follow Rogers’ footsteps and verify his ideas about the image formation more deeply. If someone would do this properly, I think we could have some nice (at least to some people) surprise! Note: One thing I wonder about the result of coloration obtained by Rogers is if his colored sample made of linen was showing a discontinous distribution in the colored area. There’s nothing about this important aspect of the question in his book… But since Rogers presented this result as being a good match with the image area on the Shroud, I have to guess it was the case. Anyway, I would love to learn the real truth about that..","date":"2013-11-01","mins":"4:43 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49130","author":"anonymous","post":"Daveb, here’s what Fazio, Mandaglio and Rogers (all true experts in radiations) would tell you: It is simply impossible, theoretically speaking, to get the kind of extremely superficial and discontinuous distribution of yellowed fibrils that we see in the image area on the Shroud with any known form of energetic radiation. Why? Simply because these kind of processes are much too strong to achieve such a particular result. Same thing for the scorch hypothesis of our friend Colin Berry..","date":"2013-10-29","mins":"4:41 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49123","author":"anonymous","post":"If you’re still waiting, it is truly possible that it’s simply due to the fact that no one ever dared to beat, scourge, torture and crucify a man and than, to place it loosely without any straps inside a linen burial cloth made with the ancient method of manufacturing linen cloths and wait between 24 and 36 hours before removing the body… Reproducing a very complex biological process that was initiated by a weak release of energy coming from a fresh tortured corpse is not what I call an easy task….","date":"2013-10-29","mins":"3:51 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49124","author":"anonymous","post":"Colin, once you will succeed to reproduced a body shape on a linen cloth with your method, I really wonder what you will do to reproduce on a linen cloth all the different kinds of blood and serum stains that are visible on the Shroud with a high level of fidelity….","date":"2013-10-29","mins":"3:54 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49196","author":"anonymous","post":"But if the bloodstains are real bloodstains coming from a real crucified body, don’t you think the most probable scenario for the formation of the image must be related to some form of energy naturally released by this dead body? We know for a fact that the bloodstains were there BEFORE the image. In this context, I don’t see any possible scenario involving a forger except a forgery scenario involving a forger taking a real crucified body in order to produced a false relic of the Passion of Christ with his bloody stigmata plus a body image, which, in such a context, could well have been produced naturally BY ACCIDENT. But you should agree with me that such a scenario is far from being more probable than the one involving the natural formation of the bloodstains and the body image by the dead body of Jesus of Nazareth after his entombment. Note: this scenario do not necessarily imply any supernatural event related to the Resurrection, but it COULD..","date":"2013-10-30","mins":"8:29 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49212","author":"anonymous","post":"It’s almost always the same thing in Shroud research: people always commit the very huge mistake of considering the body image separately from the blood and serum stains. Since these biological stains confirm the fact that there really was, for a short period of time, the dead body of a tortured man in that cloth, I don’t see any good reason to look elsewhere than some undetermined natural process for the formation of the body image that is certainly related to the biological state of the Shroud man’s body. And if you don’t agree with me about this, that would mean you believe that a forger would have created manually the image from the already bloodstained burial cloth of a crucified man (all this without disturbing the stains) or he would have created manually the image first and then, he would have used the real and fresh corpse of a crucified man to produce by direct contact the blood and serum stains “in sync” with the image (and all this from clotted blood on the skin and not from free blood in liquid form)? Seriously, if you don’t agree with my first statement, that’s the kind of highly improbable scenarios you’re forced to rely on. And if you really want to rest your case on this kind of highly illogical hypothesis, I would be forced to put your judgment of scientist in question….","date":"2013-10-30","mins":"11:10 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49233","author":"anonymous","post":"Colin, I would like you to answer the previous comment above. In fact, I would like to learn if you really believe in one of the two scenarios I describe in case the Shroud image would have been produced manually by a forger… I’m very curious to learn if you really believe such a ludicrous scenario..","date":"2013-10-30","mins":"2:08 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49221","author":"anonymous","post":"It’s incredible to see how people don’t want to agree with the facts. Both bloodstains and body image are in total sync with the scenario of an enshrouded body. It’s ludicrous to deny that fact. Try something else please. First thing you should try is to seriously consider the two ludicrous options that are left if you deny this basic fact. Then, if you still want to believe that a forger could have manually produce the Shroud image with all its forensically perfect blood and serum stains (remember that this is a strong indicator of exudates of blood clots and not fresh liquid blood), it’s your liberty and I won’t say a word..","date":"2013-10-30","mins":"1:04 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49225","author":"anonymous","post":"The whole picture draw by all the most solid facts and observations collected by STURP (not by Colin Berry or Hugh Farey or me) points directly in direction of a naturally produced image and bloodstains, which both came from the presence for less than 48 hours of a tortured and crucified dead body inside the cloth. You can say or think what you want but, in the present state of our knowledge about the relic, you will never be able to change this REALITY. Of course, if future researches can prove the STURP team was wrong about some aspects of the relic, that could change one or two things. But presently? No way. And seriously, I would be very surprise if a new series of direct research would prove the STURP team was wrong on the most important aspects of the relic..","date":"2013-10-30","mins":"1:41 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49232","author":"anonymous","post":"One important precision : So far, there is, in my mind, only one important conclusion of STURP that is probably false and that only future researches on the cloth could prove : the chromophore. I seriously think there are very good reasons (ghosts, banding effect, confirmed presence of starch in the non image area, historical reliability concerning the ancient method described by Rogers that would have left a layer of impurities on top of the cloth, etc.) to believe Rogers was correct later on when he conclude that the image is only residing in a thin layer of carbohydrate impurities instead of being located inside the inner structure of the linen fiber itself (like the STURP team thought at the time of their final report). And this make all the difference in the world versus the question of the image formation process that lead to the presence of the body image on the cloth. But again, as I said, only a new series of direct tests could settle this question once and for all..","date":"2013-10-30","mins":"2:06 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49227","author":"anonymous","post":"I’m not Yannick. I’m just his phantom… ; ).","date":"2013-10-30","mins":"1:44 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49231","author":"anonymous","post":"Phantom in french spells “fantôme”… ; ).","date":"2013-10-30","mins":"1:54 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49228","author":"anonymous","post":"Seriously, forget who speaks and please concentrate on what his said by this person… Is it dumb or not? Is it highly probable or not?.","date":"2013-10-30","mins":"1:45 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49243","author":"anonymous","post":"Quote : “the reflectance spectrum of the blood simply doesn’t match the reflectance spectrum of… um… blood.” Adler and Baima Bollone’s testing proved that this is real blood (on the Shroud and also on the Sudarium of Oviedo and also on the Tunic of Argenteuil). There is no good reason to deny this basic fact. So, it is real blood material BUT not complete blood that would have stain the cloth in liquid form. When people will finally understand this important aspect of the question? On the Shroud, it is not complete blood that has stained the cloth in liquid form but exudates of blood clots. I’m sure this can account for the particular reflectance spectrum. And seriously, if you prefer to rely on the reflectance Spectrum for the blood issue more than on the chemical tests that were performed by true experts, it’s your liberty. I will certainly not fall into that trap. And if I’m right, there is even one DNA test that was performed in Texas that showed the bloodstains were truly made of human blood material. This test never was recognized by Turin but it was really performed… And for the transfer processes that lead to the formation of the bloodstains and body image, what I meant is this: all the data coming from the Shroud strongly suggest that both processes originated from a real dead body that was covered by the Shroud. That’s what I meant. For the bloodstains, it’s pretty evident that they all came from direct contact between a wooden human body and the cloth it covered and for the image, it was most probably formed at a time the cloth was more loosely draped over the cloth. But in the end, both transfer certainly happened while there was a dead body placed inside this Shroud….","date":"2013-10-30","mins":"3:11 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49247","author":"anonymous","post":"One last thing concerning the reflectance spectrum of the Shroud blood. As you point out yourself talking about the high level of bilirubin that is probably there : these bloodstains come from an highly tramatized person and I’m sure this could also had a huge impact on the resulting reflectance spectrum of those stains. One thing’s for sure : the blood material that composed the Shroud’s bloodstains is very different than some bloodstains that would have been left on a cloth by the blood flowing out in liquid form of the open wound of a normal and non tortured person. And in the end, please consider this : even the color of the blood is unusual for an old blood (especially when it is put under UV light). Does this means the blood is not real human blood? Of course not!.","date":"2013-10-30","mins":"3:28 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49245","author":"anonymous","post":"A very big difference I might add… Quebec language is not even French anymore. It’s more a sort of “slang” language that originated from French..","date":"2013-10-30","mins":"3:13 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49310","author":"anonymous","post":"Thanks for the precision. I wasn’t aware of this. Nevertheless, it would take someone with a big closed mind to not agree with the strong conclusions of Adler and Baima Bollone (2 conclusions made by independent experts) that the blood on the Shroud is real human blood. This is one of the strongest conclusion that came out of the 1978 investigation and I don’t think there’s any good reason to doubt this. We don’t need DNA proof for this, even though it would be, of course, the last confirmation to obtain to put a 100% sure proof over this. Let’s say that, presently, there is something like a 99% proof..","date":"2013-10-31","mins":"8:28 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49316","author":"anonymous","post":"If you’re not sure about my 99% certainty about the human blood conclusion, please read this other comment of mine where I have reprinted a portion of the last paper of Adler on the subject : https://shroudstory.com/2013/10/28/of those big meaning words superficial half tone and striated/#comment 49311 Be certain that an expert in blood like Adler would never have used a tone so confident in his paper if he, personally, would not have been sure about the conclusion that the bloodstains on the Shroud are really composed of human blood and, not only this, but of human blood of someone who was in a highly traumatic state when he shed that blood, which, as Adler was well aware, is totally consistent with the image of a beaten, scourged and crucified man we see on the Shroud..","date":"2013-10-31","mins":"9:02 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49322","author":"anonymous","post":"My “favorite” expert’s conclusion was independently confirmed by another true expert named Baima Bollone. I don’t have any reason to doubt their principal conclusions versus the blood. And if you don’t want to talk about the evidence coming from the bloodstains, maybe it’s because you’re well aware of the fact that this is enough to prove that your own hypothesis on image formation is completely off track versus the reality of the Shroud. The bloodstains alone are telling us that the body image is most probably the result of a direct interaction between the cloth’s surface and a dead body of a crucified man… But obviously, this is not what you want to hear..","date":"2013-10-31","mins":"9:38 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49311","author":"anonymous","post":"For those, like Hugh, who are still uncertain that the bloodstains on the Shroud are really made from human blood because their spectral characteristics are somewhat different than the normal characteristics of ancient blood, I strongly suggest you to read the excellent paper presented by Alan Adler at the International Scientific Symposium of Turin in March 2000. And for those who are unable to put their hand on it, here’s the most relevant part concerning the subject of the spectal characteristics of the Shroud’s bloodstains (emphasis are mine): “An X Ray fluorescence investigation (note: a study published in 1980 by Morris, Schwalbe and London of STURP) was carried out on the Shroud to complement the X radiographic study (note: a study published in 1980 by Mottern, London and Morris of STURP). The blood marks show an element distribution CONSISTENT WITH A BLOOD CLOT EXUDATE, including an iron value elevated over the cloth background value, but no evidence for the presence of mercury or any of the trace elements associated with the mineral forms of iron oxides. This observation SUPPORTS BLOOD MARKS IDENTIFICATION AS BLOOD DERIVED, BUT DOES NOT SUPPORT THE PROPOSAL THAT THE BLOOD MARKS ARE PAINTED MINERAL MIXTURES OF IRON OXIDE AND MERCURIC SULFIDE (VERMILLON). This is IN AGEEEMENT WITH THE CHEMICAL AND X RADIOGRAPHIC CONCLUSIONS (note: that the bloodstains are really made of real human blood material). An independent scanning electron microprobe study (note: a study published in 1981 by Baima Bollone, Jorio and Massaro in Italy) compared one of the blood particles with a control sample of human blood and found AN EXCELLENT MATCH, FURTHER SUPPORTING THESE CONCLUSIONS. Ultraviolet and visible reflectance studies were carried out on the Shroud and also some fluorescence spectroscopy (note: both studies published in 1980; one by Pellicori and the other by Gilbert and Gilbert of STURP). In general, these observations COMPLEMENTED THOSE SEEN IN THE FLUORESCENCE PHOTOGRAPHIC STUDY (note: a study published in 1981 by Miller and Pellicori of STURP). The reflectance spectra of the blood marks from the whole cloth and also a near UV visible microspectrophotometric study of blood particles from the sticky tapes (note: a study published in 1980 by Heller and Adler of STURP) are CONSISTENT WITH THE SPECTRA EXPECTED FOR A TRAUMATIC BLOOD CLOT EXUDATE. In a more recent study (note: a study published in 1998 by Adler, Selzer and De Blase), transmission UV visible spectra of a simulacrum of a TRAUMATIC CLOT EXUDATE prepared from laboratory chemicals MATCHES THESE OBSERVED SHROUD SPECTRA, but the simulacrum of a mineral pigment “blood” composed of iron oxide, mercuric sulfide and gelatin IS A COMPLETE MISMATCH. This CONFIRMS THE PREVIOUS CHEMICAL AND FORENSIC CONCLUSIONS. It is of interest to note that the position of the near UV PEAK FOR ALBUMIN BOUND BILIRUBIN IS INDICATIVE OF THE TYPE OF SPECIES FROM WHICH THE BLOOD ORIGINATES AND IN THESE OBSERVED SPECTRA IS CONSISTENT WITH A PRIMATE ORIGIN (note: see Heller and Adler’s paper published for STURP in 1981 and entitled “A Chemical Investigation of the Shroud of Turin”), IN AGREEMENT WITH THE IMMUNOLOGICAL STUDIES IDENTIFYING A HUMAN SOURCE FOR THE BLOOD MARKS (note: Adler probably refers here to the studies performed by Baima Bollone in Italy). An infrared reflectance examination of the Shroud accompanied the thermographic study (note: a study published in 1980 by Accetta and Baumgart of STURP). Although these spectra were of low resolution, some high and low frequency peaks typical of amide absorptions associated with proteins could be detected in the blood mark spectra, but not in those of the body images. THESE RESULTS WERE CONFIRMED AND EXTENDED in a more recent high resolution microspectrophotometric FTIR investigation of fibers and particles extracted from the STURP sticky tapes (note: a study published in 1996 by Adler). Again, protein amide bands were ONLY OBSERVED IN THE BLOOD PARTICLES AND THE SERUM COATED FIBERS ASSOCIATED WITH THE BLOOD MARKS. Utilizing the spectral analysis capabilities of the computer program accompanying this instrument, which allows one to add or subtract standard spectra of a known molecule to the observed spectrum, testing its presence, IT WAS DEMONSTRATED THAT THE OBSERVED SPECTRA OF THE BLOOD PARTICLES CONTAINED BOTH METHEMOGLOBIN AND ALBUMIN BOUND BILIRUBIN (note: this strongly suggest that the bloodstains on the Shroud comes from someone who was in a highly traumatic state at the time he shed is blood). INFRARED SPECTRA OF THE TRAUMATIC BLOOD CLOT SIMULACRUM CITED ABOVE AGREED WITH THAT OF THE OBSERVED BLOOD PARTICLE SAMPLES (note: he talks about the blood particles coming from a bloodstained area on the Shroud), BUT THE MINERAL PIGMENT SIMULACRUM DID NOT. These results AGAIN CONFIRM THE CHEMICAL AND FORENSIC CONCLUSIONS AND DEMONSTRATE THAT THE BLOOD MARKS ARE NOT PAINTINGS.” Now, after having read this part of Adler’s paper, which was written shortly before the death of this true expert in the chemistry of blood, if you still unsure about the fact that the bloodstains on the Shroud are really made of real human blood and, more precisely, of blood clot exudates coming from an highly tortured man, I don’t know what it will take to convince you! In my mind, this is the strongest fact coming from the whole investigation performed by STURP (and also by Baima Bollone in a completely independent mode)! Yes, the chemical, physical and spectral characteristics of the bloodstains on the Shroud are showing some noticeable differences with normal bloodstains made of liquid blood coming from someone who was not tortured for several hours prior to death (whether it be the chemical composition, the visible color, the spectral characteristics, etc.) AND IT’S TOTALLY NORMAL THAT IT IS THAT WAY SINCE THE BLOOD ON THE SHROUD IS MAINLY COMPOSED OF EXUDATES OF BLOOD CLOT SHED BY A MAN WHO WAS IN A HIGHLY TRAUMATIC STATE PRIOR TO DEATH! This is what can explain the differences versus normal ancient bloodstains that was noticed by other people over the years. I don’t have anything else to say on the subject, except for the fact that this very strong scientific fact coming from the blood is the most solid piece of evidence that support the authenticity of the Shroud as a real burial cloth and, not only that, but as the authentic burial cloth of none other than Jesus of Nazareth! Also, it confirms the principal conclusion of STURP, i.e. That the body image on the cloth must have come from an interaction (supernatural or, more probably, natural) between the burial cloth and the dead and crucified body that was present in it for less than 48 hours. Now, if people don’t want to see what is as evident as the nose in anyone’s face, what can we do?.","date":"2013-10-31","mins":"8:28 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49317","author":"anonymous","post":"Quote: “Fanti and his friends have found that very intense, very short bursts of laser light can do the trick.” Comment: Yes, BUT ONLY for the superficial nature of the image. With lasers, it is THEORETICALLY IMPOSSIBLE to get a discontinous distribution of colored fibers in an image area like we see on the Shroud and this definitive conclusion doesn’t come from me or you but from real expert in the field of radiation named Fazio and Mandaglio. Seriously Hugh, you can forget a burst of high energetic radiation as the cause of the image on the Shroud… The answer to the “mystery” is most certainly much more milder than such an high energetic process..","date":"2013-10-31","mins":"9:06 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49329","author":"anonymous","post":"Quote : “but to claim any proof from the battery of investigations cited above is wildly over egging your pudding” This conclusion don’t come from me! It comes from true experts like Adler and Baima Bollone who analyzed the blood from the Shroud independently from each other. When people don’t want to see the truth….","date":"2013-10-31","mins":"10:47 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49331","author":"anonymous","post":"Note: you seem to suggest that my quotation of Adler’s paper is full of mistake. I have carefully reprinted the entire section of the paper he presented at the International Scientific Symposium of Turin in March 2000 and that we can found in his book about the Shroud. There’s absolutely no mistake there..","date":"2013-10-31","mins":"10:51 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49336","author":"anonymous","post":"And for you, what the composition of the Shroud’s “bloodstains” then? Just curious… Sorry, but I don’t have followed this blog very much until the last few days. I’m not familiar with your conclusions. Last thing: The independent confirmation of Adler’s conclusions by Baima Bollone should be enough for you to consider a serious revision of your own conclusion on this subject….","date":"2013-10-31","mins":"11:27 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49337","author":"anonymous","post":"“Blood can wait for another day.” But one day, you will have to address this topic and you will have a great difficulty to make believe that a forger could have produced the Shroud image with anything else than a real crucified corpse..","date":"2013-10-31","mins":"11:29 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49339","author":"anonymous","post":"People around here plays with words in an incredible way! To me, a true expert in one particular field is someone who is a professional in this field. Nothing more, nothing less. This doesn’t imply that this person cannot make some mistakes of course. In the case of Adler, he was a true expert in blood because he was a profesionnal scientist who worked all his life in this domain. So, he should knew what he was talking about when it comes to blood. Same thing for Fazio, Mandaglio and Rogers : there are all experts in the field of radiation (unlike Fanti by the way), simply because these 3 scientists have worked all their life in the field of radiations. So, because of that, they all knew radiations and their possible effects much better than the vast majority of Shroud researchers..","date":"2013-10-31","mins":"11:38 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49343","author":"anonymous","post":"And what do you make of all the data coming from both forensic and chemical investigation supporting the conclusion that the blood is real human blood from a highly traumatized person? You cannot leave that aside. By the way, can you please answer this simple question: for you, what is the most probable composition of the Shroud’s bloodstains ? Medieval paint?.","date":"2013-10-31","mins":"1:05 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49355","author":"anonymous","post":"I completely disagree. Almost every forensic experts agree to say that the bloodstains match perfectly the body image on the cloth. And the FACT that there are serum stains around most bloodstains, along with the form of most bloodstains (thicker at their borders) is a confirmation that Barbet was correct regarding the kind of transfer (exudates of blood clots), which match perfectly with the gospel accounts in the sense that it is highly probable that the body didn’t reached the tomb very soon after death because 1 Jesus died before the others and 2 Joseph had to ask permission to remove the body and bury it and 3 This burial was totally unprepared. For all these reasons, it is highly probable that most if not every bloodstains (except the post mortem blood that could have been released by the open wounds during the transfer of the body to the tomb and after the enshrouding) had enough time to clot to a certain level before they came in contact with the cloth. And seriously, if the blood on the Shroud would come from anything else than the crucified body who left an imprint on the cloth, why in the world would there’s be a level of bilirubin much higher in that blood? Seriously, we have no good reason to doubt Adler’s conclusion, which, again, we’re independently confirmed (for the most part) by Baima Bollone. Also, the fact that these conclusions confirms the majority of the hypotheses proposed by Barbet in the 1930s is another important fact to keep in mind, which also suggest that Adler and Baima Bollone’s conclusions are correct..","date":"2013-10-31","mins":"3:41 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49356","author":"anonymous","post":"Last comment from me: in every other field of science, the conclusions of Adler and Baima Bollone for the blood (i.e. That the blood is real human blood and that it came from an highly traumatized person) and the conclusions of Rogers, Fazio and Mandaglio for the image (i.e. That no energetic radiation that we know could have formed the kind of superficial AND discontinuous image we see on the Shroud) would have been acknowledge for a long time. But of course, in the Shroud world, those who don’t want the Shroud to be authentic will ALWAYS put in doubt the first conclusion (i.e. The one concerning the bloodstains) and those who don’t want the image to have been formed naturally (i.e. The supernatural fanatics) will ALWAYS put in doubt the second conclusion (i.e. The one concerning the image formation)..","date":"2013-10-31","mins":"3:47 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49357","author":"anonymous","post":"I should add that there is another group who don’t want the image to have been formed naturally and it’s the gang (Colin is one of the primary member of that group) who still believe (I still don’t understand how someone can still believe this) the image is the product of a man made forgery..","date":"2013-10-31","mins":"3:49 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49364","author":"anonymous","post":"I have read this and, seriously, this is not worthy of a scientist. Disregarding the strongest fact about the Shroud (independently confirmed by Baima Bollone I remind you again) is ludicrous and prove that you don’t want to see the reality in face. If you want so much the Shroud image to have been created by a forger, I really think you only got one credible (even though it is not probable) scenario left to you: a “natural” forgery involving the use of a real crucified body in order to create false bloody stigmata of Christ on a real shroud and maybe also in order to create the body image we see, even thought it’s far from being evident that such a forger would have been aware that a body image would have come out of his project..","date":"2013-10-31","mins":"4:48 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49366","author":"anonymous","post":"You can believe what you want. Once a new series of tests will confirm Adler and Baima Bollone’s conclusion for the blood and Rogers, Fazio and Mandaglio’s conclusion versus the image, then what? I will tell you what will happen: You will see again the same crap coming out of close minded people like Berry and others who simply don’t want the Shroud to be the authentic burial cloth of Jesus of Nazareth and who don’t want the image to have been formed naturally. Because those people will never accept the truth of the Shroud, they will still deny the most solid facts regarding the relic, no matter how solid those facts are. This is the reality and that will never change. And if you don’t believe me, just consider the creationists in the US! Those are the Colin Berrys and the Giulio Fantis of the evolution theory!.","date":"2013-10-31","mins":"4:52 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49427","author":"anonymous","post":"All I know is this (and that will be my final word) : The blood expert of STURP who analyze the blood from the Shroud (Adler) tells me that it really come from exudates of traumatized blood clots, which is in total sync with what is seen in the body image and this conclusion has been fully confirmed by an independent expert from Italy named Baima Bollone. And the best radiation expert of STURP (Rogers) tells me that a burst of energetic radiation of any kind or a scorch is unable to produce all the characteristics of the body image on the Shroud mainly because such processes are releasing too much energy (in other words, they are too strong) and this conclusion has been fully confirmed by two independent experts in radiation from Italy named Fazio and Mandaglio (both nuclear physicists). I don’t know for you, but for me, having a brain that work all right and a pretty good judgment, when I hear such conclusions from true experts that were independently confirmed by other true experts, I have a strong tendency to LISTEN and to ACCEPT THEM. And once you do this, you have to come to this conclusion: The Shroud is a real burial shroud that has contain for less than 48 hours the tortured and crucified body of a man who look like the Jesus of the Gospel and in all logic, the body image on the cloth CANNOT have been caused by the hands of a forger, no more than any burst of radiation coming from the dead body (which is, by the way, scientifically impossible). In this context, anyone with a brain who accept these confirmed conclusions of true experts about the Shroud would come, like me, to this final conclusion: a natural and probably biological process (or a series of processes like that) related to an interaction between the dead body and the surface of the cloth must be responsible for the body image on the cloth! That’s my line of thinking and if someone don’t want at all cost the Shroud to be the product of a forger or the by product of the Resurrection of Christ, he will surely come to the same conclusion as mine. And you know what? No matter how solid the conclusions I described are and no matter if they become even more solid after another future round of direct tests on the cloth, I’m sure all the others will never accept them and will still do everything they can to make believe they are wrong (like reinterpreting falsely the professional FTIR analysis of Adler that confirmed the previous chemical and forensic conclusions that the bloodstains are really made of exudates of traumatized blood clots in order to back up their preconceived ideas)! That’s the sad reality of sindonology my friends!.","date":"2013-11-01","mins":"8:30 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49429","author":"anonymous","post":"Important additional note : All I said about accepting the conclusions of Adler versus the blood and the conclusions of Rogers that the body image cannot be the product of a scorch or of a burst of high energetic radiation (conclusions that were all independently confirmed by other experts in the same scientific fields) doesn’t mean new tests and examination should not be done! On the contrary, such a new series of direct researches on the cloth is definately needed to confirm even more these previous conclusions, which I already consider to be very solid, especially because they were all confirmed by totally independent researchers who were also expert in the same scientific fields as Adler and Rogers. And if someone disagree with all I said this morning, it’s ok. It’s your liberty. But if you really want to deny these solid conclusions, I really think you should ask yourself if it would be possible that one or two preconcieve ideas about the Shroud (like the idea that it MUST be directly related to the Resurrection of Christ or that it MUST be a false relic) could interferred in your reasoning… Maybe by asking you the question honestly, you will start considering the solid conclusions I just described with a different perspective. I don’t think we will see this happening soon but who knows? And please ask yourself the question : What would be the problem if the Shroud was the real burial cloth of Jesus and if the image on it would be the product of a natural process related to his dead and crucified body? WHAT WOULD BE THE PROBLEM? Remember that this is the most probable conclusion we must come if we accept the solid conclusions I just described….","date":"2013-11-01","mins":"8:53 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49430","author":"anonymous","post":"Bulls… You only seek your own preconceive truth instead of, like me, accepting the most solid conclusions from true experts (which you are not obviously). These conclusions I accept are not from me but from real experts in their fields and have been INDEPENDENTLY CONFIRMED by other true experts in the same fields. But in the end, you think what you want Hugh..","date":"2013-11-01","mins":"8:56 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49431","author":"anonymous","post":"And by the way, it’s not a matter of « choosing your camp », it’s a matter of accepting the REALITY exposed by true experts in their fields. Question : Why is it so hard for you to accept the reality? Because this reality doesn’t fit with your preconcieve ideas?.","date":"2013-11-01","mins":"8:58 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49437","author":"anonymous","post":"Message to Colin Berry: Read this please: https://shroudstory.com/2013/10/28/of those big meaning words superficial half tone and striated/#comment 49339.","date":"2013-11-01","mins":"9:31 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49438","author":"anonymous","post":"Based on this comment of mine, you’re probably a true expert in your field… BUT… That doesn’t mean your interpretation of the data is good. By the way, Rogers’ main conclusions versus the nature (natural nature) of the body image were independently confirmed by 2 others true experts in the field of radiation. And you? Can you tell me another true expert who work in the same field as you who have been able to independently confirmed your own conclusions?.","date":"2013-11-01","mins":"9:35 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49436","author":"anonymous","post":"I can’t help myself. I need to say this truth : After years of following what’s going on in sindonology, I was struck (and a bit disgusted) by the fact that most present researchers are trying to explain the body image while following the exact paths (i.e. The « supernatural » path related to a burst of high energetic radiation or the « forgery » path) the true experts about the Shroud told us not to follow! Effectively, who, in the present day, is trying hard to test natural hypotheses for image formation in laboratory? Not a bunch unfortunatelly! Nevertheless, it is precisely in that exact direction that the experts are telling us to search… In such a bad context, I think it’s easy to understand why nobody to this day has been able to reproduce an image on linen with all the characteristics of the Shroud image! If things don’t change, this reality will stay unchanged I’m affraid….","date":"2013-11-01","mins":"9:30 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49449","author":"anonymous","post":"Instead of seriously considering Colin’s fantasy David, I think it would be much better for your understanding of the Shroud’s REALITY to focus on the very important conclusions of the experts named Adler and Rogers (again, which were all independently confirmed by other experts in the same fields) I brought you in my previous comments. I don’t know what was exactly the real natural process that lead to the formation of the body image but I know one thing: it was a natural process (or processes) and this was most probably directly related to some mild energy (heat, post mortem gases, other molecules like lactic acid, etc.) that was (or were) released by the corpse of the Shroud man. If you listen carefully what the true experts who analyzed the blood and the image on the Shroud had to say, that’s the conclusion you should reach. As Fazio and Mandaglio once wrote in one of their papers, the only “mystery” that remains regarding the Shroud image is to define what really was the true nature of the natural phenomenon that produced this image. And as they said, it will be very hard to find this because of the complexity of such natural phenomenons and because they don’t have a tendency to leave an evident “signature”..","date":"2013-11-01","mins":"10:49 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-74601","author":"anonymous","post":"The problem is that it surely don’t work AT FIBER LEVEL. As Barrie Schwortz said so nicely in various interviews: Something can look like the Shroud but if it doesn’t replicate all the known physical and chemical characteristics of the image, it’s not the same thing (and I would add: “so, in the end, it must be seen as unrelevant”)..","date":"2014-01-25","mins":"7:55 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-74735","author":"anonymous","post":"Does work at fiber level? Show me real proofs of this… And with those experimental proofs (i.e. Microscopic photographs showing the same kind of fiber coloration and the same absence of color penetration), I want you to also explain to me how in the world a source of light that would only be able to color one fiber deep at a distance of maybe 3 or 4 cm away from the cloth would also colored only one fiber deep in other parts where the cloth is in direct contact with the source of light? In my mind, there is only one hypothesis that have been proposed so far to explain this and it’s the one of Rogers involving a thin layer of impurities that would be located at the top surface of the cloth. But the only problem with Rogers’ hypothesis for the image chromophore versus any image formation hypothesis involving a burst of high energetic radiation like a burst of light is the fact that, as Rogers wrote, it’s almost impossible for such a source of high energy to be able to color only the layer of impurities without also affecting the underlying fiber (thus causing a deeper color penetration, especially in areas where the source of energy is in direct contact with the cloth). In order to have a real proof that such a hypothesis would work at fiber level, you would need to have a linen cloth covered with a thin layer of carbohydrate impurities and make two tests of coloration: one with the source of energy located in direct contact with the cloth and another with the source of energy (which would be of the same exact intensity as the first test) located at 3 cm or so and microscopically prove that, IN BOTH CASES, only the thin layer of impurities has been colored without the production of any noticeable defects anywhere in the structure of the underlying fibers and with no more color penetration for the test done with the source of energy located in direct contact with the cloth than the other test done with the source of energy located away from the cloth… Good luck!.","date":"2014-01-26","mins":"7:20 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-74751","author":"anonymous","post":"“only one side of the cloth substrate” do not mean in any way that you or the others were able to only color a layer of one single fiber deep on the cloth’s surface while leaving the underlying fibers uncolored and undammaged….","date":"2014-01-26","mins":"8:27 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-74835","author":"anonymous","post":"Question for Hugh: How can you apply “photosensitive chemicals” so that only the first fibers on the top surface of the cloth will be covered by them? In other words, how can you completely prevent those chemicals to go deeper into the cloth, thus allowing a coloring chemical reaction with the source of light that would affect (color) fibers deeper into the cloth? I’m very curious about that. Would you use the evaporation concentration phenomenon to do so? I’m skeptical that it could have the same high concentration effect as it could do for carbohydrate impurities for example. Unless mayve the “photosensitive chemicals” you used are in a solid state and not in a liquid state… Maybe… Would need evaporation tests on linen samples to know this for sure..","date":"2014-01-27","mins":"11:39 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-74871","author":"anonymous","post":"After reading you, I think it’s truly possible then that you can obtain a very superficial image on a linen cloth that way, because it rely on the same kind of evaporation concentration phenomenon described by Rogers. Nevertheless, such a hypothesis, in the case of the Shroud, is truly irrelevant (on the contrary to Rogers’ own hypothesis) because of the evidence of the bloodstains, which indicate that the image must have come from a real torture and crucified corpse….","date":"2014-01-27","mins":"4:41 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-74873","author":"anonymous","post":"By the way, the last part of my above statement is also true concerning Colin Berry’s scorching hypothesis… Sorry for you guys but the blood and serum stains are there on the Shroud to totally contradict your ideas (which are good try nevertheless)..","date":"2014-01-27","mins":"4:45 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-74837","author":"anonymous","post":"Question for Colin Berry: How in the world the same exact source of heat (with pretty much the same intensity) could only color the first fiber at the top surface of a linen cloth while the source of heat is located at 3 or 4 cm away from the cloth and, AT THE SAME TIME, could also color ONLY the first fiber at the top surface of the same linen cloth while the very same source of heat is located in direct contact with the cloth? Theoretically speaking, I think it’s fair to say that such a scenario seem close to absolute zero in term of probability….","date":"2014-01-27","mins":"11:42 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-74851","author":"anonymous","post":"I think this is a truly important question to answer. Especially concerning hypotheses like yours. My answer wasonly theoretical and based on good sense..","date":"2014-01-27","mins":"2:02 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-74872","author":"anonymous","post":"I just printed your reply on your website. I will read this carefully tonight and come back to you as soon as possible..","date":"2014-01-27","mins":"4:43 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-74957","author":"anonymous","post":"I read your answer on your website and I found 2 problematic aspects of the whole question that you did not addressed properly: 1 You never told us how you can avoid, with the same degree of heat, any color penetration deeper than one or two fibers into the cloth, no matter if the source of heat is placed in direct contact with the cloth or at 3 or 4 cm away from it, which is the result you need to achieve in order to reproduce properly the body image of the Shroud man in 3 D (as it was demonstrate by Jackson et al. From STURP in their 3 D study). Effectively, if you only produced direct contact scorches, the 3 D rendering of your image should look like valleys and plateau instead of showing a real 3 D. In fact, all you address was the color penetration inside one single fiber, but I did not find anything regarding the ability of your process to restrict the production of colored fibers to just one, maybe two fibers deep into the cloth and no more than this, no matter if the source of heat is located in direct contact with the cloth or at 3 or 4 cm away from it. And be sure that no matter what you can think or write about that, in order to convince me, you would need to show me microscopic photos to back you up. I say: good luck my friend! Note: there are PCW able to get colored more easily than the inner part of the linen fibers EVERYWHERE inside the cloth and not just on the top surface of the cloth. I seriously doubt that you could achieve the feat of being able to restrict your color penetration to one single fiber on the top surface of the cloth… And even if you would be somehow able to do so, it would only be with one of the two set up I talked about (direct contact and 3 4 cm location from the source of heat) and never with both… 2 Concerning the production of color at a distance from the cloth, you wrote: “…PCW may become discoloured in affected threads (note that there are PCW everywhere inside any thread, and not just on the top surface of the thread) even with a small air gap (BUT NOT EXCESSIVE – MILIMETRES RATHER THAN CENTIMETRES). I’m sorry Colin, but this DO NOT MATCH the results of Jackson et al. From STURP who specifically wrote that the image formation process was able to color any given thread up to a distance of 3.7 cm. Taking what you said and what Jackson et al. Said into account, how can you still think you can achieve, with the use of heat, an image with the same exact properties as the one we see on the Shroud?.","date":"2014-01-28","mins":"9:30 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-74972","author":"anonymous","post":"As I said in my previous comment: in order for me to buy this, I need some microscopic photographs that will prove that. And even if such a heat process could really produce a complete image (front and back) of a man with absolutely no color penetration anywhere (just saying this is almost non sense to me), this would not answer why a medieval forger would have wanted to accomplish such a feat that was impossible to see to the naked eye anyway!!! Look, I can buy the improbable idea of a forger who would have wanted to created a sort of ghost image of Jesus on a burial cloth in order to produce an enigmatic false relic, but I’m not ready to buy the idea that, along with this, he would have taken time to make sure that there would have been absolutely no more color penetration is darker zones than in lighter zones. It’s fun to imagine things, but one day, we must also be logical and rational….","date":"2014-01-28","mins":"11:39 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-74874","author":"anonymous","post":"Question for Colin Berry: Have you noticed that, when we look at the Quad mosaic photos of the Shroud, the color of the body image is very much like the color of the scorched areas… I wonder if you noticed that (pretty sure you did) and I would like to ear you about that. For me, this is another indication of what Jackson often said about the fact that the chemical reaction that lead to the formation of the body image looked like a scorch, even though there seem to be some slight differences (at least between the properties of the scorches that are on the Shroud and the body image)….","date":"2014-01-27","mins":"4:49 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-74406","author":"anonymous","post":"Message to Hugh: I hope you won’t pass by this comment of mine: https://shroudstory.com/2014/01/21/cat among the pigeons/#comment 74381 I ask you an important question in it regarding your recent BSTS article….","date":"2014-01-24","mins":"11:52 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-74990","author":"anonymous","post":"I will probably take time to answer this comment later. But Colin, how about this other comment of mine: https://shroudstory.com/2014/01/24/radiation man a new bsts article/#comment 74957 I hope you’ll take time to answer this….","date":"2014-01-28","mins":"2:01 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-74997","author":"anonymous","post":"For the moment Colin, I will only say this versus your above comment : The simple fact that the body image did not penetrate the cloth no more in dark zones than in light zones should be enough for anyone who is honest versus the subject to reject the idea that this sort of image could have been forged. Seriously, why someone would have wanted to accomplish a feat that was not even noticeable for anyone during the Middle Ages? And I’m not even talking of the unbelievable skill that such a forger must have had in order to accomplish that feat… And I’m not even talking about the evidence of the bloodstains, which clearly indicate that this image was formed on the cloth by a real crucified corpse… And I’m not even talking about… And about… And about… Seriously Colin, here’s my advice to you if you really want to find a cause for the image that can be scientifically sound : start searching for some biological interraction between a real crucified corpse and the top surface of the Shroud..","date":"2014-01-28","mins":"3:13 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-75004","author":"anonymous","post":"Concentrate on this please: The simple fact that the body image did not penetrate the cloth no more in dark zones than in light zones should be enough for anyone who is honest versus the subject to reject the idea that this sort of image could have been forged. Seriously, why someone would have wanted to accomplish a feat that was not even noticeable for anyone during the Middle Ages?.","date":"2014-01-28","mins":"3:55 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-75009","author":"anonymous","post":"You didn’t understand me correctly Dan. When I said “a feat that was not even noticeable for anyone during the Middle Ages”, I was talking about the ultra superficiality of the image (which is limited to 1, maybe 2 colored fibers in deep on the top surface of the cloth) not only in lighter zones, but ALSO in darker zones. No one has a microscope in the Middle Ages to notice such a thing. Why a forger would have wanted to restrict the color penetration of his image like that? And not only that, but how could he managed to do so in every parts of the image (light as well as dark parts) with a forgery technique like a scorch? It’s pretty ludicrous, except if we think this unknown genius was able to manually and artificially colored only a thin layer of impurities concentrated on the top surface of the cloth. But as Rogers said so well, any kind of high energetic technique (like a scorch for example) must be exclude in such a case because it’s way too strong to only color a layer of impurities without affecting the underlying fibers… I hope these precisions are enough for you to understand me perfectly….","date":"2014-01-28","mins":"4:28 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-74998","author":"anonymous","post":"We can say that, along with the evidence coming from the bloodstains, the ultra superficiality of the image is a real huge problem for any forgery proposal, especially when it involved a chemical change of the linen fiber itself (PCW or the whole fiber) because the linen fibers (including the PCW) are not restricted to the top surface of the cloth….","date":"2014-01-28","mins":"3:21 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-75076","author":"anonymous","post":"I just read this on Colin Berry’s website: “That (note: the extreme superficiality of the image) was the result of a host of chance physical, chemical and botanical effects related to the interaction of a heated template with a heat susceptible woven fabric.” My answer: Yes… Yes… And Santa Claus is a real bearded man who fly in the sky with a sleigh… Come on Colin! Do you know what are the odds for a medieval forger to produce with heat a totally superficial image of the complete body (both sides) of a man on a linen cloth without ever producing any color penetration in any area of the image (not even in area were the image is much darker than average)? Near absolute zero. AND I’M NOT EVEN TALKING ABOUT THE EVIDENCE OF THE BLOODSTAINS THAT DISCARD THE IDEA OF A FORGERY. I have nothing else to say to you..","date":"2014-01-29","mins":"12:25 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-75079","author":"anonymous","post":"I don’t wanna waste my time anymore with someone who can’t see the reality of facts and prefer to rely on his personal preconcieve notions of what must have formed the Shroud image… Just by merging together the evidence of the bloodstains and the evidence of the ultra superficiality of the image (as superficial in darker zones as it is in lighter ones), any intelligent person would come to the conclusion that the Shroud image has not been formed by a forger using heat… But now I see that you just don’t want to look at REALITY… By the way, you’re not the first to act like this… Einstein did the same thing versus the idea of a universe in expansion!.","date":"2014-01-29","mins":"12:58 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-75080","author":"anonymous","post":"No matter what you might think (or wish), when it comes to the idea of a forgery involving heat, Colin sentence is totally discarded by the evidences of both the ultra superficiality and the bloodstains….","date":"2014-01-29","mins":"12:59 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-74405","author":"anonymous","post":"The problem with all those hypothesis involving a burst of energetic radiation is the fact that they can’t account for the reality of the Shroud image at fiber level, in the sense that we know that the image formation process was only able to color one, maybe 2 fibers in deep AND, AT THE SAME TIME, was able to do so not only at direct contact points between the body and the cloth, but at some close distance (up to something probably between 2 and 4 cm away from the corpse). In my mind, if a radiation process involve the same amount of energetic release from every point of the body, no doubt that such a process will colored more than 1 or 2 fibers deep into the cloth at contact points if it is able to color only 1 or 2 fibers deep in zones where the source is located something between 2 to 4 cm away from the cloth. I hope people understand my reasonning here. Note that Di Lazzaro never directly address this theoretical issue in all the papers he published over the years concerning his UV light hypothesis, no more than Fanti concerning his Corona discharge hypothesis or Colin with his scorch hypothesis… The day Di Lazzaro, Fanti or Colin will show me 2 pieces of linen cloth that will show the same exact extremely thin color penetration of 1 or 2 fibers coming from 2 different set up (one where the source of energy would have been placed in direct contact with the cloth and the other one where the same exact source of energy would be placed at 3 cm or so), I will start to consider more seriously their hypotheses… But I seriously doubt they’ll be able to show me this kind of coloring result before I die..","date":"2014-01-24","mins":"11:51 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-75088","author":"anonymous","post":"I just need to redone my first post again: He wrote this on his website: “That (note: the extreme superficiality of the image) was the result of a host of chance physical, chemical and botanical effects related to the interaction of a heated template with a heat susceptible woven fabric.” My answer: Yes… Yes… And Santa Claus is a real bearded man who fly in the sky with a sleigh… Any rational person know that the Shroud image, because of its very unusual characteristics (including all that concern bloodstains), cannot have been produced by a scorch. This was rejected by STURP years ago and I just wanted to point out to Colin that when you take into account the évidences of both the extreme superficiality and the bloodstains, the hypothesis he defend AT ALL COST has no value whatsoever concerning the Shroud reality. If he want to defend the idea of a forgery, I have no problem, but please, take all the FACTS into account. If he could do this, he will realize (just like me) that the only forgery hypothesis that can still account for the Shroud image is one that involve an image naturally formed by a real crucified corpse. I’m affraid there’s no other credible possibility than this one if you still want the Shroud to be a forgery. Would be nice to see Colin and Hugh realize this once and for all….","date":"2014-01-29","mins":"2:03 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-75091","author":"anonymous","post":"And concerning Colin’s attempts to replicate the color of the Shroud image on linen, such attempts (just like the one done by Garlaschelli by the way) are much too short because they don’t take into account the question of the blood and serum stains… The reality is this : to replicate the Shroud properly, you need to place a real crucified corpse into a real burial linen cloth. And not only this, you must wait some time after death in order for the bloodstains on the body to become solid enough to only leave mirror images of themselves on the cloth. Adler was pretty clear about that….","date":"2014-01-29","mins":"2:19 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-75169","author":"anonymous","post":"And what do you make of this sentence that we find in STURP general conclusion report: “We can conclude for now that the Shroud image IS that of a REAL HUMAN FORM of a scourged, crucified man. It IS NOT the product of an artist.” Now, unless I don’t understand correctly STURP words, when I read “IS the image of a REAL human form” and “IS NOT the product of an artist”, I understand that it include any forgery hypothesis involving heat, like the scorch hypothesis of Colin Berry. This general conclusion can be read here: http://www.shroud.com/78conclu.htm.","date":"2014-01-30","mins":"11:45 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-75171","author":"anonymous","post":"David, a Maillard reaction is not the same as a scorch. Scorch involve important quantity of heat. Maillard reactions are happening at NORMAL TEMPERATURE. Don’t mix apples and oranges. When I reject any scorch hypothesis, I reject any idea that the image could have been formed by an energetic radiation like heat, no matter from what source this supposed heat could come from..","date":"2014-01-30","mins":"11:51 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-75180","author":"anonymous","post":"Additional note: On the contrary to the scorch hypothesis, I don’t contest the possibility of a photographic image produced on the top surface of a linen cloth, if the light sensitive product has been concentrated on this portion of the cloth. Nevertheless, this particular hypothesis is also ruled out by the evidence of the bloodstains alone, nevermind the fact that an expert like Barry Schwortz also rule it out regardless of the evidence of the bloodstains (https://www.shroud.com/pdfs/orvieto.pdf)….","date":"2014-01-30","mins":"2:04 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-74415","author":"anonymous","post":"Just to summarize my reasoning, I would say that it is extremely hard for me to buy the idea that some burst of energetic radiation located in direct contact with a linen cloth could only colored 1 or 2 fibers deep on the top surface of that cloth, while the same exact sort of burst of energy (with the same exact intensity) could produce the very same result for the color penetration if we place the source of energy at 3 cm or so from the cloth..","date":"2014-01-24","mins":"2:00 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-75195","author":"anonymous","post":"Who knows if some biological substances (like urea and/or lactic acid) could have been present on the skin and hair of the Shroud man (left there after the drying of the abundant sweat of the man while on the cross) and could have interracted with the thin layer of impurities postulated by Rogers in order to form the image? Personally, it’s a possibility I would not discard. But I doubt such a chemical reaction at normal temperature could be called “a scorch” (scientifically speaking)….","date":"2014-01-30","mins":"5:42 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-75196","author":"anonymous","post":"Note: it is also possible, as Fazio and Mandaglio described, that the image could have been caused by a stochastic process involving the normal heat released by the fresh corpse after his death, which would have interracted with only a random portion of the most superficial fibers that would have been hit by this very low energetic release (or, more probably, with a random portion of the thin layer of impurities described by Rogers that would have been hit by this very low energetic release). Such a process, just like the Maillard hypothesis of Rogers, would have happened at normal temperature and would have produced a latent image, which would have taken years and maybe even decades to fully “develop”. In my mind, the normal heat release of the fresh crucified corpse is the only heat that could rationally have taken part in the image formation process. But again, I doubt the color result of this could be called “a scorch” (scientifically speaking)..","date":"2014-01-30","mins":"5:49 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-76043","author":"anonymous","post":"To conclude this topic, I just want to summarize in a few words my thoughts about all the hypotheses for image formation involving a form of another of high energetic radiation (including the scorch hypothesis of Colin Berry or some supernatural hypotheses like the ones proposed by Di Lazzaro or Fanti): To me, believing that the Shroud image (especially when you consider its ultra superficiality, which is the same in darker zones as it is in lighter ones, and also when you consider the probable fact that the bloodstains, which were not affected at all by the image formation, were on the cloth first) could have been formed by such a thing is as crazy as believing a painter could have uniformly painted such an extremely superficial full body image (front and back)! I don’t know for all of you, but for me, this is what logic and rational thinking leads me. And I’m not even talking about some other strange particularities (like the total absence of a body image of the back of the knee on the dorsal image), which gives any forgery hypothesis even less credit….","date":"2014-02-02","mins":"5:39 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-76045","author":"anonymous","post":"Complement : The absence of an image of the back of the knees, the presence of bloodstains before the image formation, the extreme superficiality of the image everywhere on the cloth (in darker zones as much as in lighter ones), etc. To me, all those things are well enough to discard any forgery hypothesis involving any form of an artistic technique and are well enough to put very serious doubts over any supernatural hypothesis that involve a form or another of high energetic radiation..","date":"2014-02-02","mins":"5:42 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-76059","author":"anonymous","post":"I only talk about probabilities here. And once you consider all the pertinent data without to absolutely disauthenticate the relic and without being despair to link it with the Hollywoodish idea of what kind of burst of energy the Resurrection of Christ might have produced, then probabilities clearly point in direction of a natural formation involving a real crucified body (probably the one of the historical Jesus of Nazareth). I don’t say your hypothesis is 0.0 in term of probability. I just say those must be estimated as something close to, let’s say, 0.1%..","date":"2014-02-02","mins":"6:42 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-76060","author":"anonymous","post":"There was a missing word in my last comment. Here it is again: I only talk about probabilities here. And once you consider all the pertinent data without wanting to absolutely disauthenticate the relic and without being despair to link it with the Hollywoodish idea of what kind of burst of energy the Resurrection of Christ might have produced, then probabilities clearly point in direction of a natural formation involving a real crucified body (probably the one of the historical Jesus of Nazareth). I don’t say your hypothesis is 0.0 in term of probability. I just say those must be estimated as something close to, let’s say, 0.1%..","date":"2014-02-02","mins":"6:44 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-76076","author":"anonymous","post":"You know I’m right. It’s just you not ready to admit it. If you really want to disauthenticate the Shroud, start looking for the naturally produced image of a real crucified man who looked like Jesus of the Gospel on a real burial cloth or, if you really want to keep the “forgery” path, at least, start thinking about a “natural” forgery done by someone who used of a real crucified corpse in order to produce naturally his body image on a linen cloth… That way, you and your hypothesis would become much more credible..","date":"2014-02-02","mins":"7:54 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-76200","author":"anonymous","post":"I’m not frustrated. I just don’t understand why some people like you still consider human made forgery hypothèses, which have all been set aside by STURP (and that are obviously off track concerning the Shroud and the sum of very particular characteristics associated to it), instead of taking STURP conclusions seriously and start looking for some natural interraction between a real crucified corpse (which could still have been, if you don’t want the relic to be authentic, another person than Jesus) and some reactive products that were concentrated on the top surface of the cloth (possibly on both sides). To me, it is as obvious as the nose in anyone’s face that this is the right path to follow in order to solve the mystery of the Shroud image… I think the main error you did (note that many other researchers did the same error over the years) is to consider separately the body image and the bloodstains, which must be considered as a whole..","date":"2014-02-03","mins":"11:45 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-76202","author":"anonymous","post":"By the way, I don’t know if Rogers hypothesis was right on the target. More tests need to be done to verify this. I still wait for such tests to be done… I also think Fazio and Mandaglio’s hypothesis of a very weak and natural release of energy (probably heat) by the corpse that could have yield the dehydration of some superficial fibers (or more probably of a thin layer of impurities) deserve to be tested properly under good lab control. And it’s the same thing for the hypothesis proposed by John De Salvo concerning a possible Volckringer pattern phenomenon (or something very similar in nature). Have you noticed that all those hypotheses still wait to be tested properly under good lab control? Only Rogers had time to make some preliminary tests, but those were just preliminary stuff… More researches need to be done regarding all those interesting hypotheses..","date":"2014-02-03","mins":"11:55 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-49942","author":"anonymous","post":"By the way, it is exactly the same thing for the natural images of plants or flowers throught the process known as the Volckringer pattern effect! But around here, nobody seem to be willing to accept the fact that there is other known natural process that can produce an image on an object (in this case, it is a sheet of paper) with good 3 D data, which came from a natural (but still not fully determined yet) interaction between a biological thing (in this case, it is vegetal) and the sheet (of paper)..","date":"2013-11-04","mins":"5:41 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-50050","author":"anonymous","post":"You didn’t understood the point I wanted to make, which is this: there is absolutely no single characteristic taken from the Shroud image that can be taken as a serious piece of evidence in favor of a supernatural process or of a man made process, not even the 3 D data present in it for the simple and good reason that 3 D characteristics like this can be produced naturally by biological things (vegetal in this case). I don’t say that the images of plants produced by a Volckringer pattern effect are showing exactly the same characteristics as the image on the Shroud but it is possible that the Shroud image can have been the result of a similar biological and chemical interaction (very complex obviously) between the dead body and the cloth, which would have acted both by direct contact and by a molecular diffusion at a very short distance (close proximity if you will). In other words, the fact that there are images of biological things that are showing the same kind of good resolution and 3 D data as the Shroud image cannot allowed anyone presently to discard the possibility (which is the most probable in my mind) that the Shroud image can be the result of a natural interaction between the dead body of the Shroud man and the surface of the cloth..","date":"2013-11-05","mins":"11:44 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-73452","author":"anonymous","post":"I completely agree with both statements made by anoxie and M. Latendresse. Remember folks: The simplest (and, in the case of the Shroud, the most rational) explanations are almost always the good one! It’s fun to note how people constantly want to complicate things while looking at the body and blood images on the Shroud….","date":"2014-01-16","mins":"11:06 am","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"author":"anonymous","post":"Despite the arguments of pseudo skeptics like colinsberry that Alan. D Adler didn't prove the blood is real they must be able to explain these results and the presence of human serum albumin chidi.","date":"2012-07-22","mins":"10:38 PM","url":"http://theshroudofturin.blogspot.com/2008/07/re-middle-eastern-features-on-shroud.html","title":"\nRe: Middle Eastern Features on Shroud Image\n"},{"author":"anonymous","post":"There are various opinions and researches of the shroud of Turin. Some people say that it is the genuine and some that it is the fake and the hoax. The fact is that the shroud of Turin doesn't present Jesus of the Bible. If we can find even one evidence, which disprove the shroud of Turin theory, so the whole story shall be invalidated. We can find a large number of evidence from the Bible, which show that the shroud of Turin cannot be the shroud of the Lord Jesus.http://koti.phnet.fi/petripaavola/shroudofturin.html.","date":"2013-04-07","mins":"1:51 PM","url":"http://theshroudofturin.blogspot.com/2013/02/the-shroud-of-jesus-26-other-marks-1.html","title":"\nThe Shroud of Turin: 2.6. The other marks (1): Burns and water stains\n"},{"author":"anonymous","post":"Stephen you need to see this a hologram photo has been processed from the back second face of the Shroudhttp://ireport.cnn.com/docs/DOC 954016.","date":"2013-04-10","mins":"11:34 PM","url":"http://theshroudofturin.blogspot.com/2013/02/the-shroud-of-jesus-26-other-marks-1.html","title":"\nThe Shroud of Turin: 2.6. The other marks (1): Burns and water stains\n"},{"author":"anonymous","post":"I also expected from you a further argument this makes for problems with the forgery theory. For the relic to have ever been stored in such a way, and presuming the possessor appreciated it as holy, suggests that it was in peril. Correct me if I'm wrong in thinking that post Lirey, France, there is no documented evidence of any threat to the shroud that would require such ends for its preservation. Therefore it must pre date the carbon dating..","date":"2018-04-16","mins":"9:14 PM","url":"http://theshroudofturin.blogspot.com/2018/04/water-stains-28-other-marks-and-images.html","title":"\nWater stains #28: Other marks and images: The evidence is overwhelming that the Turin Shroud is authentic!\n"},{"author":"anonymous","post":"Some have claimed that the image is the result of a Bas Relief rubbing technique.I have not read that this idea is completely refuted. However, I am personally skeptical that a rubbing could produce an image such as this.Do you have any references that offer a response to the \"rubbing technique\" claim?.","date":"2012-06-25","mins":"1:17 PM","url":"http://theshroudofturin.blogspot.com/2012/05/you-state-that-there-is-no-paint-dye-or.html","title":"\nYou state that `there is no paint, dye or pigment on the Shroud that forms its image' but it is claimed that `the Shroud contains red ochre and other paint pigments'\n"},{"author":"anonymous","post":"I'm still very confused about the paint issue...if I have read Mc Crone correctly, he says that there are traces of red ochre that make up the body image, and red vermillion that make up the blood image. And he found no pigment on the non image areas. I realize that these results were not peer reviewed, but if he is wrong, it seems like a rookie mistake...which only leaves the option that he lied, since he was a highly respected microscoptist. This is certainly possible, but I don't like to make an assumption that a scientist is fabricating data. It sounds like STURP scientist are cliaming that yes, there are paint particles, but they don't form the image. Are they also claiming that there are only red ochre and red vermillion, or do they claim that multiple pigments are visible? If there are only the two, it would seem odd that only two pigments would be found from 'sanctifying' other 'shrouds' against the 'real Shroud'. You would expect multiple pigments, I would imagine..","date":"2013-01-09","mins":"6:59 AM","url":"http://theshroudofturin.blogspot.com/2012/05/you-state-that-there-is-no-paint-dye-or.html","title":"\nYou state that `there is no paint, dye or pigment on the Shroud that forms its image' but it is claimed that `the Shroud contains red ochre and other paint pigments'\n"}]
