[{"id":"comment-78363","author":"anonymous","post":"“honesty” is the key word, well before “being a Christian or not” or “acting like a Christian or not”. A comment can be very strong against someone (and can be seen as “not being Christian”), but if it’s done with honesty and only in search of the truth, I have absolutely no problem with it..","date":"2014-02-11","mins":"2:03 pm","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-78400","author":"anonymous","post":"Concerning evangelisation, I don’t think the Shroud is much different than any crucifix you can see on a wall. As Christian, we can use both objects to help our meditation of God love for all mankind. But having say this, I truly don’t think the Shroud has much more power to convert this “skeptical generation” than a normal crucifix… Personally, I haven’t seen one case of an atheist who convert to Christianism because of the Shroud. There might be some but I’m sure this is anecdotal… And for your first question, I would answer: extremely doubtful, since we don’t have any serious piece of evidence from history and art to think the Shroud of Christ ever spent even just one day in Edessa….","date":"2014-02-11","mins":"4:42 pm","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-78405","author":"anonymous","post":"I will always elevate my voice against such a weak link… There are a lot of things in our universe that science is not able to explain yet. Does it mean we must believe in God because of all those “mysteries”? Surely not because even just 10 or 20 years from now, there were even more things that science was still seeking to explain! How can anyone be certain if the “mystery” of the Shroud image will not be fully explain with the known laws of nature when the Vatican will eventually allow a new series of direct researches on the cloth? And if this day ever come, what will happen with your faith if a good portion of it is based on the kind of link you just did? True faith should never be an intellectual belief but a true spiritual relationship with God. Read again what Jesus said to the women at the well: “God is spirit, and those who worship him must worship in spirit and truth.” God don’t want people to believe in him because of some unsolved mystery regarding the image on his shroud, but because we simply have enough faith to trust him and have confidence in him to help us on a daily base and because we want to live a true Relationship with him. That’s what I think….","date":"2014-02-11","mins":"4:51 pm","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-78420","author":"anonymous","post":"David, I think you should pay more respect for those who say they do not believe in God because, most of the time, I (and every Christian who believe God is Love and nothing else than Love) agree with the kind of God they reject! Effectively, most of the time, when someone say he doesn’t believe in God, it’s only because he has not yet meet the only one that exist and so, he don’t know him and reject a false image of God (most of the time a God who is pretty much like a supreme judge of the universe and who strictly apply the old Jewish law of talion) he receive when he was young… In my mind, those who are the worst off are not those kind of intelligent and sensible persons who refuse such a monster God who would be ready to send a portion of his children to hell, but much more those who kneel before such a false idol who never existed except in the tortuous mind of some human being….","date":"2014-02-11","mins":"5:40 pm","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-78421","author":"anonymous","post":"Amen..","date":"2014-02-11","mins":"5:41 pm","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-78659","author":"anonymous","post":"Because we’re all human beings (= sinners), you should know Andy that we’re always somewhere in between those two extremes!!! People should stop seeing everything black or white. Life’s told me that there is never black or white but always grey (with different shades of grey)….","date":"2014-02-12","mins":"9:31 am","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-78660","author":"anonymous","post":"When I say that no one is perfectly honest all the time, this doesn’t mean we should not at least try hard to be the more honest we can be… Always! To me, a “good” Christian is not someone who is perfect, but someone who know he’s not and who try hard to ameliorate himself WHILE RELYING ON THE GRACE OF GOD TO DO SO..","date":"2014-02-12","mins":"9:34 am","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-78664","author":"anonymous","post":"And concerning the Shroud, I think that, because it is primarily a scientifc quest, being the more honest that we can should equal trying hard to avoid wild assumptions and speculations, while trying also hard to rely on FACTS AND THE MOST SOLID DATA that exist. This is not what I often see going on around here where imagination (often related to bad religious feelings) is often flying high..","date":"2014-02-12","mins":"9:43 am","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-78696","author":"anonymous","post":"David should understand once and for all that if the Shroud is the product of a forger who used a real crucified body to do his work, it is almost impossible to think such a forger could have been a gnostic because those heretics were generally believing that Jesus had only a divine nature and that he did not had a real human physical body. Consequently, they believed he did not truly suffered on the cross. All this heretical system of belief is CONTRADICTED by what we see on the Shroud!!! Therefore, there’s no way such a relic could have been created by someone who was a member of a gnostic group. We must be rational when it’s time to consider all the possible options versus the Shroud and truly, the idea of a gnostic forgery.is not one of those….","date":"2014-02-12","mins":"11:40 am","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-78348","author":"anonymous","post":"Because of my personal spiritual experience of God, I can say this: In the eyes of our Father in Heaven, we got much more “indulgences” when we forgive our brother or sister who have hurt us than when we “venerate” a material object like the Shroud….","date":"2014-02-11","mins":"1:01 pm","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-78382","author":"anonymous","post":"To complete my thoughts about this, I would say that my point of view is pretty much the same as we can see in the Bible between the physical circumcision and the spiritual circumcision (often called “circumcision of the heart”), which possess much more value in God’s eyes than the first one… Devotion to the Shroud can be helpful to some person, but it is surely not the greatest thing in the eyes of God. Blessed are those who believe without seeing, remember?.","date":"2014-02-11","mins":"2:59 pm","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-78332","author":"anonymous","post":"The faith that is in question here on the blog is not so much the faith we have or not in Jésus Christ, the Son of God, but much more the faith we have or not in the authenticity of his alleged burial cloth… That’s the first thing I wanted to say about David’s interesting comment. The second is this: No matter what kind of faith is in question somewhere (whether it concern the divinity of Jesus, the authenticity of his shroud or something else), it ALWAYS produce strong debates (personally, I have no problem with such debates, as long as it is done honestly) because it greatly affects our emotions… This is part of human nature and once you understand this, it’s much easier to forgive someone who throw some cheap shots at you..","date":"2014-02-11","mins":"11:43 am","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-78336","author":"anonymous","post":"Louis, why don’t you post it here… I don’t think Dan will disagree..","date":"2014-02-11","mins":"12:05 pm","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-52945","author":"anonymous","post":"Imagine that the Shroud is a real burial cloth because we know for a fact that it was already stained by blood and serum stains at the time of the image formation and Imagine that none of those biological stains were damaged or disturbed in any way by the image formation mechanism. Imagine that this is true (which it is by the way) and you’ll easily forget every possible man made forgery scenario that you can imagine..","date":"2013-11-27","mins":"11:48 am","url":"https://shroudstory.com/2013/11/26/imagine/","cat":"uncategorized","title":"Imagine"},{"id":"comment-72617","author":"anonymous","post":"Quote: “The Shroud is s singular object and so is the Resurrection. They intersect.” Of course, I disagree completely with your point of view. On this subject, here’s a good question for you: And why not the intersection could not be found between the dead and tortured corpse of Jesus BEFORE his resurrection and the image on the cloth? Why not? Because there are no other shroud with a body image like this elsewhere? This is not an argument since we don’t have any other intact burial shroud of a crucified person for antiquity! And why is it that way? Because the fact that someone was buried in a pure linen shroud of high quality during antiquity after he had been crucified with the Roman method is most probably ALSO UNIQUE, as it is for the Resurrection! So, I think it’s fair to say that the Shroud is a singular object and so is the burial of a crucified man in a pure linen shroud of high quality, which can be one major cause of the image formation. Another one is most certainly the fact that this man did not stayed in contact with his Shroud for more than 72 hours, which is another pretty “singular” feature for a dead corpse that has been buried during antiquity! So, you see? The Resurrection is NOT the only “singular” feature that is associated with the Shroud and, therefore, your argument is pretty weak..","date":"2014-01-08","mins":"4:50 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","title":"Keep it Simple: Can Anyone Help?"},{"id":"comment-72619","author":"anonymous","post":"What I really meant in my previous comment is the fact that there are other “singular” features related to the Shroud, other than the possibility that this man was risen from the dead, and some of those (i.e. The singular fact that the body only stayed in contact for a short period of time and the singular fact that a crucified man has been buried in such an expensive Shroud) can well have had a huge impact on the formation of an image on the cloth. Note that these 2 “singular” features are most certain facts than the possibility that this man was risen from the dead….","date":"2014-01-08","mins":"5:37 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","title":"Keep it Simple: Can Anyone Help?"},{"id":"comment-72792","author":"anonymous","post":"Next time you talk with him, tell him that I can’t wait to meet him in Heaven! I’m sure at that moment, I won’t care about the Shroud of Turin AT ALL… : ).","date":"2014-01-09","mins":"5:34 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","title":"Keep it Simple: Can Anyone Help?"},{"id":"comment-72513","author":"anonymous","post":"If the simplest explanations are usually the best (which I believe, very often, it is), I have to think that: 1 The Mandylion was a small towel showing the (most probably painted) face of the living Jésus Christ without showing any bloodstains or bruises. 2 The Shroud of Turin is the authentic Shroud of Jesus of Nazareth. 3 The body image on it was produced by some form of a natural interraction between the top surface of the cloth (probably with impurities) and some products (probably biological) released by the dead corpse of Jesus shortly after his death and burial..","date":"2014-01-07","mins":"5:37 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","title":"Keep it Simple: Can Anyone Help?"},{"id":"comment-66926","author":"anonymous","post":"Christmas is the Feast of the Incarnation of God in our humanity, which is, to me, the most hard to believe dogma of them all. But I think we can see something of this on the Shroud, which can help our poor faith….","date":"2013-12-24","mins":"6:47 pm","url":"https://shroudstory.com/2013/12/24/merry-christmas/","cat":"news_&_views","title":"Merry Christmas"},{"id":"comment-51903","author":"anonymous","post":"Each time I see those photomicrograph, the first thing that struck me is how subtle the image really is at fiber level. It’s hard to really distinguish between a colored and a non colored fiber.with 100% certainty. That’s one of the main reason that lead me to conclude that only a weak amount of energy (most probably natural) must have been involved there….","date":"2013-11-18","mins":"2:04 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-51934","author":"anonymous","post":"Resurrection being natural? Not in regard of the known laws od nature John… Or else, Jesus’ Resurrection was just a biological “re animation” of the same nature than the one of Lazarus where the body got back to this earthly life and eventually died again some times later..","date":"2013-11-18","mins":"4:38 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-51935","author":"anonymous","post":"Colin said: “I could never claim to have been “successful in reproducing a copy of the Shroud”. Of course you can’t Colin because you completely neglect to reproduce also the blood and serum stains that we see on the Shroud, which is, for someone who seriously pretend of trying to replicate the Shroud image, a total shame in my book..","date":"2013-11-18","mins":"4:40 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-51936","author":"anonymous","post":"I’ll say it again and again and again: The Shroud must be consider in his totality, which include all the blood and serum stains… Unfortunately, all those that I know who pretend over the years to have been able to reproduce the Shroud or to have come close to succeed have all neglected to try to replicate also the blood and serum stains in a way that they could fool the medical and forensic experts. And sorry for all those who still think the Shroud can be the work of a forger, but I think we’ll all be happy in Paradise when someone will succeed to replicate all the different blood and serum stains that are visible on the Shroud with a high level of credibility… This is normal because to do so, you need a scourged and crucified corpse with a majority of bloodstains on it that have been able to clot. Hard to find, don’t you think?.","date":"2013-11-18","mins":"4:45 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-51940","author":"anonymous","post":"In other words, what I say basically is this : The only hypothesis involving a forger must include the use of a real tortured and crucified body that suffered the exact same tortures as Jesus of the Gospel. If you got some judgment, that’s the only forgery hypothesis that can have some chances to work regarding the Shroud and, seriously, this kind of wild scenario must be considered as highly improbable..","date":"2013-11-18","mins":"5:07 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-52168","author":"anonymous","post":"Quote: “They were subsequently disguised as blood marks.” Even if I completely disagree with your hypothesis concerning these marks, I want to say that they are not at all “disguised” as blood marks. They are scorches in fact. Look at the Shroud scope, around the area where those marks are and you’ll see other scorches looking pretty much the same color and intensity. Look at this area for example and compare the color and intensity of these obvious scorches with the marks Latendresse interpreted as blood: http://www.dshroud.com/shroud Scope/shroud Scope.shtml?zl=11&image=4&lon=17358&lat=1948 Remember that these marks that were described as blood by Latendresse where described as “probable scorches” by Miller and Pellicori in their analysis of the UV fluorescence photos of the Shroud….","date":"2013-11-20","mins":"4:43 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-50196","author":"anonymous","post":"Personally, I see more than Jesus: I see the unconditional love of God for EVERY ONE OF US (no matter his religion, faith, unbelief, color of skin, whatever), which was incarnated in a real human being like every one of us… Like someone once told me: “Our lives are more precious in the eyes of God than his own life because he was willing to die for all of us!” This crazyness (a God who consider the lives of his creatures as being more important than his own life) can only be understandable through the heart and not the brain… And I think the more and more we contemplate the Shroud and the more and more we have some chances to finally understand this awesome truth full of hope for every one of us. End of the preach (for today). : ).","date":"2013-11-06","mins":"11:47 am","url":"https://shroudstory.com/2013/11/06/this-will-go-on-forever-and-ever-more-jesus-pareidolia-in-the-news/","cat":"news_&_views","title":"This Will Go On Forever, and Ever:  More Jesus Pareidolia in the News"},{"id":"comment-50197","author":"anonymous","post":"I can’t help to cite Paul here because he’s the one who summarize the best what I was talking about in my previous post : “For Jews demand signs and Greeks seek wisdom, but we preach Christ crucified, a stumbling block to Jews and folly to Gentiles.” (1 Corinthians)..","date":"2013-11-06","mins":"12:04 pm","url":"https://shroudstory.com/2013/11/06/this-will-go-on-forever-and-ever-more-jesus-pareidolia-in-the-news/","cat":"news_&_views","title":"This Will Go On Forever, and Ever:  More Jesus Pareidolia in the News"},{"id":"comment-42483","author":"anonymous","post":"That’s not a mobile page. A mobile page detects the device being used and automatically adjusts just like this blog does for all of its pages, menus, etc.. Smart phones and tablets have different characteristics. All subsequent pages, at least non pdf ones, should automatically adjust based on the device detected. That doesn’t work. Having to click on a so called mobile page is nonsense..","date":"2013-08-31","mins":"7:51 am","url":"https://shroudstory.com/2013/08/31/update-to-shroud-com-2/","cat":"news_&_views","title":"Update to Shroud.com"},{"id":"comment-29772","author":"anonymous","post":"I am not sure if this will post anonymously, that is my intention, I have entered anonymous in the blank for the name. If it doesn’t, oh well I included an informal resume because I believe it might give some credence to having been there, done that it is not intended as a personal trumpeting exercise. I have personal experience with peer review I have authored, co authored numerous manuscripts (>40) in scientific journals. I have submitted and been awarded multiple national research grants I have served as a reviewer on various journals and on various grant review panels. I am still invited to review articles for scientific journals on an ad hoc basis, several times a year. Peer review has its issues, it is not immune to bias egos and personal vendettas can enter into the equation, when they shouldn’t be a part of it. Overall, I believe the merits outweigh the bad things. A certain amount of respectability is awarded with peer review, as it should be it is difficult to imagine not having such a system in place to evaluate scientific findings. Peer review does not equal infallibility it does not guarantee that the results or the interpretation given to them are beyond reproach, never to be questioned it is the very nature of science to reevaluate and reinterpret previous results. Online publication has helped to speed up the peer review process, and make results more readily available, which in my opinion, is a good thing. Certainly, ideas and results can be presented elsewhere (non peer reviewed) that are scientifically sound. There is unquestionably a sense of bias in the scientific community at large when it comes to the science of the Shroud, but I don’t think writing off peer review is the way to go. In the end, good science stands the test of time, and will be extended upon results will either be supported or they will fall, irregardless of where the results are published..","date":"2013-04-07","mins":"1:55 pm","url":"https://shroudstory.com/2013/04/07/when-it-comes-to-the-shroud-of-turin-has-peer-review-lost-its-luster/","cat":"news_&_views","title":"When it Comes to the Shroud of Turin, Has Peer Review Lost its Luster?"},{"id":"comment-80125","author":"anonymous","post":"I’m glad to read this from you my friend!.","date":"2014-02-17","mins":"5:35 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?"}]
