[{"id":"comment-52975","author":"anonymous","post":"Quote: “The fact that they did not find conclusive evidence is telling.” THIS IS SO TRUE, ESPECIALLY FOR THE BLOODSTAINS… This fact alone is enough to understand the genuineness of the Shroud as a real burial who enveloped for a short time the dead and crucified body of a man who looked like Jesus of the Gospel. Quote : “I found it interesting in Barry’s EWTN interview that he mentioned the Tilma of Guadalupe and how, based on the existing evidence, he thinks further testing would “disappoint” people.” I was very surprise myself to hear Barrie said those words and I talked with him about that, thinking like you do David, that this was a statement that was meaning the Tilma was not authentic (on the contrary to what I was thinking up until now). Here’s what Barrie wrote to me about that (I don’t think he’ll be mad,if I post this here): “It is simply that I am only interested in one relic (which I have studied for more than 35 years) and it keeps me busy 12 hours a day, seven days a week! I will leave the study of the Tilma to others and be happy to read their conclusions.” It’s interesting to note that this personal answer of Barrie to me was somewhat different (at least at first sight) versus what he said in the EWTN program. Effectively, it was easy for anyone who heard him talk about the Tilma in this program to extrapolate his words as meaning the there were strong evidences to support the conclusion that this relic was false, but when I read his personal answer, I understood that it was probably not what Barrie meant in the EWTN program….","date":"2013-11-27","mins":"4:44 pm","url":"https://shroudstory.com/2013/11/27/a-guest-posting-by-yannick-clment-solid-as-a-brick-wall/","cat":"guest_posting","title":"A Guest Posting by Yannick Clément: Solid as a Brick Wall"},{"id":"comment-10245","author":"anonymous","post":"Hullo Colin! The unequivocal motto for archmiraculists in Latin shall read: Video quid velo videre (“I see what I want to see). As the one for archfraudulists, it should be: Non video quid non velo videre (“I don’t see what I don’t want to see”) THE TURIN SHROUD MAN BODY’S NEGATIVE IMAGE DEFINITELY IS A CONTACT AND PROGRESSIVE LOSS OF CONTACT IMPRINT (it is not a mere contact imprint as you contend; you are half wrong yet you are right and have some merit in debunking an allegedly “miraculous image” (it is a providential one DUE TO A SECOND TEMPLE PERIOD/SPECIFICALLY JUDEAN BURIAL RITE consisting in purifying the shed innocent blood of a Thorah Master and religious school Leader unfairly sentenced to death and executed in he Holy Land; his shed innocent blood being considered as a pollutant of the Holy Land then).","date":"2017-11-21","mins":"1:42 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/11/16/hello-all-you-media-reporters-whether-mainstream-msm-minor-tributary-mtm-or-obscure-backwater-media-obwm-isnt-it-time-you-released-some-air-from-the-tyres-of-that-truth-bending-shroud-of-t/","cat":"agenda-driven_narratives","title":"Hello all you media reporters, whether mainstream (MSM), minor tributary (MTM)  or obscure backwater media (OBWM). Isn’t it time you released some air from the tyres of that truth-bending Shroud of Turin juggernaut?"},{"id":"comment-10241","author":"anonymous","post":"Re your comments “what none of them (Shroud researchers) seems to say – unlike Hugh Farey – is that the nose is FLATTENED! On Dan Porter’s blog Max Patrick Hamon wrote: (as early as October 24, 2012 at 3:04 pm) – “Reminder: In the mortuary/morgue, corpses with “a skewed nose” are a well known fact. It is mainly due to having a corpse fin in in a zipped up body bag that was originally too small and cause excessive pressure on the defuncted’s face.” (and on October 25, 2012 at 7:27 am); Max Patrick Hamon also wrote: – “The visual fact is, anyone observing the TS man’s face will (at first and maybe even second and third sight) see an ‘almost’ normal nose. However a very close examination of the face in terms of geometrical projection made from a life size photograph tells us ‘a quite different story’: To the sole exception of the bony areas of the eye sockets and nasal septum, all the rest of the face shows irregular features and displacements. Reminder here: – the TS man’s face was compressed by a sindon, sweat veil and skull cap (not to mention the possible recurr to a smal “jaw box” made of three wooden pieces to keep the mouth closed, see my reconstruction). Now a forensic examination of the nose area reveals that in this operation the cartilaginous or fleshy rounded part of the nose would have been squashed. Now a forensic examination of the Sindon face tells us this area is not only squashed but also turned to the left with the TS man’s face right profile appearing as if embedded in his facial image..In the mortuary/morgue, corpses with “a skewed nose tip” are a well known fact. It is mainly due to having a corpse fin in a zipped up body bag that was originally too small and has caused excessive pressure on the defuncted’s face.” ..","date":"2017-11-20","mins":"1:14 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/11/16/hello-all-you-media-reporters-whether-mainstream-msm-minor-tributary-mtm-or-obscure-backwater-media-obwm-isnt-it-time-you-released-some-air-from-the-tyres-of-that-truth-bending-shroud-of-t/","cat":"agenda-driven_narratives","title":"Hello all you media reporters, whether mainstream (MSM), minor tributary (MTM)  or obscure backwater media (OBWM). Isn’t it time you released some air from the tyres of that truth-bending Shroud of Turin juggernaut?"},{"id":"comment-36479","author":"anonymous","post":"Mr. Schwortz, 87 GB isn’t all that much. A family with 2 teenagers, with itunes and netflix, downloads more than that in a month through a narrow cable or DSL connection. You don’t need more money for bandwidth. It sounds like you’re running on an old hosting contract that hasn’t been renegotiated in years. I know you could find any number of high capacity, high speed web hosting providers who would host shroud.com for less than $10 per month including unlimited storage and unlimited bandwidth. See http://www.consumer rankings.com/hosting/pricing/. When was the last time you shopped for hosting. As a worst case, you should be able to get 500 GB of free bandwidth per month. Overage charges shouldn’t cost more than $10 per 50 GB of extra bandwidth. See http://www.consumer rankings.com/hosting/bandwidth/. I say get a better deal from Impulse or changes providers. Changing providers is easy. Most companies will move your complete set of directories and files and transfer your domain while you sleep just to get your business. It sounds like you could raise $3000 by renegotiating your contract. I tell my clients to renegotiate every two years. Impulse, I notice, doesn’t show prices on their website. Hmmm..","date":"2013-06-08","mins":"5:47 pm","url":"https://shroudstory.com/2013/06/04/the-high-price-of-success-at-stera/","cat":"kelly_kearse","title":"The High Price Of Success at STERA"},{"id":"comment-74244","author":"anonymous","post":"I have no indication that what was transferred to Constantinople in 944 was not the official relic known as the Image of Edessa, which was associated with the Abgar legend. In fact, I have read that the emperor of Constantinople sent to Edessa men he trusted to make sure that what he was about to get was the real thing… Why such a question in link with mine?.","date":"2014-01-23","mins":"10:45 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74291","author":"anonymous","post":"You ask: “can we be sure that this is one and the same cloth that miraculously cured King Abgar, according to the legend? ” I think the simple fact that the letters associated with the legend are obviously false is a very good piece of evidence to think that the Mandylion that was transferred from Edessa to Constantinople was most probably false too and could have even been forged some time (maybe centuries) after the letters. Seriously, I don’t think that there ever have been a miraculous healing (from Jesus or anyone else) of the historical king Abgar V… I don’t have the same opinion about the possibility that there could really been a lot of real historical things that we can extract from this legend… By the way, I still wait to receive a clear answer from you concerning my good question!.","date":"2014-01-23","mins":"5:37 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74602","author":"anonymous","post":"O.K., I don’t see where you are going with this question… Can you please answer clearly the question I asked you here: https://shroudstory.com/2014/01/18/wilson shroudies vs academia another guest posting by o k/#comment 74094 Instead of answering me with another question, I would prefer that you simply tell me what you really think about the complete absence in ancient written sources as well as in ancient artistic depictions of the Mandylion of a clear and evident link between this relic and the various versions of the Abgar legend) and the Shroud of Christ (or at least the crowning with thorns, the crucifixion or the entombment of Christ)….","date":"2014-01-25","mins":"8:01 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74736","author":"anonymous","post":"1. If we take the Acts of Thaddeus and the writings of John Damascene, we know that the Image of Edessa had nothing to do with a burial cloth. If we take the Doctrine of Addai, we even know that this image was painted by an artist. 2. A painter’s canvas. Note that some ancient sources seem to refers to the Mandylion as being on a wood panel instead of a linen cloth, which is also another material support that was often used in ancient time to make paintings….","date":"2014-01-26","mins":"7:26 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74750","author":"anonymous","post":"For the first question, I would have to make a new search but I’m sure that some ancient sources (a minority I guess) talk about the image being on a wood panel. For the “not made by human hands” tag, why do you take this for granted as if it was a proving thing? If the orthodox Church wanted to make believe the relic was truly sacred, making believe the image on it was “not made by human hands” was the best thing to do. And for your question: “what are the differences between the common vision of Mandylion and the Shroud?” I answer: the most obvious is the fact that the Mandylion was not considered as a burial cloth and the image on it was reported to show an image of the living face of Christ with no signs of injuries or bloodstains. And for your last question, I’m not sure to follow you… What object satisfy what descriptions? Do you mean the ones we found in most ancient texts talking about the Abgar legend? If that’s what you mean, I would answer: Surely not the Shroud of Turin, since the cloth described in most ancient manuscripts related to the Mandylion talks about a small towel showing the face of the living face of Christ with no signs of injuries or bloodstains and many of them (i.e. Mostly lists of relics from Constantinople) talks about two different relics of Christ: the Mandylion and his burial shroud. Also, note that none of those references (including the 958 letter of Constantine) associated DIRECTLY the Mandylion with a relic of the Passion of Christ (which greatly support the conclusion that the Mandylion had nothing to do with a burial cloth)..","date":"2014-01-26","mins":"8:25 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74755","author":"anonymous","post":"Do you talk about the Veronica vail or something similar? I truly don’t understand where you are going with all this..","date":"2014-01-26","mins":"8:52 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74838","author":"anonymous","post":"Stop playing games and please tell me what you really have in mind… If Damascene, the author of the Doctrine of Addai and the author of the Acts of Thaddeus (among a bunch of others) are correct, then you should stop believing that the Mandylion had something to do with the Shroud of Turin….","date":"2014-01-27","mins":"11:45 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74839","author":"anonymous","post":"By the way, the legend of Veronica was the occidental version of the Abgar legend. No way this cloth known as the Veronica vail could be authentic and dated from the time of Christ. Such a relic was probably created during the crusades when the Western crusaders came back from the Middle East with the Mandylion in mind….","date":"2014-01-27","mins":"11:46 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74878","author":"anonymous","post":"You said: “Can’t playing games, and you want to teach everyone what Mandylion was and what wasn’t? Poor your insight in that matter is, Yannick. Because Mandylion is one great riddle, and one must find an answer to that…” My answer: “Why should this be a “riddle”? Don’t you think there are enough converging evidence from both written and artistic sources to conclude this was most probably a small cloth showing only the face of the living Christ, without any signs of injuries or bloodstains? I think that if someone really see any “riddle” in all the literature and artistic depictions related to the Mandylion, it’s simply because this person WANT DESPERATELY to see such a thing, while putting deliberately aside the vast majority of the evidences we got.” You also said: “Wisdom of yours, of course. But the matter is more complicated, than your simple minded FACTS. For one should remember there were more miraculous images in the East, at least two come to mind, the Image of Edessa, and the Image of Camulia. Https://shroudstory.com/2013/10/25/the image of camuliana/ More direct clues hardly possible, I think.” My answer: “It’s true that there were some more “miraculous” images of Christ in the East and the fact that they all appeared around the same era should ring a bell to you in the sense that such an appearance of miraculous imprints really seem to suggest forgeries (at least, it should, if you’re not biased in favor of Wilson’s ideas).”.","date":"2014-01-27","mins":"5:21 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74879","author":"anonymous","post":"I should have wrote “such a SUDDEN appearance of miraculous imprints really seem to suggest forgeries.”.","date":"2014-01-27","mins":"5:22 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74881","author":"anonymous","post":"Sorry O.K. But the real Mandylion associated with the Abgar legend was most probably destroyed in the Sainte Chapelle of Paris during the French revolution (after it had been taken there by St Louis King of France in the middle of the 13th Century)… This is not a 100% sure fact but this is without a doubt that most probable hypothesis regarding the real Mandylion… All the other miraculous cloths that exist (such as the Veronica vail or the Mannopello vail) have nothing to do with the real Mandylion..","date":"2014-01-27","mins":"5:34 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74967","author":"anonymous","post":"And what if all those “miraculous images” were simply painted forgery made by some local churches, which were based on a common artistic source that came directly from the image of the face we see on the Shroud?.","date":"2014-01-28","mins":"10:50 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74969","author":"anonymous","post":"Additonal note : In my mind, this « common artistic source » was probably the Pantocrator icon. We know that such an icon already existed around the year 500 A.D. In Revenna Italy, which is prior to all the appearance of those « miraculous images » supposedly « not made by human hands »….","date":"2014-01-28","mins":"10:54 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74975","author":"anonymous","post":"Look, you got a good imagination. I prefer to follow good sense and sorry but the vast majority of literary as well as artistic evidences point to the fact that Wilson’s hypothesis is dead wrong and that all those images supposedly “not made by human hands” were false relics. Look, it’s evident that all those “miraculous images” can’t all be authentic. And why believing that even one of those can be? Where’s the solid link you got from ancient sources to take one of those images back to the empty tomb in Jerusalem? The Abgar legend? Come on. Be serious please..","date":"2014-01-28","mins":"11:47 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73634","author":"anonymous","post":"This post by O.K. (along with the opinions of Scavone and Tycner Wolicka) proves what I always say: in historical research, you can make all kinds of extrapolations… Let’s avoid any kind of extrapolation for a second… Here’s what we can take out of the list of relics included in the 958 letter of Constantine VII: 1 The list include the words “spargana” (normally meaning “small cloths” or “linen strips”) and “sindon” (normally meaning “shroud” in the context of such a list of relics of the Passion), which are often found together in many lists of relics from Constantinople (dated between the middle of the 11th century and the beginning of 13th century) as well as in the list of relics of the Passion that we found in the manuscript entitled De Imaginibus writen by St John Damascene in 726 or 730. This is not at all unusual to see both terms in a list of relics of the Passion and there is not a single one of those list that contain one specific term or mention to suggest that the sindon can be the same thing as the Mandylion (or even just related to the Mandylion or the Abgar legend in some way). 2 The expression “which God wore” (Scavone translation) or “God carrying cloth” (Tycner Wolicka translation) should not be seen as a clear and direct reference to the presence of an image on the cloth. To remain prudent and rational, it is much more probable to understand Constantine’s expression as a way to say that this sacred shroud (sindon) was a cloth that covered the body of Christ in the tomb for some time after his death. 3 This list of the relics of Christ’s Passion made by Constantine VII DOES NOT INCLUDE A SPECIFIC AND CLEAR MENTION of the Mandylion. 4 Since the terms “Mandylion” and “Image of Edessa” were well known in Constantinople at that time, there is no good reason why Constantine VII would not have used one of them in his list if he would really have wanted to include the Mandylion in his list of relics of the Passion. 5 The fact that Constantine’s list of relics doesn’t contain a specific mention about the Mandylion is very interesting because we can find EXACTLY the same thing in the Damascene manuscript I mentioned above! Effectively, if we compare the list of Damascene and the list of Constantine VII, we find out that they are VERY SIMILAR in their content and that they DOESN’T mention specifically the Mandylion as being a relic of the Passion. And what is very important to note is that the Damascene manuscript talk also specifically about the Mandylion and the Abgar legend but in another section (another book to be exact), which means that, for St John Damascene, the Mandylion had NOTHING TO DO with a relic of the Passion, which is something we can also find in the Acts of Thaddeus (with a specific mention to the burial cloths in the lost tomb in a part of the story that has nothing to do with the miracle of the imprint of Jesus face on a towel). Rational conclusion (which try to avoid to make any wild extrapolation or speculation): We have a list of relics made by Constantine VII in 958 that doesn’t talk specifically about the Mandylion (even though this great relic arrived in his city just 14 years earlier), but that specifically mention the same burial cloths associated with Jesus’ Passion as many other later lists of relics from Constantinople, as well as a previous list made by St John Damascene in 726 or 730. And since Damascene’s list is very similar to the list of Constantine VII, we have to conclude that they most probably refers to the same “batch” of relics of Christ’s Passion. Now, is it still possible that the Mandylion could have been present in those lists, even though none of them made a specific mention of that cloth (in some hidden way or because some of them used some vague terms to talk about it)? We have to say “no way” to this question. Effectively, we can be confident to say this for the good reason that it was clear for Damascene (as well as for the author of the Acts of Thaddeus) that the Mandylion had nothing to do with a burial cloth of Christ’s Passion… So, since it was clear like this for Damascene and since his list refers probably to the same “batch” of relics as the one of Constantine VII, we can conclude that Constantine’s list most probably doesn’t refer at all to the Mandylion and therefore, we can also conclude that the Mandylion and the Shroud of Christ were 2 separate cloths and that the Mandylion was not a relic of the Passion of Christ (just like we can see for ourself in every known depiction of the Mandylion). Seriously, once we compare this list of relics made by Constantine VII to the one made by Damascene and once we understand that, for Damascene, the Mandylion had nothing to do with a relic of the Passion, we can therefore consider this 958 letter writen by Constantine VII as another good piece of evidence to support the conclusion that the Mandylion was a different cloth than the Shroud of Christ and that this shroud had nothing to do with the Abgar legend in any way. Of course, with lots of speculations and extrapolations, people can come to a different conclusion (Scavone and Tycner Wolicka’s point of views are there to prove this), but if we avoid to do those kind of wild spéculations and extrapolations (like I think I have just done so), then we must conclude that the Mandylion was most probably a different cloth than the Shroud of Christ and that it had nothing to do with a relic of the Passion of Christ..","date":"2014-01-18","mins":"10:20 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73637","author":"anonymous","post":"Complementary note: All along my researches on the subject, I have not found a lot of reference concerning this 958 letter of Constantine VII. For example, many scholars said that the first references to the presence of a shroud of Christ in Constantinople was dating of the middle of the 11th century and was found in a list of relics… To be honest, I came to know this letter only via the paper of Scavone and the fact that another scholar talk about it (Tycner Wolicka) seem to confirm its authenticity. Nevertheless, because of this low number of references, I would like to know the opinion of real historians (like M. Freeman or someone else) on this subject. In other words, can M. Freeman or someone else can confirm to me, without any doubt, the authenticity of this 958 letter? Thanks..","date":"2014-01-18","mins":"10:52 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73746","author":"anonymous","post":"Matthias, here’s one question for you: If you are an historian and you have 100 authentic ancient documents in front of you and 99 of those are talking specifically about the imprint of the face only of the living Christ… Would you throw all those references to the garbage and only keep the one that is different? By doing so, you would prove as much non profesionnal and completely biased as the ones who only take the C14 dating result of 88 to disprove the authenticity of the Shroud! My advice for you: please don’t fall into that trap! The document you mention is the only one I know (along with maybe another one writen later on) that mention specifically the presence of a full body image on the Mandylion, while there are tons of ancient manuscripts who are talking specifically about a simple image of the face of the LIVING CHRIST. Don’t you think these 2 “outsiders” references to a full body image could simply be due to a mistake on the part of their authors (who were probably not eye witnesses of the relic) in the understanding of the reality of the Mandylion, maybe caused by the presence of a full body image of Christ’s body on another Sacred cloth related to Christ, namely his burial cloth? I think this is a rational and fair assumption….","date":"2014-01-19","mins":"6:07 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73751","author":"anonymous","post":"O.K., the best response I can give to your post can be found in this new comment of mine: https://shroudstory.com/2014/01/18/wilson shroudies vs academia another guest posting by o k/#comment 73748 After reading this, I hope we could keep on a nice and productive exchange! Nevertheless, I would like to make some specific comments to what you said here: You said: “the term Mandylion itself first appears around 990 in a biography of a monk Paul from Mt. Latros (although I saw claims of earlier apperance) and is quite rarely used. The Mandylion is described in various sources as mantile, himation, tetradiplon,cheiromaktron, manutergium among others.” My answer: Honestly, I cannot tell if you’re right or wrong here, but one thing I know (because I have read a lot of ancient sources on the subject): Almost everytime you find a reference in an ancient source about the Mandylion (or the Image of Edessa), you also find a pretty clear reference to the Abgar legend! Taking this into account, I remind you that, in this 958 letter of Constantine VII, there is no specific mention about the Mandylion, the Image of Edessa or simply about the Abgar legend. Therefore, any conclusion that maintain that there is a real reference to the Mandylion in this letter of Constantine is a pure speculation that have no solid historical or textual base. This is exactly what I meant by “WILD SPECULATION”. You also said: “All the lists about the relics of the Passion are very similar, because the set of items was well known, and it not necessarly mean that all those relics were in possesion of Emperors at given time.” My answer: Because those lists are so similar (this is true for the lists mentioned by Damascene and Constantine VII, as well as for many other later lists of relics from Constantinople), I think the most rational conclusion we can draw is to assume that they were both talking about the same “batch” of relics of the Passion. Effectively, I have a real hard time to believe that, around the same era, there could have been 2 different batch of relics that could have included all those same items that we find in the lists mentioned by Damascene and Constantine VII. Of course, we can’t be 100% sure about this, but the most rational conclusion is certainly the one I just draw… Look at the description of both list I made in my new comment and you’ll see that the number of similar items is very high and, therefore, push in favor of my conclusion: https://shroudstory.com/2014/01/18/wilson shroudies vs academia another guest posting by o k/#comment 73748 One last thing about this: In order for my analysis and conclusion to work all right, it is not important if the “batch” of relics described by Damascene were already kept in Constantinople or were kept elsewhere (in Jerusalem for example) at the time he was writing. The only important thing to note is the great similarity that exist between both lists, which indicate a high probability that both authors were talking about the very same “batch” of relics of the Passion… You also said: “It is impossible to avoid wild speculations here and you hadn’t done so. Your reasoning has several hidden assumptions, of which you are maybe not even aware. My answer: There’s a huge difference between making the most rational assumption you can do (without any bias in favor or not of Wilson’s hypothesis and only based on what we can find in ancient sources) and the kind of wild speculation I just mentioned… You also said: “For example you assume that John Damascene knew the true nature of the (contemporary version) of the Mandylion in Edessa, which is not certain, he probably knew only legendary version of it.” My answer: What I assume (and this is only based on what we find in the texts) is this: For Damascene, AS WELL AS FOR THE AUTHOR OF THE ACTS OF THADDEUS, the Mandylion was a completely different cloth than the Shroud of Christ and had NOTHING TO DO with his Passion, death and burial. And such views of these 2 ancient writers is in total agreement with all the known artistic depictions of the Mandylion. I think it’s fair to say that when you put all those solid references and pieces of evidences together, it is not hard at all to conclude that the Mandylion was not the same cloth as the Shroud of Turin… This is how the historical method should be used. I hope M. Freeman can back up my statement here! You also said: “You also assume that Constantine VII shared Damascene views, which is another assumption. And so on.” My answer: Because of the high similarity of both lists of relics of the Passion (see again: https://shroudstory.com/2014/01/18/wilson shroudies vs academia another guest posting by o k/#comment 73748), it’s pretty fair to assume that both writers were talking about the same “batch” of Christ’s relics. And taking this probable fact into account, here’s my thinking: since it was very clear for Damascene and for the author of the Acts of Thaddeus (as well as for many authors who made lists of relics of the Passion in Constantinople between the middle of the 11th Century and the 13th Century) that the Mandylion was a completely different cloth than the Shroud of Christ (and his other burial cloths), then it is pretty fair to conclude that the spargana and the sindon mentioned in the list of Constantine VII also doesn’t refer at all to the Mandylion..","date":"2014-01-19","mins":"6:37 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73752","author":"anonymous","post":"I agree 100% with M. Freeman. My long inquiry on the subject convinced me that all he said here is most probably the truth..","date":"2014-01-19","mins":"6:39 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73820","author":"anonymous","post":"There’s just one addition I would like to make versus the comment of M. Freeman who said that, most probably, the Mandylion was forged during the 6th Century. In regard of all the known ancient sources (particularly the Doctrine of Addai and a testimony of the 5th century), I think there is another interesting possibility… I think it is possible that the Mandylion was originaly created (painted) around the time the Doctrine of Addai was written (around 400 A.D.) in order to back up the fact that, in this legendary text, there is a mention of a portrait of Christ made by the artist of king Abgar, which was supposedly taken back to Edessa and given to the king, who placed it in his palace. So, how about this: Could it be possible that, at first, the Image of Edessa was not considered at all as a Holy relic with a miraculous imprint of Jesus face on it, but simply as a painted portrait of Jesus that would have been made by an artist of king Abgar, during Jesus lifetime (which is what we got in the doctrine of Addai) and, later on, probably during the 6th or maybe the 7th century, the Byzantine Church (with the help of the Acts of Thaddeus and the manuscript of Evagrius Scholasticus) made believe that this painted portrait of Jesus was not at all a manmade portrait but was truly a miraculous imprint of his face? Note that this “change” of nature would have occurred at least 150 years or maybe more after the creation of the painted portrait of Jesus and I think it is possible that a gradual fainting of the portrait’s colors could explain the later idea that such an image had been miraculously created by Jesus with the help of his sweat. Again, this is just a possibility that I throw to all of you for your personal reflection….","date":"2014-01-20","mins":"11:52 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73825","author":"anonymous","post":"Additional note : The switch of nature that would have been made by Church for the Image of Edessa would certainly have been done for theological and teaching purpose (especially to fight against all the various and numerous heretic groups that were present in the Middle East at that time). A sort of pious fraud (which would certainly not have been the first or the last done by the Church over its long history!)….","date":"2014-01-20","mins":"12:01 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73747","author":"anonymous","post":"I would like to add a comment versus the assumption that because we can find a version of the miraculous imprint of Jesus’ face in Gethsemane in the Narratio, that means there was some bloodstains on the Mandylion. Sorry, but this is another pure extrapolation made by people who desperately want to back up the hypothesis of Wilson. First of all, in the Narratio, we can find 2 versions of the same legend and one of them still locate the action before the Passion of Christ (which can be seen as the “traditional” version of the legend). This is important because if the second version was due to a better understanding of the hypothetical bloody nature of the Mandylion, it is highly probable that the author of the Narratio would have only kept the new version (while putting the focus on the presence of blood in the sweat, which is not the reality), while leaving aside the “traditional” version of the legend. Secondly, and this is more important, the location of the action in Gethsemane is probably due to the presence of the word “sudarium” in another previous manuscript of the legend, which is used to describe the cloth that was used to Jesus to wipe his face, leading to the miraculous imprint. This previous manuscript if called “The letter of the three patriarchs to Emperor Theophilus of Constantinople”, which is dated to the first half of the 9th century. Even though this text used the word “sudarium” to describe the cloth with the miraculous imprint, it still located the action BEFORE the Passion of Christ (the letter specified that the miraculous imprint happened “while the Lord and Saviour was on earth”), which is similar to the “traditional” version of the Abgar legend, which locates the miraculous imprint some days before the beginning of Jesus’ Passion! In fact, it most probably used that term “sudarium” simply because the author of the text said that it was Christ’s sweat (instead of the water he used to washed his face, which is found in the first versions of the legend) that was used by him to produce the miraculous imprint OF HIS FACE ONLY (the text is specific about the fact that Jesus only wiped his face with the cloth). Note that, in this version, the sweat of Christ had NOTHING TO DO with the bloody sweat described by St Luke in the story of the Passion… Taking all those information into account, I think it’s fair to conclude that this new version that we find in the Narratio (which locate the action in Gethsemane) is only an extrapolation that originate from the previous use of the word “sudarium” by the author of “The Letter of the three patriarchs to Emperor Theophilus of Constantinople” and his idea that the miraculous imprint was done by Jesus with the use of his sweat (again, normal sweat in this version and not the bloody sweat described by St Luke in his Gospel). What reinforces this assumption is the fact that we can find a direct reference to this particular letter in the Narratio! It is also possible that such a change of location was also inspired in some way by some theological views of the Church of Constantinople, which we can possibly found an echo in Gregory Referendarius’ speech (which, as Guscin told us in a paper he wrote some years ago, can’t be taken in any way as a clear and direct reference to the presence of bloodstains on the Mandylion)… On this subject, it is very interesting to note that, in his speech, Gregory refers also directly to this letter of the three patriarchs, which shows the great influence this manuscript (and the reference to the sweat used by Christ to form the image on the cloth) had in Constantinople at the time the Mandylion came to this city (which is the same era in which the Narratio was written). In such a context, it is highly probable that the development of the second version of the Abgar legend we see in the Narratio (which located the action in Gethsemane and talk about the bloody sweat of Christ), as well as the speech of Gregory, was mainly influenced by this letter of the three patriarchs and his reference to a sudarium and the sweat used by Christ to form the image on that cloth (again, a normal sweat and not the bloody sweat of Gethsemane). Again, to understand an important change in the legend of Abgar, it’s very important to understand the historical context and to take into account the previous texts that talk about the Abgar legend and the story of the miraculous imprint of Jesus’ face. One last note: In the second version of the legend that we find in the Narratio (which locate the action in Gethsemane), the focus is put in his sweat (which he would have wipe out with a cloth, thus producing the miraculous imprint), and not on the blood that could have been present in his sweat. Taking this new version that is found in the Narratio and extrapolate that this is a clear piece of evidence that there were bloodstains on the Mandylion is just something any good and honest scholar would never do… Once we put things in the right context, such an idea is clearly a wild extrapolation, just like the idea that Gregory Referendarius’ speech contains a direct mention to the presence of bloodstains on the Mandylion..","date":"2014-01-19","mins":"6:08 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73806","author":"anonymous","post":"Thank you very much M. Freeman! I just want to share the information I get over my long inquiry on the subject….","date":"2014-01-20","mins":"9:31 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73810","author":"anonymous","post":"And to share also my long reflection on the subject from the point of view of someone who believe the Shroud is authentic but who became convinced that the Mandylion cannot be the same thing as the Shroud….","date":"2014-01-20","mins":"10:12 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73748","author":"anonymous","post":"Just to emphasize what I said about the great similarity that exist between the list of relics of the Passion that we find in the manuscript « De Imaginibus » writen by St John Damascene in 726 or 730 and the list of relics of the Passion we can find in the letter of Constantine VII written in 958, here’s the details of both lists: Damascene’s list: –The wood of the cross –The lance –The sponge –The reed –The nails –The sacred linens (spargana, which can be translated as “small cloths” or “linen strips”) –The shroud (sindon) Constantine’s list: –The wood of the cross –The lance –The titulus of the cross –The reed –The sacred blood of Christ –The tunic –The sacred linens (spargana, which can be translated as “small cloths” or “linen strips”) –The shroud (sindon) I hope this is enough for you to conclude, like me, that both authors were most probably referring to the same “batch” of relics of Christ’s Passion. Effectively, it is highly improbable that, between Damascene and Constantine time, there could have been two separate “batch” of relics of Christ’s Passion so similar in their content. But since Damascene doesn’t tell where those relics were kept, it is impossible to know if they were already kept in Constantinople at the time he was writing his manuscript. Nevertheless, the fact that he made a clear separation between those relics of Christ’s Passion and the Abgar legend (including the Mandylion) must be considered with great care when it’s time to analyze the content of Constantine’s list, because the relics mentioned by this Emperor of Constantinople were most probably the same relics as the ones mentioned by Damascene some 200 years earlier… Note that because of the proximity in time between the testimony of Arculf (who saw a shroud of Christ in Jerusalem in 670) and the manuscript of Damascene (726 or 730), it’s truly possible that the Shroud mentioned by Damascene was the same as the one Arculf saw in Jerusalem and, therefore, it is also truly possible to think that this shroud of Christ was still kept in Jerusalem at the time Damascene was writing his manuscript. This assumption is reinforced by the fact that Damascene included many Holy places of Palestine (he mention, among other places, Mont Sinai, Nazareth, Bethleem, Golgotha, the Holy sepulchre, the mount of olivier, the garden of Gethsemane, etc.) along with his list of relics of Christ’s Passion… To summarize all I said in all the posts I made on this topic, I would say this: IF (the “if” is important of course) the burial cloths mentioned by St John Damascene in his list of relics of the Passion are the very same cloths as the ones mentioned by Constantine VII in his own list of relics, then we have to conclude that Constantine’s list doesn’t contain any reference to the Mandylion as being a relic of the Passion of Christ and, therefore, the Mandylion was not the Shroud of Christ and had nothing to do with his Passion, death and burial, which would be totally consistent with the vast majority of the versions of the Abgar legend and totally consistent also with all the known artistic depictions of the Mandylion. And to conclude, I want to say this: Because I’m convinced that the Shroud of Turin is the authentic burial cloth of Jesus of Nazareth, I would like to find as much as you a rational historical path for this cloth from the moment it was found empty in the empty tomb to the time it get to Lirey, France in the middle of the 14th century. Nevertheless, because of my long inquiry on the subject, I am profoundly convinced that the Mandylion’s trail is not the right path to follow in order to build a rational history for the Shroud before his arrival in Lirey. The only value I’m ready to give to the Mandylion is the probable fact that such a depiction of the face of the living Christ was based (directly or, more likely, indirectly) on the image of the face of Christ that we see on the Shroud of Turin. No more, no less than this. And for the Shroud’s ancient path, to remain prudent, I like to think that it was quietly transferred directly from Jerusalem to Constantinople at some unknown date (possibly before the transfer of the Mandylion, if the letter of Constantine VII is authentic). After all, from ancient sources, we know that other relics of Christ’s Passion (like the lance, the sponge, the wood of the cross, the crown of thorns, etc.) were transferred that way directly from Jerusalem to Constantinople for their protection, without ever spending one day in Edessa… Question: Why those transfers are known and not the transfer of the Shroud? Maybe because this relic was more important than the others (which would have made it more attractive for the enemies of the orthodox Christians like the Arabs, the Persians or some heretic group). Consequently, for its protection (and maybe to avoid some invasion thread of Constantinople), it was better not to tell anything about such a transfer and keep it secret. Of course, this is just a possible explanation and others can be put forward… But in the end, whatever the reason, I still believe that, in the light of all the known historical sources concerning both the relics of the Passion and the Mandylion, a direct transfer from Jerusalem to Constantinople without a séjour in Edessa is the most rational and prudent hypothesis we can draw for the Shroud of Turin. I hope that even the most fanatical of Wilson’s fan out there will at least recognize that such a hypothesis is POSSIBLE (I don’t say probable, just possible)..","date":"2014-01-19","mins":"6:09 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73754","author":"anonymous","post":"Note: I just realize that there are 2 words in French in my previous post: Mount of olivier: Read “Mount of Olives” Séjour: Read “stay”. Sorry..","date":"2014-01-19","mins":"6:47 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73842","author":"anonymous","post":"Why don’t you start by answering the very good question (which I’m really not sure you ask yourself before) that can be found at the end of this comment of mine: https://shroudstory.com/2014/01/18/wilson shroudies vs academia another guest posting by o k/#comment 73832.","date":"2014-01-20","mins":"3:24 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73845","author":"anonymous","post":"O.K., I don’t say this to be mean, but simply because this is a question that I rarely see asking regarding this issue of the Mandylion, while, to me, it’s the most important question of them all….","date":"2014-01-20","mins":"3:25 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73832","author":"anonymous","post":"Dave, I salute your open mindedness versus other hypotheses than the one proposed by Wilson, but I have to say that I disagree with you about your idea that his hypothesis (or something close to this) has some chances to be correct, especially when we take into account all the pertinent data (ancient sources, known artistic depictions, theological and religious context of the time in which the numerous changes to the original Abgar legend took place, etc.). Sorry but there are too many problems with this hypothesis (no matter if it’s one of the only hypothesis available out there) and, on the other hands, there are too many pieces of evidence that exist to show that the Mandylion was only showing the face of the living Christ without any bloodstains or injuries that, if we want to remain serious and honest, we must at least put the tag « highly doubtful » (if it’s not the tag « proven wrong ») over it. In the end, the most important question we must ask ourselves in order to judge of the validity of Wilson’s hypothesis is this one : Does the numerous changes we see in the Abgar legend, which occurred over the centuries are due, as Wilson think, to a better understanding of the real nature of the Mandylion (which would have occurred progressively) or wouldn’t it be due instead to some progressive changes in the socio cultural, religious and theological context in the Middle East (especially concerning the great fights of the orthodox Church against the various heretic groups out there at the time)? After my long inquiry on the subject, I highly favor this later possibility….","date":"2014-01-20","mins":"2:01 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73835","author":"anonymous","post":"Which can be seen as a good piece of evidence that such a legend, along with the Mandylion, had often been used by this orthodox Church for various purpose, including his fight against heretic groups… Of course, everything is a matter of how we interpret all the pertinent data surrounding this Abgar legend and the Mandylion, including the historical context of the Byzantine Church in the era prior to the arrival of Mandylion in Lirey..","date":"2014-01-20","mins":"2:27 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73851","author":"anonymous","post":"Shroud… He he ! A big lapsus….","date":"2014-01-20","mins":"3:53 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73852","author":"anonymous","post":"What I really meant was in Constantinople….","date":"2014-01-20","mins":"3:53 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73853","author":"anonymous","post":"Anything I can say here is a total waste of time. People are so biased in their view that it makes me sick. I quit..","date":"2014-01-20","mins":"3:55 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73855","author":"anonymous","post":"I highly recommand to Wilson’s fans to buy every books of Dan Brown. If you love Wilson’s crazy ideas, you’ll also love Brown’s own fantasies… Don’t you realize that if every credible scholars would think like you do, the true ancient history of the Shroud would never have any chance to be found one day?.","date":"2014-01-20","mins":"4:03 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73856","author":"anonymous","post":"Explanation: If people wonder why I’m so tired of this endless debate, it’s because I can’t stand seeing how much people in the pro Shroud world are willing to do or believe anything at all cost in order to save a hypothesis so weak as the one proposed by Wilson (or something similar involving the Mandylion). In any unbiased circle, such an hypothesis would have been set aside since a very long time and people would have tried hard to find a better solution. Sadly, this is not at all what I see in the pro Shroud world and this bad situation is going on for years now. Disgusting. It’s pretty evident that the solution for the Shroud’s ancient past lies elsewhere but most people around here are simply not ready to admit it..","date":"2014-01-20","mins":"4:22 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73858","author":"anonymous","post":"Last important note : I don’t pretend I have to answer for the Shroud’s ancient history but at least, I’m not willing to buy Wilson’s crazy and weak stuff simply because « this is the only credible (SIC) hypothesis we got to explain the Shroud’s ancient past ». I think I gave you some interesting possibilities that would need to be explored properly and I’m sure other interesting road to explore could be draw by other people. But sadly, I doubt that such a thing will be seen around here… Time to go now..","date":"2014-01-20","mins":"4:28 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73863","author":"anonymous","post":"I think you’re right Dan….","date":"2014-01-20","mins":"5:12 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73921","author":"anonymous","post":"I just want to let everyone knows that I made a little mistake in on of my previous comment. Effectively, I told you that we could found a reference for the transfer of some relics of the Passion directly from Jerusalem to Constantinople. I mentioned the wood of the cross, the sponge, the lance and the crown of thorns. This is where we can find my mistake! In fact, there is no reference anywhere concerning the transfer of the crown of thorns, even though there are references for the presence of this relic in Jerusalem and, later on, in Constantinople… This is important because it seems to be the same thing for the Shroud. And concerning the 3 other relics (the wood of the cross, the sponge and the lance), there really is a reference about their direct transfer from Jerusalem to Constantinople. I found it in a very interesting paper entitled “Sacred relics and Imperial Ceremonies at the Great Palace of Constantinople” that was written by Helger A. Klein in 2006. In this paper, we learn that this transfer happened in 629 and was reported in the manuscript “Chronicon Paschale”. Taking all this into account, I’ll leave you with this question: If there really were a direct transfer of some relics of the Passion from Jerusalem to Constantinople before the transfer of the Mandylion from Edessa to Constantinople, why wouldn’t it be the same for the crown of thorns and the Shroud? After all, based on ancient sources, these are the only 2 places that we know for sure (without having to use wild speculations and extrapolations) where those 2 relics were kept before the sack of Constantinople of 1204. In my mind, if we really want to base a hypothesis about the Shroud’s ancient history on solid ground, I think that a direct (but undocumented and maybe secret) transfer from Jerusalem to Constantinople is truly the most prudent path to follow..","date":"2014-01-21","mins":"9:30 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73929","author":"anonymous","post":"I gave you the reference: I found it in a very interesting paper entitled “Sacred relics and Imperial Ceremonies at the Great Palace of Constantinople” that was written by Helger A. Klein in 2006. In this paper, we learn that this transfer happened in 629 and was reported in the manuscript “Chronicon Paschale”. In this paper, I think the author tell us that those relics were first transferred to Constantinople in 629 for their protection during the Persian thread on Jérusalem and then they were brought back to Jerusalem and, later on, they were transferred again to Constantinople. I will check out the paper to see if I can find dates for these other transfers… So, it is possible that the lance seen by Arculf was the same as the one transferred to Constantinople in 629. I need to make a check on the dates….","date":"2014-01-21","mins":"10:14 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73930","author":"anonymous","post":"This is another true possibility… It’s surely not impossible that there were at least 2 Holy lances in the Middle East during the 7th century….","date":"2014-01-21","mins":"10:15 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73950","author":"anonymous","post":"And even then M. Freeman, good luck to find real solid pieces of evidence to build a real history of the Shroud from the empty tomb all the way to Lirey, without an interruption! I seriously believe that the Shroud had been kept hidden for centuries before he came to be known publicly. If I’m right, no way someone can find any reference for this cloth during maybe the first 4 or 5 centuries after the Resurrection of Christ. And even after this time, we got a lot of references to a Shroud of Christ (a few in Palestine and a lot in Constantinople), but each one of these (except the testimony of de Clari) doesn’t mention any image on it… In such a context, it’s very hard to tell if all those early references are talking about the Shroud of Turin or another shroud (or other shrouds)..","date":"2014-01-21","mins":"11:39 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73933","author":"anonymous","post":"I think the hypothesis of M. Freeman is the most probable… I have made a quick check in Klein’s paper and he only talk about many transfers back and forth between Jerusalem and Constantinople concerning the wood of the cross. At first, I thought he was speaking of the 3 relics I mentioned in my previous comment… So, I think the most rational explanation concerning Arculf testimony is to believe there were more than one Holy lance in the Middle East during the 7th century… Nevertheless, it is not impossible that there could have been some transfers back and forth between Constantinople and Jerusalem for the lance also, while those would not have been recorded on paper. But since we don’t know this for sure, I prefer M. Freeman’s hypothesis in the case of the Holy lance. By the way, if you want to read Klein’s paper, here it is: http://www.columbia.edu/cu/arthistory/faculty/Klein/Sacred Relics and Imperial Ceremonies.pdf Great paper!.","date":"2014-01-21","mins":"10:22 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73935","author":"anonymous","post":"In the end, what really matters is this : It is a PROVEN FACT that there were transfers of Holy relics related to the Passion directly from Jerusalem to Constantinople without a stay in Edessa before the transfer of the Mandylion in 944 and the letter of Constantine of 958. So, why not thinking this could also have been the case for the Shroud, but in a more quiet way that would not have been recorded? By the way, the same possibility is also there concerning the crown of thorns….","date":"2014-01-21","mins":"10:27 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73945","author":"anonymous","post":"The possibility I raised above is not at all in contradiction with the idea that Arculf’s shroud could have been the real shroud of Turin and that it could have been transferred after 670 directly from Jerusalem to Constantinople during an unrecorded and quiet transfer… If this would be the case, then we could think that the sindon mentioned in Constantine’s letter could be the very same cloth and that the Mandylion would have nothing to do with it. Of course, this is impossible to prove such a thing, but I think this is an interesting hypothesis..","date":"2014-01-21","mins":"10:55 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73988","author":"anonymous","post":"First of all OK, I must say that the hypothesis I have describe in my recent posts is something I have in mind for some years now! This doesn’t come from your own comments… And concerning your fixed idea that the Mandylion was the Shroud, I don’t understand why you gave so much credit to some posterior development of the legend, as they were due to a progressive discovery of the real nature of the Mandylion (burial nature), while the wild religious context of that era in the Middle East, along with some textual pieces of evidence we found in all these different versions of the legend, make it pretty evident (at least to me and to many scholars) that most if not all of those changes are most probably due to an evolution of the theological views of the Orthodox Church during those centuries, along with his constant desire to crush down all the heretical ideas and groups that were present in the Middle East and the desire also to teach the “right” doctrine to the people. In that regard, the Mandylion was most certainly one of the best “tool” the Church invented and developed to achieve his purpose. Question: Maybe I mist it, but I would like you to explain to me how in the world you can think the shroud that Arculf saw could have been the same thing as the Mandylion, while we know that, in 670 A.D., the Mandylion was still kept in Edessa and not in Jerusalem? I don’t understand how you can think the Shroud of Arculf could have been the same thing as the Mandylion….","date":"2014-01-21","mins":"4:50 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-74094","author":"anonymous","post":"O.K., from your comment above, it is obvious that, unlike myself and the vast majority of scholars, you believe that the various changes that occurred to the Abgar legend over the centuries were due to a better understanding of the real burial nature of the Mandylion that occurred progressively and very slowly (at least, it would seem so)… Taking this into account, I got a good question for you: If this idea first put forward by Wilson would be true, then can you explain to me how in the world we don’t find one single artistic depiction (some we have now where probably made by artists of the 12th century who were eye witnesses of the relic in Constantinople) that shows any signs of the supposed burial nature of the cloth and why in the world we don’t find one single manuscript of the Abgar legend that located the miraculous imprint after the crowning of thorns (while this is the most evident injuries we see in the face region of the Shroud) and also, why in the world we don’t find one single manuscript that DIRECTLY (without having to use wild assumptions) associate the Mandylion with a burial cloth? If the real burial nature of the cloth would have been progressively discovered over the centuries, don’t you think it’s a bit odd that no one would ever have tell the truth about it, except for some vague references that you think are evident clues? Seriously, I think someone must have an incredible imagination to believe that there would not have been one single ancient writer or artist that would have dared to tell the whole truth about the Mandylion!.","date":"2014-01-22","mins":"11:45 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."}]
