[{"author":"anonymous","post":"Too much enthusiasm is enemy of objectivity Dear Dr. Stephen Jones I praise such excellent and objective post.Those who claim you're an non objective authenticist should shut their mouths after reading this article on congruence points and instruments of crucifixion allegedly seen on the Shroud.Although we cannot deny that Dr. Alan Whanger's findings corroborate previous Paul Vignon's theory on Byzantine Christ icons his claims are indeed essentially subjective.I utterly agree with you on the claim of hammer and nails which is a «pareidolia».Nevertheless he has provided Shroud researchers interesting findings namely his claims on flower images on the Shroud that were confirmed by israeli botanist Professor Danim and its worth to remember a paper he wrote on X Ray photographs of the Shroud whose findings add more pieces of evidence against the validity of 1988 radiocarbon dating of the Shroud.To sum up Dr. Alan Whanger will be remembered as a dedicated Shroud scholar and his work will remain as a tool for Shroud researchers. Regards Antero de Frias Moreira and Maria da Glória Barroso (Centro Português de Sindonologia).","date":"2018-01-10","mins":"1:10 AM","url":"http://theshroudofturin.blogspot.com/2018/01/obituary-2-dr-alan-duane-whanger-17.html","title":"\nObituary (2): Dr. Alan Duane Whanger (17 July 1930 - 21 October 2017)\n"},{"id":"comment-51890","author":"anonymous","post":"The high level of bilirubin (much higher than normal) found by Adler is the data that strongly suggest the blood material on the Shroud came from an highly traumatized corpse and, funny, such a conclusion is in perfect sync with the body image of a beaten, scourged and crucified man we see on the cloth. Seriously Charles, if we use the Occam’s razor principle correctly, the most rational and probable answer for the image formation must lie in a natural (probably biological) interaction between the corpse and the surface of the cloth. And when we take into account all the data coming from the Shroud, again it’s funny, that’s exactly where they are pointing!.","date":"2013-11-18","mins":"11:56 am","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"author":"anonymous","post":"Has anyone here read the entire article?I'd like to see a rebuttal to it by Ian Wilson, if possible..","date":"2012-07-08","mins":"9:36 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n"},{"id":"comment-78126","author":"anonymous","post":"Oh did I love this comment from Anoxie! I agree 100% with all that was said….","date":"2014-02-10","mins":"4:46 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","title":"Colin Berry on Rogers’ Thermochimica Acta Paper"},{"id":"comment-78129","author":"anonymous","post":"Important question to all of you: What can best explain (rationally speaking) the ultra superficiality of the shroud image everywhere on the cloth, no matter if we look at a very dark zone or a very light one? Wouldn’t be the presence of a thin film of something that was mainly concentrated on the top surface of the cloth and which reacted chemically with another something coming from a dead and crucified body? If we take into account all the pertinent data coming from the Shroud (INCLUDING THE BLOOD AND SERUM STAINS EVIDENCE), I think the answer is YES..","date":"2014-02-10","mins":"4:51 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","title":"Colin Berry on Rogers’ Thermochimica Acta Paper"},{"id":"comment-78131","author":"anonymous","post":"I need to write down again my second question: Wouldn’t be the presence of a thin film of something that was mainly concentrated on the top surface of the cloth and which WAS THE ONLY THING TO REACT chemically with another something coming from a dead and crucified body IN ORDER TO EVENTUALLY PRODUCE THE YELLOW COLOR THAT IS 100% RESPONSIBLE FOR THE BODY IMAGE? Now that’s better… More clear..","date":"2014-02-10","mins":"4:54 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","title":"Colin Berry on Rogers’ Thermochimica Acta Paper"},{"id":"comment-57478","author":"anonymous","post":"No matter who was right about the exact location of the nail, the simple fact that it clearly came out in the wrist area at the back of the hand is a very important data regarding the Shroud that point in direction of the authenticity of the cloth, unless you think the Shroud can be the product of a very ancient forgery that was done before the abolition of crucifixion at the beginning of the 4th century with the help of a real crucified corpse who was scourged and crucified with the Roman method. Althought there is a slim possibility for such a scenario to be true, it is much more rational to see the Shroud as the authentic burial cloth of Jesus of Nazareth. This conclusion is not a religious statement and that doesn’t prove at all the reality of the Resurrection. Note: Personally, I’m fully convinced Barbet was right over Zugibe on the particular question of the nailing of the hands, for the simple fact that it is much easier to drive a nail directly through the wrists at an angle of 90 degrees of a person than diagonaly from the bottom of the palm all the way through the wrist… The Romans were genuous at finding the easier way to torture someone. They didn’t wanted to lose any time or effort doing their tortures..","date":"2013-12-09","mins":"4:43 pm","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","title":"Barbet vs Zugibe"},{"author":"anonymous","post":"You raise some fine points, but frustratingly neglect the role of bias in judging the usefulness and reliability of historians and their contributions. You seem fine to frequently, incessantly point out Walters' Metaphysical Naturalism, yet conveniently fail to examine your pro Wilson, pro Shroud, pro Christianity bias, Wilson's bias (and how it's made evident by his other texts), and even his former Oxford teacher's bias in his endorsement of him. Thankfully, you seem somewhat aware of bias and its significance, even if it is selective..","date":"2018-03-10","mins":"1:12 PM","url":"http://theshroudofturin.blogspot.com/2010/04/ian-wilsons-turin-shroud-theories-are.html","title":"\n`Ian Wilson's Turin Shroud theories are the worst kind of junk history'\n"},{"author":"anonymous","post":"This paper is similar to (which was reviewed at dshroud.com):John P. Jackson, Is the image on the Shroud due to a process heretofore unknown to modern science?, Shroud Spectrum International, no. 34, March 1990..","date":"2012-01-19","mins":"12:37 AM","url":"http://theshroudofturin.blogspot.com/2012/01/john-p-jackson-unconventional.html","title":"\nJohn P. Jackson, \"An Unconventional Hypothesis to Explain all Image Characteristics Found on the Shroud Image\" (1991)\n"},{"author":"anonymous","post":"Typo should read never fails to give us the very best.","date":"2012-01-26","mins":"12:27 AM","url":"http://theshroudofturin.blogspot.com/2012/01/john-p-jackson-unconventional.html","title":"\nJohn P. Jackson, \"An Unconventional Hypothesis to Explain all Image Characteristics Found on the Shroud Image\" (1991)\n"},{"author":"anonymous","post":"This is a great blog.","date":"2012-01-25","mins":"9:38 AM","url":"http://theshroudofturin.blogspot.com/2012/01/john-p-jackson-unconventional.html","title":"\nJohn P. Jackson, \"An Unconventional Hypothesis to Explain all Image Characteristics Found on the Shroud Image\" (1991)\n"},{"author":"anonymous","post":"Once again Stephen never fails keep up the great work on this informative and excellent blog..","date":"2012-01-26","mins":"12:26 AM","url":"http://theshroudofturin.blogspot.com/2012/01/john-p-jackson-unconventional.html","title":"\nJohn P. Jackson, \"An Unconventional Hypothesis to Explain all Image Characteristics Found on the Shroud Image\" (1991)\n"},{"id":"comment-55042","author":"anonymous","post":"And why do you think they contest such a point (i.e. The fact that there is no image under the blood AND ALSO the serum stains)? Because they are well aware of the fact that such a data essentially prove that the Shroud is a real burial cloth of a real crucified man who had all the bloody stigmata of Jesus Christ! Or else, they would never contest this particular data. This is not scientific at all..","date":"2013-12-02","mins":"11:44 am","url":"https://shroudstory.com/2013/12/01/remembering-shroud-blood-scientist-dr-john-h-hellera-guest-posting-by-kelly-kearse/","cat":"uncategorized","title":"Remembering Shroud Blood Scientist Dr. John H. Heller–A Guest Posting by Kelly Kearse"},{"author":"anonymous","post":"I wonder that there is a correlation between the fact that most of your readers come from the Russian Federation and your hacking theory..","date":"2016-09-02","mins":"5:36 PM","url":"http://theshroudofturin.blogspot.com/2016/09/editorial-and-contents-shroud-of-turin.html","title":"\n\"Editorial and Contents,\" Shroud of Turin News, August 2016 \n"},{"author":"anonymous","post":"From Malaga (Spain),thanks for this interesting blog..","date":"2008-11-12","mins":"4:05 AM","url":"http://theshroudofturin.blogspot.com/2008/11/are-three-hebrew-letters-on-shroud.html","title":"\nAre the three Hebrew letters on the Shroud  tsade-'aleph-waw: `you will come out'?\n"},{"author":"anonymous","post":"\" the English fleet under King Edward III (1312–1377) [my ancestor!] \"Hi Stephen, Did you do some genealogical research ? All the best Paul.","date":"2018-02-25","mins":"3:30 PM","url":"http://theshroudofturin.blogspot.com/2018/02/chronology-of-turin-shroud-fourteenth.html","title":"\nChronology of the Turin Shroud: Fourteenth century (1)\n"},{"author":"anonymous","post":"When will we be able to read your book Dr. Jones ?Kind Regards Paul.","date":"2018-04-24","mins":"1:15 AM","url":"http://theshroudofturin.blogspot.com/2018/04/chronology-of-turin-shroud-fourteenth.html","title":"\nChronology of the Turin Shroud: Fourteenth century (2) \n"},{"author":"anonymous","post":"Regarding the Victoria and Albert M Useum's piece of medieval herringbone twill, I would have thought the yellow part was the reconstruction..","date":"2018-05-01","mins":"3:32 PM","url":"http://theshroudofturin.blogspot.com/2018/04/chronology-of-turin-shroud-fourteenth.html","title":"\nChronology of the Turin Shroud: Fourteenth century (2) \n"},{"author":"anonymous","post":"\"If the technology to create the Shroud was available in medieval Europe, where are other products of this technology?\" For me, *this* gets to the heart of the matter. Excellent essay..","date":"2014-04-14","mins":"2:19 AM","url":"http://theshroudofturin.blogspot.com/2014/04/here-is-flyer-to-danusha-goska-s-author.html","title":"\nDanusha Goska's Shroud of Turin Talk, at the Catholic Campus Ministry Center, WPUNJ, Wayne / Haledon New Jersey, Wednesday, April 30th, Six PM.\n"},{"author":"anonymous","post":"Hyperlink added many moons ago. Have been directing people to you for some time. Keep up this wonderful and essential work. Thanks..","date":"2014-04-14","mins":"2:35 PM","url":"http://theshroudofturin.blogspot.com/2014/04/here-is-flyer-to-danusha-goska-s-author.html","title":"\nDanusha Goska's Shroud of Turin Talk, at the Catholic Campus Ministry Center, WPUNJ, Wayne / Haledon New Jersey, Wednesday, April 30th, Six PM.\n"},{"author":"anonymous","post":"\"A completely naked depiction of Jesus would have been sacrilegious and blasphemous to the medieval mind\"But why was the shroud then exposed in public without any fuss ?.","date":"2016-04-23","mins":"3:02 PM","url":"http://theshroudofturin.blogspot.com/2016/04/non-traditional-13-man-on-shroud.html","title":"\nNon-traditional #13: The man on the Shroud: The evidence is overwhelming that the Turin Shroud is authentic! \n"},{"author":"anonymous","post":"But because the Shroud was believed and claimed by its medieval owners who exhibited it, to be NOT the work of an artist/forger, but the imprint of Jesus' body on His burial shroud, it was NOT \"sacrilegious and blasphemous to the medieval mind.\" No danger for the artist/forger then..","date":"2016-04-23","mins":"4:30 PM","url":"http://theshroudofturin.blogspot.com/2016/04/non-traditional-13-man-on-shroud.html","title":"\nNon-traditional #13: The man on the Shroud: The evidence is overwhelming that the Turin Shroud is authentic! \n"},{"author":"anonymous","post":"Anand had white twice in a row because they switched order of colours halfway through the match. This means Anand will have black in the last game, but for now, it seems like the match will be over before that happens..","date":"2013-11-20","mins":"1:59 AM","url":"http://theshroudofturin.blogspot.com/2013/11/off-topic-anand-v-carlsen-world.html","title":"\nOff-topic: Anand v Carlsen World Chess Championship 2013 match\n"},{"author":"anonymous","post":"Do you really think that you know more than the Vatican ?.","date":"2015-06-28","mins":"3:41 PM","url":"http://theshroudofturin.blogspot.com/2015/06/shroud-of-turin-news-june-2015.html","title":"\nShroud of Turin News - June 2015 \n"},{"author":"anonymous","post":"You have not answered my question..","date":"2015-06-28","mins":"4:31 PM","url":"http://theshroudofturin.blogspot.com/2015/06/shroud-of-turin-news-june-2015.html","title":"\nShroud of Turin News - June 2015 \n"},{"author":"anonymous","post":"Retirement Hi Stephen, I appreciate the fact that you share some parts of your private life with your readers..","date":"2015-12-13","mins":"12:29 PM","url":"http://theshroudofturin.blogspot.com/2015/12/shroud-of-turin-news-november-2015.html","title":"\nShroud of Turin News - November 2015 \n"},{"author":"anonymous","post":"Hello, its wonderful to see your interest in the Holy Shroud of Turin, to see a clearer image of his face visit:http://www.holyfaceofjesus.wordpress.com Bless you.","date":"2011-03-21","mins":"2:17 AM","url":"http://theshroudofturin.blogspot.com/2008/11/shroud-of-turin-news-september-2008.html","title":"\nShroud of Turin News - September 2008\n"},{"author":"anonymous","post":"Hi again,Wow! That is interesting.I did not know about the other head cloth artifact. Nor about the coins on the eyes.It's funny. When I was initially reading about the 3 D like body image revealed by scan? in the cloth, it popped into my head the phrase, \"Whose image and superscription is this?\".Then I read some more and came across your article on the coins!Fascinating.Thankyou,Graeme P.S. Is Adrian Van Leen the pastor at your church?.","date":"2010-01-15","mins":"5:08 PM","url":"http://theshroudofturin.blogspot.com/2009/12/shroud-of-turin-is-burial-sheet-of.html","title":"\nThe Shroud of Turin is the Burial Sheet of Jesus!\n"},{"author":"anonymous","post":"Another great article Stephen. God bless you.","date":"2013-12-03","mins":"9:02 AM","url":"http://theshroudofturin.blogspot.com/2013/12/the-shroud-of-turin-36-man-on-shroud.html","title":"\nThe Shroud of Turin: 3.6. The man on the Shroud and Jesus were crucified\n"},{"author":"anonymous","post":"If this \"professor\" really thinks that the Shroud doesn't prove the ressurection can be explain the lack of putrefecation of the orfices, no decomposition stains and the fact that the blood stains are intact and the fact the serum Halos remain unbroken. More people should pay attention to the blood stains on the Shroud which is a bigger sign of the ressurection than anything else. Whether athiests like it or not that is the reality of the blood stains.C.","date":"2012-03-29","mins":"3:17 AM","url":"http://theshroudofturin.blogspot.com/2012/03/my-comments-on-telegraph-article-about.html","title":"\nMy comments on a Telegraph article about Thomas de Wesselow's claim that the Shroud is authentic but Jesus was not resurrected #1\n"}]
