[{"id":"comment-61628","author":"anonymous","post":"And what do YOU think he says Jeffrey? I’m curious to know….","date":"2013-12-18","mins":"12:27 pm","url":"https://shroudstory.com/2013/12/18/a-new-image/","cat":"press_coverage","title":"A New Image"},{"id":"comment-74970","author":"anonymous","post":"[Remark removed. It was an unsubstantiated and unnecessary insult.] by Dan Porter.","date":"2014-01-28","mins":"10:57 am","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-75010","author":"anonymous","post":"Thank you. You see? I always try to tell the truth..","date":"2014-01-28","mins":"4:29 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-75013","author":"anonymous","post":"Quote: “Fanti’s pioneer experiments date it to within a few hundred years of the 1st century.” Have you noticed that his published scientific paper did not talked at all about his dating of supposed fibers from the Shroud? That’s speak loud to me… The truth is this: No serious scientific paper has ever confirmed his supposed dating of the Shroud so far..","date":"2014-01-28","mins":"4:59 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-75062","author":"anonymous","post":"The proper exercise would have been to verify his dating result by submitting some of his samples (highly questionable) to a proper C14 dating and compare the results. Of course, he did not. That’s great Fanti once again. And another proper exercise for him would have been to avoid publishing a popular book in order to make believe that he was able to prove the authenticity of the Shroud while his method and samples are still questionable….","date":"2014-01-29","mins":"9:30 am","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-75066","author":"anonymous","post":"Oh, by the way, before calling Fanti’s method a « pionner method », can we please wait to see if the scientific community (especially the ones who are experts in dating ancient fabrics) will accept his method as scientifically accurate and use it to confirm some C14 dating. If that’s not the case, sorry but his method (as well as his dating result concerning the Shroud) will end up in the trash bin of science history… And even if his method should be approved by a major part of the scientific community, this would not give us any insurance about the validity of Fanti’s samples. The only way he could give us some insurance about that would be to submit part of his samples to a proper C14 dating and see if the results match his own results….","date":"2014-01-29","mins":"10:11 am","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-74982","author":"anonymous","post":"It’s not because the description of his method was published in a scientific journal that such a method will ever be accepted widely by the scientific community as being accurate for ancient textile… Only time will tell and since he admit himself that his method is probably not more accurate than C14, I seriously doubt that we will see C14 labs using it to verify their dating results..","date":"2014-01-28","mins":"12:54 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-75468","author":"anonymous","post":"I seriously don’t believe many atheists would get scared to death if the Shroud of Turin would be authenticate one day (even though it’s most probable that he will never get authenticate as the authentic burial cloth of Jesus because it’s nearly impossible to prove such a connection)… Around me, there are a bunch of atheists and I can ensure you that they don’t care for one second about the Shroud..","date":"2014-01-31","mins":"2:02 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-74989","author":"anonymous","post":"In the scientific paper of Fanti, it is clearly stated (if my memory is ok) that his method do not produce a result as accurate as the C14 dating….","date":"2014-01-28","mins":"2:00 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"author":"anonymous","post":"I was seriously considering buying Dayvault's book. I read what you write and realize that I would just have thrown away my hard earned money !Thank you so much Stephen !.","date":"2016-04-27","mins":"5:50 PM","url":"http://theshroudofturin.blogspot.com/2016/04/my-review-of-keramion-lost-and-found.html","title":"\nMy review of \"The Keramion, Lost and Found: A Journey to the Face of God\" (2016) by Philip E. Dayvault\n"},{"id":"comment-50349","author":"anonymous","post":"Quote: “Interesting that the premise that real blood exists on the Tunic isn’t protested with a similar vigor as that on the Shroud.” My answer: It’s due to the fact that there is no body image on the Tunic! If there was one, no doubt the skeptics would try to deny the fact that there really is blood on this cloth as hard as in the case of the Shroud because the blood evidence on the Shroud alone is enough to understand that the Shroud image is not due to a man made forgery (see: http://www.shroud.com/pdfs/n76part5.pdf). Colin Berry (for one) knows this and that’s probably why he try so hard to deny the fact that the bloodstains on the Shroud are made out of real blood material coming from exudates of blood clots..","date":"2013-11-07","mins":"5:18 pm","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"author":"anonymous","post":"1 \"Joe Nickell and Steven Schafersman have attempted to destroy Frei's reputation after his death, when he no longer could answer them.\" And what about Timothy Linick ?Luke 6:37–42 Matthew 7:1 5 Jesus abhors people like Stephen E. Jones.","date":"2015-05-16","mins":"2:10 PM","url":"http://theshroudofturin.blogspot.com/2015/05/my-shroud-of-turin-books-and-articles.html","title":"\nMy Shroud of Turin books and articles\n"},{"id":"comment-80054","author":"anonymous","post":"Would be very, very, very suprising if that kind of movie would beat Jesus of Nazareth of Zeffirelli, which remains, in my mind, THE top Jesus movie of all time (by far)….","date":"2014-02-17","mins":"11:34 am","url":"https://shroudstory.com/2014/02/17/son-of-god-in-theaters-february-28/","cat":"movie","title":"Son of God in Theaters February 28"},{"id":"comment-80902","author":"anonymous","post":"I understand perfectly your point versus Mary Magdalene David and the most common opinion of modern scholars about her, but I just wanted to underlined the FACT that this is ONLY an hypothesis that should never be taken as solid proof of anything and that cannot exclude the other possibility, which is that she was truly a prostitute who became follower of Jesus. It is totally impossible, in the present state of our knowledge to know the truth of her real condition for sure. That’s why I wanted to underline the fact that Zeffirelli’s vision can be more accurate after all. Who really knows? I note that the Gospels say that Jesus cast out 7 demons out of her, which is surely a symbolical number that express how bad here condition was at the time she meet Jesus… So, taking this into account and knowing how poor prostitutes were considered by the Jewish society of Jesus time, I don’t think we can reject the possibility that she had been, indeed, a real prostitute. This is a true possibility that cannot be exclude by any credible scholar..","date":"2014-02-20","mins":"11:51 am","url":"https://shroudstory.com/2014/02/17/son-of-god-in-theaters-february-28/","cat":"movie","title":"Son of God in Theaters February 28"},{"id":"comment-80332","author":"anonymous","post":"Quote: “Anonymous & David, the prodigal son is my favourite scene too. It brings me to tears every single time. Probably because I can relate to being lost and found…” Reply: THAT’S THE CASE FOR ALL OF US MY FRIEND. No matter how some people might appear to bel ost presently around us, don’t worry that one day (here or on the other side, that doesn’t matter) every one will understand how lost they are without God, because outside of him, there’s only darkness… That’s my Christian hope for all my brother and sisters in humanity….","date":"2014-02-18","mins":"9:39 am","url":"https://shroudstory.com/2014/02/17/son-of-god-in-theaters-february-28/","cat":"movie","title":"Son of God in Theaters February 28"},{"id":"comment-80333","author":"anonymous","post":"Note: My hope for universal salvation include even Fanti and all of those who have said bad things to me on this blog… ; ).","date":"2014-02-18","mins":"9:39 am","url":"https://shroudstory.com/2014/02/17/son-of-god-in-theaters-february-28/","cat":"movie","title":"Son of God in Theaters February 28"},{"id":"comment-80335","author":"anonymous","post":"Another thing I would like to say about the parable of the Prodigal son and the oldest son is that I react exactly like Mike each time I see it, which proves the spiritual « healing » power that is found in that particular scene. Another scene that is very powerful is the last one where we see Peter asking the Resurrected Jesus to stay with them because the night is falling and he reply (with a great close up of his face) : « Don’t be affraid. I am with you each day til the end of time. » Awesome and so true (no matter if we are conscious of this or not)..","date":"2014-02-18","mins":"9:55 am","url":"https://shroudstory.com/2014/02/17/son-of-god-in-theaters-february-28/","cat":"movie","title":"Son of God in Theaters February 28"},{"id":"comment-80336","author":"anonymous","post":"One last thing I would like to add concerning the scene of the parable of the prodigal son is this : Many (like me and Mike) react with great emotions when we see it but I’m 100% sure this is still nothing beside what we will feel when we’ll see God face to face at the moment of our death! The joy of being save… At that moment, we will fully understand what it means and this eternal joy, no one will be able to take it away from us..","date":"2014-02-18","mins":"10:00 am","url":"https://shroudstory.com/2014/02/17/son-of-god-in-theaters-february-28/","cat":"movie","title":"Son of God in Theaters February 28"},{"id":"comment-80115","author":"anonymous","post":"I cannot agree more with you Mike (about the music too!). Zeffirelli has set the bar so high that it will take a very huge masterpiece to get close to what he did. In no other movie than this one do we see a Jesus that better show the face of the God of Love and Mercy that he preached all his life… There is truly a mystic side in that movie that we cannot see in any other… One of my favorite scene is the one where Jesus “used” Matthew and Peter to tell the Parable of the Prodigal and the older sons. What an awesome scene!.","date":"2014-02-17","mins":"4:44 pm","url":"https://shroudstory.com/2014/02/17/son-of-god-in-theaters-february-28/","cat":"movie","title":"Son of God in Theaters February 28"},{"id":"comment-80116","author":"anonymous","post":"Yes it is..","date":"2014-02-17","mins":"4:44 pm","url":"https://shroudstory.com/2014/02/17/son-of-god-in-theaters-february-28/","cat":"movie","title":"Son of God in Theaters February 28"},{"id":"comment-80331","author":"anonymous","post":"Quote: “Mary Magdalene was not a harlot.” Reply: How do you know this for sure? Nobody really know what she was… Quote : “Robert Powell was much too frail physically.” Maybe a bit but that’s truly minor… His incarnation of the loving and merciful side of Jesus. I agree that Caviezel was good also, but to me, Powell interpretation was a bit closer to the Jesus I imagine..","date":"2014-02-18","mins":"9:34 am","url":"https://shroudstory.com/2014/02/17/son-of-god-in-theaters-february-28/","cat":"movie","title":"Son of God in Theaters February 28"},{"id":"comment-50815","author":"anonymous","post":"Quote: “Naturalistic explanation just right!” Comment: That’s where the whole picture given by the Shroud data is pointing very strongly… Just like Fazio, Mandaglio and Rogers, I have absolutely no doubt that the answer to the “mystery” of the Shroud image MUST lie there. Sorry for all the anti and pro religious freaks out there (some of which have made a lot of $$$ over the years with their irrational explanations versus the Shroud)..","date":"2013-11-11","mins":"3:06 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51286","author":"anonymous","post":"Here’s the summary made by Fazio and Mandaglio concerning the discontinuous distribution of colored fibers in the image area: “In the regions where both body images lies, there are fibrils with the same background color as the ones located in non image areas mixed with others that all have the same higher optical density value in comparison with those who have kept their background color. That means that there are only two types of fibrils in image areas: a) Fibrils that possessed the same background color as the ones located in non image areas. B) Others that possessed a higher optical density value, which are responsible for the body images (ventral and dorsal) that we see on the cloth.” And when I talk about a “scorch”, I talk about a transfer of heat much higher than the natural heat release of a human body (living or recently dead). I talk about a kind of transfer that would release a massive dose of heat energy that, if we believe Fazio and Mandaglio’s conclusions, is much too strong to produce the kind of discontinuous distribution of colored fibers we see on the Shroud that was summarized by them in the quote I just gave you (and which is part of their upcoming paper about the Shroud)..","date":"2013-11-14","mins":"11:43 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51287","author":"anonymous","post":"And here’s another very relevant part of the upcoming paper written by Fazio and Mandaglio on that particular subject: “In the introduction, we have affirmed that both radiative and artistic forgery hypotheses must be discarded. Indeed, it is theoretically impossible for these mechanisms to produce a subtle body image on linen like we see on the Shroud with an unpredictable mix of fibrils (10 15 µm each) that would be yellowed, along with some others that would preserve their background color in a same region (Pellicori and Evans, 1981). In fact, UV radiation (Di Lazzaro et al., 2010 and 2012) or the action of an electrostatic field (Fanti, 2010 and 2011), as well as manmade chemical and thermal treatment (Garlaschelli, 2010) always affect, without distinction, all the linen fibrils. On the contrary, in order to reproduce the Shroud body images (ventral and dorsal) correctly, the fibrils must be yellowed with respect to the trend (linear regression) of the correlation between the image intensity and the cloth body distance. For the three mechanisms mentioned above, it is possible to yellow fibrils of linen, but without respecting the fact that on the Shroud, there are fibrils with background color mixed with others that have been yellowed by the image formation process, which all show the same greater value of optical density. In other words, the action of these mechanisms can yellow or color all the fibrils in the areas they affect with the correct image intensity values, but without being able, at the same time, to respect the discontinuous distribution of yellowed fibrils that has been noted, at microscopic level, on the Shroud of Turin by the STURP team (Pellicori and Evans, 1981). Nevertheless, we can acknowledge the fact that the radiative hypothesis can reproduce the very small thickness of the Shroud image (Mottern et al., 1980; Weaver, 1980), but without being able, at the same time, to reproduce the discontinuous aspect of the yellowed fibrils in the image area. On the other hand, the hypothesis of an artistic forgery is not able to account for the fact that the formation of the bloodstains on the cloth has preceded the body image formation. Indeed, in this case, the predisposed bloodstains would have been damaged by both chemical and thermal treatments. It should be noted that, in the case of Garlaschelli’s work, he created false bloodstains on the cloth after the creation of the body images (ventral and dorsal), without any respect for the reality of what really occurred on the Shroud.” Now, if you still believe the Shroud image is the product of a scorch, that’s your freedom..","date":"2013-11-14","mins":"11:46 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51326","author":"anonymous","post":"You should reflect upon the evidence given by the bloodstains instead. Then, if you got some rationality and some honesty (I’m sure you can!), you should come to the very same conclusion as me: these stains are enough to discard any idea of a man made forgery and, consenquently, the image must have been formed by some kind of interaction between the crucified body of the Shroud man and the surface of the cloth (and I don’t think it is dumb to say that the most probable source of energy that caused the image must be found in some biological release by the corpse and that’s why scientists like Fazio, Mandaglio and Rogers have proposed heat and/or post mortem gases as possible sources of this weak energy)..","date":"2013-11-14","mins":"4:45 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50817","author":"anonymous","post":"One little question: We know for a fact that the bloodstains on the Shroud have a naturalistic origin, so why not the body image? Good question don’t you think?.","date":"2013-11-11","mins":"3:15 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51513","author":"anonymous","post":"Because of the evidence given by the bloodstains, this is a pure waste of time regarding the Shroud… But if you want to do so Thibault, go ahead. It’s not me who will stop you. ; ).","date":"2013-11-15","mins":"5:50 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50831","author":"anonymous","post":"The transfer processes are certainly different I agree but that doesn’t mean at all that both cannot be due to natural phenomenons (different of course). Concerning precisely this subject matter of the difference between the blood and the image transfer, look for a new and very interesting paper of Fazio and Mandaglio that will possibly be published in a peer reviewed journal in a near future… It is kind of a summary paper of their conclusions. Interesting paper..","date":"2013-11-11","mins":"4:42 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50833","author":"anonymous","post":"And think about it Colin: The bloodstains prove the Shroud is a real bloodstained burial cloth of a real crucified man. So, if the Shroud image would not be the one of the person who left his blood on this cloth, that would mean a forger had to take a used and bloodstained burial cloth of a real crucified man and then, make an image (with a scorch technique or another one) AROUND those bloodstains so perfect that it would be a match so great that it would have completely fooled all the medical and forensic experts who analyzed the cloth over the years! Such a scenario is completely ridiculous… Look for some natural process (or processes) my friend….","date":"2013-11-11","mins":"4:52 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50947","author":"anonymous","post":"This question of Hugh is very telling! It’s absolutely not normal at all that people who are going deep into the study of the Shroud are not aware of what can be the most rational and close to the truth hypothesis versus the image formation on the Shroud! It’s very telling because it prove what I’m saying for years now: Most people interested by the Shroud do not want to hear anything regarding a possible (probable in my mind) naturalistic phenomenon that can explain the image formation on the Shroud… It’s sad but it’s the reality my friends. For Hugh and anyone’s interested to seek real truth, here’s the 2 summary papers of Fazio and Mandaglio on the subject that were published in the BSTS newsletter: 1 http://www.shroud.com/pdfs/n74part3.pdf 2 http://www.shroud.com/pdfs/n75part10.pdf You can also read the most recent paper of Fazio that was recently published: http://www.google.ca/url?sa=t&rct=j&q=&esrc=s&frm=1&source=web&cd=3&cad=rja&ved=0 CEMQ Fj AC&url=http%3 A%2 F%2 Fwww.sjmmf.org%2 F Download.aspx%3 FID%3 D7362&ei=ZS6 C Utym L9bh4 APV04 Cw DA&usg=AF Qj CNET Ee Oq DNLHO7 A Yge R Ws MHJD Iu Khg&sig2=5zv Ft Nk Swb Ud Uxz2 Cn0z A&bvm=bv.56146854,d.dmg This paper is the best so far that I’ve read from this nuclear physicist. Note that it talks about the hypothesis of Rogers as a possible solution for the image but more in the context of a stochastic process that would have only produced a very small release of post mortem gases (so small that it would not have been able to color every affected fibers)….","date":"2013-11-12","mins":"9:37 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50955","author":"anonymous","post":"Hugh wrote: “I can only find a quotation in “The Shroud of Turin: An Imprint of the Soul, Apparition or Quantum Bio Holgram,” which says that they do think it was due to electromagnetic radiation of some kind. Is that correct?” Answer: No. They think the most probable source of weak energy that could have caused the image formation on the Shroud is the natural thermal radiation that could have been emitted by the fresh corpse. And as I said in a previous comment, they also leave the door open to the possibility that Rogers’ hypothesis could be correct..","date":"2013-11-12","mins":"11:52 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50956","author":"anonymous","post":"By the way, Rogers also thought that thermal radiation (or heat coming out of the corpse if you prefer) could have taken part in the image formation process, but he didn’t thought this was the main source of energy..","date":"2013-11-12","mins":"11:54 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50990","author":"anonymous","post":"Hugh wrote: “I can only find a quotation in “The Shroud of Turin: An Imprint of the Soul, Apparition or Quantum Bio Holgram,” which says that they do think it was due to electromagnetic radiation of some kind. Is that correct?” New answer: YES. And the sort is heat from the corpse. See this other comment of mine: https://shroudstory.com/2013/11/09/video barrie schwortz at the pikes peak prophesy summit/#comment 50972 When I first read “electromagnetic radiation”, I thought you were referring to corona discharge or something similar. I think the other comment of mine get the point straight..","date":"2013-11-12","mins":"4:37 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50953","author":"anonymous","post":"The bottom line is this : the discontinuous distribution of colored fibers in the image areas is theoretically inconsistent with any hypothesis involving a man made forgery or a high energetic radiation of any sort. Period. That mean that whatever kind of energy have produced the image, it must have come from a natural release (most probably biological in nature: heat from the corpse, post mortem gases, etc.) that doesn’t implied a high amount of energy. We will possibly never know for sure what was exactly this mild energetic release but one thing’s seem to be certain: it was natural. I will transmit your highly critical review to Mr. Fazio anyway, just to see if he can answer you properly..","date":"2013-11-12","mins":"11:48 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50954","author":"anonymous","post":"Note: this message was a reply to another message by Hugh who simply disappeared from the blog… So, if it doesn’t reappear, I won’t be able to send it to Mr. Fazio..","date":"2013-11-12","mins":"11:49 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50971","author":"anonymous","post":"I have post this highly critical review to Mr. Fazio and if he reply, I will print his words right here….","date":"2013-11-12","mins":"2:03 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50972","author":"anonymous","post":"In a comment above, Hugh wrote : ”…there is a reference in all of them (meaning all their papers about the Shroud) to “electromagnetic radiation,” but the rejection of UV and corona discharge.” My reply: Here’s a scientific definition for you that I found on the internet in order to understand that when Fazio and Mandaglio use the words “electromagnetic radiation”, they mean the release of heat from the body that is even possible for a fresh corpse: Thermal radiation is electromagnetic radiation generated by the thermal motion of charged particles in matter and it can take the form of heat, light, ultraviolet, or other electromagnetic waves. In the case of Fazio and Mandaglio’s hypothesis, the “electromagnetic radiation” they are talking about is precisely the heat (weak energy for sure that could have been released by the dead body of the Shroud while inside the Shroud..","date":"2013-11-12","mins":"2:19 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50991","author":"anonymous","post":"Ha come on… This is not serious. They are expert in radiations and perfectly know that there is not even one high energetic process that can produce the kind of discontinuous distribution of colored fibers like we see in the image area on the Shroud. Not one. Sorry but not even something called a scorch. All those things are way too “energetic” to yield that kind of stochastic result. Period. And this conclusion doesn’t come from me but from 2 physicists experts in radiations. They know what they are talking about..","date":"2013-11-12","mins":"4:40 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50973","author":"anonymous","post":"I have to write again my last paragraph (sorry): In the case of Fazio and Mandaglio’s hypothesis, the “electromagnetic radiation” they are talking about is precisely the heat (weak energy for sure) that could have been released by the dead body of the Shroud while inside the Shroud..","date":"2013-11-12","mins":"2:19 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50974","author":"anonymous","post":"One last thing: The main point of Fazio and Mandaglio is the fact that every high energetic radiation are much too strong to yield a discontinuous distribution of colored fibers in one particular image area such as it has been seen on the Shroud by the STURP team. And it’s also true for every possible man made forgery technique. In that context, the real image formation mechanism that happened on the Shroud must have been related to a natural process (or processes) that implied only a very weak amount of energy that was not able to color every affected fibers but only an unpredictable portion of them (this kind of thing is known as a stochastic process), which lead to the formation of a latent image that took years and even decades to fully “developed”..","date":"2013-11-12","mins":"2:25 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50995","author":"anonymous","post":"If you read well the papers of Fazio and Mandaglio, you will notice that an image formation process involving a release of heat from the corpse is only the best “proposal” of explanation for them. The most important thing in their conclusion is that the discontinuous distribution of colored fibers in the image area strongly suggest a natural phenomenon that did not implied a great amount of energy and, because of that, they did not wanted to reject the hypothesis proposed by Rogers because that kind of chemical reaction also doesn’t imply a lot of energy and, therefore, could also have produced a stochastic distribution of colored fibers if the post mortem gases were not released in great amounts. That’s what Fazio and Mandaglio think. This was not exactly what Rogers thought. For Rogers, the discontinuous distribution of colored fibers was not due to an image formation process that was stochastic but it was mainly due to the evaporation concentration phenomenon that happened at the end of the making of the cloth, which produced a discontinuous distribution of carbohydrate impurities on the top surface of the cloth (as well as on the top of the affected fibers – this is truly important to understand). In other words, concerning Rogers hypothesis, this evaporation concentration phenomenon would have been the stochastic process leading to a discontinuous distribution of colored fibers in the image area instead of a stochastic image formation process. But anyway, I think it’s possible to merge the 2 hypotheses into a viable one that would be very interesting….","date":"2013-11-12","mins":"4:57 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51005","author":"anonymous","post":"Additional comment: Rogers believed that heat could have taken part in the image formation process, along with a diffusion of post mortem gases and you can find a proof of this in the 2001 paper of Rogers that was recently published on Barrie’s website. Here’s the quote: “…I do not think we can rule out long wave heat transfer (from a dead body) as contributing to the image formation process. It could not have been the sole contributor.” If Rogers thought that heat “could not have been the sole contributor”, it’s probably because he did not thought of the possibility of a stochastic process involving only a very small amount of energy that would have produced a latent image on the Shroud. I’m pretty sure Rogers was thinking of a process that produced a higher amount of energy released by the dead body than the very tiny quantity (still undetermined) that is probably needed to produced a stochastic process that could yellowed some fibers of linen… That’s what I think. But one thing’s for sure: Rogers, no more than Fazio and Mandaglio, excluded a release of heat by the fresh corpse of the Shroud man, as a possible solution for the Shroud image (at least partially)..","date":"2013-11-12","mins":"5:57 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51002","author":"anonymous","post":"I have not answer yet because I don’t have those information in details… All I know is that both Fazio and Mandaglio organized 2 important conferences about radiations with scientists coming from all around the world! Read again this please: https://shroudstory.com/2013/11/09/video barrie schwortz at the pikes peak prophesy summit/#comment 50783 After reading this, if you still think they don’t know what they are talking about when it comes to stochastic processes and the effects of radiations, then you got a major problem my friend..","date":"2013-11-12","mins":"5:42 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51003","author":"anonymous","post":"On Barrie’s website scientific papers page, you can already find 2 peer reviewed papers from Fazio and Mandaglio on the subject we discuss. Here’s the 2 references: •FAZIO, G – MANDAGLIO, G – Can a latent image explain the characteristics of the Shroud body image? (2011) Radiation Effects and Defects in Solids, DOI:10.1080/10420150.2011.595413 (Abstract Only without Subscription) [Jan 2012] •FAZIO, G – MANDAGLIO, G – Stochastic distribution of the fibrils that yielded the Shroud of Turin body image Radiation Effects and Defects in Solids, 166: 7, 476 — 479, First published on: 13 April 2011 (i First) (Abstract Only without Subscription) [Jan 2012] And you can also add the paper from Fazio I referred to in a previous comment. Here’s the link: •FAZIO, G – MANDAGLIO, G – Can a latent image explain the characteristics of the Shroud body image? (2011) Radiation Effects and Defects in Solids, DOI:10.1080/10420150.2011.595413 (Abstract Only without Subscription) [Jan 2012] •FAZIO, G – MANDAGLIO, G – Stochastic distribution of the fibrils that yielded the Shroud of Turin body image Radiation Effects and Defects in Solids, 166: 7, 476 — 479, First published on: 13 April 2011 (i First) (Abstract Only without Subscription) [Jan 2012] This paper from Fazio was also published in a serious peer reviewed journal. What more do you need to understand that Fazio and Mandaglio are true experts in radiations? Their personal C.V.?.","date":"2013-11-12","mins":"5:46 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51006","author":"anonymous","post":"Sorry, for the second part of my above comment, I made a mistake in my copy paste links. Here’s the correct link for the paper of Fazio: http://www.google.ca/url?sa=t&rct=j&q=&esrc=s&frm=1&source=web&cd=3&cad=rja&ved=0 CEMQ Fj AC&url=http%3 A%2 F%2 Fwww.sjmmf.org%2 F Download.aspx%3 FID%3 D7362&ei=ZS6 C Utym L9bh4 APV04 Cw DA&usg=AF Qj CNET Ee Oq DNLHO7 A Yge R Ws MHJD Iu Khg&sig2=5zv Ft Nk Swb Ud Uxz2 Cn0z A&bvm=bv.56146854,d.dmg.","date":"2013-11-12","mins":"5:58 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51103","author":"anonymous","post":"And what about “Radiation Effects and Defects in Solids” in which they published 2 or 3 papers about the Shroud?.","date":"2013-11-13","mins":"9:31 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51101","author":"anonymous","post":"Forget who say it and concentrate on what is said please. That’s what really matter..","date":"2013-11-13","mins":"9:29 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51102","author":"anonymous","post":"In order for every one to understand the ideas of Fazio and Mandaglio, two Italian nuclear phycisits, here’s a short summary of their conclusions : 1 The sum of the known characteristics of the image on the Shroud that were defined by the STURP team, and especially the fact that there is a discontinuous distribution of colored fibers in the image area, indicates for these 2 radiation experts that such a property is totally inconsistent with any kind of high energetic radiation, whether it be a burst of UV light, a corona discharge (or another kind of electrostatic discharge at the time of a highly hypothetical earthquake), a burst of protons, of neutrons, etc. Such high energetic radiation are way too much “energetic” to produce the kind of discontinuous distribution of colored fibers that was observed in the image area of the Shroud by the STURP team. In all logic, if the body of the Shroud man would have released one of those high energetic radiation (which is, by the way, scientifically impossible for a dead body), the result would have been a coloration of every fibers hit by such a radiation. In sum, for one particular linen thread that would have been hit by such a high energetic radiation, we should expect to see a coloration of every exposed fibers of that thread (which is not what is seen in the image area on the Shroud) and we should also expect to see a coloration of fibers more deeply into the cloth in the zones of the cloth that were in direct contact with the body (which is also not what is seen in the image area on the Shroud were there is no more penetration in zones of direct contact than in zones that were most probably at a small distance away from the body). 2 This conclusion also applied for every possible man made forgery technique that could have been used to artificially produce the image on the Shroud, including a scorch or a rubbing. In these cases, as it is for every possible hypothesis involving some kind of high energetic radiation, we should expect to see a coloration of every exposed fibers of one particular colored thread (which is not what is seen in the image area on the Shroud) and we should also expect to see a coloration of fibers more deeply into the cloth in the darkest zones of the body image (which is also not what is seen in the image area on the Shroud were there is no more penetration in zones of direct contact than in zones that were most probably at a small distance away from the body). 3 Considering these 2 previous conclusions (which are extremely hard to dismiss from a purely scientific point of view), Fazio and Mandaglio turned their attention to a possible natural process (or a series of processes) that could fit better with the portrait given by all the known characteristics of the image and realized that these characteristics (especially the discontinuous distribution of colored fibers in the image area and the extreme superficiality of the image, which is the same in zones of direct contacts between the cloth and the body as well as in zones of non direct contacts) were very similar to the results that can be produced by a series of processes known as “stochastic processes”, which always imply a very tiny amount of energy and always give an unpredictable and uneven kind of result that doesn’t affect all the “population” submitted to this small amount of energy (pretty much like we see in the image area on the Shroud were some fibers were colored and others kept their original background color). And here’s an example of this kind of process and the result it could produce (note that such an example is well known by these 2 nuclear physicists and they gave it in a few papers they wrote about the Shroud image): “It is this kind of process that occurs when many persons absorb small doses of radiation. Such an emission of a little quantity of energy triggers a mechanism with chemical modification that only appear after decades. These modifications, that always affect only a portion of the sample, consist in tumors for some of the persons exposed to small doses of radiation and in yellow fibrils for some of them located in the areas of the fabric that were exposed to a small dose of energy (still undetermined). The same stochastic result can also happen when a group of persons is exposed to a faint pollution due to chemical substances.” In sum, we can say that in face of all the known properties of the Shroud image, Fazio and Mandaglio conclude that the kind of known process that is the most able to yield this sort of very superficial and discontinuous image is a stochastic process, which is totally natural. 4 So now that they became convinced that the image formation on the Shroud was most probably of the same nature than others known stochastic processes such as the one they described, which involved small doses of radiation on a sample population, the question they had to face was this one: What kind of weak energy could have been present inside the Shroud while the dead body of the Shroud man was lying there for less than 48 hours? And they came up with the hypothesis that involved a small release of thermal radiation from the fresh corpse (which, as they wrote, is totally possible in reality and, if we think seriously about it, I believe we can even add that it is probably even truer for the fresh corpse of someone like the Shroud man who had been tortured for a long time prior to his death on the cross). And along with this most probable source of weak energy, they also left the door open to the possibility of a weak release of post mortem gases that could have affected only a portion of the exposed fibers on the surface of the cloth (because of the stochastic distribution of the carbohydrate impurities as described by Rogers and/or because of the stochastic nature of the coloring process that could have been produced by such a weak release of post mortem gases). 5 Finally, no matter what has been the real source (or sources) of this weak energy that has produced the Shroud image with all its known characteristics (including the discontinuous distribution of colored fibers and the extreme superficiality of the image), the fact that, in their mind, this must have been a stochastic kind of process (or processes) have surely produced a latent kind of image that could have taken even decades before it became fully visible to the naked eye. That’s about it my friends! Now you got a pretty good summary of the conclusions of Fazio and Mandaglio and you’re free to reject them in block or, on the contrary, to consider them, like I do, as one of the most rational (and therefore, possible) hypothesis that has ever been given by some serious scientists regarding the formation of the Shroud image! But note this: Such a naturalistic hypothesis (as well as Rogers’ own hypothesis) doesn’t discard at all the possibility of a Resurrection of the Shroud man! It’s very important for everyone to understand this. In sum, it’s not because the image on the Shroud would not have been produced by a by product of the Resurrection or by a miraculous act of God that this means that Christ’s Resurrection is an invention of his disciples! NOT AT ALL… Linking absolutely the two things (the image and the Resurrection event) is not the best way to look at the Shroud in my opinion and it’s even dangerous on a faith level, because if the Shroud image would be proven one day to be 100% natural (this could well happen if a new series of direct researches are allowed by the Vatican one day), this could go as far as destroying the faith in Christ’s Resurrection of some of those who desperately wants to make such a direct link between these two things and that would be a total shame..","date":"2013-11-13","mins":"9:30 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51118","author":"anonymous","post":"Course of physic 101: It is totally impossible to get a discontinous distribution of colored fibers like what have been seen on the Shroud with the means of a scorch or a burst of energetic radiation of any kind. This is not me speaking, this is Fazio and Mandaglio, 2 nuclear physicists who know what they are talking about. And if you don’t agree with them, this just prove that you already got a set up mind on what kind of process must have produced the Shroud image, which is certainly included in all the processes that have been totally rejected by Fazio and Mandaglio has being unable (scientifically speaking) to acheive the discontinuous distribution of colored fibers in the image area. It’s sad for you but only a very weak transfer of energy can produce such an uneven, highly superficial and unpredictable result in every area of the Shroud image, no matter if it was in direct contact or not with the corpse. And in such a context, it’s pretty evident that such a weak transfer of energy must have come from a natural (most probably biological) source, which cannot be many other things than the dead body of the Shroud man (no matter if it was a release of heat from the corpse or a release of a small amount of post mortem gases or another release from the corpse involving some other molecules). That’s where Fazio and Mandaglio are standing versus the Shroud image and I agree completely with this line of thinking..","date":"2013-11-13","mins":"11:51 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51121","author":"anonymous","post":"Complementary comment : Here’s a quote from the upcoming paper of Fazio and Mandaglio about the Shroud image that is very telling regarding the present debate : « We will demonstrate that the known physical and chemical characteristics of the body images and the bloodstains that have been found and/or confirmed by the scientific study of the cloth done by the STURP team in the late 1970s and early 1980s are sufficient to reject the radiative hypotheses (ultraviolet radiation, corona discharge, etc.) and those involving an artistic forgery. Indeed, the physics and the chemistry of the ventral and dorsal images agree with a natural mechanism able to eliminate the apparent discrepancy between the characteristics of the body images and those of the bloodstains. For us, on the Shroud, there are latent body images (ventral and dorsal), yielded by the action of a stochastic process. Therefore, the hypothesis involving an artistic forgery or a miraculous event must be discarded. In every case, the scientific study of the Shroud of Turin must not be influenced by religious or anti religious feelings. Unfortunately, these kinds of biased studies have already been done many times since 1898 and will certainly occur again in the future, which is something that has contributed to stopping, or at least restraining, the collaboration among many Shroud researchers. Actually, we see many scientists who are involved in Shroud research who are not inclined to the possibility of changing some of their ideas or even just seriously taking account of other points of view about the Shroud. These researchers appear motionless in their convictions and are unable to consider other possible solutions for the problems they study. » Now, I’ll let you meditate on those truths….","date":"2013-11-13","mins":"12:12 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51145","author":"anonymous","post":"Not understanding that you cannot produce a discontinuous distribution of colored fibers with any kind of man made forgery or any kind of high energetic radiation make you look anything but like a real scientist Mr. Farey. And what about your last statement: “If low levels of thermal energy are able to produce a stochastic distribution of degradation on flax fibres, it could obviously be done just as well with a warm statue as a dead body.” If you still believe that a hot statue could have produced the Shroud image while the forger would have taken a real bloodstained burial cloth to do is work (which is what he must have done) and anyway succeed to produced a body image so good that it fooled every medical and forensic experts who have studied the Shroud, then I don’t know why I should waste my time exchanging with you. This is purely ludicrous and such a scenario have been put aside since the STURP days. Come on! Let’s try to discover a rational answer to the Shroud image that take everything into account, including the fact that the bloodstains were there on the cloth prior to the image formation, which exclude the idea of a forgery..","date":"2013-11-13","mins":"5:10 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51146","author":"anonymous","post":"Hugh, I just want to summarize my idea like this : Because of the bloodstains (especially the high level of bilirubin in there and the fact that they stained the cloth before the formation of the image and the fact that most of them are made of exudates of moistened blood clot and the fact that they are all forensically accurate), we know for a fact that the Shroud is not a forgery. Starting from this, we come to this simple and rational conclusion : the image must have been caused by some form of interaction between the real dead body of a crucified man and the surface of the cloth. There is scientifically no other possible solution than this one. If we could agree on this, that would be a very good base to start talking seriously. And if we believe experts in radiation like Rogers, Fazio and Mandaglio, this kind of interaction that can theoretically produced the kind of very superifical and discontinuous image we see on the Shroud MUST BE one that implied only a very weak amount of energy and therefore, we must exclude every known high energetic radiation as the possible source of energy responsible for the Shroud image. Now, what is left? NATURAL PROCESSES MY FRIEND! ONLY NATURAL PROCESSES! And as Fazio and Mandaglio wrote in a paper about the Shroud : the only « mystery » that remains versus the image is what exactly was the source of this weak energy? These 2 Italians physicists PROPOSED (only a proposal and not a certainty) that a release of heat by the corpse could be the answer. And since it is theoretically possible for fresh corpse to emit thermal radiation, we cannot exclude this hypothesis for the moment, no more than the one proposed by Rogers relative to a release of post mortem gases (since it is theoretically possible for fresh corpse to emit some post mortem gases, especially ammoniac). I don’t say that the real source of the weak energy must have been heat and/or post mortem gases. I just say that it is possible that these source of weak energy could have played a role in the formation of the Shroud image. All this summarize my thoughts pretty well concerning the image formation on the Shroud. If you don’t generally agree with this, then we got a problem!.","date":"2013-11-13","mins":"5:33 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51147","author":"anonymous","post":"I need to rewrite one sentence like this: And if we believe experts in radiation like Rogers, Fazio and Mandaglio, the kind of interaction that can theoretically produced a very superifical and discontinuous image like the one we see on the Shroud MUST BE an interaction that imply only a very weak amount of energy and therefore, we must exclude every known high energetic radiation as the possible source of energy responsible for the Shroud image..","date":"2013-11-13","mins":"5:35 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50783","author":"anonymous","post":"Just for your information, Fazio and Mandaglio have organized two important conference last month and this month in Italy that were summarized like this by Fazio in a private email to me: “The conferences (October and November) organized by us et al., are related to thte following topics: 1) meson interaction, 2) heavy ions reactions. We will have, in Messina, scientists of the USA, China, G. B., France, Germany, Russia, Ukraine, Japan,. . . For us, this will be a great engagement.” I hope now that you can understand the fact that both Fazio and Mandaglio are true experts in the field of radiation, just like Rogers was and that these guys had no other motives regarding the Shroud than to find the truth about it. No pro or anti religious agendas behind their backs and, just for this (and along the fact that they know what they are talking about when it comes to radiations), we should listen carefully to what they have to say..","date":"2013-11-11","mins":"11:49 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51264","author":"anonymous","post":"Quote: I want to see if any kind of image produced by any kind of technique using heat transfer match the fundamental properties of the TS image. Answer is simple: Only if this heat transfer imply only a very weak amount of energy like the heat coming out of a body (dead or alive)..","date":"2013-11-14","mins":"9:38 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51267","author":"anonymous","post":"Of course, what I said is only true in theory (if we believe radiation experts like Fazio and Mandaglio). It would take some lab experiments to see if this kind of weak release of heat could really start a latent image that would end up developing like the Shroud image (with all its known properties). But one thing’s for sure : the discontinuous distribution of colored fibers we see in the image area on the Shroud cannot be acheive with a scorch or any kind of high energetic radiation. It’s not me who say this but true radiation experts..","date":"2013-11-14","mins":"9:42 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51270","author":"anonymous","post":"Complementary note : A scorch or any form of high energetic radiation release an amount of energy that is so strong that every exposed fibers of one affected thread will always be colored or at the very least transformed chemically, which is NOT what has been seen in the image area on the Shroud by STURP. Also, as I said previously, in all logic, with those kind of high energetic transfers, we should get more colored or transformed fibers deeper into the cloth in zones of direct contacts versus zones were the cloth was not in contact with the cloth, which is again NOT what has been seen in the image area on the Shroud by STURP. In all logic, the only kind of processes that can produced the kind of weak energetic transfer that is needed to acheive the kind of very superficial and discontinuous image we see on the Shroud is some undetermined natural process, most probably related to the biological state of the Shroud man. Rationally speaking, the answer must lie in that direction. Again, all that I said is based on the opinion of true experts in radiations who know much better than me or you Thibault (or Colin Berry obviously) what they are talking about….","date":"2013-11-14","mins":"9:59 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51285","author":"anonymous","post":"Since I’m sure Hugh will say « And what about the hypothesis of a hot statue » when he will read my posts of this morning, I just want to say this about that particular hypothesis : I think you should read this good paper from one of my friend : http://www.shroud.com/pdfs/n76part5.pdf After reading it, maybe you’ll start to understand that from the evidence of the bloodstains alone is enough to discard any idea of a forgery made with a hot statue, with a scorch technique or with any other man made technique you can imagine. The simple fact that the bloodstains were on the cloth before the body image should be enough to make you understand this. Imagine a forger taking the real burial cloth of an anonymous crucified man (by the way, this would certainly have been done prior the abolition of crucifixion by the Romans during the reign of Constantin and not during the Middle Ages) that would have been covered with exudates of blood clots everywhere and then, manage we don’t know how to create a perfect body image around all those stains (including many serum stains) in a perfect forensic way and without disturbing or damaging all these biological stains! I prefer believing in Santa Claus than to believe is such a ridiculous scenario… But of course, you’re free to keep on in your belief, if that what make you happy..","date":"2013-11-14","mins":"11:36 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51314","author":"anonymous","post":"Forgetting the very important evidence of the bloodstains on the Shroud (which indicates that it is a real burial cloth of a real crucified man and, consequently, we can forget every man made forgery hypothesis) is not very worthy of a scientist Hugh. If it makes you happy, I don’t mind that you try hard to scorch a linen with the same properties as the Shroud image (even if it is theoretically impossible, especially concerning the discontinuous aspect of the image) but I really think it’s a pure waste of time regarding the Shroud. Like it or not, the answer MUST be found in some natural process that produced a very weak transfer of energy between the corpse of the Shroud man and the cloth. I really don’t think there’s any other viable path to follow..","date":"2013-11-14","mins":"2:04 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51327","author":"anonymous","post":"What you obviously miss Hugh is not the bloodstains themselves, but the very important implications that the presence of those biological stains on the Shroud should cause versus the question of the image formation….","date":"2013-11-14","mins":"4:47 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50785","author":"anonymous","post":"Complement to my last sentence: So if they all claim that the Shroud image cannot be the product of a forgery or of a burst of high energetic radiation of any kind, I don’t know why we should waste our time by keeping to explore those paths. The fact that all these radiation experts were so categorical about that give me a great confidence to say that those paths are wrong paths regarding the Shroud image. Shroud researchers would gain to look into the path of some natural processes..","date":"2013-11-11","mins":"11:52 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-74980","author":"anonymous","post":"Quote: “Professor Fanti has the merit to have developed a new non destructive ancient textiles dating method.” My reply: This have certainly not been backed up yet by the scientific community. Come on..","date":"2014-01-28","mins":"12:49 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"}]
