[{"id":"comment-72414","author":"jeffrey_liss","post":"History is replete with examples of events, people, artifacts, documents, etc. Which, over time, have been misrepresented for reasons that have nothing to do with fraud or any other form of deception. I’ll offer up a (completely off topic) example. Americans with an interest in naval history may recall some of the controversy in the 1990s surrounding the identity of the U.S.S. Constellation, one of the few surviving warships from the age of sail. It is currently moored at the Inner Harbor in Baltimore, Maryland. While everyone agreed the ship existed and that it was old, the question was how old, and which ship was it? Was it the U.S.S. Constellation constructed in 1797 — one of the six original frigates of the U.S. Navy and a sister ship of the U.S.S. Constitution, the oldest comissioned warship still afloat?[1] Was it a separate ship, a sloop of war constructed in 1854?[2] Was it an extensive refit or partial reconstruction, with pieces of the original frigate used to construct the hull of a new vessel? The U.S. Navy was adamant: there was only one ship named Constellation in the Navy List, and it was never stricken. Therefore, the ship at Baltimore had to be the original. Historians were less certain. Long story short: an extensive, multi disciplinary investigation was conducted (sound familiar?), and the team was able to determine the truth: they were two separate ships.[3] There was never an attempt to deceive, just some sloppy record keeping by the Navy — which also very much wanted to believe it still had not one but *two* of its original 6 frigates. I think anyone reading this blog recognizes many of the scenarios or possibilities the team investigated. They are the same that come up when debating the Shroud or any relic. The only difference, of course, is that the Constellation finally yielded a clear answer to its true identity — something the Shroud stubbornly refuses to do. History often works in the exact opposite way from science. STURP investigated and concluded it could not say what the Shroud image was, only what it was not. The Shroud’s Edessan sojourn is one of several possibilities, none of which can positively be disproved. So, I’m going to agree with John Klotz: all this is extremely interesting, but it needs to be approached as backstory. History, art, even Scripture — none of them can positively rule out authenticity. The Shroud itself, and therefore the science, is the most compelling evidence. [1] http://en.wikipedia.org/wiki/USS Constellation (1797) [2] http://en.wikipedia.org/wiki/USS Constellation (1854) [3] http://www.dt.navy.mil/cnsm/docs/fouled anchors.pdf.","date":"2014-01-06","mins":"12:27 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"}]
