[{"id":"comment-57678","author":"jeffrey_liss","post":"A useful approach to this question might be to ask not where the nail is but how it got there. Yes, of course, a Roman soldier hammered it into place, but how does one go about doing that? More importantly, how does one do it efficiently and repeatedly on one of those days where the glory of Rome demands crucifying hundreds or even thousands of its enemies? Like anyone with experience in law enforcement or the martial arts, I’ve learned, practiced, and employed my share of wrist locks. It’s worth keeping in mind that the victim’s hand was probably not in the neutral, relaxed position we see in x rays or diagrams. Even if this is the Shroud of Christ and he willingly stretched out his hands to receive the nails, most victims of crucifixion would not go so willingly. So, the Romans would have had techniques for immobilizing the wrist and positioning the hand in the ‘ideal’ posture for their purposes. The effects of these would be to seriously distort the bones of the hand. The spaces between bones would have expanded in some areas and lessened in others. I think this merits further study, if only because we know so little about how crucifixions were actually carried out. Granted, that’s an area of ‘lost knowledge’ that humanity is probably better off without, but it might help to clear up this issue. Now if I can just find someone willing to take x rays while I apply various wrist locks to a volunteer….","date":"2013-12-10","mins":"10:45 am","url":"https://shroudstory.com/2013/12/10/barbets-vs-zugibes-exit-points/","cat":"image_theory","title":"Barbet’s  vs   Zugibe’s Exit Points"},{"id":"comment-51493","author":"jeffrey_liss","post":"I admire the persistence and ingenuity that went into this experiment, which is very convincing of…something. Surely a medieval forger, had he existed, would have used a similar approach to develop his technique. I can hear his patron (Geoffrey de Charney?) now: “You need HOW much more linen? What happened to the six bolts I paid for last month? Do you know how much this stuff COSTS?” Except, you know…in French..","date":"2013-11-15","mins":"2:37 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-53883","author":"jeffrey_liss","post":"Here you go: http://i00.i.aliimg.com/wsphoto/v2/663163602 1/Pinart 3 D font b Pin b font Sculpture Frame Artist Fun Toy Home font b Office.jpg.","date":"2013-11-29","mins":"11:04 am","url":"https://shroudstory.com/2013/11/29/this-may-be-the-biggest-mystery-of-all/","cat":"image_theory","title":"This may be the biggest mystery of all?"}]
