[{"id":"comment-71645","author":"jeffrey_liss","post":"There are few things I’ll cop to being ‘passionate’ about, but this is one. Any future investigation with direct access to the Shroud should commit in advance to releasing all its data — including high resolution photos — under a Creative Commons or similar license. I can understand the need to protect the image against inappropriate commercial use. That can be accomplished through CC. Everyone else — students, researchers, skeptics, the faithful alike — should have the broadest possible access. Culturally, technologically, politically, it’s better to share willingly than try to restrict access. Control is an expensive, losing battle anyway, so why not be free and open?.","date":"2014-01-03","mins":"11:03 am","url":"https://shroudstory.com/2014/01/03/brilliant-the-pause-button-with-the-rosary-hanging-from-it/","cat":"shroud_marketplace","title":"Brilliant:  The Pause Button with the Rosary Hanging From It"},{"id":"comment-71647","author":"jeffrey_liss","post":"All of which is as it should be (and ever has been). Am I the only one who wishes the true meaning of ‘charity’ could be reclaimed? The (C|c)hurch is meant to be a community, not a kingdom in its own right. I think we’re all better served by a Church that is *not* self sustaining, but relies on Catholics and others to dig deep and/or roll up their sleeves and do some good..","date":"2014-01-03","mins":"11:07 am","url":"https://shroudstory.com/2014/01/03/brilliant-the-pause-button-with-the-rosary-hanging-from-it/","cat":"shroud_marketplace","title":"Brilliant:  The Pause Button with the Rosary Hanging From It"},{"id":"comment-72507","author":"jeffrey_liss","post":"His name is Ian Lawton. See here: http://www.soulseeds.com/grapevine/.","date":"2014-01-07","mins":"4:38 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","title":"Keep it Simple: Can Anyone Help?"},{"id":"comment-72510","author":"jeffrey_liss","post":"BTW, I also found a site that attributes the quote originally to Thomas Cathcart, [ http://www.goodreads.com/quotes/tag/sherlock ] author of “Plato and a Platypus Walk into a Bar: Understanding Philosophy Through Jokes.” If the joke is printed in the book, it will probably make for a better reference..","date":"2014-01-07","mins":"4:46 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","title":"Keep it Simple: Can Anyone Help?"},{"id":"comment-51937","author":"jeffrey_liss","post":"Where would he get the vast quantity of linen needed to support development of this technique by trial and error? If that’s the claim, we’re not talking about just one linen shroud. Colin knew what he was trying to achieve and had some ideas about what wouldn’t work from the work of others. Our conjectural forger would presumably be making this up as he went. Hard to believe he nailed it on the first try, and experimentation with other materials surely would not yield the same results. So who footed the bill?.","date":"2013-11-18","mins":"4:52 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-52011","author":"jeffrey_liss","post":"David Goulet : I suppose a welathy benefactor would have been involved. Yes, once supposition is unleashed, pretty much anything is possible I suppose..","date":"2013-11-19","mins":"10:15 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-55049","author":"jeffrey_liss","post":"I have been editing Wikipedia articles since 2003, and I can tell you this: you will have a fight on your hands. There are some very good articles on religious topics — because they are largely left alone by the so called ‘skeptics.’ But the Shroud matters — for all the obvious reasons. Don’t get me wrong — I think this is a fight worth having, and there’s no more public venue for it than Wikipedia. Just be prepared to match them, either with vigilance bordering on obsessive compulsive disorder or with numbers and discipline; you’ll need a group of people dedicated to watching and influencing the article. Initially, they will respond within Wikipedia — by using the system to their advantage. If you persist, they’ll use social media channels like Twitter and Reddit to rally atheists to the fight. So, the key is to out think and above all out reference them. I would suggest focused, defensible edits. Discredit the work of Mc Crone and Nickell, for example. Wherever possible, reference only peer reviewed studies in major journals (the atheist gospels). Don’t, for example, cite the Górny and Rosikoń book (nothing against it; my pre ordered copy is on my desk as I type this); instead, cite the actual studies or research on which they relied. Step one is to prepare by learning how Wikipedia works. You Tube is a good source for this. For example, here’s a two part video on how to add citations in Wikipedia articles: http://www.youtube.com/watch?v=m2 H Fd Et Y Dyc and http://www.youtube.com/watch?v=W a9f Bc13b4 Ultimately, this is winnable because the weight of research, facts, etc. Are on the side of (at the very least) the Shroud being completely unique and utterly inexplicable. Just understand what you’d be getting yourselves into. I think it’s important, though, precisely because Wikipedia represents the zeitgeist of the Internet (sort of a meta zeitgeist, I guess). A truly balanced, NPOV article here will make a lot of people think about the Shroud, the evidence, and what it all means. But then, in the interests of full disclosure: I pick fights with atheists on Twitter for fun. So, my objectivity is clearly suspect when the subject is ‘pointless arguments on the Internet.’.","date":"2013-12-02","mins":"11:58 am","url":"https://shroudstory.com/2013/12/02/the-anti-shroudrelicscatholicchristian-propaganda-on-wikipediaguest-posting-by-o-k/","cat":"news_&_views","title":"The anti-Shroud/Relics/Catholic/Christian propaganda on Wikipedia–Guest Posting by O. K."},{"id":"comment-55857","author":"jeffrey_liss","post":"As a follow up to my comment, I have been testing the waters on the Wikipedia page by trying to correct a single word in the introduction. After being reverted a few times, I added the following to the Talk page: The final sentence of the introduction identifies the TS as ‘one of the most studied and controversial artifacts in human history.’ My attempt to correct this sentence has been repeatedly reverted. There are two reasons the correction is needed. First, use of the term ‘artifact’ is not NPOV, as the article goes on to state the image — the thing that makes it controversial — was formed by unknown means and is the subject of debate. The Oxford English Dictionary defines ‘artifact’ as: An object made or modified by human workmanship, as opposed to one formed by natural processes. Merriam Webster is even more definitive: 1.a : something created by humans usually for a practical purpose; especially : an object remaining from a particular period 1.b : something characteristic of or resulting from a particular human institution, period, trend, or individual 2 : a product of artificial character (as in a scientific test) due usually to extraneous (as human) agency This exludes a) natural processes and b) acheiropoieta. Thus, the use of ‘artifact’ represents editorial opinion. This would seem to be confirmed by the revision comment: artifact is correct (this shroud was made by someone), don’t change words in quotations. The words are not part of a quotation; if they are, they are quoted inaccurately. The reference included for this sentence states: According to L Loyd A. Currie, it is “widely accepted” that “the Shroud of Turin is the single, most studied object in human history” in Lloyd A. Currie, “The Remarkable Metrological History of Radiocarbon Dating Journal of the National Institute of Standards and Technology 109, 2004, p. 200. Currie says ‘object,’ not ‘artifact.’.","date":"2013-12-03","mins":"4:24 pm","url":"https://shroudstory.com/2013/12/02/the-anti-shroudrelicscatholicchristian-propaganda-on-wikipediaguest-posting-by-o-k/","cat":"news_&_views","title":"The anti-Shroud/Relics/Catholic/Christian propaganda on Wikipedia–Guest Posting by O. K."},{"id":"comment-72741","author":"jeffrey_liss","post":"Actually, this is something any of us can help with. If you download an application like HT Track, it’s easy to create your own, local mirror or backup of any website. I have no idea how big the site is in bytes — after 18 years, probably very big — but assuming a decent broadband connection, you could have your own backup of the site within a few hours.. Thus, if the site were to go down or be compromised, you’d be able to help get it back up pronto. You could even set up a recurring, incremental backup that periodically scans the site for updates and downloads just those. On a related note, don’t discount the value of cloud storage — not as a replacement for physical media but a supplement. Dropbox, box.com, Sky Drive, Google Docs, etc. All allow you to store huge amounts of data for free. Even the paid accounts which offer storage into the terrabytes are fairly reasonable. They’re also excellent for files you want to share with others or make publicly available. Finally, once a ‘canonical’ backup of the site exists, it would probably be good to set it up for distribution as a torrent, as is explained here: http://www.sidewalkcrusaders.com/bthowto/btstart.html Now I’m really getting carried away, so I’ll stop there. I’ve got to run to an IT meeting anyway (I know, big surprise.).","date":"2014-01-09","mins":"11:38 am","url":"https://shroudstory.com/2014/01/09/they-dont-do-it-just-for-the-credit-card-numbers/","cat":"uncategorized","title":"They don’t do it just for the credit card numbers"},{"id":"comment-51530","author":"jeffrey_liss","post":"Well I’m convinced I just watched something..","date":"2013-11-15","mins":"7:41 pm","url":"https://shroudstory.com/2013/11/15/vinny-the-mystery-of-the-shroud-of-turin-has-been-solved/","cat":"tinfoil_hats","title":"Vinny: The mystery of the Shroud of Turin has been solved"},{"id":"comment-56772","author":"jeffrey_liss","post":"Charles Freeman : O/K/ In that case perhaps we ought to reintroduce it with its priority being monitoring blogs about the Shroud do you think it should still keep burning as a last option for those who remain sceptics? Tell you what: let’s make a rule. No one shall ever be subjected to any punishment than that endured by the man on the Shroud. Yeah. Perspective..","date":"2013-12-05","mins":"2:41 pm","url":"https://shroudstory.com/2013/12/05/you-need-to-read-both-lines-of-the-headline/","cat":"humor","title":"You need to read both lines of the headline"}]
