[{"id":"comment-61574","author":"jeffrey_liss","post":"They finally found a pope they like. That’s great. Now if they would just listen to what he says…instead of what they *think* he says….","date":"2013-12-18","mins":"10:53 am","url":"https://shroudstory.com/2013/12/18/a-new-image/","cat":"press_coverage","title":"A New Image"},{"id":"comment-61635","author":"jeffrey_liss","post":"I refer to translation in the literal sense. The man thinks in Spanish and, to some extent Italian. The statements he makes — the ones most misunderstood — are usually expressed in Italian (a second language), then translated, often inexpertly by those lacking necessary context, into English. In this form, they propagate within a global press that, while not *entirely* hostile, tends to exhibit a uniform incompetence when reporting on the Catholic Church. In short, one should be exceedingly skeptical of statements attributed to Pope Francis in the popular media. There have now been multiple cases were what was reported was, in fact, the exact opposite of what the pope actually said. Find a competent source and trust *only* translations provided by that source. I recommend Fr. John Zhulsdorf. When I want to know what the pope *really* said, I read his blog..","date":"2013-12-18","mins":"12:38 pm","url":"https://shroudstory.com/2013/12/18/a-new-image/","cat":"press_coverage","title":"A New Image"},{"id":"comment-58973","author":"jeffrey_liss","post":"$15.00 for a book by an author I’ve never heard of making some pretty outlandish claims? I think not..","date":"2013-12-13","mins":"3:20 pm","url":"https://shroudstory.com/2013/12/13/please-only-discuss-michael-judes-book-and-claims-here/","cat":"books","title":"Please Only Discuss Michael Jude’s Book and Claims Here"},{"id":"comment-71668","author":"jeffrey_liss","post":"So, bottom line, the video’s description of the condemned tied together is speculation. OK, but where did the ‘reconstruction’ originate? There has to be some source for this; did the guy in the video come up with it himself?.","date":"2014-01-03","mins":"11:52 am","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","title":"New Video: Discovering Jesus in His Holy Shroud"}]
