[{"title":"A Guest Posting by Giulio Fanti","post":"I’m sure our friend Giulio consider himself as the best Shroud expert on earth.  I don’t.  This is called “Freedom of speach”.\n\n","date":"November 4, 2011 at 1:16 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4577","author":"Yannick Clément","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"Wow, things are looking up around here. First a comment from Ray now Giulio! …with respect. Personally I have no qualms with any of your work Mr. Fanti, who am I to show any opposition. Actually I believe any kind of study (wherever it may lead) is a good thing. My point in opposition was only in not understanding why a you believe a ‘supernatural phenomena’ explanation would be needed to explain away the erroneous 1988 carbon dating? I understand the theory behind the possibility of shall I say, a radiation type image formation altering the c-14 results, but that explaination is certainly not needed to explain away the 1988 results!. Basically there were so many errors made back then during the testing, one being people took the results as concrete. In saying that, I feel, it was a shame the dating was accepted by the scientific community in particular, and should have been challenged immediately by them. Them (the scientific community) knowing quite well the whole thing smelled of improper protocols etc; So my question still stands; Why the extreme is needed to answer something already known to be erroneous by simple means?\nR\n\n","date":"November 4, 2011 at 1:35 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4578","author":"Ron","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"As I mentioned in a previous post, Science moves forward thanks –among  many other things- to publications in peer-reviewed journals belonging to the JCR. My position is that if we want Shroud studies –also those carried out by Fanti- to be taken seriously by the scientific community, we should adopt the same protocols and standards as in any other scientific field. For this reason, as far as I am concerned, to judge his apportions I will stick to those criteria. In the light of that, out of all his publications he has freely decided to publish in this blog, only the 5 papers in  J. Imaging Sci. Technol. can considered to be true scientific contributions because this journal is in position 15 out of 19 in the JCR in the field of IMAGING SCIENCE & PHOTOGRAPHIC TECHNOLOGY. However, I consider that exhibiting these 5 papers to support things like resurrection, Medjugorge, supernatural  and so on which go far beyond Fanti’s scientific works, simply is not either scientific….. nor honest.\nThough a Catholic myself, I think this approach in which some scientific results which belong to a specific field (image Analysis) are used to explain religious believes that currently neither FAnti nor anyone else can demonstrate scientifically, makes a lot of harm. If Fanti is writing on theology, Ok, no problem but PLEASE don`t call it SCIENCE. At least, in this period of history (XXI century) they are completely different realms.\n\n","date":"November 4, 2011 at 3:49 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4582","author":"Gabriel","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"Ron you wrote : why a you believe a ‘supernatural phenomena’ explanation would be needed to explain away the erroneous 1988 carbon dating?  I can answer that easily :  because M. Fanti believe (with no proof of that of course) that the Shroud body images are a by-product of the resurrection and that it can physically proved this event !!! (see : http://avalonra.altervista.org/sections/03_Downloads/Medium_Support/La_Sacra_Sindone/Kevin%20Moran%20-%20Does%20the%20Shroud%20body%20image%20show%20any%20physical%20evidence%20of%20Resurrection.pdf).  When you believe this kind of thing (I was about to use another word but I want to stay polite), it is hard to acknowledge the proper work and findings of a well respected scientist (except for M. Fanti who always seem to disregard everything that come from Rogers) like Ray Rogers (and some others scientists who have properly confirmed his findings after his paper was published in 2005).  Why ?  Simply because this kind of findings don’t go along too well with some burst of energy coming from the corpse at the moment of resurrection.  M. Fanti believe that it was this kind of thing that change de C14 content.  Sorry but this kind of belief (again, I was about to say something else) hasn’t been scientifically proved yet !  When you look at the way M. Fanti conclude his comment, it is pretty obvious to see where he stand in the world of the Shroud and it is surely not with the majority of the scientists on this planet…\nI would conclude with 2 questions for M. Fanti :\n1- You think the Shroud proves the resurrection ?  Show me the proof !\n2- You think that there’s some supernatural forces going on during the Marian apparitions in Medjugorje ?  Show me the proof ! \nOf course, we’ll still be here in 100 years and still wait for those proofs…  Don’t you think it is bizarre for a scientist like him to take those things (that are very far of being proven) for granted ???  By the way, what kind of big findings M. Fanti has bring to the Shroud science ???  I’m not aware of anything…  That’s why I prefer to make my trust on most of the STURP work and conclusions !\n\n","date":"November 4, 2011 at 3:51 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4583","author":"Yannick Clément","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"Yannick, I think your misconstruing my question to Prof.Fanti. I am not in any form opposing his views on the image formation mechanism or his hypotheses on such. As I’ve mentioned here several times; I am in agreement with those who believe the image IS a ‘DIRECT’ result of the resurrection, not a bi-product of such, and have challenged anyone to prove this wrong.\nAs for R.Rogers, I think the problem may lie in the samples in which he had used to come to his conclusions, not in his abilities…so no reason to defend him. Many have an issue with these samples, so Prof Fanti is not alone. I personally cannot see R.Rogers, in respect to his professionalism, overlooking such an important issue. So I have to agree with his findings in his 2005 paper.\nMy question to Prof Fanti, is simply; With all the knowledge we have today of the bumbled 1988 carbon dating, why does he believe such an extreme answer is needed to explain it away? Anyone that has read anything on the whole C14 procedure or should I say non-procedure followed in 1988, it is quite clear the 3 labs came to erroneous conclusions and I would think Mr.Fanti would be aware of this information…thats all.\nR.\n\n","date":"November 6, 2011 at 11:24 am","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4609","author":"Ron","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"Believe me Ron, don’t get fooled by people who pretend Ray’s sample was not valid.  I saw evidence that it isn’t the case.  In his paper and everywhere else (in interviews, etc.) Ray always tell that his sample came from the middle of the whole C14 region.  This summer I had the previledge to see a drawing of where exactly this sample came from and guess what ?  It came EXACTLY where Ray always told people :  From the center of the C14 region !  To be precise, it was 2 threads that came from the area immediately adjacent of where the sample for the C14 labs have been taken.  In other word, it came from the center of the C14 region right between the samples for the labs and the reserve sample that was cut and kept by the Centro in Turin.  So, it was A PERFECTLY VALID SAMPLE !  There’s a hope that some people might publish something in the next few months about that to confirm what I just wrote…  To be continued !!!\n\n","date":"November 6, 2011 at 9:56 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4622","author":"Yannick Clément","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"One last thing I would like to say to M. Fanti :  When you make public claim as radical as yours, I just hope you are prepared to receive some big critics of rational guys like me !!! ;-)  And be sure that everytime I’ll read supernatural comments here (from you or anyone else), I’ll write a comment to say that I disagree with those kinds of beliefs.  And it’s my right as a Catholic to express my point of view on those kinds of questions.  Love it or not, this is where I stand and I know I’m not alone…\n\n","date":"November 4, 2011 at 4:15 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4585","author":"Yannick Clément","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"This is part of what seems to be driving Dr. Fanti. He is actually citing this junk on SSG. “From my reading of many books on the Year 2012, I see that this scenario  is very similar to that described in these books, the common theme being that there will be no electrical power to heat and light our homes, and the only protection will come from prayers, especially to the Mother of God, and by lighting a blessed candle.  It is very likely that far-infrared light emanating from blessed candles may also offer additional protection, as demonstrated by an American physicist, Prof. Phillip Callahan of the University of Florida. It may sound presumptuous, but I believe that electromagnetic energy generated during prayers in Medjugorje, where  The Mother of God is appearing daily, may form a kind of  a protective umbrella against deadly radiation coming with the solar wind.  …  Due to closing of the recent precession cycle in 2012, the Earth axis will assume a perpendicular position to the Galactic eclipse and thus geographic areas between Poles and the Equator will have a constant, Spring-like  weather. – A thousand years of Peace ?  …  In conclusion, despite terrifying predictions associated with the year 2012, we will survive if we follow the instructions given to us by God.  It is possible that many people will perish, but we cannot consider it to  be God’s wrath, but a kind of a self-punishment resulting from our lack of faith particularly in a protective love of Our Lady of  Fatima and Medjugorje that is the belief and trust in God and His Providence.\nDont believe me then check out http://www.medjugorjeusa.org/boguslawstudy07.htm and ask Dr. Fanti why. It is all electrical corona discharge stuff that is doing images and changing carbon dating.\n\n","date":"November 5, 2011 at 10:48 am","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4597","author":"impman","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"Thank you for this confirmation of what appear to me as obvious as the nose in anyone’s face !  M. Fanti, like MANY OTHERS (he’s not alone in his category) in the Shroud world is agenda driven with the purpose of making people believe that the Shroud show a physical proof of the resurrection.  And that’s really sad because, when a atheist or a agnostic read things like that, how do you think he react ?  With a big laugh saying things like : those fanatical christians think again like the middle ages !  My friends, don’t you think this kind of pseudo-science work against the Shroud ?  I really think so and I found it very sad to see the Shroud being very often associated with words like “paranormal”, “supernatural”, “miracle” or other things like that.  It has the terrible effect on a large part of the public (who don’t know much about it) of linking to easily the Shroud (which is for me an authentic piece of archaeology) with any kind of mysterious phenomenon like the ghosts, the UFOs, etc.  Real sad !  You don’t believe me, just look at the books published on the Shroud in the last few years !  It seems like more than 75% of those books dedicated to the Shroud make bad “mysterious” links like that just to make a buck !  That’s my perception and I found it very sad because this thing contribute to hide the real message of the Shroud which is to talk about the reality of the Incarnation of God, the reality of his Passion and the reality of his death for all mankind.  But, at the same time, I understand perfectly people like M. Fanti because it’s part of human nature to always look for marvelous in our life.  But, it’s not an attitude that was praised by Jesus at all !  Remember what teaching he gave to the doubting Thomas when he appear to him ?  Blessed are those : “Because you have seen me, you have believed; blessed are those who have not seen and yet have believed.”\n\n","date":"November 6, 2011 at 6:04 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4615","author":"Yannick Clément","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"Could Yannick Clément tell us if he knows an ‘all natural’ physical/chemical method that could form an image with all the features of the Shroud image?\nAnd statistically  how many possibilities there were tha this natural  method (whatever was) happened only once in history ?\n\n","date":"November 5, 2011 at 9:37 am","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4595","author":"domenico","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"I have some ideas but it’s just possible avenues of research for the moment.  And since I’m not a scientist myself, I’ll have to contact a biochemist or someone like that to propose him the researches I have in mind.  But my friend, be sure of one thing :  EVERY SINGLE NATURAL HYPOTHESIS AND POSSIBILITIES HAVE NOT BEEN DISCARTED YET !!!  More researches need to be done (and I hope one day they will).\n\n","date":"November 6, 2011 at 8:48 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4618","author":"Yannick Clément","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"I forget to answer the second part of your comment.  When you say that it happened only once in history, sorry but it’s not completely true !  Go see this paper from Barrie’s website : http://shroud.com/pdfs/mattress.pdf\nAlso, in his book “101 questions about the Holy Shroud”, Baima Bollone reports some more burial cloths that are supposed to show a body image of the dead.  It’s EXTREMELY RARE, but it seemed to have been reported a few times over the centuries.\nFor the Jospine matress in particular, I don’t say it was exactly the same chemical process that was involve in the case of the Shroud body images, but THE FACT IS that nature can create body images on a cloth !  You can believe anything you want and it’s ok but please, don’t tell me that nature cannot create a body image on a cloth because it’s simply not true.  This Jospine Matress is there to prove I’m right about that.  \nWhy a thing like that don’t happen more often ?  My guess is this :  Because all the physical, chemical and environmental elements and conditions that are needed to be present to create such an image are so improbable that it is extremely rare that it happen.  Also, when do you see a dead being put out of his burial cloth before his body start to rot ?  This is also extremely rare !  That’s another answer to explain why we don’t have many body images on cloths !  Because they rot with the dead !!!!\nSo, you see, I don’t buy this (wrong) argument that the Shroud is alone in his category and that’s a proof that the image is miraculous.  Nice try but you’ll have to find another argument… ;-)\nA reading suggestion for you (from Dan’s excellent website) :  http://www.shroudstory.com/faq-burial-of-caiaphas.htm\n\n","date":"November 6, 2011 at 9:39 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4621","author":"Yannick Clément","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"I think this is Fanti’s answer:\nhttp://www.dim.unipd.it/fanti/diffusion.pdf\n\n","date":"November 7, 2011 at 6:27 am","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4633","author":"domenico","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"Right.  This is Fanti’s answer.  BUT… Who say that he’s right ? ;-)\n\n","date":"November 7, 2011 at 2:01 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4646","author":"Yannick Clément","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"Dear friends\nProfessor Fanti is a great scientist who has given important contribution to the scientific study of the Shroud of Turin last couple of years, following the important S.T.U.R.P.’s studies and many others by american researchers.\nHis image computer studies on the Image definitely shed light on the way the Man of the Shroud had been wrapped and his height and relative body parts position by extracting information from image luminance.\nIf you read his papers about the hypothesis of image formation by Corona Discharge you’ll become aware of the complexity of the subject, and no way it goes scientifically against rational hypotheses.\nRead also his paper about comments on gas diffusion hypotheses and you’ll understand why Professor Rogers’ theory on amyno-carbonyl reaction cannot explain all the characteristics of the Shroud of Turin image as admited by himself.\nProfessor Giulio Fanti is crystal clear when he asserts that the Resurrection is a phenomenon non reproducible by science but LEAVING SCIENTIFIC GROUNDS could be the explanation for the hypothezised Corona Discharge and its by products.\nI agree that the image on the Shroud of Turin is not «the proof» of the Resurrection, and Ressurection cannot be explained by science nonetheless if you’re Christian or Catholic and you believe the Shroud of Turin is authentic and really did wrap the crucified body of Jesus Christ, then it is not absurd to consider the Shroud as the material witness of a weird phenomenon that happened in a dark tomb about 2000 years ago with a man who is supposed to be the Son of God.\nIf scientifically speaking the Shroud is not the «proof» of the Resurrection, from a theological and phylosophical stand point no doubt it is.\nIf we consider ourselves Christians we should not fear to state that the Resurrection was a physical event and the Shroud is an important clue to belive it really was.\n                                                                                 best regards\n                                                                                  Maria da Glória\n                                                                       Centro Português de Sindonologia\n\n","date":"November 5, 2011 at 2:50 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4599","author":"maria da glória gonçalves barroso","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"Very well said Maria, especially agree with your last two paragraphs!….\nThank you.\nR.\n\n","date":"November 6, 2011 at 11:30 am","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4611","author":"Ron","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"Hello Maria !  I understand perfectly well what you say.  I don’t agree with you about M. Fanti but that’s another story and it’s not relevant about what I want to respond to you.  What I really want to say is this : There’s one important thing to remember :  it’s not because science his not able for the moment to fully explain the body image that it means that it came from a by-product of the resurrection !  The same thinking is true versus the fact that this cloth is supposed to belong to Jesus (which I think is true).  In other word, it’s not because it’s the Shroud of Christ that it means the image on it has anything to do with the resurrection.  I think I’m not alone to be a Catholic who believe in the resurrection and, at the same time, who don’t believe one second that this SPIRITUAL event was the source for the images.  \nDon’t get me wrong here : I respect the belief of a guy like Ron because, unlike the Fantis of this world, he’s not someone who desperately want to use the Shroud as a banner to say : “Look what we have here !  A proof of the resurrection !”.  It’s only when people who are supposed to be scientists (I’m not talking specifically of M. Fanti here because there’s many other like him) and despite that fact, wanted anyway to used the Shroud to promote some ideology that I raise the red flag and say :  WOOOOO !!!!  I’M AGAINST THIS KIND OF ACTING !!!  I feel ok with the fact that people like Ron and maybe you or maybe Domenico believe the Shroud body images have been produced by a by-product of the resurrection !  It’s your liberty and I live well with this.  The only problem is when someone use science to promote this idea and make believe that the Shroud offer a PHYSICAL PROOF of the resurrection !  I’m against that because it’s not true !  PERIOD.  All that M. Fanti has been able to do his to show that a plasma ball or a UV laser can create a coloration on linen that is near the coloration on the Shroud.  Big deal !  I can responde that Sam Pellicori of STURP was able to show that sweat or myrrh or olive oil was able to create a coloration also very close to the Shroud image !  You see, coloring linen is pretty easy.  But that don’t mean one bit that it is a proof that the Shroud image was done that way !  M. Fanti and M. Pellicori cannot pretend to have proven anything regarding the Shroud !  \nOf course, as I often said, the Shroud offer a SIGN of the resurrection because there was really a dead man (with all the stigmata of Christ) who was crucified in this cloth, but is body seemed to have disappeared completely before any signs of putrefaction and the blood stains didn’t seemed to have been disturb.  What I just describe is not a proof.  It is a sign.  Only with the eyes of faith we can see a real sign of the resurrection there !  Why I react so hard against people like M. Fanti ?  Because the fact that when he promote to the public his idea about a physical proof of the resurrection, he may convince some people to believe in Christ only on this poor base !  And I really think that basing his faith on the Shroud is a really bad thing…  That’s why I react agains people who tend to propose the Shroud as the base for someone’s faith.  With the eyes of faith, the Shroud is a sign, but it will never be a proof.\n\n","date":"November 6, 2011 at 9:07 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4619","author":"Yannick Clément","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"One last comment to Maria (and anyone else) :  Why is it so hard to believe that the Shroud is really Jesus Shroud, that the body image is really is body image, and at the same time, this image was naturally done ?\nDon’t you think that God cannot use the forces of nature to accomplish his Will ?  I’m sure he can !\nWe, the ones who believe the Shroud is genuine must concentrate on one thing : the authenticity of the relic and not how the image came to be (even if it’s an important question).  We always tend to focus only on this aspect of the Shroud (the formation of the image) while we should reflect more about what message the images told us !\n\n","date":"November 6, 2011 at 10:21 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4624","author":"Yannick Clément","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"but if these ‘forces of nature’ occurred only once in history to form an image in a cloth (as we do not know other cloths with a same image)  we should ask why this happened…\n\n","date":"November 7, 2011 at 3:04 am","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4627","author":"domenico","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"Good point Domenico…  But even then, if it’s a natural process that has formed the images, I’m not so sure that it really happen only once in history.  The problem is that normally, a burial shroud did rot with the corpse !  So, even if it show a body image, nobody could see it and it will disappear with the rotting process.\n\n","date":"November 7, 2011 at 10:42 am","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4641","author":"Yannick Clément","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"Yannick, to your post no.6; Please, I have not been fooled by anyone. I am quite aware of the sample area where R.Rogers threads came from. I’ve seen the same pictures too. If you read my post you’d understand that what I meant was; I agree with Rogers 2005 paper and his conclusion on the issue.\nTo your post no.15; You first ask how we cannot believe it may be a ‘naturally’ produced image, if produced by God, then make a statement about us all focusing on the image formation when we should be focusing on the message…That does not make sense, if this is a ‘message’ from God, (and I believe it is) then it is definately not ‘natural’ by any means, and seriously, if you look at all the attributes and complexities of the Shroud image; it truly defies all ‘natural’ possiblities, atleast to date.\n I will agree we ‘believers’ should all contemplate the ‘meaning’ of the Shroud. This I can say, I have done for many years. I’ve wondered why God would create this image in such a way that it’s true value would only be recognized in our modern era? and if so, what does that mean?  Part of the answer may be it is simply a sign, but that seems too simple. Could it be as I’ve mentioned before, also a means to show us how little we really understand, that we have become errogant in our technological society and we must  humble ourselfs? …The ‘reason’ for it’s existence is exactly what has kept me infactuated with it’s presence.\nR.\n\n","date":"November 7, 2011 at 2:49 am","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4626","author":"Ron","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"I think the main reason for the existence of the Shroud is this :  to confirm to every people with one bit of judgement that the gospels are not fairy tales but were written by honest guys !  The one who has said that the Shroud is the fifth gospel never say anything more right than this !\n\n","date":"November 7, 2011 at 2:03 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4647","author":"Yannick Clément","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"Dear friends\nWhen I wrote my comment I didn’t imagine it was going to start a kind of debate on the Resurrection and the Shroud.I guess I stated crystal clear my opinion on that subject and after reading Yannick’s comment it turns out his point of view doesn’t differ too much from mine.\nIf from a scientific point of view it cannot be stated that the Shroud of Turin is the «scentific proof» of the Resurrection, I and even scientists may infer that although the image depicted on the Shroud was produced by a natural but yet unknown agent,that happened under unknown conditions.\nSo the big question is why a dead body imprints its image on a cloth?\nThe answer will be quite staightforward BECAUSE THAT BODY WAS UNIQUE  and a special event happened on that dark tomb some time after the burial.\nI guess maybe Yannick misunderstood the word «by products» I meant not by products of the Resurrection but by products of a possible natural event such as Professor Fanti’s Corona Discharge hypothesis or other kind of natural phenomena.\nI think Domenico understands what I mean, nevertheless that was an uncommon phenomena and it happened only once in the History of Mankind and only with a man whom we believe was Jesus Christ.\nSo be it a sign as Yannick calls it or a clue the fact is that the image on the Shroud backs up christian belief on a real and physical Resurecction of Jesus and not a kind of «spiritual» Resurection whatever it may be.\nWe should not claim that the Shroud is the proof of the Resurrection but no doubt its own existence and the message it contains supports that belief.\n                                       Maria da Glória\n                               Centro Português de Sindonologia\n\n","date":"November 7, 2011 at 10:33 am","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4640","author":"Maria da Glória Gonçalves Barroso","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"I should say that I also disagree with the kind of thing Fanti proposed and, be honest with me Maria, a corona discharge that happen in a sealed tomb with a dead corpse in it is not what I call a natural event.  It’s clear that M. Fanti proposed this hypothesis to make believe that the Shroud show a proof of the resurrection.  I’ll say it again and again and again, right until I die : IT’S A BIG LIE !  Science will NEVER be able to prove resurrection (even if M. Fanti and many others try hard to convince people that it is the case).  For example, to be able to prove his hypothesis, M. Fanti would have to take a fresh corpse and a linen shroud and try to recreate a corona discharge from inside this dead body and product a body images of it (ventral and dorsal) with all the same characteristics (physical and chemical) than the body images on the Shroud.  If someone really think that he or any other scientist can accomplish that, he must be willing to believe anything.  And Maria, I’m sure you don’t belong in this category because you seem to me like someone that is pretty wise.\n\n","date":"November 7, 2011 at 4:41 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4656","author":"Yannick Clément","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"I agree with most of what you say Maria but I would like that you define what you mean exactly by “physical resurrection” ?  Do you think Jesus body was simply re-animated ?  When I ear physical resurrection, that’s what comes into my mind !\n\n","date":"November 7, 2011 at 2:05 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4648","author":"Yannick Clément","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"“Ved mis manos y mis pies:soy yo mismo.Tocadme y daos cuenta que un espíritu no tiene carne ni huesos como veis que yo tengo”. Lucas 47.39.\nLucas refiere una resurrección FÍSICA, antes MUERTO y ahora VIVO, \nCarlos Otal\n\n","date":"November 7, 2011 at 3:02 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4650","author":"Carlos Otal","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"You’re free to believe in a pure physical resurrection my friend Carlos.  But I’m free to disagree with you.  Jesus resurrection was much different that Lazarus resurrection and that’s what St-John in his gospel try to show us.  The apparitions of Jesus were real (just as some Marian apparition (like in Lourdes) I believe were real.  But is body (just as the body of Mary) wasn’t the same no more.  Do you know a physical body that can pass right through the door or disappear in a second ??? I don’t.\n\n","date":"November 7, 2011 at 3:25 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4653","author":"Yannick Clément","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"Yannick:\nDice un viejo refrán que “el hábito no hace al monje”.\nTodos somos libre de pensar como queramos, pero si en un debate usted se presenta como cristiano católico CONFUNDE a los lectores.\nEl evangelio no deja lugar a duda de que Jesús RESUCITADO dice tener carne y huesos, muestra sus heridas ( pide a Tomás que lo compruebe ), y además Jesús come y bebe para mostrar que NO es un espíritu.\nYo, personalmente NO voy a llevar la contraria a lo que los evangelistas ponen en boca de Jesús.\n¿ Cree usted que un cuerpo ESPIRITUAL? tiene carne y huesos, presenta heridas y come y bebe?\n¿Qué cree usted que sucedió con el CUERPO de Jesús?\n\n","date":"November 7, 2011 at 4:17 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4654","author":"co","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"In my mind, Jesus body became spiritualized !  He is into another dimension (spiritual dimension) completely different than our material world…  I don’t want to start a theological debate.  I had one big with Manuel Carreira (private one) and it’s enough (even if I have the feeling me and Maria have open Pandora’s box by talking of physical and spiritual resurrection).  \nM. Carreira, like you, like me, like Carlos, like Maria, are completely free to believe what we want and in the end it doesn’t matter that much.  Why ?  Here’s a truth to all of you :  nobody is correct about the reality of the resurrection !  And why’s that ?  Just because we will only know this reality at the moment we’ll die.  How can we claim to know the full truth about something like that, something we never experiment ?  One thing’s for sure : the resurrected Jesus wasn’t the same no more.  A proof of that ?  Even his closest friends were not able to recognize him at first sight !  That’s too is in the gospels my friend.\nAnd I believe I won’t be the same no more myself after I’ll die (even if I will continue to be Yannick Clément).  It’s the biggest mystery of all and even if we keep debating about that for 10 years, we will be at the very same spot than right now.\n\n","date":"November 7, 2011 at 4:28 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4655","author":"Yannick Clément","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"Yannick:\nNo me interesan los aspectos teológicos, soy librepensador que creo en Jesús de Nazaret, en su mensaje y en su Resurrección, y este último aspecto incide en el tema de la Sábana.\nLa resurrección FÍSICA y la ESPIRITUAL son hechos ambos COMPATIBLES en los últimos días de Jesús de Nazaret.\nUsted parece admitir, como yo, que Jesús desapareció de sus envolturas (las manchas de sangre lo significan) y ello supone la DESMATERIALIZACIÓN de su cuerpo, su Resurrección Espiritual.\nCuando tiene que mostrarse, aparecerse a sus discípulos, su cuerpo se MATERIALIZA, tiene carne y huesos, muestra heridas y come y bebe como indica el Evangelio, los discípulos lo ven físicamente, no espiritualmente y por lo menos al principio con el rostro terriblemente deformado por el suplicio sufrido y las heridas abiertas.\nDesmaterialización y materialización son hechos SOBRENATURALES que involucran a la MATERIA y que por lo tanto pueden afectar a la naturaleza FÍSICA del entorno, cosa que en mi parecer sucedió con la Sábana de Turín, testigo de la Resurrección.\n(Ruego disculpe no poder expresarme en su idioma)\n\n","date":"November 7, 2011 at 8:09 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4657","author":"co","site":"shroudstory"},{"title":"A Guest Posting by Giulio Fanti","post":"I agree with you on the fact that Jesus body disappeared from inside the Shroud (leaving intact all the blood AND body images that were already there – that’s what I think) and then, he reappeared many times to his disciples.  But the fact that this NEW body wasn’t bound by the laws of nature and also the fact that his closest friends were not able to recongnized him at first sight is, for me, a proof that it wasn’t a the same physical body Jesus had during his life on earth.  His body was still a body (he could be touched and he still show the stigmatas of the Passion) but a body that was “spiritualized” if I can used this term.  In this context, I don’t think it his appropriate to use the term “physical body” for this glorious body of Christ because it is a body that lives now in another dimension totally outside of our physical world.  But, at the same time, he can appear (just like Mary) anytime he want in the physical world and can interract with it !  It’s a mystery that we will only understand after we die.  That’s were I stand in my reflection.  But again, I will never say I understand perfectly this great mystery !  If I acted this way, I would be very pretencious…\n\n","date":"November 8, 2011 at 11:54 am","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","id":"comment-4669","author":"Yannick Clément","site":"shroudstory"}]
