[{"title":"A Telling Interview with Giulio Fanti","post":"A fascinating interview, Louis, which sheds further light on Prof Fanti’s viewpoint.  The accompanying background paper is also an excellent summary on aspects of the TS, and the graphics are excellent.  His responses to your interview questions come across as properly judiciously cautious, not at all like the dogmatism or singular view that he often seems to be accused of in various reports.  \nHis reasons for asserting the corona discharge hypothesis, are clear: one of the few processes apparently that can result in a second superficial image.  \nAt least two of his assertions might be contested.  He continues to claim that the image resides on the PCW;  Ray Rogers of course was convinced that the image resided solely on the starch type coating, and he was able to remove the coloration from an imaged fibre with dimide leaving the underlying fibre quite intact.  He also commented that the image emission occurred normal to the body surface;  that in itself creates a problem with the orthogonality of the image, which appears more like it being normal to the receptor cloth, and of course there are no imaging signs of the side of the body. \nI note his comment on radon, where he asserts that there is very little radon in Jerusalem tombs.  That might not be the case immediately following an earthquake, when radon is commonly released from within the earth.  Giovanna De Liso who has promoted the radon aspects, is of course one of his proteges.\n\n","date":"July 15, 2014 at 6:10 pm","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","id":"comment-138560","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Telling Interview with Giulio Fanti","post":"“His responses to your interview questions come across as properly judiciously cautious, not at all like the dogmatism or singular view that he often seems to be accused of in various reports.”\nMaybe because he has not always been judiciously cautious :\nhttps://shroudstory.com/2011/12/26/not-happy-with-giulio-fantis-paper-in-jist/\nWaiting for Vernon Cooray, as professor at Uppsala he should not say to much baloney.\n\n","date":"July 16, 2014 at 2:34 am","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","id":"comment-138638","author":"anoxie","site":"shroudstory"},{"title":"A Telling Interview with Giulio Fanti","post":"Thanks for posting this, Dan. Piero can clear his doubts about the lightning here and the topic gains importance in view of the paper to be presented by the Sri Lankan scientist Professor Vernon Cooray (Uppsala University, Sweden), author of around 200 scientific papers and a recognised authority, in Bari, Italy.\nI must also add that Ian Wilson sort of confirms Professor Giulio Fanti’s peer-reviewed paper on the double superficiality. In his last Shroud book he tells us that Dr. Mechthild Flury-Lemberg and her assistant Irene Tomedi removed the sixteenth-century backing cloth in 2002, and “to everyone’s surprise some vestiges of a face turned out to be discernible on the underside.”.\n\n","date":"July 15, 2014 at 6:15 pm","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","id":"comment-138563","author":"Louis","site":"shroudstory"},{"title":"A Telling Interview with Giulio Fanti","post":"Thanks, for the remarks, daveb. As a civil engineer with experience in railway bridges you will undoubtedly understand more than me about the technical aspects, things like measurements, pressure and earthquakes.\nProfessor Fanti’s research was funded by the University of Padua and he was referring to radon in Jerusalem tombs, not to the city or Israel. It seems that the country has operations to control radon, which varies from city to city. If, as you say, radon is released during earthquakes, then that is another point needing investigation.\nProfessor Fanti also had some threads in his possession, and that enabled him to make assertions about where exactly the image resides. He at least has some backing in the form of what IW stated in his book about the double superficiality, and the ball lightning he talks about may receive further support from the paper presented by Professor Vernon Cooray in Bari.\n\n","date":"July 15, 2014 at 6:42 pm","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","id":"comment-138568","author":"Louis","site":"shroudstory"},{"title":"A Telling Interview with Giulio Fanti","post":"Professor Fanti is quoted in the interview as follows:\n“Radiation has been proposed as the source of the body image because we know that the image also resides where body-cloth contact is not possible, for example in the zone between the nose and the cheek or between the hands and the belly, therefore I agree with it.”\nIt would take too long and/or require too many cut-and-paste images at various degrees of enlargement or contrast adjustment to deal with those two points adequately. Suffice it to say that I have recently done just that (late last night!) and added the results to my current posting: \nhttp://colinb-sciencebuzz.blogspot.fr/2014/07/it-seems-so-obvious-now-why-man-on.html\nConclusion: the nose area has too much image homogeneity, i.e. too little information to provide any sound basis for accepting or rejecting either contact or radiation as the image-imprinting mechanism. The crossed hands area however, with the image-depleted area on the abdomen in the immediate vicinity of the crossed hands, is precisely what one might have predicted for a contact-only mechanism, with no evidence that I can see for image-imprinting across air gaps, even ones of a centimetre or two,\nSorry if Prof Fanti views these and other comments as trial by internet. I prefer to think of it as informed vox pop, without which the big shots in Shroud research would have things all their own way with their books, their press releases and clubbish conferences.\n\n","date":"July 16, 2014 at 2:49 am","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","id":"comment-138641","author":"Colin Berry","site":"shroudstory"},{"title":"A Telling Interview with Giulio Fanti","post":"This one is not from Fanti, but yes, there is image where body-cloth contact is not possible. \n“I made no reference to corpses in that last comment, anoxie. It was cast entirely in generalities. Once again, you are trying to damage my blogging credentials by any and all means possible.”\nI should add, i make reference to a real body, i don’t want to hurt Colin’s blogging credentials.\n\n","date":"July 16, 2014 at 3:09 am","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","id":"comment-138648","author":"anoxie","site":"shroudstory"},{"title":"A Telling Interview with Giulio Fanti","post":"“I must also add that Ian Wilson sort of confirms Professor Giulio Fanti’s peer-reviewed paper on the double superficiality. In his last Shroud book he tells us that Dr. Mechthild Flury-Lemberg and her assistant Irene Tomedi removed the sixteenth-century backing cloth in 2002, and “to everyone’s surprise some vestiges of a face turned out to be discernible on the underside.”.\nReally? I am surprised. \nMons. Ghiberti:\n“…on the toward of the cloth sindonico all the blood was visible, that was pierced in such a total form to constitute rhyming sure for the identification of the corresponding point on the straight one; it was not instead recognizable anybody trace of image. The only point of possible discussion was constituted by the face, because in the verse they seemed identifiable the two gangs of hair. You insist therefore some acquirable details with all the means of relief. Waiting for the analyses that will be done beginning from these gives, the presents were found of accord in him to attribute the impression of image for that alone point of the whole surface sindonica to the fact that the two gangs bring traces of blood pierced from the facial surface and to the fact that is above all on the right part in that point it foresees a darkest strip on the same fabric, due to some cause insudiciante.” (“The history of the restoration 2002”).\nMario Latendresse: \n“Moreover, at the 2005 Dallas conference, during the public question period, I asked Monsignor Ghiberti and Dr. Mechthild Flury-Lemberg, who directly saw the back side of the Shroud during the 2002 restoration, if any images could be seen on the back side. Their answers were clearly negative.” (Mario Latendresse in http://www.sindonology.org/ ).\n\n","date":"July 16, 2014 at 3:26 am","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","id":"comment-138651","author":"David Mo","site":"shroudstory"},{"title":"A Telling Interview with Giulio Fanti","post":"There’s an artefact (“trick of the light”) that folk without a magnifying glass need to be aware of before being too quick to refer to reverse-side coloration. It’s one that anyone can demonstrate with a coloured marker pen.  Draw a cross quickly on one side of woven fabric. Then look at the other side. Do you see this kind of “reverse-side image”?\nhttp://shroudofturinwithoutallthehype.files.wordpress.com/2014/03/dsc09696.jpg?w=640&h=480\nNow examine it with a hand lens. If it’s like the one in my photograph  you’ll find it’s not a reverse side image at all. The colour is not on the fibres. It’s coming through the interstices of the weave from the other side.\nIt’s an artefact of light filtering and reflection, best seen when the fabric is on a light coloured (reflective) surface. Light enters the observer’s image-free side of the fabric. It then penetrates through fibres to the opposite side, where it becomes coloured light as it passes through the genuine image. That coloured light then reflects back off the underlying surface, mainly (or most visibly) through the interstices of the fabric.\nI’m not saying that the “second face” claims are necessarily the result of this artefact, but would like nevertheless to see convincing evidence for a reverse-side image on the TS that has not been computer-processed in any way.  Maybe it exists, maybe not. If it does, could the owner or owners  please consider posting it free of charge to an internet site, say this one.  Thank you.\nPS:  Here are links to my earlier photographic record of the back-reflection artefact, first with red marker pen, then with model contact scorches.\nhttp://shroudofturinwithoutallthehype.wordpress.com/2014/03/09/this-title-will-not-improve-this-blogs-google-ranking-but-then-what-will/\nhttp://shroudofturinwithoutallthehype.wordpress.com/2014/03/10/beware-the-mirage-of-apparent-reverse-side-scorching-produced-by-the-broileffect/\n\n","date":"July 16, 2014 at 5:00 am","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","id":"comment-138662","author":"Colin Berry","site":"shroudstory"},{"title":"A Telling Interview with Giulio Fanti","post":"David Mo: I was merely reporting what I read, and there is a solution, to support or reject what Monsignor Giuseppe Ghiberti says: the microphotographs taken in 2002. Professor Fanti’s peer-reviewed paper contains images.\n\n","date":"July 16, 2014 at 6:46 pm","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","id":"comment-138800","author":"Louis","site":"shroudstory"},{"title":"A Telling Interview with Giulio Fanti","post":"I don’t see any “solution”. Flury-Lemberg (and Ghiberti) rejected the double superficiality of the image after the restauration team had studied directly the back of the Shroud and the microphotographs (statements of 2002 and 2005). Fanti maintained the theory of the double superficiality (face and hands) after examination of the microphotographs only (2004). There is an evident contradiction.\n\n","date":"July 17, 2014 at 3:08 am","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","id":"comment-138864","author":"David Mo","site":"shroudstory"},{"title":"A Telling Interview with Giulio Fanti","post":"Agreed, but whose fault is it? No one has picked up the gauntlet thrown by Professor Fanti in a professional manner.\nIf you read the interview carefully you will notice some things:\nIntroduction: His paper was published in a peer-reviewed journal, not in a Church newsletter\nMsgr. Giuseppe Ghiberti/Mmsse. Mechthild Flury-Lemberg : Their response came verbally, as mentioned by you\nMicrophotographs; Why was Professor Fanti not shown the microphotographs? (see the response to my first question)\nOpposition: Read introduction again. As I said, Professor Fanti published his findings in a peer-reviewed journal and any response should come in the form of a paper, even without peer review.\n\n","date":"July 17, 2014 at 1:07 pm","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","id":"comment-138942","author":"Louis","site":"shroudstory"},{"title":"A Telling Interview with Giulio Fanti","post":"Giulio Fanti ( from the interview) ‘There are hundreds of facts in favour of authenticity and independent probabilistic studies have reported that the probability of the Shroud having wrapped the Jesus of history is 100%, with a negligible uncertainty. ‘\nI wish I knew where all this convincing material was to be found but, if Fanti is right, they obviously have every right to turn down any paper that does not accept this 100 per cent certainty.\n\n","date":"July 16, 2014 at 6:00 am","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","id":"comment-138675","author":"Charles Freeman","site":"shroudstory"},{"title":"A Telling Interview with Giulio Fanti","post":"Here I do not discuss the authenticity, but I stress the issue\nof attempts to understand the formation of the Image on the Shroud\nand the inherent limits on imagination…\nWhy was ruled out the idea of the ancient electrical device?\nWhat is the power required for the condensator (like the Ark of the Covenant)\nin order to work on linen sheet?\nI am curious to read what will be proposed in Bari.\nWe have already seen that even in ancient times were able to build some interesting mechanical device (for example, see : Antikithera) and therefore they could be aable to do something in the electrical field … or not?\nTry to see what Tesla said about the Ark of the Covenant (But … that was really his own opinion on that biblical enigma? … Or his thinking has been distorted?).\nHowever, I say this only speaking from the point of view of the conjecture,\nin fact the Ark of the Covenant has never been found.\nSo I can not believe much in that particular idea.\nBut I’m curious about the mental mechanisms of investigation and discussion\n(involving the relationship between religion and science) put in place.\nThe Ark of the Covenant (or a suitable substitute its electric) may have been\nan interesting source of external energy (see, the past attempt by Judica Cordiglia,\nwho used 90,000 volts of electricity to create an image !), but this is\ndifferent from the internal power source: the Body of the Dead,\nas in the original idea [if I’m not mistaken] Giulio Fanti.\nThis is the key point, and yesterday I wanted to remind you\nof this alternative, which for now is just a fantasy\nwithout any archaeological evidence …\n— —\nAnother question:\nRadon-concentration determination and effect on linen sheet\n(IMO : there is nothing after 36 hours and without applied electrical discharges !).\nIt’s possible to use alpha detectors applied over linen sheet that covers a plastic dolly.\nWhen hit by an alpha particle the material responds becoming black, at then, at end\nyou obtain the interesting corporal map.\nWe have read that :\n>the fluency of alpha particles would have created an image (on the cloth) of the body of Jesus.\nSo …\nWhat was the radon-concentration plateau required to obtain an image ?\nProbably we have to control that statement measuring what happens :\nfrom zero radon concentration to a certain threshold,\nusing a “Radon sand trap” over the linen sheet …\nIf we want to continue the joke with a cocktail of radon daughter nuclei accumulation\n(and electrical charges and alpha particles) we can guess something about the use\nof an ancient electrical device (the famous biblical Ark of the Covenant) …\nBut (at present) this is only a foolish attempt to explain the unknown origin of the mysterious Image\nusing the Phantarchaeology, like “the method” used in the past by von Daeniken and Peter Kolosimo …\nSee also the strange question of Chronovisor and Father Pellegrino Ernetti (and the inherent criticism\nby Massimo Polidoro [a member of an italian organization : CICAP] and Silvano Fuso). Attempts to explain the\nUnknown with other misteries …\n— —\nUnfortunately in my previous intervention dated : July 14, 2014 (and the subsequent hironical additions)\nthere was a sort of pseudoscientific description of Dating Problem with a collection of defective statements…\nand the confusion augmented because the hierarchical structure of linen fibrils was not remembered and discussed\nin connection with the AFM investigations…\nWell : don’t imagine that I can accept such as thing …\nIn any case (and with all due respect to Prof. Lattarulo, Prof. Carpinteri, etc.) the earthquake (or the effect of lightning\nor neutrons emission in association with an earthquake) seem to be a foolish hypothesis because the effect on linen\nsheet are easily understandable … (= smearing and blurring the sheet) … but that fact didn’t happened.\nWhy?\nSo we can argue that presumed earthquakes (… if they happened, see also [for instance] the question\nof lack of serious scientific investigations into the grotto under the Temple and in Ezekiah’s tunnel…) were not involved in Image\nFormation …\n————————-\nMaterials Science and a strange question to solve :\nIs it possible to work [in order to obtain the useful statue]\nusing the concrete containing a good amount of autunite ?\n… and , at the end, we have to calculate the time required to obtain\na decent image …\n\n","date":"July 16, 2014 at 12:50 pm","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","id":"comment-138744","author":"piero","site":"shroudstory"},{"title":"A Telling Interview with Giulio Fanti","post":"I find it difficult to follow Piero’s line of argument here.  The use of electricity was practically unknown in ancient times.  L Sprague de Camp in his “The Ancient Engineers” p.252 suggests that electro-plating of metals may have been known in Iraq and possibly the Orient.  He refers to some mysterious jars found near Khujut Rabu’a near Baghdad in 1936 and also at the ruins of Seleucia-on-the-Tigris, which may have been used for this purpose.  Otherwise occasional demonstrations of static electricity were little more than a toy and entertainment, but their nature certainly not understood. \nPiero also refers to Cordiglia’s attempts to create an image using 90,000 volts of electricity.  The potential difference between cloud and ground in a lightning strike are of the order of 10 to 100 million volts, the peak return currents are of the order of 30,000 amperes, peak temperatures in the return-stroke channel are of the order of 30,000 deg C, leader stroke reaches the ground in about 30 ms, and the return stroke reaches the cloud in about 100 ms.  (Encyc Brit). \nI’m not sure what he means by the radon being a joke, and he asks what was the radon plateau reached to create an image.  I can only refer him to De Liso’s work which seems to be one of the few papers where this has been explored, but she does not seem to cover this question in a quantitative way.   Some investigators have attempted to postulate hypotheses involving radon, but its role of course is not at all known.  \nIt is not known what created the TS image, and I believe that all options are on the table.  Radon may have been involved, not necessarily as a primary cause, but possibly as providing some kind of collimation of the image forming particles whatever they were.  We can speculate, but without the essential experimental investigations being carried out, I believe we remain still working in the dark.  I suspect that the process may be so complex, that the use of Occam’s razor here to isolate a single cause is unlikely to enlighten the true cause of the image.\n\n","date":"July 16, 2014 at 5:08 pm","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","id":"comment-138780","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Telling Interview with Giulio Fanti","post":"You wrote:\n> I suspect that the process may be so complex, that the use of Occam’s razor here to isolate a single cause is unlikely to enlighten the true cause of the image.\nSo… I think the best way to learn something really useful is\nthe careful analysis of linen fibrils using advanced microscopy (AFM, CFM techniques)\nand spectral controls (Raman analyses).\n— —\nRadon and effect on linen.\n>Radium-226 and Radon-222 are both produced during the decay of Uranium.\nRadon is considered the most hazardous, because as a gas we breathe it into our lungs where it can attach until it decays. Luckily, Radon only has a 4-day half-life, which limits the build-up in a basement or from a concrete wall. Unluckily, Radon only has a 4-day half-life, which means it is extremely radioactive.\nBut …\nWhere are the advanced controls on the linen samples treated by De Liso ?\nAt present I see nothing…\n— —\n… … And for the EQLs = Earth Quake Lights,\nplease, read under :\nhttp://en.wikipedia.org/wiki/Earthquake_light\n>The most recent model suggests that the generation of earthquake lights involves the ionization of oxygen to oxygen anions by breaking of peroxy bonds in some types of rocks by the high stress before and during an earthquake.\n>After the ionisation, the ions travel up through the cracks in the rocks.\n>Once they reach the atmosphere these ions can ionise pockets of air,\nforming plasma that emits light … \nHere another link:\nhttp://www.eurekalert.org/pub_releases/2014-01/ssoa-ell122013.php\nReference:\nThériault, R., Freund, F.T. & Derr, J.S. (2014).\nPrevalence of earthquake lights associated with rift environments.\nSeismological Research Letters, volume 85-1,\nJan–Feb issue, 2014\n\n","date":"July 17, 2014 at 7:58 am","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","id":"comment-138902","author":"Piero","site":"shroudstory"},{"title":"A Telling Interview with Giulio Fanti","post":"Thank you Piero for your ref on earthquake lights, a phenomenon I had not taken account of, as it seems to be fairly rare.  I note the Wiki article mentions they were reported for the Amuri EQ in NZ of 1888.  NZ is a seismically active country as we are on the boundaries of a number of tectonic plates.  We usually have a few earthquakes of at least intensity 5.0 each year,  occasionally up to 7.0.  I recall very few reports, if any of the occurrence of earthquake lights at these times.  As the sources say, it is probably a piezo-electric effect resulting from plate movement. \nConcerning De Liso’s work:  I take it you aware of her paper: “Shroud-like image formation during seismic activity”; Giovanna de Liso; ENEA Frascati Conference May 2010.\nhttp://www.acheiropoietos.info/proceedings/DeLisoWeb.pdf\nShe lists some 14 references at the end, mainly in Italian, which may also be of interest.  I feel her paper has I think several unfortunate omissions, and there’s more we’d like to know.  She has not responded to any of my email enquiries which were in English.  I am unaware of any more recent paper she has written.  But I find it striking that she succeeded in producing some very persuasive looking images, from her 500 experiments over a period of 12 years.  \nEncyc Brit article on ball lightning may be of general interest:\n“Ball lightning:  also called  globe lightning a rare aerial phenomenon in the form of a luminous sphere that is generally several centimetres in diameter. It usually occurs near the ground during thunderstorms, in close association with cloud-to-ground  lightning. It may be red, orange, yellow, white, or blue in colour and is often accompanied by a hissing sound and distinct odour. It normally lasts only a few seconds, usually moving about and then vanishing suddenly, either silently or explosively. Ball lightning has been reported to cause damage by burning or melting but is usually harmless. Its causes and its relation to common lightning are not known, but among the suggested explanations are: air or gas behaving abnormally, high-density plasma phenomena, an air vortex containing luminous gases, and microwave radiation trapped within a plasma bubble. Sometimes bead lightning is mistaken for ball lightning. Bead lightning is most apparent when the current in a cloud-to-ground flash persists for an appreciable fraction of a second. In these cases, the luminosity also persists and the channel may have regions of enhanced luminosity that resemble a string of beads.”\n\n","date":"July 17, 2014 at 5:08 pm","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","id":"comment-138986","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Telling Interview with Giulio Fanti","post":"“His paper was published in a peer-reviewed journal, not in a Church newsletter.”\nLouis: Don’t magnify the peer review publication. A lot of stupid things and fakes have been published (and they will do) in peer-review magazines. Frequently, these things hadn’t  been answered because no one has considered valuable to lose his time with them. Some prestigious scientists as Stephen Hawkins never publish in peer-review. I think the peer-review is not a great argument in favour of the truth of an assertion.\nI think the authority of Flury-Lemberg is higher than Fanti, because she is a true textile expert. And in this case her opinion is also more valuable because she has done her study directly on the cloth.\nThese are not definitive arguments, but they tip the balance in favour of Ghiberti und Frau Mechthild.\nMoreover, the vision of things is a subjective issue, no matter the “technical” means  that are used in it. I would put here an opinion of a image processing expert who don’t agree with Fanti’s method. But they are in Spanish.\n\n","date":"July 18, 2014 at 2:58 am","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","id":"comment-139086","author":"David Mo","site":"shroudstory"},{"title":"A Telling Interview with Giulio Fanti","post":"I should post them anyway, David, and if our Spanish is a bit weak, we can into Google Translate to try to make the best of them!\n\n","date":"July 18, 2014 at 4:13 am","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","id":"comment-139101","author":"Hugh Farey","site":"shroudstory"},{"title":"A Telling Interview with Giulio Fanti","post":"David Mo: what I was implying was that when a peer-reviewed paper is published in a reputed journal it is taken more seriously. It only means that the paper merits consideration, not that it states gospel truth.\nMonsignor Ghiberti is not a scientist, he is merely the spokesman for the archdiocese, he just announces what he has heard from other people, presumably scientists. So whoever they are, they could write a paper contesting Professor Fanti’s findings. Better, Turin could keep the microphotographs of this region at his disposal.\nI can manage Spanish easily, the result of working with Spanish-speaking peoples, not studying with Spanish and Basque Jesuits in college as I did!\n\n","date":"July 18, 2014 at 12:51 pm","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","id":"comment-139159","author":"Louis","site":"shroudstory"},{"title":"A Telling Interview with Giulio Fanti","post":"“So whoever they are, they could write a paper contesting Professor Fanti’s findings”.\nThey could but they needn’t do it. In the scientific world silence about a determinate article is also significant. Many scientists don’t like to be implied in debates they consider irrelevant. For example: you can find here an opinion of an expert against the Fanti’s article, but he prefers to remain anonymous: http://blogs.elcorreo.com/magonia/2004/05/08/la-segunda-cara-la-sabana-santa-creer-ver/. (Penultimate paragraph). He probably does so because he thinks the important of his message are the ideas it conveys. I think prof. Fanti has not answered to this kind of objections and this doesn’t mean they are valid.\n\n","date":"July 19, 2014 at 2:36 am","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","id":"comment-139239","author":"David Mo","site":"shroudstory"},{"title":"A Telling Interview with Giulio Fanti","post":"“Monsignor Ghiberti is not a scientist”.\nYes, but he was Delegato del Custode Pontificio della Sindone when the restoration was done. He  knew perfectly the conclusions and was qualified to summarize them. He was an authoritative voice on this matter.\n\n","date":"July 19, 2014 at 2:49 am","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","id":"comment-139241","author":"David Mo","site":"shroudstory"},{"title":"A Telling Interview with Giulio Fanti","post":"If you read the introduction to the interview you will see that Professor Danin also demanded objections in writing. I don’t think it is correct for scientists to hide behind the cassock of a monsignor who is a spokesman.\nThanks for the link.\n\n","date":"July 19, 2014 at 11:38 am","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","id":"comment-139303","author":"Louis","site":"shroudstory"}]
