[{"title":"Why Giulio Fanti Matters","post":"While I appreciate the writer’s sentiment, this feels like a case of ‘leading the witness’.\n\n","date":"April 18, 2013 at 10:24 am","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31164","author":"David Goulet","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"Sometimes, a witness needs leading to get at the truth.\n\n","date":"April 18, 2013 at 10:35 am","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31166","author":"John Klotz","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"But in this case shouldn’t the Witness be leading us to the truth?\n\n","date":"April 18, 2013 at 12:20 pm","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31178","author":"looneytombs","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"Quote : “In fact, the will of the God co-opted by this kind of thinking, is not towards suffering or redemption by suffering. The will of this God is towards resurrection.”\nComment :  I say “amen” to that and I would add this :  The will of God is also towards UNIVERSAL REDEMPTION OF ALL HUMANITY and don’t make any mistake about that :  HE WILL SUCCEED.  Or else, we would not be there to talk about that because he would not have created anything.  If God’s plan versus creation is not Universal salvation of every living creature, then that would mean Jesus message would not be true (i.e. that we’re all brothers and sisters and we have all the same father in Heaven).\nAnd concerning the idea that a burst of energy could explain the image on the Shroud, I just want to suggest anyone (and particularly Julian Sheffield) to read my paper about Ray Rogers point of view versus the image : http://shroudnm.com/docs/2013-01-10-Yannick-Clément-Reflections-on-Ray-Rogers-Shroud-Work.pdf\nAt the end of this reading, if Julian or anyone else still think Fanti’s hypothesis is relevant to the Shroud, fine for him but I’m sure many persons who will read this with an open mind will come to the conclusion that the image on the cloth is most probably related to a dead body and not a “glorious body of light” or something similar.\n\n","date":"April 18, 2013 at 10:50 am","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31169","author":"Yannick Clément","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"One last and important precision :  if the image is really the product of a natural process involving a corpse (as Rogers and many other scientists thought over the years) THAT COULD NEVER BE TAKEN AS A PROOF AGAINST THE REALITY OF JESUS RESURRECTION.  In other words, the image can well be due to the presence of the dead body of Jesus in that cloth for many hours before his body disappeared at the time of the Resurrection (which is, in fact, wrong because Jesus was already resurrected from the moment he died on the cross but this was a SPIRITUAL reality that nodoby was able to see with our eyes of flesh).  In the end, what’s important to understand is that any image formation hypothesis involving a close interraction between a dead body and the surface of the cloth is not in contradiction with the reality of Jesus Resurrection.  Very often, people don’t seem to understand this.\n\n","date":"April 18, 2013 at 11:08 am","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31171","author":"Yannick Clément","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"Sorry.  I need to complete my last comment :  When I say that Jesus was already resurrected from the moment he died on the cross, people could be confused versus the idea that he was resurrected only when his body disappeared from the tomb on Easter morning (or on Saturday).  For me, this disappearence of the body (and the subsequent apparitions) must be understood just like the empty tomb itself and the open entrance of the tomb with the rock that has been rolled, i.e. as SIGNS of the spiritual reality of Jesus Resurrection and the entry of all his humanity in the eternal Kingdom of the Father (which is not a Kingdom of this world but a SPIRITUAL kingdom outside our space-time, but that can still be reached by us through prayer).\n\n","date":"April 18, 2013 at 11:17 am","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31172","author":"Yannick Clément","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"And through any act of pure love also… ;-)\n\n","date":"April 18, 2013 at 11:18 am","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31173","author":"Yannick Clément","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"If it’s possible for Satan to be saved, then I have to wonder what it actually is that anybody needs saving from? I mean, why didn’t God just take everyone straight into Heaven rather than messing about with the earth? BTW, Do you think that Jesus radiated any form of light when he was resurrected?\n\n","date":"April 18, 2013 at 3:37 pm","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31200","author":"ChrisB","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"Chris, we don’t have to do anything to enter the Kingdom of God !  It is a purely free gift of our Father in Heaven and Jesus’ Passion is the most awesome sign of this.  It’s not because of our good or bad deeds that we will enter into God’s Kingdom one day.  It’s not even because of our faith or of our lack of faith.  It is simply because God consider each one of us as his beloved child.  That’s it. There’s no other reason that this one and Jesus mission was to reveal this truth to us.  Most of the Jews in Jesus time (as well as most of today’s Christians I’m affraid) believed that, to be save, we had to follow the law perfectly !  THIS IS IMPOSSIBLE !!!  Why ?  Simply because we’re all sinners…  So, in that context, salvation can ONLY BE A FREE GIFT OF GOD.\nAnd concerning your question of why do we have to spend times here on Earth before entering into God’s Kingdom, this is a real mystery my friend.  So far, I have found only one “good” answer about that:  To really and fully appreciate the great joy and confort of a good fireplace, we must experiment cold.  And if we made the experience of spending one full day outside when the temperature is very very cold, then we will appreciate even more the good heat of the fireplace!!!  In other words, it’s only by experimenting the suffering, the toughness, the treasons, the deceptions, etc. of life on Earth (everything that is contrary to God in sum) that we will fully enjoy at the max our eternal life in Heaven with the Father.  \nAnd for Satan, who knows if he’s not really helping God (consciously or not) in this plan to make us experiment everything that is not God in order for us to appreciate even more our entry into God’s kingdom!  Note that in the book of Job, Satan is depicted as someone who is an official member of the court of God…  Who knows???\n\n","date":"April 18, 2013 at 3:59 pm","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31204","author":"Yannick Clément","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"About Satan and his angels. Will they also be saved eventually?\n\n","date":"April 18, 2013 at 11:56 am","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31175","author":"ChrisB","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"Who knows?  The mercy of our God is unlimited.\nHave you noticed from where Jesus saw Satan fall when his disciple told him that they were able to cast out demons in his name?  From Heaven !\nAs Father Roger Poudrier tell us in his book about the Mercy of God:  When we’ll get to Heaven someday, we will have big surprises !   I don’t say that Satan will be saved at the end of times.  I just say that it is premature to say no because of the greatness of the mercy of God.\n\n","date":"April 18, 2013 at 1:04 pm","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31185","author":"Yannick Clément","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"One thing’s for sure :  If we really pretend to be Christian, we should never despair of the eternal salvation of anybody, not even Satan (or Hitler or Judas or Ben Laden or anyone else), because we should know that the Mercy and Love of our Father is totally unlimited.\nOne thing I know in my heart : Hoping for the eternal Salvation of everybody is truly Christian.  Don’t forget that the word “Catholic” means “Universal” ! :-)\n\n","date":"April 18, 2013 at 1:16 pm","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31186","author":"Yannick Clément","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"Yannick, can you, PLEASE, spare us your homilies?\nThank you.\n\n","date":"April 18, 2013 at 4:38 pm","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31210","author":"jesterof","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"Sorry, when someone open the door on that subject, I enter the room ! ;-)\nIf someone don’t talk about faith, I won’t push the door, but if I see an opening, you won’t be able to shut my mouth, sorry.\nIf you can’t stand what I say, just don’t read me.\n\n","date":"April 19, 2013 at 8:28 am","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31288","author":"Yannick Clément","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"Here it is! Fanti’s peer-reviewed paper in Vibrational Spectroscopy\nThe possibility to define a two-way relationship between age and a spectral property of ancient flax textiles has been investigated in the present paper employing both FT-IR and Raman analyses on selected samples dated from about 3250 B.C. to 2000 A.D.\nAfter a first selection to eliminate polluted samples, based on visual inspection, on proper mechanical tests and on a first glance at the resulting spectra, eleven samples of the original 14 have been used for Raman analysis and eight for FT-IR analysis.\nFor the first time, the possibility to define a correlation among spectral properties and age of flax samples, by using calibration curves, has been proved.\nIn agreement with the kinetics theoretical model, the experimental relationships are of an exponential type, giving correlation coefficients higher than 0.9. The better results were obtained using FT-IR because Raman analysis needs to consider an additional variable due to the non negligible influence of fluorescence.\nPresently, the method allows to assign an uncertainty of centuries to the measured data, but future calibrations based on a greater number of samples (though it is not easy to find ancient samples adequate for the test) and coupled with ad-hoc cleaning procedures could significantly improve its accuracy.\nhttp://www.sciencedirect.com/science/article/pii/S0924203113000490\nTristan Casabianca.\n\n","date":"April 19, 2013 at 5:56 am","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31273","author":"Cazab","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"\nYannick Clément :\nSorry, when someone open the door on that subject, I enter the room ! ;-)\nIf someone don’t talk about faith, I won’t push the door, but if I see an opening, you won’t be able to shut my mouth, sorry.\nIf you can’t stand what I say, just don’t read me.\n\nThis is not a realigious site and even if I do not read you( which i do not in these matteres), I still have to scroll down through your preaching.\nit is not appropriate and if nobody responds it is usually not because everybody agrees with you… just a hint ;)\n\n","date":"April 19, 2013 at 12:21 pm","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31309","author":"jesterof","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"If your goal here is that everybody agree with everything you wrote, I can tell you that you’ll be very disappointed !  He he !\nAnd concerning the idea that this is not a religious site, I disagree.  Many topics are definately religious and are focussing on spirituality and faith.  Read the first comment I made on top of the page…  I made a comment versus a true religious statement written in the main text that saying “In fact, the will of the God co-opted by this kind of thinking, is not towards suffering or redemption by suffering. The will of this God is towards resurrection.”\nI only wrote a comment about that.  It wasn’t me who started the religious talk here.\nI don’t understand people who told others what to say or what they don’t want to ear.  We live in a FREE WORLD my friend.  Everyone cannot think just like you and we’re all free to comment on subjects that we like.  Censorship should be called “censorshit”…\n\n","date":"April 19, 2013 at 3:44 pm","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31322","author":"Yannick Clément","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"I would have to respectively disagree with he following statement:\n“…recasts the Shroud as a testament to Christ’s Resurrection, and not, as currently revered, a relic of Christ’s passion and death.”\nI see the Shroud as revealing both the passion and resurrection.  It doesn’t have to be either/or.\n\n","date":"April 19, 2013 at 6:18 pm","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31335","author":"Andy Weiss","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"As well as the Incarnation of God my friend Andy!!!!  For me, the Shroud is mainly a record of Christ HUMANITY.  The Resurrection can only be seen on that cloth through faith.\n\n","date":"April 20, 2013 at 6:21 pm","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31434","author":"Yannick Clément","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"If I might return to the original article, I’m afraid it suffers from something the New Scientist (UK) magazine calls “quantum fruitloopery,” which is the tendency non-scientists have to hope that the weird predictions of quantum physics (mostly the implications of duality) may be hauled in to explain any previously unexplained phenomena. It usually follows the line: “since quantum mechanics says that things can be in two places at the same time, therefore any observation of simultaneous appearance can be (or will eventually be) explained by quantum mechanics.” This is simply not true. \nThis statement: “The risen body of Jesus conforms to the physical laws of something traveling beyond the speed of light. It can be at multiple places simultaneously, can pass through slow matter, can appear as it wills when it wills,” quite literally makes no sense.\n\n","date":"April 20, 2013 at 5:17 am","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31372","author":"Hugh Farey","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"AMEN!\n\n","date":"April 20, 2013 at 6:24 pm","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31436","author":"Yannick Clément","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"The Gospels themselves tell us what the post-Resurrection events demonstrate without going into science. What it is possible to say today, in the 21st century, is that Jesus was beyond space and time after the Resurrection. He would “step on the accelerator” and enter our “frequency” and leave our “frequency” by “taking his foot off the accelerator.”\n\n","date":"April 20, 2013 at 7:39 pm","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31440","author":"Louis","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"As God who created our material universe, I have no difficulty to believe that Jesus could enter and leave our world whenever he wanted after his human death on the cross.  And I have no difficulty too to believe he could take whatever human form he wanted after his human death on the cross, which was truly not the same as the one he had before his death (the Gospels are pretty clear about that).  \nBecause I believe Jesus is the Creator of our universe (along with the Father and the Holy Spirit) and I believe in his Incarnation, I don’t see any reason why he could not do so!\n\n","date":"April 20, 2013 at 7:52 pm","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31441","author":"Yannick Clément","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"The Gospels also tell us that Jesus could assume different forms while he was in our “frequency”, after the Resurrection, and Caravaggio depicted this in his extremely beautiful “Supper at Emmaus” paintings.\n\n","date":"April 20, 2013 at 8:10 pm","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31444","author":"Louis","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"And do you know one of the most profound meaning of Jesus acting like this after his Resurrection?  Because he wanted to make us understand that in every brother and sister we encounter in our life (i.e. every human being), it is Jesus himself which we encounter!!!  By the way, this is the most profound meaning of the parable of Matthew 25 about the sheep and the goats…  And, in truth, this is the heart of the Christian faith :  we all have the same Father who is in Heaven and we’re all brothers and sisters.  That’s why Jesus told us that there is only 2 commandments in reality : Love God and love one another!  Once a Christian truly believe this, I think he has understood the most important aspect of Jesus teaching.  And after this, the challenge is to try to live it, which is not easy because we’re all sinners.  But God doesn’t ask us to do more than to try to live it the best we can with his Grace…\nIn sum, God is spiritualy present in everyone of his children and the fact that the Resurrected Jesus took different human forms during his apparitions was intended to make us understand this mysterious reality called “the mystical body of Christ” by St Paul… Another important reason why he acted like this is because he also wanted to respect the liberty of his disciples to believe in him or not and didn’t wanted to force their faith because God is Love and never force anyone to believe in him or not).  Note that, almost everytime, they only recognize him after seeing a SIGN (the breaking of the bread, the tonality of the voice who said “Mary”, the miraculous fishing, the holes in his hands and side, etc.).  This reality also contain one important teaching for us :  It’s not through scientific facts that we can recognize God in our human life but through SIGNS seen with the eyes of FAITH…  I think Fanti (and a bunch of other researchers in the Shroud world) never understood this important reality concerning God.\n\n","date":"April 20, 2013 at 8:35 pm","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31447","author":"Yannick Clément","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"It would be incorrect to indulge in generalisations and any Christian, Shroud researcher, enthusiast and so on would, needless to say, be making a mistake in basing faith on the TS. The NT also mentions signs, which do not require faith as a pre-condition, and this is the gift called “discernment”. Faith can be reinforced by this discernment.\n\n","date":"April 20, 2013 at 9:05 pm","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31448","author":"Louis","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"“Faith can be reinforced by this discernment.”\nI agree with you, but, in the eyes of Jesus, faith is more important than anything else.  In the Gospels, have you noticed how much Jesus was in awe every time he was seeing true and pure faith (not based on any proofs) in someone?  That speaks loud to me…  I think a very important aspect of our life on Earth is to learn confidence (in God as well as in our brothers and sisters).  In other words :  learn to love (because there’s no true love without confidence).\n\n","date":"April 21, 2013 at 6:18 pm","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31494","author":"Yannick Clément","site":"shroudstory"},{"title":"Why Giulio Fanti Matters","post":"OK, no cause for disagreement, but as commented previously the discernment can reinforce faith which as you said is more important.\n\n","date":"April 22, 2013 at 8:23 pm","url":"https://shroudstory.com/2013/04/18/why-giulio-fanti-matters/","cat":"news_&_views","id":"comment-31540","author":"Louis","site":"shroudstory"}]
