[{"title":"Yet more ‘Fanti-sy’ from Fanti, Faccini et al, this time on the spear so-called “wound”…","post":"OK, let’s agree to differ in our approach to the Shroud, shall we? I’d offer to shake hands, but would not want to give you frost bite…\n","date":"October 13, 2012 at 7:03 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/07/yet-more-fanti-sy-from-fanti-faccini-et-al-this-time-on-the-spear-so-called-wound/","cat":"crucifixion","id":"comment-940","author":"colinsberry","site":"colinberry"},{"title":"Yet more ‘Fanti-sy’ from Fanti, Faccini et al, this time on the spear so-called “wound”…","post":"Oh dear. I’m afraid I’m not a very good scientist at all…..\nI suppose it’s because if I have a position and want to try to get others to agree, I like to try to understand their point of view first, and then undermine it. That way, they are more likely to come round to my point of view. The cold icy detachment of the ideal scientist, perhaps such as yourself, is not, I think, very common in any field, least of all one that impinges on deep seated religious convictions. Nevertheless, I wish you luck… (there, failed again…)\n","date":"October 13, 2012 at 6:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/07/yet-more-fanti-sy-from-fanti-faccini-et-al-this-time-on-the-spear-so-called-wound/","cat":"crucifixion","id":"comment-939","author":"Hugh Farey","site":"colinberry"},{"title":"Yet more ‘Fanti-sy’ from Fanti, Faccini et al, this time on the spear so-called “wound”…","post":"You are looking for reasons for disproving it’s a wound. I’m looking for reasons for thinking it might be a wound. Your position involves multiple assumptions (or at any rate working hypotheses) namely that the linen had been in contact with a wounded man haemorrhaging blood, that an unknown imaging process had succeeding in detecting a difference between intact and injured skin and flesh, despite the (masking?) presence of blood or blood clots. \nMy position requires no initial assumptions. Indeed it is looking for the kind of evidence that might underpin YOUR initial assumptions, while being willing to entertain other explanations that do not posit that the Shroud ever enveloped a real person.\nYour position is one of empathy without final icy detachment. My position does not preclude empathy or any other kind of mindset that assists in understanding someone else’s views, but it INSISTS on adopting a final icy detachment. That at any rate is the ideal, if a counsel of perfection. I would assert that it is that same ideal  – of finally divesting oneself of subjective thoughts and feelings – of FINALLY viewing with a cold detached eye – that is the essence of the scientific method.  Not everyone is able to make that final retreat from subjectivity to objectivity. Not everyone is cut out to be a scientist. Some scientists manage  the crucial mental manoeuvre on some days and not others. Some manage with certain topics and not others. Some imagine themselves to be as objective in researching a religious icon/artefact as any other –  when it is painfully obvious to others that is not the case…\n","date":"October 13, 2012 at 1:55 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/07/yet-more-fanti-sy-from-fanti-faccini-et-al-this-time-on-the-spear-so-called-wound/","cat":"crucifixion","id":"comment-938","author":"colinsberry","site":"colinberry"},{"title":"Yet more ‘Fanti-sy’ from Fanti, Faccini et al, this time on the spear so-called “wound”…","post":"Thank you. I liked what you say about the difference of approaches. I tend to read an account, preferably one I disagree with, and ask myself why somebody might come to that conclusion, however flawed. Probably something to do with teaching children, who come up with some wacky ideas, but often based on some kind of weird logic. So I don’t begin with a tabula rasa, but ask myself, why does so-and-so think it’s blood rather than jam, and look for the flaws in the reason. If somebody says “that looks like a spear-hole,” then (apart from the fact that to me it looks more like a cigar) I can see why he thinks so. I then ask, would there be more to the image of a wound than just its shape. If so, and there is no sign of it on the shroud, then it’s not a spear hole, whatever it looks like, but if a real wound-mark would have the same composition as all the other smears around it, then we have not disproved that it is a wound on those grounds alone. Of course, if the blood turns out really to be jam, then the wound is disproved on other grounds.\n","date":"October 13, 2012 at 1:20 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/07/yet-more-fanti-sy-from-fanti-faccini-et-al-this-time-on-the-spear-so-called-wound/","cat":"crucifixion","id":"comment-937","author":"Hugh Farey","site":"colinberry"},{"title":"Yet more ‘Fanti-sy’ from Fanti, Faccini et al, this time on the spear so-called “wound”…","post":"My approach is probably different from yours, Hugh. I try to look at these images as if seeing them with no prior knowledge of what I am supposed to see (according to others whose observation and interpretation I regard as no better or worse than my own). When I look at the area in question, I do not immediately say “Ah, there’s something there that is not just blood, but a wound from which blood flowed”. In fact, while I see the sharper outline on that upper part you refer to, I still don’t see it as “spear-shaped” notwithstanding elliptical curves and right angular corners. And while with the eye of faith I might see your “twisted rivulet shapes” would one not see a higher density of pigment lower down if there had been flow under gravity?\nThe drawback in the approach you and others take in focusing on particular areas in search or one or other feature that matches the biblical account is that you do not apply the same level of scrutiny to the rest of the Shroud. So whose to say that your elliptical curves and right-angular corners are not to be found elsewhere, like the feet etc where the putative wound is from a nail rather than a spear? (Nope, I haven’t checked and am unlikely to do so).\nWhat you have to bear in mind is that I was not saying there is definitely no spear wound. I was taking issue with Giulio Fanti for circling an area in yellow, stating categorically that was the site of a wound. That is not objective science, as he could show by giving that same image to people in the street, and asking them to circle the site of a wound.\nSorry, but my position is that if ain’t objective science, then it’s not science at all, and if proselytised as if it were science, by Associate Professors of Mechanical Engineering etc. then this retired science bod feels compelled  to label it “pseudo-science”. I’m prepared if necessary to canvass the Royal Society on this and the other liberties that are being taken, such is the strength of my feeling on the matter. It was Paolo Di Lazzaro’s pseudo–science with his excimer lasers and uv beams in the UK national press, just before Christmas,which first alerted me to what has been happening in the (up till now) largely secret garden that is Shroudology. I was appalled – truly appalled – and said so (initially) on my sciencebuzz site.\n","date":"October 13, 2012 at 11:56 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/07/yet-more-fanti-sy-from-fanti-faccini-et-al-this-time-on-the-spear-so-called-wound/","cat":"crucifixion","id":"comment-936","author":"colinsberry","site":"colinberry"},{"title":"Yet more ‘Fanti-sy’ from Fanti, Faccini et al, this time on the spear so-called “wound”…","post":"Do you pick up comments on older posts? I do hope so. I’m finding it difficult to read your blog in detail from start to finish as I keep getting distracted and having to look things up elsewhere!\nThe marking on the shroud referred to above has an upper-left edge which is different from the other edges, if so they may be termed. The upper-left edge has a distinct slightly elliptical curve, each end of which terminates in an abrupt, almost right angular corner. The edge is quite distinct (although it has a lighter-coloured fringe), and the area below it is darker than the rest of the alleged stain, in an approximate cigar-shape which some have likened to the cross-section of a spear. The left hand edge is also very distinct, but does not have a regular shape, and the rest of the stain has patches of light and dark which could be interpreted as twisted-rivulet shaped, even if they aren’t actually anything of the kind.\nI’m not sure about your identification though. If I’m right, you are not denying the existence of the distinct (possibly spear-shaped) section, but you are saying that it is not qualitatively different from the rest of the stain. What I’m wondering is what sort of difference might be expected if it WAS a wound. Would laying a sheet over a stabbed body be able to differentiate between the source of some gore and the oozings derived from it? When you say “There is no spear wound,” are you suggesting that there was not even an intention to represent a spear wound, or simply that the whole marking is made of the same materials. Does that observation OF ITSELF prove that no wound existed?\n","date":"October 13, 2012 at 11:15 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/07/yet-more-fanti-sy-from-fanti-faccini-et-al-this-time-on-the-spear-so-called-wound/","cat":"crucifixion","id":"comment-935","author":"Hugh Farey","site":"colinberry"}]
