[{"title":"Alan Boyles Cosmic Log on Fanti’s New Book","post":"As a matter of fact, Fanti & Gaeta point the way  for checking the validity of the C14 test. The problem with the 1988 test is that the results are not homogeneous, and that this lack of homogeneity has been hidden from view by the authors of the 1989 paper. However, Fanti (p.76-77 in the book) points out again the well known fact that  the second, smaller part of the sample given to the Tucson lab has never been used for C14 dating. Importantly, according to the authors,the fact that it was this smaller part that was left untouched, was first concluded from their statistical analysis of the 1988 observations; this conclusion was then confirmed by prof. Timothy Jull from the Tucson lab (the key sentence is on p.76 of the book:”Dopo questi risultati il professore Timothy Jull, direttore del laboratorio di Tucson, in una comunicazione personale al professor Fanti ha ammesso che la parte di telo T2 non fu mai datata dal laboratorio dell’univeristà dell’Arizona, confermando così indirettamente l’elevato grado di attendibilità dei resultati ottenuti tramite la statistica robusta”).\nIf indeed the results are not homogenous, but are showing a linear trend, then a clear prediction can be made concerning this sample that is still in Arizona. If the linear trend is real, then this sample should produce an age that exceeds the previous Arizona measurements in a significant way. This untested sample can be predicted to show an age superior to the values previously measured in Oxford, Zurich and, above all, in Tucson.\nSo instead of arguing and speculating, why not just proceed to a further measurement? After all, the sample is there, and it has been given to the Tucson lab in order to date the Shroud.\n\n","date":"April 1, 2013 at 9:39 am","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","id":"comment-29003","author":"Jos Verhulst","site":"shroudstory"},{"title":"Alan Boyles Cosmic Log on Fanti’s New Book","post":"I’ve had to delay my comments on Prof Fanti’s work because of other preoccupations. My 78 year old son-in-law died recently and we’ve had to deal with funeral arrangements and so on. As John Klotz mentioned to me in an email: “If there is ever an appropriate time to deal with the pssing of a loved one, perhaps Holy Week is the week to do it.”  \nThere are fundamentally three aspects that merit comment: 1) Publishing the book before the science had been peer-reviewed; 2) the reaction of the Turin authorities disclaiming the samples; 3) the science that Fanti used to obtain his conclusions. \n1) There has already been comment on this back-to-front way of doing things.  However it is apparently notoriously difficult to obtain peer-review in reputable journals to obtain an objective reaction on scientific work conerning the TS, although apparently the work has indeed been submitted. Perhaps Fanti considered his “discovery” was too important to languish while agenda-driven reviewers debated his paper. I would doubt that that his motive was profit-driven book sales – I would guess that the remuneration of a dean of a mechanical engineering institution would be more than adequate for one’s needs.  The obvious diasvantage is that it leaves open accusations of seeking sensationlism.  It is unfortunate that only Italian versions are available, as there is a larger catchment of interest.    \n2) The reaction of the Turin authorities in disowning the samples used seems to be gross over-kill, in fact an own-goal.  If Turin had misgivings about the samples, a more cautious reaction would seem to have been more prudent.  It may be that Fanti has provided a strong argument for authenticity, but Turin has now shot itself in the foot by disowning this work. In the land of the Florentine Niccolo Machiavelli, one might have expected more political nous, and less silly posturing.  \n3) There has been little in any English press releases about any details of the work beyond the claims made and the general methodologies, but no specifics.  One is left making all sorts of speculative inferences, and possible objections come readily to mind. One expects that there is no fundamental theoretical basis for the inductions made, but that it is entirely empirical, essentially a type of statistical regression analysis.  The underlying assumption seems to be that the various properties tested will be solely age-related with little influence from other variables.  For example (a) various species of flax – there are many such – Is it known how their properties vary across species? Can the flax species for the various samples be identified? Properties can be expected to vary according to the various processing methods to extract the linen, variable chemical effects, dyeing, retting processes, effects of heat? What about the correlation ratios, and tests of significance? Until a lot more information is available, we are left in a vacuum of ignorance at drawing any kind of valid conclusion!\n\n","date":"April 1, 2013 at 4:23 pm","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","id":"comment-29021","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Alan Boyles Cosmic Log on Fanti’s New Book","post":"Quote: “Perhaps Fanti considered his “discovery” was too important to languish while agenda-driven reviewers debated his paper.”\nQuestion to Daveb:  And what if the reality is not precisely the opposite : i.e. that it is our friend Fanti who is agenda driven and that’s why his work has not been publish yet in any CREDIBLE peer-reviewed journal?  I think this possibility is as good as the one you proposed.  But I have to admit that it is possible that some journals can be relunctant to publish anything about the Shroud because it is truly a controversial subject.  But I just can’t imagine this is true for all credible scientific journals out there…  \nLook, in recent years in Italy, 2 scientists named Fazio and Mandaglio have published at least 3 papers about the Shroud in the scientific journal “Radiation Effects and Defects in Solids”, which seems to be a credible journal, so it is surely possible for someone with integrity to have his paper published in a credible journal before even beginning the writing of a commercial book!\nQuote: “Perhaps Fanti considered his “discovery” was too important to languish while agenda-driven reviewers debated his paper. I would doubt that that his motive was profit-driven book sales – I would guess that the remuneration of a dean of a mechanical engineering institution would be more than adequate for one’s needs.”\nComment:  This comment of yours Daveb is very naive… That’s all I have to say about that.  Most people involved in the Shroud world are truly there to seek some glory, prestige and also money!  It’s so evident for me that I don’t understand how you cannot see this.\n\n","date":"April 1, 2013 at 5:54 pm","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","id":"comment-29023","author":"Yannick Clément","site":"shroudstory"},{"title":"Alan Boyles Cosmic Log on Fanti’s New Book","post":"There can be no doubt that the intentions were right, however given the fact that peer-review did not precede book publication and the problem raised by the archbishop’s comments, it is likely that the public at large will be left confused and get a bad impression about what is going on in the realm of Shroud research.\n\n","date":"April 1, 2013 at 6:35 pm","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","id":"comment-29024","author":"Louis","site":"shroudstory"},{"title":"Alan Boyles Cosmic Log on Fanti’s New Book","post":"Fanti’s claims will most probably remains as being anecdotal in the same way than Frei-Sulzer’s claims regarding the pollens are now considered to be anecdotal.  The only thing that can make Shroud science go in the right direction would be a new series of direct researches on the cloth done by a credible AND UNBIASED team of scientists with every member being a true expert in the field he work in.\n\n","date":"April 1, 2013 at 6:46 pm","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","id":"comment-29025","author":"Yannick Clément","site":"shroudstory"},{"title":"Alan Boyles Cosmic Log on Fanti’s New Book","post":"Note:  When I use the word “anecdotal”, I mean that it is a claim that remains far from being proven yet and that has no credible way to be properly counter-verify until a new series of direct researches on the cloth can be allowed.\n\n","date":"April 1, 2013 at 6:48 pm","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","id":"comment-29026","author":"Yannick Clément","site":"shroudstory"},{"title":"Alan Boyles Cosmic Log on Fanti’s New Book","post":"Professor Avinoam Danin firmly defended Uri Baruch’s competence in handling the pollen and it is not possible to see bias in their work.\n\n","date":"April 1, 2013 at 6:59 pm","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","id":"comment-29027","author":"Louis","site":"shroudstory"},{"title":"Alan Boyles Cosmic Log on Fanti’s New Book","post":"Nevertheless, the pollen evidence regarding the Shroud has been so much put into doubt over the years that it will take another round of direct tests on the cloth (more properly done that time than what was done in 1973 and 1978 by Frei-Sulzer) in order to settle this controversial issue (which is only one among many controversial issues regarding the Shroud).\n\n","date":"April 1, 2013 at 7:33 pm","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","id":"comment-29033","author":"Yannick Clément","site":"shroudstory"},{"title":"Alan Boyles Cosmic Log on Fanti’s New Book","post":"Three brief thoughts after Easter:\n1. As obvious as this: if we want  Shroud studies to go scientific, researchers must start by adopting the protocols appliable in the rest of branches in science. This includes peer-review and verifiable chain of custody and sorry to say, Fanti has not acted so. Let’s forget about excuses and conspirations.\n2.The only positive thing is that after the bias introduced in the 80’s regarding the C14 as the only valid test, the press release on the book by Fanti has made some people reconsider other options like studies on provenance and the general request “for a new C14 test” seems to have weaken a little bit. Good news after all.\n3.Once again, the Catholic Church -in this case the Archbishop- is one of the few to put some common sense in all this. To me, this completely unexpected press release, most probably indicates that the Archbishop has got its own agenda on Shroud studies and will move forward with His own means, resources and scientists.\n\n","date":"April 1, 2013 at 7:20 pm","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","id":"comment-29031","author":"Gabriel","site":"shroudstory"},{"title":"Alan Boyles Cosmic Log on Fanti’s New Book","post":"Good overall comment but I don’t understand why you have so much doubt concerning the validity of a new C14 dating test that would be done more properly by using at least 3 different samples from 3 differents sites on the main body of the cloth, along with the use of a better technique of cleaning, and along also with a more precise analysis of the samples in order to detect and remove any intrusive material to prevent any important shift of result.\n\n","date":"April 1, 2013 at 7:37 pm","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","id":"comment-29034","author":"Yannick Clément","site":"shroudstory"},{"title":"Alan Boyles Cosmic Log on Fanti’s New Book","post":"Yannick, I have widely commented on this blog about this, but in my view, the solid fact is that C14 is not an appropiate tool for an object like the Shroud. Perhaps, in the 80’s radiocarbon dating sounded more promising but more and more scientific papers -I don’t want to repeat myself but in the last year I have commented a couple of them- in many fields are narrowing the field fof C14 to very, very specific applications. For this reason, I am in favour of leaving behind C14 tests and moving to other fields of research in the future. As I see it, provenance (trace elements, isotopes…) and digital analysis of images are two very promising directions.\n\n","date":"April 1, 2013 at 8:04 pm","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","id":"comment-29037","author":"Gabriel","site":"shroudstory"},{"title":"Alan Boyles Cosmic Log on Fanti’s New Book","post":"The only problem with your opinion Gabriel is the fact (I’m almost sure about that) that, presently, there is no other method of dating ancient fabric that has been proven to be more accurate and sure than C14 dating.\nOf course, we can think that in the future a sensational new method will come in and will be more accurate than C14 for this kind of dating of old fabrics, but while we are waiting for this new method to make his proof, I don’t think any credible scientist would leave C14 behind and only concentrate on alternative methods that are still waiting to receive the tag “proven to be very accurate and sure” for this kind of task (like Fanti did nevertheless)…\nSo, in my mind, if the Vatican allow a new series of direct researches on the Shroud in a near future, the scientific team that will do the job must do another C14 dating, but with a much better protocol than what was applied in 88.  Along with this new C14 dating, I would not disagree to try some alternative methods but only if these methods have receive the approval of some credible experts in the field of dating ancient fabrics that would have previously verify the level of validity and accuracy of such methods.  Presently, I don’t think we are there yet with any alternative method.\n\n","date":"April 2, 2013 at 10:46 am","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","id":"comment-29139","author":"Yannick Clément","site":"shroudstory"},{"title":"Alan Boyles Cosmic Log on Fanti’s New Book","post":"Yannick, if we still think in terms of dating the cloth as the only way to analize the Shroud probably we are moving to a dead end, because, as you say, C14 is the only technique available. However, its shortcomings and limitations for a cloth like this are obvious so C14 is not appropiate and we easily reach a dead end.\nC14 is not appropiate. That’s all. We should/can overcome it. Nothing happens.\nIn my view, the path already suggested in the 80’s by some STURP members like Druzik (analysis of provenance) along with serious image analysis, represents a wider, more open and promising concept of “Shroud analysis” beyond the very narrow view we have seen until now based on “cloth dating using C14 tests”.\n\n","date":"April 2, 2013 at 11:26 am","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","id":"comment-29140","author":"Gabriel","site":"shroudstory"},{"title":"Alan Boyles Cosmic Log on Fanti’s New Book","post":"I’m not aware of this research proposal of Druzik!  Can you tell me please in which STURP paper (or in which other paper) I can read it in full detail?  Thanks!\nNever mind what he might thought back then, the kind of proposal of Druzik (analysis of the provenance of the cloth if I understand correctly), even though necessary in my opinion, would not answer the most important question regarding the question of the authenticity, which is :  what is the most probable age of this cloth?\nAnd right now, I seriously doubt that there can be a more accurate method of dating ancient fabrics.  Rogers’ own alternative method concerning the lack of vanillin can only be taken as a good clue to believe that the cloth is much older than the result given in 1989 for the C14 dating but it can’t go much further than this in my mind.  Same thing for Fanti’s alternative methods.\nThat’s why I keep thinking a new and more carefully done C14 test is truly necessary and should definately be included in a wider research protocol of direct testing of the cloth.  And, truly, I’m not sure your opinion that the C14 method is no good at all to date accurately ancient fabrics is share by a lot of experts in the field of ancient dating (including archaeologist).  Even William Meacham, the archaeologist who was one of the most critical person regarding the C14 dating of 88 and the 2002 restoration, was still calling for a new C14 dating (done better this time) in his book about the Shroud published ca. 2005…\n\n","date":"April 2, 2013 at 3:45 pm","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","id":"comment-29151","author":"Yannick Clément","site":"shroudstory"},{"title":"Alan Boyles Cosmic Log on Fanti’s New Book","post":"Yannick, the paper was published in a peer-review journal in 1988 but at that time was largely dismissed and since then has almost gone unnoticed\nMichael de Niro, Leonel Stenberg, Bruno Marino and James Druzik. 1988. Relation between D/H ratios and 18O/16O ratios in cellulose from linen and maize. Implications for paleoclimatology and for sindonology. Geochimia et Cosmochimia Acta, vol. 52, pp. 2189-2196\nI have commented this paper a couple of times on this blog because I really think it is relevant.\n\n","date":"April 2, 2013 at 5:21 pm","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","id":"comment-29166","author":"Gabriel","site":"shroudstory"},{"title":"Alan Boyles Cosmic Log on Fanti’s New Book","post":"De Niro et al’s 1988 paper is very interesting, but I don’t think the operations they describe could be used as accurate dating techniques (and they do not claim that they can). They do relate the composition of biological material to the atmospheric conditions during its formation, but unless one knew what the atmospheric conditions were, quite precisely, at a particular times and place, it would be difficult to place a piece of material there. Nevertheless, their ideas could certainly add circumstantial evidence one way or another.\n\n","date":"April 3, 2013 at 5:36 am","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","id":"comment-29197","author":"Hugh Farey","site":"shroudstory"},{"title":"Alan Boyles Cosmic Log on Fanti’s New Book","post":"Hugh, I think that you should try to read the whole paper because your concern on climate data is not really relevant. I mean, it was not a big problem when the paper was written and now it is even smaller.\nAmong other techniques, air captured in ice cores bubbles, provide a very clear picture of historical composition of the atmosphere. These data are freely available for the scientific community. For example, NOAA has a website (1) on these data but the Russians have also historical reconstructions from their Vostok ice cores. Please note that one of the isotopes mentioned in the paper 18O is one of the few about which more paleoclimate data we have.\nA very additional interesting point with this paper is that significant scientific progress has been made in the determination of linens geographical origin (2, just one example)\nQuite the contrary from C14, where a big deal of the scientific literature published in the last years aims at correcting original datations or improving the technique in a process which is far from being over.\n(1) http://www.ncdc.noaa.gov/paleo/recons.html\n(2)Takako Inoue, Kengo Ishihara and Kyoden Yasumoto.International Journal of Clothing Science and Technology Vol. 22 No. 2/3, 2010 pp. 174-186\n\n","date":"April 3, 2013 at 6:34 am","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","id":"comment-29200","author":"Gabriel","site":"shroudstory"},{"title":"Alan Boyles Cosmic Log on Fanti’s New Book","post":"Gabriel, is it possible for me to download a PDF version of Druzik paper online for free somewhere?  I would like to read this paper.\n\n","date":"April 3, 2013 at 10:44 am","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","id":"comment-29216","author":"Yannick Clément","site":"shroudstory"},{"title":"Alan Boyles Cosmic Log on Fanti’s New Book","post":"I can’t find a free download, and I’m not sure the full article wouldn’t be too technical for me anyway.  For those who haven’t found it, here is the abstract.\nThe 18O/16O ratios of cellulose and the D/H ratios of cellulose nitrate were determined for linen, a textile produced from the fibers of the flax plant Linum usitatissimum, and for maize (Zea mays) from a variety of geographic locations in Europe, the Middle East, and North and South America. The regression lines of δD values on δ18O values had slopes of 5.4 and 5.8 for the two species. Statistical analysis of results reported in the only other study in which samples of a single species (the silver fir Abies pindrow) that grew under a variety of climatic conditions were analyzed yielded slopes of ~6 when δD values of cellulose nitrate were regressed on δ18O values of cellulose. The occurrence of this previously unrecognized relationship in three species suggests it may obtain in other plants as well. Determining the basis for this relationship, which is not possible given current understanding of fractionation of the isotopes of oxygen and hydrogen by plants, should lead to increased understanding of how D/H and 18O/16O ratios in cellulose isolated from fossil plants are related to paleoclimates. The separation of most linen samples from Europe from those originating in the Middle East when δD values are plotted against δ18O values suggests it may be possible to use the isotope ratios of cellulose prepared from the Shroud of Turin to resolve the controversy concerning its geographic origin.\n\n","date":"April 3, 2013 at 12:19 pm","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","id":"comment-29228","author":"Hugh Farey","site":"shroudstory"},{"title":"Alan Boyles Cosmic Log on Fanti’s New Book","post":"Reputable scieentific journals don’t like to publish scientific work that has already been published in books or elsewhere. It used to be that shroud science was published in good journals with solid JCR ratings. Lately, much has been published in dubious journals like JIST or open access vanity journals like those from Academic Journals, which charge authors.\n\n","date":"April 2, 2013 at 6:30 am","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","id":"comment-29107","author":"Paulette","site":"shroudstory"},{"title":"Alan Boyles Cosmic Log on Fanti’s New Book","post":"This is all one step removed from TV ads that proclaim “scientists have discovered” this or that that will make you thin or grow some hair. After all this publicity, this is one time that we need enough public information from Giulio Fanti to enable other scientists to confrim his work.\n\n","date":"April 2, 2013 at 6:36 am","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","id":"comment-29111","author":"Paulette","site":"shroudstory"},{"title":"Alan Boyles Cosmic Log on Fanti’s New Book","post":"Yannick, Gabriel and Paulette are correct. Fresh hands-on examination is needed, C-14 may not be suitable for several reasons, and public information on the new Shroud research is needed.\n\n","date":"April 2, 2013 at 9:14 am","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","id":"comment-29127","author":"Louis","site":"shroudstory"}]
