[{"title":"Fanti, et al. paper in Vibrational Spectroscopy","post":"An excellent paper for a number of slightly off-field reasons.\nFirstly, although the ‘Shroud of Turin’ was apparently used as a way of attracting funding, it has no other mention in the paper at all.\nSecondly, there is no mention of any of the controversial mechanical testing that formed the basis of Fanti’s ‘third method’ of dating the shroud.\nAnd thirdly, anyone who thought Andre Marion’s description of his methods (for clarifying putative inscriptions) was at all adequate need only look at this paper to understand why I called it ‘sketchy.’ Fanti’s paper is a paragon of clarity by comparison.\nWhat I would like to see now is his actual results from the Shroud, in the same format as he presents the results for his other textiles, so that we can derive our own opinion from them.\n\n","date":"April 19, 2013 at 7:18 am","url":"https://shroudstory.com/2013/04/19/fanti-et-al-paper-in-vibrational-spectroscopy/","cat":"news_&_views","id":"comment-31281","author":"Hugh Farey","site":"shroudstory"},{"title":"Fanti, et al. paper in Vibrational Spectroscopy","post":"Hugh raises excellent questions. I think it safe to say for all the justified skepticism of Fanti, a new door to study of the Shroud has been opened. I hope it’s not just an illusion.\n\n","date":"April 19, 2013 at 7:27 am","url":"https://shroudstory.com/2013/04/19/fanti-et-al-paper-in-vibrational-spectroscopy/","cat":"news_&_views","id":"comment-31282","author":"John Klotz","site":"shroudstory"},{"title":"Fanti, et al. paper in Vibrational Spectroscopy","post":"After reading the paper, it is fair to admit that this paper is published in a JCR journal which in the ranking of “Chemistry ANalysis” journals is in position 42 out of 73. Perhaps, it does not have a high impact factor (1.6) but it can be thought that has gone through a peer-review process. In this sense, my apologies to Fanti for some comments I wrote on this point.\nHowever, as Hugh says, there is not a single  mention to the  Shroud.\nMy concern is that results are given at only a 68% confidence level, while tipically they are given at a 95% confidence level in most fields of science for practical reasons. If applied here, that would mean that the error bars would be twice those provided by Fanti. That means that uncertainty would move from 200 years for the FT IR test to 400, from 400 years to 800 years in the low fluoresecence test and from 600 to 1200 years in the high fluorescence test.\n\n","date":"April 19, 2013 at 9:44 am","url":"https://shroudstory.com/2013/04/19/fanti-et-al-paper-in-vibrational-spectroscopy/","cat":"news_&_views","id":"comment-31297","author":"Gabriel","site":"shroudstory"},{"title":"Fanti, et al. paper in Vibrational Spectroscopy","post":"Due to very low amount of samples, values of the correlation coefficient and calibration curves should also be provided at a 95% confidence level\n\n","date":"April 19, 2013 at 10:03 am","url":"https://shroudstory.com/2013/04/19/fanti-et-al-paper-in-vibrational-spectroscopy/","cat":"news_&_views","id":"comment-31298","author":"Gabriel","site":"shroudstory"}]
