[{"title":"Giulio Fanti Responds to Some of Our Comments in this Blog","post":"It is doubtful if this request will meet adequate response and the methodology has also been questioned.\n\n","date":"April 8, 2013 at 11:14 am","url":"https://shroudstory.com/2013/04/08/giulio-fanti-responds-to-some-of-our-comments-in-this-blog/","cat":"news_&_views","id":"comment-29885","author":"Louis","site":"shroudstory"},{"title":"Giulio Fanti Responds to Some of Our Comments in this Blog","post":"Despite previous comments we haver read here, now it is obvious that Fanti is not going to submit his new breaking edge techonologies for cloth dating to any peer-review journal. Instead of peer-review, very cleverly, he offers an impossible challenge to another branch of the Church -the Pontifficia-. The same Church that through his Turin custodian, the archbishop, has recently rejected his findings for very reasonable and sound scientific methodological reasons (doubtful chain of custody of the samples).\nThis challenge to the Pontifficia Academy of Sciences and its 100%-sure lack of response, will certainly make good headlines and also good promotion of his book.\nIt all sort of sounds like some type of account settlements with the archbishop. Obviously he is going to play this game not in the science realm but on the media (interviews, Tv shows and so on). So sad and big damage -again- to any serious attempt to do some Shroud science.\n\n","date":"April 8, 2013 at 4:53 pm","url":"https://shroudstory.com/2013/04/08/giulio-fanti-responds-to-some-of-our-comments-in-this-blog/","cat":"news_&_views","id":"comment-29926","author":"Gabriel","site":"shroudstory"},{"title":"Giulio Fanti Responds to Some of Our Comments in this Blog","post":"Well said Gabriel.  And you know what I found the most incredible thing in all these researches done by Fanti, it is the fact that his project was backed-up by the University of Padua and that he even received big money from them to do his researches, while it was obvious for any reasonable person that, because of the highly questionable nature of the samples used, any results coming out of this would never be recognized by the Turin authorities, the Vatican and even the International scientific community! Definately, Fanti must have very good friends among those who run the University of Padoua.\n\n","date":"April 9, 2013 at 11:27 am","url":"https://shroudstory.com/2013/04/08/giulio-fanti-responds-to-some-of-our-comments-in-this-blog/","cat":"news_&_views","id":"comment-30043","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti Responds to Some of Our Comments in this Blog","post":"It seems that Fanti thinks he has developed a new way of dating textiles, based on their mechanical deterioration. If this is true, it is a valuable finding regardless of any consideration of the Shroud of Turin. Instead of calling for Vatican peer-reviewers, he might do well to remove all reference to the Shroud from his report, and submit his experiments with, and results from, his control samples alone to an appropriate archaeological journal.\n\n","date":"April 8, 2013 at 6:14 pm","url":"https://shroudstory.com/2013/04/08/giulio-fanti-responds-to-some-of-our-comments-in-this-blog/","cat":"news_&_views","id":"comment-29935","author":"Hugh Farey","site":"shroudstory"},{"title":"Giulio Fanti Responds to Some of Our Comments in this Blog","post":"Prof. Fanti’s proposition is very strange. It infringes several norms of peer review. \nA genuine peer review can’t be designed by the person under investigation. Furthermore, a proposal of ideological orientation is unthinkable.  \nIf Fanti wants his work to pass an authentic peer review he must present it in a specialized journal (not directed by some of his friends or similar) and submit it to the set of the usual conditions in this kind of publication: format, subject, size, bibliography, etc. This is the usual form to present a work to the scientific community who warrants its normal verification. This would be the first step. (But not the last, of course).\nBut the Fanti’s proposal touches surrealism when he imposes some particular conditions that sound more like obstacles than proposals. The Vatican has asked long time ago that if somebody had got a sample from the Shroud he should return it to the rightful owner, i.e. the same Vatican. Nobody answered. And now, Professor Fanti declares he has a piece of the Shroud but it will not go out of his office. Is he trying an accord or making a declaration of war?\nWhat a strange man Mr. Fanti.\n\n","date":"April 9, 2013 at 3:37 pm","url":"https://shroudstory.com/2013/04/08/giulio-fanti-responds-to-some-of-our-comments-in-this-blog/","cat":"news_&_views","id":"comment-30073","author":"David Mo","site":"shroudstory"}]
