[{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"No comment…\n\n","date":"March 24, 2014 at 8:28 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-92643","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"The [Fanti’s] press releases states: “The results of these studies have produced dating all mutually compatible with a date of 33 BC with an uncertainty of plus or minus 250 years at a 95 percent confidence level.”\nI really can’t understand the maths here. Fanti produced three disparate ratings from his varied samples. 1) 752 BC plus or minus 400 years- this gets us nowhere but it was then subject to some arbitrary adjustment by Fanti to make it 300 BC plus or minus 400 years.\n2) 200 BC plus or minus 500 years.  If this was correct the date of the crucifixion does lie within this enormous range of 1000 years but this is hardly evidence when the range is so enormous. He does not make the same correction as in 1)\n3) AD 400 plus or minus 400 years. Well, you might just catch the crucifixion date if the ‘real’ date is just on the edge of the range. Again he does not make the same correction as in 1)\nSo not one of his dates really provides much evidence for a date of 33 BC. But then ,for some reason I cannot understand, he believes one can average these dates. But we cannot be sure with the enormous disparity of dates that any of them are correct and at the most only one can be.And are we comparing like with like as one would have to do if one is to be justified in using averaging?  Or am I missing something?  But I am only a historian. perhaps the mathematicians/scientists among you can sort me out. Thanks.\n\n","date":"March 25, 2014 at 10:25 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93091","author":"Charles Freeman","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Quote: “I really can’t understand the maths here.”\nAnswer: You just have to take good note of who have produced the results and you should understand why the maths look strange.  Unfortunately, there are people in sindonology who are willing to do anything they can to “prove” the authenticity of the Shroud.  To me, Fanti is obviously one of them.  Wilson is another one.\nNote for all the pro-Fanti and pro-Wilson out there who will be mad at me, once again:  the last statement is my personal opinion (based on the way they are doing their “scientific research”) and it is no more than this.\nLast note:  The fact that there are some sindonologists who are biased in their research and desperately wants to “prove” the authenticity of the Shroud doesn’t mean this relic is not truly authentic…\n\n","date":"March 25, 2014 at 1:02 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93125","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"While a lot of scholars agree to say that the most probable date for the death of Jesus is April 7 of the year 30 A.D. (note : why we never read anything of that nature concerning the most probable date of Jesus’ Resurrection?  I thought this (and not his death) was the main event of Christianity!), I’m sure that if someone would have asked Fanti what was the date of Christ’s death, he would have said 33 A.D., exactly like his final dating result!  I have no proof of this of course, but I have a strong feeling that I’m right about that.\n\n","date":"March 25, 2014 at 1:08 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93129","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"And here’s my reply for those who would be tempted to ask me why I have that kind of opinion versus Fanti and Wilson :  I have followed enough their research in the last few years to understand how biased they are concerning their subject of research…  It’s as simple as this.\n\n","date":"March 25, 2014 at 1:11 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93132","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Thanks, Yannick. I had hoped that someone might have popped up to have shown me a defence of Fanti’s methods. If no one does then I simply assume that he is misleading us, whether he means to or not. I notice that he is also finding all kinds of strange happenings, unexpected accumulations of water on religious statues at Medjorgje for instance, and vibes from the Virgin Mary when she appears there- he is a busy man and presumably he has a job to do as well.\nI am on safer ground with Wilson as I am a professional historian and can see where he is using methods than no professional historian would use and coming to results that cannot be sustained by the evidence that exists. No one ever came to his defence about the mysterious four folding of the Image of Edessa which would have to be folded into EIGHT to fit his theory.\n\n","date":"March 25, 2014 at 3:01 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93156","author":"Charles Freeman","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Charles:\nWe have following results:\n-300 +/- 400 years (I suppose it is at 2 sigma level so 1 sigma is 200 years, I assume)\n-200 +/-500 years (250 at 1 sigma)\n400 +/-400 years (200 at 1 sigma)\nThe average mean is -33.33 years, and the standard deviation 378 years. But using weighted mean, we have -10.6 years, and the standard deviation of 123 years, that is 246 years at 2 sigma using of course 1/SD^2 (SD-standard deviation) as weights.\nThe simple math, but perhaps too much for the sceptical minds…\n\n","date":"March 25, 2014 at 3:39 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93169","author":"O.K.","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Just as claims have been made that the C-14 area was not representative of the cloth as a whole, so Fanti’s samples, from fibres vacuumed away from the space between the shroud and its backing, and therefore the weakest and most damaged of the shroud, were also unrepresentative. As such, any dating made of them using their chemical or physical degradation would almost certainly arrive at a date considerably older – perhaps a thousand or more years older – than when the cloth they derived from was actually made.\n\n","date":"March 25, 2014 at 5:02 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93192","author":"Hugh Farey","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Hugh, I agree with you that Fanti’s sample were questionable (probably highly questionable) and, to make sure his new dating methods was accurate, I still don’t understand why he never submitted a portion of his samples to a normal C14 dating.  That would have been the most rational thing to do…\n\n","date":"March 26, 2014 at 8:28 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93443","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Charles Freeman wrote “No one ever came to his [Wilson] defence about the mysterious four folding of the Image of Edessa which would have to be folded into EIGHT to fit his theory.”.\nWhat exactly, in terms of measurements and folding (numbers and orientation), does not fit “his” theory?\n\n","date":"March 25, 2014 at 4:06 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93173","author":"latendre","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"OK. First we have to ask whether each of Fanti’s tests was on the same material. Then we have to be sure that all this material is original to the moment of creation of the Shroud (e.g. not dust collected externally). Then we have to be sure that the results of his tests can be set against an objective standard of dating established on other material. If all those three things obtain, we would then have to ask why he came up with such varying results and why he felt he needed to adjust the first result but not the other two. One obvious explanation is that two of the three or possibly all three of the tests failed to produce valid results.\nThen we have to justify bringing these disparate results together to make an average between them. If I go into a greengrocers and see two cauliflowers in one box, sixteen apples in another and twelve bananas in another, then with 100 per cent certainty, there is an average of ten pieces of fruit per box. But so what? It is a meaningless result and Fanti’s also seems to be. Perhaps also you,as a mathematician, would like to find the average date if Fanti had not arbitrarily adjusted the first date. I am sure it is simple maths for you but it might just end up with an average many years before Christ’s crucifixion and then what?\nLatendre. This has been discussed exhaustively earlier and I am not going to start again beyond summarising the argument. Wilson tells us that the Image of Edessa was folded tetradiplon (well, in one account it was BEFORE it was handed to Christ but there is no evidence it was so folded AFTER Christ had wiped his face although Wilson suggests it was). Although the word is not known elsewhere we have c.150 examples of Greek words with the prefix tetra-. The most likely meaning is that the cloth was folded double four times, making sixteen sections. We have no literary equivalent but we do have a religious one in that the cloth used to wrap the statue of Athena in the Panathenaic festival was folded double four times as can be seen in the sculpture on the Parthenon frieze in the British Museum in London. However, tetradiplon could just mean folded double to make four sections. Now the point I made and to which i had no response was that Wilson showed a cloth folded double three times so making the eight sections he ‘needed’ to show only the hard of the Shroud. In other words, he was creating an image that was not related in any way to any meaning of tetradiplon. With no one challenging me on this, I have long since moved on.\n\n","date":"March 25, 2014 at 5:16 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93198","author":"Charles Freeman","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Best of my recollection, all of the pictures of paintings of Jesus Christ on the Cross have him with the nails in the palms of the hands,  the Shroud has the blood markers where the wrist would be. In my mind, this takes the human artist out of the picture.\n\n","date":"March 24, 2014 at 2:15 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-92745","author":"ekmcmahon","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"A very perceptive comment, ek!\n\n","date":"March 24, 2014 at 2:41 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-92752","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Quote: “In my mind, this takes the human artist out of the picture.”\nYes (at 99%). But I firmly believe the bloodstains evidence (along with the ultra-superficiality of the image in every zones) even more (100%)!\n\n","date":"March 24, 2014 at 3:34 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-92770","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"I forgot to add that the nailing in the wrist area is one portion (important but far from being the only one) of the whole evidence coming from the bloodstains…\n\n","date":"March 24, 2014 at 4:24 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-92782","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Try this. Go to http://www.sindonology.org/shroudScope/shroudScope.shtml and use the red ‘Measure’ tool to find the distance between one of the knuckles and wherever you think the nailhole of the wrist wound is. (I make it about 6-7cm). Measure that same distance on your own hand, first from the knuckle along the back, and then from its opposite point on the front, palm, side. Anywhere near the wrist? Not on my hand.\n\n","date":"March 24, 2014 at 6:33 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-92813","author":"Hugh Farey","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"That’s exactly where Zugibe estimated (entry from thenar furrow exit between the carpals and metacarpals) see below;\nhttps://shroudstory.com/2013/12/10/barbets-vs-zugibes-exit-points/#comments\n\n","date":"March 24, 2014 at 7:48 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-92831","author":"Mike M","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Looks like there has been some kind of foreshortening of the palm and lengthening of the fingers.\n\n","date":"March 25, 2014 at 5:37 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93011","author":"ChrisB","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"According to Barbet, who made test on real amputated hands (and who did some measurements on the Enrie’s photos), the nailing was done in the wrist area, through destot’s space, where it was locked firmly.\n\n","date":"March 25, 2014 at 8:30 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93067","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Two comments: 1) Only the nail exit point is at all visible, the entry point is not! Measuring the same distance on the inside of the palm assumes the nail went in at right angles. I’d credit an expert Roman executioner with rather more savvy; he’s going to make the entry where he knows the nail will penetrate and hold the victim secure; the nail will follow its own course through the base of the hand through whatever spaces between the bones it can find, which is most likely at a skew.  2) The observation by ekmcmahon is still valid, it takes any human artist out of the picture, they always show the nail through the palm!\n\n","date":"March 24, 2014 at 11:48 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-92903","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"There has been extensive discussion on the location of the nails previously, much of it centred on Zugibe’s critique of Barbet’s claims.  However, in discussing the instruments of crucifixion Barbet is able to cite several classical sources to support his case, whereas Zugibe seems to be relying entirely on his own static experiments with volunteers and drawing his conclusions entirely from those. \nPart of Zugibe’s critique is that the high arm tensions calculated by Barbet, are not necessary as he claims that the foot support was sufficient to reduce these arm tensions considerably.  That could be debated, as during the death agonies of the crucified he would at times seek to relieve the pain in his feet by transferring the weight to his arms. \nHowever it is Barbet’s contention that the vertical stipes was a permanent fixture, and that the condemned man was only required to carry the patibulum, the cross-piece.  Stipes were certainly a permanent fixture in the colosseum. Having been brought to the place of execution, the man is laid flat on the ground, and his outstretched arms nailed to the patibulum. Binding might be used to restrain his struggling. With the nailing complete, four executioners could then easily lift the patibulum on to the stipes. At this stage the man’s complete weight is taken by the arms, the arm tension increasing as his feet leave the ground and his body falling to the vertical position. It is only when his feet are nailed to the stipes that he can relieve his arm tension. Consequently this method requires that the nails be placed in a location where they will not tear through the palms, as the arm tension can exceed 200 pounds force. \nIt is only if the man is nailed to the full cross while lying on the ground, that wrist nailing might be avoided. The whole cross with the man attached would then have to be lifted by the execution party, and placed into a prepared hole.  This is obviously a rather more onerous and inconvenient process for the executioners. I am not informed of any sources that assert that this method was ever a normal practice, despite many artistic portrayals of it. \nBarbet traces the background history of the implements used for crucifixion, and is able to cite classical texts in support of his argument. Wherever the nailing may have occurred at the base of the hands, it seems to be quite necessary that the nails be placed so that the man’s weight could be transferred using bony structures to avoid tearing of the palms at some stage during the process.\n\n","date":"March 25, 2014 at 5:35 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93010","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"This is just food for thought but people today reenact the crucifixion by nailing themselves to crosses — the nails always in the palms. It is obviously painful but not terribly dangerous (tetanus not withstanding). No one would think to put a nail through the wrist as this is indeed very dangerous — the threat of catastrophic damage to the veins and nerves is severe.\nIf I’m a Roman executioner looking for maximum sufferiig, which would I go for, the wrist or the palm?\n\n","date":"March 25, 2014 at 6:59 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93031","author":"David Goulet","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"If you’re a Roman executioner, you will also think about a way to nail the victim very firmly to the cross, so that he couldn’t escape and, no doubt, to achieve this, a nailing in the wrist area is much better.\n\n","date":"March 25, 2014 at 10:46 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93095","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"I have just noted Charles Freeman’s comments #2-#6, and his expectation that Fanti might have a defender. He should be more patient, we have a 12 hour time zone difference, and his comments were posted in the middle of the night here. \nProfessor Fanti is an academic mechanical engineer, not a pure scientist; although it is true that European engineering tends to be more focused on the pure sciences than are practitioners with an English or American tradition which tend to draw more on applied sciences. \nIf authentic, the actual true dating of the Shroud will only give one limit for the dating of the crucifixion, the earliest possible but not the latest possible. Likewise the actual true dating of the crucifixion would only give the latest possible date of the Shroud but not the earliest possible. \nFanti’s methods of dating depends on a systematic mechanical erosion of the cellulose over time. But there are other factors which can cause this erosion such as questions of handling, storage, folding, climate amongst others. Common with all man-made products from natural substances, there will also be considerable variability among specimens, an aspect familiar enough to all engineers. Fanti’s methods depends on an underlying assumption that time is the dominant factor. \nThe graphs he has prepared from fabrics with known dates have a considerable spread reflecting this variability, and there are also outliers.  The methods are novel, and in their early stages of development, and even drawn from a fairly limited population. More data is required to corroborate them further, and to obtain better fixes.  However they will only ever give probable limits because of the innate variability. Nevertheless they seem likely to be worthwhile, as a method of corroboration or as a flag to challenge other dating results. The disparate results from the various methods he has developed show that more refinement is necessary, and it may be that a combination of the methods is required to achieve any reliability. \nApplying the methods to dating of the Shroud requires that the subject samples chosen for dating are representative, and the samples he had available might therefore be challenged on this account. \nTo average out the results to obtain a magic date of 33AD might be seen as an abuse of the method verging on pseudo-science, and which is unnecessary towards obtaining a general acceptance of the techniques he has used, which remain in an early stage of development.\n\n","date":"March 25, 2014 at 4:25 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93176","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Yannick:  I’m sure that if someone would have asked Fanti what was the date of Christ’s death, he would have said 33 A.D., exactly like his final dating result\nDaveb: To average out the results to obtain a magic date of 33AD might be seen as an abuse of the method verging on pseudo-science\nFolks it is 33 BC (-33 +/-250 years) not 33 AD, the one of two presumed dates of the crucifixion (either 7th April 30 AD or 3rd April 33 AD).\nGuys any dating of the Shroud within the boundaries of, say 1-100 AD will be satisfactionary for pro-authenticity camp. There will be never pointing to the exact date -not by these methods.\nPlease think twice (and do some calculations if needed) then comment.\n\n","date":"March 25, 2014 at 5:08 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93196","author":"O.K.","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Charles:\nPerhaps also you,as a mathematician, would like to find the average date if Fanti had not arbitrarily adjusted the first date. I am sure it is simple maths for you but it might just end up with an average many years before Christ’s crucifixion and then what?\nThen\nWe have following results:\n-752 +/- 400 years (I suppose it is at 2 sigma level so 1 sigma is 200 years, I assume)\n-200 +/-500 years (250 at 1 sigma)\n400 +/-400 years (200 at 1 sigma)\nThe average mean is -184 years, and the standard deviation 576 years. But using weighted mean, we have -182 years, and the standard deviation of 123 years, that is 246 years at 2 sigma using of course 1/SD^2 (SD-standard deviation) as weights.\nSo still within acceptable boundaries. The rest of the story doesn’t interest me at this moment -it is up to Fanti to defend the validity of his methods.\nHugh: Just as claims have been made that the C-14 area was not representative of the cloth as a whole, so Fanti’s samples, from fibres vacuumed away from the space between the shroud and its backing, and therefore the weakest and most damaged of the shroud, were also unrepresentative. \nNo evidence this hypothesis is correct, or the effect significant -so we have no reason to assume so.\nAs such, any dating made of them using their chemical or physical degradation would almost certainly arrive at a date considerably older – perhaps a thousand or more years older – than when the cloth they derived from was actually made.\nRemember, Fanti used three distinct methods of dating -and results of all of them were on behalf of the 1st millenium BC/1st AD. That greatly reduces probabilty that the Shroud is actually a thousand years younger (that comes from the Middle to High Medieval, circa 1000-1300 AD) than Fanti’s results suggest.\n\n","date":"March 25, 2014 at 5:27 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93201","author":"O.K.","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Charles Freeman wrote (#10) “Wilson tells us that the Image of Edessa was folded tetradiplon […] Although the word is not known elsewhere we have c.150 examples of Greek words with the prefix tetra-. The most likely meaning is that the cloth was folded double four times, making sixteen sections.”\nActually, the meaning of tetradiplon most likely represent the final state of the cloth not the process to reach that final state. If you see four doubled layers, you have eight layers. This is what Wilson was explaining. And it gives the correct dimension to only see the face of the Shroud.\nFor example, the expression “To be paid back four-fold”  does not mean that four operations of repaying is done, it means that the amount paid back is four times the initial amount. You could do this by any number of payments from one to whatever number: 100 payments, …, three payments, two payments or just one. The process is not important, the  final result is. The same thing applies for all words starting with “tetra” I can think of: it represents the final state, not the process to reach it. Otherwise the term is too ambiguous because there are many ways to reach a final state.\n\n","date":"March 26, 2014 at 12:49 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93319","author":"Mario Latendresse","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Mario, the word tetradiplon is used once in a text that describe the cloth as something Jesus used to wash his face only (in the days before his Passion, while he was alive and well) and, in another part of the text, the author talk about the burial cloths found in the empty tomb without ever referring to this tetradiplon cloth, which, consequently, was a DIFFERENT CLOTH than the burial cloths used for Jesus’ burial.  Don’t you see that this tetradiplon cloth (whatever the true meaning of the word) was NOT, in the mind of the author, a burial cloth and therefore had nothing to do with the Shroud…\n\n","date":"March 26, 2014 at 8:33 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93444","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"What I describe should be enough for anyone to see how poor Wilson’s “theory” about the tetradiplon cloth really is…  Every credible historians would agree with me about that, starting with Mr. Freeman.\n\n","date":"March 26, 2014 at 8:34 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93445","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Interesting note (which was described by Mr. Freeman a long time ago):  Wilson NEVER mention the fact that the author of the Acts of Thaddeus talk about Jesus’ burial cloths that were found in the empty tomb in a totally different part of his text, which have nothing to do with the tetradiplon cloth used by Jesus to make a miraculous imprint of his face on it.  For someone who is building a “theory” out of this, it is very poorly done, don’t you think?\n\n","date":"March 26, 2014 at 9:56 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93467","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"I agree with Yannick. Has Mario looked at a Liddell and Scott Greek Dictionary to see the possible meanings of ‘tetra’ as a prefix? The most likely meaning is that there has been four double foldings and as we have an example from the Parthenon frieze of a cloth folded exactly this way and handed to the priests BEFORE it was put round the cult statue of Athena (just as Christ was handed a cloth described as tetradiplon BEFORE he wiped his face on it), I think we have a good precedent for this. \nWilson’s depiction of a cloth  on page 191 of his 2010 The Shroud is a complete muddle. He shows the Shroud, then figure a) shows the Shroud doubled to make half the size and he calls this ‘doubled’. So far so good. Then he doubles again for fig b) and for some reasons calls this ‘Doubled in two’- but why not ‘doubled for the second time’ or ‘doubled to make four sections’ as this is what figure b) actually shows. ‘Whatever does ‘doubled in two’ mean?\nThen he doubles again for figure c). and calls it ‘tetradiplon or doubled in four” while what the figure actually shows is the cloth doubled for a third time to make eight sections. There is no way that ‘tetradiplon or doubled in four’ can describe a cloth doubled three times to form eight sections which is what he actually shows. However, if he doubled the cloth for a fourth time then he would have the face of the Image cut into two and then the implausibility of his argument would be exposed.\nThe sad thing is that he seems to get away with this befuddling- does nobody, other than Yannick, actually check up on him or his sources?\n\n","date":"March 26, 2014 at 2:46 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93552","author":"Charles Freeman","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Quote: “The sad thing is that he seems to get away with this befuddling- does nobody, other than Yannick, actually check up on him or his sources?”\nAnswer:  I write here on the blog since many years now and I don’t recall anyone taking my defense on this subject, other than you and another researcher (a women which I forgot the name), so I would answer “no” to your question.  Most pro-Shroudies have taken everything Wilson have proposed for granted and this is going on since 1978!  It’s a total shame for someone like me who search only the truth regarding the Shroud (whatever this might be).\n\n","date":"March 26, 2014 at 3:37 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93569","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Charles Freeman (#31) writes “Has Mario looked at a Liddell and Scott Greek Dictionary to see the possible meanings of ‘tetra’ as a prefix? The most likely meaning is that there has been four double foldings […]”.\nYou have not addressed the main point I made: tetradiplon most likely applies to the state of the cloth, not the process to fold it. For example in English, a “tri fold brochure” is a piece of paper that has two creases, that is, folded twice, to create three layers. It is NOT folded three times. The tri in “tri fold brochure” applies to the final state of the paper not the process of creating that brochure. \nLikewise, the Greek word tetrarch refers to the governor of one of four divisions of a country or province, not to a country that would have been divided four times (which may represent a very small division of a country depending on how you applied these four divisions). Charles, have you looked up the Liddell and Scott Greek lexicon and spotted a word with the prefix “tetra” that would describe a process done four times and not represent the final state of that object? I have not found any clear case. It is now on your side to provide such a Greek word. Until then, there is plenty of evidence that tetradiplon refers to the final state of the cloth not the process of folding it.\n\n","date":"March 26, 2014 at 8:53 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93678","author":"latendre","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"“Tri-fold brochure” very good example!\n\n","date":"March 26, 2014 at 9:14 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93692","author":"Mike M","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Very well put\n\n","date":"March 27, 2014 at 5:52 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93823","author":"Thomas","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"No matter what tetradiplon can mean (various meanings of this words are possible), the MOST IMPORTANT THING TO NOTE FROM THE ACTS OF THEDDEUS is the FACT that this cloth HAD NOTHING TO DO WITH A BURIAL SHROUD.  PERIOD.\n\n","date":"March 27, 2014 at 8:29 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93847","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Latrendre. ‘tetradiplon most likely applies to the state of the cloth, not the process to fold it’. It is WILSON who describes it as a process, with a sequence of illustrations, not me so address your question to him. I agree with you that tetradiplon refers to the final state of the cloth AS IT WAS HANDED TO JESUS, just as a cloth folded in just this way was handed to the priests on the Acropolis in the Panathenaic festivals- you can count the folds on the sculpture in the British Museum. So actually you and I agree, it is Wilson who brings in the question of process. So as we have no disagreement on this , I will not dust down my 1855 Liddell and Scott specially.\nThe problem is not only Wilson’s muddled illustrations of the process but his assertion that tetradiplon refers to the cloth AFTER Jesus had wiped his face on it. This is not what the text says and he really irritates me when again and again I go back to a text he mentions and finds he has misled us. As Yannick has pointed out the VERY SAME text contains a separate reference to the burial cloths of Jesus so tetradiplon cannot refer to these in any case.\nIt is better simply not to take Wilson seriously.\n\n","date":"March 27, 2014 at 6:54 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93836","author":"Charles Freeman","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"You can bet your house that if it wasn’t for Wilson and his « Dan Brown » like imagination, no one in the Shroud world would read the Acts of Thaddeus and came out believing the tetradiplon cloth used by Jesus while he was alive to wash only his face could have something to do with the Shroud of Turin…  Those who still believe such a fantasy are showing a real bias that is totally dishonest and, truly, for someone like me who believe the Shroud is authentic and who is only seeking truth regarding this relic (no matter what this truth can be), this makes me sick.\n\n","date":"March 27, 2014 at 8:40 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93848","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Charles Freeman writes (#37) “[…]I agree with you that tetradiplon refers to the final state [..]. So actually you and I agree, it is Wilson who brings in the question of process. [..]The problem is not only Wilson’s muddled illustrations of the process.” \nOk, we agree that tetradiplon refers to the final state of the cloth, which means that according to that word there are EIGHT (8) layers which FITS the final description given by Wilson. (You previously kept writing that there must have been 16 layers.)  That means the Mandylion’s size corresponds to the Shroud as a TETRADIPLON. That is the main point.\nHonestly, I think you are misreading Wilson’s description. Yes, he describes a process to REACH the final state, but this is to illustrate one of the possible process (and I think there are more appropriate ones, in particular regarding the protection of the image). The final state is the major point in his description. Certainly, it would have been instructive in Wilson’s book to show the side of the shroud to see the EIGHT layers. \nAs I just mentioned there are many such possible folding in eight layers and there are some in particular that would be such that the entire image is not visible to protect it AND at the same time could easily converted to look like the Madylion without ever seeing most of the rest of the image. That appears to me the most likely way the Shroud was stored and shown to important imperial visitors and perceived as the Mandylion.\n\n","date":"March 27, 2014 at 10:16 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93872","author":"latendre","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"No matter what tetradiplon can mean (various meanings of this words are possible), the MOST IMPORTANT THING TO NOTE FROM THE ACTS OF THEDDEUS is the FACT that this cloth HAD NOTHING TO DO WITH A BURIAL SHROUD. PERIOD.\n\n","date":"March 27, 2014 at 10:38 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93880","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Another important point concerning Mario Latendresse’s comment:  There is no solid fact to support the idea that the Shroud was the Mandylion.  In all probability, the Mandylion was still in Constantinople after the sack of the city in 1204 and was sold to St Louis king of France in 1248, along with a lot of other relics (most of those were related to the Passion of Christ).  Then, during the French revolution, the Mandylion was lost (and probably destroyed because it was considered a false relic).\n\n","date":"March 27, 2014 at 10:41 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93883","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Latendre. First folding makes two sections, second folding makes four sections, third folding ( as shown in Wilson) makes eight sections, four (‘tetra’) foldings ( as in the Panathenaic cloth) makes sixteen sections and if applied to the Shroud would have cut through the face.\nAnyway all this is irrelevant as the text makes clear that ‘tetradiplon’ does not refer to the burial cloths of Jesus,  so pretending it does is nonsense. Let’s move on.\n\n","date":"March 28, 2014 at 4:43 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94137","author":"Charles Freeman","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Quote: “Certainly, it would have been instructive in Wilson’s book to show the side of the shroud to see the EIGHT layers.”\nReply :  What would have been much more instructive is underlining the fact that the tetradiplon cloth mentioned in the Acts of Thaddeus was a COMPLETELY DIFFERENT cloth than the burial cloths found in the empty tomb that are mentioned later on in another part of the same manuscript by the same author, proving that, for this particular author, the Mandylion was different than the burial Shroud of Christ and had nothing to do with a burial cloth.\nQuote: “As I just mentioned there are many such possible folding in eight layers and there are some in particular that would be such that the entire image is not visible to protect it AND at the same time could easily converted to look like the Madylion without ever seeing most of the rest of the image.”\nReply:  It’s not because the Shroud could be folded to look like some rectangular depictions of the Mandylion (those represent only a portion of all the artistic depictions of the Mandylion) that anyone has the right to conclude the Mandylion was probably the Shroud folded.  Such a connection is very weak and, frankly, it is mainly based on pure speculation and not on solid historical facts…\n\n","date":"March 27, 2014 at 11:33 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93890","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Note: those 2 quotes come from this comment of Mario Latendresse: https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/#comment-93872\n\n","date":"March 27, 2014 at 11:34 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93891","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Hi Yannick,\nI don’t think anyone here, or even Wilson, considers the Acts of Thaddeus as Gospel.  Charles freeman was bang-on when he, writing about it, in his paper “TetraDiplon; the mystery solved” I quote ” like most Legends, it had a purpose, in this case to give credibility to a cloth with a face of living Jesus which is first recorded in Edessa”\nNow, here is the thing; what would you write if you want to make up a story when you have an image with a “sweat imprint” of a face (with eyes widely opened, in the negative) unlike any other painting that they call it “not made by hand” and it is described as being folded in eight before Jesus wipes his face with which leaves that imprint on it. I think it’s very significant. The Fact that whoever wrote the acts of Thaddeus didn’t make the connection that this was the burial cloths is irrelevant because he only saw it folded with the face in the middle. There is a lot of art work for the Mandylion that matches that description (a rectangle with a face in the middle). There is no artwork from that period that dared to depict Jesus naked and I think that’s the main reason it was folded (and probably secured) in such manner.\n\n","date":"March 27, 2014 at 12:31 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93903","author":"Mike M","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"In no text does the cloth used by Jesus to wash his face is described specifically as being folded in 8.  That’s the first mistake you made.  Secondly, even if the author of the Acts would have seen the Shroud’s face only, how in the world would he have placed the action BEFORE the Passion, while it is evident that the face we see on the Shroud is the Jesus of the Passion with evident bloodstains (many of those stains referring directly to the crowning with thorns) and bruises?  This makes absolutely no sense.  If the author of the Acts of Thaddeus (or any other author who wrote about the Abgar legend) saw the Shroud man’s face, no doubt he would have placed the action during or right after the Passion of Christ.  \nLast but not least, there is absolutely no artwork depicting the Mandylion that represent the evident bloodstains and bruises we see in the face area on the Shroud, which is, more than anything, highly relevant.\nConclusion: the Mandylion was not the Shroud, but most probably an artwork based on the Shroud’s facial area.  And why just the face and without any bloodstains and bruises?  Most probably because of the sensibilities of the time in which this artwork was created, which would have considered a naked Christ with lots of bloodstains and bruises as outrageous…\n\n","date":"March 27, 2014 at 1:08 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93909","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Before things get off-track (as it often do), I just want to tell you again what is the bottom line of all my comments on this page :  No matter what tetradiplon can mean (various meanings of this words are possible), the MOST IMPORTANT THING TO NOTE FROM THE ACTS OF THEDDEUS is the FACT that this cloth HAD NOTHING TO DO WITH A BURIAL SHROUD. PERIOD.  In that sense, it is strickly forbidden for anyone to make believe the word “tetradiplon” can refer to a very long cloth folded in 8 that would be related to the Passion of Christ.  Unfortunately, Wilson is doing just that and most pro-shroud people are buying what he said about that almost blindly.\n\n","date":"March 27, 2014 at 1:42 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93915","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Eight out of the ten most recent comments at the present time have all been made by Yannick Clement under this particular posting. They all say exactly the same thing.  Does he imagine that such repetition makes his argument any more valid? It does not! He is entitled to his views on the matter, as others are to theirs. I for one do not accept his arguments. I am prepared to accept that he may very well be right that the Mandylion was not the Shroud, but I remain personally of the view that it very well may have been.  And I am entitled to hold this view as Yannick is entitled to hold the opposite. \nYannick, Charles and various academics may imagine that the Mandylion and Shroud were two different objects and speculate on alternative routes by which the Shroud may have come to Constantinople, but they are utterly unable to muster a smidgeon of evidence to support any case for any such alternative route. \nIt is too plainly evident that the 6th and 7th century iconography throughout Eastern Christianity has Shroud-like likenesses and features. It is known that these were frequently claimed to be based on the Image of Edessa, whatever that was. Futhermore it is also known that the original image, later called the Mandylion, only emerged in Edessa from about the year 540AD. To borrow an overworked favourite expression of Yannick’s “This speaks very loudly to me!” \nIn 943AD the Armenian general John Kurkuas on behalf of the Byzantine emperor swept through Mesopotamia with an army of 80,000 men conquering everything before him, and arrived at the gates of Edessa. We all know the startling offer he made. But he only wanted one thing, “Give us the Mandylion!” Generals on such a winning streak as Kurkuas had do not set out on an expedition for just any old painted icon.  Again “This speaks very loudly to me!” \nOn its eventual arrival in Constantinople, the future emperor Constantine Porphyrogenitus, describes the image in terms which seem very like that of the Shroud image ‘extremely faint, a moist secretion without pigment or painter’s art’; others saw it as blurred.  Once more, “This speaks very loudly to me!” \nNo other object in the history of the Byzantine imperial relic collection received any such celebratory reception as did Kurkuas’ delivery of the Edessan Mandylion in Constantinople! \nThis sequence of argument speaks louder I think than any notional interpretation of ancient texts such as the “Acts of Thaddeus” nor any of its later accretions. Hence it is at least equally valid to hold the view that the Mandylion and Shroud were one and the same object, as it is to hold an opposing view of the matter!\n\n","date":"March 27, 2014 at 4:04 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93954","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"“Hence it is at least equally valid to hold the view that the Mandylion and Shroud were one and the same object, as it is to hold an opposing view of the matter!”\nWell stated. There are clues and red herrings on either side of the debate. For all we know there may have been two shrouds, an inner and an outer, the inner would be slightly more visible than the outer. One is lost to history, the other remains. The outer is the Mandylion (no blood) the inner is the Shroud we have today. Why not?\nThere is simply too much that we do not know — that’s how enigmas work.\n\n","date":"March 27, 2014 at 4:30 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93964","author":"David Goulet","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Sorry but I’ve done a long research on the subject and there are well enough solid facts to totally reject Wilson’s hypothesis regarding the Mandylion.  Sorry again but this hypothesis has no historical value.  We must look elsewhere.\nIt’s like you would say that there are clues and red herrings on either side of the debate concerning the hypothesis of Dan Brown that Jesus had a wife and a child!!!  COME ON!!!\n\n","date":"March 27, 2014 at 4:44 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93968","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"I will repeat my argument ad noseam every time I will see someone like Mr. Latendresse keeping on defending what can’t be defend without bias (i.e. Wilson’s hypothesis concerning the Shroud’s ancient past).\nQuote: Yannick, Charles and various academics may imagine that the Mandylion and Shroud were two different objects and speculate on alternative routes by which the Shroud may have come to Constantinople, but they are utterly unable to muster a smidgeon of evidence to support any case for any such alternative route. \nReply:  Because there is no credible and solid way to retrace the Shroud back to Jerusalem circa 30 A.D. while using ancient sources doesn’t mean the Mandylion hypothesis as any value…  Some people seem to think that because Wilson’s hypothesis is maybe the only one that can draw a complete historical road for the Shroud since circa 30 A.D. up until now, that it must be true (or at least partially).  I do not agree with such reasoning.\nQuote: Generals on such a winning streak as Kurkuas had do not set out on an expedition for just any old painted icon.\nReply:  How do you know for sure?  If the Mandylion was a false relic but the Byzantine general was convinced it was the true image of Christ, why not believing he was willing to do anything he could to get it?  Here’s an example to illustrate this: Do you really believe no Christian right now would be interested to steel (or buy) this relic and bring it back to his home, no matter the true possibility that this relic can well be a false painted relic after all?  Once an object has been declare “holy relic” by the Church, be sure that you will find a lot of people who will be willing to believe it is, no matter the facts…  Look, we even see this in the Shroud world with all the “theory” proposed by Wilson!\n\n","date":"March 27, 2014 at 4:42 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93965","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"More repetition ad nauseam changes nothing!\n\n","date":"March 27, 2014 at 5:10 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93974","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"daveb, I must agree. Sorry, Yannick.\n\n","date":"March 27, 2014 at 5:18 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93977","author":"Dan","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Message to Dan:  And what you say about all those bias people (like Latendresse) who have written a ton of comments here to defend ad nauseam the fantasy of Wilson about the tetradiplon cloth?  Sorry but I know understand that you’re as bias as those people…\n\n","date":"March 28, 2014 at 8:30 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94188","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Biased, yes, but balanced and brief.\n\n","date":"March 28, 2014 at 8:56 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94200","author":"Dan","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Why should I could not have the right to reply to every post that support Wilson’s idea versus the tetradiplon cloth?  Mario Latendresse and others have made a lot of posts about that.  I don’t see any good reason why I could not give them a reply.\n\n","date":"March 28, 2014 at 9:52 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94215","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Maybe it is because my opinion is going against yours Dan???  I have a strong feeling that you dislike my opinion about that and it’s a shame you constantly criticize the way I write on your blog, while others are free to back-up Wilson’s garbage whenever they want (and how many time they want).\n\n","date":"March 28, 2014 at 9:54 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94216","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"\nYannick Clément :\nSorry but I’ve done a long research on the subject and there are well enough solid facts to totally reject Wilson’s hypothesis regarding the Mandylion.  Sorry again but this hypothesis has no historical value.  We must look elsewhere.\nIt’s like you would say that there are clues and red herrings on either side of the debate concerning the hypothesis of Dan Brown that Jesus had a wife and a child!!!  COME ON!!!\n\nIf your research is so definitive then publish an article or book and set everyone straight. Be the anti-Wilson. And please stop bringing up Dan Brown – it’s overstating your argument to the extreme. I look at the evidence (what LITTLE there is) and lean towards the Mandylion and the Shroud being separate artifacts — but the Mandylion being something much more than a revered painting. You dismiss too easily clues that do not fit the theory you personally espouse, and in so doing you miss the opportunity for insights.\nYour loss.\n\n","date":"March 27, 2014 at 4:54 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-93971","author":"David Goulet","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"David I lean towards (but do not slavishly believe) the theory that mandylion and shroud are one and the same . However I acknowledge that the evidence is not bullet proof. I think there is ambiguity and greyness which makes arguing strongly either way difficult no matter what Yannick thinks.\n\n","date":"March 28, 2014 at 2:22 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94101","author":"Thomas","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Quote: “If your research is so definitive then publish an article or book and set everyone straight.”\nReply:  I already have done so!  Remember: https://shroudofturin.files.wordpress.com/2012/06/clc3a9ment_questions-about-the-mandylion-hypothesis-of-wilson_2012-06-28.pdf\nI am also currently working with Sébastien Cataldo (a French man) on a long article on the subject in which we set the record very straigh about that.  Of course, those papers will never convince anyone around here.  I have given up about that…  But at least, they bring the truth regarding this issue.\n\n","date":"March 28, 2014 at 8:33 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94189","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"David Goulet, Thomas: Two of the most interesting and informative papers on the Mandylion theory are by Jack Markwardt, particularly his “ANCIENT EDESSA AND THE SHROUD: HISTORY CONCEALED BY THE DISCIPLINE OF THE SECRET” of 2008;\nhttp://ohioshroudconference.com/papers/p02.pdf  \nMarkwardt provides many ancient references associating the burial cloths with ancient liturgies. He makes a case for the Shroud being taken to Antioch in apostolic times, where it was hidden in a wall at the “Gates of the Cherubim” in 362AD and forgotten until its rediscovery there in about 540 and then taken to Edessa, prior to Antioch’s destruction by earthquake and Persian invasion. \nThe doctrine of Addai, purporting to be an exchange of letters between Abgar V and Jesus, he considers to be a coded allegory written at the behest of Abgar VIII the Great, commemorating the conversion of Edessa to Christianity during the closing decades of the 2nd century. The purpose of writing it as an allegory was that the benign emperor Commodus was succeeded by the despot Septimius Severus, when persecutions recommenced. He makes a case that Bishop Avircius of Hieropolis, was dispatched by Pope Eleutherius to baptize Abgar VIII’s household, that Avircius was granted temporary custody of the Shroud at Antioch as a kind of visual aid for his mission to Edessa, and later returned it to Antioch.  The Shroud’s later rediscovery in the walls of Antioch is echoed in the myth that it was discovered in the walls of Edessa during reconstruction after flood damage. \nThe temporary presence in Edessa is reflected in the “Hymn of the Pearl” attributed to the 2nd century Edessan hymnodist Bardaisan, who it would seem may have seen the full body image at the court of Edessa, judging from the closing verses of the hymn.  \nAs Thomas says, there remains ambiguity and greyness, but in my view Markwardt’s paper goes a long way to filling out the gaps, from the Wilson theory, as it would seem unlikely that Edessa became Christian as early as the apostolic age.\n\n","date":"March 28, 2014 at 3:48 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94124","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"The Hymn of the Pearl / Shroud theory is fascinating , if not conclusive\n\n","date":"March 28, 2014 at 5:00 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94145","author":"Thomas","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"What I would like people to understand (this was the main goal of all my previous comment about the tetradiplon cloth) is that if you really want to support the hypothesis that the Mandylion was the Shroud, you MUST forget about the idea that the author of the Acts of Thaddeus knew that this relic (Mandylion) was a burial shroud folded in 8 parts.  Sorry but this part of Wilson’s argumentation (which is an important corner stone in the building of his global hypothesis) is simply irrelevant.  Why?  Because once you read the entire book of the Acts of Theddeus (remember that this is the only place we find this word “tetradiplon” in link with the cloth who receive the miraculous imprint), you are force to conclude that the tetradiplon cloth was a totally different cloth than a burial shroud (because Jesus used that cloth well before his Passion while he was still alive and well, with no blood or bruises on his face), that this cloth had nothing to do with the burial cloths that were used to cover the body of Jesus in the tomb (because the author made a specific mention of those burial cloths in a different section of his book, with absolutely no reference to the tetradiplon cloth he mentioned earlier at the time of the miraculous imprint) and that the only image that was imprinted on that cloth was the face of Jesus and not his entire body (front and back).  \nNote that if the author would have knew the cloth was folded in 8 parts, there would have been good chances that he also knew this was a burial shroud showing the entire body of a crucified Christ.  Unfortunatelly for Wilson’s supporters, this is not what the author is showing us in his book.  Absolutely not.  And you can also bet your house that if this author would have known the Mandylion was a long piece of cloth folded in 8 parts, other authors would have made reference to this very unusual aspect of the relic later on, which has not happened at all..\nSo, the bottom line is this:  You have the right to support Wilson’s fantasies (which have no more credibility than Dan Brown’s hypothesis about Jesus, Mary Magdalen and their supposed child), but don’t bring no more the “tetradiplon” argument, because, from the context of the Acts of Thaddeus (which is, again, the only place we found this word in link with the cloth that was showing the miraculous imprint), there is absolutely no way to link it with a burial shroud that would show the imprint of the entire body of a beaten and bloody Christ.  PERIOD.\n\n","date":"March 28, 2014 at 8:28 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94187","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Thank you Daveb and Yannick for the links to some great reading. I think we can all agree that whatever route the Shroud may have taken, if only that linen could speak — what a fantastic story it would tell. I suspect it would be more incredible than our wildest theories.\n\n","date":"March 28, 2014 at 9:09 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94204","author":"David Goulet","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"On the contrary, I suspect much of the Shroud’s ancient past has been spent very quietly and secretly somewhere in a dark place, far away from any public eyes and that’s why we don’t have any clear reference to it before the middle of the 11th century in Constantinople (at the exception of very few references to the presence of a shroud of Christ in Palestine between the 7th century and the year 1000…\nAnd I suspect that the main reason for this is the fact that such a gruesome burial cloth would have been considered as outrageous by most Christians of the first millenium (and this also explain why there are almost no suffering and bloody Christ representation in Christian art prior to the 12th century).\n\n","date":"March 28, 2014 at 10:02 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94219","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Yannick, why not submit your own history? Really, I’m eager for a paper or two…\n\n","date":"March 28, 2014 at 10:43 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94240","author":"Shelby Foote","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Yes, but it’s those years when it was not  hidden that are the fascinating part. Whose eyes have seen it? Whose hands have touched it? What hearts converted upon witnessing it? What lives were lost protecting it? What risks were taken to hide it and to then find it? What blasphemies may have been done to it? What attempts of alchemy and putting of the relic to the test? We will only know its story in the next life. I for one am going to bring some popcorn and my 3D glasses. :)\n\n","date":"March 28, 2014 at 10:47 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94241","author":"David Goulet","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Quote: “Yannick, why not submit your own history? Really, I’m eager for a paper or two…”\nReply:  Just be patient.  Sebastien Cataldo will eventually publish our extensive study (I hope it will be available in English as well as in French).  This paper will mainly be written by him and I am only a “consultant” in the project.  I hope people will read this because it will present another point of view that is rarely see in the Pro-Shroud world.\n\n","date":"March 28, 2014 at 11:09 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94243","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Along the fact Sébastien will set the record straight in his upcoming paper about the Shroud’s unknown history and the Mandylion hypothesis of Wilson, he will also propose a possible alternative history for the Shroud, even though it is impossible to build a complete history of it from Jerusalem circa 30 A.D. and Lirey, 1357.\nAnd concerning the Mandylion hypothesis, I can already tell you that it is impossible to understand correctly this relic (and its most probable manufacturing with human hands) without understanding the very complex and turbulent religious context in Edessa in the first few centuries after the city became officially Christian (which is something Wilson seem to ignore totally or, at the very least, consciously leave aside).\n\n","date":"March 28, 2014 at 11:33 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94248","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Yannick, what’s your sentiment on Dr. Barbara Frale. Who has quite openly announced that her Knights Templar and Shroud discoveries have, “…vindicated a theory first put forward by Ian Wilson(…) in 1978.”\n\n","date":"March 28, 2014 at 1:43 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94277","author":"Psuedonym","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"I don’t think the Knights Templar have ever taken possession of the Shroud of Turin.  To me, this is another wild fantasy that is not based on real solid historical facts, but much more on wild speculations and assumptions.  Important note on this issue:  the Knights Templar did not took part in the sack of Constantinople in 1204, which is when the Shroud was most probably transferred to the West…\nI prefer by far the path of Othon de la Roche, because there is some historical evidences (even if those evidences cannot be taken as real proofs for the moment) to support it.\n\n","date":"March 28, 2014 at 2:33 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94288","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Okay, finally I’m convinced, the Mandylion thesis is totally specious. But separate from that, there are (reputedly) a few dispersed allusions to a burial cloth. But what are they?\n\n","date":"March 28, 2014 at 2:56 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94294","author":"Psuedonym","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"BTW, I have Wilson’s neoteric book: “The Shroud: Fresh Light on the 2000 Year-Old Mystery”. He sums it up like this:\n“1287  According to the French Templar knight Arnaut Sabbatier […] he was taken to ‘a secret place to which only the brothers of the Temple had access’ and shown ‘a long linen on which was imprinted the figure of a man’. This recently discovered evidence of the Shroud’s ownership by the Knights Templar at this time.”\nWhat’s your analysis?\n\n","date":"March 28, 2014 at 3:37 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94300","author":"Psuedonym","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"There is one in the account of Arculf in Jerusalem (dated around 670 A.D.) and, prior to that, there is another one about a “sudario of Christ” present in a cave near the Jordan River in another testimony dated around 570 A.D. (note that this can well be a reference to a long burial shroud since the author in ancient times often used different terms, including “sudario” to talk about such a cloth).  Also, there is another reference to “burial shrouds of Christ” in a manuscript written by St John Damascene (he never mention where this relic was kept but it is possibly Jerusalem, since this manuscript was written not long after – a few decades – the testimony of Arculf). The testimony of Damascene was also retranscripted in another text of the Venerable Bede, which can be seen as a confirmation of the validity of Damascene’s testimony (which include a list of many other relics associated with the Passion of Christ).  It should be noted that in a totally different part of the same manuscript, Damascene describe the Abgar legend and the miraculous imprint of Christ’s face of a cloth (Damascene talk about a miraculous imprint of the face only happening before the Passion when Jesus was alive and well), which is another important piece of evidence to support the conclusion that the Mandylion was a totally different cloth than the Shroud of Turin, since he never included the Mandylion (known as the Image of Edessa back then) in his list of relics of Christ’s Passion.  I also read that there is another testimony of a monk who visited Jérusalem around the year 1000 A.D. who also reported the presence of a Shroud of Christ there.  Those are the only reference I know and not long after 1000 A.D. (around the middle of the 11th century), we start seeing various testimonies concerning the presence of a Shroud of Christ in Constantinople (along with other burial cloths sometimes and often included among many other relics of the Passion, all found in Damascene’s list, which he wrote around 726-730 A.D.).  In the light of all those references, my guess for the moment is that the Shroud was kept in Jerusalem (or in another place in Palestine) until it was quietly transferred to the capital of Holy relics (Constantinople) soon after the year 1000 A.D.\n\n","date":"March 28, 2014 at 3:47 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94303","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"I correct myself: (note that this can well be a reference to a long burial shroud since the AUTHORS (with an “s”) in ancient times often used different terms, including “sudario” to talk about such a cloth).\n\n","date":"March 28, 2014 at 3:50 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94306","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Yes the bloodied image would have been gruesome and offensive hence why artistic portayals of the mandylion / shroud do not depict blood!\n\n","date":"March 28, 2014 at 6:30 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94335","author":"Thomas","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"What is very telling is the fact that when Sébastien began to work of the project with me, he was still leaving the door wide open to the possibility that Wilson could be right after all concerning his hypothesis of the Mandylion.  Now that he has done a long and exhaustive research on the subject (along with me), he his as much convinced as me that Wilson’s ideas about the Shroud’s ancient past are dead wrong.  This speaks very loud to me and prove that if you’re honest and do your homework on this topic, it’s almost impossible for you to come out of it believing that Wilson’s hypothesis can still be valid versus the Shroud’s obscure years.\n\n","date":"March 28, 2014 at 1:42 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94276","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Alright, I must ask as to what specific evidence INDUBITABLY and CONCLUSIVELY renders Wilson’s Mandylion redundant.\nP.S. Please respond to comment #81.\n\n","date":"March 28, 2014 at 4:36 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94316","author":"Psuedonym","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Typo: #82\n\n","date":"March 28, 2014 at 4:39 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94317","author":"Psuedonym","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Error: My comment #73\n\n","date":"March 28, 2014 at 4:40 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94319","author":"Psuedonym","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Based on my experience working with Sébastien Cataldo and after having seen how he changed his mind versus Wilson’s hypothesis once he did an exhaustive research on the subject, I think it is interesting to ask this question :  Is it possible that if Wilson’s ideas have been so widely accepted, it is simply because most people are ignorant of the most important facts in link with this issue?  I think this is true for a lot of people for whom history is not their favorite topic…  And for the others, I think it’s just bias.\n\n","date":"March 28, 2014 at 2:54 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94291","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Bias and/or way too much imagination…\n\n","date":"March 28, 2014 at 2:55 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94292","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"I don’t think the Knights Templar have ever taken possession of the Shroud of Turin. To me, this is another wild fantasy that is not based on real solid historical facts, but much more on wild speculations and assumptions. Important note on this issue: the Knights Templar did not took part in the sack of Constantinople in 1204, which is when the Shroud was most probably transferred to the West…\nI prefer by far the path of Othon de la Roche, because there is some historical evidences (even if those evidences cannot be taken as real proofs for the moment) to support it.\nOne scenario does not exclude the other. While we can be certain to the high degree that Othon took possesion of the Shroud, it is possible that he, or his descendants entrusted the cloth to the Templars.\n\n","date":"March 28, 2014 at 2:57 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94295","author":"O.K.","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"There is absolutely no solid piece of evidence to support such a fantasy.  Thinking like that, we can also think Othon gave the Shroud to the Pope in Rome, who gave it to Geoffroy de Charny’s later on.  There is no more solid piece of evidence in the Knights Templar scenario than the one I just invented…\n\n","date":"March 28, 2014 at 3:49 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94305","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"O.K. You are on the right track. Good for you.\n\n","date":"March 28, 2014 at 7:32 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94361","author":"Louis","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"\nPsuedonym :\nBTW, I have Wilson’s neoteric book: “The Shroud: Fresh Light on the 2000 Year-Old Mystery”. He sums it up like this:\n“1287  According to the French Templar knight Arnaut Sabbatier […] he was taken to ‘a secret place to which only the brothers of the Temple had access’ and shown ‘a long linen on which was imprinted the figure of a man’. This recently discovered evidence of the Shroud’s ownership by the Knights Templar at this time.”\nWhat’s your analysis?\n\n Error: Corrected Sentence: ” This recently discovered report has been interpreted as evidence of the Shroud’s ownership by the Knights Templar at this time.”\n\n","date":"March 28, 2014 at 3:49 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94304","author":"Psuedonym","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"That’s fascinating. ..What’s the historical source? How credible is the source? And Yannick you haven’t addressed that question – thoughts?\n\n","date":"March 28, 2014 at 6:37 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94339","author":"Thomas","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Following the stoning of Stephen, Herod Agrippa instituted a persecution of the apostolic church in Jerusalem, and many fled to Antioch. If the Shroud is indeed authentic then it had to be in the custody of the apostlic leadership and would also have been taken to Antioch, along with other relics of the Passion. In the year 70AD the city of Jerusalem was destroyed, and any surviving relics would not have been held there any longer. \nSo it is in Antioch that we must assume that the Shroud was taken, and unlikely ever to be held in Jerusalem subsequently. It is an error to place too much weight on the Doctrine of Addai, and the description of the portrait as a towel or veil. Eusebius discovered the story in the archives of Edessa about 315AD and incorporated it into his Ecclesiastical History. It refers to an exchange of letters between Abgar V Ukkama and Jesus. Eusebius incorrectly assumed that it was literally true. \nHowever the Doctrine of Addai also incorporates several subsequent accretions. For example it describes the finding of the true cross along with the crosses of the two thieves, ascribing the discovery to the wife of the emperor Tiberius, whereas the discovery is more properly attributed to Saint Helena the mother of Constantine, and who lived ~248 – 328 AD. Furthermore it describes the death of Addai and the erection of a memorial to him, which only occurred ~190AD. It is only too apparent that the “Acts of Thaddeus” is pseudonymous and was written probably not too long before Eusebius first discovered it. \nThe Image of Edessa first emerges there about the year 540AD, and was most likely taken there from Antioch with the impending destruction of the city by earthquake and by Persian invasion. \nIt can be no coincidence that very soon after the Image’s first apearance in Edessa ~540 that there is a veritable welter of icons all with Shroud-like features, and all ascribed to being copied from the Image of Edessa.  It is too improbable to assert that this Image of Edessa was different from the Shroud image for these likenesses to be so pervasive. \nI have suggested above at #61, from Markwardt’s explanation of the origins of the Doctrine of Addai, that it was intended as a coded allegory referring to the conversion of Abgar VIII ~180-190AD, when the image may have been used by Bishop Avercius to assist in this.  The Bardaisanic “Hymn of the Pearl” suggests that Bardaisan had indeed seen the full body image at the court of Abgar VIII.  Very likely the Shroud was returned to Antioch by Palut the first bishop of Edessa, rather than its being retained in Edessa. \nOn its eventual arrival in Constantinople, what was thought to be known of the Mandylion was written up in a lengthy Narratio including the Doctrine of Addai. Eventually the Byzantines discovered that the Mandylion which they had captured from Edessa was in fact the burial cloth of Christ. However they were not about to abandon the various legends attributed to it and which they had worked into their various liturgies. That would be unthinkable to the Byzantine mind-set. So the myth that there were two different objects survived. \nMuch of the early history of the Shroud has been lost as it was in the possession of the Arian heretics in Antioch for some time, and any documentation they may have had was destroyed by the Orthodox who were the ultimate victors.  \nIt is a gross error to read the Doctrine of Addai or the Acts of Thaddeus as a literal version of whatever the image was that was used for the conversion of the Edessan court, and certainly not for Abgar V Ukkama.\n\n","date":"March 28, 2014 at 6:44 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94346","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"O.K. You are on the right track. Good for you.\n\n","date":"March 28, 2014 at 7:34 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94365","author":"Louis","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"O.K: “While we can be certain to the high degree that Othon took possesion of the Shroud, it is possible that he, or his descendants entrusted the cloth to the Templars.”\nLouis: “O.K. You are on the right track. Good for you.”\nRefer: ‘BESANÇON AND OTHER HYPOTHESES FOR THE MISSING YEARS: THE SHROUD FROM 1200 TO 1400’ Daniel Scavone, Ohio Conference, 2008;\nhttp://ohioshroudconference.com/papers.htm \nScavone makes a number of points re the Templar hypothesis: Confessions of Templars who admitted to worshipping a head were of lowly rank, and unlikely to be privy to the innermost secrets of the order; All such confessions were extracted under torture or threat of torture; The inquisitors had previously directed the same accusation against the Cathars; The accusation that the templars worshipped a head was therefore at the suggestion of the inquisitors and was not initiated by the templars they interrogated.\nThe only other link of the templars to the Shroud I know of was that a namesake of Geoffrey de Charnay, the templar Master of Normandy, was burned at the stake in 1314 with Jaques de Molay the order’s Prior. Geoffrey I de Charnay had a strong interest in knightly chivalry of the type practised by the Templars. It is just possible that the two Geoffreys were connected.\nIf Louis or O.K. are aware of any other information linking the Templars to the Shroud I should like to know of it. \nOthon de la Roche was an ancestor of Jeanne de Vergy, the second wife of Geoffrey I de Charnay, and therefore she could be considered to have a claim to the Shroud.\nScavone makes a case that Othon would have delivered the Shroud to his home cathedral at Besancon, then in Burgundy, possibly as early as 1207. Burgundy was contested both by France supporting the Avignon anti-pope, and by Germany supporting the Pope in Rome.  With Germany threatening to take Burgundy, a case can be made for Jeanne de Vergy taking the Shroud from Besancon to save it for France. I believe there may also have been a family connection with Pope Clement VII of Avignon. Soon afterwards, fire destroyed the St Stephen’s cathedral in Besancon. \nThere was a Shroud subsequently in Besancon showing a ventral image only, a copy of the genuine Shroud, and likely the basis of the D’Arcis false allegation that the Lirey Shroud was a painted copy. The Besancon shroud was later torn up for bandages.\nNote that the Lirey memorial badge shows not only the De Charnay arms, but also significantly the De Vergy arms, and that after the death of Geoffrey I, Jeanne de Vergy took possession of the Shroud as Geoffrey II was still a minor.  \nI suggest a reading of the Scavone paper so that it may be weighed against the Templar hypothesis.  Comments?\n\n","date":"March 29, 2014 at 4:40 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94469","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Dave: I suggest a reading of the Scavone paper so that it may be weighed against the Templar hypothesis. Comments?\nOf course I have read this paper. Multiple times, word by word, when I was writing my article about the relics of the Crist’s burial cloths http://ok.apologetyka.info/ateizm/ile-byo-pocien-pogrzebowych-jezusa-cz1,749.htm  And I found several weak points in it.\nScavone writes:\nChifflet, convinced that the original shroud was consumed in the St-Étienne fire, wrote that in 1377 it was miraculously rediscovered in a niche in the restored cathedral.[…] Now we\ncan demonstrate that there really was a copy of the true Shroud painted by an artist. It was most likely commissioned by Jeanne, now the lady of Lirey, and sent in 1377 as a replacement for the one she had taken out of Besançon between 1349 and 1354.\nBetween approx. 1357, when TS was first displayed in Lirey and 1377 there is a 20 years gap! Although the Shroud of Besancon could have been “discovered” much earlier, as the cathedral was rebuilt by 1377.\nScavone next writes:\nThe next episode seems to be a patent and deliberate conspiratorial contrivance. However, instead of destroying the Besançon hypothesis, it rather strengthens it. Chifflet wrote that in 1377 the cloth in its chest was rediscovered by means of a strange light coming from a hidden part of the cathedral. (Remember, it was almost certainly that\nwhich was made by the artist in Lirey as claimed by d’Arcis.) Judging from the lapse of twenty-eight years (1349-1377) between the fire and “rediscovery”, there could not have been many in Besançon who knew precisely what the original had looked like. In 1377 Archbishop Guillaume III de Vergy (1371-1391) was the fifth in line since the fire. That is to say, four archbishops, who might have been able to compare the\nreplacement cloth with the original, had died. In order to determine if it was the same true burial shroud of Christ previously lost, Chifflet relates that the cloth newly found in 1377 was placed upon a corpse, which miraculously revived. It was thus a Vergy who “verified” by a “miracle” that the new Besançon replacement shroud was indeed the original Besançon shroud. A family cover-up to exonerate Jeanne’s departure with the true Shroud is a strong\npossibility. \nI dislike it. It is too much conspirational. Similar arguments were used by Leonardo proponents, that the Shroud of Lirey and the current Shroud of Turin were two distinct objects. Anyway, there is still 20-years gap between first displays in Lirey and 1377! This makes the Scavone’s reasoning very unlikely.\nAnd another point. Here is the branch of  genealogy tree coming down from Otto de la Roche to Jeanne de Vergy:\nOtto de la Roche ->Otto II ->Isabel/Elisabeth married Jean de Vergy ->Guillaume de Vergy -> Jeanne de Vergy.\nThus it seems that the Shroud had to been inherited by female heirs TWICE. Not impossible, but EXTREMELY UNLIKELY as both Isabel de Ray and Jeanne de Vergy had brothers.\nWe have no guarantee that by the year 1300 the Shroud was still in the hands of Roche/Ray and/or Vergy or any other related families. \nFor the Templars hypothesis, the most comprehenisve work is Barbara Frale’s The Templars and the Shroud of Turin. See also this http://www.cirac.org/Mandylion.pdf\n\n","date":"March 29, 2014 at 7:45 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94503","author":"O.K.","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"I am aware that Ian Wilson attempted to obtain further corroborative information from Barbara Frale on her “Templar discoveries”. Persistent requests to do so met with no response, and he was persuaded that there was nothing in her claims. He has written disparagingly of her claims, and seems to consider her unreliable. Her claims of writing on the Shroud showing a type of ‘death certificate’ would seem equally suspect.\n\n","date":"March 30, 2014 at 3:30 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94965","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"You say about this http://www.shroud.com/pdfs/n73part5.pdf\nWell have you read your books? Because I have. I think her claims, although exaggerated to some degree, are as much valid as Scavone’s about Nicholas de Otranto relation. Both are controversial and can be interpreted in various ways. The difference is that Scavone is usually praised (at least by Americans and other English speakers) while Frale is denounced by the very same audience. Frale’s books are quite specific, and to high degree speculative, although they provide much interesting information about background to tthe history of the Shroud.\nAnd notice that Wilson and Frale compete with each other -who will publish new discoveries first.\n\n","date":"March 30, 2014 at 3:57 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94970","author":"O.K.","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"Quote: “Both are controversial and can be interpreted in various ways.”\nReply:  Effectively… And, to me (and I’m sure for a lot of scholars), Scavone’s interpretation of Otranto must be seen as a wild assumption that really seem to be driven by a too great desire to back-up his belief about the Shroud transfer to France via Greece after the sack of Constantinople.  The most rational (and prudent) way to understand the testimony of Otranto, is to assume he saw the smaller burial cloth(s) (or maybe just linen strips, which is the most natural way to translate the word “spargana” that he used) that were once kept with the Shroud as part of the whole lot of burial cloths associated with Christ (and not the Shroud itself) and to assume he saw this or those cloth(s) in Constantinople, since we know that there were still similar burial cloth(s) there, up until they were sold to St Louis king of France in 1248 by Baudouin II, the latin emperor of Constantinople (the list of relics used the term “sudarii” to describe this or those burial cloth(s))…\nQuote: “The difference is that Scavone is usually praised (at least by Americans and other English speakers) while Frale is denounced by the very same audience.”\nReply: I think again this is mainly due to a nationalism war that rages on in the Shroud world for years between researchers coming from English speaking countries and researchers coming from Italy.  This sad war is going on since the STURP days and never really disappeared…\n\n","date":"March 30, 2014 at 6:29 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-95004","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"You can bet that it will be Frale.\n\n","date":"March 30, 2014 at 4:23 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94975","author":"Louis","site":"shroudstory"},{"title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin","post":"New discoveries? “You can bet that it will be Frale.”\nReal or invented??\n\n","date":"March 30, 2014 at 5:27 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-94994","author":"daveb of wellington nz","site":"shroudstory"}]
