[{"id":"comment-1092","author":"theologian","post":"I think I will read Corsi’s new novel before I read Lupia’s fiction..","date":"2010-03-05","mins":"8:42 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1108","author":"theologian","post":"Stephen. I agree with you. Lupia’s attempt at liberal biblical revisionism won’t fly. Isn’t such revisionism always an attempt to make the narrative fit a theory. . . . (the rest of the comment has been deleted as inappropriate by admin).","date":"2010-03-07","mins":"9:32 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1122","author":"theologian","post":"Mr. Lupia, you wrote, “your suggestion that a Jew buy linen or a tallit from a Gentile once again shows your ignorance of the historical context and culture of that milieu of Judea in the first century or any other time for that matter. No Jew would buy anything to wear or touch that has been touch by Gentiles (goyim), which makes the object unclean. Jewish merchants sold tallitot, not Gentiles.” Did you just make that up, Mr. Lupia? You have to be kidding? Right?.","date":"2010-03-08","mins":"11:54 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1167","author":"theologian","post":"Sounds to me like Lupia is saying that his speculations are proof of his speculations. Talk about extreme fallacy..","date":"2010-03-21","mins":"10:09 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-1083","author":"theologian","post":"Lupia has stated, “But most researchers on the Shroud of Turin are not archaeologists and have never studied archaeological textiles.” Of course not. The field is multidisciplinary. There are archaeologists and historians and plenty of people who have studied ancient textiles. Nobody but Lupia thinks it is a tallit. This is simply nutty. The guy who claimed that the shroud could not be real because he found a fragment of a shroud was also an archaeologist. Should we believe him because he is an archaeologist who has also studied ancient textiles. As for the claim the the other translations are inept is arrogant in the extreme. That one statement alone makes me wonder if Lupia has any comprehension about the scope of modern biblical scholarship. I think I’ll wait on the reviews before I spend this kind of money..","date":"2010-03-04","mins":"3:54 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"}]
