[{"id":"comment-199178","author":"joshua8b2015","post":"Barrie Schwortz is a Hero. A unique Hero..","date":"2015-05-15","mins":"7:54 am","url":"https://shroudstory.com/2015/05/15/an-american-jew-in-favor-of-authenticity/","cat":"other_sites","title":"An American Jew in Favor of Authenticity"},{"id":"comment-216612","author":"joshua8b2015","post":"Dear Dan, I liked you on the History Channel with Ray Downing… Maybe there is some way that I would be able to help you continue… I think you are a valued presence. Thank you for hosting The Ray Downing and The Barrie Schwartz. I hope that you continue it would be sad to see you go. I beleive The Shroud is Jesus’s The Messiah, I hold that it is obvious… Just by seeing it…. Thank you and G d bless you, Joshua On Tue, Dec 15, 2015 at 6:44 AM, Shroud of Turin Blog wrote: > Dan posted: “This is my last posting. I’m retiring from blogging. I need > to. It’s time to move on. I’m now more involved in the community where I > live and I want to become more active in the church. I’ll let commenting > continue for a few days and then shut down comm” Respond to this post by > replying above this line > New post on *Shroud of Turin Blog* > Thank You, Everyone > by Dan > > > [image: image] > This is my > last posting. I’m retiring from blogging. I need to. It’s time to move on. > I’m now more involved in the community where I live and I want to become > more active in the church. > > I’ll let commenting continue for a few days and then shut down comments > for good by years’ end. I’ll keep the blog up for future research and > reading. > > Thank you, everyone! > > If you want to take over in some way, write to me and we’ll try to figure > out something. > —————————— > > [image: image] > I started > this experiment seven years ago with the hope of beginning an ongoing > conversation about any and all topics related to the shroud. The slow pace > of papers and the length of time between conferences, very much the > time tested way, was too slow for my temperament. There was the Shroud > Science Group conducting discussions in private by email. I enjoyed that. > But its membership was restricted. It reminded me of the proverbial > boy hood tree house with the sign that read, “No Girls Allowed.” > > Maybe that’s unfair: You had to be nominated. You had to be invited. No > one was ever turned away although a couple of people were eventually kicked > out of the group for email misbehaving. If there had been a sign and > someplace to hang it, it would have read, “No Skeptics Allowed.” At least, > it felt that way. > > Skepticism is the healthiest of attitudes with all things having to do > with religion. I believed that. For instance, a Christian should never fear > new discoveries in science and history. There can be no better test of the > strength and truth of one’s faith than to face the questions posed by new > views of reality. > > We needed to be tempted, not by going into the desert but into the > jostling crowd. It took a long time. Thank, God, for Colin Berry and all > the others. > > At first I didn’t do blogging correctly and this blog didn’t catch on. > Eventually, I learned to say less and encouraged others to become the > center of the discussion, something I’m not good at. In doing so I created > an opportunity to learn a lot from skeptics and non skeptics alike. I hope > this has been true for others because this blog was never intended for my > benefit alone. > > This blog has exceeded all my expectations. Lately, I have been posting > almost every day, sometimes two or three times a day. Comments pour in. > They are good comments, not those meaningless short comments you see in so > many blogs. There has been a lot of constructive discussion. > > In looking back over seven years, I realize that my overall views on the > shroud have not changed significantly. You’ll note that in the right hand > column of every page, I say, “The Shroud of Turin may be the real burial > cloth of Jesus.” I used to say it *probably is* instead of *may be*. I > still gut think it is probably authentic but in all honesty I can’t defend > the word *probably* with real world science and objective history. > > Belief is a less cautious word than knowing. I can say with more honesty > that from all the evidence discussed here, with everyone’s input > considered, I believe the shroud is indeed authentic. But I can’t say I > know it. > > As I leave blogging about the shroud, I want to leave a few thoughts > behind. This is today’s list. I may awake to a new list tomorrow but I > won’t go back and change it. I’m really out of here. > > *On Overwhelming Evidence:* From time to time, people have tried to > convince me that the evidence in favor of authenticity is overwhelming. > Similarly, others have tried to convince me that the evidence against > authenticity – particularly the carbon dating – is overwhelming. No, it is > not. It is underwhelming. That is why this blog has over 4000 postings with > a total of more than 46,000 comments. That is why this blog has accumulated > 3.3 million page views. That is why 790 people subscribe to receive email > copies of every posting. > > *Redo the Carbon Dating: *Of course. > > *On Seeing Things on the Shroud:* I don’t think there are any images of > ancient coins, plants, teeth or written messages in Greek, Latin or Hebrew; > all these are wishful misperceptions or pareidolia. See: *I Don’t See > Flowers and Coins and Teeth on the Shroud of Turin* > > > *On 3 D Encoding:* I think the ability to plot a 3 D representation of the > body from the image of a man on the shroud with tools like the VP8 Image > Analyzer or Image J is a valid image characteristic. However, I don’t think > that the data – essentially greyscale values of the image – necessarily > represents cloth to body distance. To think so requires the assumption that > the shroud covered the body. It probably did if the cloth is authentic, but > we are not there yet. Nonetheless, I’ve listened to others preposterously > trying to prove the authenticity of the cloth from the facts and > measurements derived from this assumption. > > Moreover, it is often said that it is impossible to plot 3 D informati.","date":"2015-12-15","mins":"4:20 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"}]
