[{"id":"comment-179030","author":"kelly_kearse","post":"Terrific presentation great collection of images.","date":"2014-12-24","mins":"9:15 pm","url":"https://shroudstory.com/2014/12/23/emanuela-marinellis-73-slides/","cat":"art","title":"Emanuela Marinelli’s 73 Slides"},{"id":"comment-40995","author":"kelly_kearse","post":"David Rolfe : Who could say what that might (and still might) yield in terms of genetic information? We could be looking at the genome of God or of a humble and delusional carpenter. Just curious exactly what is the expectation here? Which specific genes (or sequence information) in the nuclear DNA and/or mitochondrial DNA will discern between the two?.","date":"2013-08-11","mins":"4:45 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-191801","author":"kelly_kearse","post":"“Approximations”, “correction factors”, “adjustments”, “my hands are smaller/larger”…Has anyone tried these types of measurements using the other hand of the TS man as an internal standard? Are both hands exactly equivalent? Or is it difficult because a portion of the one hand is masked and the other one is curved, making it hard to tell exactly where the wrist begins or tips of the fingers lie? If so, then…Simply looking at the image in the positive or negative version on photographs or apps, the bloodstain appears more toward the wrist than the hand, certainly the center of the palm, at least to me. But maybe that’s much too simplified…wonder how that group of kids that was surveyed on the holes in the Pray Codex would vote on this one? Gotta run, don’t have that much time on my hands, er wrists.","date":"2015-02-25","mins":"8:53 am","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","title":"Maybe the Nails Didn’t Go Through the Wrists"},{"id":"comment-121511","author":"kelly_kearse","post":"“…the one by Ariel Agemian…” Did he only paint one? There are several differences between this and the one most often reproduced on the internet, but it has an obvious resemblance, don’t you think? Only if you consider (all of) the Vignon markings :).","date":"2014-05-19","mins":"2:06 pm","url":"https://shroudstory.com/2014/05/19/name-that-picture/","cat":"art","title":"Name that picture"},{"id":"comment-121110","author":"kelly_kearse","post":"Great job, O.K. Very interesting.","date":"2014-05-18","mins":"9:17 am","url":"https://shroudstory.com/2014/05/18/paper-chase-a-revolution-indeed/","cat":"art","title":"Paper Chase:  A Revolution Indeed (with revised PDF file)"},{"id":"comment-10822","author":"kelly_kearse","post":"A bit tough to call, but I also think there might be a beard there. The photoshop version seems to really enhance the image. Has anyone ever looked at a photo of the medal, particularly the facial area, with the VP 8 software? I believe a previous post announced a new, downloadable version?.","date":"2012-04-24","mins":"5:03 pm","url":"https://shroudstory.com/2012/04/24/questions-about-the-lirey-medal/","cat":"art","title":"Questions about the Lirey Medal"},{"id":"comment-77062","author":"kelly_kearse","post":"For what it’s worth, I found this on two websites discussing Orthodox icons: # 1: “Various reasons have been given for slanting the bottom bar. There is one tradition which states that, at the moment of His death, Our Lord’s foot slipped and the footrest tilted. A highly symbolic interpretation states that the slanted bar refers to the thief crucified on Our Lord’s right side—the “Wise Thief” who repented—who went to heaven and to the unrepentant thief crucified on Christ’s left side who did not. Another explanation is that the slant is an attempt to depict that the footrest slanted downward, toward the viewer, albeit in a two, rather than three, dimensional form.” #2: “The foot rest of Christ’s Cross is slanted because it is believed that in the final moments before Jesus gave up His spirit, His flesh spasmed and the foot rest was kicked out of place. But in this true event there is also symbolism. The foot rest points up, toward Heaven, on Christ’s right hand side, and downward, to Hades, on Christ’s left. One of the Orthodox Church’s Friday prayers clearly explains the meaning: In the midst, between two thieves, was Your Cross found as the balance beam of righteousness; For while one was led down to hell by the burden of his blaspheming, The other was lightened of his sins unto the knowledge of things divine. O Christ God glory to You”.","date":"2014-02-06","mins":"3:34 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame"},{"id":"comment-191596","author":"kelly_kearse","post":"Louis wrote: “I don’t see why what STURP team scientists discovered about the possibility of painting should be ignored. This reminds one about Dr. Walter Mc Crone’s attitude, posted on another thread recently with some good comments.” Has to be ignored (along with other results) to try to make the hypothesis fit similar to selectively quoting negative blood data findings from 1973 in the article and just leaving it at that. Even with the selective reporting, this hypothesis has many struggles in of itself. It’s like trying to put a glass slipper on a gorilla the ugliest of stepsisters: doesn’t fit. Hugh wrote “The objection to these copies is not that they are not as good as the Shroud, but that they are based on what they already knew and images they had already seen.” Another objection for many such copies is that they involve detectable paints, pigments this doesn’t agree with what’s been reported for the Shroud. How does one “paint” an image in the absence of a detectable medium? It would be interesting to hear Isabel Piczek’s comments on Freeman’s hypothesis.","date":"2015-02-22","mins":"7:27 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191653","author":"kelly_kearse","post":"HG wrote “Isabel Piczak is certainly not a noted theoretical physicist, and her prognostications on the physics of the resurrection are unlikely to make her one. She is undoubtedly a noted artist, and has had useful things to say regarding the projection of the image on the cloth. I do not know what her experience is of medieval paintings” The fact that she has a background in physics was mentioned simply to point out that she has a notion of what science is about. Initially dismissing someone without even considering what insight they might provide tells of insecurity. I’m betting Dame Piczak knows her pigments and could provide some interesting comments...","date":"2015-02-23","mins":"10:50 am","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191629","author":"kelly_kearse","post":"The loin cloth was added at a later time, but then flaked off, yet the scourge marks (and other features) remain visible. In addition to painting adeptly in the negative, the artist was also accomplished at painting in the invisible, again anticipating detection of serum halo rings using uv light in the future. Isabel Piczak is a noted artist & theoretical physicist I’d say she’d have some good insight regarding much of this. I think de Wesselow’s comments on this particular hypothesis would also be interesting. Of course, with any such comments, just like the scientific aspects, one can simply discard the parts that don’t fit it’s old ground too flakey.","date":"2015-02-23","mins":"6:04 am","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191679","author":"kelly_kearse","post":"Hugh, I wrote “Isabel Piczek is a noted artist & theoretical physicist”. I was never claiming she was a “noted” physicist what “no background” means is open to interpretation I suppose. I was just going by what comes up when her name is searched. I also mentioned de Wesselow’s in the accompanying sentence. I think both might have useful things to say, irrespective of any major experience in medieval art. It would seem reasonable that IP’s knowledge of science vocabulary may be above that of a typical artist, having some connection to physics, but that’s neither here nor there I think her comments on pigments flaking, now you see it now you don’t, would be interesting it seemed a bit too much of a trigger finger reaction to me, particularly given her known support for authenticity. BTW, using the same measure, others may claim to have a “science background”, but the meaning could be various. To some, the claim of a scientist is based on taking graduate courses in various subjects or teaching science or exposure at some level. To others, the claim of being a scientist, implies having conducted original research in a university associated laboratory or independent company, having a published cv. Could mean different things to different people, no doubt..","date":"2015-02-23","mins":"5:19 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191683","author":"kelly_kearse","post":"Hugh Farey wrote “Fair enough. Have you read “The Event Horizon of the Shroud of Turin”? Elevating stuff…” Has been awhile, but sure.","date":"2015-02-23","mins":"5:31 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191585","author":"kelly_kearse","post":"Why would an artist paint scourge marks in areas (upper thighs dorsal & ventral; buttocks dorsal) that would have been covered by a loin cloth in the original painting, suggested in the hypothesis to have flaked off? Just in case?.","date":"2015-02-22","mins":"4:14 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191697","author":"kelly_kearse","post":"Re: the thumbs if rigor mortis had rapidly set in as has been suggested in the past, would the thumbs still exist in their natural position relative to the index finger? Or would the thumbs have been more locked in a fixed position? either more outward or inward? Does the natural position still apply to hands held upward with accompanying rigor? My understanding is that rigor in the upper arms/shoulders was suggested to have been broken to bring the arms closer to the body..","date":"2015-02-23","mins":"6:49 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"}]
