[{"id":"comment-212121","author":"kelly_kearse","post":"Representative sampling: There is a link in the article to Supplementary Information provided by the authors which diagrams the regions of the Shroud that were vacuumed Regarding “this plant DNA from India”, the reference in the paper was made to specific Human mt DNA haplogroups (M56 and R8) of Indian ancestry. As the authors point out, such findings could result from the manufacture of the cloth in India (workers touching the cloth) or people traveling from India to a site where the Shroud was located. For that matter, similar results could be seen if the cloth had never been in India and a person who had never lived in India touched the cloth (but had a maternal grandmother of Indian origin). The word origin of “Sindon” is also raised as a possibility for an Indian connection. If sufficient genetic differences existed among flax from different regions of the world, and DNA of the cloth fiber itself were examined, this might provide more info.","date":"2015-10-09","mins":"6:09 am","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-212185","author":"kelly_kearse","post":"There were two types of DNA that were studied using vacuum dusts taken from the Shroud: plant DNA & human (mitochondrial) DNA. The map diagrams in the paper illustrate the regions throughout the world that such signals are primarily associated with. A previous posting had confused the authors discussion of human DNA (from India) plant DNA. The studies show that DNA from multiple plant species and (not surprisingly) multiple persons are present on the cloth. With the latter findings, It’s important to emphasize that this is not DNA isolated from bloodstains threads themselves, but from vacuumed surface dusts. When a DNA signal is detected that correlates with a particular geographical location, India, for example, it’s impossible to know from just that data exactly how or when that DNA signal got there. The authors are appropriately cautious & conservative in their conclusions. For example, If someone who lived in the U.S. Told you they found fifty euros in their pants pocket, it’s possible they could have traveled to Italy recently and obtained it themselves. It’s also possible that someone else could have traveled from Italy to the U.S. And given it to them. Even still, a third party could have received it from someone else and placed it there. Without other info, one is unable to distinguish between the possibilities all you can really say is that the fifty euros is there. Sort of like the bird DNA they found on the Shroud maybe a bird landed directly on the cloth at some point or perhaps the bird landed on a plant, that eventually came in contact with the cloth. The comment about DNA from flax refers to sequencing (plant) DNA from the Shroud fibers as opposed to the surface dusts. For this to be particularly meaningful, enough genetic variation would have to exist among flax from different geographical regions I don’t know if this is the case or not. (The flax genome has been recently sequenced). This wasn’t particularly brief, but I hope it helps..","date":"2015-10-09","mins":"8:29 pm","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-212252","author":"kelly_kearse","post":"The shotgun approach is useful when an entire genome (all of the DNA needed to encode an organism) is being sequenced. The DNA is sheared or cleaved into many small fragments and then each fragment is separately sequenced (Like a shotgun that scatters many pellets as opposed to a single focused shot). Based on homology/overlaps, the sequence of the entire genome is then assembled from the data. The de Bruijn program would assist in this. It’s analogous to a single person trying to copy a very large book: it’s a lot of work and would take a lot of time. It’s much more efficient, much less error prone if the work is divided between many scribes who each copy a few pages, many of them being duplicates or overlapping with that copied by another scribe. In the end, the work is then collated and assembled..","date":"2015-10-10","mins":"7:29 pm","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-212253","author":"kelly_kearse","post":"As a separate comment, It is interesting that in the most recent study, the amplification methods allowed the detection of the DNA of a bird and that of a marine worm. Certain gene sequences from the mitochondria of these organisms must overlap sufficiently with that of humans to result in the detection of even faint contaminants. It is reasonable that mt DNA from cows, rabbits, goats, etc. (other mammals) would be much more closely related to human sequences than those of bird or worms, and would therefore have had an even greater chance of detection (although none was reported). This is relevant as mitochondrial DNA analysis has been used previously to detect the types of animal glues used as a binder in various artworks: http://www.researchgate.net/publication/47451001 Tracing the biological origin of animal glues used in paintings through mitochondrial DNA analysis http://www.ijcs.uaic.ro/public/IJCS 14 33 Eriksen.pdf.","date":"2015-10-10","mins":"7:32 pm","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-212324","author":"kelly_kearse","post":"Good question yes, I think so, assuming there is sufficiently homology there certainly the authors would have mentioned it if found. Not that I think you’re doing this, but the current studies do not readily extrapolate to the bloodstains. The bloodstains would need to be examined directly. DNA sequencing has the advantage over immunological testing there in that it shows both the similarities as well as the differences; immunological (antibody) tests just show reactivity or no reactivity. Only similarities are revealed, making it difficult to distinguish between the two (primate vs. Human); although antibodies are now available (2010) that can do this. On the other hand, immunological testing has the advantage over sequencing in that it specifically denotes a blood cell product; with DNA sequencing, you can’t tell if the signal comes from blood cells or skin cells. DNA rearrangement of immune receptor genes (specific for lymphocytes, i.e. White blood cells ) would have to be examined, if doable, to specifically claim that a DNA signal was present from blood cells..","date":"2015-10-11","mins":"8:51 pm","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-212436","author":"kelly_kearse","post":"I think the only thing that is certain is that it is at best uncertain. [Include bracketed version for long form]. In the current study, vacuumed dusts were evaluated, not bloodstains, and there is obvious contamination (multiple sources). To begin to make any specific conclusion about the DNA present in bloodstains, sample(s) would have to be taken directly from there. Regarding the amount of DNA material, who knows? Degradation and contamination could preclude any meaningful interpretation, but (only my opinion), you don’t know until you look. The bloodstains may hold somewhat of an advantage in that samples could be taken from the back of the cloth (even below the surface to minimize visual alteration). Sampling from multiple sites (CODIS approach) is absolutely key. [Separate from the most recent report, DNA studies have the potential to address additional questions, including confirmation of blood type, blood touch up throughout the years, and if other types of blood (cow, goat, chicken, etc.) might also exist on the cloth, (in addition to primate which was reported). The only other species for which any data exists is rabbit, which serendipitously fell out of the previous studies years ago (in control samples). The species question could also be approached serologically, in ways that maximize the sample (using a sequential approach on a single sample).] It is important to bear in mind that even sampling from bloodstained areas technically does not prove that the DNA signal originated from blood cells. In the Garza Valdes studies, bloodstained fibers were reported to be positive for the betaglobin gene (a subunit of hemoglobin). All one can conclude is that the sample tested positive for betaglobin DNA. Skin cells also contain the betaglobin gene. Similarly, skin cells and lymphocytes both contain mt DNA. [To definitely prove that the DNA signal originated from blood cells, one would need a means to distinguish a signal that was uniquely present in one cell type but not the other. Lymphocytes are unique among all cell types in the body in that their receptor genes (immunoglobulin, T cell receptor) undergo DNA rearrangement as part of their normal development. The variability that exist among immune receptors is beyond huge, but there are certain so called constant regions without such variability (e.g. Kappa light chain) adjoining the splice, which could potentially allow rearrangement to be evaluated. Of course, degradation could be a major obstacle, though much is being done with smaller & smaller amounts of DNA.] I think there are a lot of Shroud questions to focus on, C 14 and DNA are just two of them. Even apart from DNA studies, there are many basic questions about the Shroud bloodstains that remain unresolved. The most important question to focus on, above all, is the message which the Shroud represents. This extends across scientific disciplines (and beyond). The message will remain, whether the Shroud is authentic or not..","date":"2015-10-13","mins":"10:17 am","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-215921","author":"kelly_kearse","post":"[The XX male argument] “imposes assumptions about miraculous conception onto science in order to try and prove the assumption.” Here a person must decide how comfortable they are in believing that God/Jesus truly performed miracles that defy the laws of science or if such miracles are merely literary devices or gross exaggerations. Certain Christians may choose to accept selected miracles (the loaves & fishes, walking on water), whereas discounting others, such as the virgin birth. For Catholics, transubstantiation could also be included in the mix, as it is a central tenet of the Roman Catholic faith. A companion consideration to those above is where one’s own personal belief lies regarding whether our current understanding of science and scientific laws is complete in 2015, soon to be 2016. In the situations described in the article, the de la Chapelle syndrome, there is uneven crossing over between the X and Y chromosome. For the 1 out of every 100,000 males who are XX, there is still an involvement of (a portion of) a Y chromosome. True, as Tipler contends, it would not be detected by the standard amelogenin X & Y genetic tests. But a Y chromosome (or portion thereof) would be involved at some point in his scenario, just not that region that was evaluated (hence, the “negative” result). If God intervened as some interpret the gospel to read, is it reasonable that God would be limited to just a portion of the Y, including only enough to technically qualify as male? Why not the entire Y chromosome? Why would God’s Son be anything other than a perfectly healthy, normal (XY), diploid human being? Regarding the 1995 results by Canale, additional gene sequences from chromosomes other than the X and Y were evaluated. Several are polymorphic, that is, they show variation in sequence among the population (not everyone expresses the exact same form). These are important in that they can provide information as to whether contamination of a sample (apart from any results from X or Y regions) may be present. From http://www.shroud.com/pdfs/kearse3.pdf : “In 1995, Canale and coworkers performed DNA analysis of samples taken from both the Turin Shroud (from the soles of the left and right feet) and the Sudarium of Oviedo. Several sequences were examined, including the amelogenin X and Y genes, THO1 (tyrosine hydroxylase), v WA (von Willebrand factor), FES/FPS (tyrosine kinase), and F13 A1 (coagulation factor XIII), (16). Two of these regions, THO1 and v WA, are part of the CODIS standard 13 ST Rs (6,7). The authors reported that contamination between male and female DNA, and all of the other sequences examined was evident (16, 17). It was stated that the presence of male DNA on the Shroud was more noticeable that female DNA, and contamination by persons who touched the cloths was considered as a contributing factor (16,17). Consequently, such results were considered essentially null and void. “.","date":"2015-12-08","mins":"3:08 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-153142","author":"kelly_kearse","post":"Linus usit. Hugh (3) above: the retting process may be somewhat harsh on flax DNA, although sequencing might be doable some might survive this is what several plant genomics scientists replied to me via e mail last year The above study is via surface vacuum, not direct thread analysis this would be the best bet for that. The entire flax genome has been sequenced, although I am unsure if a database is at the point to discriminate genetically flax from different regions (if possible) or mutation rates in certain segments with time (probably not long enough?), to help further characterize the cloth. Catalogue (daveb), yes, I think that’s a good description it will be interesting to follow any further developments making solid connections with a historical type trail can be difficult as there are many unknowns. Hopefully such studies could progress, eventually, to the level of publication in a science journal, as more details come forth.","date":"2014-09-21","mins":"7:39 am","url":"https://shroudstory.com/2014/09/20/paper-chase-uncovering-the-sources-of-dna-on-the-shroud/","cat":"paper_chase","title":"Paper Chase:  Uncovering the Sources of DNA on the Shroud"}]
