[{"id":"comment-28826","author":"kelly_kearse","post":"Vera, From http://www.sindology.org, “The TV broadcast of the exposition of the Shroud of Turin will be on Saturday, March 30, from RAI Uno at 5:15 pm, Turin time, which will be early morning in America. Pope Francis will open the exposition. It will last about 45 minutes. Consult the Web site of RAI TV for more details and specially the RAI TV Guide”. Perhaps it is only the earlier program that is blocked? I am on the east coast, got up early as well I was unable to tell from the titles of the programs, which might be which. “Waiting for the Exhibition” has taken on a literal meaning…Hope everything works out..","date":"2013-03-30","mins":"7:34 am","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","title":"Awaiting Live Stream from RAI Uno"},{"id":"comment-28833","author":"kelly_kearse","post":"Donna, Thanks for your post I was hoping to watch as much of the programming as possible, including the preliminary shows that’s why I tuned in early I thought they might be broadcast as well, as part of the total event. I often get up early, even on weekends, so for me was not that different. I, too, downloaded the Shroud app yesterday I appreciate the high resolution of the images, appears to be similar to Shroud Scope, a little sharper imaging. The text/discussion content, John in Pelham, you raise a good point….","date":"2013-03-30","mins":"8:33 am","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","title":"Awaiting Live Stream from RAI Uno"},{"id":"comment-28830","author":"kelly_kearse","post":"Unfortunately, or fortunately, I am unable to respond directly to other comments, because numerous weeks ago I decided to give this up for Lent. As one may politely refuse chocolate or a nice dark beer when offered throughout these forty days, I would add that for someone who is convinced the cloth is pure fakery, it seems odd that so much time would be devoted to being involved. Freedom of choice, certainly, but for an event like this, why bother?.","date":"2013-03-30","mins":"7:53 am","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","title":"Awaiting Live Stream from RAI Uno"},{"id":"comment-50303","author":"kelly_kearse","post":"Great job, as always, Barrie. Thanks for sharing the personal details of your life before and after you became involved with the Shroud..","date":"2013-11-07","mins":"10:43 am","url":"https://shroudstory.com/2013/11/06/barrie-on-ewtn-liveand-again-in-repeats/","cat":"event","title":"Barrie on EWTN, Live–and again in repeats"},{"id":"comment-193546","author":"kelly_kearse","post":"John Klotz wrote: “Blood was discovered on the Shroud. One of the processes used was multi spectral analysis. Initially it was identified as primate blood but further investigation it was determined to be human.” Remind me again what specific experiments conclusively determined the blood was human..","date":"2015-03-16","mins":"6:21 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193642","author":"kelly_kearse","post":"David Goulet wrote: “while human blood on the Shroud would hardly be surprising in the fourteenth century, no significant replicated evidence has been found to support that there was.” That’s another minor detail that piques my curiosity. If blood was added to the Shroud in the medieval era, why is it so degraded that we can only claim, with some certainty, that it is primate blood? I would expect the blood, if it is ‘only’ 600 years old, to still be more useful forensically. Perhaps Dr. Kearse can provide some insight on that question. Hi David, My comments: 1. The main issue regarding the primate vs. Human issue is not related to the relative age of the blood older: 2,000 yrs. Versus relatively newer 600 yrs. Blood. Rather, it stems from the fact that the antibodies in use at the time were not capable of distinguishing human blood versus that of closely related non human primates. This would have been the case even if freshly drawn samples were evaluated. Monoclonal antibodies that effectively distinguish human blood from closely related primate blood were only recently developed (2010). The likelihood of a forger using non human primate blood versus human blood? I’ll leave that to others to speculate. I don’t believe it should conclusively be referred to as “human” without scientific clarification it stretches the data past where it should go. Adler was well aware of cross reactivity and was cautious in his interpretation. 2. It remains to be determined if blood from species other than primate/human might also be present this is a blind spot in the previous studies. The one exception is rabbit blood, which serendipitously, due to the experimental design used secondary anti rabbit antibodies in the system. 3. It’s easy to write it off as not being blood when you’re willing to ignore certain data how does one explain the immunological detection of blood constituents: hemoglobin, albumin, immunoglobulin? These are signature proteins for detection of blood components. Such studies are apart from the chemical & spectroscopic data, but of course, others will simply say all of these tests were botched or misinterpreted. Every single one of them: botched! By different investigators, still botched! 4. “The stains don’t look like bloodstains should” Even many rabid authenticists would agree. The premise of any such argument fails to take into account the effect a treated textile might have on bloodstain appearance. This is an important consideration. Anyone who is interested in finding more information on the studies of the bloodstains of the Shroud must be willing to consider all of the data. It can require some digging. And the willingness to translate manuscripts/proceedings/book chapters from other languages, such as Italian, even if it requires typing much of this in by hand. And corresponding with someone who is fluent in the language. But you have to consider all of it. Chemical studies. Spectroscopy studies. Immunological studies..","date":"2015-03-17","mins":"5:12 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193652","author":"kelly_kearse","post":"David Goulet wrote: “Thanks for the Blood 101 lesson. Very helpful. Is there a way to test/discern age of blood stains? Does blood degrade at a known rate? Simply put, is there any modern test to establish if the blood on the Shroud is older than 600 yrs?” As far as I am aware, in this age range, C 14 dating would be the best for this, but I am unsure how much sample would be required would guess much more than just a few threads.","date":"2015-03-17","mins":"8:23 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-22717","author":"kelly_kearse","post":"Dan, Not necessary, no problem :) Thanks.","date":"2013-01-26","mins":"8:29 am","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","title":"Eric J. Jumper to Speak on the Shroud of Turin"},{"id":"comment-209993","author":"kelly_kearse","post":"Fanti and colleagues discuss pollen findings http://www.dii.unipd.it/ giulio.fanti/research/Sindone/Paper%20 Valencia.pdf See also Fanti’s most recent book, with comments on DNA studies.","date":"2015-09-09","mins":"3:46 pm","url":"https://shroudstory.com/2015/09/08/new-youtuibe-presentation-is-the-shroud-of-medieval-forgery/","cat":"presentation","title":"New YouTube Presentation:  Is the Shroud a Medieval Forgery?"},{"id":"comment-25856","author":"kelly_kearse","post":"Another portion of Benedict’s May 2010 homily, “I think that if thousands and thousands of people come to venerate it without counting those who contemplate it through images it is because they see in it not only darkness but also the light; not so much the defeat of life and of love, but rather victory, the victory of life over death, of love over hatred. They indeed see the death of Jesus, but they also see his Resurrection” The entire homily may be found here: http://www.shroud.com/pdfs/Benedict%2002 May2010.pdf. I’ve looked, but I didn’t see a “P.S. I was only kidding!” at the bottom of the document. Opinions vary, but I’m not seeing any mention of ovaltine here.","date":"2013-02-27","mins":"6:06 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral"},{"id":"comment-25868","author":"kelly_kearse","post":"A question related to the Shroud exhibition itself, for those in the know: during this event, or a longer public display, is the Shroud simply raised upward and Inserted into a larger frame for viewing, or is it removed from its more permanent storage case & transferred to another (temporary) unit for public viewing? Does it ever leave the argon containing, humidity regulated environment, even for a short transfer?.","date":"2013-02-27","mins":"9:02 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral"},{"id":"comment-25871","author":"kelly_kearse","post":"Thanks Barrie, for the info. Safe travels on your upcoming trip/lecture tour that’s quite a marathon schedule, especially with several lectures in a single day.","date":"2013-02-27","mins":"10:59 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral"},{"id":"comment-25837","author":"kelly_kearse","post":"I’m not so certain that a secret decoder ring is necessary. Perhaps it is worth considering the possibility that your own views may be casting a rather big shadow here? In May of 2010, Benedict also spoke that “This is the mystery of Holy Saturday! Truly from there, from the darkness of the death of the Son of God, the light of a new hope gleamed: the light of the Resurrection. And it seems to me that, looking at this sacred Cloth through the eyes of faith, one may perceive something of this light. Effectively, the Shroud was immersed in that profound darkness that was at the same time luminous”..","date":"2013-02-27","mins":"3:20 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral"},{"id":"comment-194871","author":"kelly_kearse","post":"CF wrote: “Far more important is the evidence of the images on the outer fibrils only and the ‘large’ quantities of calcium Carbonate used to this day to seal linen before the paint is applied to the outer fibrils ( thanks STURP). Calcium or calcium carbonate? This had been discussed before. Colin Berry pointed out that he had initially raised this issue previously See previous topic “An early morning google find” A comment of mine with a direct quote is cut & pasted below. In Adler’s “orphaned manuscript”, Chemical and physical aspects of the Sindonic images, published in 2000, it says “All the types of Shroud fibers gave positive tests for only two elements, calcium and iron. However, these elements do not derive from the presence of iron oxides or calcium carbonates in the fibers…” Doesn’t seem to agree..","date":"2015-03-30","mins":"11:40 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-194948","author":"kelly_kearse","post":"Afraid you misunderstood this one. The statements I made refer to the fact that from the current studies it is unknown if blood from other species might be present in addition to primate (human). That is all but one: Rabbit. In certain experiments, labeled antibodies directed against rabbit immunoglobulin were used to detect primary unlabeled antibodies (made in rabbits), a common sandwich approach. Controls using secondary labeled antibodies only would have detected any endogenous rabbit immunoglobulin present. Was not observed..","date":"2015-03-31","mins":"5:15 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-194965","author":"kelly_kearse","post":"Thanks, Kelly, for the clarification. Sure, you’re welcome.","date":"2015-03-31","mins":"9:17 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-9053","author":"kelly_kearse","post":"For anyone who’s never heard the Shroud Encounter, it is an excellent, fast paced, engaging presentation well worth attending highly recommended.","date":"2012-03-07","mins":"7:28 pm","url":"https://shroudstory.com/2012/03/07/shroud-encounter-coming-to-just-about-anyplace-near-you/","cat":"event","title":"Shroud Encounter coming to just about anyplace near you"},{"id":"comment-9819","author":"kelly_kearse","post":"There is an excellent podcast on http://www.catholiclab.net, originally broadcast on 2/4/12, entitled “The Greatest Story Dawkins Doesn’t Get”, which takes issues with many of the major points used in the Dawkins style of reasoning. All podcasts are free for download. Lots of good stuff there that address various issues on the conflict (NOT!) between faith & science. Also a (much earlier) episode on the Shroud if you scroll down..","date":"2012-03-31","mins":"9:24 am","url":"https://shroudstory.com/2012/03/31/speaking-of-issuing-challenges-to-dawkins/","cat":"event","title":"Speaking of issuing challenges to Dawkins"},{"id":"comment-162730","author":"kelly_kearse","post":"Hats off to Joe Marino & the committee. I enjoyed the presentations & the discussions both inside & outside the conference room. Also, the opportunity to meet many people. My only regret is not taking a selfie with Dan Porter..","date":"2014-10-15","mins":"8:58 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-26115","author":"kelly_kearse","post":"Regarding previous comments above, and those in the previous post on the meaning of B XVI’s remarks and intentions: Is it unreasonable that both science and faith may be used to “decode” certain mysteries of the Shroud? This announcement is made under the banner of “The Year of Faith”. Many are naturally drawn to the Shroud because of the importance that faith plays in their life. The rational scientist is able to effectively realize that faith and science speak to different types of understanding. Is it necessary to declare the foolishness of all others who don’t agree with a personal viewpoint? The Shroud image may have been formed by a natural process(es) currently defined in a science textbook, that has been sitting on the shelf for years. If so, the answer is sitting there waiting for someone to connect the dots maybe. Maybe there are a lot of unknowns that still remain. The image may have been formed through the transformation of a dead body into a living one by an unknown process; after all, the resurrection of Christ is a cornerstone of the Christian faith. Some believe that the Shroud is a testament to this event. Will science be irreversibly corrupted by considering/exploring this possibility? I don’t think so. Why be threatened by it? Science can speak very well for itself if such ideas are total folly, then the data will be also eventually all interpretations reach a consensus. The Church as stated in the Catechism, declares that “methodical research in all branches of knowledge, provided it is carried out in a truly scientific manner and does not override moral laws, can never conflict with the faith, because the things of the world and the things of faith derive from the same God.” I am a firm believer in the laws of science. I am not convinced, though, that we have exhaustively delineated all of the scientific principles that may exist. I would suggest considering the possibility that we have only just begun to scratch the surface. Cell phones and modern aircraft would have been unthinkable several hundred years ago beyond laughable to most. Perhaps there is more scientific knowledge to come? Or maybe we’ve peaked in 2013? I sure hope not….","date":"2013-03-01","mins":"6:31 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26199","author":"kelly_kearse","post":"I don’t feel it’s necessary to defend my or anyone else’s competency or honesty in science. I see it more as being objective, clearly there’s a difference of opinion, I’ll just leave it at that.","date":"2013-03-02","mins":"8:33 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26330","author":"kelly_kearse","post":"In response # 49 above, Yannick Clement makes the analogy between scientists who believe in the Resurrection and Nazi scientists in World War II…utterly amazing it is difficult to put into words how extremely offensive this is.","date":"2013-03-03","mins":"10:12 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"}]
