[{"id":"comment-181489","author":"kelly_kearse","post":"L wrote: “The most important thing is that blood was detected on the Shroud.” Yes. The related portions of part 1 of this paper/discussion are built on various assumptions, creating a type of reverse domino effect: “the identification of human hemoglobin, human albumin, human whole blood serum, human immunoglobins, and human DNA from the man’s blood marks”. Should be some clarification here: human, human, human, etc. Was this truly demonstrated? Cross reactivity in immunoglobulin, albumin studies precludes a definitive answer from the data. Adler was appropriately cautious in his interpretation (at least primate). This goes beyond that. Opinions, assumptions have to be screened out. Relatedly, the above sentence refers to “human hemoglobin” Was the hemoglobin characterized relative to species in these early studies? Human whole blood serum again, species characterization how? Finally, “DNA from the man’s blood marks”. Is this a scientifically valid statement? What specifically demonstrates that the DNA is from the blood marks of the man? One can’t and shouldn’t push the data beyond what it objectively shows. Part 2 illustrates the complexity of variables that exists in trying to re create a collection of unknowns. Unknowns on the transfer or application of blood. Unknowns on the potential effects that the cloth may have on the results. Some combination of the two. Multiple potential variables could be involved. These are general observations I enjoyed Dr. Lind’s presentation at the conference..","date":"2015-01-05","mins":"1:48 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181599","author":"kelly_kearse","post":"JG wrote: “How do we know when the DNA was deposited? It could had happen at any time within the last 2000, or if you perfer 700 years. Why do you think they are so careful at a crime scene?” I agree it’s one of the limitations that has to be considered when evaluating the data.","date":"2015-01-06","mins":"5:53 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181513","author":"kelly_kearse","post":"(L)ouis wrote: Addressed to Dr. Kelly Kearse; Hi You can refer to me as Louis (if you are allowed to) as I a human, not Yahveh to be addressed as YHVH. I presume that you have read this interview: https://www.academia.edu/8841978/Professor Giulio Fanti discusses the controversies in the realm of Shroud studies where two questions and responses dwell on DNA. Your opinion is important because you are an immunologist with a Ph.D and one response in the interview says that human DNA examinations have been conducted. We do not have complete details, and all I know is that the material was examined in a laboratory. Do we need a peer reviewed paper on this examination, or is more needed? Thanks. Hi Louis, L was just an abbreviation, a victim of the texting age IMO, whoops sorry, In my opinion I believe we need both. As a former research scientist, I cannot imagine not wanting to write up original research with the goal of publication in a respected peer reviewed journal. This is how I was trained. Among professional scientists, if it isn’t published it basically doesn’t count, or at least you don’t get credit for it. And that’s just where it starts, whether it’s valid or not, time will tell. Peer review takes some knocks it’s not perfect, but it’s the respected, established system among professional scientists. A key step in Shroud science gaining more credibility, respectability is the publication of new, original research in peer reviewed scientific journals. The best approach a scientist can undertake with his or her particular hypothesis/idea is to try to design experiments to prove themselves wrong; it broadens one’s objectivity to play the devils’s advocate regarding his or her own research. Subjecting your work to peer review is part of this Ideally, it is continually ongoing (with the primary investigator and him/herself & colleagues) as the research progresses and develops. I think it is great that the possible information that could be gained from DNA analysis is being considered. Contamination, degradation could be challenging issues, but one doesn’t know unless one looks this seems especially relevant given the advances in molecular biology in the past thirty, even ten years ago..","date":"2015-01-05","mins":"7:47 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181691","author":"kelly_kearse","post":"Louis, Thank you very much for your kind words I look forward to hearing about your studies as they develop.","date":"2015-01-06","mins":"7:01 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181692","author":"kelly_kearse","post":"TH wrote: “I can try with my own blood. But, sorry, my hair is not long enough ; ))” An instant classic.","date":"2015-01-06","mins":"7:03 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181802","author":"kelly_kearse","post":"Thomas wrote: “I’ve never been that convinced by the blood on the head. I think it was added on. I do not think this in anyway compromises a notion of authenticity for the image and possibly other marks. People tend to look at the shroud in black and white terms.” All head marks or just specific ones? Not a challenge, just interested in your viewpoint, i.e. Other blood marks (located on head or other areas) were originally there, and touch ups, additions were made, or do you believe all blood marks were applied, added on? If certain ones, is this based on color differences or mainly flow pattern/just doesn’t look right? No bait trap involved, just interested in your opinion. If touch ups, additions in only certain areas, this would be relevant to the color issue(s), specifically as it pertains to the influence of the (processed, treated) cloth on the blood appearance (van der Hoeven). As mentioned in the STL presentation (mine), technically the previous studies only demonstrate that primate (human) blood components are present, with the exception of one other species (serendipitously), they don’t evaluate the possibility that non primate blood components from other species might be present. Not a criticism here, it’s just the nature of the particular experimental design. This could be done serologically (using antibodies) and there are ways to set it up that help to minimize the amount of sample required. A potential spin off benefit of DNA analysis is sequence data of specific genes (that differ in certain regions among various species) could possibly address this as well. Anyway, was just wondering if you thought the touch ups were selective, and if so, which ones..","date":"2015-01-07","mins":"6:43 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181810","author":"kelly_kearse","post":"David Mo wrote: “This is a paradigmatic example of collective blindness. Carlos doesn’t see any blood on the nape (“Nuca”, Carlos. O “parte occipital del cráneo”, si lo prefieres)”. And OK presents here a big area soaked. The blood trickles of the picture run straight down only when they reach the skin without hair. And not one takes the form of spiral going from right to left.” Aren’t there are lot of assumptions being made/dismissed here, variables to be considered that at least place this is the grey area? For example, could sweat, grime, dirt have any influence on blood flow? Hair sticking (even lightly) to the skin? What about handling of the body? Could wrapping a facecloth over the head disturb anything? Cradling/handling the head when taking the body down? Supporting the head while placing the body in the cloth? Was the face washed/wiped in any way? Was the hair anointed with any oil, smoothed out? Is it remotely possible that a spiral type pattern in this area could be the result from any of this? Or must it simply be painted on because it just has to be? Is it valid to assume that the blood patterns here were completely unperturbed? Is it really that black & white, either way?.","date":"2015-01-07","mins":"7:47 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181899","author":"kelly_kearse","post":"C. Reid wrote: “My question is then (unless I misunderstood you), if we are not sure it is human male blood, what would be the chances that it would be?” I don’t know, suppose it depends on one’s viewpoint. If the Shroud is authentic, both must be true. If the Shroud is not authentic, both, one, or none could be true. As the blood classified as at least primate, it certainly makes it more favorable, consistent, more likely with the possibility that it’s human. That would certainly be the most reasonable explanation. Male vs female from existing data???.","date":"2015-01-07","mins":"3:52 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181861","author":"kelly_kearse","post":"C. Reid wrote: “I thought the blood was confirmed to be human male blood of the AB group? I remember reading that Dr. Adler said that it was “Primate”, but that Prof. Baima Bollone confirmed it to be human AB blood?” My Comments: 1. Human male blood this is based on the DNA sequencing results reported by Dr. Garza Valdes in his book, the DNA of God. In these studies it cannot be determined if the DNA signal originates from the blood sample or is due to contaminating, exogenous DNA. Partial sequence of a hemoglobin subunit was also reported (same study) this doesn’t help, this gene is expressed in other cell types, including skin cells. Only real scientific conclusion that can be made here is there is human DNA on the Shroud. Is it human male blood? Still unknown (my opinion). AB group this is based on the studies of Baima Bollone, published in a Shroud specialty journal. Two different methods were presented, forward typing & reverse typing. Reverse typing is especially problematic in aged samples. Two complementary tests are really needed for a firm conclusion. Forward typing results suggest AB, but needs to be confirmed by additional methods (my opinion). Professor Baima Bollone confirmed it to be human AB blood the antibodies BB used were raised against human proteins, however, such antibodies, especially those in use at the time, are infamous for cross reacting with the same molecule in other species. This has to be tested directly for any antibody that is used.. Cross reactivity was experimentally addressed by Adler, hence the designation “primate.” This issue was never explored in BB studies (at least not reported). It is a very safe assumption that such antibodies cross react with molecules from similar species. The designation on the label of such antibodies “anti human” only refers to the particular protein the antibody was made against. Cross reactivity has to be directly examined. It’s very similar to having your own house key and feeling very good about it as you lock the door, but then four people show up and three of them have different keys that also open your front door. It can be a game changer. By beating the primate drum, I am not endorsing the idea that a forger rounded up a barrel of monkeys for his or her use. I just don’t think conclusions should be stretched beyond what the data truly show..","date":"2015-01-07","mins":"12:07 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181926","author":"kelly_kearse","post":"David Mo wrote: “Of course. We can enumerate many other circumstances: rain, temperature, wind, form of the tomb, structure of the bones… But no one of them has anything to do with our problem. I don’t understand what influence could have the anointing, sweat, dirty, etc., on the creation of this mark: I remember you that this is the alleged trace of a wounded head resting on a cloth, that puts pressure on it. Dr. Baden said that that is impossible. I don’t need seven years of study of medicine to absolutely agree with him. I have two children and I have seen and healed some wounds along my life. In any way, my objections would be overcome if someone can put here a similar case to the Shroud with similar traces.” I think certain variables (sweat, dirty, handling, etc.) could have an effect on the appearance of a bloodstain. There are several books by Ricci who diagrams blood flow patterns relative to the Shroud; I remember one section in particular where he illustrated how handling of the feet could influence the overall appearance of the stain. Dr. Baden says its impossible. Other physicians, pathologists say the bloodstain appearance, pattern its well within reason, nothing abnormal jumps out out them. What to do there? Being relatively tall and prone to sudden bursts of jumping upward in low places, I frequently lacerate my scalp seems to be quite a bit of variation regarding blood traces not always exactly the same. (no hair involved). I suppose Jackson working backwards with colored in bloodstains on a cloth wrapping a model of the body (to illustrate alignment, conformity) isn’t quite what you’re looking for. Yes, would be nice if someone recreated similar traces to match the Shroud to address these types of objections..","date":"2015-01-07","mins":"7:10 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"}]
