[{"id":"comment-77570","author":"kelly_kearse","post":"Hugh Farey : Well, that’s what I’d like to discuss with a pathologist. Although Jesus had been subjected to a lot of violence, he had not necessarily “used up” a lot of ATP. Carrying a patibulum may have been muscularly exhausting, but being pinned to a cross, however painful, may not have been, in the way that the viigorous struggles of a drowning man or someone running for his life may be. From my ignorance, I cannot deny that instantaneous paralysis of the legs may be possible, or even likely, but I’d like to know more. I’m not an “expert”, only my opinion, but much went on pre patibulum carrying: sweating blood in the Garden, beating, scourging, assumed lack of/poor sleep & feeding, dehydration, etc. Then crucifixion. The cumulative affect should be considered here..","date":"2014-02-08","mins":"6:15 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-65613","author":"kelly_kearse","post":"Baima Bollone reported the presence of myrrh (and aloe) on the Shroud using immunofluorescent techniques; STURP (Rogers), on the other hand, using chemical methods reported a negative finding. In the BB studies, rabbits were immunized with myrrh extract. The antisera generated in rabbits are polyclonal, the products of many different cells (clones), meaning that multiple specificities will be represented in the sera. More modern immunological techniques have the advantage of utilizing monoclonal antibodies (products of a single clone), where the specificity is more defined. This on its own is not really a concern, but together with the fact that an extract was used for immunization (as opposed to a purified protein), it does urge some caution regarding exactly what the reactivity consists of. I would like to see the specificity more defined. This particular antisera was not obtained commercially, where the specificity is often more detailed. The anti aloe, anti myrrh results were compared against non immune serum as a negative control (that’s good), but were not cross checked against each other in experimental stains (that would have been good). So, in my own opinion, and that’s all it is, I would take it with a grain of salt maybe, maybe not. I would like to see more specificity defined here. Also, I believe that others have mentioned that burial spices may have been placed around the body (in bags or jars?) I am not sure if this is in addition to or instead of being smeared on the body/cloth. Regarding the kinetics of the image, that’s a very interesting question I believe the disciples might have kept the cloth either way..","date":"2013-12-23","mins":"9:32 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","title":"Did the Apostles Notice an Image on the Cloth?"},{"id":"comment-77855","author":"kelly_kearse","post":"The physiological variables comparing an individual running, drowning, or other instances and Jesus’s experience according to the gospel narratives are numerous and unknown. Related in general, yes, but a direct comparison is difficult, to say the least (not that any of the above discussion, isn’t important & valuable it is an interesting topic). But go upward as it were, is it likely that a a forger creating a statue or bas relief would think to include specifics such as the bilateral expansion of the chest and distension of the lower abdomen how evident would such details be in the normal (non negative) image on the cloth?.","date":"2014-02-09","mins":"4:42 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77896","author":"kelly_kearse","post":"Hugh Farey : I agree that a medieval artist would be most unlikely to have faithfully copied a body in traumatic rigor mortis. However there was certainly a Byzantine artistic tradition showing quite a distorted body, with pronounced features such as a high chest and distended abdomen. Of course, if the shroud is authentic, it could be said that their features derive from the shroud, but those art historians who think it medieval think it fits in well with that artisitic tradition. It’s a moot point, I think. In such depictions are the distortions specific for Jesus, or are other figures similarly morphed Was the artist’s intent to single out those details or is it in keeping with the overall style are these features really that discernible in the light version of the image? Is the abdomen depicted as distended or more akin to showing a six pack of abs? For myself, I’m not sure it can be objectively dismissed as a moot point, but I respect your opinion..","date":"2014-02-09","mins":"7:51 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77905","author":"kelly_kearse","post":"Compare also with depictions of Adam & Eve alive & kicking, with chest, abdomen visible; also John the Baptist, done during this time period more a hallmark of artistic style, or intentional depiction of rigor? Points, questions are rhetorical, a type of Post Script to comment #49 seems a big stretch, IMO, but to each his own. Got to go the Beatles are coming!!! The Beatles are coming!! 50 years ago what a game changer….","date":"2014-02-09","mins":"8:35 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78071","author":"kelly_kearse","post":"“This is very simple proof…” I agree. That’s the problem. Too often, issues such as these are made out to be as simple as a + b = c particularly as dictated from a “scientific standpoint”. While a + b may equal c, a may equal a1 + a2 + a3…., etc. The truth is there are many unknown variables. Some we may recognize, some we may not even realize they exist. No one knows, when/how the body was taken down, if the body was carried to the tomb while attached to the patibulum, or not, when the nails, crown of thorns was removed, if, how the body was washed, etc. It’s not simple “proof” of anything. The unknowns are significant. “Hoplesslessly over the hair”, this pattern is an impossibility, under any circumstance how do you know it’s only “over the hair”, that there’s not a contrail of blood underneath? A body with scalp wounds could never, under any circumstances result in that type of pattern? How do you know? Was the hair wet or dry? Evenly moist throughout? The only thing that’s hopeless is when “experts” pretend they know exactly how everything works and that it’s so open and shut. Take such arguments into a scientific arena and you will be asked to show how you know, what evidence do you have to support this? I am not convinced that it looks contrived, sorry. It could be, but I think there are too many unknowns to make a firm conclusion, but to each his own. Regarding the issue of rigor being irrelevant, it’s also a matter of perspective, but Hugh introduced the issue that rigor had not yet set in regarding the lower extremities (this could include the buttocks, or not). I, in turn, raised the issue, okay, moving on from the geet, what about the upper body (chest, abdomen). Would one making a sculpture include such a detail on the cloth, and is it that discernible to the naked eye? Irrelevant? If you want it to be, it can be, sure..","date":"2014-02-10","mins":"12:08 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78074","author":"kelly_kearse","post":"#61, “geet” equal feet, sorry as is evident, I would have made a lousy forger.","date":"2014-02-10","mins":"12:15 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78128","author":"kelly_kearse","post":"I’ll leave it to others to decide who is a troll and who isn’t trolls come and go with the cyberspace territory, but for every troll that may or may not lurk in the overgrowth, it is also possible that there are others who read a posted comment and either learn something new or think about something they knew in a different light. Everyone has to decide if it’s a waste of time for them or not. Time permitting, I post here when the topic interests me. I believe you can learn from everyone even if you think they are completely full of it or full of themselves. I also believe it is relatively boring to discuss things over & over with people that completely agree with you. Of course, no amount of arguments will convince “those types”–I would never imagine as such it’s not my intention everyone’s free to think what they want to to be an “expert”,or to wax and wane about how “real science” works, etc.,This is a blog it is not a scientific department meeting or branch seminar it’s important to keep that in mind, at least I think it is it’s helps to put things in perspective. Thx for the crown of thorns link.","date":"2014-02-10","mins":"4:50 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-28369","author":"kelly_kearse","post":"Maybe the issue is really “actual hemoglobin” versus “intact hemoglobin”. The presence of hemoglobin was identified by Adler & colleagues based on the spectra of the characteristic Soret band, indicative of the heme group, which, in turn, is indicative of hemoglobin. Adler was a porphyrin expert it is natural that spectroscopy would be the primary technique used in characterizing that the stains contained blood products. I am not certain, but I do not believe that actual “intact” hemoglobin versus certain hemoglobin fragments containing the heme group could be effectively distinguished by this technique. Not a knock in any way towards Hugh at all, but in terms of a general comment, I think it’s relevant to consider that the scientists studying the Shroud samples during this period were working with relatively limited amounts of material the primary issue was to establish if the stains were, in fact, actual blood and if so, from what species..","date":"2013-03-25","mins":"9:21 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"}]
