[{"id":"comment-176477","author":"kelly_kearse","post":"HF wrote: “Have a look at this. Http://i.imgur.com/WI7 Obvl.png. It illustrates a considerably more accurate verson of a 2 D image forming a 3 D face than the Shroud. It is simply not true that the Shroud is a “good” subject for this kind of interpretation, looking, as it does, so much more like a bas relief than a realistic full depth model of a head when imaged in Image J. Comments welcome!” Comments: I think it should primarily be considered that however the Shroud was created, the end objective was not to create a type of (accurate, detailed) 3 D projection when analyzed by modern technology. It’s easy to work backwards and find conditions that render more appealing images, because the end result is the goal. I visited Kevin Moran one summer (who has a VP 8 in his garage) and brought along a few photos to try it out. I tried to choose those that had prominent contrast, my top pick was the CD booklet/cover of the first Beatles album, Meet the Beatles, featuring black & white head shots. 3 D features were apparent (John was the best, the other three, in my opinion were mediocre don’t know if they could be identified without knowing who they were), but it wasn’t great some distortion in each of the four was evident. The Shroud photos we placed looked identical to those in Heller’s book, collectively more detail was maintained throughout & more 3 D effect was obvious. The caption under the “control” photo of William Ercoline in Heller’s book states regarding “gross distortion of all features and the two dimensional quality” of other photos, that “the only exception is the Shroud”. Overhyped? I suppose it may be a matter of opinion clearly, you can see 3 D effects of some sort in various artworks (bas relief, painting) using this technique. I took it to mean that the degree of detail is what makes it “unique”, not that it is an “absolute”, one of a kind in possessing any aspect of this characteristic. I think most would agree if it isn’t a “unique” property, it’s certainly an interesting one. Difficult to imagine an artist, at least a painter, taking this into consideration, or even occurring via coincidence, particularly to such detail of course, it may have only resulted after the paint had (relatively uniformly) flaked off, true appearance of the original being down the rabbit hole as it were; My own opinion is that it points more strongly to the cloth covering a three dimensional form (whatever one thinks this is). Using software to convert light/dark flat circles into conical towers is impressive it certainly isn’t apparent just looking at the flat shape, but I think even a skilled artist working a priori and with hand held equipment would have screwed it up somewhere, at some point in the face, along the length of the body and some distortion/misalignment would be apparent..","date":"2014-12-14","mins":"7:48 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-176670","author":"kelly_kearse","post":"HF wrote: “I’m afraid I find Kelly’s last comment ironic. “I think even a skilled artist working a priori and with hand held equipment would have screwed it up somewhere, at some point in the face, along the length of the body and some distortion/misalignment would be apparent.” To me, he did screw up, he did fail to appreciate a true brightness/distance correlation, and there is considerable distortion and misalignment, both in the face and along the length of the body.” Problem is how do you know what’s considerable it’s extremely subjective in nature morever, by any of the proposed authentic mechanism one wishes to believe in (Maillard, energy/light, other) do you really know that “considerable distortion & misalignment” would not exist in any of these cases? What would those look like? How does one know?.","date":"2014-12-15","mins":"10:11 am","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-175880","author":"kelly_kearse","post":"No worries I’m probably the only one who noticed you didn’t respond specifically to the questions similar to those raised previously, esp. No protein = no gesso = no mas. Keep results that agree, discard those that don’t. Same old, same old. No interest in beating a dead rabbit.","date":"2014-12-12","mins":"6:37 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175969","author":"kelly_kearse","post":"TH wrote: “But don’t expect any precise answer from Charles. “Different micros copyists with varying levels of expertise have come up with different opinions as to whether there is vermilion on the Shroud.” is the only kind of vague answer you will obtain from Charles. For example, I am still waiting for his answer to the question of lack of any kind of protein on the Shroud (except in blood stains) Unfortunately, Charles is “stuck” to his hypothesis despite the many scientific proofs of its falsity.” Yes anyone can try on a lab coat and talk in nonspecifics I was being facetious when I mentioned I was probably the only one who noticed very transparent when multiple layers of triple speak are used to avoid giving a direct answer to specific questions/detail, especially in a scientific context..","date":"2014-12-12","mins":"5:58 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175772","author":"kelly_kearse","post":"In this “probably vermillion”, I’m curious as to how one explains: 1. Where did the mercury go (elemental analysis, x ray data)? 2. Why would hemoglobin, serum albumin, and immunoglobulin be present, as detected by chemical, immunological methods? Were these added in as thickeners? 3. Halo rings around a number of bloodstains, as revealed under uv? Does using vermillion naturally give this or do you have to add this in separately? Why add this detail, even if just to a few? What substance was used for this? In the American Chemical Society Advances in Chemistry 1984 article with multiple co authors, received for review Oct 1982, accepted for publication April 1983, one will find a balanced, objective, scientific approach investigating the possibilities of what the various stains and images on the Shroud might and might not be. From a scientific standpoint, the gesso vermillion hypothesis is simply too flaky.","date":"2014-12-11","mins":"5:51 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-99580","author":"kelly_kearse","post":"Much simplified, but the color is a property of the presence and arrangment of double bonds. Double bonds result from the sharing of electrons (two pairs). Oxidizing and reducing agents function by promoting the loss or gain of electrons this alters the original electron arrangement. Altered arrangement results in loss of color..","date":"2014-04-15","mins":"11:22 am","url":"https://shroudstory.com/2014/04/15/good-chemistry-questions/","cat":"science","title":"Good Chemistry Questions"},{"id":"comment-35967","author":"kelly_kearse","post":"Yannick, Thank you for appreciating my prudence, and I think that you also “must recognize a simple fact”: It is very transparent when someone is merely repeating the observations and results of others versus someone that is applying scientific reasoning and logic to the analysis & interpretation of data. They are not the same thing. The answer is not always WDRD: What did Rogers do? And I would recommend some meditation on Dave Goulet’s comments your back pocket is not as securely fastened as you would like to believe. It is quite remarkable being regularly lectured about how science operates by someone, who himself, is not a scientist. This is compounded by the fact that all too often these viewpoints are projected in what rings of a condescending tone. But, what does that really matter? It speaks for itself, eh? Let’s get back to the business at hand: Regarding the pig experiment, YC: 1. Someone argues that there was a nearby factory that was releasing amines into the air those day. Can you rule that out? 2. Someone argues that just soaking a cloth in Saponin & placing it outdoors face down in the sun at that latitude & longitude on those days causes the same coloration as was observed. Can you rule that out? 3. The pig that was used in that particular experiment (pig #245557) was donated to the lab the prior afternoon, having died from overexposure to toxic levels of ammonia is that a problem? 4. A security guard working the midnight shift reveals that he accidently tripped on the carcass sometime around 2:15 am that final morning. Being startled, he instinctively reached for his high grade flashlight (a Cobra mega blaster), and admits that he “might have discharged an intense light beam” onto the cloth, but only for an instant. “I was scared!”, he said, “I didn’t mean to, okay?” Seriously, when this experiment was first made public on the blog, while bemoaning the lack of controls in the edited version; and acknowledging in Barrie’s defense that one never knows what ends up on the cutting room floor, I also applauded the effort for moving forward in the direction of original research. The pig experiment wasn’t a great one it’s somewhere on the scale of a science fair type project, give or take but as others have acknowledged, even to the points of prudence and overzealousness and all points in between, the effort was there. That is something and that is important. Finally, Yannick, can you drop the Mr. Kearse business and just call me Kelly or Kel as most of my friends do?.","date":"2013-06-03","mins":"7:21 pm","url":"https://shroudstory.com/2013/06/03/a-completely-inappropriate-experiment-nice-white-lab-coats-anyway/","cat":"image_theory","title":"A completely inappropriate experiment. Nice white lab coats, anyway"},{"id":"comment-35926","author":"kelly_kearse","post":"Barrie is appropriately cautious in his conclusions even italicizes the word could. Anything past this is total speculation. There are multiple issues in the experimental set up that were pointed out by Barrie, but the major fatal flaw is the failure to include a Saponaria treated cloth sans piggie. This is an essential comparison otherwise it is impossible to distinguish if a Saponaria treated fabric, in of itself, placed outside under these conditions would show similar results, apart from any contact with a pig..","date":"2013-06-03","mins":"2:50 pm","url":"https://shroudstory.com/2013/06/03/a-completely-inappropriate-experiment-nice-white-lab-coats-anyway/","cat":"image_theory","title":"A completely inappropriate experiment. Nice white lab coats, anyway"},{"id":"comment-35989","author":"kelly_kearse","post":"Luis, My own personal opinion is that the Shroud is probably real. I still leave open the possibility that it could be fake for me that would be a relatively small one but I try to remain open minded to both possibilities. I don’t believe that science can conclusively prove that it wrapped the body of Jesus, but in my opinion, the evidence supports the idea that the cloth wrapped the body of a beaten, scourged, crucified man. Those that knew Dr. Adler could speak more directly to his beliefs than me, though my perception is he favored authenticity as well..","date":"2013-06-03","mins":"9:52 pm","url":"https://shroudstory.com/2013/06/03/a-completely-inappropriate-experiment-nice-white-lab-coats-anyway/","cat":"image_theory","title":"A completely inappropriate experiment. Nice white lab coats, anyway"},{"id":"comment-191574","author":"kelly_kearse","post":"So, there’s a medieval artist, tentatively dubbed Nairb Ial, who paints a negative image, negative to mimic transfer of an body image to a cloth. Which originally has a loin cloth & a crown of thorns, that has entirely flaked off, but the main body image remains, which has also flaked off, but not to the same extent. Anticipating the future disappearance of the loin cloth, Nairb includes scourge markings on the upper parts of the thighs (ventral & dorsal sides) as well as the buttocks (dorsal side). Nairb was a true visionary, not only having the foresight to include undercover scourge markings, but potentially anticipating the advent of photography as well, as he knew these, as well as other details would be much enhanced in the negative of the negative image, as it were. Or perhaps these undercover scourge markings were added at a later time by a great great grandson, Nairb the 3rd, when the last trace of the loin cloth flaked off. As a footnote, the elder Nairb is also believed to have used a type of protein less gesso technique in his creation, possibly garnered from rabbits that were raised on a very, very specialized diet. Time for some serious BAS relief on this one, as in British Art Society relief..","date":"2015-02-22","mins":"1:10 pm","url":"https://shroudstory.com/2015/02/21/colin-berry-stop-calling-the-faint-image-a-faint-image/","cat":"image_theory","title":"Colin Berry:  Stop Calling the Faint Image a Faint Image"},{"id":"comment-191579","author":"kelly_kearse","post":"Hugh, Yes, of course that kid is pretty amazing.","date":"2015-02-22","mins":"2:34 pm","url":"https://shroudstory.com/2015/02/21/colin-berry-stop-calling-the-faint-image-a-faint-image/","cat":"image_theory","title":"Colin Berry:  Stop Calling the Faint Image a Faint Image"},{"id":"comment-20164","author":"kelly_kearse","post":"Thanks for posting the link to the paper. I enjoy reading this In any of the UV or VUV experiments, have the samples ever been: 1. Treated with a strong reducing agent, such as diimide, to reverse the coloration (similar to what Adler showed for Shroud image fibers). 2. Daubed with blood, allowed to dry, then treated. I mention this in reference to the blood blocking the image formation (as suggested by proteolytic digestion experiments); and also to determine if there is any effect on the color of blood color in this system (unlikely? but perhaps worth noting). Just wondering Russ maybe the mimicking of a Shroud like coloration with laser pulses is something you might use in your Secrets of the Shroud presentation.","date":"2012-12-10","mins":"6:30 pm","url":"https://shroudstory.com/2012/12/10/enea-magazine-special-edition-new-paper-on-shroud-of-turin-conservation/","cat":"image_theory","title":"ENEA Magazine Special Edition: New Paper on Shroud of Turin Conservation"},{"id":"comment-20201","author":"kelly_kearse","post":"Gabriel, Thanks that helps, wasn’t aware of that.","date":"2012-12-11","mins":"7:05 am","url":"https://shroudstory.com/2012/12/10/enea-magazine-special-edition-new-paper-on-shroud-of-turin-conservation/","cat":"image_theory","title":"ENEA Magazine Special Edition: New Paper on Shroud of Turin Conservation"},{"id":"comment-52660","author":"kelly_kearse","post":"There is a general misconception that typically exists regarding the significance of “removing the gloves” in reference to boxing. True, gloves do minimize facial damage when hit. However, the main reason that boxers wear gloves is to protect their own hands. Boxing gloves are specifically designed to support a fighter’s wrists and pad the knuckles. If you are skeptical, try punching a heavy bag while not wearing gloves, or even wraps..","date":"2013-11-24","mins":"9:41 am","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","title":"First Annual Bertrand Russell Award in Sindonology"},{"id":"comment-52675","author":"kelly_kearse","post":"Louis : Kelly, do you think bilirubin can form images of a human body? I am presuming this is unrelated to boxing. In all sincerity, I simply do not know..","date":"2013-11-24","mins":"10:30 am","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","title":"First Annual Bertrand Russell Award in Sindonology"},{"id":"comment-51719","author":"kelly_kearse","post":"Colinsberry : Matthias : Interesting list Colin. But not really relevant to my own point. My point is that the resurrection is beyond physical laws, therefore the image was created in ways beyond our understanding of natural laws. So taking my point a step further, this will mean that if the shroud image was created by the resurrection then we will never no how the image was created because we will never be able to rationalise what or how the resurrection occurred. My belief – and it is only a mere belief! – is that Jesus’s body dematerialized, before rematerializing in spiritual form before the witnesses – and this is the resurrection. Now in the act of dematerializing, an image was formed on the Shroud. According to my belief, we’ll never be able to explain how this occurred. I don’t buy into the ‘resurrecton radiation” theory for example – it’s an example of trying to apply physical laws to a supernatural event. I realize scientists will find this all most unsatisfactory. And I am more than happy for a naturalistic theory to disprove what I’ve outlined above. It wouldn’t affect my faith. I have no problem with any of that, Matthias. My interest is not in debunking Christian belief, or, more hesitantly, with miraculous accounts of how the “real” burial Shroud came into being. My beef is with the scientists of questionable objectivity (I’m not allowed to call them pseudo scientists) who either claim that conventional science backs up the Shroud’s authenticity, or who attempt to blend science and magic to explain the Resurrection and image imprinting as a supernatural flash of radiation, and then rush to their excimer lasers, corona discharge generators, medical X rays etc etc in search of “supporting evidence”. If it’s any comfort (probably not), I too once wavered towards authenticity when reading the Sunday Times Magazine account of Rolfe’s Silent Witness, late 1970s. Rapid unwavering occurred in 1988 (radiocarbon dating), followed by indignation in November 2011 (ENEA’s pulsed uv excimer laser beams, especially the authors’ conclusion that they hoped their out of hours superficial scorching of linen would stimulate philosophical and theological debate). That was the day the icy cold sub Arctic Sibelius like music (of objective dispassionate science) died for me… Colin, If the authors of the 1988 & 2011 fully retracted their papers, would that influence your waiver? You’ve always struck me as an independent thinker, did the 2011 really rock your boat that much scientifically, or did it strike more of a personal chord? I have always considered myself a scientist who happens to be a Christian and a Christian who happens to be scientist. I don’t think it’s fair to be disqualified because of one’s personal beliefs the same argument could be used against an atheist I don’t think that’s right. I’m not trying to tell you what to do, but it might be more accurate to refer to certain data as “pseudoscience”, rather than the wholesale personal trashing of someone as a “pseudo scientist”. Even Linus Pauling slipped in the DNA hunt, you yourself pointed that out not too long ago..","date":"2013-11-17","mins":"8:24 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51724","author":"kelly_kearse","post":"Colinsberry : I’d like to oblige, but can’t, Kelly. But then I do not automatically look to the literature in order to form a view. I work from scientific first principles, at least initially. If you put a spot of blood on linen, and leave it for centuries, you may end up with little more than iron oxide from the haemoglobin, and ALL the cations plus counter ions (carbonates etc) of original blood, since they are involatile. No, I have never claimed they are specific markers for blood stains, since they are a marker for virtually any living tissue (and blood, we are told is a tissue). But they are obligatory non specific markers for any once living tissue. They have to be there, no matter how ancient the tissue, unless washed away. But washing that removed the cations (sodium, potassium, magnesium etc) would surely have smudged the bloodstains and/or washed away lot more besides, like the specific blood markers which we are told did test positive (albumin, ABO marker etc), unless, that is, one tries to import a host of qualifying assumptions about solubility etc. Sorry to be so obstinate (not dogmatic, just obstinate) but potassium cannot be swept under the carpet. There is no carpet. If it’s valid to use potassium as an indicator that suspected dried bloodstains are, in fact, composed of real blood, then there will be references to it in the literature, pure & simple. Therefore, its lack of detection cannot be used to support the view that such dried bloodstains do not consist of real blood. Work from scientific principles, initially, give me a break what is the literature based on?.","date":"2013-11-17","mins":"8:57 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51751","author":"kelly_kearse","post":"Hugh Farey : And… at http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2561112/, we find: “For example, the ratio of potassium concentration inside and outside cells in life is about 40 : 1, maintained by Na+ K+ AT Pase. After death, when there is no further renewal of the energy supply and when the integrity of cell membranes is lost, cell walls become freely permeable to potassium ions, and the concentration inside and outside cells tends to equilibrate. In consequence, serum potassium concentration rises from about 3.5 mmol l−1 prior to death to 18 mmol l−1 at 1 h, and 25 mmol l−1 at 24 h after death. Concentrations above approximately 8 mmol l−1 in life are commonly fatal, but clearly the existence of lethal concentrations before death cannot be inferred from finding them post mortem.” It appears that if the blood stains are indeed an exudate, there should be about 7 times as much potassium in them as is found in normal blood, not the vanishingly low amount actually found. If anyone is to claim otherwise, they must account for the disappearance of the potassium. Should be, could be, just looking for references where this is actually used diagnostically to evaluate aged bloodstains, dried on a cloth, not arguments, numbers about inside/outside cells, etc..","date":"2013-11-17","mins":"11:13 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51757","author":"kelly_kearse","post":"Hugh Farey : Sorry, I was busy Googling when David’s and Colin’s replies were posted. Yes, David, the lack of potassium (if true, and if it cannot be accounted for otherwise) precludes the possibility of the stains being a post mortem blood exudate, and seems to preclude the possibility that the redness is erythrocyte derived. Over to Kelly – given those two conditions, does that compromise the blood typing process, or can typing be done on serum alone? As for the molecules, Colin, I had to go back to the book to check, but molecules it is. From the NIH blood homepage: “Each human RBC expresses about 2 million ABO blood group antigens. Other blood cells, such as T cells, B cells, and platelets, have ABO blood group antigens that have been adsorbed from the plasma. In individuals who are “secretors”, a soluble form of the ABO blood group antigens is found in saliva and in all bodily fluids except for the cerebrospinal fluid. ” The serum alone/exudate issue is one that I, personally, have always taken with a grain of salt I don’t know if it must be all or none; others have described what appear to be red blood cells (reinflated ghosts) in the bloodstains I don’t believe Adler always describes it as totally devoid of such (even membrane fragments), but suggests a predominance. I’m interested in the K+ here.","date":"2013-11-17","mins":"12:12 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51752","author":"kelly_kearse","post":"Hugh Farey : “Forensic Pathology for Police, Death Investigators, Attorneys and Forensic Scientists” says: “During life, normal cell mechanisms keep a majority of potassium molecules confined inside of cells, and sodium and chloride molecules confined to the extra cellular fluid. After death, these mechanisms stop, and potassium escapes from the cells, while sodium and chloride enter the cells, until equilibrium exists.” And later: “Potassium levels within the blood begin to increase rapidly immediately after death.” If this means anything at all with respect to the shroud, it is that the blood showing low potassium levels was not the result of post mortem extracellular serum seepage, but occurred before death as a normal consequence of injury. Great, here’s a manual is this in reference to evaluating the body to determine relative time of death? Diagnostics of bloodstains, particularly aged ones, those are the references I’m requesting.","date":"2013-11-17","mins":"11:19 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51758","author":"kelly_kearse","post":"Colinsberry : At the risk of repeating myself, can you envisage an ancient blood stain that does not contain potassium , or the other physiological cations of fresh blood? If so, where does it go, given it’s non volatile, i.e. Salt like? Why the need for literature back up with something so fundamental as the difference between organic and inorganic chemistry, where the carbon skeleton of the first may finally degrade to gaseous CO2, but any sodium, potassium, magnesium, calcium etc gets left in situ, waiting if need be for future analysts to arrive, armed with their atomic absorption or emission spectrophotometers? Counterarguments, etc. Looking for references if it’s “so fundamental” they must be easy to find. It’s easier to just say # 98, than try to keep justifying it. #98 is the scientific equivalent of no mas, no mas. I need literature back up because according to Google scholar I am not certain I can go by your expertise as a blood analyst I certainly don’t trust my own, and want objective data either way, non Shroud related.","date":"2013-11-17","mins":"12:17 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51769","author":"kelly_kearse","post":"Colinsberry : This is getting absurd, Kelly. If you continue in this vein, there can be no useful debate. When have I ever claimed to have expertise as a blood analyst, or indeed in anything as regards the Shroud? All I claim is a thorough grounding in the fundamental underpinning sciences. The underpinning science says that blood cannot just lose its mineral constituents. They remain behind after everything else has gone. You do not need literature citations to back up what is plain common sense. This may be my last word to you for a time if you persist in your present style of carping criticism, of accusing me of introducing irrelevancies when it is you doing that, not me. I am trying to home in and focus on the crucial issues. Colin, I don’t consider it such an irrelevancy the subject has come up before & it was listed as a postulate in the miracle list. I have always found it interesting that potassium (or the lack thereof) in bloodstains, is referred to as a useful, primary diagnostic I am not a blood “expert” but have been unable to find references to this in other literature on bloodstains, that is not related to the Shroud. In communicating with those who know about such forensic tests, potassium was not on the radar. If common sense and built on such solid scientific underpinnings, why isn’t it routinely tested for in evaluation of dried, aged bloodstains could it be related to the limit of detection or simply that it’s not a reliable indicator? If it were, it would be routinely used in the laboratory to investigate the identity of what may be blood soaked into a fabric. So, then I don’t believe it is especially important to cite this as a weakness in the scientific studies. It is okay if it is the last word to me for a time these arguments become like trying to patch an old tire, again & again. I, too, want to focus on crucial things, which blogging back & forth, ping pong style takes time away from. Certainly, as a scientist you can understand my request for a reference in the literature in addition to asking those who work in the area, it’s where I typically go. So, let’s part on good terms consider this a digital handshake. Take care & good luck with the heating experiments..","date":"2013-11-17","mins":"2:12 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51485","author":"kelly_kearse","post":"Hugh Farey : “We know for a FACT…” Wrong. You personally might know for a fact (or FACT), but others of us are less dogmatic. Remember the 610nm spike. We cannot claim that the blood is irrefutable, any more than we can claim the scorch is irrefutable, until that awkward little niggle has been explained. You must, to use the wise words of… yourself, in the post above, TAKE INTO ACCOUNT EVERY DATA. That includes the anomalistic blood spectrum just as much as it includes the fluorescent scorch. 610 nm spike noted, what is your take on the immunological evidence tip the scale towards the possibility that it’s blood?.","date":"2013-11-15","mins":"1:35 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51495","author":"kelly_kearse","post":"Hugh Farey : That’s fine, Anonymous; your convictions do you credit. In detail (sorry), almost nothing you adduce is at all convincing to me. All the medical experts, from Barbet to Zugibe, were not working with actual shroud samples, and could not carry out chemical tests on the blood…the blood flow from the wrist could not have occurred as the wrist was jammed against the cross, nor have emerged later as the blood had drained from the hand. To you, all this speaks truth. To me, it speaks uncertainty. Not medically trained myself, nor have I ever seen a nail driven through someone’s wrist into a cross in person, but the “wrist jammed against the cross” preventing some blood flow. Is this an absolute? As a crucifixion victim struggles to breathe and pushes upward, could there not be some degree of movement/stress at the area? Is a given that a roman soldier would pound until he acheived an undisturbable vaccum seal? Zugibe did use Shroud photographs in his studies, true, but he also had significant first hand experience with wounds. If so implausible, wouldn’t this have raised suspicion in his eyes at the get go? I am fine with uncertainty, just asking. Ps any thoughts as to what 610 might be?.","date":"2013-11-15","mins":"2:45 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51500","author":"kelly_kearse","post":"O.K. : Myrrh and aloe? I’ve read that Baima Bollone used some threads with blood mixed with spices for spectroscopic comparisons. BB reported the presence of myrrh & aloe using immunological methods; Rogers looked for their chemical signature and reported their absence..","date":"2013-11-15","mins":"4:05 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51502","author":"kelly_kearse","post":"O.K. : But BB had whole threads at his disposal, while Rogers had only fibers form the sticky tapes. Sure different techniques, different materials these type of things are best sorted out splitting the (same) sample & sorting them out side by side..","date":"2013-11-15","mins":"4:20 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51531","author":"kelly_kearse","post":"Hugh Farey : For a number of live crucifixions, look up “Philippines crucifixion” on youtube. Observe the almost complete lack of bleeding. Yes, I’m sure there could be leeway between the back of the wrist and the cross, but I don’t think there would be no smudging at all. An undisturbable vacuum seal is, in my opinion, improbable. Zugibe did indeed notice that the blood flow on the back of the hand was implausible. He thought there would be a mass of blood all over the back of the hand, that the hand was then washed, and that the blood flow was subsequent to that. He illustrates his point with a photo of a tiny dribble emerging from a dead arm. He denies that the shape of the flow had anything to do with the angle of the arm on the cross. I do not find his little dribble convincing. As to 610nm, I’m still searching. No blood derivative produces it, nor any pigment I can find. It was, however measured from blood at four different sites around the shroud, and therefore not a one off experimental glitch. I’ve seen the P crucifixion footage in the past, but there are some differences a lot of those guys take it in the mid palm & for at least the ones I watched, no one saw it through ’til the end there’s also the matter of the prior suffering & shock, could this influence bleeding and/or coagulation to some extent? Would the degree of sweat & dehydration affect blood flow on the skin granted! those guys are pretty tough! but I am not so sure it’s the same, somewhat like a reenactment or approximation of a full scale war on the battlefield. BTW, what’s your opinion of the accuracy of the side wound and the foot puncture? The negative of the foot wound enhances the detail present there, difficult to discern with just the light image, at least for me. Keep searching for the 610.","date":"2013-11-15","mins":"7:48 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51532","author":"kelly_kearse","post":"The ! were unintentional it’s an i Pad thing.","date":"2013-11-15","mins":"7:50 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51534","author":"kelly_kearse","post":"Anonymous2 : I would say this is a pretty good job of falsifying the shroud. He produced the negative image and the 3 D effect. The blood is not that hard to duplicate. If these properties have been duplicated then it’s no longer “miraculous”. I wonder if this shuts down Isabel Piczek’s claim of a event horizin taking place. Pretty good job I would agree, pretty great job, no but who’s to say where it goes until the fine details are compared in parallel. I support this type of pro active, original experimentation it’s much more positive & meaningful than attaching personal slurs to the competence of anyone involved in any type of Shroud research, to try to attack the science through the back door. The blood may not be that hard to duplicate, then again it might be easier said than done though, I’d guess. I don’t believe anyone’s really tackled that one. Plus, I think it’s much easier in hindsight, working off of detailed positive & negative images what was the forger looking at? There’s also the issue of getting the colors to match & persist over time..","date":"2013-11-15","mins":"8:12 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51536","author":"kelly_kearse","post":"Hugh Farey : Ys, it’s certainly true that the Philippine crucifixions are far from snuff videos, thank goodness, and I rather doubt that there are any good videos of people being crucified to death on the internet, especially ones who have been badly beaten up beforehand. However, we have to start from somewhere. Would a badly beaten up man bleed more or less? Shock, I understand, is typified by very low blood pressure, but may encourage coagulopathy. Starting from somewhere, of course, but the variables seem many, even when trying to piece together the crucifixion & burial details in of itself. A The side wound. Blood coming out of a cut on a upright person dribbles downwards; it does not zig zag. If the ‘bloodstains’ coming from the ‘wound’ on the side are real, they must be postmortem, with the body propped up or slumped forwards. So what has happened to all the blood that emerged from the wound while it was still on the cross. Washed off? I would side with postmortem :) perhaps as the body slumped forward, a certain amount dripped off postmortem, it would not be actively pumping through the circulatory system, so would it be a lot? As for the foot, it seems completely covered, which is what I would expect from an injury at the lower end of the body. This time not washed off, perhaps. It’s all rather inconsistent. Scourge wounds, convincing? in comparison, minor wounds on calves, convincing? Belt of blood along lower back? Answer as time or interest permits, this is not an interrogation, just interested in your thoughts..","date":"2013-11-15","mins":"8:38 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51537","author":"kelly_kearse","post":"Some of my first comments were included in the block quote, mixed among your response they can be located in the spaces I’ll get this down one day I would have made a terrible forger.","date":"2013-11-15","mins":"8:40 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51647","author":"kelly_kearse","post":"Hugh Farey : Are the wounds convincing? Well, yes and no. Superficially they’re excellent, but, as I have said, once one begins to probe the details, one is left with more and more difficulties that militate against authenticity (although heaven knows, they don’t necessarily support the forgery hypothesis either). For instance, the ranks of even the most determined authenticitists are split between the “washed” and the “unwashed” (referring to the body, of course, not the people!). Setting aside those who think the shroud is a forgery, or who don’t think the blood is blood at all, I believe that few people doubt that the scourging would have left the body drenched with blood, and that the rivulets of blood down the arms, at least, were made while the body hung on the cross. In order to produce those neat little dumbbells, the body would have had to be washed – but then, why not wash off the rivulets down the arms or on the brows? Or the body was not washed, in which case how did those delicate little patterns extrude themselves through the matted blood over the back? Various semi scientists have tied themselves in knots attempting to account for this phenomenon, more or less unsuccessfully. They are clot retraction patterns, they are serum exudates, they are haemolytic derivatives and all sorts of odd variations, most of which can explain some aspects of the shroud bloodstains, but fail when applied to others. Here’s a simple experiment. Get a teat pipette of red liquid and attempt to replicate (or produce anything at all resembling) the blood belt, by some kind of natural flow. Most so called observers have assumed that the blood flowed from the sides and pooled in the middle, when this is clearly not the case. Matthias carried out some experiments on himself, dripping wine from a putative spear thrust while lying on the floor (https://shroudstory.com/2013/07/03/a book review of joe nickells the science of miracles/), but he does not say how far it trickled under his back, or whether he repeated the experiment lying on his side. My experience is that blood does not zig zag, it just drips or trickles downwards. Convincing? Well, yes and no… Got it the washed vs. Unwashed has always been a bit of a conundrum for me, I guess I would favor speed washed I appreciate your response.","date":"2013-11-16","mins":"4:07 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51539","author":"kelly_kearse","post":"This is # 62 above, with just my comments: Starting from somewhere, of course, but the variables seem many, even when trying to piece together the crucifixion & burial details in of itself. I would side with postmortem :) perhaps as the body slumped forward, a certain amount dripped off postmortem, it would not be actively pumping through the circulatory system, so would it be a lot? Scourge wounds, convincing? in comparison, minor wounds on calves, convincing? Belt of blood along lower back? Answer as time or interest permits, this is not an interrogation, just interested in your thoughts..","date":"2013-11-15","mins":"8:44 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51711","author":"kelly_kearse","post":"Colinsberry : A Category 6 miracle 4. Bloodstains being claimed to be not whole blood, but a serum exudate of blood clots, impling that soluble haemoglobin has escaped from lysed red blood cells but strangely not potassium. Hemoglobin escape but not potassium, I’m puzzled there myself. You have always maintained that Adler was out of his league, maybe he was stretching on this one. What I am wondering is are you? Forget the Shroud. Forget Adler and these diffusion enigmas. I’d like to focus on potassium in aged blood. Everyone from high school upwards knows that potassium is in fresh blood. This is aged blood, 700 2,000 years old.There is a difference. Can you produce a few scientific journal references that demonstrate potassium is used in the forensic evaluation of bloodstains, that it is a marker included for the scientific verification of blood stains, the older the bloodstains the better, but I’ll look at anything. I’ve searched and I’ve been unsuccessful. I would be interested in reading them, to see that this is truly a valid point. I’m not interested in a long response spiked with counter argument after counter argument, or some deflection to another topic been there, done that I’m just looking for references I can read I can decide for myself. References scientific articles that have nothing whatsoever to do with the Shroud. Articles about potassium in fresh blood do not qualify, they should focus on potassium in bloodstains..","date":"2013-11-17","mins":"7:39 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-33933","author":"kelly_kearse","post":"One never knows what ends up on the cutting room floor during editing, but even for a one off, some type of side by side control group is relevant (essential) to compare it to: 1. A non Saponaria treated piece of cloth on a pig or 2. A Saponaria treated piece of cloth that is not draped over a pig Even with 1 & 2 mentioned above, and realizing this is a tv program, with time constraints and emphasis on sound byte type conclusions, the effort of going towards original experimentation is an encouraging direction it would be great to see some follow up on this..","date":"2013-05-18","mins":"6:48 am","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"id":"comment-49270","author":"kelly_kearse","post":"Anonymous : And if I’m right, there is even one DNA test that was performed in Texas that showed the bloodstains were truly made of human blood material. This test never was recognized by Turin but it was really performed… The genes that were evaluated are not exclusive to blood material. These tests only show that human DNA is present on the Shroud they do not confirm that the bloodstains were truly made of human blood material the DNA could have just as easily gotten there through handling (contamination). Immune receptor gene rearrangement is unique to lymphocytes, a type of white blood cell. In all other cell types in the body, such genes remain in the unrearranged (germline) configuration this is the only type of DNA test that would truly show that the DNA originated from blood cells. Http://www.shroud.com/pdfs/kearse2.pdf.","date":"2013-10-30","mins":"6:23 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49374","author":"kelly_kearse","post":"Anonymous : You will see again the same crap coming out of close minded people like Berry and others who simply don’t want the Shroud to be the authentic burial cloth of Jesus of Nazareth and who don’t want the image to have been formed naturally. Because those people will never accept the truth of the Shroud, they will still deny the most solid facts regarding the relic, no matter how solid those facts are. And if you don’t believe me, just consider the creationists in the US! Those are the Colin Berrys and the Giulio Fantis of the evolution theory! Can’t handle a discussion of the science, attack the individual(s)…here we go again… Any scientist will concur that their own data is subject to further confirmation and extension, particularly with the benefit of hindsight and further advances in technology. More dishonor is done to their previous efforts by such a skewed defense that oversimplifies findings, than an objective review/discussion of specifics that considers alternative possibilities this is in earnest how science operates and moves forward. Science deals in the progression of ideas and pushing the explanation even further, not by putting results in a china cabinet and making them off limits to further exploration or questioning.","date":"2013-10-31","mins":"6:28 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-101776","author":"kelly_kearse","post":"Louis : Sorry I have to say this, but why are these comments being posted under the name “Alvin’. I, at least, know who is doing this. Alvinonymous?.","date":"2014-04-20","mins":"7:45 pm","url":"https://shroudstory.com/2014/04/16/remember-the-valencia-consensus-parenthetical/","cat":"image_theory","title":"Remember the Valencia Consensus Parenthetical"},{"id":"comment-101959","author":"kelly_kearse","post":"Hugh Farey : Adler reported that the image fibres were already “corroded,” while non image fibres were not corroded, even before he applied his diimide. I think there may be more work to do here. He tried all sorts of bleaches, of which diimide was the most dangerous and unstable. Remarkably, he also reported that concentrated sulphuric acid did not remove the image: in my experience concentrated acid turns cloth black by dehydration rather quickly, so I ‘m not sure what he actually did. Adler also mentions in Can Soc. For. Sci J. Paper that exposure of fibers from Saponaria treated cloth (controls) to concentrated sulfuric acid immediately turns them deep brown, “providing a simple test for such Saponaria treatment”. Not sure if this followed up on to any extent in the discussion of the paper does mention that conc. Sulfuric deepens the yellow color or image fibers over about a half an hour. Is this an indication that by this test, no Saponaria residue present,detectable on Shroud fibers?.","date":"2014-04-21","mins":"9:55 am","url":"https://shroudstory.com/2014/04/16/remember-the-valencia-consensus-parenthetical/","cat":"image_theory","title":"Remember the Valencia Consensus Parenthetical"},{"id":"comment-52812","author":"kelly_kearse","post":"O.K. : Kelly Kearse : With this model, could there have been other burial cloths that were imprinted during history? Two quick questions: do you know if their superficiality is similar to the Shroud image; also, are the images formed in that system sensitive to treatment with a reducing agent (diiamide)? There were some instances where body (or rather parts of the body) images were recorded on burial cloths. But the scarce descriptions indicate they are usually not Shroud like, and rarely superficial, most likely Volckringer patterns. The best example is now lost Antinoe image, the face image on the burial napkin which penetrated three or four layers of the cloth, as descriptions claim O.K. Thanks, in these previous burial cloths, is it known if aloe & myrrh were included? Was specifically wondering on the two quick questions if the more recently developed images (snake, etc.) done in the above studies had been evaluated for superficiality & treatment with a reducing agent. I believe aloe was included as a part of that system?.","date":"2013-11-26","mins":"9:30 am","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","title":"Running out of options?"},{"id":"comment-52768","author":"kelly_kearse","post":"Perhaps a combination of the above might also represent a reasonable option to include. Could a Maillard reaction be considered in the context of a heated/warmed statue, coated with (dipped in?) an amine containing substance? One particular aspect of a thermo statue approach that I do agree with is that it could provide a mechanism for the rounded appearance of the buttocks & calves. An alternative of this for some, might be an energetic event involving a body, in combination with the Maiilard. Maybe the answer lies in a combination of certain of the options. If a statue were used, is it reasonable to speculate that it might it still exist out there somewhere? Or is it more likely that it was melted down soon after use to cover one’s tracks?.","date":"2013-11-25","mins":"4:47 pm","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","title":"Running out of options?"},{"id":"comment-52772","author":"kelly_kearse","post":"O.K. : An alternative of this for some, might be an energetic event involving a body, in combination with the Maiilard. Yes I also thought about that. I think it is the only way to explain some of the alleged holographic properties of the Shroud, with properties at thread and fiber levels. Diffusion of some agent, activated by a mild radiation: If a statue were used, is it reasonable to speculate that it might it still exist out there somewhere? Or is it more likely that it was melted down soon after use to cover one’s tracks? Kelly, can you read (with a help of Google Translator, of course) the ending of my article (just above and below the final image)? http://ok.apologetyka.info/racjonalista/jak nie zosta zrobiony caun turynski,473.htm Because there is an answer to your question ; ) If you cannot, I can translate it to you, because it’s really funny! O.K. Got it! Thanks.","date":"2013-11-25","mins":"5:48 pm","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","title":"Running out of options?"},{"id":"comment-52802","author":"kelly_kearse","post":"Daveb of wellington nz : Notwithstanding any shortcomings or incompleteness in their various written reports, Max Frei’s Dead Sea halophyte and Anatolian pollens, together with Nitowski’s aragonite limestone dust in key locations (knee, nose, elbow(?) ) the blood flows (arms at 65 deg to vert), the pathology forensics, and so on, all argue too strongly for me even to consider the possibility that the T.S. Is anything else other than what it appears to be. You can add to that the unevenness of the bleaching of the fibres, suggesting an ancient age for the cloth. Then the only question I think worth pursuing is “What is the process whereby the image was formed from a dead body?”, assuming that a naturalistic explanation is available. Dan commented on Maillard plus “something else” mentioning earthquakes. This I take it is a ref to Giovanna De Liso’s 12 years with seismic experiments in Piedmont. Seismic variations in the geo magnetic and electric fields, the release of radioactive radon gas, and the presence of iron bearing rocks all seemed to have had some bearing on the matter, whenever she succeeded in obtaining an image. I know of no other natural process that has come anywhere near obtaining the successful images that she achieved, minor as they may seem. The gospel accounts all refer to seismic activity at the time of the crucifixion, and prior to the resurrection. Whatever the evangelists made of the event, I don’t believe it was intended as a mere literary device. I think it unfortunate, that apart from De Liso’s work that there appears to have been very little follow through on this aspect of the image forming process, as it may well provide the key to the answer. It may not attract the attention of scientists in seismic quiescent zones, totally unfamiliar with earthquakes. However, within the “ring of fire” they are all too familiar to us as a common enough occurrence. It may be of interest that the release of radon gas in USA apartment buildings has been implicated as a significant non tobacco cause of cancer, it is that common! However radon is a chemically inert and invisible gas, and so it is generally unnoticed. Is it a possibility then, that similar images might have been formed on the burial cloths of others during this/different seismic events undetected because no one ever went back & looked and/or the putrifaction process subsequently erased the evidence in time. The gospels mention that other graves were opened and many saints arose, appearing to witnesses in the town my impression is that these individuals had been dead for some time, although maybe not perhaps some were recently deceased relatives or friends. With this model, could there have been other burial cloths that were imprinted during history? Two quick questions: do you know if their superficiality is similar to the Shroud image; also, are the images formed in that system sensitive to treatment with a reducing agent (diiamide)?.","date":"2013-11-26","mins":"5:12 am","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","title":"Running out of options?"},{"id":"comment-118813","author":"kelly_kearse","post":"“Ironically we are discussing testings made in 1978 while science has moved on so fast that the issue of painting and blood could pobably be sorted either way in a few minutes nowadays. I am not sure of the wisdom of going over these old papers when they represent the findings of hopelessly out dated research methods. We wouldn’t do it in any other scientific context.” Exactly which research methods are hopelessly out dated? What are these new tests? These type of statements make great sound bytes, but how about a few specifics? Presumptive tests for blood still involve detection of hemoglobin, Fe bound heme. Advances have been made to increase sensitivity, but the molecular basis for this type of test is the same. Extending from presumptive tests, non heme constituents (serum proteins) are evaluated, typically albumin & immunoglobulin. These latter two tests are used to help determine what species the blood may be from. ABO typing may also be performed, using either immunological methods or DNA analysis. Antibodies are now available in the form of being impregnated on cards, making on site determinations quicker, as opposed to being added to slides back in the lab, but the molecular principles are still the same. Some investigators still utilize older methods it’s not as though such techniques have been ruled invalid. Heating up tea on a fire, on a stove, in a microwave, from a basic standpoint, really that different? “I’m sure there are still blood samples from the Shroud floating around out there. Couldn’t someone use a newer method of testing to determine whether the blood is real or pigment? Wasn’t there a scientist in the nineties(Dr. Tryon, I think) who determined that the blood on the Shroud was real and from a human male?” It cannot be concluded from these studies that the blood is real and from a human male there is nothing in the results that is blood specific. All three genes (betaglobin, X, Y) are found in non blood cells as well. These results only show that human DNA is present, could just as easily be explained by contamination (touch DNA).","date":"2014-05-13","mins":"6:56 pm","url":"https://shroudstory.com/2014/05/13/schwortz-it-is-worth-reviewing-david-fords-noteworthy-blood-or-paint-paper/","cat":"image_theory","title":"Schwortz: It is Worth Reviewing David Ford’s Noteworthy Blood or Paint Paper"},{"id":"comment-49780","author":"kelly_kearse","post":"A naive comment, perhaps, but if you analyze these additional photographs with the VP 8, are the results similar? I’m guessing that analysis with modern software is based on similar principles, but is this the exact equivalent? During a visit with Kevin Moran last year, I took the starkest black & white photo I could find (Meet the Beatles cover) and looked at it with the VP 8 side by side with some Shroud photograph wasn’t very similar at all imaging of the Fab Four was similar to the distortion of William Ercoline (normal) photo shown in Heller’s book. BTW, is there some information missing in that Nixon photograph?.","date":"2013-11-03","mins":"2:22 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-44451","author":"kelly_kearse","post":"Julie fantham : Can someone here confirm Rogers last paper to Thermochimica Acta (Jan. 2005) was accepted through peer review? Thermochimica Acta is a peer reviewed journal. If I remember correctly from talking to Barrie, the reviewers requested certain revisions after submission, which is not uncommon in the peer review process..","date":"2013-09-16","mins":"5:12 pm","url":"https://shroudstory.com/2013/09/16/speaking-of-more-scientific-testing-of-the-shroud/","cat":"image_theory","title":"Speaking of more scientific testing of the shroud"},{"id":"comment-44510","author":"kelly_kearse","post":"Matthias : interesting. My only guess is that it might have something to do with the washing agent my wife used. All I am certain of is that the mark is still clearly bright red after one year. BTW, what type of fabric are the sheets made of?.","date":"2013-09-17","mins":"5:56 am","url":"https://shroudstory.com/2013/09/16/speaking-of-more-scientific-testing-of-the-shroud/","cat":"image_theory","title":"Speaking of more scientific testing of the shroud"},{"id":"comment-44638","author":"kelly_kearse","post":"All naturalistic and artistic attempts that have been proposed since Vignon and Delage led the first scientific inquiry in 1900 02 have failed to duplicate the body images or blood marks found on the Shroud of Turin, including Vignon’s naturalistic method. One advantage to naturalistic and artistic methods is that they can be tested and their results examined. Im not convinced that the right experiment to fully test a scenario involving the Maillard process has been designed. I don’t think the results of previous attempts automatically eliminates it think it is still on the table. BTW, I’m not suggesting this must be the answer, just trying to remain objective. Your idea of examining scientific particles is an interesting one, and appears to have a relatively straightforward readout. I also agree that detailed examination of the cloth and blood particles at the molecular and atomic level could provide a wealth of information..","date":"2013-09-18","mins":"3:59 pm","url":"https://shroudstory.com/2013/09/16/speaking-of-more-scientific-testing-of-the-shroud/","cat":"image_theory","title":"Speaking of more scientific testing of the shroud"},{"id":"comment-44444","author":"kelly_kearse","post":"Matthias : Off topic but can someone more scientifically minded than I assist. It’s spring here now in Australia. My wife and I got the summer bed linens out. One of the white sheets had a blood mark from when our son had a bleeding nose last summer. It’s still bright red. Why? The typical color change blood undergoes as it dries results from hemoglobin changing from an oxygen containing form to a deoxygenated form (methemoglobin), associated with different forms of iron in each. The oxygenated and deoxygenated forms show different spectral properties, to the eye, fresh (oxygenated) blood appears bright red, dried (deoxygenated) blood appears more brown, blackish. One explanation might be that a coating on the fabric “locks” the hemoglobin into a conformation that mimiics the oxygenated form. A similar type of result was reported by Rogers who dabbed blood onto Saponaria treated cloth vs. Untreated cloth. Exposure to sunlight (uv) has also been discussed as influencing the perception of color in bloodstains. Do you know if the sheets were treated with fabric softner or washed in a certain type of detergent beforehand? Relatedly, were they treated with a stain remover or other type of detergent soon after the bloodstain was discovered? Hung out to dry in the sunlight?.","date":"2013-09-16","mins":"3:27 pm","url":"https://shroudstory.com/2013/09/16/speaking-of-more-scientific-testing-of-the-shroud/","cat":"image_theory","title":"Speaking of more scientific testing of the shroud"},{"id":"comment-44442","author":"kelly_kearse","post":"“More than a century of scientific and medical analysis has eliminated all proposed naturalistic and artistic attempts to duplicate the Shroud’s unique, full length images. Only two hypotheses to explain these unique images have been published in peer reviewed scientific journals: the CD hypothesis and the H C hypothesis” I would think if such a statement appeared in the Abstract of a peer reviewed journal, the reviewers and/or editor would ask for some anti spin to be applied here. “More than a century of scientific and medical analysis has failed to explain the basis for the Shroud;s unique, full length images. Two hyptheses that have been suggested include…” Eliminated all naturalistic attempts? I think the jury’s still out on this one.","date":"2013-09-16","mins":"3:06 pm","url":"https://shroudstory.com/2013/09/16/speaking-of-more-scientific-testing-of-the-shroud/","cat":"image_theory","title":"Speaking of more scientific testing of the shroud"},{"id":"comment-34611","author":"kelly_kearse","post":"Jesterof : May I ask an uneducated( from Shroudology point) question here? : ) Can anybody explain to me why are some substances singled out – lactate, or urea, or anything else. Human blood is full of carbohydrate complexes and it is also full of proteins, amino acids, fats and metabolites of all of those. It is a milieu of different substances and substrates which all can produce the reaction of caramelization or else. Given the stress the tortured Man of the Shroud was subjected to one can also assume that the level of plain glucose ( and fructose) in His blood was also very high. Plus the levels of hormones and their metabolites etc. The p H, the electrolyte content was also out of the wack and those factors also can contribute to the possibility of different types of reactions. So why are the researchers singling out ONE ( or two three) substances for their hypothesis? I’ve seen that already in the “blood threads” and it is continuing here as well. I’ll offer a few my own thoughts, but not sure I quite understand all of this. I believe certain substances tend to be singled out because 1) some data exists regarding their presence or absence as the Shroud data set is relatively limited, so to speak, that is, in the past, not ongoing, these are the results that exist and the ones that tend to be talked about and 2) people tend to discuss what they are most interested in. Not sure exactly what is meant by “high levels of plain glucose (and fructose) in H Is blood”. Not that it couldn’t be high, just wondering where this would fit in. The Maillard reaction, as I’m sure you know, occurs between an amine group and a reducing sugar (carbohydrate). Relative to the Shroud, the carbohydrates are believed to be present on the cloth, more specifically on the surface originating from starch residue or one of the glycosides (Saponin products). It sound as though you are suggesting that the carmelization reaction might be taking place within the blood (high glucose, fructose) and then diffusing out to be deposited on the Shroud? That it is independent of a direct reaction with the carbohydrates on the cloth? Of course there are many amine containing compounds in the body, but the discussion typically focuses on volatile substances that are existing/produced at/immediately after the time of death. I don’t think certain ones are intentionally preferentially excluded relative to others not really sure what is meant by a”possibility of different types of reactions” are you referring to other than the Maillard reaction here (that could diffuse out and react with the cloth, resulting in conjugated double bonds?), or the Maillard reaction involving amines + reducing sugars in the blood? Are all of the different substances and substrates in the milleu volatile and would diffuse out similar to those that are typically discussed? Just trying to understand what you mean..","date":"2013-05-24","mins":"9:16 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34651","author":"kelly_kearse","post":"Yannick Clément : Because of a known process called the evaporation concentration phenomenon that occurs during the drying of the final cloth in open air. Rogers talked about that in his book… I think you might be confusing things here. This isn’t talking about treatment of the final cloth with Saponaria and drying in air, which leaves a thin film of carbohydrate residues on the surface that’s what Rogers referenced in his book. This proposal is suggesting that ALL of the substances necessary for the Maillard reaction originate from the blood/bodily fluids and simply soak into the cloth. In Roger’s model, the body provided the amino reactants, which, in turn, reacted with the glycosidic residues coated onto the surface of the cloth..","date":"2013-05-24","mins":"1:51 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34733","author":"kelly_kearse","post":"Jesterof : Thank you, Kelly. When a person is under the stress the release of epinephrine leads to subsequent breakdown of the glucose storage – the body uses glucose ( a carbohydrate which can be used in the Maillard reaction) as a fuel and upon stress will use everything availale. So just the high amount of glucose in the blood might serve as a substrate for the Maillard reaction, not necessarily lactate, which will be there, as a result of rhabdomyolysis and tissue hypoxia. Why does the discussion center only on volatile substances created after death is my main objection – all substances available should be taken into consideration, not just postmortem volatile onesanoxie : Precisely, in his point 3, Rogers considered gas diffusion AND direct contact. Different reactants must be considered, limited wound patterns illustrate a contact mechanism. The discussion focuses on gas diffusion because the distant mechanism and its resolution is what gives the image its 3 D properties. I agree with both of you in that: all substances available should be considered and both contact and diffusion should be considered. Here’s the part I would like some help with to understand more fully: the mention of glucose (or fructose) in the blood, or participation of other reducing sugars from bodily fluids in the Maillard reaction > image formation. This is not meant to be a badgering exercise, would earnestly like to know how this would work. It is believed that the cloth was bleached, treated with starch paste, then washed in Saponaria, and laid out to dry. Rogers has suggested this combination resulted in a coating of starch & Saponaria residues on the surface. I am away from the book right now, but if memory serves correctly, there are 4 6 glycosidic products of Saponaria, none of which are amino containing sugars. The soaking, etc. Of the cloth leaves a fine coating of carbohydrate residues at the surface, a type of Scotch guard, if you will, or we could call it Shroud guard. The residue hypothesis (Scotch/Shroud guard) has always had a certain appeal to me because, in my thinking, it helps provide a means of uniformity throughout the cloth, for the ventral & dorsal image in the Maillard reaction scenario. Jesterof, you mentioned previously that there is no need for Saponaria at all. Can you help me to understand how this might work are you suggesting that the carbohydrate contribution of the Maiilard reaction is not coming from any residue left on the cloth, but rather, from blood components that have soaked into the cloth, and that amino groups from bodily compounds (any you wish to consider, the list can be long) are reacting with these? Any role at all for starch treatment here? Where do the glucose/fructose (other reducing sugars) from the body fit in? Can you give me some insight about the free glucose/fructose regarding: How would this work for portions of the cloth that are not in contact with the body? Would such soaking in of products be equivalent/relatively uniform throughout the cloth? Controversial, etc., but if the body had been washed, could this still work? How would this apply to the image being restricted to the superficial portion of the cloth? Would appreciate any thoughts/comments. Thanks for your time.","date":"2013-05-25","mins":"9:57 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34738","author":"kelly_kearse","post":"Daveb of wellington nz : YC is entitled to his views that radon is not part of the solution. However there remains a gaseous diffusion problem in a purely chemical explanation. Clearly there has to be some kind of collimation mechanism on the gaseous particles to produce such a reasonably well defined image. Radon with its alpha particles, and possibly the subsequent gamma radiation from its decay products, may have been part of that mechanism. They would be fairly small quantities and would not necessarily have a strong penetrating effect on the cloth. The answer might well be revealed in due time, possibly sooner than he imagines. Perhaps YC’s main objection to the possible role of radon, is because it did not occur to his hero. The plain fact is that no one has ever produced a persuasive image experiment by Maillard alone! daveb, I’d also like to hear more about how the radon idea would work. Can you help me out with this one? The body is in the tomb, on a slab or stone niche in the wall, wrapped in the Shroud, an earthquake occurs, radon is produced, can you pick it up from there for me, especially as related to: Is the radon solely external to the cloth and then diffuses in? How would this work for portions of the body that are in contact with the cloth, particularly the back of the shoulders, buttocks that are pressed down onto the cloth? Alpha particles are relatively weak, yet didn’t Rogers object to the idea of any type of radiation because even alpha emitters show characteristic track patterns among fibers, which were not observed in samples taken from the Shroud (I think I have this correct)? In the radon scenario, would any detectable, relatively stable products (isotopes) be created (on the cloth, surrounding areas rock, rock walls, etc.)? Would appreciate any thought/comments. Thanks for your time..","date":"2013-05-25","mins":"10:21 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34764","author":"kelly_kearse","post":"Jesterof, Ok thanks.","date":"2013-05-25","mins":"1:37 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34805","author":"kelly_kearse","post":"“UNBIASED that’s the most important word here” And this, of course, is itself not an overly biased response? And it is certainly not biased to ridicule anyone who chooses to be open to any other possibilities if they do, they must not be credible. Their scientific integrity must certainly be questioned. I believe the Shroud could have been formed by totally natural means, but I don’t think it had to be. I also believe the Shroud could have been formed by supernatural means, but I don’t think it had to be. I don’t know one way or the other I could see it either way. So I ask a lot of questions. I’d like to learn more about it. I try to keep the questions relatively focused. I also am willing to consider the possibility that the Shroud could be a fake. I don’t think it is, but for me the possibility still exists. I think it’s a small one, but still there. Dan Porter has expressed the belief I hold to perfectly: Is the Shroud real? Probably. There is a lot of talk about what good and honest science is, but it is framed in a very defensive manner as if anyone who raises questions to deepen their understanding or has an alternative opinion must not be honest or must be biased. This is telling of someone who themself has a very small and relatively limited comfort zone, and therefore must set everyone else straight. Good and honest science? Good and honest science does not mandate that all contrary opinions are, of course, foolish. The good scientific method? At the heart of the good scientific method is objectivity. Trying to view & understand the data from as many angles as possible. Even first year science students recognize the value of the illustration of blind men describing what an elephant is. Those who grab the trunk swear it’s long, relatively thin, and wriggles about, like a snake. Those who grab the leg argue it’s round and thick like a tree, and hardly moves at all. Discard objectivity and you’ll move further & further away from what good & honest science really is. If someone believes differently, consider that they may be at least of limited intelligence, it’s possible that you might learn something. The continuous need to proselytize one’s viewpoint at the expense of devaluing all other ideas is a sign of insecurity. There is no single theory that explains image formation they all have their issues. But I believe all should be respected, even if one completely disagrees..","date":"2013-05-25","mins":"7:43 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-116060","author":"kelly_kearse","post":"Seems an odd pairing to have the head facing straight ahead, with the eyes closed on such a crucifix. Most artists tilt the head slightly downward, or angled to one side to signify death. If the head is facing straight on, wouldn’t the eyes likely be shown open, looking straight ahead or upward? I suppose some variation could exist. A crown of thorns is usually depicted in sculptures, doesn’t appear to be the case here. Could have been an add on item to contrast with the sculpture or chipped away, smoothed out why not? As to alternatives, quite a serene expression for someone being slow roasted maybe they used a lot of butter..","date":"2014-05-10","mins":"9:12 am","url":"https://shroudstory.com/2014/05/10/the-colin-berry-dislocated-shoulder-theory/","cat":"image_theory","title":"The Colin Berry Dislocated Shoulder Theory"},{"id":"comment-116104","author":"kelly_kearse","post":"“As I wrote yesterday, the dislocated shoulder has been on my mind for some years now. It is likely that Mel Gibson was influenced by the Shroud image to shoot the scene where Jesus’ right hand is nailed to the cross after being pulled to the “right length” by the centurion. Obviously he did not make use of the rest like the position of the nails because the relic hasnot yet been authenticated and he took Anne Catherine Emmerich and Christian art in general into consideration.” Re: The Passion apparently, Jim Caviezel suffered a shoulder dislocation during filming at some point http://movies.about.com/od/thepassion/a/passion082504.htm.","date":"2014-05-10","mins":"10:25 am","url":"https://shroudstory.com/2014/05/10/the-colin-berry-dislocated-shoulder-theory/","cat":"image_theory","title":"The Colin Berry Dislocated Shoulder Theory"},{"id":"comment-34356","author":"kelly_kearse","post":"Yannick Clément : Since Rogers looked for these particular substances and came up empty, I am very doubtful concerning Baima Bollone’s claim concerning the presence of aloes and myrrh (on the Shroud at least)… This independent analysis of Rogers have produce a different result, that’s why I’m so doubtful. Completely different techniques used in each case tough to say Samples from the same areas would need to be analyzed by the same method(s) to really know where this stands.","date":"2013-05-22","mins":"3:16 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","title":"The pig experiment was not Barrie’s experiment"},{"id":"comment-34367","author":"kelly_kearse","post":"Yannick Clément : Mr. Kearse, I really think you should read Rogers book because he address all the issues you describe… Personally, I would say this : Since we know that the Shroud is a real burial cloth that contained for less than 72 hours the dead body of a tortured and crucified man, I can’t imagine that a Maillard reaction is not, at the very least, part of the solution concerning the body image on the Shroud. M. Clement, I really think you should read my comments more carefully. Personally, I would say this: I have read Rogers book..","date":"2013-05-22","mins":"4:54 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","title":"The pig experiment was not Barrie’s experiment"},{"id":"comment-34372","author":"kelly_kearse","post":"Yannick Clément : Mr. Kearse, if you read Rogers book, you’ll see how confident he was on the fact that there is nothing of that nature on the Shroud. In fact, on this subject, Rogers seemed in his writting to be as confident about that as the fact that the main body of the Shroud is made of 100% linen… I found it hard to convince myself that Rogers could have miss something he was definately looking for. See comment #29 I have read the book! It is not a matter of missing something or being confident it is possible that both sets of studies are correct, you know. Different methods can yield different results it’s not a novel idea. It seems biased to accept results that one wishes to and discard those that may disagree I would keep both possibilities open many bench scientists have experienced a situation where different results were obtained by different investigators the issue becomes magnified when completely different techniques are used. The only way to truly sort it out is to go side by side. “By the way, it’s the same thing concerning the lack of proof of the presence of saponaria on the cloth. Rogers search hard to find traces of this product but he was never able to suceed” So, if an alternative method was used to evaluate the carbohydrate profile (using labeled probes, for example), and traces of glycosidic residues (Saponaria products) were found, would this be accepted because it fits the results you’d like to see or dismissed because it wasn’t previously found (even by Rogers)? Quoting results without consideration of different methods that may have been used is an oversimplification of the findings. It can become apples and oranges relatively quickly..","date":"2013-05-22","mins":"5:24 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","title":"The pig experiment was not Barrie’s experiment"},{"id":"comment-34536","author":"kelly_kearse","post":"Yannick Clément : it does not seem at all to me… He address properly and in details all the question you asked. Okay, here’s the main question I asked (from previous post # 8): “The coloration of fabric has been demonstrated by application of reagents important in the Maillard reaction but has anyone shown the resolution/detail of an image from an underlying object with the reaction? Give me the page number(s) or experiment(s) for this I have the printed e version of the book, perhaps I am missing some pages? Regarding the paper mâché hand & bolt experiments, in my opinion if you didn’t know what the template was, one would be hard pressed to identify what the resulting images were based on. The experiments show coloration, yes, of course; resolution, detail not there for me. Rotate the hand image 90 degrees, evaluate it, rotate again another 90 degrees, evaluate it it could be anything the diffuseness of the image does not allow a clear identification if sufficient detail were there, viewing at different angles would not really matter that much. I think Ray Rogers was an excellent, knowledgable scientist I have great respect for his work I also think he would grow impatient with repetitive parroting of his findings without the goal of extending them and exploring the science behind them in more detail. Otherwise, one becomes entangled in the parrotic fringe. I believe that good work such as his will stand the test of time and because of its soundness & scientific integrity, it will also be refined and reconsidered as work progresses. It does injustice to the work to oversimplify and overextend it as such..","date":"2013-05-23","mins":"8:43 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","title":"The pig experiment was not Barrie’s experiment"},{"id":"comment-34254","author":"kelly_kearse","post":"As mentioned in a previous posting, without the inclusion of a control group(s) in the pig experiment, any meaningful interpretation related to image formation is weak at best. This is putting it kindly. I understand that it wasn’t Barrie’s experiment will wait for the next shroud.com update for any related information about the program/details. A general comment: Is the Maiilard reaction, in of itself, sufficient to explain the (uniform) degree of resolution of a collimated image? I think the Maillard could be part of it, but I am not so sure it could explain everything. If involved, I would have to go Maillard plus. What the plus is/could be, I don’t have a clue. For me, the Maillard reaction makes sense, but by itself has some issues why the calves, buttocks don’t appear more flattened, differentially resolute in certain areas? Relative to the skin, what about the hair? With multiple surface area(s) of matted hair, would the image be expected to appear more resolute in areas? more blurry in others? The coloration of fabric has been demonstrated by application of reagents important in the Maillard reaction, baking the cloth to simulate aging, okay, the color is there but has anyone shown the resolution/detail of an image from an underlying object with the reaction?.","date":"2013-05-21","mins":"8:23 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","title":"The pig experiment was not Barrie’s experiment"},{"id":"comment-101135","author":"kelly_kearse","post":"Daveb of wellington nz : We need to see the results of a light scorch on linen with a starch coating; tested for negativity and 3 D; and then we need to see the results of treatinig it with diimide to see if the scorch can be removed leaving unaffected fibrils underneath. Simlarly for corona discharge and excimer lasers. Only by this means can these “off the wall” hypotheses be conclusively dismissed, once and for all! The significance of examining linen prepared in the manner as that of the Shroud is a key point, one which also applies (IMO) to those hypotheses deemed to be “on the wall” as well. Given the unique superficiality of the image, this could be major. Ideally, a step by step protocol could be developed to control that cloths being tested both on and off the wall were as similar as possible in their surface properties..","date":"2014-04-19","mins":"5:27 am","url":"https://shroudstory.com/2014/04/17/the-turin-shroud-image-is-not-a-scorch/","cat":"image_theory","title":"The Turin Shroud Image is not a Scorch"},{"id":"comment-100643","author":"kelly_kearse","post":"Congratulations Thibault. Very well done.","date":"2014-04-18","mins":"4:34 am","url":"https://shroudstory.com/2014/04/17/the-turin-shroud-image-is-not-a-scorch/","cat":"image_theory","title":"The Turin Shroud Image is not a Scorch"},{"id":"comment-118106","author":"kelly_kearse","post":"What exactly are these “heavier amine” substances and does their post mortem release occur within the specific time frame, or later? What effect does swelling, edema of the skin have on this type of release, for example on the right side of the face, are the pores more constricted, more open? Will diffusion be impeded, enhanced, or no effect? is this worth considering? It’s one thing to get coloring from gaseous diffusion in an experiment; it’s another matter to achieve resolution & detail from a three dimensional substrate. The variables are numerous here science doesn’t require or need to use such a large shoehorn to help it fit it needs empirical data.","date":"2014-05-12","mins":"6:33 pm","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","title":"To Yannick on Science and Philosophy"},{"id":"comment-112255","author":"kelly_kearse","post":"The empirical evidence to support a Maillard connection to the Shroud is in the blueprint stage at best. The chemistry may or may not be in place for the production of a colored substrate. There is a separate issue of resolution achieving such definition throughout the length of the body, front & back. At this stage, it’s an idea but that’s as far as it goes no matter how emotionally attached YC is to it because it satisfies his criteria for being completely naturalistic without any contribution that may be  undefined, the evidence for this is TBD..","date":"2014-05-05","mins":"8:19 pm","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","title":"To Yannick on Science and Philosophy"}]
