[{"id":"comment-14409","author":"kelly_kearse","post":"I was fortunate enough to have the opportunity a few weeks ago to spend the afternoon with Dr. Alan Whanger & one of the things we discussed was the overlap of the bloodstains on the two cloths. He demonstrated the polarized overlay technique which allowed going between the Shroud & the Sudarium as you wished Each image is projected separately through a polarized filter, then a hand held filter is used to switch back & forth. For me, this was a huge help in appreciating the congruence between bloodstain patterns, especially the neck region on the dorsal image of the Shroud I had always found it somewhat difficult to compare specific areas in photographs between the two. I am unsure if this has ever been computer simulated to overlay/morph between them, but I found this type of approach extremely helpful. Blood typing comparison is an exclusion type test; the only definitive conclusion that can be made from such studies is if distinct blood types exist, indicating that the cloths could not have wrapped the same person. In the case of the Shroud and Sudarium, with the same blood type, AB, such results are consistent with the idea that the cloths may have at one time covered the same individual, but they are by no means conclusive. The overlap in bloodstains helps to provide additional evidence of a shared relationship. If feasible, it would be interesting to evaluate mitochondrial DNA isolated from the bloodstains on both cloths (unlike chromosomal DNA, which is inherited from both parents, mitochondrial DNA is received only from the mother; mitochondrial DNA is typically less fragmented than nuclear DNA and more copies per cell exist). This is again an exclusion type test, but the chance of two unrelated individuals having the same mitochondrial DNA is extremely low..","date":"2012-08-02","mins":"7:27 am","url":"https://shroudstory.com/2012/08/02/how-good-is-the-match-up-between-the-sudarium-and-the-shroud/","cat":"blood_studies","title":"How good is the match up between the Sudarium and the Shroud?"},{"id":"comment-191124","author":"kelly_kearse","post":"A few comments: 1. Regarding the observation that the pollen is adhered to the blood, thus subsequent contamination can be ruled out. This logically raises the question, what do electron micrographs of pollen not adhered to the blood look like? Are the points of all of the spikes completely on the surface? Has it been considered that folding, rolling of the cloth at some point in time, may have affected how this is perceived, i.e. That a grain may have been pressed more into the fiber (dried bloodstain) than when it originally landed? 2. Another (main) point is: The pollen is adhered to the blood, so they arrived on the cloth at the same time. Okay, when was this? That is, scientifically speaking, what data is there that speaks to when the blood arrived on this particular cloth? It would be important that these (and other) studies reach the point that the results could be formally summarized and submitted to a major scientific journal. For most scientific investigations, the order is typically the reverse: publication first, then any type of press announcement is secondary. It is expected that a reviewer would pose similar questions as those above (and others). Scientists naturally question things, even (and most importantly) in their own research. When others ask questions about a particular scientist’s ideas, it may sometimes be perceived as challenging (threatening), but it need not be. It’s about trying to sort out what is real and what is not. There is circumstantial evidence to possibly link the two cloths in association with each other. What would it really take? That’s something each person has to decide for himself or herself: what level of scientific rigor is necessary in the context of what could be done given the age, condition, and accessibility of both cloths..","date":"2015-02-15","mins":"12:42 pm","url":"https://shroudstory.com/2015/02/15/important-new-pollen-discovery-on-the-sudarium-of-oviedo/","cat":"press_coverage","title":"Important New Pollen Discovery on the Sudarium of Oviedo?"},{"id":"comment-103299","author":"kelly_kearse","post":"“Five samples from five different cloths..” Sorry if I missed it, but was the Sudarium sample from (just) a single site?.","date":"2014-04-24","mins":"2:35 pm","url":"https://shroudstory.com/2014/04/24/the-carbon-dating-of-the-sudarium-of-oviedo-plus-the-caves-of-the-sudarium/","cat":"carbon_14_dating","title":"The Carbon Dating of the Sudarium of Oviedo Plus the Caves of the Sudarium"},{"id":"comment-190847","author":"kelly_kearse","post":"Reported with conviction & certainty but scientifically nowhere close to a slam dunk. The ball is still being passed around at mid or full court, take your pick. Agreeable blood type, agreeable blood patterns, to scientifically conclude this involves the same person, is at best, circumstantial. Comparison of a DNA consensus profile for each, if obtainable, would be the best chance towards supporting such a conclusion..","date":"2015-02-12","mins":"2:25 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-190857","author":"kelly_kearse","post":"OK wrote: “But seriously, what evidence do you need to “scientifically” conclude that hose two cloths belonged to the same person?” For me, it would take (much) more than the mutual coincidences listed to form a hard, scientific conclusion. That would be the type I’d be interested in..","date":"2015-02-12","mins":"4:01 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-190864","author":"kelly_kearse","post":"OK, See previous comments my belief still stands..","date":"2015-02-12","mins":"4:58 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-190869","author":"kelly_kearse","post":"OK, The alternative scenario is the cloths covered two different people or one (or both) was created to appear as though they covered a body/face. Sorry, not much time for a blow by blow debate on this. I believe there is some congruence in the bloodstain patterns key word “some” I also think the AB designation for both only takes you so far bear in mind, I believe this (AB) on either needs to be verified by additional experimentation (methods). Forward typing says AB, yes, but there are limitations. This is the antithesis of being shy, it’s a desire to be critical & objective. The most definitive call would be comparative DNA analysis, if doable, the rest is circumstantial and don’t confuse circumstantial with meaningless or trivial that is not what I am implying..","date":"2015-02-12","mins":"5:27 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-190885","author":"kelly_kearse","post":"“But I would like to ask what is in fact stronger evidence, a DNA match solely on its own or such incredible chain of coincidences described above” I think it’s fair to say that different people have different opinions on the matter. I’ll just leave at that..","date":"2015-02-12","mins":"8:20 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-191385","author":"kelly_kearse","post":"JG wrote: “I bet there are layers and layers of DNA on the Shroud. Countless people over the last 700 or 2000 years have touched the Shroud and they may have left their DNA on it to mix with other DNA already there. And there would be degraded DNA on it too. You touch something and you transfer DNA. How do you propose to separate all the DNA? http://www.ncbi.nlm.nih.gov/pubmed/23623709 PS If the persons touching it has any pollen on them that can be transfer too.” John, My reply is rather lengthy. I have broken it up into several parts. My comments: 1. I would agree there is both contaminating & degraded DNA on the Shroud. I also agree that both issues could be challenging. In my original reply to OK I said “The most definitive call would be comparative DNA analysis, if doable…”. When asked in a hypothetical situation, which is more telling, the fact that two people both have a beard & a mustache and/or even share the same blood type versus a comparative DNA analysis between the two, to me, there is no contest. In the previous context, considering that all four Beatles at one time had beards & mustaches, the strongest piece of scientific evidence on the “amazing list of circumstances” was the same blood type. Even with shared blood type, albeit one that is the least represented in the population (~5% currently), this can only take you so far, you are still unable to reach a solid, scientific conclusion that the same individual is involved. In my view, DNA analysis, would be the most definitive way to begin to extend this beyond circumstantial. Numerous artifacts could share the same the same blood type (AB) and still be unrelated. It would be much more difficult to understand how two unrelated artifacts would share the same DNA profile (see below comments). 2. All of the above, of course, hinges on your main point, “how do you propose to separate all the DNA”? It could be a very challenging issue. Perhaps one advantage the bloodstains may have is that samples could be taken from beneath the surface, or even from the reverse side (beneath the surface), to help minimize contamination (as well as disturb the appearance of the cloth). Samples would have to be taken from multiple bloodstains for any type of meaningful comparison. The latter is a minimum for trying to determine if any consensus profile sequences could be achieved. Maybe it could be done, maybe it couldn’t. Degradation could be very challenging it would be important to consider both mitochondrial & nuclear DNA analysis. The sensitivity and capabilities of molecular biology techniques has significantly advanced within the past two decades DNA analysis (on either artifact) could potentially extend the current information in a way that other methods/techniques cannot. Maybe it could be done, maybe it couldn’t there are certainly no guarantees. Such methods also offer the potential to confirm the AB blood type , to look at if certain bloodstains were touched up throughout the years (heterogenous), and if blood from other species (in addition to primate/human) is present on either cloth, among other things. For more details, if interested see: https://www.shroud.com/pdfs/kearse3.pdf 3. Contamination is a major consideration. I raised this issue several years ago to temper the oft promoted selling point for authenticity that “Human DNA has been found on the Shroud”. (DNA from a human male, no less). This is related to another major challenge that exists: to demonstrate that there is DNA on the Shroud that originates from bloodstains, as opposed to contaminating skin cells. I have written about this previously. For more details, if interested see: https://www.shroud.com/pdfs/kearse2.pdf In my opinion, one has to at least consider bringing more modern technology into the discussion, even if it is hypothetical. If you don’t look, you don’t know. Even knowing (from empirical data) that degradation and/or contamination is too vast a limitation, is in my mind, progress. There are only so many times you can retread a tire and repeat the same points from previous studies, again & again (& again). 4. Finally, bear in mind, with any of this, I am not a DNA expert. I don’t consider myself an expert on anything. Like most scientists active in any aspect of cell biology in the 80s and beyond, I have had some experience working with DNA. It is not that uncommon I collaborated with others (molecular biologists) for the heavy lifting. The oldest artifact I ever worked on were cells that had been growing for three weeks in my incubator. I continue to read scientific journals weekly, stay in touch with various colleagues, and follow certain lines of interest. These are simply my thoughts. I trust that God knows what He’s doing with either of these cloths. Perhaps studies will continue at some point in the future. Perhaps they won’t. As a scientist who happens to be a Christian, and a Christian who happens to be a scientist, the subject is a unique & intriguing mix. I’m okay either way it goes. If the Shroud were ever conclusively determined to be non authentic, I would find it ironic that the hand of a forger could be the instrument to summon so much attention to the message of Christ’s redemption for mankind. To me, that’s the most important thing about the cloth, no matter where one stands on authenticity..","date":"2015-02-19","mins":"9:54 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-191452","author":"kelly_kearse","post":"Worth noting that Tipler’s proposal of a XX male genotype (as opposed to XX representative of a typical female) is from a report that also included analysis of 4 other genes from locations other than X and Y chromosomes. These results, performed in the same study, indicate that there are six more alleles (forms of a gene) present than could be accounted for from a single individual. The maximum for 4 genes would be 8 alleles, since a single person has only 2 copies of each of these genes. Such findings indicate contamination, a point the authors, themselves mentioned..","date":"2015-02-20","mins":"8:31 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-191455","author":"kelly_kearse","post":"OK, Sorry, bud, sticking to my guns. There is some major misconstruing of ideas/intent, but you’ll have to try me in abstentia would rather spend my time on other things Oh, by the way, I would suggest considering decaf..","date":"2015-02-20","mins":"9:02 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-191497","author":"kelly_kearse","post":"Louis, I read Tipler’s book a couple of years ago, TPOC (from my local library), here is the relevant passage (which I selected & pasted from another website), fellowship of the minds.com, that showed up in a Google search: “Here is Dr. Tipler’s account (from pages 183 187 of his book): Normally, the results of a DNA test of the blood on such a famous object would be published in English in a major scientific journal. … Not so the results of this DNA test. The results were published, in Italian, in the very obscure Italian journal devoted to the study of the Turin Shroud. Furthermore, only the raw data were published. That is, the Genoa team published black and white Xerox copies of the computer output of the DNA analyzer. This is never, never done. Always, the data are presented in a neat table or figure, and they are accompanied by a discussion of their significance. The Genoa team made no effort to interpret their data. But I was able to interpret the data at once. They are the expected signature of the DNA of a male born in a Virgin Birth! … The Turin Shroud data show 107 (106+1) but not trace of a 112 base pair gene. The Oviedo Cloth data show 105 (106 1) but no trace of a 112 base pair. The X chromosome is present, but there is no evidence of a Y chromosome. This is the expected signature of … virgin birth, the XX male generated by an SRY inserted into an X chromosome. It is not what would be expected of a standard male. Other explanations are possible. The DNA analyzed could be entirely contamination from people who later touched the Shroud and the Cloth. But we have witnesses that men touched the two samples also, and it seems incredible that no trace of male contamination would be seen…. Another possibility is that the Turin Shroud and the Oviedo Cloth are fakes and that the fakes used real blood from males they knew were born of virgins. This possibility, in my opinion, has zero probability.” You asked, Would his interpretation of the DNA be correct? My comments: 1. The basis for the standard chromosomal sex determination is evaluation of the amelogenin gene, which is present on both X & Y chromosomes. In the X, a 106 base pair version exists, in the Y, a 112 base pair version is found. This difference in length is the basis for sex determination: in typical females (XX) only the 106 signal is seen; in males (XY), both 106 and 112 versions are detected. 2. Tipler proposes that Jesus was XX, with portions of genes from a Y chromosome inserted into the X. Specifically, the SRY gene (unrelated to amelogenin), which stands for Sex determining Region gene on the Y chromosome, plus he suggests a few other Y specific genes may have been inserted as well. 3. The findings which Tipler is referencing report only a 106 signal, although the same group (Canale) would also state they found “male DNA with traces of female DNA after tests of two threads of the cloth” p 250 in “Enigma of the Shroud” by Petrosillo & Marinelli (1996), ref 7, CHI no 30, August 4, 1995, p 94 97. So, there is contradiction even there. As previously noted above, the same group evaluated additional genes that revealed contamination. Be that as it may, just based on the fact of Tipler’s eyeing of raw data with only a 106 signal, to even come remotely close to supporting his idea, insertion of the SRY gene (or other Y specific genes) would need to be evaluated. This was not done is entirely speculation, hypothetical 4. The only thing I agree with about his interpretation is that normally such results would be published in a major scientific journal..","date":"2015-02-21","mins":"1:07 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-191600","author":"kelly_kearse","post":"Directed to O.K.: It is meaningful and important to compare the properties of the Shroud & Sudarium to evaluate their possible relation to one another. It is also important, however, to consider each artifact independently to provide the most objective approach when investigating the properties ascribed to each. This is a key point. If an underlying assumption of any investigation is that the two cloths must be related, subjectivity & bias has already crept in. In your previous interrogation, I was asked Yes or No if I thought the cloths belonged to the same person. My answer is: It’s possible. I had the opportunity to visit with Dr. Whanger in his home several years ago and he very patiently demonstrated to me the overlay system featuring the two cloths. This allowed me to better appreciate the congruence of some of the bloodstains in various regions You stated that both the Shroud & Sudarium both belonged to crucified men. On the Shroud, the crucifixion wounds are obvious in the wrist & feet. The Sudarium is a head cloth. What objective scientific evidence from the Sudarium do you feel demonstrates that this represents an article from a crucified man? Would like you to be as specific as possible..","date":"2015-02-22","mins":"8:04 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"}]
