[{"id":"comment-215923","author":"joe","post":"Short personal reflection: If Jesus would have been born from a virgin through a direct divine intervention, nobody in his own family (starting with his mother) would have been surprised to see him start to preach and performed miracles and all that… However, that’s exactly the opposite that we see in the Gospels. To me, this is very telling!.","date":"2015-12-08","mins":"3:30 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-215928","author":"joe","post":"I dont understand the quesiton in the context of what I said in my short reflection..","date":"2015-12-08","mins":"4:25 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-215930","author":"joe","post":"That’s probably why she was so suprised that he was teaching the Jewish teachers in the Jerusalem Temple at 12 years old and that’s probably why Jesus’ whole family thought he had lost his head at one point! Note that in the part you refers, Mary never ask Jesus to perform a miracle. She simply told him that they were out of wine… A lot of interpretations are possible. On the other hand, there are many quotes from different Gospels that show quite clearly that his own family was very surprised by what he was saying and doing, which do not fit with a virginal birth coming from a direct intervention of God….","date":"2015-12-08","mins":"4:43 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216019","author":"joe","post":"I think the question I asked before will also fits nicely here: Would it be the end of the world for you and your faith if Jesus would have been conceived like anybody else (i.e. Through a normal sexual encounter between his mother and his father)? For me, not at all… This question of the virgin conception of Jesus has nothing to do with the heart of my faith..","date":"2015-12-09","mins":"11:39 am","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-215996","author":"joe","post":"If the new Christian communities would have really knew she was a virgin when she conceived Jesus, it’s evident that his own family would have know this also and it’s evident that Mary, Joseph and their other childs would never have been surprised to see him preach or perform miracle. The fact that his own family didn’t understood his actions and speaches is very telling about this whole issue. The virginal birth is most probably an addition of Matthew and Luke to strengthen the faith of their new Christian communities. There are a lot of things like that that were probably added because of the difficulty to believe in a Jewish Messiah that has been crucified (which is not at all what the Old Testament was thinking about the Messiah). Most modern biblical scholars agree with me about that. Again, that doesn’t mean Jesus was not the real Messiah. That simply indicates that the new Christian communities of the First Century wanted desperately to back up their claim about Jesus… It’s pure human nature. Concerning the miracle of Cana, many scholars even think that the whole story is not historical at all and it is much more a made up story to teach the community to always have faith and confidence in Christ. Personaly, I have no problem believing that the heart of this story is historic, but the details concerning the faith and confidence of Mary versus Jesus that we found in the story can well be an addition to help a teaching about faith and confidence in Christ..","date":"2015-12-09","mins":"9:36 am","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216034","author":"joe","post":"AMEN! I would underline the word “ALL”. That really means ALL. Because God is love and nothing else, no one is excluded. To me, that’s the profound meaning of Jesus’ Passion, death and resurrection. This is really what deserve to be call “a good news”!.","date":"2015-12-09","mins":"1:03 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-215998","author":"joe","post":"Jesus can well have been both human and divine while having been conceived like you and me. This was only a problem for many men of Antiquity who thought the whole nature of a person was coming from the sperm of the father… I’m pretty sure that was one of the primary reason this whole virgin birth story was invented, along with a desire to strengthen the faith in Jesus as the real Messiah..","date":"2015-12-09","mins":"9:40 am","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216016","author":"joe","post":"And what if she was, IN REALITY, referring to her spiritual virginity, which is the one we will ALL got when we’ll enter in Heaven? If we want to get closer to the truth, I think we must always try to see things beyond the very closed spectrum of our material space time universe….","date":"2015-12-09","mins":"11:35 am","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216055","author":"joe","post":"There are a lot of miraculous birth stories in antiquity, but there is only one story of a crucified Jewish Messiah coming back to life. That’s one good reason to put more faith in the resurrection account versus the virginal birth account. And the heart of Christian faith is not the virginal birth but the resurrection of Christ. That’s what really matters. I don’t need Mary to be saved. I need the mercy of God..","date":"2015-12-09","mins":"4:40 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-215898","author":"joe","post":"Quote: “To an Atheist, what Luke (and indeed Matthew) wrote about the virgin birth is part of the fabric of what must be a much bigger fictional account.” And to a lot of modern and very serious biblical scholars, these accounts are probably not historical and come from a desire to back up the claim of Jesus being the real Messiah with some Messianic prophecies of the Ancient Testament… Knowing full well that the New Testament books are not what we can consider modern historical biographies (their main goal was much more to strengthen the faith of the new and fragile Christian communities and maybe to get others to embrace Christian faith), I tend to agree with this vision. For many scholars, the only sure thing we can say about Jesus origin and “hidden” years is that he probably lives a normal Jewish life in Nazareth in Galilea and that’s all. Many of them even think that this is the place where he was born… All this doesn’t mean Jesus was not the Messiah and this surely not mean that everything we found in the New Testament is totally fictional, but I think it’s a very dangerous thing to take everything there as 100% historical….","date":"2015-12-08","mins":"10:46 am","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-215924","author":"joe","post":"I will do a little Jesus of myself by answering with another question! : ) Would it be the end of the world for you and your faith if Jesus would have been conceived like anybody else (i.e. Through a normal sexual encounter between his mother and his father)? For me, not at all….","date":"2015-12-08","mins":"3:40 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216017","author":"joe","post":"Sorry to hear this… What is the heart of our Christian faith? That God is love and that there’s a spiritual life for everyone after death. Whether Mary was virgin or not when she conceived Jesus shouldn’t affect this great truth!.","date":"2015-12-09","mins":"11:38 am","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216022","author":"joe","post":"In order to help your faith, here’s an advice for you : Simply look at Paul’s faith! Like me, the question of the virginal birth of Jesus had nothing to do with the heart of his faith, as he never talks about that in his letters! The heart of his faith was centered on the greatness of the free love of God for us and his infinite mercy. As Einstein would say : for Paul, the rest were unimportant details!.","date":"2015-12-09","mins":"11:47 am","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"}]
