[{"id":"comment-215555","author":"joe","post":"For me (and most historians), yes. But this was a different relic than the Shroud. It wasn’t a relic of the passion and that’s probably why the crown of thorns was considered by Saint Louis as having much more value..","date":"2015-12-03","mins":"10:36 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215485","author":"joe","post":"Personaly, I don’t think the Shroud ever got to Paris, because if it would have reached the capital in the hands of one of the king of France during the 13th or 14th Century, we would have clear textual mentions of the arrival of such a great relic in Paris, just like we got clear textual mentions of the arrival of the crown of thorns in Paris in the hands of Saint Louis in August, 1239….","date":"2015-12-02","mins":"10:52 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215573","author":"joe","post":"The Mandylion never was considered as a relic of the passion… The Mandylion and the Shroud were 2 separate objects. But here, people want to see both cloths as the same objects, nevermind the tons of evidence against such a wrong hypothesis..","date":"2015-12-03","mins":"1:03 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215574","author":"joe","post":"When I wrote “never was considered a relic of the passion”, I talked about the time the Mandylion was kept in Constantinople. If you base your judgment about this issue on one single text, while discarding all the other evidences against the idea that the Mandylion was a burial cloth, that’s no good. Also, the fact that the person who wrote the description you mention never talked specifically about bloodstains being present on the face open the door to a lot of interpretations….","date":"2015-12-03","mins":"1:07 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215500","author":"joe","post":"Considering the historical context, I firmly believe that Geoffroy de Charny got the Shroud in secret, very quietly, which can indicates that he got it without the king of France or any other important people from the French court being involved..","date":"2015-12-02","mins":"1:27 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215486","author":"joe","post":"Another important factor to consider concerning Mr. Latendresse claim, is this : If Geoffroy de Charny would have got the Shroud from the king of France, we would certainly have a lot of textual mentions of such a royal transfer, which is simply not the case! If the relic would have come from the king himself, Geoffroy would certainly have use this fact to legitimate the exhibitions of the Shroud he did in his new chapel… Most historians agree about the fact that, on the contrary, Geoffroy (or his relatives) did not wanted to let anyone know where and when he got this relic..","date":"2015-12-02","mins":"11:08 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215580","author":"joe","post":"Most historians who studied this issue agree that a Mandylion was part of the Golden Bull of Baudouin II, which described all the relics he sold to Saint Louis. Of course, the description is not 100% clear about that, but most historians (I’m not talking about Shroud researchers like you, Wilson or others) reached that conclusion..","date":"2015-12-03","mins":"3:35 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215502","author":"joe","post":"People should note that, from the moment Geoffroy got the Shroud, its authenticity was always questioned, which is enough to understand that the king of France had nothing to do with the arrival of the Shroud in Lirey….","date":"2015-12-02","mins":"1:31 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215499","author":"joe","post":"At the time the Crusaders were surrounding the city, I think it’s fair to say that the Shroud of Christ was the most precious relic. At that point in time, it was probably bigger in importance versus the Mandylion. And if that Shroud would have been transferred by Saint Louis to Paris with the Crown of Thorns, it would have made at the very least the same big noise, which is not the case… People can ask: Then why the Mandylion did not also make a big noise at that time? The most probable answer is it is because this relic was not a relic of the Passion (which is easy to conclude when you look at the most ancient depictions of the Mandylion), on the contrary to the Crown of Thorns, which indicates the superiority of relics associated directly to the Passion of Christ for that place (Europe) and that time (beginning of the 13th Century) versus all the other relics, including the Mandylion..","date":"2015-12-02","mins":"1:23 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215503","author":"joe","post":"Also, people should understand that it’s not what happened for relics like the Crown of Thorns, for the good reason it has been transferred to Paris directly by the king of France himself… So, if Geoffroy would have got the Shroud from the king, its authenticity would not have been questioned in the manner it has been..","date":"2015-12-02","mins":"1:34 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215547","author":"joe","post":"Quote: “The statement about Philippe VI giving the Shroud to Geoffroy de Charny is from a manuscript written by a cleric of the collegiate of Lirey around 1525.” This is 200 years after the events! Even if the authenticity of the manuscript in which we can find such a claim is valid, no way you can claim that this is absolute truth! The simple FACT that the authenticity of Shroud displayed by Geoffroy was questioned from the beginning and always was afterward is enough to understand that he did not got it from the king of France. Or else, that question of authenticity would never have been raised, especially by some French bishop….","date":"2015-12-03","mins":"9:32 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215548","author":"joe","post":"The simple fact that the authenticity of Geoffroy’s Shroud was questioned from the start is enough to understand that, most probably, he did not got it through an official way… And the fact that no one seemed to have a clue about it’s previous journey before its arrival in Lirey is another good clue that back up my conclusion. The silence of Geoffroy and his family about that is also another good clue. Note that no one in his family ever mention a clear history of this Shroud before it felt in Geoffroy’s hands….","date":"2015-12-03","mins":"9:38 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215484","author":"joe","post":"If the Shroud would have been transferred from Constantinople to Paris with all the other relics Saint Louis got from Baudouin II, then, in all logic, this would have been this relic that would have been presented by the king as the most precious of all instead of the crown of thorns. The fact that, historically, it was the crown of thorns indicates that there was most probably no burial cloth with a body imprint of Jesus in that batch of relics… Here, we must remember that, based on the account of Robert de Clari, the most precious relic in Constantinople at the time of the 4th crusade was, without a doubt, this burial cloth of Jesus and not the crown of thorns. Effectively, Robert de Clari was clear about the fact that this was THE relic that was exposed each week in Constantinople and not any other relics related with Jesus… If the Shroud was really in the hands of Philippe VI at one point (this is far from being proven), it is more likely that such a precious relic would have reached Paris at another time and through a different path..","date":"2015-12-02","mins":"10:43 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215636","author":"joe","post":"We don’t have the same ideas on the subject matter. Who cares? You’re not an historian and I prefer by far to base my opinion on the pros who studied that subject. No big deal. I don’t think we need to keep on this useless debate. God bless you!.","date":"2015-12-04","mins":"1:06 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215744","author":"joe","post":"Quote: “Saint Quentin (around 1245) describes it as “a board that touched the face of the Lord, when he was laid down from the cross”.” Do you know that, in Constantinople and in some ancient version of the Abgar legend, there were 2 relics related to the Mandylion, i.e. The Mandylion itself and a tile that was showing the same image of the face of the living Christ, which is maybe what Saint Quentin was talking about… A lot of different interpretations are possible regarding the few references given by Mr. Latendresse and we should remain very prudent before coming to a conclusion that we can consider as “solid”. One thing’s for sure, if the Mandylion really got to Paris and would have been in fact the Shroud of Turin folded in 8, we would have some testimonies that would talks about this relic as being a real burial shroud, which we don’t have. Here, we must remember that it is a fact that, before he bought the batch of relics from Baudouin II (who was a relative), Saint Louis sent some people in Constantinople to watch closely these relics in order to make sure they were all “genuine”. You can be sure that if the Mandylion would have been the Shroud folded in 8, these people would have note it and the bull of Baudouin II would have talked about a shroud of Christ, which is not the case. It’s also obvious that this particular relic would have been presented by Saint Louis to the crowd as the main relic of the batch (maybe along the crown of thorns), which is not what happened. It’s also obvious that if Geoffroy de Charny would have got the Shroud from king Philippe VI as an official gift for his precious service, we would have clear and official texts referring to this, which is not the case, and the authenticity of Geoffroy’s shroud would never have been questioned the way it has been since the day he placed it on public display (and especially not questioned by the French clergy the way it has been). Finally, if that would have been the way Geoffroy would have got the Shroud, he and his family would have been proud to claim it high and loud to everyone, because this kind of royal gift would have legitimate his relic and the public exhibitions he did with it and it would also have add some prestige to it, which, once again, is not at all what happened historically. For all these reasons (and many more), most historians do not believe the Shroud ever got to Paris in the hands of Saint Louis (whether this would have been under the name “Mandylion” or not) and they do not believe Geoffroy de Charny got it as a royal gift from a king of France, whether it would be Philippe VI or someone else. I think the testimony of Robert de Clari is very important here. If people don’t rely on special assumption (like Latendresse did), de Clari’s testimony show two important facts in that puzzling mystery: 1 the Shroud was a different relic than the Mandylion (and also the tile, which he described along with the Mandylion) and 2 – on the contrary to the Mandylion and the tile, the Shroud disappeared during the sack of Constantinople in April 1204. Now, how this “stolen” shroud got in the hands of Geoffroy de Charni? This question remain to be solve, but the fact that the authenticity of his Shroud was highly questioned from the start and the fact that nor Geoffroy nor his family dared to clearly mention when and how he got it clearly indicates that this was a family secret, which can lead us to believe that he got it through a very questionable path (which is very different than Latendresse’s hypothesis)..","date":"2015-12-06","mins":"6:55 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215747","author":"joe","post":"This is a proven fact Dave that can help us see more clearly: Between the 10th and the beginning of the 13th Century, many lists of relics were made in Constantinople and NONE of these lists (including the testimony of Robert de Clari) considered the Mandylion as being a relic of the passion of Christ, while many of these lists (including the testimony of Robert de Clari) talks about a shroud of Christ as being a separate relic. Again, if we don’t rely on special assumptions, we’re lead to, at the very least, conclude that, at the same time and in the same place, there were 2 very different relics, i.e. A shroud of Christ associated to the Passion and a Mandylion that was not associated to the Passion..","date":"2015-12-06","mins":"7:49 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215746","author":"joe","post":"One last comment: When it comes to the “Mandylion was the Shroud” hypothesis (far from being a proven theory btw), people have to make a lot of wild assumptions, which is (every serious historian will tell you this) not the proper way to build historical scenarios….","date":"2015-12-06","mins":"7:08 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215490","author":"joe","post":"Quote: “It was the public processional display of a relic that marked its importance…” EXACTLY! Taking this as a fact, then we MUST conclude that, during the time of the 4th Crusade, the Shroud of Christ was truly among the most precious relics of the city, because it was put on public display EACH FRIDAY! As I know, this is a unique case for a relic of Christ during that time of turmoil in Constantinople and that, alone, is enough to prove the great importance it got in the eyes of the Emperor….","date":"2015-12-02","mins":"11:33 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215557","author":"joe","post":"Charles wrote: “Just because de Clari saw what appears to have been a single, not a double, image does not make it important.” What makes it important is the FACT that, during the time the crusaders were surrounding the city, this was this particular relic (and not something else) that was displayed each friday… This is the reason why this relic, at that particular point in time, had reached a very particular and, no doubt, a very important status for the city and the imperial court. Note that Robert de Clari talked also about the Mandylion, which was kept elsewhere in the city and which was, at that time, not placed in public display, on the contrary to the Shroud… Last thing: A shroud of Christ is often mention in lists of relics from Constantinople. The fact that none of these lists mentioned an image on it doesn’t prove that this was a different shoud than the one Robert de Clari saw in public display. We can think that, if none of these lists talked about an image, it can well be due to the simple fact that the pilgrims only saw the reliquary and not the actual cloth. And since we must wait for the testimony of de Clari to see the mention of an image, we can think that, prior to the 4th Crusade, the body image on that Shroud never was placed in public display. Also, based on the testimony of de Clari alone, I don’t think we can reach a solid conclusion on whether there was a single or a double body image on this particular cloth..","date":"2015-12-03","mins":"10:44 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215491","author":"joe","post":"And if the Shroud would have been among the batch of relics Saint Louis got from Baudouin II, we would have clear textual mentions of such a transfer, just like we got clear textual mentions of the transfer of the crown of thorns. Because there’s no such thing, we must conclude that, most probably, the Shroud Robert de Clari saw in Constantinople was not among the relics of Saint Louis….","date":"2015-12-02","mins":"11:35 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"}]
