[{"id":"comment-214741","author":"joe","post":"If we conclude the Shroud is a genuine burial cloth of a real Jew, then we must assume that the Shroud man wasn’t placed inside the Shroud in his final resting place, which was most likely a stone bench carved inside one of the tomb walls. His body must have been placed and covered by the Shroud in some other place (a place with much more space to do this job). Such a place could well have been the central room of the tomb or, this is possible, in the open air outside the tomb. If this probable scenario is truly correct (taking into account the normal configuration of Jewish tombs, it is the most logical), then we must conclude that the enveloped body of the Shroud man must have been transferred from this initial place where he was placed inside the Shroud to his final resting place inside the tomb (most likely on a small stone bench carved in a wall). In that case, it’s logical to assume that many bloodstains were already formed before the enveloped body was placed in his final resting place. It is also logical to assume that, because of this body transfer (manual transfer) from one place to another, some changes (minor or major, it’s difficult to conclude) in the Shroud configuration must have occurred before the start of the image formation, which can easily and logically explain some discrepancies between the body image and some bloodstains (like, for example, the presence of some scourge marks behind the knees in the dorsal image, in a place where there’s absolutely no body image or the presence of a bloodstain outside the frontal body image, in the area of the right elbow). In that context, Latendresse assumption that there have been absolutely no change in the Shroud configuration is most likely false (especially when you keep in mind that the body was most probably placed inside the Shroud in a different place than his final resting place inside the tomb). I must also add that this conclusion of mine doesn’t go against his other assumption (which I believe is right) that there have been no important flattening of the Shroud before the start of the image formation. On that subject, I think Jackson’s assumption is false..","date":"2015-11-17","mins":"1:17 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"id":"comment-214748","author":"joe","post":"Simply because it’s impossible to place a nearly 6 foot tall man inside a 14 feet long shroud in a small place like a niche carved into a wall inside an ancient Jewish rock tomb. That doesn’t make sense at all. The body must have been « prepared » elsewhere before being placed in his final resting place. This manual transfer must have caused some minor changes in the intial Shroud configuration. Note 1: when I say « prepared », that doesn’t mean the body was oint with burial spices or things like that. I think the only « preparation » that we know for sure is that it was placed inside the cloth with great care (because there is no smudges of blood on the cloth). Note 2: My conclusion that there was probably a small change in the initial configuration of the cloth is very different than Jackson’s assumption..","date":"2015-11-17","mins":"2:18 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"id":"comment-214753","author":"joe","post":"Here’s a typical rock bench carved in one of the walls of an ancient Jewish rock tomb : http://www.hadashot esi.org.il/Images//5485 7.jpg It’s not serious to believe the Shroud man could have been enveloped inside the Shroud in such a small niche. In all logic, his body must have been placed inside the cloth elsewhere (most probably near the niche or near the tomb) and then manually transferred to its final resting place, which was most probably that kind of small niche inside a wall. In all logic, such a manual transfer (even if it was probably short) must have created some changes (probably small) in the initial configuration of the cloth, which can explain the few discrepancies that exist between the body image and the bloodstains..","date":"2015-11-17","mins":"2:50 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"id":"comment-214754","author":"joe","post":"Following my last comment, I would use the words of the late Ray Rogers: No need for a miracle here!.","date":"2015-11-17","mins":"3:01 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"id":"comment-214742","author":"joe","post":"One small addition : Because there are not a lot of discrepancies between the body image and the bloodstains, this lead me to believe that the change in the Shroud configuration that most probably occured during the transfer of the enveloped body must have been quite minor in general. The only question I left open is if there were some small parts of the cloth’s configuration that changed more drastically between the time the Shroud man’s body was initially placed in the cloth and the start of the image formation… Hard to say for sure..","date":"2015-11-17","mins":"1:24 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"id":"comment-214668","author":"joe","post":"It’s probably to early to talk about that, but I will anyway. Simply, I would like to help people push their reflection a bit further… Even if it’s natural and very okay to pray for the victims, is there one single Christian who will remember those words of Christ and put them in practice?: “But I tell you, love your enemies and pray for those who persecute you, that you may be children of your Father in heaven. He causes his sun to rise on the evil and the good, and sends rain on the righteous and the unrighteous.” (Matthew 5:44 45) And what if it would not be by praying for these sick people (so that they could see the light and get out of their darkness) that something could finally change in this sick world? These words of Christ tell us who God really is and, obviously, he’s very different than us, because he loves and saves everyone of his children, even those who seems, for us, to be definately lost. When you read “scandalous” words like the ones I gave you, it’s not surprising that Jesus got killed by his Jewish brothers… God is very different than us. God is love and we all are sinners….","date":"2015-11-16","mins":"1:34 pm","url":"https://shroudstory.com/2015/11/14/paris/","cat":"news_&_views","title":"Paris"},{"id":"comment-215820","author":"joe","post":"Ask any serious historian that has no book about the Shroud to sell what he thinks of Wilson… Most of them do not accept at all his point of view about the Shroud… They know that most of his hypotheses are mainly based on assumptions and speculations, which is not a way to do history that is accepted by them..","date":"2015-12-07","mins":"2:09 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216005","author":"joe","post":"I think that it is stated in the “Narratio de Imagine Edessena” that this relic was displayed once a year for a certain feast (I don’t remember the name of the feast)… It’s evident that if this is an historical fact and that this relic was in fact the Shroud, people in Constantinople would have easily noticed the bloodstains in the face area of the cloth and would have understand that this was a relic of the passion! People of this time and place were not dumb! In that context, since every lists of relics made in Constantinople never placed the Mandylion under the tag “relic of the passion” (on the contrary to many other relics, including a shroud of Christ), we’re lead to conclude that this relic was exactly what it was reported to be, i.e. A small towel showing only the face of the living Christ, which would have been miraculously imprinted there after Jesus would have washed his face with water..","date":"2015-12-09","mins":"10:36 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216153","author":"joe","post":"Any public display of a holy relic is showing just that: a holy relic! Not just the reliquary….","date":"2015-12-10","mins":"1:02 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216128","author":"joe","post":"Thinking that during a public display of an holy relic, the Church was only showing the reliquary and not the relic is completely ludicrous and show quite clearly the important bias of Mr. Latendresse about this whole issue. Fortunately, that’s not at all how real serious historian are working!.","date":"2015-12-10","mins":"9:46 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216130","author":"joe","post":"It’s not because people were not allowed to check the relic with a microscope that they wouldn’t have been able to note the bloodstains if the Mandylion would have been the Shroud. We must remember that these particular stains are the things that are the most easy to see on the Shroud and even at a pretty good distance..","date":"2015-12-10","mins":"10:14 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"}]
