[{"id":"comment-215360","author":"joe","post":"I think that, for both the Shroud and the Sudarium, the only way we could scientifically get to the conclusion that there’s a solid probability for authenticity or for fake is not through historical researches (even if such researches are important), but through a new series of C14 dating done more properly this time (and maybe supported by another dating technique that would be recognized by most of the scientific community as accurate, if such a technique exists). Until that time, speculations and ad nauseam debates between pros and cons will continue without any real tangible results….","date":"2015-11-30","mins":"10:49 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215640","author":"joe","post":"That’s a very good point raised by David Mo. I have a tendency to think the same and that explain why I’m much more skeptical about the probability of the Sudarium to be genuine. People should remember that, on the contrary to the Shroud radiocarbon dating and Raymond Rogers’ Thermochemica Acta’s paper, we don’t have any solid facts or data published in the scientific literature that can seriously explain why the 2 radiocarbon dating of the Sudarium should be considered inaccurate… And we must remember that the 2 radiocarbon dating of the Sudarium are close to match the first known appearance of the relic in Spain..","date":"2015-12-04","mins":"1:56 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215644","author":"joe","post":"I would rather say “Contamination CAN BE a big problem…” In the case of the Sudarium, there’s nothing in the scientific literature that can back up the idea that some contamination could have changed the dating results, which are still quite far from the 1st Century A.D..","date":"2015-12-04","mins":"2:18 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215642","author":"joe","post":"Quote: “That is because they have learnt about developments in science, which seem to clash with what the Bible tells us.” I think these Christians should start to reconsider the whole idea (which is wrong in my mind) of the Bible being the “word of God”… In fact, I believe it is much more the “word of some men from Antiquity about God”, which explain the discrepancies between some claims, data and events found in that book and the discoveries of science. Jesus didn’t wrote one word of the Bible. No more for his Father… I don’t say that some of the things we find in the Bible are not inspired by the Holy Spirit, but there’s a big gap between a word inspired by God (which can be “translated” more or less accurately) and the exact word of God….","date":"2015-12-04","mins":"2:07 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"}]
