[{"id":"comment-87099","author":"mike_m","post":"Hi Hugh, sorry for jumping in. Just to clarify some points: 1 Alan Adler, Baima Bollone and Ray Rogers all independently confirmed that there is no image under the blood stains (even under the clear serum stains) 2 if human blood was placed on a hot statue it won’t be blood anymore. & if the blood was placed on a cold statue then how was the image etched on the cloth? 3 nobody said their description was perfect especially as you have indicated, the translation was clumsy. The blood on the small of the back may look like a stain from a chain. That’s because they didn’t make the connection with the side wound producing blood in two different (vertically when the body was on the cross and horizontally in the tomb). 4 I don’t see the connection between the quality of the patches and their account of the shroud? They were nuns not tailors..","date":"2014-03-10","mins":"7:28 pm","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"},{"id":"comment-87092","author":"mike_m","post":"John, (Halava, you make me hungry now) I agree. The direction of the image process was up. Orthogonal to the horizontal plane..","date":"2014-03-10","mins":"7:17 pm","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"},{"id":"comment-89200","author":"mike_m","post":"Hi Hugh, with regards to Bollone indicating the absence of image under the blood stains. Kelly Kearse has quoted Bollone saying this on a previous post here( I just took his word for it). Please read post#44 on this thread https://shroudstory.com/2014/02/12/breaking news another day another solution to the image and the carbon dating/#comment 79107 Rogers also mentioned the same observation in his book “A Chemist’s Perspective on the Shroud of Turin” even though as you say it goes against his hypothesis which is another reason (beside reconsidering the patch hypothesis) to respect Rogers as truth seeker rather than dogmatic. Rigor Mortis was identified by experts who have a “trained eye” in forensic pathology. Medical examiners who have performed thousands of autopsies overwhelmingly confirmed these observations. Your philosophical consideration is well taken but I don’t think it explains that fact away. I realize you don’t want to give more details about your toothpaste thick paint. I just want you to try something for me, I happen to paint from time to time, with oil, acrylic and water colours. I want you to try to paint anything with a toothpaste and see what will come out of it. You will soon discover how impossible it is to replicate the photographic details and realism of the shroud image..","date":"2014-03-15","mins":"9:09 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"},{"id":"comment-86922","author":"mike_m","post":"I know that the Holland cloth was made of linen (simple 1 on 1 weave) I think the patches were linen too but I am not sure. I used to respond to Hugh’s remarks with a knee jerk before. I’ve become more used to them now, I think that one was tongue in cheek related to the conspiracy theory thread on the other post..","date":"2014-03-10","mins":"8:56 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"},{"id":"comment-87077","author":"mike_m","post":"Clublu22014, thank you for the nice words, I don’t think I deserve them. The image on the back of the cloth is still debated. A poor photograph of the backside of the shroud is available in the following link (hat tip to Hugh) http://shroud.wikispaces.com/PROPERTIES As you can see, ( or can’t see) it doesn’t look that there is an image there. G. Fanti believes there is, and has published a paper describing that image. He used filters to decrease background noise and increase contrast, according to him the image on the back is: 1 superficial (i.e doubly superficial) 2 only for the ventral figure not the dorsal one. 3 three dimensional. 4 corresponds to the front image location. 5 slightly different from the front image (e.g. The nose on the back presents “the same extension of both nostrils, unlike the front side, in which the right nostril is less evident.” I believe the church has in its posession high definition images for the backside that has not been published yet, lets hope they release it sometime in the future. I personally believe the veil of Manoplello to be a painting. There is clearly brush strokes evident around the lips and the eyes. To me, it looks like a work of art. However, I believe the Sudarium of Oveido to be the facecloth that was mentioned in (John 20:7) “and the face cloth which had been on His head, not lying with the linen wrappings, but rolled up in a place by itself.” Mark Guscin has done a great Job bringing the sudarium to light. This video from You Tube explain a lot about the sudarium. Http://m.youtube.com/watch?list=P Lb Bb BRYEF Bb3h Po c SF 9eikve1p E Nm5k&v= ojy ZX5 iy U&feature=plpp.","date":"2014-03-10","mins":"6:05 pm","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"},{"id":"comment-87066","author":"mike_m","post":"Daveb, thank you for that paper. The nuns described the shroud with amazing attention to detail. It’s interesting to see that “all the counts and barons” “nobles, Ecclesiasticus and priests”…”after diligently examining it on one side and on the other” testified that it was the same shroud they saw before the fire”. So much for the “carefully place burn holes destroyed the evidence” conspiracy theory. Those people have seen the complete figure on the shroud before the fire, just like the copies made before the fire that also had the complete figure with no arms broken off. You are right Hugh, I don’t think I should waste anymore time on it either..","date":"2014-03-10","mins":"5:22 pm","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"}]
