[{"id":"comment-78299","author":"mike_m","post":"Thanks Annette.","date":"2014-02-11","mins":"9:00 am","url":"https://shroudstory.com/2014/02/10/anatomical-accuracy-chart/","cat":"uncategorized","title":"Anatomical Accuracy Chart"},{"id":"comment-165408","author":"mike_m","post":"I really enjoyed this paper, the author filled in a gap in shroud research and managed to find an actual specimen from the first century that could inflict wounds very close to the ones we see on the shroud. Offcourse most whips were made from leather and thus cannot survive to our time. But her research shows that the wounds are consistent with first century tools of torture..","date":"2014-10-25","mins":"6:06 am","url":"https://shroudstory.com/2014/10/25/a-st-louis-paper-already-online-the-roman-flagrum/","cat":"paper_chase","title":"A St. Louis Paper Already Online:   The Roman Flagrum . . ."},{"id":"comment-125261","author":"mike_m","post":"Nice find, but just because we don’t have an exact surviving scourge that would match the injuries suffered by the man on the shroud doesn’t take anything from the authenticity case. The historic record indicate that the Romans were very creative in inventing different torturing methods. I think it’s fascinating that the shroud shows injuries that was not seen in conventional artwork, were very realistic (fanning from both sides, different marks in different areas, curve with the body in 3 D), forensically accurate (serum retraction rings) and consistent with what historians described as a roman flagrum (multiple thongs with bits and knots at the end) how many thongs and how many bits or what their shape was, who knows. These soldiers had many options to choose from or even create themselves(crown of thorns).","date":"2014-05-28","mins":"10:15 am","url":"https://shroudstory.com/2014/05/28/goodness-me-look-what-ive-found/","cat":"flagrum","title":"Goodness me, look what I’ve found"},{"id":"comment-104540","author":"mike_m","post":"I agree, Pia was working under extremely difficult lighting conditions, a glass cover to the shroud and photography was not well developed. But the oval object can even be seen in Pia’s photograph (albeit very faintly). The point I was trying to make is that it could be part of the image. If that’s the case then it predates Pia’s image and would be seen by Byzantine artists..","date":"2014-04-27","mins":"7:59 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","title":"More on How Valid are the Vignon Markings?"},{"id":"comment-104786","author":"mike_m","post":"Nice slide show Dave, the best I’ve seen on the Mandylion so far. Thanks for sharing..","date":"2014-04-28","mins":"7:15 am","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","title":"More on How Valid are the Vignon Markings?"},{"id":"comment-104992","author":"mike_m","post":"I don’t think the 1st point is Valid. Vignon was comparing the Shroud to what Byzantine artists were observing. Since Byzantine artists didn’t have high definition images of the shroud then Vignon would have no disadvantage there..","date":"2014-04-28","mins":"12:34 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","title":"More on How Valid are the Vignon Markings?"},{"id":"comment-105184","author":"mike_m","post":"How did you know?.","date":"2014-04-28","mins":"6:09 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","title":"More on How Valid are the Vignon Markings?"},{"id":"comment-104802","author":"mike_m","post":"Good job OK. I think it takes a lot of Faith in skepticism to deny the connection.","date":"2014-04-28","mins":"7:29 am","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","title":"More on How Valid are the Vignon Markings?"},{"id":"comment-104479","author":"mike_m","post":"In the original post, Hugh said, “Well I’ve now looked in enormous detail at Pia’s photos (try these for size! http://www.shroud of turin.org/images) and there is no crease. Not a smidgin. The crease is modern. No old painting can be based upon it.” I agree, there may be no crease there. It is possibly an oval object that is even clear in Pia’s images. The lower edge of that object is more apparent, but the whole thing is not shaped like a crease would be. Please refer to Vernon Miller’s images in this link http://shroud3d.com/findings/solid oval object under the beard.","date":"2014-04-27","mins":"5:32 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","title":"More on How Valid are the Vignon Markings?"},{"id":"comment-122372","author":"mike_m","post":"What I find striking in this one is the blood stain on the forehead..","date":"2014-05-20","mins":"9:59 pm","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","title":"The Vignon Markings Issue:  A Promoted Comment"},{"id":"comment-104533","author":"mike_m","post":"According to Coptic tradition, St. Mark walked till Alexandria (Northern Coast of Egypt) where his sandals were damaged from the long trip. He went to Ananias (a cobbler) to fix them, that’s when he shared the Gospel with him. He became the first Coptic Christian, and the coptic church started then (later became Bishop)..","date":"2014-04-27","mins":"7:42 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","title":"More on How Valid are the Vignon Markings?"}]
