[{"id":"comment-101493","author":"mike_m","post":"” the Shroud of Turin, the piece of linen that that some believe to have been wrapped around Jesus’ body after the crucifixion and others debunk as a medieval fake following radiocarbon tests. The Vatican itself remains neutral on the issue. Since we know a lot about the shroud. I think this weak argument against it, that runs away with the C14 dating and fails to mentions any of its unique characteristics sums up the typical Neo Atheist bias here. We all know there is a lot more than what the author mentioned here and that her assessment was truncated. The same can be said about the camels, Adam and Eve and the flood. There is a lot more than what she mentions here…..a lot more. Here is what the smithsonian institute department of archeology had to say about the historicity of the biblical accounts “…..In short, it is impossible to verify the actual events recorded in the Biblical account of the flood. On the other hand, much of the Bible, in particular the historical books of the old testament, are as accurate historical documents as any that we have from antiquity and are in fact more accurate than many of the Egyptian, Mesopotamian, or Greek histories. These Biblical records can be and are used as are other ancient documents in archeological work. For the most part, historical events described took place and the peoples cited really existed. This is not to say that names of all peoples and places mentioned can be identified today, or that every event as reported in the historical books happened exactly as stated. There are conflicts between present archeological evidence and historical reports that may result from a lack of information on our part or from misunderstandings or mistakes by the ancient writers.”.","date":"2014-04-19","mins":"9:44 pm","url":"https://shroudstory.com/2014/04/19/happy-easter-from-discovery/","cat":"history","title":"Happy Easter from Discovery"},{"id":"comment-170006","author":"mike_m","post":"OK, I noticed that the Halo proposed by Rev. Schumacher is lighter than the surrounding cloth which would match what happens to un bleached linen. I remember going over this point with Hugh before, Bleached linen (Holland cloth) on the contrary would darken when exposed..","date":"2014-11-09","mins":"12:10 am","url":"https://shroudstory.com/2014/11/08/a-detailed-response-to-the-halo-study/","cat":"history","title":"A Detailed Response to The Halo Study"},{"id":"comment-125010","author":"mike_m","post":"Well said, In Sunday school, the shroud captures the attention of youth like nothing else. Most of them don’t know anything about the shroud and are fascinated by the research put into it..","date":"2014-05-27","mins":"7:58 am","url":"https://shroudstory.com/2014/05/27/the-shroud-as-a-sunday-school-tool/","cat":"news_&_views","title":"The Shroud as a Sunday School Tool"},{"id":"comment-101496","author":"mike_m","post":"Correction….Department of “anthropology”.","date":"2014-04-19","mins":"9:46 pm","url":"https://shroudstory.com/2014/04/19/happy-easter-from-discovery/","cat":"history","title":"Happy Easter from Discovery"},{"id":"comment-167660","author":"mike_m","post":"“Had the order been reversed, the painting hypothesis — suggested by history — could have been specifically tested.” Had you done your homework you would’ve known that the painting Hypothesis was specifically tested during STURP expedition. Why are people so ignorant?.","date":"2014-11-01","mins":"12:05 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168062","author":"mike_m","post":"Also, If you really want to see the anatomical proportions of Medival art (even when copying from an anatomically accurate image) see the Tibio femoral index in page 14 of this paper http://www.shroud.com/pdfs/marineli.pdf.","date":"2014-11-03","mins":"12:07 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-170922","author":"mike_m","post":"Aljones, do you have any specifics re assumptions, uncertainties, plucking numbers? So far you have given me nothing scientific. “3 piles of crap” what’s your evidence for that beside your subjective opinion? You say Fanti believe in the shroud because of a personal experience, however this doesn’t prove a fault in his science. Again, what do you have scientifically speaking against his scientific paper beside your personal opinion? How does your personal belief in Jesus (or as I am quiet sure lack thereof) affect your opinion on the authenticity of the shroud? Don’t answer that question just think about it yourself. How do you know that Luigi’s experiment was faulty because of the baking step? You say Dan has given examples of photographs with 3 D info do you believe the shroud was a 13th century evenly lit photograph? So far Aljones all I get from you is a personal opinion I was hoping for more because unfortunately I don’t have time for personal opinions. So again, Ciao!.","date":"2014-11-12","mins":"7:26 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-167722","author":"mike_m","post":"“STURP did not have any expert on medieval painting on their team nor did they consult any so one can hardly take their report seriously” If STURP work cannot be taken seriously because they didn’t have an expert on medieval painting then your work cannot be taken seriously because it was not co written by a scientist. Colin is right, you should’ve taken his advise. I won’t go on educating you on what STURP did, you can try to put aside your bias and read it again yourself..","date":"2014-11-01","mins":"3:44 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-167939","author":"mike_m","post":"“he has proven time and time again that he consistently ignores other valid and often stronger viewpoints” Thomas, I completely agree, this thread clearly demonstrates that claim..","date":"2014-11-02","mins":"3:01 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-167900","author":"mike_m","post":"“Faccini is able even to distinguish them from each other so easily” False, Again. Here is what Faccini wrote in her own paper, if you have really read it. “Image processing and contrast enhancement of the 2000 Gian Durante photos allowed distinction of three different types of scourge marks.” “they would have merged into each other” They did.. Read the paper “Not all scourge marks are well featured, they are faint and OFTEN OVERLAPPING and have a colour so similar to that of the body imprint, that it is very DIFFICULT to achieve an OBJECTIVE DISCRIMINATION between scourging traces and what can be considered as “blank” noise”(emphasis mine this time because, as Thomas indicated, no one is listening on the other side) See http://www.ohioshroudconference.com/papers/p19.pdf.","date":"2014-11-02","mins":"9:50 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-167938","author":"mike_m","post":"“if you google Faccini ‘s article that she wrote with Fanti and look at the images of the scourge marks you can see that they cannot be the result of an actual flagrum tearing into flesh” I can’t take your claim seriously because you are not a forensic specialist and you haven’t consulted one. “all publicity is good publicity” Completely agree, which is why I think your article will ultimately increase interest in the shroud. Those who already reject the shroud will be further mislead, while those who are willing to look further and do their own research will find out the absurdity of the painting hypothesis..","date":"2014-11-02","mins":"2:57 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-167958","author":"mike_m","post":"Sorry Charles, you are not an authority on this subject, I can’t take your work seriously. I advise any interested reader to look further into the works of Dr. Piere Barbet ( chief surgeon at Saint Joseph’s Hospital in Paris.) http://en.m.wikipedia.org/wiki/Pierre Barbet (physician) Dr. Robert bucklin (M.D., J.D. Las Vegas, Nevada) https://www.shroud.com/bucklin.htm Dr. Frederick T. Zugibe (M.D., Ph.D.Adjunct Associate Professor of Pathology, Columbia University, College of Physicians & Surgeons, N.Y. Chief Medical Examiner, Rockland County, N.Y.) https://www.shroud.com/zugibe2.htm Dr. Gilbert R.Lavoie (M.D.) http://shroudofjesus.com/page8.html Dr. William D. Edwards M.D. Et al. Http://www.godonthe.net/evidence/on the physical death of jesus JAMA.pdf Dr. Pierluigi Baima Bollone, (a professor of forensic medicine in Turin) https://shroudofturin.files.wordpress.com/2013/12/bbk 7.pdf Dr. Niels Svensson (M.D.) http://www.catholic.com/profiles/dr niels svensson God Bless,.","date":"2014-11-02","mins":"4:59 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-167733","author":"mike_m","post":"“Are you a painter”.. Offcourse not here is what a real painter thinks about the shroud http://www.shroud.com/piczek.htm.","date":"2014-11-01","mins":"4:39 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-167797","author":"mike_m","post":"“FOR A CONTINUOUS IMAGE TO EXIST ON A PAINTING, WHILE THE PAINT MEDIUM HAS RETURNED TO DUST OR JUST TINY GLOMERATES, LEAVING THE MILIMICRON PIGMENT PARTICLES WITHOUT TIGHT ADHESION TO THE GROUND OR TO THE SUPPORT WOULD BE TOTALLY AGAINST THE LAWS OF NATURE, SCIENTIFICALLY INACCEPTABLE AND A TECHNICAL IMPOSSIBILITY REGARDING THE PRACTICE OF ART. This would be harder to explain than the Turin Shroud itself.”(Isabel Piczek, upper caps in original document).","date":"2014-11-01","mins":"11:05 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-169677","author":"mike_m","post":"Fasing=fading.","date":"2014-11-07","mins":"7:06 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168058","author":"mike_m","post":"Aljones, You should consider that the cloth was draped over a real 3 D face with tenting around the nose that would make it appear longer. As Ray Downing said in his award winning documentary “The Real Face of Jesus”.. “What you see on the shroud is not a picture of a face, it’s a database of information” Start at 1:19:00 https://m.youtube.com/watch?v=WNJPJ4 Jw He E Besides, I don’t really see a big differences when compared to a real human face On a separate note, the shroud anatomical proportions are consistent with a human figure, even to the extent of the chest muscles being raised as in a person who died with his hands raised above his head. See https://shroudstory.com/2014/02/10/anatomical accuracy chart/ No wonder the agnostic professor of Comparative anatomy, Yves Delage, declared the Shroud “anatomically flawless”.","date":"2014-11-02","mins":"11:57 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-169674","author":"mike_m","post":"Aljones, the deafening silence was because I thought I answered your question. Beside artists guidelines for do you have any scientific rigor behind the ratios you claim? I gave you the Tibiofemoral index as an example to show how medival art falls short in matching the anatomy of the shroud? I also referred you to a nice video clip that explains why the dimensions of the face may be distorted. Did you see the video? The defeaning silence was more at your part not mine. Another problem with measuring the top of the head is that you can’t really pinpoint the top of the head, there is a waterstain and a blood stain in the same spot and the Shroud image is orthogonal in nature fasing the further away from the body and we don’t know for sure if there was a head band tied around the head to keep the chin closed or not (There was a lot of discussion on this blog before about this issue) if there was one then that cloth could’ve prevented imaging of the top of the head. There are lots of loopholes in your claim that your observation proves the shroud a forgery. It doesn’t prove anything..","date":"2014-11-07","mins":"6:55 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-169963","author":"mike_m","post":"Aljones, I am glad I could be of help in your serious pursuit of the truth..","date":"2014-11-08","mins":"8:18 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-170092","author":"mike_m","post":"“It’s not the truth shroudologists seek – it’s the TRUTH” Sorry Aljones, you are wrong again. Science does not equal truth because it changes all the time, based on the current knowledge. How many drugs were pulled off the market after being declared safe with many peer reviewd science only to discover later that it causes more damage than good? It does not even claim to equal truth. It provides a method to reach the truth but it is only a method not an endpoint. And since you are so eager for scientific truth I was hoping for the TRUTH behind the ratios you purport discredits the shroud? Are you still looking for them? if you don’t find them will you admit you were wrong? With regards to the video of the real face of Jesus, I never claimed it to be science. I was trying to demonstrate something for you. However the 3 D information embedded in the shroud image is well known and acknowledged by believers and skeptics alike. In fact you can see it for yourself by downloading any image processing software (e.g.Image J being one of them). Here are some papers for you which I know you wont even bother but here we go; http://www.shroud.com/pdfs/schumchr.pdf http://www.dii.unipd.it/ giulio.fanti/research/Sindone/Art.%203 D%20 Dig.%20 Imaging%2012.pdf.","date":"2014-11-09","mins":"9:26 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-170486","author":"mike_m","post":"Aljones, sorry this may be my last posting on this thread because its going no where. You present yourself as an advocate for science, “science is TRUTH” you say. However, you have failed so far to present any scientific rigor behind the ratios that started the whole discussion. Furthermore, to prove your point you resort to Ad Hominemns “Fanti….really”, single handed inventor of 3 dating method” Since when was the number of inventions someone makes considered derogatory? I also find your posts very subjective, which is not very scientific if you think about it.” I find the idea…overblown…not terribly impressive” and why?…nothing, just because you said so. Did you compare the shroud’s 3 D relief to the 3 D relief of a real painting? offcourse not. You consider that C14 test hard science. Since when was using a single sample from a contaminated corner that has been proven heterogenous considered “hard” science. It was nice talking to you, hope one day you think objectively about the subject, may be then we can have another discussion, Ciao!.","date":"2014-11-10","mins":"7:11 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-170603","author":"mike_m","post":"Http://www.researchgate.net/publication/257346138 Non destructive dating of ancient flax textiles by means of vibrational spectroscopy & https://www.shroud.com/pdfs/thibault lg.pdf.","date":"2014-11-11","mins":"8:00 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-78211","author":"mike_m","post":"Actually many did, refer to Gregory’s sermon, Yves Delages, Paul Vignon & Ray Rogers. BTW I don’t believe it is a sweat imprint, but the first impression would be an imprint that came from contact with the skin and left a wet look on a piece of cloth. I can definitely understand where they are coming from..","date":"2014-02-10","mins":"11:04 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77601","author":"mike_m","post":"Hugh: I am not a pathologist, but I am a health care professional (pharmacist). This is not my speciality and I agree, a pathologist would help by weighing in here, but this is just my 2 cents. As Kelly indicated i believe it is a cumulative effect. One thing comes to mind that may help is with diabetics who are on insulin and suffer a hypoglycaemic coma. The treatment for this in ambulatory setting is a glucagon injection which can be administered by relatives or friends and it works by releasing glucose from glycogen stored in the liver. This is not the case with people who are suffering malnutrition. In that case a glucagon injection cannot be used because there is no glucagon stored in the liver. The bible doesn’t mention Jesus eating since the last supper and he was under extreme physical and emotional stress all night. He walked to gesthemani and was up all night in prayer (for comparison, all his disciples couldn’t stay up with him because they were too tired)., sweating blood ( which happens under extreme stress) then they had to walk to Annas, then to caiaphas, back to pilate, Then to Herod and finally back to pilate, all this walking at the end of the day, instead of sleeping (I don’t know exactly how long but I am sure from the map it looks like a minimum 1.5 km each trip (just an estimate). He was being beaten and mocked all through this. Then he was scourged severely, Scourging is enough to reduce a person into a pile of flesh. Mocking & beating at the praetorium by a roman batallion (480 600 men heavy infantry) then he had to carry the cross to Golgotha. He couldn’t do it without the help of Simon, proving that he was completely consumed by then. I believe all this contributed to rapid rigor Mortis..","date":"2014-02-08","mins":"8:51 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77545","author":"mike_m","post":"Hugh: It’s not a matter of half as long or one third the time. It’s how much ATP was in the muscles at the time of death. No ATP…no muscle contraction/relaxation. The muscle tissue stores carbohydrates (for energy) as Glycogen. In cases of extreme physical exertion there is no glycogen left in the muscle tissue because it has all been consumed. Glucogen is needed for ATP production.. I.e. Extreme physical stress=no glycogen left= no ATP production= rapid Rigor Mortis. Dr. Zugibe mentioned a situation in which a victim was running for his life and was shot while running. He claims ( and I have no reason to doubt this) that when he was called to the scene the victim was stiff in the running position. That means stiffness kicked in almost instantaneously. The timings listed above probably reflects average amounts of ATP in a normal situation, it’s a whole different story when the body has been through physical exertion before death, and it cannot be estimated by fractionation..","date":"2014-02-08","mins":"4:46 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77749","author":"mike_m","post":"Correction: “there is no Glucagon stored in the liver” should be “there is no Glycogen stored in the liver”.","date":"2014-02-09","mins":"9:22 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77752","author":"mike_m","post":"John: one thing that really speaks volumes about Baden’s assessment is that he completely dismissed the side wound as being “an area of darkening” in the cloth and not an injury. If he missed that much of a blood stain, it makes me doubt one of two things. His Judgment or the quality of the images which he examined..","date":"2014-02-09","mins":"9:39 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77839","author":"mike_m","post":"Hugh: it’s mentioned in Zugibe’s book ” the crucifixion of Jesus A forensic inquiry” chapter 14, page 212, under the title “Rigor Mortis”..","date":"2014-02-09","mins":"3:47 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77853","author":"mike_m","post":"Hugh, I am pretty sure I heard Zugibe phrase it differently in an audio interview. When you asked for reference I went to his book, not sure if I will find it there or not. I do realise he says “immediately” rather than my “instantaneously” but I think from the context it can be understood that he found him in the running/jumping over a fence position. If I find that audio I will let you know..","date":"2014-02-09","mins":"4:37 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77879","author":"mike_m","post":"Highly unlikely that someone would go to such details in an artwork (statue or painting), let alone demonstrate it in reverse. Who would appreciate these features Ina negative image?. I hope someone of the scorch camp would be able to mention an example from the Middle Ages that rise to that exactitude. I have other reasons to doubt the scorch hypothesis. The lack of fluorescence in UV light(while scorches did), the image invisibility in transmitted light(while scorches did) the mismatch of the colour of the lightly scorched fibres under the microscope with that of the image fibres(as demonstrated in Mario’s Shroudscope photomicroscope images). The lack of lumen discolouration in image fibres ( unlike scorched fibres, as demonstrated by Rogers). The impossibility of having a full body scorch without over burning/under burning fibres. I also really enjoyed Thibault’s paper on scorching linen which demonstrated the fallacy of this claim..","date":"2014-02-09","mins":"6:17 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77897","author":"mike_m","post":"Thanks John.","date":"2014-02-09","mins":"7:52 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78208","author":"mike_m","post":"Hi Annette, I didn’t say you were. I was just refuting De Wessellow’s hypothesis, nothing personal..","date":"2014-02-10","mins":"10:53 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78220","author":"mike_m","post":"“Only real source for the tremendous inspiration to write above and beyond stories of one exceptional god man to surpass all others of the time and culture and to have those stories survive and thrive unto the age of ages would be the one empirical source–the Turin Shroud.” Or the resurrected Christ and the power of the Holy Spirit after Pentecost..","date":"2014-02-10","mins":"11:34 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78192","author":"mike_m","post":"So Paul was blinded by a piece of cloth. Peter was crucified upside down because of a piece of cloth. A piece of cloth was eating with the disciples by the lake and advised Peter to take care of his followers. Mass halluscinations take place because 500 people thought they saw Jesus while really they were looking at a piece of cloth with a strange image. Sorry Annette, there is nothing to back this hypothesis and everything to back the life changing experience the disciples had by encountering the risen Christ. A first century burial cloth would be a defilement to the early Christians (who were really Jews who found their Messiah) far from an evangelizing tool, it would elicit severe rejection from Jews. If there was an image at that time (and not a latent process as some suggest) it would be regarded as a “sweat imprint” of a corpse rather than the “resurrected christ”. The good thing from this hypothesis is that it shows how powerful the mystery of the shroud is, to the extent that agnostics/atheists like De Wessellow would go so far to reconcile his lack of faith with the fact that is shroud..","date":"2014-02-10","mins":"10:02 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-122826","author":"mike_m","post":"“I think it was the experience of the risen Christ that was the impetus for the Jesus movement, the primitive Church, the reason for a complete change in the attitude of the apostles.”. ….Well said.","date":"2014-05-21","mins":"5:42 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-171396","author":"mike_m","post":"“Christ has died, Christ has risen. Christ will come again. To borrow a quote from Rabbi Hillel: “Everything else is commentary.” Thanks John, you hit the nail on the head..","date":"2014-11-15","mins":"8:22 am","url":"https://shroudstory.com/2014/11/15/john-of-john-the-servant-of-the-priest-that-also/","cat":"history","title":"John of . . . , John the . . . ,  Servant of the Priest? That Also?"},{"id":"comment-100261","author":"mike_m","post":"Dan…2000 more views and you hit 2millions. Congrats.","date":"2014-04-17","mins":"7:07 am","url":"https://shroudstory.com/2014/04/17/maundy-thursday/","cat":"history","title":"Maundy Thursday"},{"id":"comment-114970","author":"mike_m","post":"“the extension of the length of the shroud up above Christ’s head is interesting. It certainly implies that the shroud then came down and covered Christ’s front, like “The Shroud” What a beautiful observation. I think this is very significant..","date":"2014-05-08","mins":"7:59 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-116750","author":"mike_m","post":"“The matching is done only on a range lesser than 20 instances. This is scandalously insufficient.” I take this as a learning experience. What is considered “honorably sufficient” in comparing to pictures and what is your reference. “Surely, M. Vignon worked with a picture of small seizure or similar” Again please educate me, what picture size did Vignon work with and what is your reference? Sorry, if you can’t educate me on those 2 questions that you proposed in your comment, then I have to agree with OK’s opinion..","date":"2014-05-11","mins":"7:10 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-114722","author":"mike_m","post":"” Why is the weave worth representing in the artwork?” Possibly because it can be represented in art (as a zigzag line) it’s also unique, rare and high quality weave. “Unless there is a lost source artwork that did capture it (for a reason)” Why would there be a “reason” for artwork Q but none for the pray codex. Any “reason” for depicting a herringbone weave in the lost “artwork Q” would apply to the found artwork (e.g. Pray codex). I don’t get the point you are trying to make?.","date":"2014-05-08","mins":"12:34 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-116747","author":"mike_m","post":"Check @22:20 mark Audience: ” Mr. Schwortz, that was a great lecture but you will never convince me” Barrie:”what makes you think I even care what you believe. This is between you and God. Take it up with Him”.","date":"2014-05-11","mins":"6:58 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-118281","author":"mike_m","post":"These are your own words not mine, “There is not any statistical survey about the Vignon marks. The matching is done only on a range lesser than 20 instances. This is scandalously insufficient” If you don’t believe me scroll up to May11; 4:10am comment of yours. Whose mistaken?.","date":"2014-05-13","mins":"12:03 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-117685","author":"mike_m","post":"You don’t teach because you don’t know. Your answer to OK was scandalously lacking of any criteria you used to declare 20 similar features were “scandalously” insufficient for comparing two images. So I guess the questions remain unanswered, and OK’s opinion of you stands..","date":"2014-05-12","mins":"7:25 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-115048","author":"mike_m","post":"Dave, you are correct. There are a lot of oral traditions that has translated to a trail of churches and monasteries built on their proposed path. As a teenager I was on a week long bus trip organised by my church that visited most of these sites. One of the best trips I’ve ever had in my life. This link has images to a lot of the sites visited. Http://www.touregypt.net/holyfamily.htm.","date":"2014-05-08","mins":"10:05 pm","url":"https://shroudstory.com/2014/05/08/more-on-the-letter-from-alexius-comnenus-never-have-preconvictions-about-relics/","cat":"history","title":"More on the Letter from Alexius Comnenus:  Never have preconvictions about relics"},{"id":"comment-142008","author":"mike_m","post":"Very interesting take on the spelling of Caiaphas, https://www.osv.com/OSV Newsweekly/Article/Tab Id/535/Art MID/13567/Article ID/3842/Head and Corner Stone.aspx.","date":"2014-08-03","mins":"12:16 pm","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-141695","author":"mike_m","post":"What an amazing lecture, one of the best speakers I ve seen in a long time..","date":"2014-08-01","mins":"8:15 pm","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-142001","author":"mike_m","post":"Hi Louis, do you have a link to that paper? I need to look further.moat references say it’s disputed but they end up with the conclusion that it is indeed Caiaphas’ probably not putting much emphasis on the spelling mistake. Is Qupha even a Jewish name?.","date":"2014-08-03","mins":"11:39 am","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-142029","author":"mike_m","post":"Miriam’s ossuary proved that Caiaphas was historic figure. The inscription even assigns the priestly line of Ma’aziah, instituted by king David to him. I don’t personally rely on history to prove Jesus but some people do. Others claim that Jesus, Pilate, Caiaphas never existed. To those archeology is a very important piece of the discussion..","date":"2014-08-03","mins":"2:42 pm","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-142017","author":"mike_m","post":"I agree we should bury Caiaphas, but as it stands, the ossuary is important in the argument for a Historic Jesus. As Hugh mentioned, the Ossuary of his daughter is probably even more important in that regards..","date":"2014-08-03","mins":"1:17 pm","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-141906","author":"mike_m","post":"Hi Hugh, I think you’re mistaken. The high priest’s name was Joseph Caiaphas. I.e Joseph Son of Caiaphas is correct..","date":"2014-08-02","mins":"10:08 pm","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-141975","author":"mike_m","post":"No shame please… We all rush like bulls sometimes. It’s a man thing : ).","date":"2014-08-03","mins":"8:13 am","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-143105","author":"mike_m","post":"I believe the scourging from the back would also leave marks on the front (especially on the sides of the chest) because the thongs would wrap around the body..","date":"2014-08-09","mins":"11:01 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143106","author":"mike_m","post":"That is one of the reasons I am more inclined to a low post were the victim bends over..","date":"2014-08-09","mins":"11:02 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143236","author":"mike_m","post":"I tried to answer the “Paul” Question in the previous post. Regarding the wounds at the middle of the chest it depends on how long the thongs were? I don’t think we have a clear idea from archaeology about the flagrum length. There is also a possibility that Jesus was flipped to the other side (like in the Passion movie) to inflict the wounds on the frontal side since Pilate’s intention was to display Jesus in front of the angry crowd to appease them..","date":"2014-08-10","mins":"8:41 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143154","author":"mike_m","post":"Kenny, there is also evidence that the Romans had some freedom in tormenting the Jews. Josephus (War4,chapter11) “(Romans) nailed those they caught, one after one way, and another after another, to the crosses, by way of jest, when their multitude was so great, that room was wanting for the crosses, and crosses wanting for the bodies” whatever happened to Paul could’ve been very different from what happened to Jesus. The crown of thorns is also another example of a punishment that was created for Jesus..","date":"2014-08-09","mins":"7:26 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143240","author":"mike_m","post":"Like here, http://timvalentino.com/2012/03/28/the death of jesus part 5 the crown of thorns and mock robe/ Colin, sometime you amaze me. You go to great length of creativity to prove the shroud is fake, your creativity completely ceases on the other end of the spectrum..","date":"2014-08-10","mins":"9:16 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143234","author":"mike_m","post":"I am not a biblical scholar Colin, but what do you think Pilate ment when he said ” Behold the man” and displayed Jesus to the crowd? He must’ve been reduced to a mess otherwise that phrase would be meaningless..","date":"2014-08-10","mins":"8:32 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143245","author":"mike_m","post":"“Creativity is about presenting new angles that no one has previously thought of…..That’s simply one of many imaginative artistic” You lost me there…I thought you needed imagination to be creative. In other words, Without imagining something into existence how do you create it/be creative?.","date":"2014-08-10","mins":"10:38 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143387","author":"mike_m","post":"There are no scourge marks on the Lier copy. Colin is being creative again and to get his point through is using a black and white grainy image. Look at the coloured image and compare the side wound (even poker holes) to what is claimed to be scourge wounds. Http://www.imagochristiorganizationinc.com/about the shroud.php.","date":"2014-08-11","mins":"8:21 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143249","author":"mike_m","post":"Cheers!.","date":"2014-08-10","mins":"11:24 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143446","author":"mike_m","post":"“If folk here want the Lier copy to lack scourge marks, then I’m totally relaxed on that score.” Colin, it’s not a matter of what I want or not. It’s a question of “are they there or not?” Regardless of the authenticity case, you made an observation and I disagreed (and proved my point). And BTW I never expected you to change your mind. I think any fair observer who check the coloured image will conclude there are none. And that’s good enough for me..","date":"2014-08-11","mins":"7:53 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143098","author":"mike_m","post":"Hi Colin, There are clearly overlapping strokes if you look at the images on Faccini’s paper below, http://www.ohioshroudconference.com/papers/p19.pdf The image you selected was probably aimed at counting the marks thus the graphics added didn’t even identify the type of scourge used. If you look at the paper in its totality you can’t miss the overlapping of the strokes..","date":"2014-08-09","mins":"10:16 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143099","author":"mike_m","post":"I guess you also missed the biblical account that Jesus couldn’t carry the cross all the way. The Romans had to force someone to carry it for him. You can read more about that here http://en.m.wikipedia.org/wiki/Simon of Cyrene.","date":"2014-08-09","mins":"10:19 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-141988","author":"mike_m","post":"Hi Louis, Alikum Salam, funny you mentioned that. A month ago I gave a presentation to our youth on the “Kingdom of God”. I think the view of Christian Zionism is annihilated by Jesus’ own words to Pilate; “My kingdom is not of this world. If My kingdom were of this world, then My servants would be fighting so that I would not be handed over to the Jews; but as it is, My kingdom is not of this realm.” (John 18:36) It’s turmulous times in the Middle East, whats happening in Gaza is constantly instigated by Hamas, unfortunately the victims are the civilians in Both Israel and Gaza. Also the blatant extermination of the Christians of Iraq and Syria, (even though it doesn’t get similar media attention) is even worse..","date":"2014-08-03","mins":"10:01 am","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"id":"comment-141912","author":"mike_m","post":"Long before Cyrius, Isaiah prophesied; “Thy dead men shall live, together with my dead body shall they arise. Awake and sing, ye that dwell in dust: for thy dew is as the dew of herbs, and the earth shall cast out the dead” (Isaiah 26:19). Also, “He made His grave with the wicked, and with the rich in His death” (Isaiah 53:9) …..followed by….. “He shall prolong His days, and the pleasure of the LORD shall prosper in His hand” (Isaiah 53:10). How can He prolong His days after He was already in the grave? Was Isaiah influenced by the ancient egyptians when he said the other messianic prophesies?.","date":"2014-08-02","mins":"11:25 pm","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"id":"comment-141978","author":"mike_m","post":"Hi Dave, I do believe God communicated with the Gentiles (e.g ancient Egyptians, Persians..etc) in some manner. I’ve always found fascinating that Ankh (the letter for eternal life in the Egyptian hieroglyphs) AKA “the key of life” was in the shape of a cross. However I think that message was intended to the Gentiles and not to God’s chosen people (Why would God use pagan religion to communicate a message to His people when He can speak to His people directly through the prophets). I find no evidence for any “fertile soil” in their hearts since they completely missed the point when the “suffering servant” actually came. The soil of their (and our) hearts are only properly prepared by the Holy Spirit. Jesus had to go through the prophesies to explain what they actually meant. “How foolish you are, and how slow to believe all that the prophets have spoken! Did not the Messiah have to suffer these things and then enter his glory?” And beginning with Moses and all the Prophets, he explained to them what was said in all the Scriptures concerning himself (Jesus on the road to Emmaus Luke 24:25 27).","date":"2014-08-03","mins":"8:45 am","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"id":"comment-141981","author":"mike_m","post":"The USCCB version includes the following note concerning this verse: [26:19] This verse refers not to resurrection of the dead, but to the restoration of the people” Most of the commentaries point to the resurrection too (or a foretelling of the resurrection); http://biblehub.com/commentaries/isaiah/26 19.htm Cambridge Bible for Schools and Colleges commentary “The answer to these utterances of disappointed hopes is the promise of the Resurrection.” Benson Commentary: “The deliverance of the people of God, from a state of the lowest depression, is explained by images taken from the resurrection of the dead.” Matthew Henry’s Concise Commentary “Consider Christ as the Speaker addressing his church. His resurrection from the dead was an earnest of all the deliverance foretold.” I realize some commentaries indicate the Civil liberation of the nation of Israel, but isn’t that a foretelling of the resurrection too, Even the Exodus points to the resurrection, even though it was the physical liberation of the nation of Israel from Egypt (viewed as a symbol of bondage and sin)..","date":"2014-08-03","mins":"9:13 am","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"id":"comment-141982","author":"mike_m","post":"Louis.. Have you seen William Lane Craig’s response to Bart Ehrman? https://m.youtube.com/watch?v=Wnqin Kf8s0 E.","date":"2014-08-03","mins":"9:23 am","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"id":"comment-118128","author":"mike_m","post":"Squirming?.","date":"2014-05-12","mins":"7:02 pm","url":"https://shroudstory.com/2014/05/06/ten-reasons-to-believe/","cat":"history","title":"Ten Reasons to Believe"},{"id":"comment-113217","author":"mike_m","post":"David Rolfe’s BBC documentary illustrates this best (start around the 24:00 min mark) http://m.youtube.com/watch?v=i VXX Zc N8 RVI.","date":"2014-05-06","mins":"7:28 pm","url":"https://shroudstory.com/2014/05/06/ten-reasons-to-believe/","cat":"history","title":"Ten Reasons to Believe"},{"id":"comment-113668","author":"mike_m","post":"I didn’t, with pollen and dirt from Jerusalem. There you have it!.","date":"2014-05-07","mins":"7:41 am","url":"https://shroudstory.com/2014/05/06/ten-reasons-to-believe/","cat":"history","title":"Ten Reasons to Believe"},{"id":"comment-113667","author":"mike_m","post":"“Are we beginning to find the artistic context I have been hunting so assiduously?” I wish you all the best in your hunt. Please let me know when you find an artwork that is, pseudonegative, monochrome, with real blood, serum stains, forensically accurate blood flow in two different plains, with rigormortis, 3 D information, superficial at fibre level, half tone, absent pigments, absent scorches, absent brush strokes, absent artist, absent test runs and absent other similar artworks. Did I mention everything?.","date":"2014-05-07","mins":"7:39 am","url":"https://shroudstory.com/2014/05/06/ten-reasons-to-believe/","cat":"history","title":"Ten Reasons to Believe"},{"id":"comment-113633","author":"mike_m","post":"Dave, you are probably right. In my last presentation, one of the audience questioned the position of the side wound. He said that “according to tradition the wound was on the right side, but the shroud shows the wound on the left.” That’s when I explained the mirror image property of the shroud. However, I was surprised he was so sure it was on the right. It is possible that the artists were also following tradition that the wound was on the right but painted the crossed hands as they saw on the shroud..","date":"2014-05-07","mins":"6:48 am","url":"https://shroudstory.com/2014/05/06/ten-reasons-to-believe/","cat":"history","title":"Ten Reasons to Believe"},{"id":"comment-100262","author":"mike_m","post":"Ridiculous…she just told you Leonardo was born almost 100 years after the shroud was first exhibited…which theories exactly didn’t held up to scientific scrutiny?.","date":"2014-04-17","mins":"7:09 am","url":"https://shroudstory.com/2008/10/21/the-ridiculous-picknett-and-prince-photograph-theory/","cat":"history","title":"The Ridiculous Picknett and Prince Photograph Theory"},{"id":"comment-118584","author":"mike_m","post":"Absolutely, the gospel narrative was very clear. Jesus was condemned to death by the Jews for blasphemy but because they were under Roman occupation they had to talk Pilate into Jesus being King of the Jews and that was what was written on the cross. No one was sanitizing or polishing anything. However the two people crucified with him were robbers..","date":"2014-05-13","mins":"10:36 am","url":"https://shroudstory.com/2014/05/12/the-slanted-footrest-of-the-orthodox-cross/","cat":"history","title":"The Slanted Footrest of the Orthodox Cross"},{"id":"comment-118289","author":"mike_m","post":"According to Strong’s Greek: 3027 a Léstés is: a robber; a plunderer, freebooter, brigand. No mention of insurrectionists. Root is Léis= booty.","date":"2014-05-13","mins":"12:16 am","url":"https://shroudstory.com/2014/05/12/the-slanted-footrest-of-the-orthodox-cross/","cat":"history","title":"The Slanted Footrest of the Orthodox Cross"},{"id":"comment-118302","author":"mike_m","post":"Robbers were also crucified, please refer to page 48 of “Crucifixion in the Ancient World and the Folly of the Message of the Cross”( By Martin Hengel) The direct link is here; http://books.google.ca/books?id=UDEP Fq Ti Qh UC&pg=PA46&lpg=PA46&dq=crucifixion,+robbers&source=bl&ots=Cb IX Il Rlk&sig=F1 LK5lcg W z Hz O3 Jbv C Us O7zsr E&hl=en&sa=X&ei=O59x U8 Ck Es S Qy AT Pv IDQ Dw&ved=0 CEUQ6 A Ew Bw#v=onepage&q=crucifixion%2 C%20robbers&f=false.","date":"2014-05-13","mins":"12:31 am","url":"https://shroudstory.com/2014/05/12/the-slanted-footrest-of-the-orthodox-cross/","cat":"history","title":"The Slanted Footrest of the Orthodox Cross"},{"id":"comment-118663","author":"mike_m","post":"Thanks Tom, I think what you listed were irritating to the Jews but not to the extent of capital punishment. What really got them was when he threw the “I Am” bomb. Telling people “Your sins are forgiven”etc…making Himself equal to God..","date":"2014-05-13","mins":"1:14 pm","url":"https://shroudstory.com/2014/05/12/the-slanted-footrest-of-the-orthodox-cross/","cat":"history","title":"The Slanted Footrest of the Orthodox Cross"},{"id":"comment-118306","author":"mike_m","post":"It is also translated robber in both instances. Http://biblehub.com/greek/3027.htm Who was sanitizing what?.","date":"2014-05-13","mins":"12:42 am","url":"https://shroudstory.com/2014/05/12/the-slanted-footrest-of-the-orthodox-cross/","cat":"history","title":"The Slanted Footrest of the Orthodox Cross"},{"id":"comment-118308","author":"mike_m","post":"Brigand=a member of a gang that ambushes and robs people in forests and mountains..","date":"2014-05-13","mins":"12:44 am","url":"https://shroudstory.com/2014/05/12/the-slanted-footrest-of-the-orthodox-cross/","cat":"history","title":"The Slanted Footrest of the Orthodox Cross"},{"id":"comment-171130","author":"mike_m","post":"Hugh is right, the shroud does resemble a Chevron (fishbone in french) more than a Herringbone the difference is significant in flooring designs, but in textile both terms are used interchangeably. Dictionary.com entry for Herringbone “Textiles; Also called chevron, chevron weave, herringbone weave. A type of twill weave having this pattern.” Compare this http://www.remodelista.com/posts/chevron and herringbone spot the difference To.","date":"2014-11-13","mins":"8:54 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-171267","author":"mike_m","post":"“The “faults” does not tell us anything about the date of the TS” I am not a textile expert Thibault but John Tyrer is one, and he seem to disagree with your statement: “These changes may be faults in the weave because of incorrect drawing in through the heralds which could suggest a primitive loom. In fact a study of the spinning and weaving defects in the shroud might throw light on the method of production” (John Tyrer: chartered Textile expert) http://www.sindone.info/TYRER1.PDF And; After studying X radiographs of the shroud, John Tyrer stated: “I am very interested in the comparison that can be made between the altar cloth used to patch the Shroud, the Shroud itself, and the backing cloth… The altar cloth and the backing cloth are plain woven, and are much better products than the shroud. They seem to contain less weaving faults whilst the shroud is a very poor product by comparison. It is full of warp and weft weaving defects, many mistakes in “drawing in” the impression I am left with is that the cloth is a much cruder and probably earlier fabric than the backing and patches. This I think lifts the shroud out of the Middle Ages more than anything I have seen about the textile” From the book Resurrection of the shroud:New Scientific, Medical, and Archeological Evidence page 100).","date":"2014-11-14","mins":"6:55 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-171441","author":"mike_m","post":"“Strictly speaking, the textile studies show that the TS could have been made in the first century from a technical point of view This is also Mrs Flury Lemberg’s opinion. But no more.” Fair enough, I agree to that statement..","date":"2014-11-15","mins":"3:04 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-171141","author":"mike_m","post":"I think it is significant they the shroud weave lacks wool fibres. Why would a European forger care about wool? Also weaving irregularities and imperfections apparent because of manual weaving process..","date":"2014-11-13","mins":"10:18 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-171142","author":"mike_m","post":"They=that… I hate typing on i Phone.","date":"2014-11-13","mins":"10:19 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"}]
