[{"id":"comment-92379","author":"mike_m","post":"“Pseudoscience ” as Dan has indicated. Collin tries to give the impression that he is after the truth but then falls short in doing the proper experiments. Biohazard…yeah right. That’s a good one, why even look, setup the camera on a timer, close your eyes (or wear a UV shield), switch on the UV lamp, take the picture, switch it off and then open your eyes(or takeoff the Uv shield), that’s the lamest excuse ever for someone who claims to have “cracked the mystery of the shroud”. What about normal light, why can’t you photograph your linen in transmitted light?. What about a microscope, I would say access to such a tool would be something essential for someone trying to propose an image formation mechanism. Where are the microphotographs with no lumen discoloration, superficiality & halftone? Now for those apparent creases, well, they are not as apparent in shroud2.0, even worse they appear the same, in other place off image, even way off image. So how can that be a proof for a hot statue scorch in places where the hot statue didn’t even touch. Dan I will send you some images because I don’t know how to add them to a comment..","date":"2014-03-23","mins":"4:57 pm","url":"https://shroudstory.com/2014/03/23/baked-in-creases-really/","cat":"image_theory","title":"Baked-In Creases. Really?"},{"id":"comment-92389","author":"mike_m","post":"“Pseudoscience rule 2.0” when you can’t counter an argument.. Go personal..","date":"2014-03-23","mins":"5:26 pm","url":"https://shroudstory.com/2014/03/23/baked-in-creases-really/","cat":"image_theory","title":"Baked-In Creases. Really?"},{"id":"comment-92390","author":"mike_m","post":"If you are coming to St. Louis, we can meet there. We can swap emails then..","date":"2014-03-23","mins":"5:32 pm","url":"https://shroudstory.com/2014/03/23/baked-in-creases-really/","cat":"image_theory","title":"Baked-In Creases. Really?"},{"id":"comment-92409","author":"mike_m","post":"Thank you, Before becoming a pharmacist in Canada my background involved working as an industrial pharmacist for 11 years. The last 4 years of which were in biotechnology (producing human Erythropoietin hormone from Chinese hamster ovary cells, which involves tissue culture and HPLC. My interest in the shroud stems from my Christian faith ( I became a born again Christian in 2004, I started to study the shroud intensively in 2011 after watching the History channel documentary, so the shroud had nothing to do with my conversion) Nonetheless, the shroud has been a great source of joy in my life, just knowing that Jesus has left us an image of his passion, to me, is priceless. I try to share that joy by doing presentations to different age groups in our church (one coming up for the whole church in April 11th) that’s my background, hope you find that satisfactory..","date":"2014-03-23","mins":"6:22 pm","url":"https://shroudstory.com/2014/03/23/baked-in-creases-really/","cat":"image_theory","title":"Baked-In Creases. Really?"},{"id":"comment-92401","author":"mike_m","post":"I think the simplest hypothesis would be that these ridges (or raised lines) as they stick out of the cloth would be much more prone to contact with dirt & and grease from people handling the cloth (as compared to the lines in the middle which seem to be protected) please note a simple “wave fold” in that reference: http://www.scribd.com/mobile/doc/8786853 For a cloth that has been displayed in churches and open air for hundreds of hours over the years and never been washed this should at least plausible. Off course to get a better understanding we would need samples and microphotography for those areas..","date":"2014-03-23","mins":"5:58 pm","url":"https://shroudstory.com/2014/03/23/baked-in-creases-really/","cat":"image_theory","title":"Baked-In Creases. Really?"},{"id":"comment-92425","author":"mike_m","post":"The cause doesn’t justify the means. Real Christian faith would never attempt to deceive people to get them to believe. Even if people were that corrupt in medieval times that speculation doesn’t prove anything. The majesty of the image was largely unnoticed till the invention of photography. Why would they put dirt from Jerusalem, why would they salt it with pollen from Halophytes? Clear serum Haloes around real human blood? Forensically accurate information embedded in the image, information that we began to understand hundreds of years later. And if we ignore all that, why can’t we match the image on the microscopic level when we have the microscope and they didn’t?.","date":"2014-03-23","mins":"7:27 pm","url":"https://shroudstory.com/2014/03/23/baked-in-creases-really/","cat":"image_theory","title":"Baked-In Creases. Really?"},{"id":"comment-92436","author":"mike_m","post":"You are correct. This is one of the images I emailed to Dan because I couldn’t add to the comment section..","date":"2014-03-23","mins":"8:10 pm","url":"https://shroudstory.com/2014/03/23/baked-in-creases-really/","cat":"image_theory","title":"Baked-In Creases. Really?"},{"id":"comment-92437","author":"mike_m","post":"Welcome to the blog. You are not by any way related to Max Patrick Hammond?.","date":"2014-03-23","mins":"8:18 pm","url":"https://shroudstory.com/2014/03/23/baked-in-creases-really/","cat":"image_theory","title":"Baked-In Creases. Really?"},{"id":"comment-104428","author":"mike_m","post":"Ray Rogers wasn’t testing scorched fibres he was testing image fibers. Whatever conclusion Colin reaches is for scorched fibres. No conclusion can be made about Rogers experiment because he was testing a different thing..","date":"2014-04-27","mins":"12:24 pm","url":"https://shroudstory.com/2014/04/27/colin-berrys-sticky-tape-experiments/","cat":"image_theory","title":"Colin Berry’s Sticky Tape Experiments"},{"id":"comment-170217","author":"mike_m","post":"Daveb, you come through as a very patient man. You took all that effort to respond so eloquently even though no one is listening on the other end..","date":"2014-11-09","mins":"9:54 pm","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-91307","author":"mike_m","post":"I agree, there are no signs of Purification on the shroud. This is a very different situation but I think it might be interesting, I wish I could read more on this case..","date":"2014-03-20","mins":"5:51 pm","url":"https://shroudstory.com/2014/03/20/comment-promoted-another-hypothesis-about-the-image-formation/","cat":"image_theory","title":"Comment Promoted:  Another hypothesis about the image formation"},{"id":"comment-127005","author":"mike_m","post":"“It could be three dimensional for many reasons” What are those reasons? (beside cloth body distance).","date":"2014-06-05","mins":"7:11 am","url":"https://shroudstory.com/2014/06/05/everymans-vp8/","cat":"image_theory","title":"Everyman’s VP8"},{"id":"comment-127155","author":"mike_m","post":"I also find the fact that all the images selected has no hair , mustache or beard to avoid any shadows from further distorting the image in 3 D. Nice try ; ).","date":"2014-06-05","mins":"8:22 pm","url":"https://shroudstory.com/2014/06/05/good-3d-from-a-conventional-photograph/","cat":"image_theory","title":"Good 3D from a conventional photograph"},{"id":"comment-127258","author":"mike_m","post":"Dan, achieving realistic 3 D information from an art work is also hard to defend. Achieving it from a photograph properly lit (with no shadows) is possible but not as good as the shroud. Claiming that someone would achieve that technology with no apparent reason (to avoid the shadows) and only the one time and no process evolution or any documentation in the Middle Ages is impossible..","date":"2014-06-06","mins":"6:31 am","url":"https://shroudstory.com/2014/06/05/good-3d-from-a-conventional-photograph/","cat":"image_theory","title":"Good 3D from a conventional photograph"},{"id":"comment-127154","author":"mike_m","post":"I agree, just compare it to the shroud image posted on the previous thread. It’s like night and day..","date":"2014-06-05","mins":"8:20 pm","url":"https://shroudstory.com/2014/06/05/good-3d-from-a-conventional-photograph/","cat":"image_theory","title":"Good 3D from a conventional photograph"},{"id":"comment-87467","author":"mike_m","post":"I think what comes out of CB post is simply an implied admission that his scorch hypothesis can’t replicate the superficiality at the fibre level… So it must be time (i.e. Don’t ask me to replicate it because it happened over hundreds of years and I can’t replicate that) what about the real scorches on the shroud? Why are those still there, after the same time has passed and all the foldong and unfolding why are they still there, Full with Lumen discoloration, UV Fluorescence and transmitted light presence?.","date":"2014-03-11","mins":"6:18 pm","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","title":"Is Time the Secret Ingredient We Need to Consider?"},{"id":"comment-87930","author":"mike_m","post":"Hugh, I agree. Looking at the Evan’s photomicrographs. I find ME 09 to be very interesting ( I think that’s the one you were referring to) you can see the whole spectrum of heavily burnt fibres (around the edge of a hole in the cloth) to completely white, background fibres with minimal signs of breakage. I think this image illustrates how tough and resistant linen fibres are, even when burned. I looked at all the blood images and the one titled ME 06 does show more tufting than the other images, I think it could be because the blood was glued to the fibres and with mechanical wear and tear the fibres get pulled out, away from the cloth, with the blood..","date":"2014-03-12","mins":"7:41 pm","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","title":"Is Time the Secret Ingredient We Need to Consider?"},{"id":"comment-87521","author":"mike_m","post":"Sorry Hugh, Again, another claim without any evidence. If Colin can demonstrate a scorch that only penetrates the PCW without discolor the lumen over a large surface area of a linen cloth (even after removing the very scorched top fibers I would be more than happy to listen. STURP investigation has clearly distinguished scorches from image. Scorches fluoresce in UV light and show up in transmitted light. Either of these observations is enough empiric evidence that they are not the same. The image is a full front and back body image that is consistently 1 2 fibre deep, Pressure insensitive and superficial at fibre level. Where are the evidence that you so much seek in any other hypothesis?.","date":"2014-03-11","mins":"9:02 pm","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","title":"Is Time the Secret Ingredient We Need to Consider?"},{"id":"comment-87530","author":"mike_m","post":"Agree, I can’t believe we are still stuck here. A full team of scientists, multidisciplinary spent 5 full days, directly poking and probing the cloth and concluded “We can conclude for now that the Shroud image is that of a REAL HUMAN form of a scourged, crucified man. It is not the product of an artist. The blood stains are composed of hemoglobin and also give a positive test for serum albumin. The image is an ongoing mystery and until further chemical studies are made, perhaps by this group of scientists, or perhaps by some scientists in the future, the problem remains unsolved.”.","date":"2014-03-11","mins":"9:28 pm","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","title":"Is Time the Secret Ingredient We Need to Consider?"},{"id":"comment-94919","author":"mike_m","post":"LOL, how ironic!.","date":"2014-03-30","mins":"11:35 am","url":"https://shroudstory.com/2014/03/30/nasa-had-nothing-to-do-with-it/","cat":"image_theory","title":"NASA had nothing to do with it."},{"id":"comment-94959","author":"mike_m","post":"Thanks Barrie, see you in Hamilton ; ).","date":"2014-03-30","mins":"2:56 pm","url":"https://shroudstory.com/2014/03/30/nasa-had-nothing-to-do-with-it/","cat":"image_theory","title":"NASA had nothing to do with it."},{"id":"comment-89291","author":"mike_m","post":"Dan, did Rogers sent you the images he was talking about because I can’t detect that much of a colour variations in the nose photomicrograph image you posted..","date":"2014-03-15","mins":"2:23 pm","url":"https://shroudstory.com/2014/03/15/of-pixels-spectrum-and-density/","cat":"image_theory","title":"Of Pixels, Spectrum and Density"},{"id":"comment-89295","author":"mike_m","post":"Sorry; microphotograph. LOL.","date":"2014-03-15","mins":"2:27 pm","url":"https://shroudstory.com/2014/03/15/of-pixels-spectrum-and-density/","cat":"image_theory","title":"Of Pixels, Spectrum and Density"},{"id":"comment-89571","author":"mike_m","post":"Thanks Dan.","date":"2014-03-16","mins":"8:42 am","url":"https://shroudstory.com/2014/03/15/of-pixels-spectrum-and-density/","cat":"image_theory","title":"Of Pixels, Spectrum and Density"},{"id":"comment-90170","author":"mike_m","post":"Hugh & Jenx, I don’t think this is an example of “invisible” weaving, at least not the one described in the Marino/Benford paper. It’s a “visible” imperfection (passage error) in the weaving, as would be expected from any manual weaving process. The same with the variable thickness of the warp threads, both are considered evidence against a medieval weaving. Please check pages 11 15 of this reference; http://editionsassailly.com/books/The%20 Shroud.pdf It’s a beautiful, very balanced, read and is available online for free. I find the textile portion very informative..","date":"2014-03-17","mins":"7:05 pm","url":"https://shroudstory.com/2014/03/15/of-pixels-spectrum-and-density/","cat":"image_theory","title":"Of Pixels, Spectrum and Density"},{"id":"comment-90204","author":"mike_m","post":"The point I was trying to make is that these are imperfections and errors due to the manual weaving process rather than a reweave..","date":"2014-03-17","mins":"9:32 pm","url":"https://shroudstory.com/2014/03/15/of-pixels-spectrum-and-density/","cat":"image_theory","title":"Of Pixels, Spectrum and Density"},{"id":"comment-141428","author":"mike_m","post":"John, I agree with all you said, but I think what really stimulated/catalyzed the formation of STURP was the VP8 image analysis performed by Jumper/Jackson/Schumacher..","date":"2014-07-31","mins":"7:38 am","url":"https://shroudstory.com/2014/07/31/okay-maybe-i-shouldnt-have-used-the-word-significant/","cat":"image_theory","title":"Okay, maybe I shouldn’t have used the word ‘Significant’"},{"id":"comment-90584","author":"mike_m","post":"Also a quote from textile expert John Tyrer (taken From the resurrection of the shroud by Mark Antonacci) ” I am very interested in the comparison that can be made between the altar cloth used to patch the shroud, the shroud itself, and the backing cloth…the altar cloth and the backing cloth are plain woven, and are much better products than the shroud. They seem to contain less weaving faults whilst the shroud is a very poor product by comparison. It is full of warp and weft weaving defects, many mistakes in drawing in the impression I am left with is that the cloth is much cruder and probably earlier fabric than the backing and patches. This I think lifts the shroud out of the Middle Ages more than anything I have seen about the textile” BTW, An invisible weave would definitely look (if at all it can be detected) much different than a mistake in the weave. These are two completely different things and I don’t understand the comparison..","date":"2014-03-18","mins":"11:07 pm","url":"https://shroudstory.com/2014/03/15/of-pixels-spectrum-and-density/","cat":"image_theory","title":"Of Pixels, Spectrum and Density"},{"id":"comment-101819","author":"mike_m","post":"The impurity layer should be present in image & non image fibres. Why is it easier to pull out the image fibre than the non image fibres? I think this observation indicates the image is part of the fibres and not an impurity layer..","date":"2014-04-20","mins":"10:26 pm","url":"https://shroudstory.com/2014/04/16/remember-the-valencia-consensus-parenthetical/","cat":"image_theory","title":"Remember the Valencia Consensus Parenthetical"},{"id":"comment-141430","author":"mike_m","post":"STURP’s analysis has indicated that the image was not produced by contact with a liquid (the image is very superficial, discolouring the top 2 3 microfibriles at most) also the image formation mechanism was not a contact process since the image is visible where there is no contact, and not visible in some areas where there should’ve been contact. These two observations stand against a sweat imprint. Nonetheless, it wasn’t even ignored by STURP members, Rogers, promoter an image by Maillard reaction who’s is basically a sweat imprint. There is nothing new here!.","date":"2014-07-31","mins":"7:51 am","url":"https://shroudstory.com/2014/07/31/okay-maybe-i-shouldnt-have-used-the-word-significant/","cat":"image_theory","title":"Okay, maybe I shouldn’t have used the word ‘Significant’"},{"id":"comment-74549","author":"mike_m","post":"Wow… Thanks O.K, for the heads up. Thanks Mario for the work put into this. The photo micrographs are one of the most impressive things I’ve seen in a long time. You can even know the exact spot from the links at the bottom of the page. I will probably spend a lot of time chewing on these images..","date":"2014-01-25","mins":"11:46 am","url":"https://shroudstory.com/2014/01/25/photomicrographs-and-more-at-mario-latendresses-sindonology/","cat":"image_theory","title":"Photomicrographs and More at Mario Latendresse’s Sindonology"},{"id":"comment-100005","author":"mike_m","post":"Why assume that Di Lazzaro “chosen not to” make the Diimide test? Any reference? Why are we giving him & others homework to do? Why don’t someone who thinks of a hypothesis do the test himself instead of sitting on a high chair, assume what others chose to do, and give instructions as to what needs to be done?.","date":"2014-04-16","mins":"2:17 pm","url":"https://shroudstory.com/2014/04/16/remember-the-valencia-consensus-parenthetical/","cat":"image_theory","title":"Remember the Valencia Consensus Parenthetical"},{"id":"comment-86526","author":"mike_m","post":"I don’t get it? We have linen, why experiment on onions. Or is it claimed that the whole shroud was covered in onion? This is what happens when you perform experiments in the kitchen..","date":"2014-03-09","mins":"8:23 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","title":"Scorching Onion Skins"},{"id":"comment-86586","author":"mike_m","post":"LOL. I am not a pro myself, just speak your heart & cross your fingers..","date":"2014-03-09","mins":"12:06 pm","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","title":"Scorching Onion Skins"},{"id":"comment-100028","author":"mike_m","post":"They never claimed they were testing for this. Their conclusion was for a matching hue of coloration and the depth of the image. Chemical testing was simply not a part of what they were testing and I don’t think it’s fair to say they intentionally did that because it would disprove their theory. As far as I know this is untested, was not part of their study and if anyone wants to test it they are welcome..","date":"2014-04-16","mins":"3:43 pm","url":"https://shroudstory.com/2014/04/16/remember-the-valencia-consensus-parenthetical/","cat":"image_theory","title":"Remember the Valencia Consensus Parenthetical"},{"id":"comment-86612","author":"mike_m","post":"Thanks clublu22014, the lumen is actually the innermost, hollow part of the fibre. In the image fibres the colour is only on the outermost layer(there is debate whether that layer is the primary cell wall or an impurity layer) but the lumen appears colourless as demonstrated by Rogers. In the scorched fibres the discoloration penetrates both the primary cell wall and the secondary cell wall which shows as a discolored lumen under the microscope. There is a nice image taken by Rogers that Thibault have in the paper linked below it show the difference between the image fibre and the scorched fibre with regards to the lumen discoloration. Https://www.shroud.com/pdfs/thibault%20final%2001.pdf.","date":"2014-03-09","mins":"1:50 pm","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","title":"Scorching Onion Skins"},{"id":"comment-86750","author":"mike_m","post":"Thanks again clublu22014, the credit goes to Barrie (whose website gave us access to this information) Rogers (who did the research and took the photographs), Jackson (who assembled STURP and continues to be an icon in shroud research) or Thibault (who assembled the information in that beautiful paper) We are standing on the shoulders of giants looking at this amazing mystery. Jesus left us a high resolution, picture quality image of his passion etched on a piece of linen cloth, that science (despite 100s of thousands of hours of research) still can’t explain. It’s an amazing thing that has been a source of deep joy in my life. It’s very difficult to keep that joy for yourself it’s only natural to try to share it with others..","date":"2014-03-09","mins":"10:38 pm","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","title":"Scorching Onion Skins"},{"id":"comment-86752","author":"mike_m","post":"….and Dan for giving is the platform for discussing these things openly..","date":"2014-03-09","mins":"10:41 pm","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","title":"Scorching Onion Skins"},{"id":"comment-86552","author":"mike_m","post":"Clublu22014; I totally agree, not only that but scorched linen show up in transmitted light photography while the shroud image doesn’t. And the lumen of the fibres are discoloured while the shroud image doesn’t show any lumen discolouration. This is a prime example of how the anti authenticity camp would go to any length (not supported by science) to discredit the shroud. With the hacking hypothesis we have been seeing both extremes of the spectrum..","date":"2014-03-09","mins":"9:39 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","title":"Scorching Onion Skins"},{"id":"comment-86549","author":"mike_m","post":"Sorry Anoxie, I still can’t get it. What your saying would make sense if Colin is talking about scorching an impurity layer (like Rogers postulated) but he is talking about primary cell wall. What is the difference between primary cell wall of antient linen and modern linen?.","date":"2014-03-09","mins":"9:34 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","title":"Scorching Onion Skins"},{"id":"comment-86579","author":"mike_m","post":"Hi Jenx, email your thoughts to Dan’s email (listed after his comment on the sidebar) and he will open the thread..","date":"2014-03-09","mins":"11:35 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","title":"Scorching Onion Skins"},{"id":"comment-157110","author":"mike_m","post":"This is an ancient Tempra on linen painting. If the shroud was a painting it would’ve looked like this, enlarge the image to see the weave where the paint has flaked off https://www.flickr.com/photos/mharrsch/599782624/player/08e125f9d4.","date":"2014-09-26","mins":"10:27 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-137258","author":"mike_m","post":"I think it’s very difficult to prove or disprove the presence of teeth. The following factors make it very difficult to distinguish: 1 the background weave with all the irregularities of manual weaving. 2 Vertical and horizontal banding. 3 dirt,blood,serum…etc I think OK’s work is an indication that it might be there, and I applaud him for it, but it’s almost like trying to look through a thick veil. So many distortions prevents making a firm conclusion..","date":"2014-07-11","mins":"11:02 pm","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","title":"Teeth Reconsidered"},{"id":"comment-94636","author":"mike_m","post":"Basically the three postings are loaded with logical garbage. Colin Berry is upset that google search only puts them on page 38. I was debating with myself whether its worth my time to refute his posts or just ignore and settle with “the dogs bark, but the caravan goes on”. I think it’s not worth my time, page 38 is good enough!.","date":"2014-03-29","mins":"4:26 pm","url":"https://shroudstory.com/2014/03/29/so-even-without-knowing-how-the-shroud-was-faked-its-obvious-that-someone-did-fake-it/","cat":"image_theory","title":"So, even without knowing how the shroud was faked, it’s obvious that someone did fake it?"},{"id":"comment-100469","author":"mike_m","post":"Excellent paper, Thibault. As always, very logical stepwise approach. I wanted to ask you if you managed to test some other characteristics seen in scorches on the TS. Namely, UV fluorescence and visibility in transmitted light?.","date":"2014-04-17","mins":"8:05 pm","url":"https://shroudstory.com/2014/04/17/the-turin-shroud-image-is-not-a-scorch/","cat":"image_theory","title":"The Turin Shroud Image is not a Scorch"},{"id":"comment-73403","author":"mike_m","post":"I vote for a water stain. The tail of that “tropical fish” is partly blood ( the colour is very clear at high magnification on shroud2.0 ) the blood even seems to have been smudged a bit by the effects of the water..","date":"2014-01-15","mins":"8:53 pm","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-83971","author":"mike_m","post":"Matthias, the shroud is not an artwork. 24 scientists spent 120 hrs trying to examine this assumption (among others) and concluded that it is not man made. The ventral image is incomplete while the dorsal image is complete. This is evidence that this is not an artwork. If you are wrapping a box you do the same thing. You lay the wrapping paper on the table then you put the box and make sure there is extra wrapping from all sides. Then you fold the rest of the wrapping paper over the box. That’s exactly what we see here. This is not what you see if someone was trying to make an artwork. In that case the ventral image should be the most important to print..","date":"2014-03-01","mins":"11:55 pm","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"id":"comment-83911","author":"mike_m","post":"Like!.","date":"2014-03-01","mins":"7:49 pm","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"id":"comment-83968","author":"mike_m","post":"I personally don’t believe the lack of a side image is because of a head covering. The image between the two heads is not the only side image missing. There is no side image, period. I think the problem here is because the lack of any side image has always been explained away by the hypothesis that the linen was loosley draped over the body and the spice bags were kept beside the body preventing side contact. But in this situation the measurment between the two heads doesnt give a chance of any loose wrapping. The lack of side image is very clear in the right elbow blood stain, which flows in an outside direction (as demonstrated by Dr. G Ilbert Lavoie in his paper/book. This clearly indicates that the cloth was touching the side of the elbow because we see the blood stain, but we dont see the side elbow.The image formation process was strictly orthogonal to the horizontal plane. Isobel Piczek has attributed this phenomenon to an event horizon. This is way over my head and I simply don’t have an explanation for it..","date":"2014-03-01","mins":"11:46 pm","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"id":"comment-84807","author":"mike_m","post":"Matthias, The top of the head is not the only unexplained thing in the shroud. Image superficiality and half tone effects are two features only appreciated under the microscope that can’t be explained either, doesnt mean its a forgery. I would think an artist who measured the anatomically correct distance between the two heads would have no problem filling it in. This is part of the mystery, and beauty of the shroud.. This is why people spend their life studying the shroud..","date":"2014-03-04","mins":"8:44 am","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"id":"comment-88687","author":"mike_m","post":"The last two posts have displayed both ends of the spectrum. Stephens hacking (extreme pro authenticity)and Colin’s scorching (extreme anti authenticity) are both lacking evidence and go against most of what we already know about the shroud. Both of them will never change their mind and I think both are unnecessary distractions. Supporters of each hypothesis conveniently close their eyes when confronted with the obvious contradictions and lack of evidence. It’s actually fun to watch but is ultimately a waste of time, almost like most of the movies nowadays..","date":"2014-03-14","mins":"8:31 am","url":"https://shroudstory.com/2014/03/14/two-comments-promoted-colin-berry-has-cracked-the-shroud-enigma/","cat":"image_theory","title":"Two Comments Promoted:  Colin Berry Has Cracked the Shroud Enigma?"},{"id":"comment-88915","author":"mike_m","post":"David, The shroud image has to be viewed in its totality. 3 D information is just a small piece of the puzzel. You can paint a 3 D image (Emily Craig did it) but is it the same as the shroud? Is the crucifix scorch image that shows up in 3 D monochrome or superficial. Off course not. The darker areas on the shroud are not heavier in colour nor penetrate deeper in the fabric. They are all in monochrome and the darkness is because of the number of coloured fibres per square area. Did CB check uv fluorescence, did he check his image in transmitted light, did he check the depth of the image, was the density of the image a factor of colour variation or number of fibres? We don’t run away with one characteristic and say we have cracked the mystery of the shroud. To me this is as bad as the hacker hypothesis. Both want to promote their own agenda rather than seeking the truth..","date":"2014-03-14","mins":"7:09 pm","url":"https://shroudstory.com/2014/03/14/two-comments-promoted-colin-berry-has-cracked-the-shroud-enigma/","cat":"image_theory","title":"Two Comments Promoted:  Colin Berry Has Cracked the Shroud Enigma?"},{"id":"comment-77829","author":"mike_m","post":"This is completely non destructive. Whatever comes out of this line or research would definitely be beneficial. Didn’t Barry Schwortz suggest something similar a while back?.","date":"2014-02-09","mins":"3:06 pm","url":"https://shroudstory.com/2014/02/09/what-might-we-learn-about-the-shroud-of-turin/","cat":"image_theory","title":"What might we learn about the Shroud of Turin?"},{"id":"comment-78168","author":"mike_m","post":"Thanks for the link, Barrie is mentioned there. I hope they do look further into this..","date":"2014-02-10","mins":"7:42 pm","url":"https://shroudstory.com/2014/02/09/what-might-we-learn-about-the-shroud-of-turin/","cat":"image_theory","title":"What might we learn about the Shroud of Turin?"},{"id":"comment-91523","author":"mike_m","post":"How much attention does the sudarium of Oviedo gets from scientists and the believers? Most people don’t even know anything about it even with recorded history more than 600 years before the shroud, the pollen and the real human blood. The sudarium only has the blood, no image. Examining the shroud would answer all the questions listed above..","date":"2014-03-21","mins":"8:27 am","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","title":"So then, why is there an image?"},{"id":"comment-92081","author":"mike_m","post":"First sin? Cain envying Abel.","date":"2014-03-22","mins":"8:11 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","title":"So then, why is there an image?"},{"id":"comment-127572","author":"mike_m","post":"I thought it was a broader church?.","date":"2014-06-07","mins":"1:33 pm","url":"https://shroudstory.com/2014/06/07/colin-berry-is-up-with-an-interesting-posting-about-3d-enhancement/","cat":"3d","title":"Colin Berry is up with an interesting posting about 3D enhancement"}]
