[{"id":"comment-83021","author":"mike_m","post":"Yeah right, And I am the queen of England. Dan you made me laugh. Even Dan Brown made more sense than this. So apparently the proof is in comparing the faces of Apollonius and the man in the shroud. There is a funny comparison on the website between the Vignon markings and the face of Apollonius. The numbers are placed on the statue but I can’t see any similarities, anyone can put numbers on a face but does it proove anything? And apparently this Apollonius lived to be a 100 years old, does the Man in the shroud look that old? I know the hair and beard are white but that’s because they were close to the cloth not because they were really white..","date":"2014-02-27","mins":"7:11 am","url":"https://shroudstory.com/2014/02/27/apollonius-of-tyana-proof-or-doom-for-christianity/","cat":"other_blogs","title":"Apollonius of Tyana:  Proof or Doom for Christianity?"},{"id":"comment-96450","author":"mike_m","post":"Good luck, however my prediction is not positive. You ay get a discoloration (contact image) but diffusion will never produce the resolution of the shroud image. However, it’s good thing to test and see..","date":"2014-04-04","mins":"7:14 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","title":"Am I the only one?"},{"id":"comment-83030","author":"mike_m","post":"Kelly, you are right. But even if the faces match, that doesn’t prove anything. Does the shroud belong to the actor who played Jesus in one of the movies portraying his life. A lot of people look like this. It’s the peculiarities of the shroud (e.g. The inverted triangle on the bridge of the nose with a three sided square) that should be present before any case can be made..","date":"2014-02-27","mins":"7:29 am","url":"https://shroudstory.com/2014/02/27/apollonius-of-tyana-proof-or-doom-for-christianity/","cat":"other_blogs","title":"Apollonius of Tyana:  Proof or Doom for Christianity?"},{"id":"comment-139308","author":"mike_m","post":"Anoxie, sorry. I thought you were comparing the right side (of the dorsal image) to the left side. While, you were comparing the ventral image to the dorsal..","date":"2014-07-19","mins":"12:09 pm","url":"https://shroudstory.com/2014/07/18/comment-promoted-a-misalignment-between-the-left-and-right-shoulders/","cat":"comments_promoted","title":"Comment Promoted:  A Misalignment Between the Left and Right Shoulders"},{"id":"comment-139154","author":"mike_m","post":"Thomas, I agree. This observation is consistent with the blood flow down the arms. Please see previous post https://shroudstory.com/2014/04/03/more on the y crucifixion with pictures/ Hugh, in your assessment are you relying on body image or blood stains? Some of the blood stains are off body because of side contact with the body..","date":"2014-07-18","mins":"12:30 pm","url":"https://shroudstory.com/2014/07/18/comment-promoted-a-misalignment-between-the-left-and-right-shoulders/","cat":"comments_promoted","title":"Comment Promoted:  A Misalignment Between the Left and Right Shoulders"},{"id":"comment-85653","author":"mike_m","post":"The question is,…why is it still a hypothesis. I guess we have the technology today to heat a full body statue to a 100 C. Why don’t we see a new shroud manufactured in 2014 with the same Macro and Micro properties of the shroud?.","date":"2014-03-06","mins":"7:06 pm","url":"https://shroudstory.com/2014/03/06/hit-and-run-trolling-and-a-whole-lot-more/","cat":"other_blogs","title":"Hit and Run Trolling and a Whole Lot More"},{"id":"comment-139199","author":"mike_m","post":"Hugh, I agree with you the dorsal image is much clearer, you can actually see the body image and the scourge marks. I think the ventral is more difficult to distinguish with just the blood stains, there is a possibility that the cloth touched the top of the shoulder during wrapping leaving a stain without a body image. I am not sure why there are no side images for the body. It could be due to an orthogonal image forming process or due to spice bags placed around the body leaving a horizontal shroud with no side contact. I agree with Thomas, the right shoulder is lower, I think it’s how the body was fixed in rigor Mortis as seen in the previous post referenced in my previous comment (I believe this position is consistent with the shoulder position and the blood flow) Anoxie, The whole body would be misaligned as would be the case if you lean all your weight on one leg and bend the other..","date":"2014-07-18","mins":"8:27 pm","url":"https://shroudstory.com/2014/07/18/comment-promoted-a-misalignment-between-the-left-and-right-shoulders/","cat":"comments_promoted","title":"Comment Promoted:  A Misalignment Between the Left and Right Shoulders"},{"id":"comment-86061","author":"mike_m","post":"“Good question. Has anyone tried to reproduce the shroud ? Meaning the shroud itself, not the image or bloodstains.” I guess a 4.4×1.1m linen cloth can be produced today not manually woven but I don’t think the weaving whether manual or automatic makes a difference in the image. What’s your point? Is there any consensus how it was made and bleached ? Banding clearly indicates that the bleaching was performed on threads and not the whole cloth..","date":"2014-03-07","mins":"10:58 pm","url":"https://shroudstory.com/2014/03/06/hit-and-run-trolling-and-a-whole-lot-more/","cat":"other_blogs","title":"Hit and Run Trolling and a Whole Lot More"},{"id":"comment-167272","author":"mike_m","post":"“However, it is an article by historian Charles Freeman that may at last give some definitive answers” That’s her opinion, shaped by her own worldview..","date":"2014-10-31","mins":"11:58 am","url":"https://shroudstory.com/2014/10/31/how-knowledge-is-created-the-shroud-of-turin/","cat":"other_blogs","title":"How Knowledge is Created:  The Shroud of Turin"},{"id":"comment-136392","author":"mike_m","post":"Thanks Barrie, looking forward for the new documentary. You continue to inspire me..","date":"2014-07-08","mins":"7:34 pm","url":"https://shroudstory.com/2014/07/08/new-documentary-in-the-works/","cat":"other_blogs","title":"New Documentary in the Works"},{"id":"comment-136216","author":"mike_m","post":"I remember a high school student who had a question here and started a thread, a while back. Might be the same guy?.","date":"2014-07-08","mins":"8:02 am","url":"https://shroudstory.com/2014/07/08/new-documentary-in-the-works/","cat":"other_blogs","title":"New Documentary in the Works"},{"id":"comment-140705","author":"mike_m","post":"Dan’s Title says it all..","date":"2014-07-27","mins":"11:53 am","url":"https://shroudstory.com/2014/07/27/penn-tellers-hateful-bullshit/","cat":"other_blogs","title":"Penn & Teller’s Hateful Bullshit"},{"id":"comment-126465","author":"mike_m","post":"“And here after so many centuries the forgotten image reappears suddenly on the Shroud’s fabric with a terrible truthfulness, with the authenticity not only of an irrefutable document, but of a present fact. The nineteen centuries interval is suddenly erased; the past is transferred to the present. ” Beautifully said by Historian Luigi Fossati.","date":"2014-06-03","mins":"8:05 am","url":"https://shroudstory.com/2014/06/03/stera-in-case-you-missed-it/","cat":"other_blogs","title":"STERA:  In Case You Missed It"}]
