[{"id":"comment-103995","author":"mike_m","post":"I was there yesterday and I was privildeged to join Barrie’s group for dinner after the evening presentation. It was an honour to be there and meet him in person. What a genuine scholar..","date":"2014-04-26","mins":"7:52 am","url":"https://shroudstory.com/2014/04/26/report-on-barrie-schwortz-in-hamilton-ontario/","cat":"presentation","title":"Report on Barrie Schwortz in Hamilton, Ontario"},{"id":"comment-77609","author":"mike_m","post":"You are absolutely right. By the same token I have also noticed people clinging to fantasies to support their lack of faith, despite what they say( that they are only interested in scientific proofs and so forth)..","date":"2014-02-08","mins":"9:33 pm","url":"https://shroudstory.com/2014/02/08/dear-colin-if-you-change-your-mind-you-are-welcome-back/","cat":"other_blogs","title":"Dear Colin:  If you change your mind you are welcome back."},{"id":"comment-92831","author":"mike_m","post":"That’s exactly where Zugibe estimated (entry from thenar furrow exit between the carpals and metacarpals) see below; https://shroudstory.com/2013/12/10/barbets vs zugibes exit points/#comments.","date":"2014-03-24","mins":"7:48 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-93692","author":"mike_m","post":"“Tri fold brochure” very good example!.","date":"2014-03-26","mins":"9:14 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-93903","author":"mike_m","post":"Hi Yannick, I don’t think anyone here, or even Wilson, considers the Acts of Thaddeus as Gospel. Charles freeman was bang on when he, writing about it, in his paper “Tetra Diplon; the mystery solved” I quote ” like most Legends, it had a purpose, in this case to give credibility to a cloth with a face of living Jesus which is first recorded in Edessa” Now, here is the thing; what would you write if you want to make up a story when you have an image with a “sweat imprint” of a face (with eyes widely opened, in the negative) unlike any other painting that they call it “not made by hand” and it is described as being folded in eight before Jesus wipes his face with which leaves that imprint on it. I think it’s very significant. The Fact that whoever wrote the acts of Thaddeus didn’t make the connection that this was the burial cloths is irrelevant because he only saw it folded with the face in the middle. There is a lot of art work for the Mandylion that matches that description (a rectangle with a face in the middle). There is no artwork from that period that dared to depict Jesus naked and I think that’s the main reason it was folded (and probably secured) in such manner..","date":"2014-03-27","mins":"12:31 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-139398","author":"mike_m","post":"Who cares what Mr. Nickels thinks, or considers necessary to comment on?.","date":"2014-07-19","mins":"11:41 pm","url":"https://shroudstory.com/2014/07/17/what-has-joe-nickell-been-up-to-lately/","cat":"news_&_views","title":"What has Joe Nickell Been Up To Lately?"},{"id":"comment-164008","author":"mike_m","post":"Dan, more info on the folding and lifting device in this documentary. Start at 29:00 https://m.youtube.com/watch?v=p2 Sw7 N3 Gj UU.","date":"2014-10-20","mins":"8:00 am","url":"https://shroudstory.com/2014/10/20/in-the-belly-of-the-beast/","cat":"critical_summary","title":"In the Belly of the Beast"},{"id":"comment-132495","author":"mike_m","post":"John Jackson has always held that position, that is, The image looks like a scorch but doesn’t have all the characteristics of a scorch (re image superficiality). It’s part of why he is inclined to a flash radiant image producing mechanism. I believe he also experimented with a hot scorch but found the exposure time required to achieve that depth extremely short (but I don’t have the reference to that study, I just heared him talk about it).","date":"2014-06-23","mins":"8:10 am","url":"https://shroudstory.com/2014/06/20/john-jackson-presentation-at-a-roman-catholic-in-2002/","cat":"presentation","title":"John Jackson Presentation at a Roman Catholic in 2002"},{"id":"comment-131941","author":"mike_m","post":"Beautiful presentation, thanks Joe and Dan. John Jackson is a very honest scientist and Christian who has given, and continues to give, a lot to Shroud research..","date":"2014-06-20","mins":"11:12 pm","url":"https://shroudstory.com/2014/06/20/john-jackson-presentation-at-a-roman-catholic-in-2002/","cat":"presentation","title":"John Jackson Presentation at a Roman Catholic in 2002"},{"id":"comment-164318","author":"mike_m","post":"Thanks Hugh for the correction, I did mean width. Please see the images below I captured from the video and marked the ones I was talking about.","date":"2014-10-21","mins":"8:02 am","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","title":"Quick Reaction to In the Belly of the Beast"},{"id":"comment-74484","author":"mike_m","post":"A Very nice and simple introduction to the shroud. Good job Dr. Jackson.","date":"2014-01-24","mins":"9:41 pm","url":"https://shroudstory.com/2014/01/24/john-jackson-what-does-science-have-to-say-about-the-shroud-of-turin/","cat":"science","title":"John Jackson: What does science have to say about the Shroud of Turin?"},{"id":"comment-132431","author":"mike_m","post":"Hugh, funny you just found this interesting and missed 27:01 when he can explains how a scorch is visible in transmitted light but the image isn’t..","date":"2014-06-22","mins":"10:02 pm","url":"https://shroudstory.com/2014/06/20/john-jackson-presentation-at-a-roman-catholic-in-2002/","cat":"presentation","title":"John Jackson Presentation at a Roman Catholic in 2002"},{"id":"comment-164673","author":"mike_m","post":"Good Job Hugh, you are right, they do coincide with stitches in Shroud2.0.","date":"2014-10-22","mins":"1:29 pm","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","title":"Quick Reaction to In the Belly of the Beast"},{"id":"comment-164362","author":"mike_m","post":"Thanks Hugh, they do look like valleys. The good thing is that this video was taken after the restoration (where weights were applied to flatten the creases/foldmarks.) which may have flattened the middle part of the line. I am happy the flattening job wasn’t perfect and the information is still there to investigate. Louis, will do, I do have the book at home..","date":"2014-10-21","mins":"12:16 pm","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","title":"Quick Reaction to In the Belly of the Beast"},{"id":"comment-164361","author":"mike_m","post":"Thanks Louis, will do.","date":"2014-10-21","mins":"12:03 pm","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","title":"Quick Reaction to In the Belly of the Beast"},{"id":"comment-164223","author":"mike_m","post":"Dr. Jackson in the video above (@12:06) confirmed that the folders were there when he went to asses the repair work done in 2002. The fold marks are very clear in the BBC video referenced in the original Post (My comment on the Belly of the Beast thread), they are not simply the creases that’s we see all over the shroud. They are sharp and run through the whole length of the cloth..","date":"2014-10-20","mins":"11:49 pm","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","title":"Quick Reaction to In the Belly of the Beast"},{"id":"comment-164319","author":"mike_m","post":"The BBC video was post 2002 and it was done in raking light..","date":"2014-10-21","mins":"8:05 am","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","title":"Quick Reaction to In the Belly of the Beast"},{"id":"comment-164224","author":"mike_m","post":"Sorry, Folders=fold marks.","date":"2014-10-20","mins":"11:50 pm","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","title":"Quick Reaction to In the Belly of the Beast"},{"id":"comment-92452","author":"mike_m","post":"Nice information John, I have never ventured into these territories before..","date":"2014-03-23","mins":"9:05 pm","url":"https://shroudstory.com/2014/03/23/john-klotz-from-his-upcoming-book/","cat":"news_&_views","title":"John Klotz from his upcoming book"},{"id":"comment-83055","author":"mike_m","post":"But Jesus answered, “I tell you, if these become silent, the stones will cry out!” (Luke 19:40).","date":"2014-02-27","mins":"9:07 am","url":"https://shroudstory.com/2014/02/25/russ-breault-its-in-the-heart-of-the-individual-believer/","cat":"news_&_views","title":"Russ Breault:  It’s in the heart of the individual believer"},{"id":"comment-86397","author":"mike_m","post":"I also think the pray Manuscript is a big challenge to the C14 date..","date":"2014-03-08","mins":"11:20 pm","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"id":"comment-87933","author":"mike_m","post":"Sunny afternoon…. Lucky you, we’ve had a blizzard here in Canada all day. We received 25 cms of snow. Enjoy the sun !.","date":"2014-03-12","mins":"7:44 pm","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"id":"comment-86532","author":"mike_m","post":"John Jackson also hypothesized that the CO produced during the fire would skew the C14 date. We can’t possibly know how much heat penetrated from the outside of the box to the inside during the fire, did someone experiment under similar conditions? This is mere speculations..","date":"2014-03-09","mins":"8:39 am","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"id":"comment-97164","author":"mike_m","post":"Like!!.","date":"2014-04-06","mins":"4:04 pm","url":"https://shroudstory.com/2014/04/06/more-on-the-y-from-stephen-jones/","cat":"news_&_views","title":"More on the Y from Stephen Jones"},{"id":"comment-104196","author":"mike_m","post":"Dave, Acts of mercy done with the wrong motive can be equally condemning 1 Corinthians 13:3 “if I give all my possessions to feed the poor, and if I surrender my body to be burned, but do not have love, it profits me nothing” With regards to the faith vs works debate, don’t forget Jesus telling Nicodemus that he must be “born again” to enter the Kingdom of God. And Ephesians 2:8 9″ For by grace you have been saved through faith. And this is not your own doing; it is the gift of God, not a result of works, so that no one may boast” I think James has the best explanation for this “You have faith and I have works; show me your faith without the works, and I will show you my faith by my works.” We are sinners and dead in our sins, we can only be saved by being born again by accepting, in faith, the free gift of salvation. The presence of works are the Litmus paper that Validates our conversion..","date":"2014-04-26","mins":"5:55 pm","url":"https://shroudstory.com/2014/04/25/some-advice-from-stephen-jones/","cat":"other_blogs","title":"Some Advice from Stephen Jones"},{"id":"comment-103648","author":"mike_m","post":"I agree, this sums it up. Judge the act not the person..","date":"2014-04-25","mins":"12:04 pm","url":"https://shroudstory.com/2014/04/25/some-advice-from-stephen-jones/","cat":"other_blogs","title":"Some Advice from Stephen Jones"},{"id":"comment-104291","author":"mike_m","post":"Dave, I dont think the parable you mentioned was about motive. He was basically saying “Actions speak lowder than words” irrespective of the motive. However, I believe according to Jesus, the motive is very important, “Beware of practicing your righteousness before men to be noticed by them; otherwise you have no reward with your Father who is in heaven. So when you give to the poor, do not sound a trumpet before you, as the hypocrites do in the synagogues”…(Matthew 6:1 4) clearly Jesus is condemning people giving to the poor to be recognized by others and not out of love to the poor, which is in agreement with what Paul was saying. Also, according to the dialogue with Nicodemus being born again was imperative for entering the Kingdom of God, no mention of acts of mercy or good deeds. He also clearly said, ” No one comes to the Father except through me” so if someone is doing good deeds but rejects Jesus salvation, he won’t make it to the kingdom of God. I Agree with you that James has the correct approach. Salvation demonstrated by works..","date":"2014-04-27","mins":"12:08 am","url":"https://shroudstory.com/2014/04/25/some-advice-from-stephen-jones/","cat":"other_blogs","title":"Some Advice from Stephen Jones"},{"id":"comment-97174","author":"mike_m","post":"Very disappointing, So Stephen just remembered now that everyone here is bad? Only when Dan tries to prevents him from defaming someone with no shred of evidence..","date":"2014-04-06","mins":"4:26 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","title":"Stephen Jones is even questioning my beliefs about the Resurrection"},{"id":"comment-86336","author":"mike_m","post":"Jenx, I agree, one of the most puzzling bible verses to me, yet most beautiful at the same time. Luke 10:21 ” At that time Jesus, full of joy through the Holy Spirit, said, I praise you, Father, Lord of heaven and earth, because you have hidden these things from the wise and learned, and revealed them to little children. Yes, Father, for this is what you were pleased to do.” Why would God hide His knowledge, and why would Jesus Rejoice in that… For the same reason you mentioned (the missing factor). God doesn’t want a genius with the wrong ( prideful) heart to find him only based on evidence. He would rather have a simple minded person with the right (humble) heart. So there will always be room for the doubters to doubt, there will never be 100% proof for God for the unwilling heart to believe.. Just indications/signs for the willing heart..","date":"2014-03-08","mins":"6:59 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"id":"comment-87322","author":"mike_m","post":"EGM, I will make this short because I am heading to work. I am happy you are not angry. As to “backing up my claims”, what claims?, The onus is on you and Stephen to prove your case. I haven’t seen any evidence yet, have you? The whole case is like a boring 007 movie. With covert KGB agents and calculator hacking. Why should I give you any evidence when I am not the one coming up with the outlandish claims. Sorry, I missed your DSM joke, I usually don’t miss good ones. I never claimed to be an expert and never insulted anyone, Can you quote me please when you accuse me of such things? And as for the claim that I am the son of the “accuser” I would say…”God bless you” since Jesus taught me to bless those who curse me. He knows my heart, and yours. I am always happy with His judgement, sorry, I don’t care about yours..","date":"2014-03-11","mins":"7:49 am","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"id":"comment-86390","author":"mike_m","post":"Jenx, thanks for the cross references, you are absolutely right..","date":"2014-03-08","mins":"10:59 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"id":"comment-86343","author":"mike_m","post":"Hugh, I think that was tongue in cheek. If not, Jesus, in the context of this verse, wasn’t talking about children. He was referring to His seventy two disciples who just came back successful from their first mission. They were mostly simple minded people with no resources (bag, sandal or purse) sent like “lambs among wolves”..","date":"2014-03-08","mins":"7:18 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"id":"comment-86277","author":"mike_m","post":"John & Annette, I agree with both of you. I also think the longer he harps on this very weak (ridiculous, in my opinion) argument the more damage he does to his more serious, very well referenced research..","date":"2014-03-08","mins":"2:15 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"id":"comment-86345","author":"mike_m","post":"LOL… Hopefully nobody was hurt : ).","date":"2014-03-08","mins":"7:21 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"id":"comment-86333","author":"mike_m","post":"EGM, I don’t discount fraud up to the sampling stage. However, after that to claim that 3 labs were hacked simultaneously, in my opinion, is absurd. I have been to analysis labs 100s of times before (working in pharmaceutical manufacturing for 11 years) waiting for the analysis of different pharmaceutical batches. The people who operate those machines (mass spectrometry, HPLC etc.) can tell by looking at the initial curve/slope what the analysis will be like. Jull in one of the interviews said that within 5 minutes they knew that the sample was not 2000 years old, and I believe him, because I’ve been in similar labs before. So it’s not that someone manipulated the numbers during processing the data, because you can’t fool scientists in 3 labs who were looking at the curve as the analysis was going on. The test itself would show to the experienced eye if the sample was old or young. Rather than resorting to conspiracy theories and branding other believers as Satans (i guess its an honour since Jesus himself was accused with the same thing), there are tons of real, credible pieces of evidence that supports the authenticity and discredits the C14 date. Conspiracy theories won’t get us anywhere..","date":"2014-03-08","mins":"6:46 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"id":"comment-87201","author":"mike_m","post":"EGM, Wow, I didn’t think I upset you that much. “It’s a bit naive to think conspiracies are not at work” … Who said that conspiraceis are not at work. All I said was that the hacking claim was ridiculous and didn’t make sense to me. You don’t believe me, fine, I am cool with that. “Lived a sheltered life” …. Very typical, can’t counter an argument go ad hominem. Please focus on the arguments without judging the person behind them, you don’t know me. “Noble members of the blog” …. Again very typical…generalize without countering the actual arguments just bundle everyone else together and brand them. It’s easier than actually listening to what they are saying. “find something in DSM to diagnose you with” dude…what are you talking about. When did anyone in this blog brand anyone with something from the DSM. Do you have an example or your just talking nonsense, for the most part people talk with respect in this blog (with some exceptions that Dan takes care of swiftly). “Can’t vouch for Jull’s character” ….neither can I, but why assume the worst in people. If you don’t know the guy why assume he is part of a conspiracy? Just because you don’t agree with him? “Have you as an expert” …… I never said I was. I am entitled to my opinion, based on my life experience, thank God I am allowed that here, don’t like it, so what…that’s what blogs are for.I say my opinion, you say yours. Why are you angry? May be because you have nothing to back up your claims with? “Quoting the bible to such wont make much difference” …..Neither to you my friend, so I won’t even bother..","date":"2014-03-11","mins":"12:44 am","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"id":"comment-141299","author":"mike_m","post":"Sorry Dan, This time I disagree with your title. This is an “insignificant criticism”, STURP’s objective was to examine “How the image was formed?” And not why? When? Or in what context. This was beyond the scope of their study and they shouldn’t be blamed for it..","date":"2014-07-30","mins":"5:22 pm","url":"https://shroudstory.com/2014/07/30/a-significant-criticism-of-sturp/","cat":"other_blogs","title":"A Significant Criticism of STURP"},{"id":"comment-141337","author":"mike_m","post":"It may be significant observation (in your opinion) but it can’t be a “significant criticism to STURP” because it was beyond the scope of their study. It’s like a medical study for a glucose lowering drug to treat Diabetes being criticized for not addressing the effects of the drug on arthritis. It’s not fair to the study to claim any significance for such criticizim, IMHO..","date":"2014-07-30","mins":"9:41 pm","url":"https://shroudstory.com/2014/07/30/a-significant-criticism-of-sturp/","cat":"other_blogs","title":"A Significant Criticism of STURP"},{"id":"comment-143151","author":"mike_m","post":"“in my opinion the cotton fibers were not superficial fibre” I think this is a very significant statement from a textile expert like professor Raes. Thanks for sharing..","date":"2014-08-09","mins":"6:50 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"}]
