[{"id":"comment-10196","author":"andy_hobelaid","post":"Go into all the world and preach the Good News to everyone. Anyone who believes and is baptized will be saved. But anyone who refuses to believe will be condemned. These miraculous signs will accompany those who believe: They will cast out demons in my name, and they will speak in new languages.* They will be able to handle snakes with safety, and if they drink anything poisonous, it won’t hurt them. They will be able to place their hands on the sick, and they will be healed.” Mark 16:15:18 Hello , I am Andy Hobelaid, M.Photog.Cr.APPO.MPA.HLM.and so on, hahaha. I am a Commercial Studio Photography, 1977 ?. In May 13, 2001, Mother’s Day at 7:00 a.m. London University Hospital, I relay on bad news. I was 45 year young. Four days without sleep; yawn? 96 hours I spent time in Sarnia, On. That where I was born, to finish the three jobs that we’re do; you guess it; on May 12, 2001. A 2100 sq. Ft. Studio, (really, 5,000 sq. Ft. That was crowd, 70 ft. X 210 ft,) it was on the drawing board, (I built two homes, the first one, 2,100 sq. Ft. And the next, 4,500 sq.ft.) I was using that 2,400 sq.ft for living space. Finish that three jobs, nap time. Oh, I forgot to tell you; I lost my speech two days in? No problems, I go to bed and I awake voice and all. Two hours bed? I was awake and I never had this feeling be for? London is the place for me. May 13, 1:00 a.m. The Nurse,blood pressure reading; 160 / 100? The Doctor, nice man, (physic wards?) 4:00 a.m. Morphine high, (drugs, don’t use them.) 7:00 A.M. (I WAS STARING OUT OF A NICE DREAM!) Andy (” HOBI “) I got some bad new. You had a Major Stoke. “Is that all, hahaha.) O.K. (I said to myself?) Grad my pant and skirt; eh, (a Canadian term, I don’t use it,hahaha,) my right arm; excuse me but I walk in with it, DID I NOT? My left arm working fine? HAY, MY RIGHT LEG, I SEE IT? It was five minutes, (morphine high,) mmm, my work here is finish! 8 years I could not talk. I look at the Computer, (1991 2001,) spell cat. Qzw, cat? Please excuse the writing spelling word? Day by day. 11 years, May 13, 2001. When the LORD Jesus had finished talking with them, he was taken up into heaven and sat down in the place of honor at God’s right hand. And the disciples went everywhere and preached, and the LORD worked through them, confirming what they said by many miraculous signs. Mark 16:19:20 God Bless. Andy Hobelaid ynda551@hotmail.ca.","date":"2012-04-08","mins":"11:25 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]
