[{"id":"comment-60310","author":"jeff","post":"While I don’t believe photographing an optical effect on a monitor can achieve anywhere near the detail, precision, or repeatability of modern image processing software, I can agree the Vatican cloth should be photographed with modern imaging equipment. There’s really no reason not do take some pictures. One of the most valuable thing researchers can do right now is probably the development of detailed protocols for future study — not just of the Shroud, but any other cloth, any other relic as well. It would be beneficial, for example, to have a specified set of imaging techniques and use the same exact (if given the opportunity) on the Shroud, the Sudarium, and the Vatican veil. Likewise, protocols for chemical analysis, DNA testing, etc. Should be developed and published in advance even of the request to study any of these relics. At the very least, it would define the sense of the research community of what should be done, by whom, under what conditions, etc. This is probably redundant. I’m new to this subject, so work along these lines may have already been done. If so, please point me to it. I know there’s a document detailing plans for a “STURP II,” but I can only imagine many of the methods proposed are dated. I guess what I’m proposing is a publicly available, possibly crowd sourced, “Torino Protocol” that is kept constantly up to date and ready to go should the pope ever give the “papal nod” authorizing new tests..","date":"2013-12-16","mins":"11:19 am","url":"https://shroudstory.com/2013/12/16/a-thread-dedicated-to-vincenzo-giovanni-ruellos-proposal/","cat":"news_&_views","title":"A Thread Dedicated to Vincenzo Giovanni Ruello’s Proposal"},{"id":"comment-63338","author":"jeff","post":"This kind of thing is the reason that bottles of peppermint schnapps need to be kept *far away* from the thesaurus at this time of year. Merry Christmas, you sedevacantist loons. Jesus is the reason for the season — and for the Church as well..","date":"2013-12-20","mins":"12:36 pm","url":"https://shroudstory.com/2013/12/20/fan-mail/","cat":"news_&_views","title":"Fan Mail"},{"id":"comment-52878","author":"jeff","post":"This is an interesting (lyrical?) twist on the misapprehension of Occam’s Razor common among atheists and some skeptics, who seem to believe that the most simplistic explanation which fits within their personal knowledge and experience is the same as the ‘simplest explanation that fits the facts.’ Yes, the imagination is capable of conjuring all kinds of scenarios. If it weren’t for those darned facts..","date":"2013-11-26","mins":"10:02 pm","url":"https://shroudstory.com/2013/11/26/imagine/","cat":"uncategorized","title":"Imagine"},{"id":"comment-53222","author":"jeff","post":"I realize many of these points are probably addressed in other comments, but I’m doing this stream of consciousness, so please bear with me. I agree with you completely on rigor mortis; skeptics have yet to produce any response on this issue as credible and authoritative as Zugibe. Yet they will blithely assert that the body would have been limp at image formation and proceed to erroneously interpret the anatomy as if the body were lying perfectly supine on a flat surface. They resolutely guard and nurture this misbelief because so many of their criticisms of the Shroud are dependent upon it. In addition to the evident rigor, the absence of distortions consistent with gravity and contact with a planar surface need to be considered. The hair, back and buttocks do not appear as they should. I think Gilbert Lavoie’s study and photographs are especially helpful here. Ideally, they should be reproduced using cadavers exhibiting various degrees of rigor; such observations, though, would be difficult to arrange without the professional access of an authority like Zugibe. Given the dearth of expected distortion, skeptics are effectively limited to arguing for one of the various flavors of ‘heated statue’ or bas relief theories. The body must have been a hard, even solid, material. Of course, these are easily confounded by blood, serum, and other obvuously biological evidence, which forces the argument back to consideration of a corpse. And round and round we go. The image is, and yet it cannot be. While I agree with the Augustine forumlation on miracles, I nevertheless think that the Creator’s understanding of nature’s physical laws permits manipulation on a level we cannot hope to understand any time soon. For this reason, I think it’s fair to say that the image is essentially “impossible.” It cannot be reconciled with what we understand of physics..","date":"2013-11-28","mins":"11:50 am","url":"https://shroudstory.com/2013/11/26/imagine/","cat":"uncategorized","title":"Imagine"}]
