[{"id":"comment-209788","author":"eugene_ray","post":"Dear Barrie, for what it may be worth, my Verloin de Gruy ancestors are linked to the shroud of Turin importation and location at the Lirey ( Le Ray) chapel in the Orient Forest / the Vergy family (w/ Chaney) were given the Shroud by the La Roche de Ray / eventually my de Bresse de Savoy ( de Gruyere link ) acquired the Shroud moving it to Chambery and Turin / I have written much about this on my blog…eugenerayarchitect.blogspot.com. …Also you can google my blog essays thus : EUGENE RAY / SHROUD OF TURIN or EUGENE RAY / LERAY CHAPEL (Lirey) EUGENE RAY / RAY CHATEAU EUGENE RAY / VERGY CHARNEY My de Gruy ancestors chateau in the Orient Forest were related to the Counts de Gruyere & the mother of the last count of Gruyere was a Vergy ( same as the wife of the last Holy Roman Emperor, Otto Von Habsburg who died at 100 years 2 years ago… The de Gruy chateau in the Orient Forest (Magny Fouchard) was destroyed in the 1st WW… My email address is…eugeneray1932@gmail.com. I am happy to answer questions / Our De Gruy Chateau was 15 K from St Bernard’s Clairvaux & Pres de Gaulles home.","date":"2015-09-06","mins":"9:40 pm","url":"https://shroudstory.com/2015/09/06/barrie-schwortz-to-speak-in-indianapolis-on-september-19/","cat":"presentation","title":"Barrie Schwortz to Speak in Indianapolis on September 19"},{"id":"comment-209815","author":"eugene_ray","post":"I should have mentioned the important point that many don’t realize Is that the Orient Forest (Orient meaning Jerusalem) where the de Gruy(ere) ancestors lived near Troyes was the Origins of >Knights ST BERNARD DESIGNED TEMPLAR CODE Templars< our de Gruy(ere) went to five Crusades and were deeply Committed Knights Templars building the only dome sugar mill at New Orleans / the Grand Orient ( first French ) Masonic Lodge was Originated at their neighbors Chateau in the Orient Forest / google : EUGENE RAY / SAINT BERNARD.","date":"2015-09-07","mins":"9:51 am","url":"https://shroudstory.com/2015/09/06/barrie-schwortz-to-speak-in-indianapolis-on-september-19/","cat":"presentation","title":"Barrie Schwortz to Speak in Indianapolis on September 19"},{"id":"comment-198654","author":"eugene_ray","post":"Note it is profound that the original 9 knights Templars came from the Orient Forest (orient refers to Jerusalem) and that Saint Bernard’s monastery is located close to the de Gruy chateau Magny Fouchard and that Charles de Gaulle settled nearby and that Joan d’Arc crossed the Aube river near the Gruy Chateau…all of the above persona adopted the Templar Cross…The CROSS OF LORRAINE !!! Used also by Otto Von Habsburg and I believe links w/ Merovingian Blood History !.","date":"2015-05-08","mins":"3:09 pm","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","title":"A Folding Method Charles Freeman Might Accept"},{"id":"comment-198650","author":"eugene_ray","post":"Please know that in the Ray Castle at Ray sur Saone France is the original wooden box that the Shroud of Turin was brought from Constantinople in and one can find the size of the Folds by the size of the box….Also my Verloin de Gruy Ancestors Chateau Magny Fouchard Was located near the le Ray (Lirey) chapel south of Troyes where the Shroud was brought After our Vergy ancestor married the famed French knight de Charney…it is a fact that our De Gruyere Ancestor,s (count Michael) mother was a Vergy as was the wife of the last Holy Roman Emperor , Otto Von Habsburg who died not long ago at age 100 with many Secrets of the Priory de Sion…I have written much about this history over the past decade, First for De Gruy Family history and now for my nightly blog based on my life & work…. GOOGLE : eugenerayarchitect.blogspot.com. (For my nightly blog) GOOGLE : EUGENE RAY / SHROUD OF TURIN Also GOOGLE : EUGENE RAY / KNIGHTS TEMPLARS (the de Gruy were Templars ) GOOGLE : EUGENE RAY / RAY CASTLE Also GOOGLE. : EUGENE RAY / ORIENT FOREST (site of De Gruy chateau , le Ray Chapel).","date":"2015-05-08","mins":"2:57 pm","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","title":"A Folding Method Charles Freeman Might Accept"}]
