[{"title":"Stigmata and the Shroud of Turin","post":"Stigmata will always be a contentious topic, as there is always the likelihood of subjective elements being involved. We certainly don’t know everything about the human psyche.  It is sometimes said that the stigmatist generally receives the marks where they believe the wounds in Jesus occurred.  If we believe that there is a divine element in stigmata, then receiving the marks elsewhere might not convey the same spiritual message intended, but may be more disturbing and confusing to the stigmatist than Providence deems necessary.\n\n","date":"April 22, 2014 at 6:01 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102276","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Agreed. The psychosomatic element could account for much of the stigmata characteristics. The body experiences what it expects to experience.\n\n","date":"April 22, 2014 at 7:27 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102306","author":"David Goulet","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Father Herbert Thurston studied the phenomenon, which was also demonstrated by Padre Pio. At this stage we can only say that it seems to be psychosomatic, but even that poses a problem because Pio is said to have had at had least forty gifts, including bilocation and invisibility.\n\n","date":"April 22, 2014 at 10:13 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102353","author":"Louis","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"You don’t need to be a saint to be a short-period stigmatic. You just have to very intensely face your own fear of death and accept to die while in deep meditation on the TS image.\n\n","date":"April 22, 2014 at 10:48 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102368","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"The process is much akin to that of hematidrosis.\n\n","date":"April 22, 2014 at 10:59 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102372","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Actually stigmata in both palms or wrists can occur in conjunction with hematidrosis.\n\n","date":"April 22, 2014 at 11:06 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102373","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Would this then be an “exercise” that could be videotaped?\n\n","date":"April 22, 2014 at 11:55 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102392","author":"David Goulet","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"If you got guts, just try for yourself…\n\n","date":"April 22, 2014 at 1:29 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102422","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Reminder: in the Grail legend, Galahad while uncovering the secrets within, dies in ecstasy…\n\n","date":"April 22, 2014 at 1:33 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102425","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"A knight templar uncovering the secret of the Templar idol died from fear..\n\n","date":"April 22, 2014 at 1:38 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102427","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Typo short-period-of-time\n\n","date":"April 22, 2014 at 10:52 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102370","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"This is no mere coincidence if the Holy Face of the Image of Edessa/Holy Mandylion was associated with Yeshua sweating blood in the garden of Gethsemane (Luke 22:43-44)\n\n","date":"April 22, 2014 at 11:14 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102374","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"http://www.catholicpamphlets.net/pamphlets/The%20Stigmata%20and%20Modern%20Science.pdf\n\n","date":"April 22, 2014 at 2:42 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102448","author":"Louis","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"What does Wikipedia say about this “archaeocryptography” or “archaeoperceptive cryptology”? \n“Archaeocryptography is not a recognized branch of Archeology or academic discipline. It is an example of pseudoscience or pseudoarchaeology that relies heavily upon predetermined calculations, and alleged evidence.”\nWhat could we then infer about professorships and attainments, if, once again, it’s “not a recognized branch of Archaeology or academic discipline”.  Hmm…\n\n","date":"April 22, 2014 at 10:56 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102573","author":"Pseudonym","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"They said the same thing about alchemy but thankfully that never stopped Merlin!\n\n","date":"April 23, 2014 at 9:10 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102749","author":"David Goulet","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"MPH?\n\n","date":"April 23, 2014 at 9:30 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102755","author":"David Bowman","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Don’t you rely too much on wikipedia…\n\n","date":"April 23, 2014 at 1:16 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102835","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"…don’t you rely too much on Wikicolinberrypedia (unless you take as truly scientific and archaeological his scorch theory in conjunction with Jacques de Molay). This is just pseudo-science and pseudo archaeology. Can the man (though a chemist) really tell a non-scorch from a scorch? I very much doubt it.\n.\n\n","date":"April 24, 2014 at 4:17 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103107","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"BTW this is Cryptology applied to (Late Antique and Medieval) Archaeology. Both Archaeology and Cryptology are academic disciplines.\n\n","date":"April 23, 2014 at 1:21 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102837","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"I bet you’re one of those cryptoarchaeologists who always looks down on archaecryptologists!\n\n","date":"April 23, 2014 at 2:15 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102856","author":"David Goulet","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"(misplaced comment)\nHere is the sentence: “I bet you’re one of those cryptoarchaeologists who always looks down on archaeocryptologists!”\n\n","date":"April 24, 2014 at 4:43 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103116","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"(misplaced comments) April 29, 2014 at 6:01 am Reply | Quote\nYour comment is awaiting moderation.\nJust in case Mike missed it (because of Dan systematically delaying the posting of my comments on his blog through moderation). On April 28, 2014 at 8:54 am I wrote:\n“Mike too bad you cannot discriminate between material/natural alchemy (Al-Kimiya = etym. kimya/kim-Ia Egy for “black Matter”/ Chinese for “gold fresh plant juice” = scientific etymology) and Christian spiritual alchemy (Al-Qiyamah = The Ressurrection = cryptic etymology) in conjunction with Christ as the philosopher’s stone. Your mind is set. You are neither an alchemist nor a crpytologist (not even a philologist or an etymologist) and you totally miss my point (there are two alchemies not just one, which you totally ignore).”\n\n","date":"April 29, 2014 at 6:15 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-105627","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"typo: (Kim-Ia) Chinese Fukin dialect\n\n","date":"April 29, 2014 at 6:19 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-105630","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Mentioning Merlin the Wizard, on December 1, 2011 at 9:33 amDecember 1, 2011 at 9:33 am | #11 Quote|, I wrote: \n“(in 1994) I have studied the Turin Shroud in the light of the Grail literature. This name (Merlin), for instance, can be read in old French to mean “honey white” or “ivory” refferring to a colour. In Latin, Merlinus can be read as the short for M[orte] E[t] R[esurectionem] LINUS, “The Death and Resurrection Linen”. In Welsh (via the word Myrrddhin), it means “WITNESS, MARTYR”. The very name of Merlin MIGHT WELL refer to the “M-martyr” Yeshua and his ivory-like time patina yellowed linen Shroud…” (in old French sidoine merlin/mellin, “honey-white/yellow shroud”).\n\n","date":"April 23, 2014 at 2:22 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102860","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Mentioning Merlin and Alchemy, the very word alchemy can play with the Arabic al-qayamah, “The Resurrection”… ;-)\n\n","date":"April 23, 2014 at 2:32 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102862","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"“Arabic al-qayamah, the resurrection”\nWe’ve talked about this before. This is simply not true, ask any Arabic speaking person. “Al-kemyah” (arabic=chemistry) is not “Al-quyamah” (arabic=resurrection). Please note the relative positions of the y and the m. Your insistence on this makes me question everything you say. You are simply toying with my mother tongue here, it’s like me trying to convince an English born person that “blame” and “bloom” are one and the same thing.\n\n","date":"April 23, 2014 at 11:15 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103023","author":"Mike M","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Don’t you make too much of a typo (yourself made typo on the same word though you are a native Arabic speaker a few montns ago, on Feb 27 2014)\nThe fact remain though to a medieval scholar the word Al-kemyah (from the Egptian kimia, “black earth’, which you ignored though you are an Egyptian) and Al-qyamah does play together. Transcription from Arabic to English leads to typo and yourself are not typo proof when it come to the same Arabic word (see your past comment). \nReminder for you et al :\nMike M\nFebruary 27, 2014 at 10:28 pm | #39 Reply | Quote\nHi Max, Arabic is my mother tongue and I have to disagree with that one.\nalqimyyah means chemistry, alqiamah means the resurrection\nMax Patrick Hamon\nFebruary 28, 2014 at 7:33 am | #42 Quote\n…Or from both Al-Qimyyah AND Al-Qiyamah (two words with one root)\nMike M\nFebruary 28, 2014 at 7:37 am | #43 Quote\nHi Max, you are right, I did mistranscribe, you see Arabic letters are very different from English and it goes from right to left. and I probably missed a Y after the i. the right word for resurrection is Al-QiYamah (القيامة). But that proves my point even more. The iY is before the m (م)and when pronounced its very obvious, where Qimyyah (or more likely pronounce Al-Kemiyah)( الكيمياء), the heavy iY or double Y as you wrote it is after the m(م). I lived in Egypt till I was 27 years old. Believe me, I don’t need to brush up on my Arabic. Please try to communicate with somone else who speaks Arabic and they will tell you the same thing.\nMax Patrick Hamon\nFebruary 28, 2014 at 9:26 am | #46 Quote\nThe very word khem or country of Chem (see the Holy Bible) can also be understood as a wordplay on Shem, “[the] Name” ie G.od.\nHence to the mystical quester, the very word alchemy could refer to G.od’s Resurrection = Christ’s as Opera Magna = OM (see Sanskrit OM)\nMike M\nFebruary 28, 2014 at 7:48 am | #47 Reply | Quote\nResurrection root in Arabic is from (قام) which is a verb meaning to stand up. The root of alchemy is the (كيمياء) which means chemistry\nMax Patrick Hamon\nFebruary 28, 2014 at 8:03 am | #48 Quote\nEtymologically speaking, it comes from the Aramaic Qam.\nMax Patrick Hamon\nFebruary 28, 2014 at 8:07 am | #49 Quote\nMike, don’t you make too much of it. Initially, it was just a typo of mine and a mistranscription of yours. Nothing else.\nMax Patrick Hamon\nFebruary 28, 2014 at 8:29 am | #51 Quote\nStricto sensu (كيمياء) is not the root but the three letters kaf-mim-alef are. BTW, the word kimya (كيمياء) is Egyptian for “black earth”.\nMike M\nFebruary 28, 2014 at 9:05 am | #52 Quote\nYeah, I am sorry. I know that كيمياء in Arabic means chemistry. I didn’t know the ancient Egyptian root for it. But it is still not resurrection which stems from “standing up” in Arabic\nMax Patrick Hamon\nFebruary 28, 2014 at 9:16 am | #53 Quote\nMike you first wrote # 39: “alqimyyah means chemistry” (with a “q” not a “k”) and then you wrote #46: “The root of alchemy is the (كيمياء) which means chemistry (with a “k”). This is rather confusing.\nDon’t you misunderstand me. Methinks (كيمياء) ‘kimyâ’ just means “woman from The Black Country”. It derives from ‘khem,’ “the black country” to designate Egypt. The Egyptian woman is just an allegory for Alchemy. Another etymology traces the word back to the Greek ‘chyma,’ “to fuse or cast metal.\nMy personal opinion is the word alchemy was coined from merging BOTH the Arabic word Al-Qiyamah, “The Resurrection” AND the Egyptian word kimyâ, “Woman from the Black Country” (to be understood in the light of the cult of Black Virgins). Hence the neologism [Al-Qimyyah] (written with a “Q” not a “K”) as the most likely etymology for the word Alchemy.\nMike M\nFebruary 28, 2014 at 8:32 pm | #54 Quote\n(…) I think the Etymology of Alchemy is based, as you mentioned, the Arabic word (الکیمیاء) Kimya meaning chemistry, without the need to merg it with (القيامة) arabic for resurrection (from the root of standing up) which I find to be very different in pronunciation. But really this is just my opinion based on my knowledge of Arabic ( being my mother tongue) I am not an expert in this.”\n\n","date":"April 24, 2014 at 3:52 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103096","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"“You are simply toying with my mother tongue”\n?!!!\nJust a typo. BTW medieval alchemists used to toy with signs and words even in Arabic (whether you like it or not).\n\n","date":"April 24, 2014 at 4:27 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103110","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Max, it’s not the Q vs K both are English letters trying to translate one Arabic letter “ق” . It is not also about the “i” vs “y” both are English letter trying to translate one Arabic letter “ي”. You clearly missed my point back then, and you missed it now again. My question again is this\nWhere does the ” m” stand in reference to the “i” or “y”?\nIt is not a typo, the typo would be choosing “k” or “q” but not where the letters stand with relation to each other. “Black” earth being the Arabic root of chemistry has nothing to do with “standing up” being the Arabic root for resurrection. They are two different words, and you are trying to make a connection that doesn’t exist. But then again, why am I doing this trying to argue my original language with someone who doesn’t speak it and doesn’t listen. Let’s just agree to disagree, and I hope one day you will try to confirm your assumptions with someone who actually speaks the language. Blame and bloom indeed have the same meaning.\n\n","date":"April 24, 2014 at 7:35 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103165","author":"Mike M","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Mike you wrote: \n“Black” earth being the Arabic root of chemistry has nothing to do with “standing up” being the Arabic root for resurrection. They are two different words”\nThank you I don’t need you ‘to think I don’t know’. I do know. I was the first to tell you the word Alchemy was derived from Egyptian Kem/kimia, black land/woman. As to the Arabic word Al-Qiyamah, it comes from the Aramaic Qam (to resurrect/stand up, I already told you what you weren’t even aware of). Now you are telling me I don’t know what I am talking about?!!! \nyou wrote: “and you are trying to make a connection that doesn’t exist.” \nHow do you know there is no connection between Al-Kimiya and Al-Qiyamah? Are you an alchemist, a philologist and etymologist, a cryptologist? The word alchemy can be studied from different angles not just yours as you advocate.\nThe Egyptian words kem (< kimia) means black land (Egypt) in reference to the dark silty soil of the Nile delta and was associated with the Nile valley life as opposed to death/barren land of the desert. 'Sarah the Black One' is associated with Alchemy (spiritual alchemy as the art of shifting from darkness/ignorance to light/truth and therefore resurrection).  \n\"But then again, why am I doing this trying to argue my original language with someone who doesn’t speak it and doesn’t listen.\"\nI got a few Arabic friends (two Syrians, one Palestinian, two Algerians, two Lebaneses) who do think I get along quite well in Arabic. Can you listen to a different opinion from yours when it comes to the word Alchemy or can't you?\n\n","date":"April 24, 2014 at 8:25 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103186","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Max, it’s funny how you quoted everything I said but the main question? Which stands out With a space before and after. So basically you have no answer. I hope you will ask any of your Arabic friends specifically about the relationship between resurrection vs chemistry in Arabic and let me know what they say. This thread really makes me doubt your other assumptions regarding ancient text. Everybody beware!!!\n\n","date":"April 24, 2014 at 2:16 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103297","author":"Mike M","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Oh your question? “Where does the ” m” stand in reference to the “i” or “y”?”. \nAbsent the facts you haven’t the foggiest notion of what regressive metathesis is all about as far as etymology is concerned and the word alchemy was adapted to the western world (Latin alchemia in 1144 and Old French alquemie in 1265), you totally overlook the fact the root is not Arabic but Egyptian! Besides there are several etymologies attributed to the very word Alchemy, which you don’t even seem to be aware of for instance the Hebrew Ham/Cham (Biblical name = Black) or the Greek khêmia… Etymologically speaking, your question is just naive.\n\n","date":"April 24, 2014 at 5:29 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103336","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Addendum: scientific etymology is one thing, cryptic etymology another. Now alchemist used to play with words and signs to cipher  their works, just in case you ignore it as you ignored the very word alchemy comes from the Egyptian Kem/Kemi/kemia though you originally are Egyptian. Beware of yourself and your alleged ‘knowledge’.\n\n","date":"April 24, 2014 at 5:37 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103339","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Addendum: Shall I repeat: stricto sensu (كيمياء) is not the root but the three letters kaf-mim-alef are. Etymologically your question is irrelevant re the ‘mim’ position.\n\n","date":"April 24, 2014 at 6:09 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103345","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Still no answer, and you haven’t asked your Arabic speaking friends what they think. Basically, you are just beating around the bush.\nLet me say this one last time and I will leave it there because I have better things to do with my time. Two words are not related because they share three letters.  If you believe it then “bloom” plays with “blame”. You have given absolutely no reference to the relationship between the “resurrection” and “alchemy” beside your wild assumption that this must be the case since both Arabic words share 3 letters.\nDo you have any reference, beside your guess work, that alchemy and the resurrection are connected?\n\n","date":"April 24, 2014 at 11:14 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103410","author":"Mike M","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Mike, re the word alchemy in light of word relation through xenoglossic  wordplays:\n In Chinese Fukin dialect Kim-Iya « gold plant juice » was Arabicized, by pre-Islamic Arabs trading in silk with China, as Kimiya, whence arose Al-Kimiya and finally Al-chemy. It was first accepted by Bucharic speaking Copts in Egypt who transliterated Kimiya, (as a wordplay with kemiya “black matter” alluding to the dark fertilizing silty soil of the Nile delta and associated to life as opposed to the barren land of the desert associated to death) = Chemeia, pronouncing it as the Arabs did.\nNow in Christian “spiritual alchemy/Al-Qiyamah” the Opera Magna is The Resurrection as opposed to material “alchemy/Al-Kimiya, Black Matter” as terrestrial matrix of the glorified body. \nIMPO (I repeat), the two Arabic words Al-Kimiya and Al-Qiyamah are linked (whether you like it or not)\nGot it?\n\n","date":"April 25, 2014 at 3:41 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103484","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Addendum: Kim-Iya (Chin-I in Chinese) was/is an elixir of immortality to which The Resurrected Christ was substituted as philosopher’s (corner) stone.\n\n","date":"April 25, 2014 at 3:58 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103489","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"In Egypt, alchemy is not only tied in with the fertility of the Nile River basin, fertility being referred to as Khem but with life after death.\nBy at least the 4th century BCE, there was a basic practice of alchemy in place, probably related to mummification procedures and connected strongly with ideas of life after death.\n\n","date":"April 25, 2014 at 4:29 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103497","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Mike, can you really understand my English?\n\n","date":"April 25, 2014 at 4:52 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103503","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Thus the very word alchemy can be connected with the taoist idea of immortality/longevity, the Egyptian idea of life after death AND the Christian idea of Resurrection (in Arabic Al-Qayamah).\n\n","date":"April 25, 2014 at 5:02 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103510","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Typo: Al-Qiyamah (since Mike is very touchy when it comes to his mother tongue).\n\n","date":"April 25, 2014 at 5:04 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103512","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Max, I do understand your English, I never claimed to understand it better than you though. So finally I get it, it was only your OPINION, based on the Fukin Chinese dialect (Dan, I am not swearing, I am using his own words :-)) meaning “gold plant Juice” which somehow ties in perfectly with”black earth” from Egypt? Since all these words sound similar they must be related. No mention whatsoever to the root of resurrection “Al-Qiyamah” in Arabic (because there is no where on hell It ties in with alchemy)  so, Max to establish the relationship goes all the way to china in alchemy but doesn’t touch the root of “resurrection” to which he claims a relation. Well, I am not convinced. But it’s my fault, I really thought he had a linguistic reference not his own speculations.\n\n","date":"April 25, 2014 at 7:48 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103551","author":"Mike M","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Mike , are you kidding?  Shall I repeat in Christian spiritual alchemy the philosopher’s stone is the RESURRECTED Christ and christian alchemy is connected with RESURRECTION/AL-QIYAMAH? How long are you to e in denial with facts?\n\n","date":"April 26, 2014 at 12:08 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103857","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Mike methinks you don’t even know about Bucharic speaking Copts in Egypt though you originally are an Egyptian….\n\n","date":"April 26, 2014 at 12:21 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103864","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Max, here is a fact… All the dictionaries I’ve seen say that Al-QuYamah (the resurrection) comes from Qam (arabic for standing up) this is something that even you acknowledged up there.\nNow you want me to throw all that in the garbage and believe you because the word has three common letters with the root of chemistry. Give me a brake,you say that I am the one kidding?\n1- You have failed to give me any linguistic reference (beside your own speculation) that this is the case,(المعجم or arabic dictionary)\n2- You have denied my assertion (since Arabic is my mother tongue) that this is not true.\n3- You have failed to consult your Arabic speaking friends. You just claimed that they think your Arabic is good?so I guess, everything you say must be true? (What a ridiculous claim when you are talking to someone who speaks the language)\n4-You have never answered my question as to the position of the letters in reference to each others because the question was “naive”. Max, Naive questions should be easy to answer not easy to ignore.\n\n","date":"April 26, 2014 at 7:48 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103993","author":"Mike M","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Mike too bad you cannot discriminate between materia/natural alchemy (Al-Kimiya) and Christian spiritual alchemy (Al-Qiyamah) in conjunction with Christ as the philosopher’s stone. Your mind is set.  You are not an alchemist and you totally miss my point (there are two alchemies not just one, which you totally ignore).\n\n","date":"April 28, 2014 at 8:54 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-104862","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"This is JUST a blog not an academic arena!\n\n","date":"April 23, 2014 at 3:39 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102897","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"I get the sense that once Dan has had a chance to sit down and check on his blog a lot of these posts are going to get scorched.\n\n","date":"April 23, 2014 at 4:12 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102908","author":"David Goulet","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Typo: MERLINUS = Mortem Et Resurrectionem LINUS [domini nostri Iesu] (more specifically)\nMentioning “dormant archaeopareidolias” and Merlin, on December 10, 2011 at 2:59 pm | #29, I wrote:\n“In the very Shroud Man Image seen as that of “an old man with white hair and a red beard” MAY BE found the origin of the legendary character created by medieval story-tellers and poets… reminder: Merlin as a mystical Druid (or Celtic priest) wears linen…” (this as an additional archaeocryptological wink to David).\n\n","date":"April 23, 2014 at 5:19 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102927","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"The Gundestrup cauldron (a richly decorated silver vessel, thought to date to the 1st century BC) depicts people and deities from Celtic mythology.  The most famous image from the cauldron is that depicting the celtic Horned God (one of the five rectangular long inner plates) that is mostly identified as Cernunnos. He wears a zigzag weave patterned linen cloth. The god is more usually associated with antlers, especially of the red deer. \nNow in old Celtic language caro means “deer/stag” and its Latin homonym caro is liturgical Latin to designate Christ’s body/flesh…  Zigzagged weave patterned linen cloth in conjunction with Christ body and a deer, Christ turning into a deer, Merlin riding a deer, a deer appearing to Saint Hubertus etc; ring any medieval symbolical/historiographic/legendary bell? \nActually, on the TS bloodied forearm area lies the dormant archaeopareidolia (or semblance/Rorschach-test-image-like vision) of a deer/stag head with a small cross over its head…\n\n","date":"April 23, 2014 at 6:04 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102934","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"… you just have to turn the positive bloodied forearm image upside down…\n\n","date":"April 23, 2014 at 6:07 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-102936","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Noted, many comments deleted.\n\n","date":"April 24, 2014 at 3:08 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103084","author":"Dan","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Bis (msplaced coment)\nI am just practicing brainstorming on this blog not indulging in a scientific method… and mst of the time typing in haste.\n\n","date":"April 24, 2014 at 3:58 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103099","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"I am just practicing brainstorming on this blog not indulging in a scientific method…\n\n","date":"April 24, 2014 at 3:57 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103097","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Reminder for Mike: the very first occurrence of the word Alchemy  in western literature dates back to 1265 (John of Meung). It reads ‘alquemie’ with a ‘q’ as in Al-Qiyamah not a ‘k’ as in Al-kemyah.\n\n","date":"April 24, 2014 at 4:54 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103119","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"(Misplaced comment again):\nReminder for Mike: the very first occurrence of the word Alchemy in western literature dates back to 1265 (John of Meung). It reads ‘alquemie’ with a ‘q’ as in Al-Qiyamah not a ‘k’ as in Al-kemyah.\n\n","date":"April 24, 2014 at 4:55 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103121","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Mike M…trying to argue with a archeocryptologist is like wrestling with the wind. And about as purposeful. :)\n\n","date":"April 25, 2014 at 9:15 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103575","author":"David Goulet","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"David you are absolutely right :-) its ridiculous\n\n","date":"April 26, 2014 at 7:59 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103997","author":"Mike M","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Mike & David, what is ridiculous is to be in denial of facts: besides myself all my few Arabic friends (I repeat two Syrians, one Palestinian, two Algerians, two Lebanese) did confirm there is a possible WORDPLAY per se (no matter how cryptic as far as material/Christian spiritual alchemy is concerned) between  the two words Al-Kimiya and AL-Qiyamah. Have you ever heard of wordplays or haven’t you?\n\n","date":"May 3, 2014 at 6:05 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-109655","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"What is ridiculous is to be an Egyptian, make a whole fuss about the word alchemy and totally ignore one of its two scientific etymologies is Egyptian (kemiya, “black matter) and most likely Kim-Iya, “gold plant juice” in Chinese Fuking dialect,  was first accepted by Bucharic speaking Copts in Egypt who transliterated Kimiya, (as a wordplay with kemiya “black matter” alluding to the dark fertilizing silty soil of the Nile delta and associated to life as opposed to the barren land of the desert associated to death) = Chemeia, pronouncing it as the Arabs did.\n\n","date":"May 3, 2014 at 6:33 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-109671","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"What is ridiculous is to be in denial of another fact: there are two alchmies not just one: material/natural alchemy (Chinese in terms of immortality/longevity/Egyptian in terms of life after death) as opposed to Christian in terms of Resurrection with Christ as the philosopher’s stone).\n\n","date":"May 3, 2014 at 6:55 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-109687","author":"tural","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Enough, Max. Calling people ridiculous is not appropriate. You’ve made your point. End of discussion. Period.\n\n","date":"May 3, 2014 at 7:38 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-109705","author":"Dan","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Dan I am not calling anybody ridiculous, don’t you misquote me (AGAIN). I am just replying to David’s and Mike’s comments. \nDadid Goulet\nApril 25, 2014 at 9:15 am Reply | Quote\nMike M…trying to argue with a archeocryptologist is like wrestling with the wind. And about as purposeful. :)\nMike M\nApril 26, 2014 at 7:59 am Reply | Quote\nDavid you are absolutely right :-) its ridiculous\nMike used the word ridiculous. I didn’t. Stop misquoting me, please.\n\n","date":"May 3, 2014 at 7:57 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-109719","author":"tural","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Is that the study of  Archeocrypticidae, those little cryptic fungus beetles?\nOkay, you win. It is not like wrestling with the wind. Now, where is my kite?\nEnough. Enough. Enough.\n\n","date":"May 3, 2014 at 10:21 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-109798","author":"Dan","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Dan,\n“Let it go, let it go\nCan’t hold it back anymore\nLet it go, Let it go\nTurn my back and slam the door” (Demi Lovato – Let It Go)\n\n","date":"May 3, 2014 at 1:30 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-109949","author":"Mike M","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"In cryptology applied to therapy/criminology/archaeology, details can make a world of a difference and lead to crucial evidence.\n\n","date":"May 3, 2014 at 12:37 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-109897","author":"tural","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"In French “tu râles”.\n\n","date":"May 3, 2014 at 12:44 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-109903","author":"tural","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"I don’t let go ignorance of etymology for knowledge.\n\n","date":"May 3, 2014 at 1:41 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-109956","author":"tural","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"I don’t let go ignorance of alchemy for knowledge.\n\n","date":"May 3, 2014 at 1:43 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-109959","author":"tural","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"(This is Mike’s real song)\n\n","date":"May 3, 2014 at 1:53 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-109961","author":"tural","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"I wasn’t talking to you. I was talking to Dan. I am not wasting anymore time on that thread.\n\n","date":"May 3, 2014 at 6:11 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-110144","author":"Mike M","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"I wasn’t talking with you either. Can you read English?\n\n","date":"May 4, 2014 at 4:52 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-110576","author":"tural","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"News: Padre Pio, Pope John Paul II and private detail of stigmata:\nhttp://www.catholicherald.co.uk/commentandblogs/2014/04/25/john-paul-ii-was-the-only-pope-who-padre-pio-entrusted-with-the-most-private-detail-of-his-stigmata/\n\n","date":"April 25, 2014 at 8:40 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-103798","author":"Louis","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Just in case Mike missed it (because of Dan systematically delaying the posting of my comments on his blog through moderation). On April 28, 2014 at 8:54 am I wrote:\n“Mike too bad you cannot discriminate between material/natural alchemy (Al-Kimiya = etym. kimya/kim-Ia Egy for “black Matter”/ Chinese for “gold fresh plant juice” = scientific etymology) and Christian spiritual alchemy (Al-Qiyamah = The Ressurrection = cryptic etymology) in conjunction with Christ as the philosopher’s stone. Your mind is set. You are neither an alchemist nor a crpytologist (not even a philologist or an etymologist) and you totally miss my point (there are two alchemies not just one, which you totally ignore).”\n\n","date":"April 29, 2014 at 6:01 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-105614","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Max, many of your moderated comments have been deleted as they are unwarranted personal attacks on one individual. Stop trying. If you continue, you may be completely banned from offering comments. If that happens I will not even see your comments for moderation.\n\n","date":"April 30, 2014 at 4:01 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-106469","author":"Dan","site":"shroudstory"},{"title":"Stigmata and the Shroud of Turin","post":"Thanks Dan\n\n","date":"April 30, 2014 at 2:10 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-107017","author":"Mike M","site":"shroudstory"}]
