[{"id":"comment-14719","author":"piero_iacazio","post":"In any case the discovery of the talc is an interesting fact (if the material controlled is the true material from the Shroud) and now we can try to do some simple experiments (included the works about the hypotheis of the talc as material used during the ceremonies for the “sanctified copies” ! See also : the strange case for the discovery about the Hg S and Mc Crone … ). So, we have to find the truth about the use of the talc powder … Regards, Piero.","date":"2012-08-10","mins":"10:37 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"id":"comment-14893","author":"piero_iacazio","post":"Dear Prof. Fanti, First of all I agree with you about the extremely vague certification about the samples used by Lucotte. But you are the responsible for some dust particles taken by Riggi that you used and perhaps you can say some other words also about the advanced analyses, the possible SP Ms analyses … remembering that we have to work in a non destructive manner. — — — — Last week I have read all the papers of the Special Issue (!). The work by Lucotte seemed interesting because he has found the talc powder sticked together the blood particles. Then we have to explain this fact. The possible reasons for that particular fact are the following : 1) contamination. Included the process similar the inclusion of the Hg S particles in the linen cloth that Mc Crone has found. Then the explanation can be the same. During the copy (contact) the transfer of the particles happened and then the talc powder was sticked with bloodstains (this phenomenon requires a certain pressure). 2) treatment of the corpse : this happened during the phase of the Deposition. After the use of the Oviedo’s cloth (Sudarium of Oviedo) the disciples used the talc powder (perhaps before to cover the corpse, into the tomb. This fact can also be considered as a proof for the preparation of the corpse (also in order to stolen the body !?!). But we have no proof about this particular idea. The work by Lucotte cannot be used for that purpose. It is too rough (from the point of view of the SPM controls). The level of the analyses for the talc powder sticked with blood particles is not useful because it is too rough. He has not used the SP Ms analyses and then, reading that work, we have no exact idea. What is the reason for the blood particles sticked with blood particles ? We can only speak about the vague hypotheses. 3) the entire linen was covered with talc powder (this seems to be a very strange idea). See the previous scenario. We have no useful proof to speak in one manner or another. — — — In conclusion : we have to see what will be the verdict obtained from the use of the Scanning Probe Microscopies (= SP Ms). Do you agree on that simple perspective ? I underlined this fact in 1998… Regards, Piero.","date":"2012-08-13","mins":"10:41 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"id":"comment-14657","author":"piero_iacazio","post":"… and what happens if you treat some area of the Face with the talc powder as it seems to be happened following (in an acritical manner) the discovery by Lucotte ? Regards, Piero.","date":"2012-08-09","mins":"9:35 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"id":"comment-14722","author":"piero_iacazio","post":"I beg pardon : hypothesis and not hypotheis ! — — At present the question of the bloodstains treated with talc powder seems to be only an hypothesis (without the inherent proofs). What is your idea ? Piero.","date":"2012-08-10","mins":"10:42 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"id":"comment-14944","author":"piero_iacazio","post":"Dear Prof. Fanti, Thank you for your praise … Now, what I want to underline is the question opened by Lucotte with these rough analyses (on material not properly certified). Is it possible to test in the right (non destructive) manner the blood crusts (with direct inspection) ? This seems to be very difficult, but I believe that using the SP Ms techniques we can discover the situation (but, after the centuries, the material can be brittle). The evaluation for the adhesion of the blood on linen is another interesting point to investigate. Unfortunately (if I am right) there is no adequate study (for an ancient archaeological linen) on that forensic argument. So, we have to work for the right research about the Shroud. I believe that some experiment about the blood stain dried into the weave of the linen samples and the subsequent ageing treatment is the starting point in order to see what happens in the case of the talc treated (or not) stains. What is your answer ? What is the true response from the linen treated with blood in the case of vibrations ? See also : the “earthquake scenario” (in the Special Issue : Lattarulo, Carpinteri, and other researchers indicated the presumed earthquake and the inherent consequences) and the different level of vibrations. I believe you are an expert in this field of vibrations because I have read your study on damping measurement of bending vibrations in alpine skis (an improvement of Standard ISO 6267, year = 2006). So … Thank you in advance ! Regards, PI.","date":"2012-08-14","mins":"10:39 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"id":"comment-15260","author":"piero_iacazio","post":"I see that my remark about the difficult measurements on linen (connected to the vibrations in the presumed earthquake scenario) has no answers. In my opinion it is possible to measure the cellulosic degree of polymerization in order to understand what is the true epoch of the old material (= the Shroud). This is the right way to work (in my opinion), the earthquake is a particular idea and we have not yet focused the limit to take in account when we speak on that subject. — — In order to show what is the true age we have to control the linen fibrils. Perhaps we can think to do something about the Viscoelastic Measurements of cellulosic chains (see also : the single cellulosic chains and the hydrogen bonds) by Driven Oscillation of an Atomic Force Microscope Cantilever… or similar works. Is it too difficult that control ? regards, Piero.","date":"2012-08-20","mins":"10:45 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"id":"comment-15428","author":"piero_iacazio","post":"I hope you have read the studies by Baker that I have indicated in my previous message. Well … In my idea the problem to solve is the following : How to find the length of a single chain ? You can think that a cellulosic chain can be a vibrating string… For example, see under : http://en.wikipedia.org/wiki/Vibrating stringv You can also remember Lord Kelvin and the dissipation of the mechanical energy, the mechanical damping, etc. These things are more interesting at level of fibres, for the characterisation of mechanical behaviour of deformations (or stresses) below the level of destruction. See also : the damping coefficient (and the viscous damping ratio, etc.) and the inherent equations. The range of tensile deformations where the Hook’s law can be applied to the textile fibres can be as small as 0.03%. But (in order to detect the epoch for that ancient material) we have to work at molecular level, perhaps with a great amount of observations… … So … Which types of playing techniques for the molecular chain ? And, at the end … Having observed the great number of cellulosic chains you must use the Statistics. Regards, Piero.","date":"2012-08-24","mins":"10:43 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"id":"comment-15539","author":"piero_iacazio","post":"In my idea there is an interesting argument to develop : the high atomic resolution and the control about the cellulosic chains and the different kind of molecules into the linen fibrils (that are mainly composed by Cellulose). I believe there is an interesting indication in the study : Prospects for Resolving Chemical Structure by Atomic Force Microscopy: A First Principles Study by Chun Sheng Guo, Michel A. Van Hove, Rui Qin Zhang, and Christian Minot Please, read the abstract, under the address : http://pubs.acs.org/doi/abs/10.1021/la101317s Using a metal tip (of the AFM) terminated in a CO molecule, the authors could image the internal bonding arrangement of a pentacene molecule with remarkable spatial resolution. The findings indicated that further application of that approach requires, for each sample, the careful selection of a suitable “imaging” molecule as tip termination. The name for the adequate system to investigate the material is the CFM (= Chemical Force Microscopy). See, for example, the study : Chemical force microscopy of cellulosic fibers [Carbohydrate Polymers 62 (2005) 369–378], under the address : http://biomaterials.forestry.ubc.ca/publications/Carbohydrate%20 Polymers%202005.pdf Reading the inherent abstract you can see that : >Atomic force microscopy with chemically modified cantilever tips (chemical force microscopy) was used to study the pull off forces (adhesion forces) on cellulose model surfaces and bleached softwood kraft pulp fibers in aqueous media. It was found that for the –COOH terminated tips, he adhesion forces are dependent on p H, whereas for the CH3 (= methyl group) and –OH terminated tips adhesion is not strongly affected by p H. … So (in my opinion), you have to try to work using the AFM CFM apparels in order to improve the knowledges and also to discover the material truth, instead to write the heterogeneous things. … sorry. Following these SP Ms (= Scanning Probe Microscopies) systems of control You can also discover something about the presumed BIF (Body Image Formation) and the presence or absence of radiations in the true BIF mechanisms. Am I wrong ? Why ? — — — Regards.","date":"2012-08-28","mins":"11:33 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"}]
