[{"id":"comment-18283","author":"piero_iacazio","post":"Try to see under the address : http://en.wikipedia.org/wiki/Inverse gas chromatography While in gas chromatography a sample containing multiple species is separated into its components on a stationary phase, Inverse gas chromatography uses injection of a single species to probe the characteristics of a stationary phase sample. — — Observe the movie (= Inverse gas chromatography and retention time for Cellulose and Nonane) under the address : and think what are the different molecules near the linen of the Shroud… and why we never have studied that interesting question in a deep manner in the studies about the linen of the Shroud ? See also : the question of the presumed “second Face” indicated (by prof. Fanti and other researchers) as present in the reverse side of the Shroud … Then the questions can be the following : What is the retention time (on linen) for the different kind of cadaveric amines ? Which is the retention time (on linen) for the aromas ? It seems that we were not able to find the inherent answers. Is that scientific work an useless waste of time ? What is your remark now ?.","date":"2012-10-25","mins":"11:37 am","url":"https://shroudstory.com/2012/10/24/comment-promoted-denis-mannix-on-his-proposal/","cat":"image_theory","title":"Comment Promoted: Denis Mannix on his proposal"},{"id":"comment-17704","author":"piero_iacazio","post":"First of all : I want to respect You and the International Meetings about the Shroud of Turin. — — You wrote : “”You must contact … “. Well. In the past I tried to contact some expert in the field of the AFM, but I obtained no great results. In my opinion “the many scientists involved” in the studies don’t follow the right way : the advanced analyses about the material (taking apart the other interesting questions : old and new Carbon dating, etc.). Why ? What is the exact reason for that behaviour after 14 years (= 1998 2012) ? It seems that only Ray Rogers tried to do something using the XPS analyses. Recently Prof. Fanti claimed something in the field of mechanical controls, but the proper way (IMO) is the use of the SPM. In this manner we can observe the linen fibrils and the thin layers (= also the so called “ghosts”, obtained from the tapes). — — What is your preferred way to control the linen sheet ? What is your professional level ? I am curious to understand your approach. For example : you discarded the question of the Raman analyses of the year 2002 (avoiding that argument), but this is (IMO) an interesting point to discuss. The Raman analyses can show something about the BIF. Now we can improve the precision (with respect the past Raman analyses of 2002) about the Raman analyses. Do you agree ? I hope you can send an answer also about this point. — — The other unclear statement that you wrote was the following : >the Church always moves slowly I don’t agree on that. In the case of the Shroud the Science moves slowly ! After 14 years we still wait for the exact answer. This is a very long period without the right works (apart the first rough attempts). — — What is your answer ? — — In my opinion no researcher (= no big name) is interested in a “simple work” that don’t offer the adequate fame or reward..","date":"2012-10-16","mins":"11:09 am","url":"https://shroudstory.com/2012/10/11/it-is-thus-but-may-not-berichard-dawkins-should-ignore-the-challenge/","cat":"image_theory","title":"It is thus but may not be–Richard Dawkins should ignore the challenge"},{"id":"comment-17795","author":"piero_iacazio","post":"I remember that in 2010 (after the IWSAI) a researcher indicated the emotion to see in vivo a genuine Shroud fiber at the microscope in transmission light, reflected light and between crossed polarizers. But no AFM controls … ! — — In my opinion it’s difficult to avoid the little destructions when we want to work with the analyses. But, at least, the SPM techniques seem to be the right way because using the 14 C tests there is a great destruction without repeatibility for the controls. Instead following the SPM controls we can work also on pollen without the great destructions and we can repeat the controls. In the past I tried to ask for the IWSAI, but my paper was not complete (with the new analyses). — — We can speak about the Turin Shroud, the Sudarium of Oviedo, the Manoppello Veil and the Tilma of Guadalupe for hours, but we have also to work in order to show (… if it is possible to receive the permission to investigate) what is the answer from the materials under the advanced analyses … Obviously we cannot destroy these relics/reperts during the analyses. — — In order to avoid the confusions it is better to work on similar relics (for Shroud and Oviedo’s Cloth are lignocellulosic materials instead the Manoppello’s Veil seems to be silkmarine byssus). — — B.T.W. : Yesterday I have found a very old AFM work (1996) : Atomic force microscopy of pollen grains, cellulose microfibrils, and protoplasts. At that time the level of the analyses was very rough : >The AFM analysis of the cellulose microfibrils did not show any substructures. …. ! — — The problem was due to the convolution effects. It was also indicated a deconvolution technique (to calculate the true structure of a biomacomolecule) based on gold particle as reference. Now the new AFM systems have a good precision. Here the address for the old study : http://www.biophysics.leidenuniv.nl/noort/publications/vanderwel96protoplasma.pdf — — Online : http://onlinelibrary.wiley.com/doi/10.1111/j.1365 2818.1995.tb03675.x/abstract you can read something about the : “Stereo representation of atomic force micrographs: Optimizing the view”, by Z. Shao, A. P. Somlyo Summary >The usefulness of stereographs for atomic force microscopy (AFM) is discussed and illustrated with AFM stereo images of biological macromolecules. The three dimensional nature of AFM data makes such display particularly appropriate, as it contains the information in an optimal format for creating stereographs suitable for direct evaluation by the human observer. We describe a simple procedure that employs standard functions in a commercial AFM for creating such stereographs. But I am not a biologist … — — Previously I wrote : >If we know the length of the cellulosic chains we can know the degree of polymerization But we have also to take into account the centuries and the possible damages (= fungal attacks, Fire of 1532, etc.) and then we have to chosen the proper area to test (after the first attempts on linen fibrils already taken from the Holy Shroud in the past). — — Have you an idea about the useful address where to send a paper ? What is your idea ?.","date":"2012-10-18","mins":"8:56 am","url":"https://shroudstory.com/2012/10/11/it-is-thus-but-may-not-berichard-dawkins-should-ignore-the-challenge/","cat":"image_theory","title":"It is thus but may not be–Richard Dawkins should ignore the challenge"}]
