[{"id":"comment-2516","author":"piero_iacazio","post":"I beg pardon for this very long message. But I tried to contact the website (Nature) and I was not able to send the following message : In the past (year 2002) appeared an interesting study : Analysis of Pigmentary Materials on the Vinland Map and Tartar Relation by Raman Microprobe Spectroscopy by Katherine L. Brown and Robin J. H. Clark — — — The VM is a world map on parchment measuring 28 cm by 40 cm which includes, significantly, representations of Iceland, Greenland and the north eastern seaboard of North America (“Vinland”). — — — The map and manuscript were analyzed by Raman microprobe spectroscopy using a Renishaw System 100 with a 632.8 nm laser and fiber optic probe. Laser powers of between 0.5 and 5 m W at the sample were used over accumulation times of up to 800 s. The laser spot size was \u00185 ím in diameter using a 10\u0002 lens as the probe objective. Areas of study were selected on the basis of pigment density or other specific features of interest. — — — The use of Raman microprobe spectrometry has conclusively identified the materials used in the construction of two significant historical documents, the Vinland Map and the Tartar Relation. Although the inks used for the Tartar Relation are entirely appropriate for the period of its construction, one of those used to draw the Vinland Map is not. The presence of a yellow line containing anatase, closely associated with a stable carbon ink, indicates that the VM is a modern forgery. — — But the Raman analyses are very interesting also in another case. Here the question : What were the results obtained for the Holy Shroud of Turin using the Raman analyses ? Under the address : http://www.renishaw.it/it/restauro di opere darte–7982 you can read the words : >Raman analysis is non destructive, and the use of remote fibre probes allows analysis to be performed on virtually any sample in situ. Renishaw’s expertise in this area was recognised in 2002 when the Sindonic Conservation Committee in agreement with Cardinal Poletto of the Turin diocese, selected their Raman instrumentation to provide analysis of the Holy shroud (also referred to as the ‘Turin’ shroud). Apparently (and after near ten years) we cannot yet say what happened in 2002 because there is not a public paper on this particular argument. So we cannot see the truth about the Raman analyses … — — In the past we have read the old results published in “Nature” (in 1989) and these data are very questionable with respect the probable truth about the age (see : the wrong Chi square value and other presumed errors indicated years ago) also because the recents remarks by prof. Jull (Univ. Of Arizona) seemed to be a sort of inconclusive step regarding the total truth for the true epoch (= the main question !) for this ancient relic. What is the answer from the scientific community ? — — I believe there is an interesting opportunity for the scientists who want to show the way to obtain the truth : the future papers for the review “Current Physical Chemistry” (see : bentham.org/cpc/Fanti HT%20rev.pdf) recollected by the prof. Giulio Fanti. — I believe that preliminar experiments on several AFM Raman apparels are able to furnish the useful explanations in order to try the important exploration about the linen fibrils of the famous relic. In any case the silence about the Raman analysis on the Shroud during the year 2002 seems to be an enigma. Was that Raman control a failure ? Have you found the solution of this enigma before to read the new papers ? — — Regards, Piero Iacazio.","date":"2011-02-18","mins":"1:50 pm","url":"https://shroudstory.com/2011/02/18/from-nature-news-on-science-and-religion/","cat":"news_&_views","title":"From Nature News: On Science and Religion"}]
