[{"id":"comment-12824","author":"artscience","post":"Menedemus : Cautious as I am by nature, I am,= not convinced that the Shroud is there, partly because I do not understand why anyone would want to copy it without making it very clear, from the size of the cloth and the double image, what they were wanting to show their audience. Hi menedemus, like you I also was not totally won over by the PM. But… I grant you that its not the best of pen and ink drawings (btw a very difficult medium as unlike most artistic mediums you’re sort of stuck with your crap lines if you make a mistake….I speak as one who has done pen and ink exhibitions). But the reason I single out your quote about the small size of the shroud is that I have seen it mentioned many times and even in W Ikipedia as evidence against the PM representing the Shroud. There are many things about the PM that are ‘suggestive’ of a connection, but I think the last image on Steve Jones page about the PM is the most impressive and is almost completely ignored by all. Http://theshroudofturin.blogspot.ie/2012/05/my critique of pray codex wikipedia 1.html Have a look at the two figures attending to the left and to the right. Steve Jones emphasizes with a green line the flow of the shroud around the two figures. This is the only sensible understanding I can make of the two figures who otherwise seem to be playing a bit of tug of war with some strange material in the background. Without Steve’s lines I would have completely ignored what these two were up to, but now my attention is grabbed, there seems to be no other proper explanation than they are holding onto the lengths of a rather extended shroud (if anything its now too long!). Notice how the cloth bunches up towards the head and flows over to be draped over the man on the left. I’m sorry to say I originally dismissed Steve Jones as an evangelical nutter but he has pinpointed a very strong and hidden bit of evidence that what is depicted is actually very large piece of material. (For those who disagree, please explain to me what the two guys to left and right are up to and whats in their hands). Whilst I’m at it, can anyone also explain what is being depicted other than the shroud in the image here of Emperor Romanus receiving some large piece of cloth with a disembodied head. This illustration also have a pre 1300 date. O, I do like a mystery….and trying to sense of it!.","date":"2012-06-20","mins":"7:00 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12825","author":"artscience","post":"Meant to include this link to illustration of Emperor Romanus receiving his “laundry”…see image half way down the page http://shroudofturinnews.com/documented proof of shroud of turin/.","date":"2012-06-20","mins":"7:05 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12873","author":"artscience","post":"Hi David, again an excellent reply. Yes, the Heures, Vie de sainte Marguerite image really does show the use of iconographic templates to achieve folding cloth depictions, but it does then beg the question why did the artist go to the trouble of showing the two attendants on right and left in an apparent tussle with the surplus material….what other explanation is there for whats in their hands other that material from the shroud, though I’m open to suggestions. I suppose your point is that the artist might not necessarily be illustrating the shroud but might be trying to do a copy of something similar to Ingeeburg Psalter. I think that my original point that the shroud depicted in the PM is actually very long, is still valid whether the artist is trying to do something like the Ingeeburg Psalter or attempting a depiction of the shroud. Though whether the top and bottom images on the PM are both actually the shroud seems debatable. Some nice puzzles to think over. BTW Do you know what is being depicted but the long extended cross extending from the bottom image to the top image? There almost seems to be a detached hand holding the cross..","date":"2012-06-21","mins":"4:13 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12872","author":"artscience","post":"Thanks Menedemus, I’m just curious as to the truth of the Turin Shroud and have no real bias either way. I come from a physics background but also studied art and researched into old master techniques so I was curious as to how the image was formed. It would be nice if there were some truth to its claims, but getting reliable evidence for or against seems tricky as there often seems to be an agenda behind the evidence. I’ve only a very cursory knowledge of the Shroud but it does stand out as unusual in art history (and it also stands out from its copies as it seems to be very obviously of a different level of skill and detail involved). I have a couple ideas of how it might have been made if indeed it was. Yes, I have noticed that there is a fair level of rough and tumble in the forum …. Just got to laugh it off if possible! Nevertheless I’ve learnt a lot by snooping in here every so often, and am thankful for people’s opinions, as I feel it has helped me better formulate my own opinions. Nice hearing from you, best wishes. PS Thanks for the explanation of the origin of the name you use..","date":"2012-06-21","mins":"3:59 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12837","author":"artscience","post":"David Mo : As the Mandylion was a sacred image the man can not touch it directly. So he holds it with his cloak. Nice explanation, David…I can go with that! That enlarged image helps clarify that. Thanks. One mystery solved. What is your opinion of the green line on the PM as extolled by Steve Jones? That certainly still seems to be indicating a long shroud. Though I might not have made the final green connection on the right that he does (giving a continuous cylinder of cloth!).","date":"2012-06-21","mins":"4:01 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12916","author":"artscience","post":"HI David thanks for your reply. I must admit I’m not so persuaded this time by your arguments. I’m not entirely sure why its extraordinary that a Hungarian monk might have gone to Constantinople and seen shroud with herringbone pattern from say a couple feet way, then returned and after months/years tried to recollect what he could. He might have decided that his skill in drawing a body imprint on the cloth was not sufficient to distinguish it from an image of a dead and singularly unrisen Christ resting on shroud, so decided that herringbone texture was the next best thing. I think its an established fact we are dealing not the most versatile of artists and to add to his pains the necessity of showing what is a faint human body image flattened …now that would have been extraordinary! We know that witness testimony and memory can be unreliable, so he might have painted the nail wounds where people expected and also he was more interested in conveying the crucifixion and resurrection story than igniting an anatomical controversy. (poor bastard, if only he knew his drawing would be subjected to this level of forensic detail, he’d be squirming in his grave!). So I’d downgrade your extraordinary to mildly unusual, but then I dont know medieval art like you do..","date":"2012-06-22","mins":"2:25 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-26053","author":"artscience","post":"Had a spare moment on a Friday afternoon to check out his statement “his eyes are located too high. In addition to making faces too large, amateur artists tend to place the eyes about 2/3 to 3/4 up from the base of the chin to the top of the head.Human eyes are actually located close to the middle of the head.” I’m an amateur artist and the position of the eyes on the Shroud didnt seem wrong to me, but being a scientist decided to measure, and the position of eyes on the Shroud were just about half way up the head as they should be (NOTE: this is measuring the head as being from the top where there is a bit of uncertainty where the top is exactly, to the position of where the beard splits. This lower position ie where beard splits is about right otherwise you end up with a Jesus with an abnormally large jaw). Makes me wonder if he actually tried to measure these..","date":"2013-03-01","mins":"11:37 am","url":"https://shroudstory.com/2013/03/01/observations-consistent-with-a-medieval-artist/","cat":"art","title":"Observations Consistent with a Medieval Artist?"},{"id":"comment-16053","author":"artscience","post":"Hi Davor, can you provide a link to your likeness of Jesus on your blog as I couldnt find it? I think you’d be amazed with how much much the brain can be tricked by putting into key markers in a portrait to achieve a resemblance. In fact those key markers can be as minimal as a hairstyle (eg see Dali’s Mao Marilynn portrait, where he makes Marilynn Monroe look like Mao with just a hairstyle!!), or a moustache type (eg Hilter and Freddie Mercury impersonators). So I wouldnt be so dismissive of the Vignon markers as they would be a lot easier to add into a portrait than getting the proportions right which really is a harder proposition (I say this as an occasional portrait painter). Getting the proportions right are only important when you are trying to match a known person, where people with automatically feel something is wrong, but whey you are going for a iconic Jesus, I guess you can just rely on beard, moustache, flowing hair and some perhaps a hardful of these markers. Also Vignon markers would be a lot easier to transmit over the ages than a set of proportions. If I were to try to test out the validity of these markers, I’d try and see how many of these markers appear in other medieval portraits vs the Christ portraits. Though I am not entirely convinced by the Vignon markers myself, I still cant totally dismiss them either as there does seem to be some sort of purposeful attempt to work at least some of these into the Christ portraits. Thats why I’m interested to see what you achieved by following these markers only. Thanks.","date":"2012-09-09","mins":"7:22 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","title":"Quote for Today: Hans Belting and commentary"},{"id":"comment-16143","author":"artscience","post":"David, just to clarify…unlikely doesnt imply illogical. For someone who uses it a lot to imply a faulty argument, its only fair that you use your words correctly. Thanks.","date":"2012-09-11","mins":"8:47 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16200","author":"artscience","post":"No problem, David. I just thought I better make sure you knew that incorrect use of words can lead to difficulty understanding. I take it that you meant to say its improbable rather than illogical. The reason I bring it up is in regard to above you mention above your point 3.2. I think it concerns whether a barely described artifact can have a big cultural effect. Many years ago, I got interested in the effect of optical instruments on the history of art (see Hockney Falco thesis). There seems to be a number of art historians (including Martin Kemp), who think it likely that artists such as Carravaggio, Holbein and others used mirrors, lens etc to project an image onto a surface for easy rendition of features, and this radically changed the history of art. However there is precious little documentary evidence of this. And you are talking about a number of centuries. David Hockney describes it as “Secret Knowledge”, a secret passed on from studio to studio. And even in the cases where this knowledge isnt known, the new style of painting still becomes pervasive (see the followers of Carravaggio who tried to emulate the style without knowing the secret). So I think Yannick idea that a small showing of a naked Christ on a shroud could have a large ripple effect and without its cause been widely known, is entirely possible as an explanation of how come naked Christs come into vogue. Thats why I’d be a bit careful about disparaging unlikely ideas….change often only happens when something extraordinary comes along. I’m not saying this in necessarily the case, but art shifts often come from exposure to something different (eg primitive cubism from Picasso’s exposure to African sculpture in the Louvre). BTW I tried out some of the optical techniques myself and people were amazed at my much improved artistic skills, until I told them how I’d done it! Artists generally guard their secrets more wisely!!.","date":"2012-09-12","mins":"3:04 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16178","author":"artscience","post":"Hi Charles, when you mention shrouds, were these all with an image and blood etc. And are one of these the Shroud of Turin? I must say I’d be more than surprised that the Shroud (of T) itself didnt garner more interest than relics of cross, thorns etc. I cant understand how a large cloth with an image, showing nail wounds in hands, and feet, side wound, real blood, indications of a crown of thorns, a summation of death and resurrection, plus an image of what Jesus looked like would be outclassed by any of these others (which are very easily faked). Any ideas of why this might be as it doesnt make the remotest bit of sense to me..","date":"2012-09-12","mins":"9:15 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16219","author":"artscience","post":"Hi David, sorry you are clearly missing the point of my mention of “Secret Knowledge”. I’m not suggesting Caravaggio had anything to do with the shroud at all – that makes me laugh, as thats off by a couple centuries! No, my point was that the use of optical instruments in the history of art is almost completely undocumented even though very influential – so I was drawing an analogy to Yannick’s theory that there might have been a showing of the shroud, that was undocumented, and yet had an influence on future depictions of the burial of Christ. If I understood you correctly, you dismissed Yannick’s theory because you thought it an oxymoron for an undocumented artifact to have a large cultural influence. I disputed that with the counter example above..","date":"2012-09-13","mins":"5:53 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"}]
