[{"id":"comment-12933","author":"artscience","post":"I’m not entirely sure what is the nature of Colin’s claim on the markings, but I will address the one detail that was mentioned about the leather between the lead weight leaving a mark whereas the leather attaching the lead weights to the handle apparently not. Its an interesting observation but easily explained by Newton’s physics. The momentum of the lead weights makes them travel deep into the flesh, dragging the leather between them inspite of the leather having too little momentum by itself to penetrate the flesh. However the bit of leather attaching to the handle and near the point of attachment to the lead though dragged with the weight will flex back on hitting the flesh as it hasn’t got sufficient momentum to penetrate (in contrast to the leather between the weights which is constrained to be between the lead weights and so cant flex back). So that would explain the absence of the marking of the tether leather. However as with many things in physics its often worth experimenting to see whether the reality matches the theory..","date":"2012-06-22","mins":"5:56 pm","url":"https://shroudstory.com/2012/06/20/berry-shroud-was-scourged-not-the-man-a-critical-look-at-faccini-and-fanti/","cat":"blood_studies","title":"Berry: Shroud was Scourged, Not the Man. A Critical Look at Faccini and Fanti"},{"id":"comment-8398","author":"artscience","post":"Thank you again, Kelly for your balanced and clear answers. You mentioned the fact that the blood appears to be on the cloth before the image, hence ruling out (or at least making it highly difficult to get proper registration between blood marks and body). Just to drill down a bit into this bit of information: 1)how do we know for sure that the blood was there before the body image – I saw mention of blood being scraped off in one place to reveal no image underneath. Do you know if this was done in a number of places or just the one? 2)and how do we know that the blood didnt dissolve the image material underneath it? To answer my own last question, I think I saw Ray Rodgers tried various solvents unsuccessfully on this outer coating material, but did he try blood as a solvent? 3)do you know if the whip marks are a combination of welt marks (eg dumbell shapes etc) and blood marks. If whip marks are such a combination, they make a good study to whether it was likely that blood was painted onto the cloth separate to the body image. There was a method (certainly known during the Renaissance if not earlier) called pouncing by means of which a flat drawing could be transferred to another surface (by pricking holes along the outline and important contour lines on the original drawing, placing the drawing on top of final surface and pouncing with charcoal dust in a bag through the holes), so it is theoretically possible that a forger could know where a flat 2d body image would eventually lay, and hence put blood at the appropriate places before the image is transferred. This however would only work accurately for a flat image transfer, whereas a 3d or bas relief would pull linen away from those originally sketched positions….Not to mention that it would be a very awkward way for any artist to work. Sorry if I appear to have a sceptical mind, but its more to determine how much wiggle room there is for doubt. Thanks.","date":"2012-02-17","mins":"8:58 am","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8403","author":"artscience","post":"Yes, Colin, I am also puzzled by the ability of the blood to still wet a Shroud hours after the event. Perhaps Kelly might have some ideas here as well. Just an idea, does blood fully clot in the rain? or perhaps in washing down a body in preparation for burial it allowed a fresh leakage of blood. From my own minor and brief experience in trying to get a hit and run victim to hospital (in a country with no ambulances!), I was surprised to find in the back seat where he had rested a quivering mass of very soft jellylike blood at least an hour later..","date":"2012-02-17","mins":"10:15 am","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8412","author":"artscience","post":"Thanks Deuce and Kelly, for your replies. I could imagine some bloodstains are due to semi dried blood and some due to fresh leaking when laid flat….I suppose if one could distinguish between the two, say by correlating those that penetrated through to the other side of the cloth with what one reckons should be the fresh leakage, whereas the semi dried ones wouldnt be expected to penetrate as deeply into the cloth, this could help build a bit a substance to the theory of the two types of blood flow (pre and post mortem). Yes Kelly I have seen the uv light images of skin abrasions that arent normally visible (in fact these were what I was thinking of when I thought it might be interesting to match these up with visible bloody whip marks). I find these hidden artifacts (along with the hidden blood serum halos) some of the most articulate bits of evidence against a forgery..","date":"2012-02-17","mins":"6:10 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8429","author":"artscience","post":"Thanks Max on your comment about the halakhic ritual of washing down remoistening wound areas and it seems consistent with Rons’ reference to Zugibe’s paper. That would help explain some of the body blood stains, though the hair bloodstains still seem problematic. I notice in the description of halakhic ritual that the hair is combed, so perhaps if the body had been washed, the damp hair whilst being brushed would have picked up blood oozing from disturbed thorn wounds, giving rise to the streaky, ringlet nature of some of the bloodstains in the hair..","date":"2012-02-18","mins":"6:29 am","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8365","author":"artscience","post":"Thanks Kelly, that was very informative. Whilst we have someone as knowledgeable as your self in our midst, do you mind me asking you whether you can corroborate the story about the Shroud’s blood being able to retain its red color (rather than turn black or brown), due to a reaction with bilirubin released during extreme stress? I’ve heard this or something similar being mentioned but no authorative report on this. Thanks.","date":"2012-02-16","mins":"5:51 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-25055","author":"artscience","post":"Hi Matthias, like Hugh I also think this is a very interesting experiment and might open up a new explanation for the mysterious double blood trails at the back. I am generally a sceptic but this sort of subtle unexpected blood trail would start moving my stance a bit or at least make the explanation by means of a cunning forger more difficult to swallow. Well done for actually trying out this out … I might even be inspired enough when I’m having my birthday celebration drinks tonight to try it with some tomato juice to see how close to the intertwining pattern you can get (yes, my wife already thinks I’m bonkers;)..","date":"2013-02-20","mins":"12:18 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-8371","author":"artscience","post":"Thank you Kelly for your patience in replying so speedily. Would this necessarily rule out the idea of blood being painted on during a hypothetical forging of a Shroud? I presume first of all that they have already determined it is human, rather than say animal blood. How easy would it be to get bilirubin infused human blood and keep it liquid whilst painstakingly creating all the blood marks before clotting sets in? Also does the Oviedo cloth display the same level of red for the blood ie is it bilirubin rich as well?.","date":"2012-02-16","mins":"6:28 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"}]
