[{"id":"comment-7906","author":"artscience","post":"Hi Yannick, Oh I’m more than willing to admit pure speculation but its always a good way to start (I’m a pure novice to Shroud studies but sometimes coming from a different background might reveal something…most probably that I’m an complete idiot, but who knows!). I did a very brief google search for ancient coins trying to find collars or lapels with that distinctive flex. Well the first thing that struck me was how rare a frontal portrait was on an ancient coin (rough estimate 1 in 200). I was looking for a double line collar with a flex. I only found one double line so far (google “ancient coins front portrait” near the bottom of the page). I agree with your assertion that an artist could quite easily create such a collar without seeing the shroud, but on viewing the coins I’ve seen on google so far, it mightn’t be so daft an idea to query whether this might have happened. I’ll just state again what I find peculiar about this collar is that inflection….artists will normally use an economy of means to indicate form (ie a simple arc would have sufficed, so why the flourish of an inflection particularly if you are doing double close lines where you have to be careful to keep lines roughly same distance apart in a wax original). Just an idea!.","date":"2012-02-03","mins":"8:48 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","title":"Ben Wiech’s video about the Justinian coin from AD 692"},{"id":"comment-7909","author":"artscience","post":"Hi Yannick, sorry to disagree but the Christ Pantocrator you reference has a single black line lapel but the image on the coins have a double line (and they are not fold lines, because horizontal fold lines on the edge of garment wouldnt flow like that through the inflection). I also looked at the the icon from St Catherine’s, and there is no line there at all. I also googled early images of Jesus and again couldnt find any double line lapels (also on coins a rarity). So I do still think one can ask a valid question, did those double lines on the coin get inspired by viewing the Shroud directly or are they just an artist’s whim or perhaps a sign of regality added distinguish a ruller? I dont know what the answer is, but given the relative uniqueness of the double line it seems to beg the question. Yannick,perhaps you can help me with an unrelated question: where did the two fork like hair strands on the forehead come from, as I see them in many subsequent images of Jesus but they are not on the Shroud as far as I can see? Thanks.","date":"2012-02-04","mins":"5:46 am","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","title":"Ben Wiech’s video about the Justinian coin from AD 692"},{"id":"comment-7902","author":"artscience","post":"The other observation (very minor) is that the heft sheen on the top side of the beard in the right coin image does correspond to the sheen on the shroud image’s beard (admittedly on the negative image of the Shroud). Doesn’t sound impressive until you have the two images side by side and its about the first thing that catches the eye!.","date":"2012-02-03","mins":"7:22 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","title":"Ben Wiech’s video about the Justinian coin from AD 692"},{"id":"comment-7904","author":"artscience","post":"Yannick, I dont really know the Mandylion theory, but I do know that even in contemporary times an art object of great value will be hidden away in vaults whilst a poor substitute is displayed (and in times before photography this might go unnoticed and unremarked). I could imagine that eventually the substitute (the Mandylion) becomes the icon of veneration whilst the original glides along unnoticed and unwanted and so preserved for generations..","date":"2012-02-03","mins":"7:43 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","title":"Ben Wiech’s video about the Justinian coin from AD 692"},{"id":"comment-7900","author":"artscience","post":"The double lines for the collar do seem to have a correspondence with the double line creases on the shroud as Dan mentions. They both have a similar inflection (ie a flex in the normal artistically simplified flow of the garment, or if you’re a mathematician the double derivative of line changes sign in the similar way). This isnt that impressive as the flex is almost inevitable in real life but often artists will simplify especially if working on a small scale like a coin. Why flex when a simple arc would do? I suppose comparing to other contemporary coins of other rulers who help resolve whether the artist went out of his/her way to add the inflection. This does however lead on to a more interesting observation: if the Shroud did exist in 692 AD, and was displayed revealing mainly the head, such that artists would quite naturally confuse a crease in the cloth of the shroud for the top of a garment worn ( you wouldnt make this mistake if the whole were revealed), would this help support Ian Wilson’s theory that the shroud was displayed folded in 8, just revealing the head. If one presumes only the head was shown for reasons of convenience of size (the shroud isnt the most convenient of sizes and at 4.4m compares with Jackson Pollack paintings on width and awkwardness on finding suitable displaying venues) and mainly propriety (ie a nude would be scandalous at the time), it is quite understandable that an artist might confuse the double lines of the crease as a part of a garment worn by Jesus..","date":"2012-02-03","mins":"7:09 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","title":"Ben Wiech’s video about the Justinian coin from AD 692"},{"id":"comment-172520","author":"artscience","post":"Hi Charles thank you for that informative reply. I’ve thought about your shadow idea and though ingenuous has some problems/advantages in that, 1) in order to make shadows on the cloth it has to penetrate the gesso layer which is a high reflectance surface (but again there’s a good test of this, hold up a gesso covered canvas to strong light to see whether there is a discernible glow, showing at least some light getting through). Next put a simple image (again say a 5 cm black X say from cut out card) and see if you can read it through the other side of your canvas with bright light passing through, testing image fidelity. 2)there might a natural negativity of shades produced because say dark pigments on the surface, absorb light, so not allowing much to get through to the canvas, whereas light pigments reflect light and so perhaps allowing more onto the canvas and darkening the canvas there. So you might expect tone reversal as on the shroud. The Zittau Veil, yes looks interesting in the areas where pigment has fallen off. I suspect not all the pigment has fallen off (a close up photo would be nice if you have) giving the faint image. You mention that it was keep in a steamy environment, so it is quite possible the pigments have leaked past the sizing boundary (weakened by steam) onto the cloth. The shroud image seems to be mainly composed of darken fibrils with minimal contribution to pigments that have been detected on its surface. My own theory about how I might go about making a shroud would be to get a front and back facing low relief brass effigies made (i.e. Just like those used in brass rubbing but not so flat, maybe having slightly more relief differentials in the surface to try to capture some of the face subtlety). These I’d heat to a glowing heat and the allow to cool and give time for heat to become more uniform, to a scorching temperature. Then I’d apply the shroud on top but only touching the surface by means of a roller mechanism (e.g. Like an etching press). This allow a nice uniform contact time to be achieved and pressure deferential scorch image to be produced. Some tentative bits of evidence to this method is the presence of those awkward fold lines across the shroud….this is very typical of what you get if you use an etching press and don’t use the prerequisite number of blankets to press down on your paper – without the blankets the paper rides up ahead forming a buckle what is eventually squashed down as the roller proceeds, giving those awkward folds. The shroud has a number of these running roughly sideways across the length (there are some longish ways that I can’t explain so easily). The other bit of evidence for this approach is that the areas with the smallest cross ways width tend to be darker (i.e. As the weight of roller is applied over a smaller elevated section, the pressure is higher…..hence for example the head seems darker). This technique has all the relevant technologies available at the time form brass plates, to rollers. However there still seem to be lots of other subtleties about the shroud (e.g. The presence of fine almost invisible whip marks, no image under blood (if true)) that make me not completely won over to my theory..","date":"2014-11-22","mins":"8:36 am","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","title":"Charles Freeman’s theory now in Wikipedia"},{"id":"comment-172527","author":"artscience","post":"Oh and the other aspect of the roller theory is that it would also might make a faint secondary image on the opposite side of the cloth (such an image seems to be there in high pressure areas like head). The image here would be less do with scorching (as its not against the brass panel) but more due to pressure crushing the opposite surface differentially. However if the roller was hot as well, this might help image formation. Again….I’m not totally convinced but it does have a number of things going for it. Though I would like the Shroud to be authentic, brutal truth must win out unfortunately..","date":"2014-11-22","mins":"9:06 am","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","title":"Charles Freeman’s theory now in Wikipedia"},{"id":"comment-172566","author":"artscience","post":"Thanks Charles. Yep, only problem with trying to produce the shroud how it might have been say 7 centuries ago is we have no clear idea of what it looked like….was it in colour, were the outlines delineated, was there a background image, what medium was used, was there rabbit skin glue sizing applied? Still the fundamental question is how to get the faint yet detailed image onto the cloth. With the Antikythera Mechanism, we know for sure that its ultimate form was not to be a corroded mess of gears, but a fully functioning astronomical instrument whose predictions we will be able to verify as accurate by tallying up to know astronomical data. Whereas the Shroud in its present form is able to function as an object of veneration and wonder and who is to say it is definitely different to what it was 7 centuries ago (ok burnt holes etc and most probably fainter are different, but whether a full blown painting, I’m not sure but you might be right….I just can’t see the mechanism to get the painting transformed onto the bare cloth with such high fidelity) Without seeing the Zittau Veil in detail its hard to know how it compares to the shroud but I’d caution about jumping to conclusions that because on cursory look it appears similar to shroud, its the same mechanism at work. I know that when I try and reuse a canvas by scraping down, you are left with a faint image but it is still composed of pigments, not a shadow..","date":"2014-11-22","mins":"2:13 pm","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","title":"Charles Freeman’s theory now in Wikipedia"},{"id":"comment-172409","author":"artscience","post":"Hi Charles, I hardly ever comment here but I had to ask about the Cellini method of sizing canvas and your idea that that it seems to tie in to the shroud’s image on the outer fibrils of the linen. Now from the description of Cellini’s method it just sounds like the standard way I used to size my canvases (in fact most artists used to until modern methods came along within last 40 years). So here’s the method: what I’d do is heat up rabbit skin glue till dissolved in water, and apply this solution thinly to the surface of the stretched canvas. Applying thinly allows the dried sizing to make a thin flexible protective layer (flexible so canvas can take knocks and recover and indeed can even be rolled up – Titian if I remember correctly, often sent paintings far and wide this way), and protecting the fibres from any corrosive action of the paint or paint medium. An additional gesso layer adds not only another protective layer but most importantly a reflective white surface that the semi translucent paints within a medium (oil or egg tempera) could be applied to. Now the problem I have with your theory (unless I’ve understood it wrong) about the shroud being a flaked painting done in some similar such manner to the above, is that you seem to be saying that the painting done on top of these protective layers somehow penetrated through to affect the outer fibrils, such that when flexed over the centuries all that is left, after the painting/gesso/rabbit skin size layer falls off, is an imprint of the painting onto the linen a couple layers below. Can you see why I have a problem with this cornerstone of your theory? And additionally the imprint has 3d information within. I am a physicist and not very good painter (but I try!) plus bit of an amateur art method historian e.g. Studying how Vermeer, Carravagio achieved their realism. Whenever I see the shroud dismissed as a just painting I weep because that sweeping statement will convince many yet completely hides the many difficulties in creating the shroud. I’m not convinced the shroud is authentic but my scepticism also is honest enough to say that it is by far the most baffling artwork in existence…size, technique, novelty, subtlety, realism, surprises, details. BTW I did have a painting flake off in parts, and though I wasn’t really looking for it, I can’t remember seeing any imprint of the painting coming through. But in true scientific manner, rather that dismiss your idea out of hand, I suggest you try doing the rabbit skin glue, gesso, then oil paint (though perhaps in 13/14th century oil paints weren’t in regular use then, perhaps egg tempera instead) a nice big black X on the surface, leave for a couple months and then flex like hell until all the sizing comes off and see if the X appears on the canvas. You never know I might get a surprise!.","date":"2014-11-21","mins":"2:40 pm","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","title":"Charles Freeman’s theory now in Wikipedia"},{"id":"comment-16693","author":"artscience","post":"Hi Charles, thanks for the nice clear reply. As I mentioned I most probably am leaning towards the C14 date being correct, but got curious whether anything can be made of the evidence going against this. I’ve never read Ian Wilson or the Acts of Thaddeus so most probably am missing the point, but from my (perhaps confused) understanding of this, I built up a picture of a possible sequence of events: that the Shroud (with image on it, and neatly folded and stitched) was interpreted as a towel and the burial clothes were some other cloths (perhaps the strips of linen, whether real or fake, the gospels mention). So the burial cloths looked the part (ie what they expected to see) so were mentioned as such and the folded Shroud looked like a towel and so mentioned as such. An easy enough mistake for the writer of the Acts, if he didnt have recourse to unpick the stitching and determine that he had got it wrong. If I remember correctly one gospel mentions strips of linen and another mentions Joseph of Arimathea buying a large expensive cloth. Might these be distinct – why buy an large expense cloth only to cut it up into strips. Perhaps the strip are to bind the shroud together onto the body. So I dont really see a cut and dry reason to dispense with this evidence completely, but neither am I totally persuaded by it. I put it in the “hmm, that’s curious” category. I might wonder how come no one around the time of Thaddeus thought to unpick the stitching and have a little peek, but then again it seems that it also took a couple centuries for them to unpick the backing layer of the present TS recently for cleaning and find the faint image (Fanti’s claim at less) on the back hidden side..","date":"2012-09-21","mins":"1:47 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16479","author":"artscience","post":"I’m sort of surprised by Matthias description of Stephen Jones folding as strange. If you actually tried it (I did with a large bath towel), its actually very easy. But what I noticed, if it was folded this way, you might have to hold it together by stitches both to the top and bottom of the folded form. However if you folded it as Dan’s original graphic there is no necessity to stitch the bottom as the folds contain each other and hold together at the bottom but not at the top. So you’d expect for Dan’s folding, there be stitching at the top, but isnt strictly necessary for the bottom, whereas for the Jones approach you need to stitch both top and bottom. I noticed that the illustration of Agbar has diagonal tassels at the bottom which might be due to stitching. I cant notice any at top but they would not be visible if you were doing a perspecitve view. I also noticed that the image of the fresco show some sort of folded image (I’ve put the horrendously long link below), which seems to show very faint diagonal tassels as well at least at the bottom ( I’m not sure what the hell’s going on at the top, but I note that the sides seems to attempt to show some sort of folding…you got to zoom in to see it.) I also remember that there was another image of Emperor Romanus being given some sort of cloth with a head image also with tassels (at top this time, not sure at the bottom). So the Jones’s folding has a slight evidential advantage. I’m not sure what the Acts of Thaddeus are but I’m sort of perplexed that they being taken either verbatim or as complete nonsense. Now I’m not a historian, I’m a physicist, but I could imagine that the imagination could play a fair part you are describing how an image might have gotten onto a cloth 400 years previous, but you might be a bit more precise about the foldings if the cloth were there to be viewed. So I find it strange that Charles seems to say the tetradiplon description is rubbish much like the confused hearsay sequence of how the image got on there. One is hearsay, the other you might be able to verify. Forgive me Charles if I’ve interpreted you wrong. As a scientist I’m more biased to believe the C14 dating, but I got to admit there are many puzzling bits of counter evidence that make me put a question mark to my certainty ….The history of science is one of change when the evidence speaks loud enough. There are so many tantalizing bits of “half evidence”, that I cant quite accept completely, no dismiss readily. I’ve got to say, you couldnt quite make up the twists and turns in the unfolding story of the evidence – there’s been no knock down argument either side (unless you include the C14 but even then I’m curious as to the spread of the 3 different dates from the different labs, as you start to wander into 3 sigma territory ). Http://www.google.com/imgres?imgurl=http://img442.imageshack.us/img442/8884/redman.jpg&imgrefurl=http://deumvidere.blogspot.com/2012 06 01 archive.html&h=420&w=646&sz=83&tbnid=y2t N2 M3 T2q ZAM:&tbnh=77&tbnw=118&prev=/search%3 Fq%3 D The%2 B Image%2 Bof%2 B Edessa%2 B(11th%2 Bcentury),%2 B Sakli%2 Bchurch,%2 B Goreme,%2 B Turkey%26tbm%3 Disch%26tbo%3 Du&zoom=1&q=The+Image+of+Edessa+(11th+century),+Sakli+church,+Goreme,+Turkey&usg=  m GVC 0 Y1ap B Gr5g Od5 M56xmd F4=&docid=Kk Cd Ujc Ays1 L3 M&itg=1&sa=X&ei=Bsx YUMS5 E Yn Oh Ae O4 I Gw DA&ved=0 CCQQ9 Q Ew AQ&dur=432 http://www.google.com/imgres?q=emperor+romanus+shroud&um=1&hl=en&client=safari&sa=N&rls=en&biw=2171&bih=1201&tbm=isch&tbnid=R5z4p Di I Rp DAIM:&imgrefurl=http://shroudofturinnews.com/documented proof of shroud of turin/&docid=l Akn95 HX Yr9 Bl M&imgurl=http://shroudofturinnews.com/wp content/uploads/2011/08/Shroud passed to Emperor Romanus.jpg&w=274&h=184&ei=BNVYU Ovs DN Syh Af E7o Go Cw&zoom=1&iact=hc&vpx=206&vpy=179&dur=599&hovh=137&hovw=191&tx=117&ty=68&sig=108957755986079293482&page=1&tbnh=130&tbnw=174&start=0&ndsp=91&ved=1t:429,r:0,s:0,i:75.","date":"2012-09-18","mins":"4:44 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16481","author":"artscience","post":"Edit: “no dismiss readily” should be “nor dismiss readily”. (start to understand a little of where Max’s manic editing comes from!).","date":"2012-09-18","mins":"5:01 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16522","author":"artscience","post":"Another thing to bear in mind is that in the story about the Jesus’ face appearing when he wiped it with a towel, is that perhaps it was also an attempt to explain why the eyes appear shut (as you do when you wipe with a towel). Nowadays most face cloths have a thickness to aid absorption – might an 8 folded cloth stitched together be seen as an attempt at a towel?.","date":"2012-09-19","mins":"2:06 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"}]
