[{"id":"comment-8442","author":"artscience","post":"I like the theory, Colin…I never knew that the outer casing was darkened all the way around like that (but I’m fairly new to this). A run away reaction could explain that and traversing along the fibril. However I still think the explanation of the image on the other side is weak, as whatever heat is conducted has to go through the body of the material and if its hot enough the pyrolyse the hemicellulose on the other side, its hot enough to pyrolyse the hemicellulose of the in between fibres and darken them as well(which it doesn’t). And again I think you’re pulling a fast one with the supposed high conductivity of cellulose, which the tables show isnt the case..","date":"2012-02-18","mins":"2:05 pm","url":"https://shroudstory.com/2012/02/18/a-new-hypothesis-leapfrogging-luigi-garlaschelli/","cat":"image_theory","title":"A New Hypothesis: Leapfrogging Luigi Garlaschelli"},{"id":"comment-8482","author":"artscience","post":"Well the sheets where meant to show that the intervening layers of threads will do a fair bit of reflecting back. But stick to a sheet of linen if it helps…you still got major problems to address but perhaps one you can try to solve is how you going to heat up the sand enough just from your faint difference in ir, to distinguish an image on the backside of the linen. And all this without burning through more than 200nm of the top layer. Better start on Plan C.","date":"2012-02-19","mins":"5:51 pm","url":"https://shroudstory.com/2012/02/18/a-new-hypothesis-leapfrogging-luigi-garlaschelli/","cat":"image_theory","title":"A New Hypothesis: Leapfrogging Luigi Garlaschelli"},{"id":"comment-8485","author":"artscience","post":"Well I’m keen on getting workable hypotheses and at least one didnt seem to come within that category ( involving dubious heat flows in wrong direction) but please go ahead and test, its always the best way as nature will often surprise us. Anyway I might have another hypothesis, but I need to find out from you (as you have access to Fanti’s paper about the 2nd image)…are we sure that 2nd image is also due to the same mechanism (ie the darkening of the outer sheath of the fibril). If it wasnt, perhaps if the linen were wet whilst touched on the bas relief, any impurities in the cloth or loose scorch marks would be steam blasted, where contact was greatest, through to the other surface, appearing as a faint image there (but not on outer sheath of fibres). I’m not sure if this is any better(making a mess of the blood stains as well), but it would perhaps explain why the internal material isnt darkened..","date":"2012-02-19","mins":"7:00 pm","url":"https://shroudstory.com/2012/02/18/a-new-hypothesis-leapfrogging-luigi-garlaschelli/","cat":"image_theory","title":"A New Hypothesis: Leapfrogging Luigi Garlaschelli"},{"id":"comment-8445","author":"artscience","post":"Colin, I even think, for your theory to work to sustain the exothermic reaction until it reacts all the way around the cylinder, it needs that cellulose have low thermal conductivity because otherwise the heat gets removed from your reaction zone. Still I like the theory’s ability to explain the “full on/ full off” image characteristics..","date":"2012-02-18","mins":"4:06 pm","url":"https://shroudstory.com/2012/02/18/a-new-hypothesis-leapfrogging-luigi-garlaschelli/","cat":"image_theory","title":"A New Hypothesis: Leapfrogging Luigi Garlaschelli"},{"id":"comment-8458","author":"artscience","post":"Colinsberry : Methinks someone has forgotten the difference between heat and temperature, It’s not enough to have the right temperature. There has to be sufficient thermal capacity for the hemicellulose coatings to be “ignited” – possible with hot backing sand, with ample mass, probably not with light cellulose fibres en route (but the latter can still conduct, as they do to high thermal capacity water in that trick with the bag. …Err, no. Your science is skewed again, Colin. For heat to flow from hot metal side of cloth to hot sand side of cloth, there has to be a temperature gradient, so if its hot enough to send facial information and pyrolyse onto the sand side, its hot enough through the middle of the cloth to pyrolyse as well. So if metal is say 350 and sand is 300 and pyrolysis kicks in at 320…for the sand side to get a facial marking, it must have risen to above 320 due to heat flow from the metal side (and any cloth in between will be similarly scorched as due the temp gradient it must be above that 320 temp). So you are asking of your forger to not only be a superb artist, anatomist, historical expert but also a thermodynamicist capable of making heat go in the wrong direction from cold to hot. A tall order if I may say so! So though I like part of your theory, it only partially explains the Shroud image and I think it would also struggle with the blood markings as well. I know it a bit like asking you to gnaw off your own leg, Colin, but would you concede that the Shroud is not just a mystery to the gullible as your blog implies, its a puzzle to seasoned observers, sceptics and scientists as well?.","date":"2012-02-19","mins":"8:56 am","url":"https://shroudstory.com/2012/02/18/a-new-hypothesis-leapfrogging-luigi-garlaschelli/","cat":"image_theory","title":"A New Hypothesis: Leapfrogging Luigi Garlaschelli"},{"id":"comment-8471","author":"artscience","post":"Still doesnt make much sense to me, Colin…One of the good things about your theory was that hemicellulose was exothermic, and so it had a good ability to self sustain once above the pyrolysis temperature. But now you’re saying that though the energy supply through the thickness of material is enough to bring the sand interface up enough degrees to pyrolyse but its not enough to keep in pyrolysis any reaction inside the material (that should have some ability to self sustain in any case)? Remember that the sand bed is still effectively a large heat sink relative to the pyrolysis temperature, more likely to keep the temperature of cloth next to it below pyrolysis. If the energy coming from the metal side is enough to raise this heat sink temperature sufficiently, then its enough to keep internal pyrolysis going. I am await your Plan B with anticipation..","date":"2012-02-19","mins":"1:53 pm","url":"https://shroudstory.com/2012/02/18/a-new-hypothesis-leapfrogging-luigi-garlaschelli/","cat":"image_theory","title":"A New Hypothesis: Leapfrogging Luigi Garlaschelli"},{"id":"comment-8477","author":"artscience","post":"“principles, so let’s not get too bogged down in the detail” Well thats the big problem is that the devil is in the details. Concerning Plan B, let me give a simplified model of what you mean (do tell me if this is not what you mean). Suppose for simplicity we have some simple image say shaped like a letter E, and replace the cloth by layers of paper. Then we get a darkened E shape scorched onto the top surface of first sheet of paper, and then this heats up more and re radiates ir light, say through 3 more sheets of paper at the bottom of which is a black sheet of paper (representing the sandbed), that black sheet gets a bit hotter where a fuzzy image of the E would be, and that extra heat is enough to trigger pyrolysis on the back surface of the final white sheet (which has been kept at a temperature just below pyrolysis normally). Nice idea but with some big problems; 1)the intervening light layers of paper who reflect much of the ir back, perhaps with multiple reflects giving a very fuzzy image 2)the faint scorched E is only very faintly different from the rest of the paper so the temp difference is going to be very slight on the black sheet, and additionally during most of the scorching time there is even less difference. 3)the black sheet (ie the sand bed unlike the metal) is hard to evenly heat, and ensure is just below pyrolysis (and we are talking about the days before decent thermometers) 4)the ir heat that gets to the black sheet has to first heat this up (and we’re talking a heat sink of sand), before it can start to pyrolyse the last sheet. I’m not sure this is any better than Plan A, sorry..","date":"2012-02-19","mins":"4:56 pm","url":"https://shroudstory.com/2012/02/18/a-new-hypothesis-leapfrogging-luigi-garlaschelli/","cat":"image_theory","title":"A New Hypothesis: Leapfrogging Luigi Garlaschelli"},{"id":"comment-8601","author":"artscience","post":"Nice experiment, and easy to do, Dr. Lazzaro. Thanks. I suppose the next obvious experiment would be: how about heating the coin up away from the cloth and then place it down on the cloth for 1, 2, 3, 4, 5 seconds, then 10s, then 15s etc. Getting a series of scorching It seems as though it should be possible to catch a partial scorch, no?.","date":"2012-02-21","mins":"5:14 pm","url":"https://shroudstory.com/2012/02/21/colin-berrys-idea-is-untenable-and-heat-cannot-produce-a-superficial-coloration/","cat":"image_theory","title":"Colin Berry’s idea is untenable, and heat cannot produce a superficial coloration"},{"id":"comment-8606","author":"artscience","post":"I wasnt sure why they set the arbitrary time of 5 seconds, but I suppose to manoevre a big hot statue up and down might take 3 seconds minimum. Does the hemicellulose pyrolyse at a lower temp? I suppose you could try the minimum temp and say 3 seconds, see what you get..","date":"2012-02-21","mins":"5:53 pm","url":"https://shroudstory.com/2012/02/21/colin-berrys-idea-is-untenable-and-heat-cannot-produce-a-superficial-coloration/","cat":"image_theory","title":"Colin Berry’s idea is untenable, and heat cannot produce a superficial coloration"},{"id":"comment-8612","author":"artscience","post":"Good point, Deuce, though potentially you could have a cold pre run to get the space in the sand ready (though that itself has drawbacks because the moment you have a prepared negative shape in which to sink into, you are losing any potential pressure differential against the cloth to get the features distinguished)..","date":"2012-02-21","mins":"6:46 pm","url":"https://shroudstory.com/2012/02/21/colin-berrys-idea-is-untenable-and-heat-cannot-produce-a-superficial-coloration/","cat":"image_theory","title":"Colin Berry’s idea is untenable, and heat cannot produce a superficial coloration"},{"id":"comment-8222","author":"artscience","post":"Hi Dave, I do think your objections are valid and the creation of the shroud by means suggested with a life size bas relief does seem like the equivalent of mobilising entire US armed forces in order to kill a gnat, if we are to believe the reports of the gullibility of medieval people for relics! But as Colin mentioned that isn’t really a scientific objection, we just want to see could it be done with technologies available. The imprint characteristics hint more strongly to a scorch than any other approach, however I doubt that it FULLY explains the image like Colin is already claiming, but I do think it is worthwhile investigating to be sure the claims are robust to attack. I agree that there is no other recorded art form of a similar type using heated statues, though there is an ancient art practised in many cultures going by the name of pyrography of creating burnt image art.!.","date":"2012-02-14","mins":"3:58 am","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","title":"Quote for today on why the shroud image is not a scorch"},{"id":"comment-8237","author":"artscience","post":"Well I cant take much credit for the term pyrography, though I must admit I’m quite a wizz at googling! And you are quite right that the Shroud is not very subtle in appearance when viewed with the naked eye, so that makes it all the more startling to find hidden in it information that would have been wasted on the medieval or modern unaided eye! So why the hell would a medieval forger go to that elaborate extent to put that incredible detail in given that it wouldnt be noticed by his contemporaries? There’s a question you could pose on your shiny new blog, Colin if you are actually trying to find the truth about the Shroud (which I’m completely undecided about myself), rather than give the solace to those who have already decided that its a fake..","date":"2012-02-14","mins":"3:08 pm","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","title":"Quote for today on why the shroud image is not a scorch"},{"id":"comment-8246","author":"artscience","post":"Colinsberry : @Art Science “…said that God does not play dice”. No disrespect to one of the greatest minds of all time but….. That’s quite alright, Colin, no disrespect taken, but I certainly cant remember saying that, especially since I do actually play dice ;) But seriously, Colin, how on earth can you can yourself a rational scientist when every rational argument against your cause is either ignored or put down with some stupid remark (like using terms such as ‘so called’, witchdoctor, gullible or pseudo science etc )? If just strikes me as totally dishonest. You might be too set in your ways to be open to argument. It reminds me of a quote by another great mind, Max Plank (one of Einstein’s greatest influences): Science advances one funeral at a time. Anyway, I hope that you carry on with your experiments because nature always seems to do a better job of convincing than humans do. PS by the way, Bohr had a nice retort to Einstein’s quote, something like:”Don’t you go telling God what he can and cant do”. Though I might sometimes have similar thoughts to yourself regarding the nature of the Shroud, I think we should also bear in mind Bohr’s words..","date":"2012-02-14","mins":"5:38 pm","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","title":"Quote for today on why the shroud image is not a scorch"},{"id":"comment-8310","author":"artscience","post":"Hi Colin, actually I feel as though I rather under represented your words as you seem to sprinkle phrases like Mickey Mouse science (Adler’s work for instance), pseudo science, and various other belittling put downs rather liberally, and almost entirely without justification. But I dont want to get into that…I prefer to stick as close to the science as possible. Now going back to the birefringence problem, and Ray Rogers claims about the cellulose fibres in the image area retaining their birefringence and hence ruling out strong heat as the cause of the image. I’m not so sure now that I disagree with his conclusions….he has a paper that seems to show cellulose’s susceptibility to heat and radiation and the loss of birefringence….that loss seems to be permanent (he gives examples of ancient cellulose which bear birefringence marks of cosmic rays or radiation from radon). I think I remember you mentioning something about the possibility of repair of this loss by active oxygen….can you give more details, so I can clarify this point, and determine whether we can hold on to this evidence or have to dump it. Thanks.","date":"2012-02-15","mins":"2:21 pm","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","title":"Quote for today on why the shroud image is not a scorch"},{"id":"comment-8184","author":"artscience","post":"Of all the forgery theories the scorch one is the only one that bears a chance of being able to partly explain the image on the Shroud. However, to avoid the distortions in the image the underlying statue would have to be a bas relief (as has already been tested before by numerous experimenters but might be worth a revisit). I also think it would have to be a low relief as well, because any bedding down movement might show as a blurring of markings. I think that rather than using a sand bed, instead a bed of dense but compressible wool, would help transfer the depth information into an increase in pressure of the linen against the hot surface (as I dont think the sand bed would be responsive enough to achieve a linear relationship between the depth and the pressure). The scorching on the top surfaces of fibres and the ability to scorch some fibres and not neighbouring fibres might all be down to pressure difference as Colin mentioned. I’m not sure whether that level of responsiveness in possible with a scorch image to give the subtlies in the Shroud, but some experimentation might give some indication of this. I disagree with Colin that just showing the principle is enough and the rest is arts and crafts – I spent many years working in transferring theoretical results into workable technologies with sufficient fidelity ….sometimes its not possible. But I agree with Colin that I wouldnt be too confident about the UV fluorence results if you are not comparing like with like pyrolysis results (ie image and 1500’s fire pyrolysis results as they were created under different circumstance). I’d like to see the proper report on this as it seems like an important result to establish. However I still think the bas relief method would struggle to explain the faint image on the other side of the head given that the fibres in between dont appear to affected. Also the blood patterns apparently being created before the image (how sure are we of this?) I’d like to see a comparison of the intricate blood and whip marks, to see if these correlate exactly as they are precise enough as markers – I saw somewhere some very faint images (only visible after image processing) of the leather parallel strip marks that lead towards the actual whip wounds – that was very impressive to me. There are a number of other physical results I’ve come across whilst researching in only the last month that I found to be perplexing if you work on the hypothesis that its a fake, and thats not to mention some of the historical documents. So I cant dismiss the Shroud as easily as Colin does..","date":"2012-02-12","mins":"8:14 pm","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","title":"Quote for today on why the shroud image is not a scorch"},{"id":"comment-8197","author":"artscience","post":"Hi Colin, glad you felt that way about the comment and wish you success on your new blog. I’d contribute if I felt you were going to be fair in admitting positive aspects to the pro Shroud evidence where fitting, as well pointing out what the science seems to be saying, but I haven’t been encouraged so far by your sense of fairness nor actually your level of science (yes it was me who commented on your original blog about not being impressed by your claims of 3d from what looked like 2 level grey scale image, nor the claims of cellulose being a good conductor, when a moments thought about why one is able to hold a burning match, would say otherwise… A startling omission from a biochemist … Makes one thinking about excommunication from the world of science for such ;) Joking of course! However if you were willing to put up with my thoughts and recommendations and my fuming against rabid sceptics like yourself (as opposed to enlightening refreshing scepticism) and a healthy amount of good natured humorous snipes, I’d be willing to join in and id like to see where the science leads and perhaps re examine the uv data and also try and get a decent scorch print. Perhaps we might even get round to discuss the merits of Dutch group Focus!.","date":"2012-02-13","mins":"11:11 am","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","title":"Quote for today on why the shroud image is not a scorch"},{"id":"comment-8130","author":"artscience","post":"” I’m afraid your attempts to switch the focus from cellulose to water do not stand up…” Well perhaps you are right, but not according to Wikipedia http://en.wikipedia.org/wiki/List of thermal conductivities and a couple other references I checked! In fact water has 10 times the thermal conductivity of paper Water – 0.56 W per m per deg K Paper – 0.05 W per m per deg K The table seems to show that paper has one of the lowest thermal conductivities of the solids listed. On the face of it, it seems to be saying the exact opposite of what you are saying about cellulose….Care to comment on that disparity? But I suppose the really important question regarding your scorch theory ….the big gorilla in the room, is the lack of UV response in the image area as Barrie Schorwtz kindly points out. In science, it is important to try to not necessarily jump to conclusions….I dont know whether your scorch theory is correct or not… but the best guide we have is to see how well it fits the facts, or in the case where it doesnt, give a good explanation why not ( and with backing experimental proof). So for example, to help save your theory, could you suppose show that the scorch marks reabsorbs oxygen (or is it water?) over time in such a way that the image still remains in visible light, but its UV response disappears (I doubt it but until you try, you never know for sure).","date":"2012-02-11","mins":"2:20 am","url":"https://shroudstory.com/2012/02/10/the-image-on-the-shroud-of-turin-is-not-a-scorch/","cat":"image_theory","title":"The image on the Shroud of Turin is not a scorch"},{"id":"comment-8136","author":"artscience","post":"My point was to show that the major effect in your paper bag experiment could be explained by the conductivity of water, not of cellulose (which was the point of your experiment….so it was a false conclusion you drew from your experiment). I did not say that the conductivity of water was the only thing going ….I even mentioned perhaps its was the thinnest of the barrier that allowed sufficient heat flow to stop hotspots developing. So you are putting words into my mouth. Going on to the rubber balloon experiment, the tables show that rubber to have more than 3 times the thermal conductivity of paper, so though rubber survived the heating, you can not conclude paper (without being water saturated) would as well. So I think your logic is skewed as well as your science, and I say this kindly. I left it an open case, in need of further checking. So to re iterate, you got to be careful in science to jumping to conclusions. However the figures in the table fairly demolish your argument about cellulose being a good conductor, which was your main contention. But these are diversions….I’d like to focus on the point about the lack of UV in the scorch images. BTW I am generally a sceptic myself but only really started to look at the Shroud following the Tom Chivers article in Dec. The one think that struck me is actually how good some of the Shroud research and evidence is….I’ll most probably remain a sceptic, but more out of habit after 40 years in physics, its my mindset, but I’m honest enough to admit that the Shroudies seem to have the upper hand and pretty good evidence. I’m particularly impressed by the correspondences in the Hungarian Pray Manuscript, which I note you dismissed with some remark about the need to show puffs of smoke if its a set of burnt holes – that’s ridiculous (you assume the artist believe it ignited at burial?), it made me laugh out loud, I thought to myself “Here’s a man who really knows how to shoehorn data to fit his worldview”. I do think the Shroudies have a point in saying that the sceptics avoid dealing fairly with the data, and claim too easily “Eureka, I’ve done it, I’ve shown the Shroud to be a fake” though missing much of its characteristics. Science has to be sceptical but also fair..","date":"2012-02-11","mins":"5:31 am","url":"https://shroudstory.com/2012/02/10/the-image-on-the-shroud-of-turin-is-not-a-scorch/","cat":"image_theory","title":"The image on the Shroud of Turin is not a scorch"},{"id":"comment-8138","author":"artscience","post":"Sciencebod : “The only (my italics) conclusion possible from these observations is that the Shroud image is NOT the product of scorched or heated linen.” I would just leave you with the thought that cautious scientists learn, often the hard way, to distinguish between experimental evidence that is suggestive rather than conclusive, and to avoid giving ‘most favoured’ status to findings that just happen to fit with preconceived notions…. …Errr, like claiming 99.9% certainty of it being a fake based on some very basic experimentally suggestive scorch data! I wouldnt call your experimental results conclusive at all…sorry, you really need more work on it to prove the case. Science cant be so slap dash!.","date":"2012-02-11","mins":"6:08 am","url":"https://shroudstory.com/2012/02/10/the-image-on-the-shroud-of-turin-is-not-a-scorch/","cat":"image_theory","title":"The image on the Shroud of Turin is not a scorch"},{"id":"comment-8121","author":"artscience","post":"Isnt that a case of the bag getting damp and the water being a good conductor as well? Or that it is sufficiently thin that heat can get through at a fast enough rate to stop hot spots forming….you can do the same experiment with a rubber ballon and water (though I never took it to boil point…the kids were too bored after 15s!). But, if as you claim cellulose is such a good conductor as well, wouldnt the heat then more easily get through to scorch more than 200nm? And I still cant understand how your thermal model would give the faint image on the other side of the same cloth. Perhaps elaborate that part of your theory more, so I can get a proper understanding of it as it does have many pluses in its favour, but also some minus as mentioned by Dan above. You mentioned somewhere about the lack of UV fluorescence as not problem…I wasnt clear why, perhaps expand on that as well..","date":"2012-02-10","mins":"5:19 pm","url":"https://shroudstory.com/2012/02/10/the-image-on-the-shroud-of-turin-is-not-a-scorch/","cat":"image_theory","title":"The image on the Shroud of Turin is not a scorch"},{"id":"comment-21364","author":"artscience","post":"Hugh Farey : The secondary image on the back side. Well yes and no. Fanti and Maggiolo did a lot of deconvolution of some photographs of the back side, and managed to derive a faint correspondence of the hair, moustache and nose, an even fainter correspondence of the hands area, and nothing resolvable from anywhere else. Given that the ‘normal’ image is entirely superficial, they assumed that the ‘back’ image was also entirely superficial, and consequently that the fibres between the two images did not carry the image through. They also show that the image on the back is not due to the frontal image “showing through,” as it might if it were much darker. They do not describe the back image as ‘smaller’; the correspondence of the bloodstains (which appear clearly) is accurate. They do describe it as having some slight differences from the front (specifically the nose appears more symetrical). Hi Hugh, I notice that you are that relatively rare breed of being a physicist interested in investigating the shroud (as am I but without much time to spare) and you seem to know about Fanti’s back image. I was intrigued by this back image as my favoured theory (scorching) didnt easily fit with this nor with the claim that the blood stains seem to have come first. How certain are the claims that this back image has no intermediate image in the fibre strands in between and likewise for the blood stain having no body image beneath them. Also I noticed a little while back you had some experiments questioning the validity of the fluorescence claims though I wasnt sure what the conclusions were. I’d be grateful for a summary if you have the time. Thanks.","date":"2012-12-30","mins":"2:38 pm","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"id":"comment-21377","author":"artscience","post":"Thanks for that, Hugh. You seem to be having fun with your experiments! … I have images of the Head Master of your school returning after the Christmas break to find you’ve turned his boiler house and science labs into a scene from Silence of the Lambs as you search for putrescine (is that a substance/chemical for real?) Also donkey’s years ago, I first heard of the Shroud via the Dean of my college who so happened to be Rev John Robinson, but I didnt really follow it until last Christmas and wondered why the uncertainty about it hadn’t been resolved one way or other over the intervening years. One of my interests over the years has been artistic techniques and trying to unravel how various artists created their astonishing works. So I started to look at the Shroud from that perspective whilst taking in the information that seemed to indicate an earlier than 1300 date (much of it mildly persuasive). Without carrying out experiments its hard to know for sure but it did seem to look like a mild scorch. To get the projective image it had to be either contact with a flattened plate or something like Roger’s theory (I’m not sure about Fanti’s discharge theory nor the seismic discharge theories either as neither seemed to be have appropriate directionality). My problem with Roger’s theory is 1)resolution 2)turbulence and 3)being gravity dependent it only seemed to work for the upper body image, as I can’t see how the warm gases could move downwards. Its great that you are at least experimenting with some aspects of possible image formation mechanisms. So am I to take it from your experiments that it might be possible to scorch and the fluorescence might be masked or will it always show? Thanks.","date":"2012-12-31","mins":"7:12 am","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"id":"comment-21379","author":"artscience","post":"Thanks for that reference Anoxie as I’ve only really skimmed through Roger’s theory. I’ll have to read it in detail….but by mean free path is he saying the image forming gases diffuse randomly, and the darkness of the image due to any particular path is inversely proportional to distance gone (or some such like mechanism)?.","date":"2012-12-31","mins":"8:12 am","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"id":"comment-8072","author":"artscience","post":"I think normally gold leaf is applied to a surface that is first covered with size (animal skin glue). So any fiddly details that have to done (eg illuminated lettering) is usually done by brushwork of the size glue and when dried to a suitable level of tackiness, the gold leaf is laid down and any excess not adhering to the size underneath is brushed off easily. The point being is that the size is not particularly thin, even if the gold leaf is. However one could argue that size might be diluted down very thin, so when it dries it becomes a thin layer. Which leads on to what I remember of Ray Roger’s theory that about the image layer (forgive me if my memory serves me wrong and please correct if you know better): 1)the linen material was washed in some liquid for softening (cant remember exactly the reason), and left to dry. 2)the water dries from both the front and back surfaces of the sheet, transporting the solute material (within the water solvent), to the upper most parts of the threads where evaporation is greatest, and slowly leaving the solute residing on the top creasts of the threads. This explains the thinnest of the image layer and its apparent appearance mainly on the creasts of the upper most sub fibres. Apparently this layer can be removed by scraping or adhering to tape. 3)Ray then proposed another theory regarding the image formation onto this thin layer by the Maillard reaction caused by vapour given off by a decomposing body (which apparently heats up causing some sort of convention current) within a very still air cavity. This seemed a bit more wacky to me as it didnt seem to have the necessary resolution, but then I remember from my josh stick days that whilst studying in a very still room, I was astonished to see a thin vertical line of smoke extend at least 20 cm from the burning stick before turbulence set in. Ray apparently have done some tests on a heated hand manikin and got encouraging results before he pass away. 4) the vapour also permeated through the cloth and again was able the react (less strongly), with the solute material again residing on the thread crests of the other side of the cloth (hence explaining the faint other image). 5)though I dont think this explains the bottom image ( as the convection currents work in wrong direction) unless that is all due to surface contact. Nice enough theory…worth further investigation to see if it has any more mileage.","date":"2012-02-08","mins":"6:52 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","title":"Why do we think the Resurrection was a process? What if it was not?"}]
