[{"id":"comment-172580","author":"artscience","post":"“small step to infer” ….not so sure as you….but certainly worth chasing up the idea. I don’t know about Veil of Veronica (is this same as The Manoppello Image?), but are you saying that the Shroud was someone trying to do one better i.e. Full body image and trying to look like a sweat imprint. Maybe. But then why all the crazy detail invisible to the eye and only appearing on image enhancement? I wish we had a list of all the definitely know facts about the shroud (e.g. 3d info, are there whip marks invisible to eye yet appear on image enhancement, the blood serum images real) as oppose to wishful thinking facts (e.g. Coin details over the eye that no one else can see). Sorry Colin, though I admire your attempts to get further with this (and I don’t discourage you from pursuing it), at moment the fake sweat imprint theory is still just a good guess. Do you know if it was early on described as a sweat imprint if that was what the creators of this image had in mind? Earliest mention seems to say it was a painting (though perhaps thats was just a generic term for image on canvas).","date":"2014-11-22","mins":"4:16 pm","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","title":"Second Annual Bertrand Russell Award in Sindonology"},{"id":"comment-172669","author":"artscience","post":"Hi Charles, though Colin’s scorch using a low relief does have the advantage of encoding 3d data into the image. I can’t see how your flaked painting theory can produce this at all unfortunately. As I mentioned previously, going with your shadow theory, there might be a mechanism by which dark pigments produced greater of a shadow than light pigments and so giving a negative image on the linen (which is different to the Zittau Veil – that being a faded positive image from what I can make out) but I can’t see a mechanism to encode 3d information..","date":"2014-11-23","mins":"8:27 am","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","title":"Second Annual Bertrand Russell Award in Sindonology"},{"id":"comment-172637","author":"artscience","post":"“there’s scarcely any written record regarding the TS in the mid 14th century, apart from the irate letters from the local bishop asserting it was “cunningly painted” and a forgery” I suppose that was my point is that it is first described as a painting say around mid 1300s not as a sweat print as you say the creators intended. Then 250 years later its described as having sweat and blood (not necessarily as you say being formed of sweat and blood), but I can accept that it does look like sweat and blood. Are you saying that the phrase “cunningly painted” hints that it is not an ordinary painting involving pigments? Maybe.","date":"2014-11-23","mins":"4:24 am","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","title":"Second Annual Bertrand Russell Award in Sindonology"},{"id":"comment-172559","author":"artscience","post":"Hi Colin, yes I sort of gave up around that time over 2 years ago though occasionally drop in to see what new developments were happening. I think it was soon after the Italian scientist did the coin scorch demo and said how difficult it would be to get it uniform, I could see that having a roller contact at a constant speed running up the length of the shroud would enable a sort of uniformity of imprint (note however that the contact pressure varies according to the contact size and smaller areas like head and feet, ankle might then produce a darker image….I know the head is darker but not sure of the others). I couldn’t figure out how all the other details appeared on shroud and being busy normally didn’t give me time to write up properly. Colin, do you know of any brass rubbing plates that have say the subtlety of modelling for the person of say a coin? Most seem to be binary (raised or depressed levels), and linear (i.e. Clearly outlining figure and anatomical details)….these would not be appropriate for giving the subtlety of the shroud..","date":"2014-11-22","mins":"1:27 pm","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","title":"Second Annual Bertrand Russell Award in Sindonology"},{"id":"comment-172574","author":"artscience","post":"Hi Colin, I can’t remember exactly the instance but yes sorry if I came across as defending pseudo science (which I don’t, though I distinctly remember that you did have an awful way of rubbing people up the wrong way unnecessarily, so perhaps I was pissed off enough as to contradict you …hehe! ) ….but additionally I did feel at the time that the shroud needed more than a dismissive “its just a painting/scorch” which seemed to me to be sloppy science. Follow up data is necessary. You have shown through your persistence that you like myself are not willing to settle at that explanation without some sort of physical/chemical mechanism backing that claim. The scorch imprint theory initially had some problems but I think I have some solutions to them. I’m not sure if my ideas are right but they might explain some of the markings on the shroud. Testing is important of course..","date":"2014-11-22","mins":"3:22 pm","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","title":"Second Annual Bertrand Russell Award in Sindonology"},{"id":"comment-172561","author":"artscience","post":"BTW why did you thing I was Dutch? I grew up in South America but educated at same college as the guy in this award named after and it also appear Charles Freeman also..","date":"2014-11-22","mins":"1:38 pm","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","title":"Second Annual Bertrand Russell Award in Sindonology"},{"id":"comment-172575","author":"artscience","post":"Concerning Bertrand Russell….I’d think he’d be aghast to know that his helpful insights into the Kennedy Assassination has given birth to a worldwide industry of obfuscation and conspiracy theories. There’s a fictional short story by writer Will Self called The Quantity Theory of Insanity, that makes a claim that there’s only some much rationality in the world and if you try and become more rational in one place, elsewhere there is a plague of irrationality. Its fiction but I sometimes think there’s a nugget of truth in it. Industrialized, rational countries seem to be plagued by conspiracy theories, mental problems, ufo sightings (I had one on a beach in Brazil but it turned out to be an controlled explosion in the upper atmosphere). I haven’t really followed Colin’s latest of many theories but there is a nice playfulness about them that keeps me amused and perhaps coming in from a different perspective you get a new insight….I don’t believe them but then I also don’t believe in Newton’s biblical ramblings but he was highly rational in a couple other fields..","date":"2014-11-22","mins":"3:25 pm","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","title":"Second Annual Bertrand Russell Award in Sindonology"},{"id":"comment-174909","author":"artscience","post":"Hi Charles, interesting about the section widths of Veil and Shroud corresponding to medieval loom. At a quick glance you might be taken in by the sepia tints to think its similar to the shroud, but one immediate difference is the shroud is negative (normally light tones are shown dark, and vice versa). The veil just looks like typical first layer of “blocking in” areas in thinned tones (normally umber but I’ll take your word for it red madder) as the first stage There’s an unfinished Leonardo, the Adoration of the Magi, that shows some of this blocking in but at a more developed stage. If you look at the less developed figures you see this tonal blocking. Normally the blocking in is done in relatively flat tones within a well define outline, with very little modelling and thats what I seem to see on the Veil Is there a close up of the Veil anywhere to see if you can see the gesso itself as distinct from the linen? From the close ups I’ve seen of the shroud there doesn’t appear to be any such gesso on the fabric, the image making darkening is directly onto the outer facing surface of the fibrils themselves. The other aspect that is different is that the veil image is linear – i.e. There is a distinct outline whereas the shroud shows no such outline whatsoever http://www.sachsen tourismus.de/en/service/points of interest/poi/poi/kulturhistorisches museum franziskanerkloster small zittau lenten veil zittau/ In fact this one aspect of the shroud makes it distinctly different from all medieval painting that I know of and I’m surprised more hasn’t been made of this point in the shroud literature. Most painting techniques until the modern age, starts with the line, defining an outline, which is then filled in, first with thin layers and increasing fatter layers of paint. The shroud image shows very little evidence of a linear boundary between forms e.g. Between the body and the background, or even the fingers where they should be most evident. Instead the shroud has a blurred boundary between forms indicating that it is not created by a conventional medieval painting technique..","date":"2014-12-06","mins":"8:02 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"}]
