[{"id":"comment-8587","author":"artscience","post":"Well I did give my rival steam hypothesis, assuming scorching was the only game in town (which it might not be), but it was as much rubbish as yours. Anyway go ahead and test then, its just that I fail to see how a very faint image is expected to re radiate giving infra red strong enough 1)to go through the intervening reflective threads and heat up the sand on the other side strong enough to pyrolyse an image there 2)whilst standing out from the already over strong infra red already coming off from the bas relief. I think you know this is also pie in the sky….","date":"2012-02-21","mins":"12:33 pm","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","title":"Image by scorching heat? Or science by hot air?"},{"id":"comment-8590","author":"artscience","post":"I’m sure heat and ir are gonna get through! That’s not the problem, but will it get through whilst not pyrolysing the intervening fibrils, in sufficient amount to heat up the sand, in such a way as to distiguish that bit of sand from the rest of the sand which is already being bombarded by ir straight from the metal! I don’t think I’m getting through to you, am I?.","date":"2012-02-21","mins":"1:03 pm","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","title":"Image by scorching heat? Or science by hot air?"},{"id":"comment-8589","author":"artscience","post":"And what the heck is secondary thermal effects and how does this explain the colouring in furrows, striations, and continuation of pattern across to separate threads?.","date":"2012-02-21","mins":"12:50 pm","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","title":"Image by scorching heat? Or science by hot air?"},{"id":"comment-8616","author":"artscience","post":"Colinsberry : I do think you have to (attempt to) refute the idea of scorching by direct contact at a more general level, if you don’t mind my saying, and not try to conjure up killer arguments that depend on speculation about the incidental details. I think you misunderstand me, Colin. I actually think the theory has potential and so like any good scientist I want to become my own worse critic and find any possible flaws…I want to be able to see problems and have answers to them, or if need be readjust my views (which are always a bit in flux until I really feel as though I’ve nailed it). This approach has made me re adjust a couple of times….most notably with the Hungarian Pray Manuscript which I cant see really how any honest scientist cant be at least willing to put a question mark over the C14 dates. A straight out question to you, Colin….arent you just a teeny weeny bit disconcerted by the Hungarian Pray Manuscript? An itsy witsy bit maybe? I think we’re alone here, you can just whisper your answer in my ear ;) BTW even if the Manuscript were taken on face value, it could all be done with a bas relief still (just added that in to allow some face saving!).","date":"2012-02-21","mins":"7:06 pm","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","title":"Image by scorching heat? Or science by hot air?"},{"id":"comment-8629","author":"artscience","post":"Colinsberry : And if he had been so keen to incorporate details from the Shroud for the sake of authenticty, why did he not show the nail hole in the wrist, the blood trails on the forearms, the pierced side etc etc. ….and here’s a little clue for you, Colin…an illustration is not a photograph. We already know in the gospels that Jesus had been nailed and then pierced with a lance….and its not shown on the body illustrated…does that imply its not Jesus being illustrated. Nope, it means that artists dont put in everything, especially when somethings are a given as understood….making it all the more striking why include the details like the poker holes and the blood on the shroud and herringbone pattern, plus illustrate a Jesus naked and with crossed hands with missing thumbs (never before seen in christian illustration). Sorry Colin, you give all signs of being from the raving bonkers school of scepticism, which refuses to admit anything at all to the other side (btw arent you glad I established that cellulose has a low conductivity inspite you resisting like I was extracting teeth from you without anaesthetic…cellulose having a low conductivity might help explain why there is only surface scorching that doesnt penetrate into cellulose).","date":"2012-02-22","mins":"5:17 am","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","title":"Image by scorching heat? Or science by hot air?"},{"id":"comment-8571","author":"artscience","post":"I’m at work at moment so dont have time to address this properly, but I found Fanti’s paper that I think Colin got the information about the nature of the image and the hemicellulose. Http://www.ligklaedet.dk/images/SUPERFICIALITY%20published%20 JIST.pdf In the paper Fanti et al goes out of his way show (in Figure 7), that the image have many characteristics that dont seem to tally with the contact theory. In particular coloured fibrils going into furrows (not just being on the crests of the threads as was implied). Other peculiar aspects like abrupt striations (interruptions of the colouring) on many parallel fibrils, and the continuation of a colouring pattern across separate parallel threads (with a gap between), make the fuse wire theory struggle a bit there. I think the biggest problem is the double image on the other side, which Colin made two very lame attempts to explain, but to my mind are totally inadequate for the job. Fanti also dismisses another explanation that perhaps the image wraps around along the fibrils to the other side. Personally I’m still keen on the theory as it has the possibility of accounting for some but not all of the characteristics. However unlike Colin, I am not willing to ignore data that doesnt fit in with the theory (that it is what I also call being in denial!), and I dont think its enough to say its done and dusted until experimental proof is furnished..","date":"2012-02-21","mins":"6:27 am","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","title":"Image by scorching heat? Or science by hot air?"},{"id":"comment-8578","author":"artscience","post":"Colin, I think again you are doing your normal rant and not addressing the problems with the theory. Again try the second image on the back…is that a secondary thermal effect as well? Explain..","date":"2012-02-21","mins":"8:58 am","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","title":"Image by scorching heat? Or science by hot air?"}]
