[{"id":"comment-7198","author":"artscience","post":"I’m a bit confused as to Martin Kemp’s (and others) attribution of the style to Byzantine or Medieval, as I cant think of a single example of a painting in either style that do not have strong linear outlines (unlike the Shroud appears to have no such outline anywhere I can detect). Perhaps Martin Kemp’s attribution of the style is due to the thin limbs etc. But surely that is more an artifact of there being no outline, so it being hard to determine how fat are the limbs..","date":"2012-01-19","mins":"5:54 pm","url":"https://shroudstory.com/2012/01/18/new-book-christ-to-coke/","cat":"books","title":"New Book: Christ to Coke"},{"id":"comment-7263","author":"artscience","post":"Max, Well I’m not completely won over by conspiracies of thought brought about by being in one institution or another but being a graduate of the other institution, I’m willing to believe anything of Oxford Uni (joking!). But seriously, having a physics background, I tend to believe the C14 normally correctly dates a sample … but I’m stumped as to why the various labs arent scratching their heads when the Hungarian Pray Manuscript (1195) tells them that something must have gone wrong in that date ie that perhaps they have correctly dated an unrepresentative bit of cloth, either that or the Pray Manuscript is incorrectly dated. The Pray Manuscript also blows a hole in the story quoted by Martin Kemp about Henri de Poitiers attesting (<1389) to having met the artist who created the shroud as the artist would have to be close to two hundred years old to still be alive. A proper scientist or art historian would try to sort out this extreme contradiction, and not just stick their head in the sand. But what I find disappointing about Martin Kemp's remarks (bearing in mind that Martin Kemp wrote excellent books about optics and art techniques and collaborated with David Hockney with investigating the possible and speculative use of the camera obscura in shaping art history) dismissing the object as being of painterly origins \"however it was made\". For an art historian, who has specialized in trying to work out how various paintings were created, to add those last dismissive words to an object that defies proper explanation by even the most ardent skeptics is a bit lame. Maybe that wasnt necessarily his intent ie to dismiss it, but perhaps he should have at least noted that of all the pictorial objects of virtually any era, it is the most baffling (and I say that without necessarily going along with the religious element). The Shroud of Turin stands out of the normal cannon of representational art, there is simply nothing that comes remotely close …and that should set art historians alive with excitement and not to just give the party line that it must be of painterly origin..","date":"2012-01-20","mins":"7:51 pm","url":"https://shroudstory.com/2012/01/18/new-book-christ-to-coke/","cat":"books","title":"New Book: Christ to Coke"},{"id":"comment-7392","author":"artscience","post":"Well, Max, thinking about it, you do have a point…if I were associated with a particular university and I heard that our guys down the road in such and such department proved this or that, I’d tend to give it more weight than otherwise, particularly if its a reputable university. We also know that most institutions, even reputable institutions can be hard to change their minds or even open their minds to the possibility that they might have gone wrong somewhere….way too embarrassing. To me it seems clear that earlier references to the Shroud, particularly the illustration in the Prayer Manuscript, shows Oxford, Arizona, and Zurich are right to attribute the date band to the samples they were given but wrong in attributing the date band that they did to the entire shroud, unless those dastardly cunning medieval minds also invented a time machine as well. As a physicist, I’d say the problem lies in finding a mechanism that would explain the discrepancy. That is really hard to do without further testing, so Turin would have to be more flexible there to resolve this..","date":"2012-01-22","mins":"6:22 pm","url":"https://shroudstory.com/2012/01/18/new-book-christ-to-coke/","cat":"books","title":"New Book: Christ to Coke"}]
