[{"id":"comment-209833","author":"jim_carney","post":"I’m late to this discussion but I would like to address Jesus’ comment that the “kingdom of God is within you.” I’m quite sure this does not mean that we are all a little bit of God. That desire to be God is the original sin of mankind and it keeps cropping up in various ways. Some of my friends like the notion of being part of God because it eliminates any fear of permanent separation from God; i.e., hell. Jesus’ teachings on this subject are quite clear: sin separates us from God and serious sin includes the risk of permanent separation in the afterlife. Hindu and other Eastern religions do not inform our Christian truths although their effects on human behavior are worth studying and perhaps emulating in some aspects. In considering the meaning of Christ’s various pronouncements it is important to remember that he was speaking on two levels: one, to his Jewish contemporaries who all expected the Messiah to establish a new kingdom and political entity on earth in cooperation with the Jews, his “chosen people.” Noting that “the kingdom of God is within you” was telling them that he was not here to establish an external kingdom to expel the Romans and make Israel the dominant nation of earth. This message was slow to take root among the apostles who seemed to be in a state of constant befuddlement as to who Jesus was and what his teachings were all about despite their enthusiasm for his miracles. They were still asking about Israel’s return to power when Jesus ascended to heaven following his crucifixion and resurrection! Jesus’ words, of course, have a second level of meaning intended for all of us down through the ages. In this context, the “kingdom of God is within you” refers both to our spiritual natures (souls) and the fact that our relationship with Him is primarily internal; i.e., it is the quality of our “hearts” rather than the keenness of our minds or the prowess of our bodies that determines whether we are in harmony with God and, therefore, happy. This is not to say that external actions and events do not matter because those are the manifestation of what is in human hearts as well as opportunities to put our good hearts to work in furthering the love of God for humanity. Louis calls the quotation “complex.” I would not use that word since I think the concept is not complex. However, there are folds of meaning in the context of both world and heaven that bear a great deal of analysis and discussion so perhaps our difference is mostly semantic..","date":"2015-09-07","mins":"1:12 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-212311","author":"jim_carney","post":"I agree with Dan that Frederick Zugibe makes a very convincing case for the body washing and subsequent oozing of blood. Further, Jones has an obvious bias in his assertions as he tries to dismiss Zugibe by calling his arguments “inconsistent and unconvincing”–a standard ploy for anyone confronted with evidence that contradicts their position–while asserting his own foregone conclusions (“surely they would have been”) unsupported by any analytical evidence. We know from the New Testament that the burial “team” was under a lot of time pressure to get Jesus into the tomb before the sabbath began. It is entirely plausible that the washing was hasty, superficial and incomplete. As for dirt on Jesus’ face, this is the first time I have heard of that. Dirt on the bottoms of the feet, okay. Makes sense. But what authoritative source identifies dirt on his face? It is certainly not noticeable in any of the Shroud photographs..","date":"2015-10-11","mins":"3:55 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"}]
