[{"id":"comment-208321","author":"jim_carney","post":"Honestly, isn’t this a new competitor for the “Most Absurd Theory about the Shroud of Turin Ever,” not to mention Christianity in general? It’s just jaw dropping in its nonsense. To start with, a lightning bolt could not produce the image on the Shroud, much less dissolve a human body. Beyond that, what kind of morons would the apostles and early Christians have to have been to see this inexplicable event (hypothesizing for the moment that it could have happened), then conflate two separate lives, make up a series of miraculous deeds that Jesus performed, abandon their previous livelihoods and spread a story that no one would believe (because no one would have heard word one about miracles that didn’t take place) in order to get themselves martyred in brutal deaths for a heavenly reward by a figure they had just made up? There’s an old expression about believing ridiculous assertions: “If you believe that, I’d like to talk to you about buying the Brooklyn Bridge.” Anyone who would give this ludicrous lightning proposal even a shred of credibility should put their money in trust immediately because those bridge proposals cannot be far behind..","date":"2015-08-15","mins":"12:01 pm","url":"https://shroudstory.com/2015/08/14/lightening-striking-the-other-crucified-person-in-his-shroud/","cat":"image_theory","title":"Lightening Striking the Other Crucified Person in His Shroud"},{"id":"comment-199553","author":"jim_carney","post":"Personally, I find discussions about how the image could have been formed if it really does date to the time of Christ to be almost pointless. If the shroud wrapped a crucified man at the time of Jesus, it is astronomically certain to have been Jesus himself. And if so, then it means that God arranged for this photographic miracle to document Jesus’ resurrection. If God did it, then he can do whatever he wants, including suspending the ordinary laws of nature. In this sense, the Shroud of Turin is like the Tilma of Guadaloupe, a 500 year old image of the Blessed Virgin Mary on a flimsy cactus fiber cloak that should have disintegrated centuries ago. No one has been able to explain how that image was formed either, or what sustains the material upon which it appears. On the other hand, if the shroud is a medieval forgery, then it is incumbent upon those asserting such a position to demonstrate how this image with all its biological fluids was created at a time when photography was unknown, much less the properties of a photographic negative. So far, no one has come close to accomplishing this task so the vast majority of these Shroud of Turin comments, claims and observations just form a closed loop of irrelevance. No offense, Dan. I like your blog and intend to keep following it..","date":"2015-05-19","mins":"3:08 pm","url":"https://shroudstory.com/2015/05/19/guest-posting-the-shroud-of-turin-an-x-ray/","cat":"uncategorized","title":"Guest Posting:  The Shroud of Turin – An X-Ray?"}]
