[{"id":"comment-204198","author":"jim_carney","post":"I very much appreciated Bishop Curry’s exposition on the Eucharist. And while I am a lifelong and devout Catholic, I also understand that God is not the Catholic Church and the Catholic Church is not God. It wasn’t so long ago that Catholic education included not so veiled warnings that only Catholics could go to heaven. And there was a very strict list of “mortal” sins the commission of a single one of which would condemn one to a fiery eternity of suffering and remorse unless first confessed to a priest. So, now let’s think about this a bit. Who among us would torture someone with fire for even a little while for missing Mass, or masturbating, petty lying or cheating, or just having lust in our hearts? Yet we used to blithely teach that God would do just that. And who among us would condemn to hell a kindly and loving ex Catholic, even one who remarried, much less a homosexual person? Yet many so called “good Catholics” have said that God will do exactly that. No wonder poor George Carlin could not remain in the faith. The sad thing about these views is that it makes God much inferior to us in the loving department because as bad as we all are, no civilized person would condemn these individuals to cruel punishments of fire and torture. These are not the things that constitute evil. Evil comes from hate and anger, destructive impulses, greed and selfishness. God’s love for us is infinite and eternal and so vastly beyond our comprehension that we can only humbly say “thank you” and try to love Him and our fellow human beings better as we live out our lives. I feel sorry for so called “good Catholics” who drag out their rule books and solemn papal pronouncements and think that those in any way offer reliable judgments about God’s ways or those who try to do his will. So distorted did this approach to Christianity become that it wasn’t too long ago that dissenters were burned alive in the belief that this would meet with God’s approval. What a strange and horrible god that would be–more likely to be the one down yonder than the Creator and Redeemer. And if anyone chooses to take issue with this by quoting Christ’s warnings in the New Testament, there are ways to properly interpret those comments without turning God into a sadistic and vindictive tyrant. This is not the forum for that discussion. But suffice it to say that we will all be judged by whether we loved. Those who die with an unloving heart will not be able to be in the presence of Love Eternal. From that separation come all the agonies of hell. It is worth reviewing the NDE literature to get a far more accurate view of the nature of God and the afterlife. Just don’t get carried away with it. It is very reliable for helping us to understand that God loves all of us–and probably has no objection whatsoever to female priests–and welcomes all those with good hearts into His eternal kingdom regardless of their religious affiliation or even if they have any religious belief at all. The near death reports don’t tell us much, however, about our placement in that kingdom or whether there may be a process of “re education” needed based upon our failure to adequately serve God and love in this life. As for Tipler, consider this quote from Dan’s summation above: “It is with mankind’s technology that immortality will be achieved.” Now if I am certain about anything, it is that mankind will never achieve immortality on its own. It is a free gift from God made available to us through the redemption of Jesus. Good grief. Mankind has hardly done a good job with our one planet and its resources. If left to this species to save the universe, well, might as well plan to move to another one if the opportunity presents itself. As for the whole notion of multiverses themselves, I don’t know why this is deemed such a far out notion. We already know there are multiple dimensions in the universe–Jesus and his mother, Mary, have moved in and out of them on several occasions in history. How many are there? No one knows, of course, but it would make sense that there may be multiple dimensions for persons of different levels of holiness for those would logically determine proximity to God. And cosmology’s “string theory” with its core conclusion that everything in existence consists of vibrating energy, not to mention the strange relationships of quantum mechanics, seems to draw science and faith closer together than ever..","date":"2015-06-30","mins":"7:06 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"id":"comment-204257","author":"jim_carney","post":"Yes, thanks, daveb, for the reference to Michio Kaku. I have not read that work but will now..","date":"2015-07-01","mins":"12:48 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"id":"comment-204392","author":"jim_carney","post":"Nabber and other “non cafeteria Catholics”: There have been only two ex cathedra pronouncements in the 2,000 year history of the Church: Mary’s Immaculate Conception in 1854 and Mary’s Assumption into Heaven in 1950. Speaking emphatically and dogmatically does not convert a papal pronouncement into an ex cathedra pronouncement. The Church, in order words, commonly leaves room for dissent and modifications no matter how much it discourages it. Pope John Paul II stressed the overriding importance of conscience and the fact that every individual is free to follow his informed conscience in matters of faith and morals. Of course, one’s conscience may take one out of a particular religion’s category if there is rejection of key elements of that faith. The key elements of being a Catholic are listed in the Nicene Creed. I fully subscribe to all of those. I remain a Catholic in spite of many wrong headed pronouncements by the hierarchy because there I find Christ in the sacraments, especially the Eucharist, in the Word of God, and the communion of the faithful. I reject the notion that “membership” has anything whatsoever to do with salvation. Membership in the Catholic Church as well as other Christian denominations provides great advantages in pursuing a life that will result in salvation because we hear the teachings of Jesus and learn how we are to form our lives in conformance with those. But no one who shows up at the gates of heaven is going to be admitted solely upon showing their Catholic ID card. And many noncatholics are going to be (and have been and are now) joyfully admitted because they are loving human beings who desire to be in the presence of God. Almost every Catholic I know who is strict about following all the rules and quick to condemn “cafeteria Catholics” is judgmental and self righteous–usually accompanied, however, by a good measure of fear. Their path to God is filled with trepidation and warnings of how easy it is to go to hell and how difficult to get to heaven. What love they have for Christ and their fellow human beings is well hidden in their condemnations and angst. There is probably no other command expressed more frequently in the New Testament by Jesus than to not judge others. We cannot do it correctly and it is an offense to God to even try because judging souls is His job. My advice is to learn to see the forest for the trees. Jesus taught us that there are two great commandments which contain all the rest: love God with all our hearts, minds, souls and strength and our neighbor as ourselves. And the Apostle John reminded us that loving God means loving our neighbor. This is the way to heaven and it not only points to eternal joy with God but it also lights our paths here on earth with happiness and grace. Another guiding principle is to always remember that God is far more loving than you. If you can see the good in other people who do not share your religious faith (which you are required to do, by the way, by your Catholic faith as well), certainly God can see it far more clearly. If other people seem to revel in the presence of a good person who radiates caring and concern, you can be certain that God wants that person around also. As I mentioned before, the NDE literature gives us a very good picture of the nature of God. It is quite reassuring as I know that Jesus meant us to feel joyful and happy about his “Good News.” This, in fact, may be why we are hearing so much about near death experiences now–God is tired of the bad rap he’s been getting from people quite willing to speak for Him when they assert the likely eternal condemnation of those who do not share their particular religious beliefs. In short, stop worrying so much about being a good Catholic and concern yourself with being a good Christian. You’ll find they blend nicely when you do that and, suddenly, it won’t be so hard to recognize that gays and women are loving human beings, too, with all the capabilities and spiritual beauty of heterosexual men–including as religious leaders..","date":"2015-07-02","mins":"5:12 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"id":"comment-204525","author":"jim_carney","post":"Nabber’s link to the 10 facts Catholics should know because they define what it means to be Catholic took me right back to my pre Vatican II days. It’s no wonder that Church membership has declined so severely in the Western world and why so many young people are staying away. These authoritarian claims with their not so veiled threats of eternal damnation if one dares to question or deviate are far from inspiring. They induce little but fear and trepidation and suffocate the joy and inspiration that we should be finding in the teachings of Jesus and the revelation of God as our eternal Father who loves us beyond measure. Nabber’s request to be spared the “peace and love” between so called cafeteria Catholics and the rest says it all. If God and Jesus are not all about love and peace, then we’re all pretty much doomed. And, frankly, heaven is not all that appealing if it means being surrounded by people proclaiming their rules and comparing their sufferings and “tsk tsking” over the vast numbers of people who failed to fall into line during their lives on earth and now are roasting in the flames of hell as their just punishment. Fortunately, we have the testimony of countless near death experiencers who give us a far different picture of the afterlife with God. It’s clear from their testimony that when Jesus spoke of the two great commandments of loving God and our neighbor (fellow humans) he meant that to define the proper way to live. When he speaks in Matthew 25 about the Last Judgment’s review of how we treated the least of his people as the standard for life with God, or gives us the example of the Good Samaritan, a person whom the Jews (God’s chosen people by His own word) regarded as an offense to God because of the Samaritans’ failure to practice their religion as the Jews did, or tells us the parable of the Prodigal Son and his joyful reception by his father after years of dissolute living, we get a true picture of what God values. Nothing in the life of Jesus as we find it in the New Testament suggests that the love of God and the invitation to be with Him in heaven is limited to Catholics, especially when to be a so called “good Catholic” has little to do with the heart and everything to do with intellectual assent and compliance. Nabber also asserts that “Individuals by themselves cannot receive the Inspired word.” It is true that public revelation ended with the death of the last apostle (John) and that private revelation since then is never binding. But this in no way means that God does not communicate directly in extraordinary ways with many souls on earth. And God has sent Mary back to earth on many occasions to give us guidance and assistance. Each of us has a direct spiritual line to heaven through prayer and divine inspiration is often the result of that. It’s not binding on anyone else but it is reliable guidance for the person receiving it. You will find God in and through your heart. By your works and attitude thereafter you will know if you got the message. It’s all about peace, love, and the invitation of God to all peoples to share His life in heaven. It may be that the staunch and intolerant Catholics will have their own special Heaven–St. Paul himself referred to the “third heaven”–but those who seek God with a good heart will find Him both here and in the afterlife and eternal joy in His presence. No claims of infallibility by very fallible human beings, no matter how united, will make the Catholic Church the equivalent of Jesus and his Father themselves. A little humility in this sphere would go a long ways. Pope Francis has inspired millions of people worldwide, both Catholic and non Catholic, precisely because he seems to be all about universal love and much less about being Catholic with all the answers and a demand to adhere to his pronouncements whether they seem loving or not. The Church hierarchy would do well to follow his guidance and offer Catholicism as a sacramental refuge in this harsh world, a place where we can find Christ directly in the Eucharist and grow his love by helping and caring for one another in every way that we can. Bishop Curry spoke very eloquently and movingly of the Eucharist. Catholic priests and bishops would do well to emulate his example. We might start getting some more people interested in becoming Catholic. Now, Dan, we are indeed way, way off topic. I have said my piece and plan to say no more..","date":"2015-07-04","mins":"3:04 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"id":"comment-204530","author":"jim_carney","post":"Okay, just one more comment. I do have to thank Nabber and Louis for provoking this discussion. It has made me realize a couple of things about myself. From now on, I will call myself a member of the Catholic Church and a devout Christian..","date":"2015-07-04","mins":"4:19 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"id":"comment-200097","author":"jim_carney","post":"So I presume these Protestant Christians also reject the miracles of Jesus described in the New Testament. That is a popular theme among revisionist Christians (who really should find a new name for themselves) who like to assert such claims as that the miracle of the loaves and fishes was just the power of Jesus’ personality inducing the crowd to share what they had intended to keep for themselves. Presumably, the resurrection itself must be suspect if it is not possible that the Shroud was miraculously left behind as photographic evidence of Jesus’ reality, suffering and resurrection. On the other hand, of course, their opinion may simply be a kind of subconscious residue of a general discrediting of religion by science so that the only thing left to support religious beliefs is our “faith.” If so, some of them may turn out to be open to a persuasive presentation on the Shroud. It would also serve them well to read Dr. Frederick Zugibe’s book, “The Crucifixion of Jesus: a Forensic Inquiry” (2005). The one amusing thing in the group’s opinion is the belief that the Shroud cannot be real despite the carbon 14 dating when the results of that testing in 1988 purported to prove that the Shroud was, in fact, not a real artifact that wrapped the body of Jesus. Obviously, this group is woefully uninformed about multiple things. Their views also lend support to those who say we should just forget about further carbon 14 dating since it would just be rejected out of hand by those who refuse to believe..","date":"2015-05-24","mins":"4:57 pm","url":"https://shroudstory.com/2015/05/24/rejecting-authenticity-out-of-hand/","cat":"news_&_views","title":"Rejecting Authenticity Out of Hand"},{"id":"comment-200188","author":"jim_carney","post":"Don’t let anyone, whether they call themselves Catholic, Protestant, or just Christian, affect your relationship with Jesus. I have been a Catholic all my life and I strongly believe in the sacraments and that they can be traced to Jesus through the apostles. But I have also known a lot of jerk priests, too. Ignore them. I do not accept the Church’s teaching on artificial birth control and believe that using that position to oppose the huge extension of health care (“Obamacare”) for millions of people in America is a travesty. Talk about the “goats and the sheep.” They should read Matthew 25 every day until they realize the few things Jesus enumerates as specific criteria for our salvation include providing health care for our “neighbor.” You are free to follow your conscience. In fact, you pretty much have to do so. The Catholic Church believes that the Sacrament of the Eucharist is the true body and blood of Jesus. So do I. Because of this, some churches and priests get carried away with trying to make sure no one receives communion who is not a registered Catholic. Personally, I don’t think Jesus is upset when a person of faith receives the Eucharist. That is the relationship you have with him and you should follow your conscience on it. Of course, if you believe in the Eucharist as Catholics do, you might want to consider becoming a Catholic. But if you are “gay,” of course, and in a homosexual relationship, the Catholic Church excludes you from membership. Well, if homosexuality is your nature and not simply a choice, that is the way you are and I know that God loves you as much or more than me. (I’m not suggesting you are gay, Sampath, since I don’t know you at all. I’m just describing one of the many ways that Christ’s alleged representatives simply do not comprehend his message of love, compassion, forgiveness and inclusion.) But, like Thomas suggests below, the New Testament has far more for us than the Shroud of Turin. The Shroud confirms what we are told there but says nothing else about the teachings of Jesus..","date":"2015-05-25","mins":"7:12 pm","url":"https://shroudstory.com/2015/05/24/rejecting-authenticity-out-of-hand/","cat":"news_&_views","title":"Rejecting Authenticity Out of Hand"},{"id":"comment-205259","author":"jim_carney","post":"Yes, Sampath, that is the doctrine but understanding and applying it are not so simple. For example, no one but God and the particular individual can say whether that individual has chosen to separate from God, which is what mortal sin means. The tidy little catalog of “mortal sins” that the Church has promulgated over the centuries has become pretty pharisaic, in my opinion. As for gays and the state of their souls, I do not believe that gays in a committed relationship are offensive to God even if they do engage in sexual activities. As Pope Francis recently said, who are we to judge? I ask two questions: (1) Where is the compassion for people who have the same desires as everyone else for a committed sexual relationship with another person but, because of a flaw in their nature, are attracted to persons of the same sex? (2) If people are genuinely homosexual by nature, why is it sinful for them to live like everyone else? We make accommodations for all kinds of disabilities and handicaps. Why not this one? I have been friends with many gay people in my lifetime. Most of them have been warm and caring human beings. I believe their lives have exemplified God’s call to love and service better than many heterosexual people I have known, even those who attend church regularly and regard themselves as upstanding Christians. Love is the measure. A lot of people are going to be very surprised in the next life to discover that people they were quick to condemn were pleasing in God’s eyes because of their loving hearts while many so called righteous souls will find out they had little love in their own hearts..","date":"2015-07-11","mins":"12:17 pm","url":"https://shroudstory.com/2015/05/24/rejecting-authenticity-out-of-hand/","cat":"news_&_views","title":"Rejecting Authenticity Out of Hand"},{"id":"comment-205260","author":"jim_carney","post":"One additional comment. If you have committed a serious sin, you may receive communion before confessing that sin if your intent is to go to confession at your earliest reasonable opportunity and confess it..","date":"2015-07-11","mins":"12:21 pm","url":"https://shroudstory.com/2015/05/24/rejecting-authenticity-out-of-hand/","cat":"news_&_views","title":"Rejecting Authenticity Out of Hand"},{"id":"comment-216654","author":"jim_carney","post":"Thanks, Dan, for running a very interesting blog. I learned some things, found other points to be off the mark, and still others to be way off. But it was also interesting and informative and I, for one, will miss it. Best of luck to you!.","date":"2015-12-16","mins":"10:53 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216820","author":"jim_carney","post":"Have a wonderful Christmas, birthday, and new year(s), Dave B. Of all the comments on this site, yours were the ones I most valued–and Louis’, too. Colin Berry’s often silly musings (my opinion), such as his recent “ransom” theory, were a good counterpoint to the ones I took seriously and a good test for a temperament that runs to the impatient. As for the Shroud’s authenticity, it seems overwhelmingly clear that it is genuine. That arguments are many and well known but a basic starting point is the fact that it is a perfect photographic negative. Hardly something that could have been created by a medieval artist when photography, much less negatives, were unknown..","date":"2015-12-18","mins":"8:15 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"}]
