[{"id":"comment-203980","author":"jim_carney","post":"Anyone who looks at Colin Berry’s flour prints and think they bear any resemblance to the actual shroud image should see an optometrist for some new glasses..","date":"2015-06-28","mins":"1:09 pm","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","title":"Extreme Blogging"},{"id":"comment-193536","author":"jim_carney","post":"I find very little in this “rebuttal” to be convincing. A few points: (1) Like any penal system, the Romans preferred deterrence over punishment. Having the stipes permanently mounted on Golgotha which was at the crossroads of two main roads converging on Jerusalem served this purpose well. This site was outside the walls of Jerusalem and out of sight of the Temple so the well known Jewish outrage at Temple sacrileges would have been substantially muted. Similarly, the route to Golgotha was chosen to maximize the public spectacle so as to add to the deterrent effect of this horrific form of execution. (2) Dragging a 100+ pound full cross would have been extremely difficult, perhaps impossible for someone as badly beaten and tortured as Jesus was. Further, it appears the size of the Roman execution detachment was four or five men, including a centurion on horseback. To ensure that a condemned prisoner did not simply dump his cross and take off through the crowds in the narrow streets suggests that the patibulum (crossbar) was laid across his back and tied to his arms. As for the marks on the shroud, it must be remembered that Simon the Cyrenean helped Jesus to carry his cross. It may be that by the time they reached Calvary Simon was carrying the whole thing. Once Simon began helping, the patibulum would have rested on only one of Jesus’ shoulders at a time. (3) If there is any “classic” authority on crucifixion to be read, it is not Barbet. His conclusions on the crucifixion itself have been largely rebutted by Dr. Frederick Zugibe in his books, “The Cross and the Shroud” (1988) and “The Crucifixion of Jesus” (2005). Specifically, the notion that the victim had to raise himself on the cross to breathe and eventually died of asphyxiation when he could no longer do that is false. I was dismayed to see eminent Shroud researcher John Jackson repeat this discredited notion in the CNN show. The simple fact is that there is no more impediment to breathing by a crucifixion victim than there is for any person standing up with his arms outstretched to the sides. Try it against a wall on your tiptoes if you want to get as close to the physical posture of a crucifixion victim as you can. Now substitute a nail for the floor and you’ve got it. The point is that with the nail you are still standing. Your skeletal structure is the same as when you stand on the floor. A lot more painful, of course! If you want to test the hypothesis even further, nail a pair of old shoes on a wall and put gate handles where your outstretched hands would be. Get someone to help you and put your feet in those shoes while holding the handles. You will discover there is no problem breathing. You will discover that there is little weight on your hands and arms. You will also discover that you really cannot raise yourself at all. Within seconds your thigh and shoulder muscles will begin cramping. The only way you can find some slight relief is to lean forward as far as you can. All of this is discussed by Zugibe who also discredit’s Barbet’s thesis for the hand nailing. (4) Finally, it is in the nature of human beings to find the easiest way to do things. The easiest way to nail a person to a cross is to assemble the cross first, then lay the victim on it, then drive the nails through hands and feet (with one or more other people holding the victim in place), then use ropes attached to each end of the patibulum to pull the cross upright while the end of the stipes is placed at the edge of the hole where it is normally kept. When it falls to the bottom of the hole, jamming it in place with 4 appropriately sized rocks will keep it there. No need for a fancy rock ring. The notion that it would have been easier to raise the patibulum with the victim attached suggests to me that the person proposing that hasn’t done a lot of manual labor in his life. Plus, nailing the feet of a squirming victim on a vertical surface would have been far more difficult than doing it while someone could lay over his legs to hold them still..","date":"2015-03-16","mins":"4:36 pm","url":"https://shroudstory.com/2015/03/14/rebuttal-of-a-long-standing-sindonological-myth/","cat":"guest_posting","title":"Rebuttal of a long-standing sindonological myth"},{"id":"comment-196228","author":"jim_carney","post":"Surely this is one of the all time stupid arguments against authenticity. If Christ’s conception was miraculous, obviously God can create him any way that he wants. We are taught that he was human like us in all ways except sin. To try to impose on God the rules of the natural world as we know them is ludicrous. He makes the rules and can bypass them as he wishes..","date":"2015-04-13","mins":"11:20 am","url":"https://shroudstory.com/2015/04/13/with-anyone-interested-in-listening/","cat":"other_blogs","title":"With Anyone Interested in Listening"},{"id":"comment-196335","author":"jim_carney","post":"Daveb, I don’t see the philosophical problem. What matters is the end result of Jesus being fully human, not the process by which that is achieved. Clearly, virgin birth, no human father contribution of DNA, and powers unknown to any other human being place Jesus outside the realm of other human beings and their natural origins. What matters is whether Jesus as incarnated by God through Mary is a human being like we are; i.e., he shares all essential human traits except the propensity for sin. For that matter, we cannot really understand what it means to be both fully human and fully God. How does that union exist and is it different for the child Jesus than for the adult Christ? But arguments that the formation of Jesus–including his blood type–must follow the norms of other human creation have neither philosophical credence nor even common sense, in my opinion..","date":"2015-04-14","mins":"1:55 pm","url":"https://shroudstory.com/2015/04/13/with-anyone-interested-in-listening/","cat":"other_blogs","title":"With Anyone Interested in Listening"},{"id":"comment-196352","author":"jim_carney","post":"Well said, daveb. Well said, indeed. To come full circle, my problem is with those who use various arguments to whittle God down to our size and then use those conclusions to reject a truth that stands in obvious contrast to the assertions; e.g., whether the Shroud of Turin can be the burial cloth of Jesus Christ without complying with all of the known rules of biology and physics. I find that particular line of inquiry pointless and usually foolish..","date":"2015-04-14","mins":"6:04 pm","url":"https://shroudstory.com/2015/04/13/with-anyone-interested-in-listening/","cat":"other_blogs","title":"With Anyone Interested in Listening"}]
