[{"id":"comment-197965","author":"jim_carney","post":"I wonder if this reverse aging took into account the fact that the face on the Shroud had been badly beaten and so can be expected to be swollen somewhat out of shape. Personally, I prefer the portrait painted by Akiane Kramarik at age 8 (!). Here’s a link to her website: http://www.akiane.com/store/ although you may have to do a little digging to find the “Prince of Peace” portrait. She claimed at the age of four to have met God and angels in heaven and later to have seen Jesus. The little boy in the book “Heaven is for Real” (also made into a movie) identified Akiane’s portrait as the one that looked the most like Jesus, whom he claimed to have seen in a near death experience. Thin reeds, perhaps, but Akiane’s talent is so prodigious that I am inclined to take her claims at face value. Personal preference, I suppose, but these Italian suggestions don’t appeal to me. In fact, I don’t think any of them look much like the Shroud image..","date":"2015-04-29","mins":"5:56 pm","url":"https://shroudstory.com/2015/04/27/computer-generated-young-jesus-from-image-on-shroud/","cat":"press_coverage","title":"Computer Generated Young Jesus From Image on Shroud"},{"id":"comment-205406","author":"jim_carney","post":"Here’s the language from the 1970 edition of the New American Bible (Catholic): “Taking the body, Joseph wrapped it in fresh linen and laid it in his own new tomb which had been hewn from a formation of rock.” Mt 27:59. “Nicodemus (the man who had first come to Jesus at night) likewise came, bringing a mixture of myrrh and aloes which weighed about a hundred pounds.” Jn 19:39 The common sense reading of these two passages says that Joseph of Arimathea brought the burial cloth and Nicodemus the spices for the deceased Jesus. There is nothing in Scripture to support a notion that a separate cloth was ever used to protect the modesty of the dead Jesus. Finally, John’s reference to the cloth covering Jesus’ face doesn’t mean that the cloth was a small, head sized one. Again, the common sense reading of the Gospels is that the long sheet used to wrap Jesus’ body (like the Shroud of Turin) was placed under and over the body then wrapped with pieces of linen cloth to hold the body intact. The spices were used to counter the odor of decomposition and were a sign of respect for the deceased. Like his argument for how medieval persons could have created the shroud by coating a man with flour and water (just wait 1000 years or more and you will see!), his reading of the plain words of the New Testament is just another tortured, convoluted bit of nonsense. As I have said before, if you can reproduce the shroud in anything like its current form and characteristics, do so. Then we’ll have something to discuss. In the meantime, I generally don’t waste my time commenting on Colin’s arguments because they strike me as absurd..","date":"2015-07-12","mins":"2:59 pm","url":"https://shroudstory.com/2015/07/12/barrie-schwortz-colin-berry-and-some-good-reporting-in-fort-wayne/","cat":"article","title":"Barrie Schwortz, Colin Berry and Some Good Reporting in Fort Wayne"},{"id":"comment-214004","author":"jim_carney","post":"Many convicted criminals go to jail on the basis of eyewitness testimony. This is considered “proved beyond a reasonable doubt” in American jurisprudence. If there is reason to doubt the testimony, responsible jurors will refuse to convict on the grounds that the case wasn’t proven beyond a reasonable doubt. In the New Testament we have the testimony of eyewitnesses to the resurrection of Jesus. These are individuals who dedicated their lives thereafter to telling this story and suffered brutal martyrdoms without recanting. In the eyes of the law, that is proof of the resurrection. It’s proof in my eyes, too. And if there are any lawyers reading this comment who wish to challenge the assertion on the basis of being hearsay evidence (testimony that is not subject to cross examination), I would remind them that “dying declaration” is an exception to the hearsay rule. As for believers for whom no proof is necessary, this is foolish. Beliefs that cannot withstand scrutiny in the context of the world in which we live, such as belief in Santa Claus or the Easter Bunny, are rightly called childish. There is nothing about Christianity, or the Shroud of Turin for that matter, that falls in the category of belief without proof..","date":"2015-10-31","mins":"11:58 am","url":"https://shroudstory.com/2015/10/31/proof-of-the-resurrection/","cat":"books","title":"Proof of the Resurrection?"},{"id":"comment-195640","author":"jim_carney","post":"Well, as a believer in the authenticity of the Shroud of Turin as the real burial cloth of Jesus, I can’t get too upset with young Mollie’s conclusions. However, when she starts off asserting her belief that Jesus never even existed, she loses all credibility. Other prominent atheists, such as Bill Mahar, have suggested the same thing. Honestly. This seems about as ignorant as one can get. Besides the extensive details in the New Testament, several other secular historians, such as the Jewish Josephus and Roman Tacitus, mention Jesus. And how dumb is it to believe that a group of Jesus’ contemporaries (apostles, disciples) made the whole story up and then went out and spread it in the face of brutal mistreatment and cruel martyrdoms. Why would any group of people do such a thing? The whole notion is idiotic. It’s one thing to argue that Jesus wasn’t God as he claimed to be (though the evidence is powerful, indeed); another to say that he didn’t even exist. How can anyone take these people seriously? As for the “earthquake” explanation for the erroneous carbon 14 dating, I don’t believe this theory has any credibility among the primary scientific community. All in all, Mollie has nothing to contribute to the Shroud discussion worth taking 5 minutes to listen to..","date":"2015-04-07","mins":"2:48 pm","url":"https://shroudstory.com/2015/04/07/this-unbelievable-claim/","cat":"video","title":"This Unbelievable Claim"}]
