[{"title":"A scientist’s eye view of how the iconic Turin Shroud image came about – a happy accident of  thermographic and photographic inversion?","post":"Overview (based on some 30 or so postings to date, and heavily influenced by the Lirey Pilgrim’s Badge, aka Cluny Medal -see my previous post):\nThe Turin Shroud is of 14th century provenance, but it is neither a hoax nor a fake. It was commissioned, by the knightly Geoffroi de Charny and his wife as a monument – but a monument with a difference. It was not a 3D monument, of marble or wrought iron, but a novel 2D monument of scorched fabric, fashioned as if a burial shroud.  Why go to all that trouble?  Answer: because it had to be a muted monument, one that could be easily rolled up and hidden away, given that anti-Templar sentiment was still rife in the Church and State in early 14th century France. Furthermore, it was cleverly conceived as a metaphor that was fitting to that era of French history, specifically to the hideous manner in which the last of the Knights Templar were slow-roasted, i.e.scorched to death in 1314, most famously Jacques de Molay and Geoffroi de Charney (Charney-with-an “e”, who some believe was the nephew of the Charny who died at the stake). Again, I believe the image on the Shroud to be a scorch, a thermal imprint from a 3D, or semi-3D bas relief, either metal or baked clay. That makes the image not just a thermograph, but a ‘tactilograph’ too, one that has captured the relief, i.e. contours of the hot template. That would explain the high degree of ‘encoded 3D information’ – but note that the latter can be demonstrated with a 2D sketch alone, as shown by Irene Corgiat with her pyrograph, and here in this posting with nothing more than a stick of charcoal.\n","date":"May 3, 2012 at 4:52 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/05/02/a-scientists-eye-view-of-how-the-iconic-turin-shroud-image-could-have-come-into-being-a-happy-accident-of-thermographic-and-photographic-inversion/","cat":"3d","id":"comment-253","author":"colinsberry","site":"colinberry"}]
