[{"title":"The VP8 Cinderella Question","post":"Dear Reader.\nI have in plans making a comprehensive presentation about 3D properties of the Shroud, how they manifest, how they should be interpreted etc. \nThis will be also some kind of review of opinions on the topic.\nI have a lot materials and substantial experience experimenting with this. What I have in shortage, is free time to make it. So please be patient.\n\n","date":"September 26, 2015 at 5:28 am","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","id":"comment-211247","author":"O.K.","site":"shroudstory"},{"title":"The VP8 Cinderella Question","post":"I enjoyed the article, it was the 2 clickables and the Q & A that made the article great. I guess I should say that I greatly enjoyed the article.  I have been a believer in the Shroud as being a Gift from God for quite some while now.\n\n","date":"September 26, 2015 at 5:48 am","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","id":"comment-211248","author":"ekmcmahon","site":"shroudstory"},{"title":"The VP8 Cinderella Question","post":"Also on the SEAM site, http://shroudnm.com/docs/1977-08-VP8ImageAnalyzerBrochure.pdf gives a good overview of the functions of the machine, although it is not a manual.\n\n","date":"September 26, 2015 at 6:21 am","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","id":"comment-211249","author":"Hugh Farey","site":"shroudstory"},{"title":"The VP8 Cinderella Question","post":"What I really recommend so far, is watching “The real face of Jesus?” over and over again. It is invaluable source of information: https://www.youtube.com/watch?v=WNJPJ4JwHeE\n\n","date":"September 26, 2015 at 7:14 am","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","id":"comment-211251","author":"O.K.","site":"shroudstory"},{"title":"The VP8 Cinderella Question","post":"Yes, The Real Face of Jesus? is one of the best documentaries made (2 hours) and focuses on the work of 3D animator Ray Downing using state of the art technology. I had dinner with him and his wife Maria a few years ago.  Ray is not yet convinced the Shroud is authentic but he is totally convinced the Shroud contains unique data that allows for an accurate 3D rendering of the image.   There is no way he should be able to extract a 3D image from a flat surface without distortion and yet that is precisely the case.\n\n","date":"September 26, 2015 at 8:05 am","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","id":"comment-211252","author":"Russ Breault","site":"shroudstory"},{"title":"The VP8 Cinderella Question","post":"There are some distortions in the Shroud -and that’s good news. They should be there, and they are designed in a perfect way- very unlikely the accidental reason. I will show it in my presentation-paper, on which I am currently working.\n\n","date":"September 26, 2015 at 8:17 am","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","id":"comment-211254","author":"O.K.","site":"shroudstory"},{"title":"The VP8 Cinderella Question","post":"” The real face of Jesus” – 87 complacent minutes long, including less than 3 minutes dedicated to the Carbon 14 dating , with 2 of these 3 minutes consisting of “theories that challenge these findings”, not a single skeptic interviewed, there is no indication in the “documentary” (or should we say marketing communication ?)that Ray is in fact not totally convinced that the shroud is authentic.\n\n","date":"September 26, 2015 at 8:36 am","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","id":"comment-211257","author":"PHPL","site":"shroudstory"},{"title":"The VP8 Cinderella Question","post":"I wouldn’t go as far as PHPL, but there is very little in the film about what actually Ray Downing and his team did, and some that is contradictory. From about 32:44 we are introduced to the problem that the ribs of the weave, which mostly carry the image, present a highly corrugated surface when converted to a 3D image, and have to be removed by FFT, which searches for regular patterns and evens them out. The programme drifts off into history for a while, but the section concludes with more 2D/3D computer wizardry, using, guess what, the original image with all the weave marks left in. In the next section (45:59), there it is again, covering a 3D image. Was the FFT not a good idea after all? The weave reappears here and there throughout the rest of the programme.\nAt 46:33, John Jackson describes how “on the top part of the body the cloth meanders over the body in some fashion” following the contours of the body. This is accompanied by an image of what looks like a layer of pastry over a fruit pie, without a single crease or wrinkle, just bumps over the protuberances beneath. This is not how a cloth performs, as we see later on. This is followed (from about 65:50) with a couple of ingenious experiments to show how intensity/distance relationships could be translated into 3D images, firstly assuming that Shroud was horizontal, and secondly assuming that it followed the contours of the body. The horizontal version wins hands down. With a horizontal Shroud “the result looks like a normal human face”, but the with the draped Shroud, “The face is distorted and flat, sunken in the middle and without a nose.” Oddly, the conclusion drawn from this is exactly the opposite of what has just been demonstrated. “Jackson has shown that the contours of the cloth are the source of Downing’s problem.” No, he hasn’t; he has shown that assuming the cloth to be horizontal gives the best 3D representation.\nNevertheless, the next section begins assuming that the draped Shroud works best, and reproduces the previous experiment using a sheet. Actually it is obvious that they are using something more like a ball than a human head, as the nose clearly does not stand proud of the cheeks, not are the eyes sunken in (see 49:45). This time, although, the results are completely different. Although they do not notice that big folds and creases in the cloth lift large sections away from the body, now all the hideous distortions observed the last time they tried it have disappeared, and “the figure looks more human”. Nor do they explain how they achieved the computerised figure from a cloth draped over a body. How were the body/cloth distances computed, and why is there no “mask of Agamemnon” effect, so that the hair strands down the sides of the face are not absurdly far apart? I’m afraid that I do not believe that this new image had anything to do with body/cloth distances. I suspect the Shroud face was simply ‘draped’ by computer, vertically downwards on to a pre-existing digital head, and gently tweaked to get it to fit. That this is more likely is shown by the graphic at 50:05, where the contours of the 3D image rise vertically from the 2D image; they do not open out or unwrap.\nBy 1:06:55, we abandon any pretence of objectivity. “For the computer graphics team, the search for the Shroud’s hidden face has been purely scientific’, but science can only lead them this far. To finish the face in the Shroud requires the skill of an artist.” At 1:08:00 we see the 3D shape determined by the previous manipulations transformed again to make a more realistic contour for the eyebrows, as if somehow the original image was created through the eyebrows, which left no trace themselves.\nLater on, copious blood marks are added without specific reference to those all over the Shroud (although the epsilon appears prominently, there are no brow ridges to have caused it), but no suggestion of any broken nose or swollen cheeks that are often claimed for the 2D/3D representation (see 1:19:09).\nAt the end of the programme Ray Downing takes a photocopy of a 3D plastic model of his face, to see if he can reproduce an image similar to that of the Shroud. He produces a very narrow oval of the very front of the face (1:24:17), with no representation of the jawline of the cheeks or hair, but claims that his scan and the Shroud (1:24:19), “exactly match.” They don’t, of course. The features are in the correct spatial alignment, but the fall-off in image as it recedes from the nose is huge in his model, and almost non-existent in the Shroud. This is why the Shroud looks so much more as if it has been made from a bas relief than from a full 3D head. Hardly surprisingly, his scan could easily be extruded into a 3D face (1:24:57 – 1:25:05), as it came from a 3D face in the first place, rather like the contoured face I have occasionally posted here myself. The Shroud, as we have seen only too often, doesn’t do this at all. \nI think Ray Downing has produced a good digital image, which no doubt could be made to walk about a CGI film very realistically, but I’m afraid that to claim it is any better or more accurate a representation of the man in the Shroud than has been created by numbers of sculptors just by looking at it, is unjustified.\n\n","date":"September 26, 2015 at 1:00 pm","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","id":"comment-211265","author":"Hugh Farey","site":"shroudstory"},{"title":"The VP8 Cinderella Question","post":"Oh Hugh, I don’t even have a will to read it all over. \nI am working on my presentation about. Wait some time because there are many issues that need to be adressed. I hope I will find a time to finish it. Otherwise – I will release in series.\n\n","date":"September 26, 2015 at 1:09 pm","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","id":"comment-211266","author":"O.K.","site":"shroudstory"},{"title":"The VP8 Cinderella Question","post":"About 3D and all the related effects.\n\n","date":"September 26, 2015 at 1:10 pm","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","id":"comment-211267","author":"O.K.","site":"shroudstory"},{"title":"The VP8 Cinderella Question","post":"I’m looking forward to it.\n\n","date":"September 27, 2015 at 5:09 am","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","id":"comment-211320","author":"Dan","site":"shroudstory"},{"title":"The VP8 Cinderella Question","post":"40 slides so far and counting. There will be many more.\n\n","date":"September 27, 2015 at 5:30 am","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","id":"comment-211324","author":"O.K.","site":"shroudstory"},{"title":"The VP8 Cinderella Question","post":"Dan ~ This is to your unnamed reader:\nReader ~ You can also refer to http://ShroudNM.com to e-mail Deacon Pete Schumacher himself and ask all the questions he wants, preferably after he reads the information & links you present in your post.\n\n","date":"September 27, 2015 at 1:40 pm","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","id":"comment-211357","author":"Dcn Andy","site":"shroudstory"},{"title":"The VP8 Cinderella Question","post":"Kevin and I have spent many hours discussing image formation with other shroudies, usually via phone.  He is truly amazing.\n I also had the opportunity to use the VP-8  when Rev Dreisbach had it in his Atlanta exhibit (probably the same machine).  You are correct.  It is an antiquated method of showing image structure and distance correlation and Dr Jackson’s moment will forever stand as one of the 2 greatest moments in Shroud history along with the Pia photonegative.  Spectacular!!\n\n","date":"September 28, 2015 at 8:23 pm","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","id":"comment-211457","author":"Chuck Hampton","site":"shroudstory"}]
