[{"title":"Should we be rethinking the VP8 and 3D images?","post":"There’s a simple way of demonstrating that a 2D graphic with no 3D history whatsoever is capable of responding to 3D rendering in ImageJ. Simply construct a series of concentric circles or ovals in MS Paint, using the colour palette to increase or decrease tone intensity progressively towards the centre (like colour-coded height contours on a map).\nHere’s one I did earlier:\n\nPete Schumacher of VP8 machine fame refers to his “brightness maps”. I guess what you see above is a “darkness map”.  However, one click on Edit Invert in ImageJ is all that’s needed to convert a darkness map to a brightness map and thence to the ‘pseudo-3D’ result shown. But if one imprints off a 3D or bas relief template capturing genuine relief information,  the end result is more optimistically described as quasi- rather than pseudo-3D.\n\n","date":"December 9, 2014 at 6:10 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175343","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Ray Rogers used a similar illustration. Put a drop of ink on a filter paper and then photograph to spreading out ink.  There are no limits on the number of 3D images you can create.  The interesting thing is that you, Colin, created one of a human form by scorching linen cloth with a hot statue.\n\n","date":"December 9, 2014 at 6:25 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175344","author":"Dan","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Let’s see Colin replicate another shroud with all of the forensic and anatomic details – including those not recognizable by the human eye.\n\n","date":"December 9, 2014 at 6:46 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175353","author":"Stan Walker, MD","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"I agree. And that I think would be very difficult if not impossible. My point is about the 3D characteristics.  I think they need to be more carefully described. I don’t want people believing the shroud is real based on incorrect information. For me, I just want to know what is correct.\n\n","date":"December 9, 2014 at 6:56 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175354","author":"Dan","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Fully agree with Stan\nWe think today technology is far more advanced than 2000 years or 600 years ago. Yet people with Doctorates in Science or Technology and also History and Archaeology cannot explain how those finer details recorded on the shroud. \nInstead of explaining how the whole image was formed, experts are giving only piece meal solutions. They give their opinions and/or hypothesis for only just minor aspect of the image. Today we have so many hypotheses of the image formation but none of the hypothesis cannot fully explains, all the details or aspects of the whole image. Why is that?\n\n","date":"December 9, 2014 at 7:10 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175430","author":"Sampath Fernando","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"I am a little bit confused by what has been “proven” about the Shroud  except to confirm that its image has distance information. Colin by creating a scorch from a three dimension object has shown that it will have similar properties to the Shroud. As they say in Yiddish: Neu? [So?] I am not Jewish but 45 years in the Bronx will gives you an appreciation of Yiddish.\nHis example is interesting but it represents the difference in distance as difference in color. The Shroud, like his scorch is monochromatic – a single color. The three dimensional representation that appears in the VP-8 is not caused by a difference in color but a difference in intensity or density of the image. Color (place on the spectrum of light) is different from intensity.\nActually, Colin is about where Ray Rogers was. Rogers  maillard reaction is a kind of scorch at low temperature but he realized that it wasn’t enough. There is that troublesome presence of real unscorched blood on the Shroud. \nLife is simple if you can accept the carbon dating tests. But, I submit, particularly after the Pam Moon presentation at St. Louis of the paper on the Oxford sample, that you can’t.\nMerely calling people like Wesselow or Heller or Adler names, doesn’t due the trick. De Wesselow was trained at the Courtlandt Institute. John Heller had amazing credentials including be chosen by Yale to be advised by Einstein at Princeton when he he was an undergraduate at Yale. Adler was Jewish. Yet, how often are the STURP scientists denigrated as Christian fanatics. \nThe differences in intensity (density) of the image was noted by Vignon were the reason for his “action at a distance” theory. \nSorry Dan, but once you understand that the image of the Shroud is monochromatic, you are back to action at a distance caused by a variation of image intensity, not color. Brightness is a function of intensity or density of the image. So too is “darkness.”\nIndeed, my scientific adviser referred to the VP-8 as a darkness map. (Ph.D. Carnegie Mellon, Emeritus University of Florida, Gainsville and a career studying writing about lasers, i.e. light) He was also impressed by the scholarship of the STURP paper by Jackson, Jumper et al on the nature of the image.\nI have the distinct impression that Colin has reinvented the wheel.\n\n","date":"December 9, 2014 at 7:07 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175357","author":"John Klotz","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"No John, I think you have been led astray by Colin’s concentric circles, which do indeed seem to vary in colour. His scorches, like the Shroud image, or Roger’s ink blob, are a uniform colour, only lighter or darker. His concentric circle illustration does seem to use colour, perhaps for illustrative purposes only, but the same effect can achieved by piling concentric circles of exactly the same colour on top on each other, and varying the brightness of each one.\nIt may be the that difference in brightness is caused by variation in distance. In Colin’s scorches it is mostly caused by variation in pressure, and one might surmise a situation in which variation in temperature played a significant part. Other factors may also be possible, such as variations in the conductivity in the scorching object.  However, if we choose distance, we come across a significant question. Distance from what, to what, and in what direction? This has been explored, but not very deeply, and no consensus has been achieved even by brightness/distance devotees. Imaging software assumes two horizontal planes, representing maximum and minimum brightness, and builds its image between them, but few authenticists think that the Shroud was horizontal when the image was created. Attempts have been made to calibrate image intensity against a hypothetical body/cloth distance, always vertical, using photos of a body covered with a cloth, with some success, while the corona discharge hypothesis implies a “shortest distance” relationship, whether ot not it is vertical.\nStan Walker, and also Todd earlier, falls back on the “if you can’t make one you must be wrong and I must be right” argument which it is surely time to retire.\nAnd I do hope nobody calls de Wesselow, Heller, Adler or any of the rest names. They are, or were, acknowledged experts in their field. However, a scientific field can be quite small. I would not call upon an “expert” forester to offer an expert opinion on seaweed, even though he may be a biologist of considerable standing, nor an Art Expert to pronounce on 1st century Christian theology. Would you?\n\n","date":"December 9, 2014 at 8:12 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175361","author":"Hugh Farey","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"AS you say, Hugh, the colour was for illustrative purposes only. Yes, it should have been converted to monochrome to isolate the image intensity factor, as it would have been if aimed at an exclusively scientific readership. In fact, one can do that retrospectively, as I’ve just done, and still get the same result.. Strong sense of d.v. right now, having been picked up once before on the cavalier use of colour (by OK as I recall).","date":"December 9, 2014 at 10:37 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175378","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"\nDurante 2002/Shroud Scope after CB’s 3D enhancement in ImageJ. Though wrongly inversed here, note the way the prominent crease marks at headtop and chin level do fit the TS man’s head and imply it was bound and compressed as the (then watery solution in-soaked) shroud, literally do appear molded around his head, front (and back).\nHad not CB PRESSED  and/or TRIED TO MOLD his linen AGAINST his scorching hot crucifix to test the contact-scorch hypothesis for the Shroud image, he would not have obtained such a dramatic 3D rendering in ImageJ.\nThe TS ventral and dorsal bloodied plan image is the ‘contact-and-gradual-loss-of-contact’ double 3D-encoded/volumetric image of a real crucifixion victim tightly wrapped-up back and front in the large linen sheet with the latter still showing many an image deficit implying air gaps and/or presence of screening objects.\n\n","date":"December 9, 2014 at 8:44 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175366","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Besides CB’s 3D failed to reconstruct the TS’s man head gently tilted forward as it is cryptically recorded on the linen sheet.\n\n","date":"December 9, 2014 at 8:49 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175367","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"typo: Besides CB’s 3D reconstruction failed to reconstruct the TS man’s head gently tilted forward as it is cryptically recorded on the linen sheet.\n\n","date":"December 9, 2014 at 8:50 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175368","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Addition: An additional subtletiy of the Shroud image CB’s 3D reconstruction is unfortunately lacling: the vertically panoramic image of the space under the TS man’s chin that misleadingly look like the latter’s neck.\n\n","date":"December 9, 2014 at 9:11 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175371","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"According to Lavoie’s reconstruction, the blood marks seen on the hair of the frontal image of the Shroud of Turin were originally on his face (forehead, temples, cheeks and beard) not in his hair as they now appear to be in the image.  The true fact is Lavoie is no forensic archeologist and could have missed a few cryptic data to reach a correct interpretation of the TS face image: possible presence of objects framing the TS man’s head ( e.g. small “jaw-box” made of three short wooden pieces + headband tight at top of head level in order to keep his mouth closed), long hair side strands pasted with dust and blood, hard like cardboard and ‘frozen’ at head-tilted-forward  position).\n\n","date":"December 9, 2014 at 10:00 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175373","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Typo: tied at top-of-head level\n\n","date":"December 9, 2014 at 10:16 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175375","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"“Should we be rethinking the VP8 and 3D images?”.\nFirst, for the sake of simplicity and historical accuracy, I would drop any reference to the VP8 in regard to the 3D information in the Shroud image. \nThe idea that the 3D information embedded in the image of the Shroud was discovered by using the VP8 is wrong. Completely wrong. The image 3D information of the Shroud image was described accurately way before the VP8 was used, at the turn of the XXe century. It was described in 1900-1902 in the French and Italian press, books, and booklets.\nMy understanding is that some writers like to refer to the VP8 as if the 3D information in the Shroud is something mysterious that only a complex machine is needed to show it.  And it allows these writers to through in the NASA or JPL acronyms as if that would give it a touch of scientific confirmation. (And additionally, we know the VP8 has nothing to do with NASA or JPL). But most of that has been said already by others, including on this blog and by Barrie Schwortz. \nSecond, to say that concentric circles of various degree of colors create a 3D image is quite wrong, simply because these circles are not 3D objects. What is meant by a “3D image” is that the objects are 3D objects and they are correctly registered as #D objects in some way on a 2D surface such as it is possible to reinterpret the 2D surface as an accurate representation of the 3D objects. Anything else is a false 3D image, and you can create all kinds of these false 3D images.\nThird, the Shroud image is not a photographic negative. I think this has been stated before many times but it is worth repeating. It is first and foremost an image that behaves as if it would have recorded a true 3D human body by using variations of intensity of colors as perceived by the human eye. This aspect was described more than 100 years ago.\nFourth, the Shroud image is “not unique” in that regard. This is obviously a wrong statement because there are  million of such images and you create any such image at will. What is unique: all known painted images from the medieval age do not have such a characteristic. The subtlety of the 3D information embedded in the facial area is beyond the capability of all known painters of the 14th century. That we can state with confidence. \nThe 3D information embedded in the Shroud image is one good reason to believe that the 1988 radiocarbon dating of the Shroud is probably incorrect.\n\n","date":"December 9, 2014 at 11:58 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175384","author":"Mario Latendresse","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"The Shroud image has no more “3D information”  embedded in it than the artificial relief map shown earlier.  How can it? One is inputting the photograph, Durante or whatever, and the photograph is based entirely on colour and intensity. For 3D information to be recorded and encoded, it would need to have some kind of sensing unit that sends out rays that are reflected back radar-style to build up an image of real relief  based on real height, not light absorption and/or reflection.\nA photographic image of the TS does NOT have any kind of relief-encoded information. It’s simply a pattern of light versus dark that digital software such as ImageJ ‘interpret’ as relief, based on the darkest areas of a scorch or negative TS image being the highest, plotted on an imaginary z axis. I suppose one could use the term “encoding” loosely to indicate that some 2D images derived from 3D objects, like scorch imprints, do respond well to ImageJ etc, but it’s not a true encoding phenomenon. It’s really just a happy accident of the process by which one captures relief acting in a sufficiently systematic manner so as to produce a reasonably and occasionally pleasing  correlation between real 3D relief of object and pseudo-3D impression of relief in the final image.\nIn any case, 3D properties tell one absolutely nothing about the age of the TS. That I’m afraid is obscurantist mumbo jumbo. Somebody had to say it.\n\n","date":"December 9, 2014 at 12:25 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175386","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Colin, I think you do not interpret the word “has encoding of” correctly. The TS has 3D encoded information based on some assumption: An anaglyph photograph has 3D encoded information based on some assumption; an hologram has encoded 3D information based some assumption; an auto cad file has 3D encoded information based on some assumption; and so on. There is an encoder and a decoder, both used an assumed encoding of the 3D information. Otherwise, no computer file would be able to encode 3D information.\nYou wrote: “A photographic image of the TS does NOT have any kind of relief-encoded information”. \nThis is false,  because, assuming that the color intensity correspond to a relief, we can perceive a 3D corpse that looks like a real corpse (granted with some distortion at some places). There is therefore 3D encoded information in the TS. \nYou wrote: “It’s simply a pattern of light versus dark that digital software such as ImageJ ‘interpret’ as relief, based on the darkest areas of a scorch or negative TS image being the highest, plotted on an imaginary z axis.”\nYes, this is the assumed encoding. This is what 3D encoded information means.\nYou wrote: “I suppose one could use the term “encoding” loosely to indicate that some 2D images derived from 3D objects, like scorch imprints, do respond well to ImageJ etc, but it’s not a true encoding phenomenon.” \nIt’s not a true encoding phenomenon? What does that mean?\nEncoding simply means that you assume some mapping, here from intensity to height. That’s all. Do you assume that when you look at a mountain that your brain has a not true encoding of the mountain? That is actually meaningless. Your brain interpret correctly what you see if indeed you perceive the object as it really is. So it is a true encoding, yet it is only electric wave certainly any true height in your brain.\nYou wrote: “In any case, 3D properties tell one absolutely nothing about the age of the TS. That I’m afraid is obscurantist mumbo jumbo. Somebody had to say it.”\nI am not sure you understood my point.\nI wrote: “The subtlety of the 3D information embedded in the facial area is beyond the capability of all known painters of the 14th century. That we can state with confidence.”\nSo, the idea that this image was produced in the 14th century is at odd with all known artists of that period, and this is based on the subtlety of the 3D information encoded in the Shroud  image. \nNote that this is how historians and archeologists work: if an object does not correspond to the style of an artistic period, they do not claim that it belongs to that period. A painting that looks like a Picasso would not be ascribed a 16th century origin. Likewise, the Shroud technique of production and its style does not correspond to the 14th century. It actually does not correspond to any known artistic rendition of any period.\n\n","date":"December 10, 2014 at 12:28 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175468","author":"Mario Latendresse","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Our comments crossed, Mario. The one I sent a few minutes ago was in response to Nabber, but expands on what I said earlier to you.\nI’ll give this latest comment of yours more study before responding in detail. However, first impressions, as before, are that you are doing what so many do who have the IT know how, but have lost sight of the fundamental physics: you are confusing the map with the terrain. They are NOT one and the same, which I’m pleased to see you implicitly acknowledge by saying that the maps are model-dependent. First find the right model that applies to your map. The detail is crucial – one cannot rely on overall impressions (“Oh, it’s an image of a man, so let’s pretend it’s a photograph”). No, if it’s the TS, one cannot pretend it’s a photograph.\n\n","date":"December 10, 2014 at 12:55 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175474","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Mario Latendresse:\n“This is false, because, assuming that the color intensity correspond to a relief, we can perceive a 3D corpse that looks like a real corpse (granted with some distortion at some places).”\nYou are wrong because the shorud doesn’t reflect the distances to a body in function of the distance, neither if  it were  laying on a human body nor mysteriously flattened. Some uniformly coloured areas of contact (not points) would appear in the first case, and the distance between a plane (the sheet) and the body will not correspond to the image of Shroud, in the second case. It will be so in any system of topographic translation that you will be able to suppose. The “distortions” are big.\n“The subtlety of the 3D information embedded in the facial area is beyond the capability of all known painters of the 14th century”.\nThere is not any exceptional “subtlety” in the 3D information. I can do a similar imageof the race in five minutes. Of course, technically worse because I am a very bad drawer. The originality lays in the conception: an imprint marks more the protruding parts of an object. But, as I say above, the solution of the Shroud is not “subtle” if you are thinking in realistic.\nAnd originality doesn’t imply “beyond the capability”.\n\n","date":"December 10, 2014 at 3:59 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175497","author":"David Mo","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Typo: “of the face”, not “the race”, Sorry.\n\n","date":"December 10, 2014 at 4:00 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175498","author":"David Mo","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Typo: “…the shorud doesn’t reflect the distances to a body in function of the intensity of the colour”, not “…in function of the distance”…\nSorry.\n\n","date":"December 10, 2014 at 7:08 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175518","author":"David Mo","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Mario said, ” we know the VP8 has nothing to do with NASA”  That is INCORRECT.  \nThe VP-8 Image Analyzer was used to interpret NASA LANDSAT-1 Earth Resources Satellite Program images, for an example, see ntrs.nasa.gov, Technical Report #19760010448.\n\n","date":"December 9, 2014 at 12:34 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175387","author":"Nabber","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Sorry, I should have been more precise: the VP-8 (or VP8) was not invented or created by NASA or JPL. Yes, NASA use the VP8. So such term as “NASA VP8” is misleading.\nAgain, such statement as “en 1976 lorsque deux scientifiques de la NASA, Jumper et Jackson utilisèrent un logiciel de la NASA, le VP8, qui permet de représenter en 3 dimensions”, this is completely wrong, and this has been repeated numerous times.\nThe main point though is: the 3D characteristic of the Shroud image was NOT discovered using the VP-8, it was discovered by other writers and researchers way before the 1970s. Descriptions of the 3D characteristics of the Shroud image were given as early as the first decade of the XXth century in Europe.\n\n","date":"December 9, 2014 at 1:37 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175395","author":"Mario Latendresse","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"I am not aware that NASA did use the VP-8 image analyser actually, although it was used by the Natural Resources Management Corporation to help interpret satellite imagery obtained by NASA. Their report was forwarded to the Goddard Space Flight Centre and filed with the NASA Scientific and Technical Papers.\n\n","date":"December 9, 2014 at 2:23 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175400","author":"Hugh Farey","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"NASA financed the Natural Resources Management Corporation to do this work with the VP-8.  The information was not only “filed” with NASA Scientific and Technical Papers, it was also presented at a NASA Conference in 1976.  You know, Hugh,  just in case you were trying to distance the NASA – VP-8 connection.  Too, too obvious.\n\n","date":"December 9, 2014 at 4:30 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175411","author":"Nabber","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Yes I was. And yes I did. NASA did not use the VP-8 image analyser.\nBut the reason for doing so was to help shift the myth, unwittingly perpetrated by Barrie Schwortz until he rewrote his article, that the VP-8 image analyser was “designed in the 1960’s for creating relief maps from moon photographs”. I have read that it was originally invented to help interpret X-rays, for which its intensity/distance capability seems suited, but as a vegetation analyser it was used in quite a different way, as the varying colour of healthy or diseased trees is obviously nothing to do with their elevation.\n\n","date":"December 9, 2014 at 4:55 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175414","author":"Hugh Farey","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Yes, Hugh, NASA did most certainly use the VP-8 image analyzer, by paying subcontractors on a host of LANDSAT projects, including in Serbia, Canada, and Thailand, to name a few.  You have missed the point by dismissing it as a “vegetation analyzer”; actually, the ability to process hundreds of different grayscale tonalities allowed it to enhance LANDSAT visual to near-IR band images in order to provide an improved, “super” look at a vastly-increased number of high-contrast areas and low-contrast areas, both of rock and vegetation, alone or together.  This is indeed analogous to what was done with the Shroud with the VP-8, allowing an intensity-to-distance capability.\n\n","date":"December 9, 2014 at 10:17 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175450","author":"Nabber","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"“This is indeed analogous to what was done with the Shroud with the VP-8, allowing an intensity-to-distance capability.”\nThere is no “intensity-to-distance” capability, and its highly misleading to suggest otherwise. I made brief reference earlier to the need for an emitting source of scanning radiation if one’s to get real distance information. The wiki entry on ‘remote sensing’ sets out the two options: there’s passive sensing, as with photography, where one’s dependent  on the radiation emitted or reflected by the ‘terrain’ of interest. Then there’s active sensing, where one aims one’s scanning beam, and collects reflected radiation. Only the latter can give genuine relief information that one encodes and then reads back, i.e. ‘decodes’.  Passive sensing cannot give any encoded information, since it’s the gathered light or other radiation is captured by photography which simply reads what it receives with no encoding mechanism except for conversion to pixels.\nTakeaway message: there is no encoded 3D information in a photograph of the TS. There is merely a 2D image that has patterns of light or dark that can be computer-processed to give APPARENT relief. But if the original image was not created by photography, but by some other imaging mechanism, there is always the possibility that one will be fooled into thinking that a darker-than-average feature on the image represents high relief. It ain’t necessarily so. Different imaging models create different interpretations.\nIn my contact thermography model, an intense image area might represent the highest relief, but not necessarily if the latter is highly angular, like a nose say, with only a small plateau area at the highest point, with rapid falling.off.  One may well get better imprinting off lower relief that is more plateau-like, giving a larger area of contact, and, just as important, a higher resistance to impaction pressure when a heated template is pressed into linen that is NOT on a hard unyielding surface, but placed on a damp underlay comprising several layers of cloth.\n\n","date":"December 10, 2014 at 12:38 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175471","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Fair enough. If paying for someone to do something for you is the same as doing it yourself, and if looking at areas of contrasting image density is the same as producing topographical images, then I agree with you, Nabber.\n\n","date":"December 10, 2014 at 6:25 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175514","author":"Hugh Farey","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"C.B. said, “Passive sensing cannot give any encoded information.”  On the other hand, I don’t believe anyone has made a final official declaration that the TS image occurred by passive sensing….\nHugh:  obviously you don’t understand how Government works — in the U.K. and the U.S., “paying for someone to do something for you is the same as doing it yourself” is exactly how it works.  If they’re paying, The Government owns all processes and results from your work, therefore it is Their work.  \nAs far as contrasting image densities producing topographical images, that is exactly what was produced with the “3-D” TS Image.  And if they didn’t think that they were going to come up with something significant when they ran the TS info through the VP-8, why did they even start?  According to your reasoning, they would not even have bothered to look — therefore, something is wrong with your reasoning.  Unless of course you are calling Schumacher, Jackson, Jumper, et. al., “hoaxers.”\n\n","date":"December 10, 2014 at 9:02 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175530","author":"Nabber","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"“C.B. said, “Passive sensing cannot give any encoded information.” On the other hand, I don’t believe anyone has made a final official declaration that the TS image occurred by passive sensing….”\nYou have misconstrued my meaning, Nabber. It is not the TS image per se that is entered into the 3D-imagiing software. It is photographs of the TS image which, being taken with a camera with no active scanner, but merely passive reception of reflected light, cannot possibly pick up encoded 3D information, even if it was there in the TS image. The 3D-rendering depends entirely on the distribution of 2D image intensity. That’s why it works on photographs of scorch imprints too, as good as if not better than the TS image. Some might consider it’s time the so-called (pseudo) 3D properties of the TS image were de-mythologized\n\n","date":"December 10, 2014 at 9:27 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175534","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"C.B.:  “photographs of the TS image … taken with a camera with no active scanner but merely passive reception of reflected light, cannot possibly pick up encoded 3D information, even if it was there in the TS image.”  CANNOT POSSIBLY — so you say, yet others say something seemingly impossible is associated with the TS.\n “[And] Yet the image on the Shroud of Turin yields a very accurate dimensional relief of a human form. One MUST conclude from this that the image density on the cloth is directly proportionate to the distance it was from the body it covered.” (Schwortz)\nC.B: “That’s why it works on photographs of scorch imprints too, as good as if not better than the TS image.”  No, I don’t agree that they look as good, plus the scorches proffered up thusfar do not sit on the top 1/500th of an inch of the fibrils.\n\n","date":"December 10, 2014 at 10:13 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175541","author":"Nabber","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"“[And] Yet the image on the Shroud of Turin yields a very accurate dimensional relief of a human form. One MUST conclude from this that the image density on the cloth is directly proportionate to the distance it was from the body it covered.” (Schwortz)\nThat is a model being stated there as if fact, a non-contact model that assumes variable cloth-body distance. One proposes models, then tests them. One does not impose them on folk, and not bother testing them, instead going on the US and international lecture circuit or before TV cameras proselytizing a narrative that is nothing more than a model, one with NO experimental backing whatsoever. \nReminder: Barrie M.Schwortz was Documenting Photographer to STURP. What does he know about the scientific modus operandi? What does he know about model building in physics and chemistry, about objective model testing ? A training in research  generally requires three or more years on top of a first degree.\nC.B: “That’s why it works on photographs of scorch imprints too, as good as if not better than the TS image.” No, I don’t agree that they look as good, plus the scorches proffered up thus far do not sit on the top 1/500th of an inch of the fibrils.\nI’m not trying to produce a facsimile copy of the TS, merely to demonstrate that there is nothing magical about a 2D image having 3D properties such that it closely resembles the original template, as shown with my thermal imprints off a brass crucifix. I’m not interested  in time-wasting beauty contests.\nI do not know the precise image thickness of my scorches, but then neither do you, so kindly stop kidding us on.\nOne can make a scorch as superficial as one wishes, simply by testing its scorching power as it cools with small wads of linen, until the required degree of faintness is achieved. I see no reason why scorches that are close to the limit of visibility should not be 200-600 nm thick (a guesstimate on Rogers’ part anyway). Do you? If so, let’s be having hard facts please.\n\n","date":"December 10, 2014 at 10:47 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175544","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Short answer: CB’s model is wrong.\nBut, what was the question?\n\n","date":"December 9, 2014 at 12:36 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175388","author":"anoxie","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Mario,  TS may not be a true photographic negative but it sure looks line one.  I also agree that the the 3D information in the image is one good reason to believe that the 1988 Carbon Dating is incorrect – but it is not sufficient.  There are better reasons why the CD is incorrect.\nGetting back to CB’s scorch theory – it would be better to use a term better than scorch.  Scorch is too vague.  Not specific.  Not scientific.  \nAny transfer of energy to linen could be considered a scorch.  The notion of a heated cruficix with linen overlayed – giving this image – seems so crude.  Max P.H.  rightly observed the CB would have needed to have “pressed” the linen against the heated crucifix.\nMany of us probably remember helping our mothers do the ironing when we were younger.  That hot iron – and the scorch – on dad’s shirt or on the pillow case – varied dramatically not only with the heat and time of exposure but also to the pressure applied.  I applaud CB’s theories but wish he would considere more scientific – and more elaborate causes of scorches.\nDaily, I work with lasers – femto, argon, yag, excimer, etc.  As a physician and an opthalmolgist I have always been intrigued by the shroud image and have wondered if it was created by an intense burst of light energy.  We know to create an image on the outermost fibrils of the linen – a very sophisticated transfer of energy is necessary.  Heat – in the  thermal range – as an exlpanation of the scorch is ridiculous.\nThere is indeed – 3D information on the shroud – simply because we can perceive a 3D image.  The distance of the shroud from the linen – adds an interesting theory as to the embedding of the 3D information – but understanding how the image – and discoloration  – of the outer fibrils – was established seems to take primacy.\nThe monochromatic nature of image and its superficiality points us in a different direction from a thermal scorch or some chemical reaction.\nAs Goethe’s last words were, “More light!”.\n\n","date":"December 9, 2014 at 12:50 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175389","author":"Stan Walker, MD","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"“The monochromatic nature of image and its superficiality points us in a different direction from a thermal scorch or some chemical reaction.”\nScientifically, the shroud image is not monochromatic. This is another abuse of language, like the 3D issue.\n\n","date":"December 9, 2014 at 1:53 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175398","author":"anoxie","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Hello Stan. Yes, the Shroud image appears, at first, like a photographic negative. But I would like to stress that a more precise description is needed because it is not a photographic negative. Granted that as a first approximation we could describe it that way, but I think it leads to many misunderstanding when you take this description literally.\nAs a good example, take Walter C. McCrone who was told by Father Peter M. Rinaldi, in a series of letters they exchange, that the Shroud image was a photographic negative. This series of letters are reproduced in McCrone’s book (Judgment day for the Shroud of Turin).\nIf you look up on p. 213 of that book, we can read the following (funny?) statements made by McCrone: \n“… also, if it is a perfect negative then Christ must have had blonde hair, blonde eyebrows, blonde beard and blonde mustache since these all appear light in the positive image produced as a photographic negative of the Shroud image”.\nWell, …, so McCrone took the expression “perfect negative” as literally meaning a photographic negative where light colors are reproduced as dark colors, and dark colors as light colors. But he knew that it was not the case, that is, that the Shroud recorded the distance cloth body (the rest of page 213 shows that he knew that). So, McCrone himself argued, and took the time do so, that the Shroud image was not a true negative and pointed out the error to Father Rinaldi. You could say it starts to be pedantic but others have done it also pointing out that this term is incorrect. So, I think we need precision to avoid confusion.\nWhat do you think?\n\n","date":"December 9, 2014 at 4:03 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175407","author":"Mario Latendresse","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"From wiki: (note the two references to sweat, and one to “imprint” (bolded)\nThe Veil of Veronica, or Sudarium (Latin for sweat-cloth), often called simply “The Veronica” and known in Italian as the Volto Santo or Holy Face (but not to be confused with the carved crucifix Volto Santo of Lucca) is a Catholic relic of a piece of cloth, which, according to legend, bears the likeness of the face of Jesus not made by human hand (i.e. an Acheiropoieton).\nVarious existing images have been claimed to be the “original” relic,\nor early copies of it, but the evidently legendary nature of the story\nmeans that there are many fewer people, even among traditional\nCatholics, who treat claims of actual authenticity very seriously\ncompared to the comparable relic of the Turin Shroud.\nThe final form of the Western legend recounts that Saint Veronica from Jerusalem encountered Jesus along the Via Dolorosa on the way to Calvary. When she paused to wipe the blood and sweat (Latin sudor) off his face with her veil, his image was imprinted on the cloth.\nFrom that, one might deduce that there was a primary image in sweat (and blood) that then by miraculous means transformed into a fully-fledged image. It did after all start with a lady mopping a face with her veil. Why do that unless to remove sweat etc from the face? So attempts to banish sweat entirely from the picture, especially as the Latin term sudarium means sweat cloth, makes no sense at all, and is frankly mere obstructionism.\nThe thesis I propose is nothing to do with the evolution of a legend, or the precise moment a physical act of wiping off sweat became transformed by miracle. I’m simply saying that the medieval hoaxers who produced the TS began by imagining a Veronica like scenario involving cloth absorbing sweat and blood, the difference being that the post-Crucifixion image could be marketed as if a REAL sweat imprint, NOT a legendary one that was miracle-enhanced. However, they did not need to employ real sweat or any other chemicals to simulate that sweat imprint. A thermal imprint from a heated template onto linen could be passed off as an ancient sweat imprint. \nAs acknowledged earlier, it did not need to be a pure thermal imprint. It could have been chemically-assisted so as to imprint at a lower temperature, e.g. the invisible-ink effect that one can get with lemon juice or milk, or even white flour impregnation as I discovered and reported recently. In any case, my experimentation is about model-building using realistic technology that was available in the medieval era. One cannot hope to divine exactly what was done all those centuries ago. One has to be content with a rough approximation in the first instance. Progressive refinement comes later.\n\n","date":"December 9, 2014 at 1:26 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175394","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Colin, you are still not taking a scientific approach.\n\n","date":"December 9, 2014 at 1:39 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175397","author":"Stan Walker, MD","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Maybe not, Stan Walker, MD, but Colin Berry PhD, retired scientist,  is not approaching the TS from purely a scientific standpoint (how can he when there’s no access to the artefact in question?). I see it as a detective story, one in which the tiniest scraps of information (physical, chemical, medical, historical etc)  need to be scrutinized closely for the clues they might offer, with a view to working them into the solution.\n\n","date":"December 9, 2014 at 1:55 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175399","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"The Veil of Veronica legend OF COURSE started out as a woman wiping the SWEAT and blood off of the face of Jesus.  But as I said, any Medieval person would have been thinking that the act of wiping sweat and blood off of anyone’s face would produce nothing but a huge smudge, and using the SUDARIUM word making no difference.\nThat is why the Veronica was thought to be a miraculous production of Jesus’ face, in color, and not a “sweat imprint”.  That is why all the Medieval artists painted their copies of it in color.  That is why the Medieval hoaxers were not able to get anyone to buy into the concept of a “sweat imprint” — NO ONE HAD SEEN ONE, and Colin Berry can’t cite an instance of anyone in Medieval times having seen a painting of a sweat imprint, or even having seen a real burial cloth with a sweat imprint.  So naturally, any Medieval bishop, cleric, or common-man would not be able to buy into the thought of a TS as a “sweat imprint”.  If anything, they would have gone for a nice color body/blood imprint.  Whether Pre- or Post-Crucifixion imprint, the people would not have been “marketed” into a “sweat imprint”.  They’d never heard of one or seen one! (except for the  big smudge, that is!)\n\n","date":"December 9, 2014 at 4:57 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175415","author":"Nabber","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Precedents for sweat imprints? The TS needs no precedents. That’s the secret of creating a successful icon – produce a one-off, then keep the technology a closely-guarded secret.\nThe Veil of Veronica merely provides the germ of the idea – that of body sweat producing some kind of proto-image, not necessarily the final one that evolves via artistic licence and miraculous transformation. The business of wiping and smudges only arises with the Veil – and is dealt with as indicated. It does NOT arise with the Shroud, given it’s a deceased and motionless individual being transported and subsequently laid out in Joseph’s linen. There’s a lot more scope there for suggesting the body image was an ancient yellowed sweat imprint – essentially as perceived by Francis de Sales in 1614.\nAre you familiar with the Spanish artist Francisco de Zurbaran (early 17th century). The Veronica was a favourite subject of his, and one can find an entire spectrum of representations, ranging from greyish-green monochrome through to vivid natural tones. There probably wasn’t a lot of mileage in doing the drabber ones that looked suspiciously to some eyes, well, two at any rate, as somewhat sweat-like in conception.\n\n","date":"December 9, 2014 at 5:38 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175421","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Colin, PhD – I am glad to hear you say you are not able to take a scientific approach with the information and tools that you have.  Using language like “medieval hoaxers who produced the shroud” as you have done – is insinuating that the rest of us are chumps for believing the hoaxers.  No?  Your contributions – which I must say – prima facie – are worthy of further investigation.  It perplexes some of us that you take a blind eye to details.  Such as the superficiality of the image – that it is simply inconceivable that anyone – then or now – can or could  reproduce it.  Or, details on the anatomy -such as the shape of the metal dumbbells from the flagrum – and its pathognomonic lesions.  Try reproducing that with your hot crucifix…..too hot to handle methinks.\nYes, it is a detective story and there are many scraps of evidence.  But we cannot pick and choose the evidence we want and ignore the rest.\n\n","date":"December 9, 2014 at 2:41 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175401","author":"Stan Walker, MD","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"“Using language like “medieval hoaxers who produced the shroud” as you have done – is insinuating that the rest of us are chumps for believing the hoaxers.”\nYou really shouldn’t take things so personally, Stan Walker, MD. What was it the man said? “We do not know what we do not know”  – so you should at least give a fair hearing to new approaches, new thinking. Nobody to the best of my knowledge has previously suggested that the TS body image was produced as a thermal imprint to simulate an ancient sweat one. Please give a fair hearing before coming across as so instantly judgmental.\nSuperficiality of the image? Scourge marks? You might not be aware but I have addressed both those issues among many others in the past (250 postings in 3 years). I’m happy to talk about those another time – but not now. The topic here and now is 3D imaging. I may be a lousy scientist (by your reckoning) but I’m a highly focused lousy scientist.\n\n","date":"December 9, 2014 at 3:58 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175406","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"‘Nobody …has previously suggested that the TS body image was  produced as a thermal imprint to simulate an ancient sweat one.’  I can’t think why they missed it,Colin, it is such an obvious explanation – I just can’t believe that you have not found the evidence for it yet!\n\n","date":"December 9, 2014 at 4:21 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175409","author":"Charles Freeman","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"You were the last person I expected to find on this thread, Charles, given there wasn’t a single mention in your article of the Shroud’s 3D properties. Maybe if you’d given it a moment’s thought, you would not have gone looking for the obvious explanations, and recognized the need to look for non-obvious ones.\nThere may conceivably be mechanisms for producing negative images with 3D properties that do not require imprinting off a template, but I have yet to see them modelled (as above). It’s what we scientists do, Charles. We build models – and then subject them to critical testing.  \nMany moons ago, I too suggested that a pigmented material had detached from the Shroud. No, not the body image but the blood. But unlike you, I searched for traces that might still be present – and located some, trapped in the interstices of the weave. Have you looked for traces of pigment hang-up Charles that might add some scientific weight to your crumbled-away paint theory that somehow manages to leave a negative image with 3D properties?\n\n","date":"December 9, 2014 at 4:53 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175413","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Keep up the good work Colin. You have not convinced me of non authenticity but your line of investigation appears to me at least to be one of the more compelling non authentic theories.\nFar more likely in my view than a faded painting explanation.\n\n","date":"December 10, 2014 at 12:54 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175473","author":"Thomas","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Thanks Thomas. Even for ploughers of lonely furrows, a little support and encouragement never comes amiss, especially as now before the first light of dawn (literally and metaphorically).\n\n","date":"December 10, 2014 at 1:04 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175475","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"‘The painting process was very efficiently carried out, which suggests that the painter must have been well experienced. First, he painted all the outline shapes with unmodulated local colour, then he added the interior details and modelling. To create a three-dimensional impression, light and dark lines were added, and sometimes cross-hatched shading .  . . . Though the painter worked with care, sometimes he blocked in local colour, where he should have left a blank for adding in details of a different colour. These mistakes have become visible because some of the details painted on top are now lost.’\n From the report on the Zittau Veil in Villers (ed,) The Fabric of Images, p.104.\nThree dimensional impressions, details of the original painting now lost? Gives some clues to me when comparing the Veil to a similar linen cloth such as the Shroud.\nOn the ‘large’ quantities of calcium carbonate that STURP found across the surface of the Shroud. Does Colin agree with STURP that they are ‘accumulations of dust’? I favour the remains of gesso as calcium carbonate is used to this day in sealing the outer surface of linen for painting but perhaps Colin has a completely different explanation again.\nIt does seem a lonely life for Colin but at least it is one of his own making!\n\n","date":"December 10, 2014 at 7:17 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175519","author":"Charles Freeman","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"‘The painting process was very efficiently carried out, which suggests that the painter must have been well experienced. First, he painted all the outline shapes with unmodulated local colour, then he added the interior details and modelling. To create a three-dimensional impression, light and dark lines were added, and sometimes cross-hatched shading . . . . Though the painter worked with care, sometimes he blocked in local colour, where he should have left a blank for adding in details of a different colour. These mistakes have become visible because some of the details painted on top are now lost.’\nFrom the report on the Zittau Veil in Villers (ed,) The Fabric of Images, p.104.\nThree dimensional impressions, details of the original painting now lost? Gives some clues to me when comparing the Veil to a similar linen cloth such as the Shroud.\nCharles, it only shows your ignorance about the problem discussed.\n\n","date":"December 10, 2014 at 7:50 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175522","author":"O.K.","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"“Large quantities of calcium carbonate” (STURP). What, like “extraordinary quantities of bilirubin” (also STURP)? Is that the best you can do, Charles? How much calcium carbonate? I was taught that a scientist never deploys vague words like “large” or “small”, that there must always be some indication of precise amount.\nSo forgive me if I don’t get drawn into discussion on calcium. There’s another reason too, even if the amounts of calcium per in the mg quantity per square cm of linen. You can “fit” calcium carbonate into your model, and I can fit it into mine (I’ll spare you the details). But while my model may be wrong, I know yours definitely is wrong.\nHow do I know? Well, you are not the first to have speculated about pigment fall-out, or rather fall-off where the TS is concerned. I was doing it over two years ago in connection with Shroud blood, or “blood” as I prefer to call it.\nHere’s a Shroud Scope image I posted of the wishbone-shaped bloodstain in the hair:\n\nThere’s an irregularity in the weave running between the numbers 2,3, and 4. If you look carefully, you will see hang-up of red pigment (“blood”) in the interstices of the weave along that line, implying that there has been extensive denuding of pigment in that trickle of blood generally. Now compare the interstices of the weave with the colour and intensity of the body image.  If there’s been any hang-up of body image pigment, then it’s very slight and scarcely detectable. In other words, blood, or look-alike red pigment may slough off. leaving tell-tale signs in crevices, but body image does not. Conclusion: while the body image may be faint, it’s unlikely that what we are seeing is the remnant of a painted-on image using classical artist’s pigments (it not being unreasonable to assume that if blood pigment has detached over centuries, then so might or would the other pigments).\nFinally, you still do not appear to appreciate that the 3D properties of the TS image, as revealed by computer software converting image intensity to pseudo-relief, is something totally from the artist’s technique of conveying 3D form. The latter depends on patterns of light and shade as seen when light is coming mainly from a single direction that is at an angle to the normal. But the TS image is non-directional – its 3D properties have nothing to do with angled illumination, being neither a photograph nor a painting. Any theory of the TS has to account for the 3D properties, taking account of non-directional image characteristics. You have chosen totally to ignore the chief characteristic, indeed peculiarity of the TS image Charles.\n\n","date":"December 10, 2014 at 8:59 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175529","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Colin, yes indeed!\nQuestions to Charles: have you spread some gesso to seal a linen cloth? Then try to remove it? Photographs of before and after would start an interesting discussion. Until then, you are only speculating.\n\n","date":"December 10, 2014 at 4:02 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175600","author":"Mario Latendresse","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"“Charles, it only shows your ignorance about the problem discussed.” I don’t think comments like this help move the discussion in any direction. If one has a problem with Charles’s quotation in relation to the Shroud, one has a duty to explain what it is, so that we do not simply revert to yes-it-is no-it-isn’t bickering. For me, the main problem with the painting hypothesis is, as Colin says, that after microscopic inspection of as much of the image as I can find (on Shroud 2.0), there is not a single speck of paint left anywhere at all. This indeed speaks of attrition of a most thorough and uniform kind, which I cannot attribute to rolling and folding even after 500 years. There is also the problem of the protein. As the gesso would have been held to the cloth with rabbit-skin glue or something similar, the presence of the one would seem to predicate the presence of the other. These problems are not insurmountable, and I’ve no doubt Charles has been wondering about them himself, but they are problems with the paint theory none-the-less.\n\n","date":"December 10, 2014 at 9:04 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175531","author":"Hugh Farey","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"“Charles, it only shows your ignorance about the problem discussed.” I don’t think comments like this help move the discussion in any direction. If one has a problem with Charles’s quotation in relation to the Shroud, one has a duty to explain what it is, so that we do not simply revert to yes-it-is no-it-isn’t bickering. \nHugh, according to your wishes:\nCharles mixes techniques commonly used in paintings to give visual impression of 3D features (perspective, fog effect etc.) with actual encoding of supposed 3D information about the shape of the supposed body enveloped in the Shroud. Those are obviously two completely different things, but may confuse someone who does not understand the difference.\n\n","date":"December 10, 2014 at 9:49 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175537","author":"O.K.","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"CB:\nOne can make a scorch as superficial as one wishes, simply by testing its scorching power as it cools with small wads of linen, until the required degree of faintness is achieved.\nHow?\n\n","date":"December 10, 2014 at 10:56 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175545","author":"O.K.","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Serial imprinting, OK, gives a quick idea of the kind of superficiality that is achievable with scorching. One heats up the template until a test swab is quickly scorched. One then imprints quickly, to get an intense image, then again, and again, as it cools, to get a series of progressively fainter images, and finally no image at all (even though the template still hisses and steams when held under the tap). As I say, there’s no reason for thinking that the final images cannot be as superficial as Rogers’ estimate of TS image thickness (200-600nm).\nThere’s another experiment I reported way back that suggests scorch images can be highly superficial. Strip off the epidermal layer (just one cell thick) from an onion’s inner scale leaf, and leave it to dry out overnight, when it becomes like rice paper. Each ‘skin’ comprises two primary cell walls,each probably some 100-200nm thick according to the literature on plant cells generally, plus some dehydrated cytoplasm and vacuolar inclusion. Let’s say a total thickness probably in the region of 600nm max.  One can place that dried onion epidermis, reminder, just one cell thick, onto linen and imprint briefly with a heated template. Result: an intense red-brown scorch (probably including Maillard browning products) without seeing any scorching whatsoever of the underlying linen. Even intense scorches can be highly superficial, though I don’t have the figures to prove it (but then nor does anyone else, despite claiming the TS image to be “uniquely superficial”, unobtainable by anything so crude as a contact scorch etc etc etc etc).\nAlternatively, one can sensitize linen to make it more susceptible to taking a scorch at a lower temperature, e.g. with lemon juice or milk (the invisible ink effect).  It’s then pretty certain that the scorch is not just pyrolysed flax carbohydrates (primary cell wall initially?) but Maillard browning products too formed between reducing sugars in the additive and proteins  and other sources of free amino groups.. It remains to be seen how the image thickness compares in that situation with untreated linen. It might be thicker, or,  there again, it might conceivably be thinner.\n\n","date":"December 10, 2014 at 11:30 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175553","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Colin, even if there has been some control of scorch intensity, there is another problem:\nhttp://en.wikipedia.org/wiki/Naked_eye#Small_objects_and_maps\nObserving a nearby small object without a magnifying glass or a microscope, the size of the object depends on the viewing distance. Under normal lighting conditions (light source ~ 1000 lumens at height 600–700 mm, viewing angle ~ 35 degrees) the angular size recognized by naked eye will be round 1/60 degrees = 0.0175 radiant.[citation needed] At a viewing distance of 16″ = ~ 400 mm, which is considered a normal reading distance in the USA, the smallest object resolution will be ~ 0.116 mm. For inspection purposes laboratories use a viewing distance of 200–250 mm,[citation needed] which gives the smallest size of the object recognizable to the naked eye of ~0.058- 0.072 mm(~55-75 micrometer). The accuracy of a measurement ranges from 0.1 to 0.3 mm and depends on the experience of the observer. The latter figure is the usual positional accuracy of faint details in maps and technical plans.\nRemember, you are during medieval, you have no microscope for checking your results…\n\n","date":"December 10, 2014 at 11:54 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175557","author":"O.K.","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"That’s a totally misguided notion you have there, OK, namely that a superficial layer had to be planned that way with advanced technology.\nMedieval man could pour olive oil onto a pond and get rainbow-coloured oil films even thinner than the TS image layer. It required no effort – being the result of natural forces. \nScorching of linen carbohydrates is an endothermic reaction under non-standard conditions (where steam and other pyrolysis gases dissipate heat). It’s probably that which limits the thickness of the image layer, especially at lower temperatures in the region of 250 degrees C which cause selective pyrolysis of hemicelluloses of the superficial primary cell wall. The bulk cellulose of the fibre core is a lot more resistant to pyrolysis.  In short, a combination of physics, chemistry and botany limits the depth of penetration of a scorch, especially if the template’s initial temperature is tested with scrap linen to ensure it gives no more than a light scorch at its first pressing. What is also important (and invariably overlooked in the anti-scorch literature) is the use and need for a damp underlay/overlay (depending on configuration) that serves as a heat sink for conducted heat, preventing excessive scorching, helping to protect the core cellulose while the more superficial PCW is selectively scorched.\nToo many folk who should no better have been in far too much of a hurry to dismiss thermal imprinting as a model system, failing to do properly designed experiments. Were they to have done so,  they would have realized that it’s not the brute force method they had imagined  highly superficial scorches can be produced to order, even if no one in the 20th/21st century has got round to measuring the precise depth of penetration. Oh, and let’s not forget that TS image threads are mechanically weaker than non-image controls, suggesting that the zone of pyrolytic (or Maillard) chemical action is maybe not as superficial as we have been led to believe.\n\n","date":"December 10, 2014 at 12:30 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175568","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"\nWhat’s the temperature of this template?\n\n","date":"December 10, 2014 at 2:13 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175585","author":"anoxie","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"And why, exactly, would the hoaxer care about how superficial the scorch was, to go through serial imprinting of wads of llinen?  A heavy scorch would not fool anyone, but a light scorch would?  Through what thought process would the hoaxer be trying to lead the Bishop, Cleric, Common-Man?  At what point would the hoaxer have known he was finished?  Maybe he did some polling?\n\n","date":"December 10, 2014 at 2:43 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175589","author":"Nabber","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"There seems now to be an element of barrel scraping in your objections, Nabber, if you don’t mind me saying. The validity or otherwise of a particular image-forming mechanism that may or may not match the TS image hardly hangs on whether the perpetrator was confident or not in fooling all the people all the time (he certainly wasn’t successful where that Bishop Henri de Poitiers was concerned).\nWhen in doubt, look at what happened, not what might have happened in an imagined  worst case scenario. After a lengthy period – some decades of being banned from display we’re told – the TS gradually acquired, if not credibility as a genuine relic, at least respect as an unusual, and indeed unique item of devotional art. \nHow was that acceptance achieved? None of us can hope to read the medieval mind, and it’s unfortunate, indeed curious, that we don’t have an ample written archive that would attest to pilgrims’ reactions on first encountering the TS. But we do have that of the Bishop of Geneva in 1614, St.Francis de Sales, with his profuse references to sweat and blood. That gives a clue MAYBE to the increasing success of the TS over the decades and centuries – that folk of that era scarcely gave its provenance and/or authenticty a second thought. Why? Because they were told it was the imprint left by Jesus on Joseph of Arimathea’s linen? If they asked what was the nature of the imprint, might not the answer have been: “Well you can see the blood. Use your imagination: that  would not have been the only bodily fluid that would leave that faint imprint you see before you. Have you forgotten something maybe? Veil of Veronica? Sudarium? Sweat cloth?”\nFor the body image to be accepted as one left by sweat, and subsequently mellowed for 13 centuries, then a faint scorch from a template may well have been seen as the optimum solution, despite a hefty investment in R&D to get things right. So yes, the plan may well have stipulated a light scorch, in preference to a heavy one, especially as a multitude of scourge marks (372 we are told) and other blood stains would have helped to define what otherwise might have been a inconspicuous ghost-like image. Get the blood right, and that same insubstantial image becomes a big selling point, through being under- rather than  overstated.. \nSeen as an engineering project, the TS was pure genius.Who can doubt that when you hear modern folk exclaiming how its subtlety and haunting imagery grows on them?\n\n","date":"December 10, 2014 at 3:35 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175596","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"That’s so much better, OK. Now instead of insulting him, you have given Charles a challenge. Scientists like challenges! (Not sure about Historians…)\n\n","date":"December 10, 2014 at 11:15 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175550","author":"Hugh Farey","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Scientists like challenges? How nice. Make an exact reproduction of the Shroud, with all the characteristics it has.\n\n","date":"December 10, 2014 at 11:39 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175554","author":"Louis","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"We’re working on it, Louis, using heated crucifixes, dead rats, pencil sharpeners, myrhh resin, frankincense, ammonia, dextrin, saponaria, urea, bleached linen, unbleached linen, iron oxide powder, flour and madder root, to name but a few. We’ll get there in the end!\n\n","date":"December 10, 2014 at 11:57 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175558","author":"Hugh Farey","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"If there is any end.\n\n","date":"December 10, 2014 at 12:04 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175560","author":"O.K.","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Good to hear that, Hugh. Since another hand on examination is not possible, due to the mess that is the realm of Shroud studies — see the thread “Remembering Ray Rogers at the Saint Louis Conference” — we have to work with whatever information is available to us. Qualified science teachers like you are needed here and what you say will have to be tackled by those who understand science.\nI have done my part in history, debunking the Jesus in a Kashmir tomb and Jesus in a Talpiot tomb hypotheses. More material will be added to the latter next year, but not before I upload something more on science with the help of scientists. You will then be welcome to comment.\n\n","date":"December 10, 2014 at 12:12 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175563","author":"Louis","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Get there in the end? That’s putting a lot of faith in science.\nFor me science is great but will only ever be able to explain up to a point.\nThere’s so much we’ll never know\n\n","date":"December 11, 2014 at 4:09 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175664","author":"Thomas","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"No, historians are always up for a challenge although we never have the precision in our evidence that scientists often insist on before  they make grandiose claims.\nInventories show that there were thousands oF painted medieval linens. I quoted from an English study InYork that showed many simply within one city . Yet as the author of  that report said there is not a single painted medieval cloth extant from the whole of medieval England.\nWhy?  It was because the attrition rate was enormously high. As I have repeated on numerous occasions the technique of painting on medieval linen was to seal the outer fibrin of the cloth with a gesso and then apply  a primer or paint. As many of these cloths were used as hangings , banners or flags it was vital that they were not starched up but they still had to be sealed so that the pigments did not penetrate through and make it difficult to have a different painting in the other side. A very difficult balancing act and the gesso appliers  must have taken years to learn their skill. It was ,of course, vital to have a relatively dense weave, similar to that of the Shroud,or otherwise the surface of the gesso would not hold.\nThe problem was that the pigmented surface fragmented very easily. And so we read of hangings that were guasto, worn out and needed replacing. Most must have simply been thrown away when the images became too faint.\nIf you google , ‘ calcium carbonate gesso’  you will find that calcium carbonate is  indicative of gesso. My professor felt that what Adler and Heller found was also indicative of animal proteins such as one might expect from, say, a rabbit skin glue or similar glue. The extent and ‘largeness’ of the carbon carbonate is described in the STURP physics and chemistry paper but I am not near my office to check it. (Hugh usually has such facts at his finger  tips!)\nSo you have good evidence for the base. You then need to move on to the many depictions and descriptions of the Shroud as it was from the fifteenth century onwards with. A very rich collection of depictions exist from between 1578 and 1703 when for reasons that are not clear, expositions began to fall off. We really do need a full data base of these so that there can be intensive scholarship applied to them. It may well be that the images became fainter so that the crowds of 70,000 that are recorded at some expositions could no longer see them and so there was not so much point  in having an annual exposition. Today the images can not be seen close up and the Shroud had to be framed to prevent further damage to its surface.\nThere is a remarkably high coincidence among different artists over 150 years that show features that have now disappeared, thumbs, long hair at the back, a Crown of Thorns in place ( and this is confirmed by observers who also described it). It is hard to know how these could not have been painted.\nIt is not part of my argument that there has to be remaining pigment any more than the very shadowy formerly painted images on the Zittau Veil have any remaining pigments. I expect that once a pigmented surface began to disintegrate it fell off pretty quickly. Yet both McCrone and STURP found some pigments, McCrone thought that they were part of the original painting, STURP had the idea ,that I must admit I find unlikely, that somehow  pigments fell into the cloth when other paintings were being applied to it but somehow did not fall off again when the shroud was displayed.\nWe know that medieval painted linens, if extraordinarily rare today, were very common in medieval times. So that when one finds shadowy images like that on the Shroud and compares them to the. Images of  the Zittau Veil that we know for certain were painted, as many of the painted panels survive alongside those that have lost their pigments, then we have a plausible reason for believing that the Shroud was originally painted.\nI remain totally unconvinced by alternative explanations for the images. They seem wildly speculative. I am conservative by nature and prefer to work within the context of image making in linen that was the most widely used. Why abandon it if no coherent alternative can me suggested. (I will leave those who still want to argue about how the images were created if not through an original painting to get on with their speculations.)\nSo the challenge is on to refute me!\n\n","date":"December 10, 2014 at 11:59 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175559","author":"Charles Freeman","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"How much calcium carbonate? And is gesso the only place we can find calcium carbonate in nature? Did they use anything in the gesso that can cause acid to form? Doesn’t rabbit skin glue cause the gesso to crack with age and smell badly? Any reports in history of cracks in the Shourd?\n\n","date":"December 11, 2014 at 9:18 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175709","author":"John Green","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Calcium carbonate is, of courses, natural but when you find it spread across the surface of a piece of cloth, the context is most likely one where it was used to seal the cloth- I leave it to you to suggest alternative explanations. If Hugh has a copy of the physics and chemistry of the Shroud report to hand I am sure he can elaborate on the STURP findings. I am away from my big pile of printed out Shroud articles\nRabbit skin glue was the most common ‘glue’ to mix with the calcium. As people are still using it with calcium carbonate to seal linen before painting in it, I guess the smell cannot be too bad. But try googling ‘ rabbit skin glue’.\nThere have apparently been some experiments with painting on linen and then folding and unfolding the cloth to see how long the pigments survive. It will be interesting to see whether the pigments simply fragments or whether the surface cracks but I haven’t a reference to the experiments.\n\n","date":"December 11, 2014 at 11:39 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175719","author":"Charles Freeman","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Charles \nHugh was kind enough to anwser the question of how much calcium carbonate is on the Shroud, less than an oz. So tell me how much calcium carbonate is used to make an oz of gesso?\n\n","date":"December 11, 2014 at 1:32 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175726","author":"John Green","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Charles: “So the challenge is on to refute me!”\nThis has be done many times.\nFor example, STURP has shown that there is absolutely NO trace of protein (nanogram level) on the Shroud,except in the bloodstains.\nThis is the KEY.\nNo protein= no gesso\nThe presence of calcium does not prove anything.\nIn fact, the process of converting flax to linen, as described by Adler and Heller (” During this process the natural ion exchange properties of cellulose operate and two ions found commonly in natural waters that most strongly bind in this way are Ca and Fe …”) simply explains the presence of calcium (and Iron) on the whole shroud.\nI have verified (in the scientific literature) that the process of ion exchange truly exists. \nToday, the experts in old fabrics widely use the modern scientific tools.\nYou have many scientific data, mainly from STURP.\nYou failed to use them, or more exactly you used wrongly some of them.\n “Calcium carbonate is, of courses, natural but when you find it spread across the surface of a piece of cloth, the context is most likely one where it was used to seal the cloth- I leave it to you to suggest alternative explanations”.\nYou have the answer in Adler and Heller’s paper. In addition, since the same was found for Iron, does the gesso hypothesis explain that ?\nI have seen that you failed to precisely answer to my previous questions.\nCould you please answer to these questions:\nIn your hypothesis:\n1) How do you explain the lack of any kind of protein on the Shroud (except in the bloodstains) ?\n2) How do you explain the distribution of Iron ?\n\n","date":"December 11, 2014 at 3:55 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175751","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Where are the medieval 3×1 herringbone linens stored at V&A? if we see them a long story can be cut short.\n\n","date":"December 10, 2014 at 12:38 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175572","author":"Louis","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Their numbers are 7027-1860 and 8615-1863. As they are stored away and not on display you have to make a special application to see them. Although my wife once worked in the V and A textile department ,I have not got round to it as I would need to take an expert with me to get most out of a visit.\n\n","date":"December 11, 2014 at 7:20 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175690","author":"Charles Freeman","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Were you aware Charles that the original Stonehenge was painted in patriotic colours? \n\nUnfortunately, owing to the depredations of time, the pigments have all detached and been swept away by westerly gales. All we are left with now is that drab grey stone. Pity.\nBtw: it’s also rumoured that they ran out of white paint and left the job unfinished. Either that, or they got bored and went off to the Stone Shifters Arms for a jar or two of the local scrumpy, and were never seen or heard of again.\n\n","date":"December 11, 2014 at 7:38 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175691","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Thank you Colin. You learn something every day. I thought the pillars were French and the painting was the  fleurs-de-lis.\n\n","date":"December 11, 2014 at 7:47 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175694","author":"John Klotz","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Ah yes, John, that neighbouring tribe across the Channel. They had many fine qualities, Sadly, the same could not be said for their descendants, who shamelessly stole our initial blueprint (correction, red, white and bluepriint) for the Union Jack.They then proceeded to add insult to injury by giving it a franglais name (le tricolore, or something equally cringe-making). \nNever mind. An alternative less boring design was finally found, after first rejecting some slightly inferior options (stars and stripes etc).\n\n","date":"December 11, 2014 at 8:15 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175697","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Colin has again got it only partially right.  MS Windows Stonehenge depiction has been my monitor screen wall-paper since ever I can remember, so I’ve had occasion to study it in great detail.  The pareidolia of giant-size facial images of the first construction engineers are clearly visible, and doubtless the true remnant of the original painting,  However it is conceivable that they may have been subsequently over-painted with the tricoleur.  \nNZ is currently going through a navel-gazing phase of changing its flag and scrapping the corner inset colonial based Union Jack, thus avoiding confusion with the Australian flag.  One of the more risible options is the stylised sports team silver fern on a black background, at a distance indistinguishable from a white feather, the skull-and-crossbones, or the ISIS emblem.  If it comes to pass, it is certain to provoke a CIA investigation and the ANZUS treaty will once again be under threat.\n\n","date":"December 11, 2014 at 2:00 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175729","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"I have not read the answer to my questions. \nI don’t understand what you mean with “encoded 3D information”. \nThe eyebrows are the most coloured part of the face (with the nose and the moustache).\nThe area surrounding the eyelids is white (not coloured). It is a circular area. \nWhere was placed the shroud to produce a hollow of more than five cm. between the eyebrows and this strange orbital area? (The same reflection on the calves and other parts of the body). \nHow is possible that Jumper and Jackson were able to determinate the correlation colour-distance without these “subtle” distortions and without any flat area nor a wrinkle of the cloth? See  here the position of the Shroud according Jakcson and Jumper: htps://lh6.googleusercontent.com/-Qvl8Rzw4Cjo/UP-aikFIJzI/AAAAAAAABNg/UnmqfSDmd-4/s400/jacjumperret.jpg \nNo. The “perfect 3D effect” is a myth sometimes surrounded of an empty terminology as “subtle”, “encoded”, etc., that means only beliefs and not facts.\n\n","date":"December 11, 2014 at 3:11 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175658","author":"David Mo","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"\n\n","date":"December 11, 2014 at 3:16 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175659","author":"David Mo","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Schwalbe et al. (Physics and Chemistry of the Shroud of Turin) give a uniform distribution of 200 micrograms / cm2 for Calcium. If this refers to atomic Calcium, and the Calcium is all combined in Calcium carbonate, then it represents about 500 micrograms of CaCO3 per cm2, or about 24 grams of chalk scattered over the Shroud.\n\n","date":"December 11, 2014 at 1:18 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175723","author":"Hugh Farey","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Interesting Hugh. This link gives the mass of chalk in 1 metric teaspoon (nice homely unit, easy to visualize) as 12.5 grams:\nhttp://www.aqua-calc.com/calculate/volume-to-weight\nSo 24 grams of chalk is just 2 teaspoons full approx on the entire TS.\nIt’s hard to imagine that amount, or even 10 times as much, being able to plug the pores of the fabric sufficient to prevent penetration by paints.\n\n","date":"December 11, 2014 at 2:04 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175731","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"John, bear in mind that it is Charles’s contention that most of the gesso has been scraped off, or fallen away, so the small amount left on may not be incompatible with his argument.\n\n","date":"December 11, 2014 at 2:06 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175732","author":"Hugh Fareyn","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Colin, you chump, most of it has fallen off as the pigments have.The question is why was it there in the first place!\n\n","date":"December 11, 2014 at 3:17 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175744","author":"Charles Freeman","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"So how come there’s so much blood still there, Charles, given the propensity of pretty well everything else – paint pigments and now gesso – to fall off?\n\n","date":"December 11, 2014 at 3:27 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175745","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"The blood, probably vermilion as this was the normal pigment for blood used by medieval linen painters, is the only paint known to have penetrated through the cloth of the Shroud,cf the penetration of red madder on the Zittau Veil. Obviously anything that penetrated through the outer fibrils, presumably because it was in a very fluid form, is going to leave more traces when compared to the pigments that did not penetrate the gesso and so remained vulnerable on the very surface.\n\n","date":"December 11, 2014 at 3:36 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175748","author":"Charles Freeman","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"STURP called these ‘ large quantities, probably natural calcium carbonate’ and it. is also important that they were found to be uniformly distributed. They certainly needed to give a better explanation of the uniform distribution than merely ‘ dust accumulations’. Anyone prepared to have a better explanation?\n\n","date":"December 11, 2014 at 3:31 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175746","author":"Charles Freeman","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Less then an oz sound like dust to me. Remember this is over a time span of at least 600 hundred years.\n\n","date":"December 11, 2014 at 3:46 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175750","author":"John Green","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"I’d be interested to know how STURP arrived at the conclusion it was calcium carbonate, as distinct from calcium something else. Might that have been one of those inspired guesses that qualifies for the description “neat, plausible and wrong?”?\nThe obvious candidate for the something else is pectinates, i.e. the salt form of pectins that are known to bind large amounts of divalent ions like calcium and magnesium. Admittedly retting is primarily about digesting away substantial amounts of pectins from the middle lamellae of flax fibres, a process known to be aided by chelating agents that strip out the calcium, but I wouldn’t be surprised to be told that 10 grams total calcium per Shroud was entirely consistent with the undigested pectin.\n\n","date":"December 11, 2014 at 4:16 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175754","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Schwalbe reports that while Morris, who did the spectrographic analysis, thought the calcium was in the form of carbonate, Heller and Adler “postulated that the calcium and strontium were absorbed into the linen during the retting process”, so I don’t think STuRP as an entity really arrived at any conclusion.\n\n","date":"December 11, 2014 at 5:32 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175765","author":"Hugh Fareyn","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Thanks Hugh. I’m more inclined to think the calcium was there in quantity before retting, \nMicrobial digestion of the metal-sequestering agent (pectins) would make the initially bound calcium etc go into solution, so there would be less calcium after retting, not more.\n\n","date":"December 11, 2014 at 5:41 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175767","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"If most of it fall off so would the image. Can you explain how could the base fall off, and the image was painted on the base how could the image still be there?\n\n","date":"December 11, 2014 at 3:36 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175749","author":"John Green","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Well, we would need  to ask the conservators of the Zittau Veil that has similar ghostlike images after the pigments came off- in this case because of steam. Remember we are talking about paint in place for several hundred years- the Zittau Veil was intact for almost five hundred years and there is some indication from a depiction of the Shroud in 1868 that one of the images had deteriorated very badly by then.( See illustration in Beldon Scott – and I can’t take any Shroud researcher very seriously if they don’t have a copy).\nSo you have light shining on the images over hundreds of years and then the pigments fall off. I don’t know but I would assume that the cloth underneath would be discoloured according to the thickness of the pigments that had preserved the cloth from the effects of light. So while some features of the original painting ,especially those that had been painted into to an existing painted surface, might disappear without trace, others ,in particular the outline of the figures would be clearer. But we would need an expert who had worked on the conservation of painted linen to tell us\n\n","date":"December 11, 2014 at 4:04 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175752","author":"Charles Freeman","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"‘Eastlake noted that tempera and watercolour paintings on linen were common in England and Germany in the 14th century. (CF. I am not sure why they didn’t use someone more recent than  Eastlake!). Unfortunately(!!!) ,we have not examined any of these and have no basis for comparison with the Shroud image.’ STURP. Report, p30-1 PDF version.\nThey didn’t even ask anyone who was expert In medieval linen painting ( and it is clear from reading the early part of the report that the Idea that this might be the remnants of earlier images did not even occur to them!!). When you know what the most common form of making images on medieval linen is and you don’t even examine similar cases for comparison, this is clearly a limited report. Admittedly  we did not have the Zittau Veil conserved until the mid 1990s so a painted linen with many of its panels decayed was not there for comparison but you would have thought they would have made SOME effort.\nIf you research medieval pigments you will find that there were many used with different make-ups according to where the minerals or plants were gathered. Where STURP went wrong was not even to make the effort to talk to someone who knew about the variety of pigments used. Actually what is most interesting about the STURP report is how they only consulted within their own group as if they had a monopoly of expertise in iconography ( those all over scourge marks not related to their first appearance in iconography until after 1300, something that they would have been told if they had consulted any art historian specialising in Passion iconography ), weaving (the width of the Shroud is typical of a medieval treadle loom, cf the sections of the Zittau Veil), and painted linens.\nIn fact,they chose to disregard examining all the areas that suggest that the Shroud is medieval. Perhaps this is just the narrowness of specialisms but you would have thought they would have asked someone about how the Shroud might have been woven. Knowledge of the fit with a medieval treadle loom,although not absolutely conclusive, might well have saved them the expense of hauling that equipment all the way to Turin in the hope of finding something pre-medieval – which,of course, they found no  evidence for. \nSo they left us with the Shroud as some kind of mystery when there seem to be perfectly coherent explanations. They ,or those close to STURP, also put forward the idea that the Shroud is either authentic or the work of a forger. Again, with no one on the team knowing anything about medieval relic cults , they failed to realise that many objects acquired spiritual status usually due to associated miracles. If you look at the gospel accounts and the representations of Christ’s burial shroud that worshippers would have seen on the walls of churches, no forger would have tried it on with a large double image cloth. They did get away with the Cadouin Shroud that  had no images on it and was similar to the representations of Christ being laid on a single sheet which is why that was  the most popular of the burial shroud shrines.\n\n","date":"December 12, 2014 at 3:21 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175851","author":"Charles Freeman","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"In this “probably vermillion”, I’m curious as to how one explains:\n1. Where did the mercury go (elemental analysis, x-ray data)?\n2. Why would hemoglobin, serum albumin, and immunoglobulin be present, as detected by chemical, immunological methods?  Were these added in as thickeners?\n3. Halo rings around a number of bloodstains, as revealed under uv?  Does using vermillion naturally give this or do you have to add this in separately?  Why add this detail, even if just to a few?  What substance was used for this?\nIn the American Chemical Society Advances in Chemistry 1984 article with multiple co-authors, received for review Oct 1982, accepted for publication April 1983, one will find a balanced, objective, scientific approach investigating the possibilities of what the various stains and images on the Shroud might and might not be.\nFrom a scientific standpoint, the gesso-vermillion hypothesis is simply too flaky\n\n","date":"December 11, 2014 at 5:51 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175772","author":"Kelly Kearse","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"“From a scientific standpoint…”\nDiscussions have been drifting away from science for a while.\nAnd the topic of this post was scorching pillow cases, “published evidence”.\n\n","date":"December 12, 2014 at 1:14 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175830","author":"anoxie","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Different micros copyists with varying levels of expertise have come up with different opinions as to whether there is vermilion on the Shroud. It is only the most likely pigment used for blood but red madder may be an alternative.\nWe desperately need 2014-2015 microscopy and the help of an expert on medieval pigments- a very complex area as I have already suggested as the  ‘mix’ depended where you got your minerals from.e.g calcium carbonate was used in gesso north of the Alps, calcium sulphate in gesso south of the Alps. So far as I know no independent authority on pigmentS  has yet considered the minerals found by the range of microscopists who have researched the possible pigments still extant on the Shroud.\nIt is the lack of alternative solutions that seems to be the big problem. Most of these seem wildly more flakey than a simple case of a decayed medieval painting, something that, in comparison to the alternative solutions, is well  documented as existing. Most decayed linens were thrown away when the images faded ( note the very small second hand value of painted linens in the York study)  but the Shroud was preserved and we should treasure it for that reason( as well as,in my opinion, its original function as an object of veneration in the Quem Queritis ceremony).\n\n","date":"December 12, 2014 at 3:57 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175858","author":"Charles Freeman","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Hi Kelly,\nNice to read you here again!\nBut don’t expect any precise answer from Charles.\n“Different micros copyists with varying levels of expertise have come up with different opinions as to whether there is vermilion on the Shroud.” is the only kind of vague answer you will obtain from Charles.\nFor example, I am still waiting for his answer to the question of lack of any kind of protein on the Shroud (except in blood stains)\nUnfortunately, Charles is “stuck” to his hypothesis despite the many scientific proofs of its falsity.\n\n","date":"December 12, 2014 at 3:19 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175947","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"“From a scientific standpoint, the gesso-vermillion hypothesis is simply too flaky.”\nAwesome.\n\n","date":"December 11, 2014 at 6:40 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175780","author":"Nabber","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"No Mercury found so definitely it is not vermillion.\n\n","date":"December 11, 2014 at 9:12 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175796","author":"Sampath Fernando","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Things are more complex.\nRead:\nhttp://www.shroud.com/pdfs/thibault%20final%2001.pdf\np. 18-20\n\n","date":"December 12, 2014 at 3:23 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175948","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"Have just re-read Charles’s article. Am I not mistaken in thinking that in his section on gesso, he has sealant confused with mordant – or at any rate uses the two ideas interchangeably. I have bolded the “sealant”-related words, and used italics for the “mordant”-related words? \n“In its report on the physics and chemistry of the Shroud, STURP discussed the possibility of it having been painted but, amazingly, admitted it had not actually examined any paintings on linen. However it did report that ‘colour does not penetrate the cloth in any image areanor is there any evidence for cementation between fibers or capillary flow of liquids’. This was an important observation, even if, due to the team’s lack of specialist knowledge, the authors of the report, Ray Rogers and L.A. Schwalbe, failed to grasp why. Before linen can be painted, a sealing layer of gesso, a binding mixture, needs to be applied, so that the paint can have a surface to stick to.  It was a skilled job as, if the gesso penetrated below the surface, then the flexibility of the cloth would have been lost, an important consideration when a flag needs to flutter in the wind or a cloth is dramatically unfurled. The gesso must cover just the outer fibrils of the linen The details of how to apply it are to be found in the Libro dell’Arte, an advisory manual compiled in the early 15th century by the Tuscan Cennino Cennini. The crucial point is that the gesso has to be applied, not with a brush, but with a knife so it can be put down and scraped off. ‘The less gesso you leave on, the better it is, just so that you fill up the interstices between the threads’, advises Cennini. Over time the gesso surface will have fragmented on the Shroud but arguably this is the brushless outer layer that the STURP team found. (The layer appears to be consistent across both images and across skin, hair and beard.)”.\nReminder: Sealants plug the interstices, preventing paint from being soaked up too rapidly as if on blotting paper. Mordants are needed when dyes fail to bond well to fabric, or when paint, usually oil paint, fails to transfer well from brush to canvas. But the TS appeared prior to arrival of oil paints in Europe (15th century?). If it had been painted it would have been a tempera medium, e.g. egg yolk tempera, when there’s no obvious need for a mordant, being essentially water-based (the fatty components of which are well dispersed, thanks to the amphipathic properties of phospholipid-coated micelles)\nSo what purpose did your semi-conjectural chalk gesso serve, Charles? Sealant or mordant? That needs to be established before one can comment constructively.\n\n","date":"December 12, 2014 at 6:08 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175876","author":"Colin Berry","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"No worries-I’m probably the only one who noticed you didn’t respond specifically to the questions-similar to those raised previously, esp. no protein = no gesso = no mas.\nKeep results that agree, discard those that don’t.  Same old, same old.  No interest in beating a dead rabbit\n\n","date":"December 12, 2014 at 6:37 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175880","author":"Kelly Kearse","site":"shroudstory"},{"title":"Should we be rethinking the VP8 and 3D images?","post":"TH wrote: \n“But don’t expect any precise answer from Charles.\n“Different micros copyists with varying levels of expertise have come up with different opinions as to whether there is vermilion on the Shroud.” is the only kind of vague answer you will obtain from Charles.\nFor example, I am still waiting for his answer to the question of lack of any kind of protein on the Shroud (except in blood stains)\nUnfortunately, Charles is “stuck” to his hypothesis despite the many scientific proofs of its falsity.”\nYes-anyone can try on a lab coat and talk in nonspecifics-I was being facetious when I mentioned I was probably the only one who noticed-very transparent when multiple layers of triple-speak are used to avoid giving a direct answer to specific questions/detail, especially in a scientific context.\n\n","date":"December 12, 2014 at 5:58 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","id":"comment-175969","author":"Kelly Kearse","site":"shroudstory"}]
