[{"title":"Speaking of 3D","post":"While I am not crazy about OK’s insistence on bright contour colours, he is perfectly correct that to overlay a supposed 3D construction with an actual image tells us very little, objectively, about the accuracy of the construction or the precision of the intensity/distance relationship. It is astonishing what our brains will interpret as accurate, in spite of extremely vague clues. I have no doubt that if Soons’s work was presented in greyscale, it would look very odd indeed, just like all the others, and it is significant that his head does not turn very far in either direction. Try putting a screen-grab of the image above into ImageJ and greyscaling it. Even as it stands, I think I can detect a massive hole in the right jaw area, and the distortions from reality become even more obvious if you use one of the 3D images requiring magenta and cyan glasses, which can be found on Soons’s website.\n\n","date":"June 8, 2014 at 8:59 am","url":"https://shroudstory.com/2014/06/08/speaking-of-3d/","cat":"3d","id":"comment-127753","author":"Hugh Farey","site":"shroudstory"},{"title":"Speaking of 3D","post":"Hugh, do you mean grayscale or a single shade of gray — at least in the sense used by ImageJ. Grayscale, they do not make clear, is basically the the “original image” converted to black and white. By using, grayscale (in this sense of the word) we still “overlay a supposed 3D construction with an actual image,” only we have eliminated color. By using gray or any single color and shade (one RGB value) we get a solid isometric plot of the brightness and with the addition of artificial lighting and whatever viewing angle we choose, we see 3D. The different shades are from highlights and shadows. Colin is writing some addenda and if you look at it — all though he calls it monochrome — you can see it is still just a 3D enhancement, an overlay, so to speak — a black and white of the same thing. At some point we are all going to need to come to terms with terminology.\n\n","date":"June 8, 2014 at 11:49 am","url":"https://shroudstory.com/2014/06/08/speaking-of-3d/","cat":"3d","id":"comment-127773","author":"Dan","site":"shroudstory"},{"title":"Speaking of 3D","post":"Not in my ImageJ it isn’t, well, not quite. A black and white copy of the shroud is covered in small imperfections that are presumably evened out by the smoothing process. The ‘Grayscale’ that they offer has none of those, and is presumably what you get as a result of the smoothing. If you smooth the 3D image to about 70% and look at the Greyscale, you get a meaningless blur of indistinct hills and valleys. If you revert to ‘Original Colours, then suddenly you get quite a good 3D image of a face, because the original precision, projected onto a fairly formless lump, is enough to fool the eye into thinking the 3D image is as precise as the photo.\n\n","date":"June 8, 2014 at 4:59 pm","url":"https://shroudstory.com/2014/06/08/speaking-of-3d/","cat":"3d","id":"comment-127815","author":"Hugh Farey","site":"shroudstory"},{"title":"Speaking of 3D","post":"Remember that in ImageJ (or VP8 or any other similar software or device ) it is in fact very hard to obtain realistic looking mold of human face or body using Shroud images, simply due to the scaling relations (which are irrelevant to the cloth distance-intensity correlation, which is the key of the so called 3D effect). Depending on Z-scale parameter, the mold of the face can be too much extended, or resembling bas-relief.\nVisual assesment can be very misleading. I think the best way is still using ‘Thermal LUT’ and color scale. It is quite objective.\nNevertheless, one can obtain quite interesting results. One day I’ll show something interesting that I did some time ago\n\n","date":"June 8, 2014 at 5:18 pm","url":"https://shroudstory.com/2014/06/08/speaking-of-3d/","cat":"3d","id":"comment-127821","author":"O.K.","site":"shroudstory"},{"title":"Speaking of 3D","post":"I think the person best able to address the 3-D attributes of the Shroud is Ray Downing, who is generally very skeptical of “shroud science”.  I had dinner with him and his wife Maria at an event near Albany, NY about a month ago.  In fact, the one compelling piece of data that would cause him to consider the Shroud’s possible authenticity is the apparent distance information that appears to be encoded into the image.  The only reason he was able to extract a 3-D image from a flat surface without distortion is because the information or data is there…in other words…it must have wrapped a real human form for that to be possible.\n\n","date":"June 9, 2014 at 6:16 am","url":"https://shroudstory.com/2014/06/08/speaking-of-3d/","cat":"3d","id":"comment-127935","author":"Russ Breault","site":"shroudstory"},{"title":"Speaking of 3D","post":"Ray Downing has done a fascinating job, but the balance between objective and subjective interpretation is not clear. That there is no direct correlation between intensity and distance is abundantly shown by simple 3D imagers such as the VP8 and ImageJ – and even they require a level of smoothing and z-axis adjustment which must be judged by the viewer. To create the three dimensional grid that Downing based his model on requires a great many assumptions and subjective overrides which it would be interesting to know. The first would involve deciding what exactly is meant by the cloth/body distance. The VP8 and ImageJ work from a horizontal plane, the darker the further. To get anything like a real head shape we have to assume that the shroud was in contact with the body at the hair, eyebrows, nose and beard (or at least equidistant from them) and so the cloth/body distance depends on the shape of the shroud. This shape has been brilliantly explored by Jackson, Lavoie, Latendresse and others, but is, in detail, quite subjective, as every time a sheet is placed over a body it adopts a slightly different drape. Following on from that, the problem of what to do about the folds of the drape, where there is too much cloth to fit neatly over the contours of the face, must also be considered, and this too is mostly subjective. Then there is the algorithm used to remove all the weave patterns and the various darker or lighter stripes that may be due to the bleaching process of the original flax fibres and the bloodstains. This too depends on the eye of the processor much more than on the unthinking soul of the computer…\nBasic 3D information: yes.\nAn objective representation in 2D of the head of Jesus: not yet.\n\n","date":"June 9, 2014 at 9:06 am","url":"https://shroudstory.com/2014/06/08/speaking-of-3d/","cat":"3d","id":"comment-127964","author":"Hugh Farey","site":"shroudstory"},{"title":"Speaking of 3D","post":"Russ,\nI had lunch with Ray Downing in Manhattan a few years ago. He brought with him a lenticular print of the face which he handed to me. “What’s wrong with it?” he asked. It was clear. The image resolution was wonderful and you could actually see the herringbone pattern on the face. On the face, curving around the cheeks, and so forth. It was clearly the overlay problem, what we encounter in ImageJ when using the Original Color option. \nWe talked for a long time. I have not doubt that he extracted 3D information from the image. But I don’t know how. Smoothing to reduce the effect of the weave, banding and all manner of noise including bloodstains? Was the brightness to distance relationship linear or curved? What assumptions were made about the cloth?  To be considered evidentiary,his work must be documented enough to allow questions and criticism. Anyone with the necessary skills should be able to repeat his work precisely and get the same results. That knowledge, ideally, might  lead to new thinking about how the images were formed. \nDid the cloth wrap a body. Probably! That is a reasonable conclusion. It is reasonable unless the image was faked. Colin Berry has proposed that the cloth wrapped a hot statue. He is a good chemist and he does not believe that his hypothesis has been proven unworkable. Many people would agree with that. And what artistic method have we not thought of? We have yet to here from Joseph Accetta yet. Maybe he is onto something. Frankly, I’m quite convinced that the cloth is not from the medieval era in Europe. But what about the early church era in parts of the Byzantine empire. Could there be some artistic method that we don’t know about? The best I can really say is it probably wrapped a body. I believe it did. Moreover I believe it wrapped the body of Jesus. Evidence suggests those beliefs. But beliefs are just that: beliefs.\n\n","date":"June 9, 2014 at 10:03 am","url":"https://shroudstory.com/2014/06/08/speaking-of-3d/","cat":"3d","id":"comment-127974","author":"Dan","site":"shroudstory"},{"title":"Speaking of 3D","post":"“When a hot template is put in contact with a linen fabric, the pectin “glue” (middle lamella) that is found elsewhere at the surface and between the fibers is immediately colored and this is the main source of the color in a light scorch. This fact would have been obviously discovered by the STURP team (and particularly by Rogers).”\nhttps://shroudofturin.files.wordpress.com/2014/04/scorch-2-eng-final.pdf\n\n","date":"June 9, 2014 at 12:25 pm","url":"https://shroudstory.com/2014/06/08/speaking-of-3d/","cat":"3d","id":"comment-127994","author":"anoxie","site":"shroudstory"},{"title":"Speaking of 3D","post":"One looks forward to seeing photographic evidence (as distinct from schematic diagrams) that show full width coloration of “lightly scorched” threads. It’s not something I’ve seen myself, but maybe my technique is different.\nIn the meantime, I don’t think too much reliance should be placed on suppositions that the STURP team, Rogers included, were bound to have spotted this or that. Chemist Rogers said next to nothing about the chemical heterogeneity within flax fibres, describing them for the most part as cellulose, with scarcely a mention of pectins and hemicelluloses.\nThe middle lamella pectins could be a new paradigm, thanks to Thibault. There again, they could be a time-consuming distraction until proved to be the prime site of  model template-scorching via something other than light microscopic examination of threads in LS. Cross-sectional (TS) photomicrographs are needed to lend credence to the “schematic diagrams”.\n\n","date":"June 9, 2014 at 5:45 pm","url":"https://shroudstory.com/2014/06/08/speaking-of-3d/","cat":"3d","id":"comment-128037","author":"colinsberry","site":"shroudstory"},{"title":"Speaking of 3D","post":"Dan ~ Why don’t you ask Petrus so you can understand what he did?\n\n","date":"June 9, 2014 at 11:05 pm","url":"https://shroudstory.com/2014/06/08/speaking-of-3d/","cat":"3d","id":"comment-128089","author":"Andy","site":"shroudstory"}]
