[{"title":"What Do We Really Know About Volckringer Patterns?","post":"On the Slide 15 3-D Image you can see the right eyeball of Jesus (left eye looking at it).  As I was staring at this photo some time back when it was 1st shown on the Internet  The image seemed to grab me mentally – that is when I heard the voice of my Guardian Angel tell me that I was  ” looking at the image of the live Jesus Christ”.\n\n","date":"September 4, 2015 at 4:58 am","url":"https://shroudstory.com/2015/09/04/what-do-we-really-know-about-volckringer-patterns/","cat":"3d","id":"comment-209571","author":"Emmett McMahon","site":"shroudstory"},{"title":"What Do We Really Know About Volckringer Patterns?","post":"Strange. Again. The de Salvo paper shows a picture of the Volckringer [sic] pattern on the page that covered the plant leaf (and possibly another on the page that was under the plant), and claims that the spectroscopic characteristics of both Volckringer and Shroud image are “almost identical.” Mark Antonacci says that the Volkringer [sic] image of a plant is “imprinted usually several pages from where the plant lay” and says that plant image was brown, and not the straw yellow colour of the Shroud image.\nWhich of these sets of observations is true, I wonder? Has anybody got a copy of Volckringer’s paper? As far as I can see, all comments about Volckringer come via Barbet, and I would so much like to see the primary source…\nMeanwhile, I have found these on the web…\n\nhttps://smithsoniangardens.files.wordpress.com/2013/05/dsc_0118.jpg?w=455&h=304\n\n","date":"September 4, 2015 at 10:38 am","url":"https://shroudstory.com/2015/09/04/what-do-we-really-know-about-volckringer-patterns/","cat":"3d","id":"comment-209588","author":"Hugh Farey","site":"shroudstory"},{"title":"What Do We Really Know About Volckringer Patterns?","post":"The primary source mentioned in De Salvo’s paper is #13:\nVolckringer, J., “Le probleme des empreintes devant la science”, Paris Libraire de Carmel, (1942).  \nI suspect that the “centuries” taken for such images to form might be an exaggeration.  I recall class-mates at primary school creating images of pressed flowers in exercise books in the late 1940s, but I’m uncertain as to whether they would properly be called Volckringer patterns or not.  Finding information on Volckringer patterns seems unusually elusive.  Most of the web refs, seem to link back to De Salvo’s paper, and Encyc Brit has nothing on Volckringer at all.\n\n","date":"September 4, 2015 at 3:39 pm","url":"https://shroudstory.com/2015/09/04/what-do-we-really-know-about-volckringer-patterns/","cat":"3d","id":"comment-209608","author":"daveb of wellington nz","site":"shroudstory"},{"title":"What Do We Really Know About Volckringer Patterns?","post":"Looks like there’s only one way you’ll find a satisfying answer, Hugh.  You’re going to have to turn it into a school science project (botany classes?).  Suggested variables:  uniformity of pressing; weight of compression force, types of absorbent paper, selection of various species – grasses, ferns, flowers, seed-heads. observe clarity of any images obtained vs number of days, etc.  Wish you joy with it!\n\n","date":"September 9, 2015 at 4:15 am","url":"https://shroudstory.com/2015/09/04/what-do-we-really-know-about-volckringer-patterns/","cat":"3d","id":"comment-209938","author":"daveb of wellington nz","site":"shroudstory"}]
