[{"id":"comment-192178","author":"skeptic","post":"That is an obviously nonsensical analysis. Every single number is taken from thin air without any research. Variables that may be dependent are assumed to be independent (maybe there is a correlation between how the hands are depicted, how the fingers are depicted and so on – you can’t assume that there is none without painstaking research). Finally, I love how the author calculates probabilities for the tomb lid as if it were the shroud. None of this makes sense, sorry..","date":"2015-03-02","mins":"8:11 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192195","author":"skeptic","post":"“Unless anyone can show us that there is indeed correlation between some of the traits taken for analysis I can treat them as independent.” It’s the opposite, you can’t treat them as independent unless you can plausibly show that they are. “There are no obvious reasons for relation between any two of them.” Yes, there is: a possible iconographic tradition. If such exists, the elements would not be independent. It’s up to the author to show that such a tradition does not exist. “I see you don’t understand anything.” That’s a lovely argument. Very convincing too. So, to sum it up: 1. The author takes the numbers out of thin air (and doesn’t even try to defend this in his response). 2. The author doesn’t show that his variables are independent. 3. The author treats the tomb lid as the shroud, thereby rendering his calculations nonsensical..","date":"2015-03-02","mins":"11:02 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192246","author":"skeptic","post":"Now to the question of cut off legs: “· C –He has His legs cropped by the end of page, without any obvious reason (the same as frontal image on the Shroud) 1/100 instances.” A little research here would have delivered an obvious answer. Here are the folios: 28: http://mek.oszk.hu/12800/12855/html/hu b1 mny1 0062.html 28 verso: http://mek.oszk.hu/12800/12855/html/hu b1 mny1 0063.html Note that your image is cropped above. When we look at the complete page we see some text that was cropped above. When we look at 28v (the reverse page), we see the angel’s wing cropped a bit, and the musical notes are *too close* to the margin, which is not in accordance with most of the text in other folios, where the margins are not so narrow, e.g. Http://mek.oszk.hu/12800/12855/html/hu b1 mny1 0053.html When we look at 29v we see something similar – the text is cropped above and the margin is obviously cut off: http://mek.oszk.hu/12800/12855/html/hu b1 mny1 0065.html Also here: http://mek.oszk.hu/12800/12855/html/hu b1 mny1 0014.html So the explanation of the cut off legs is very simple: the page is in poor condition and was partially cropped. Together with the legs, the angel’s wing, text above, etc..","date":"2015-03-02","mins":"7:16 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192239","author":"skeptic","post":"OK, that was anti spam precaution..","date":"2015-03-02","mins":"6:26 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192233","author":"skeptic","post":"“I have no reason to treat those 6 traits as dependent on each other, as there are no indications of any relationship between each of them.” 1. First of all, you have only 3 traits, because the traits in the second group refer to the tomb lid (and it is very easy to prove that it is a tomb lid and not a shroud by comparing this image with other manuscripts from the 11th century onwards, where the tomb lid is mostly depicted as a flat rectangle; the angel or Jesus is sometimes depicted as sitting on the lid or with his feet on the lid; the lid often has ornamental motifs). In fact, the shroud is depicted as the cloth on the lid, case closed. Ica.themorgan. Org/manuscript/page/15/183656 ica.themorgan. Org/manuscript/page/9/77410 ica.themorgan. Org/manuscript/page/31/143915 ica.themorgan. Org/manuscript/page/4/159472 ica.themorgan. Org/manuscript/page/33/76977 ica.themorgan. Org/manuscript/page/39/77199 ica.themorgan. Org/manuscript/page/26/77470 ica.themorgan. Org/manuscript/page/20/77322 ica.themorgan. Org/manuscript/page/30/143915 ica.themorgan. Org/manuscript/page/24/133203 ica.themorgan. Org/manuscript/page/23/145554 ica.themorgan. Org/manuscript/page/8/76981 2. It’s not up to the critics to disprove you, it’s up to you to prove your case, which means going through the relevant manuscripts and icons and finding the general tendencies. If you can show that there is no iconographic tradition that has Jesus depicted in such and such state, then you can proceed to whatever calculations you can do. Otherwise you’re assuming things. But let me point you in just one direction. That Jesus is naked pretty much implies that his hands will be crossed over his pelvis, for obvious reasons. The crossed hands in Pray Codex remind one of the Man of Sorrows type, so let’s simply google for this type and see what we find for the “crossed hands” iconography: commons.wikimedia. Org/wiki/File:Akra Tapeinosis.jpg commons.wikimedia. Org/wiki/File:Colijn de Coter   Christ as the Man of Sorrows   WGA5453.jpg commons.wikimedia. Org/wiki/File:Lorenzo Monaco   Christ as the Man of Sorrows   WGA13601.jpg http://www.wga. Hu/html m/c/ceccarel/sorrows.html http://www.nationalgallery. Org. Uk/paintings/probably by jacobello del bonomo the man of sorrows fineartamerica. Com/featured/christ as man of sorrows anonymous.html http://www.betsyporter. Com/Jesus.html http://www.christies. Com/lotfinderimages/d49999/d4999986x.jpg artnow. Ru/en/gallery/200/31446/picture/0/721078.html http://www.musobl.divo. Ru/collection/tk polojenie xvi.jpg Plus a couple from manuscripts: ica.themorgan. Org/manuscript/page/19/76833 ica.themorgan. Org/manuscript/page/17/76888 ica.themorgan. Org/manuscript/page/19/76926 On all of these images from different eras, including very modern images, the thumb is either barely visible or absent. Why? I propose that with this particular position of hands it is simply natural for a master to “hide” the thumb. (Note that, of course, there are also images with very visible thumbs. But that’s not the point, the point is the abundance of images without thumbs or with barely visible thumbs). So here’s one potential correlation, which would leave you with only 2 traits, because then nakedness and 4 thumbs are not necessarily independent. I’m not stating this as a proven fact, but again, it’s up to you to disprove this by doing research. 3. Finally, you still haven’t addressed that fact that you haven’t substantiated your probabilities. Why 1 in 100 and not 1 in 20? You can only claim that after doing statistical research on the relevant material. That you claim that “those 6 features … are so rare on iconographic descriptions that no ‘iconographic tradition’ around them probaly exist” is just a claim, which it’s up to you to prove. Don’t forget: *you* are making a case here. So what we’re left with is that you basically have two traits with uncertain probabilities assigned to them. Versus the fact that the second image shows a tomb lid separately from a shroud. Which means that Codex Pray has nothing whatsoever to do with the Turin Shroud..","date":"2015-03-02","mins":"5:21 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192254","author":"skeptic","post":"For some reason I can’t reply directly to your comment, so pardon me for continuing here. “None of your illustrations show all 6 key features present in the Codex Pray.” That’s a red herring, as I have shown. First of all, you don’t have “6” features, but 3 at most, because whatever appears on the tomb lid is irrelevant to the question of the shroud. Even supposing you establish the uniqueness of the tomb lid there is still the brute fact that it’s not the shroud. But the rest of your features don’t fare much better. Cut off legs don’t count (explained in a comment above), so that’s 2. Nakedness and 4 fingers are not independent, so that’s 1… “This is is the part of the job you sceptics have done for me” Doesn’t work that way, sorry. The research is still up to you. More so if we skeptics are as wrong and inept as you think. “But not the other way, the crossed hands do not imply nudity. And nudity is the key feature here, not crossed hands (maybe I didn’t explained that in the article clear enough).” You didn’t get this one, I’m afraid. It’s not about the crossed hands. It’s about whether nudity is independent from 4 fingers. Nudity is correlated with crossed hands, that’s a fact (because nudity needs to be covered – and if not with a cloth, then with crossed hands, unless we imagine some Austin Powers like visual devices which surely weren’t in use back then ;) ). And it seems that crossed hands are correlated with 4 fingers. So it seems that nudity is correlated with 4 fingers and thus cannot be treated as an independent variable. Again, not a 100% proven fact, but the images I found are enough for a decent prior probability. It’s up to you to refute this. “Because you selected those images.” I didn’t really have to try hard to select the images, most are from the first Google Image search pages. But in any case that’s hardly an answer. Why is the thumb absent or barely visible on the images I selected? “None of your illustrations show full nudity like in the Codex Pray.” Which is relevant how? Where the images are not nude, they still have crossed hands which seem to be correlated with 4 fingers. Where the images *are* nude, they *almost necessarily* have the crossed hands, and so there still seems to be the correlation between nakedness and 4 fingers. That is, where Jesus is naked, we expect with extremely high probability that his hands will be crossed over the genital area, and with a decent probability that they will lack thumbs. “It doesn’t really matter whether 1 in 20, 1 in 100 or 1 in 1000. The point is that the chance for randon accumulation of so many scarce traits, similar to those spotted on the Shroud, is really negligible.” Oh, but it does matter. E.g. 10^ 3.9 may be small, but it is still much better than 10^ 6. (Not that I would agree with this number for the reasons outlined above.) So you still owe us the reasonable probabilities and not simply something taken out of thin air. “I took into account such possibility but the whole reasoning is totally irrelevant on that, as it doesn’t assume whether the rectangle on the lower illustration is lid or the Shroud,” Well, that’s the fatal flaw, because if what we see is a lid (and it is a lid) then none of the probabilities matter. “or anything (just the potential possibility of it being the shroud is enough).” There is no such realistic possibility. The comparative analysis with the iconography of the same era shows that the rectangle could only be a lid, while the shroud is never portrayed as a huge hard rectangle and certainly not under the angel’s feet (what is often portrayed under the angel’s feet is, again, the tomb lid). In fact, the shroud is present on both illustrations, on the top one it’s below Jesus, on the bottom one it lies on the tomb lid. This fully corresponds to the traditional iconography of the era, where the shroud takes relatively little place after the resurrection since it’s all bunched up. So there is simply no question of the rectangle being anything but the lid. If you will be consistent and apply your probability analysis to this particular issue (how many images show the shroud as a rectangle, etc., etc.), you might see this. I’m afraid that probability will be astronomically lower even that the one you have calculated above. “Besides the bench I found and on which the angel is sitting clearly disproves it being a lid:” That’s a non sequitur. Whatever the angel is sitting on has no bearing whatsoever on the rectangle being a shroud or a lid. Although I also disagree that he necessarily sits on a bench, just because there is something drawn there doesn’t mean he sits on that something. Although he might. Doesn’t make a difference..","date":"2015-03-02","mins":"8:36 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192240","author":"skeptic","post":"“I have no reason to treat those 6 traits as dependent on each other, as there are no indications of any relationship between each of them.” 1. First of all, you have only 3 traits, because the traits in the second group refer to the tomb lid (and it is very easy to prove that it is a tomb lid and not a shroud by comparing this image with other manuscripts from the 11th century onwards, where the tomb lid is mostly depicted as a flat rectangle; the angel or Jesus is sometimes depicted as sitting on the lid or with his feet on the lid; the lid often has ornamental motifs). In fact, the shroud is depicted as the cloth on the lid, case closed. Http://ica.themorgan.org/manuscript/page/15/183656 http://ica.themorgan.org/manuscript/page/9/77410 http://ica.themorgan.org/manuscript/page/31/143915 http://ica.themorgan.org/manuscript/page/4/159472 http://ica.themorgan.org/manuscript/page/33/76977 http://ica.themorgan.org/manuscript/page/39/77199 http://ica.themorgan.org/manuscript/page/26/77470 http://ica.themorgan.org/manuscript/page/20/77322 http://ica.themorgan.org/manuscript/page/30/143915 http://ica.themorgan.org/manuscript/page/24/133203 http://ica.themorgan.org/manuscript/page/23/145554 http://ica.themorgan.org/manuscript/page/8/76981 2. It’s not up to the critics to disprove you, it’s up to you to prove your case, which means going through the relevant manuscripts and icons and finding the general tendencies. If you can show that there is no iconographic tradition that has Jesus depicted in such and such state, then you can proceed to whatever calculations you can do. Otherwise you’re assuming things. But let me point you in just one direction. That Jesus is naked pretty much implies that his hands will be crossed over his pelvis, for obvious reasons. The crossed hands in Pray Codex remind one of the Man of Sorrows type, so let’s simply google for this type and see what we find for the “crossed hands” iconography: http://www.wga.hu/html m/c/ceccarel/sorrows.html http://www.nationalgallery.org.uk/paintings/probably by jacobello del bonomo the man of sorrows http://fineartamerica.com/featured/christ as man of sorrows anonymous.html http://www.betsyporter.com/Jesus.html http://artnow.ru/en/gallery/200/31446/picture/0/721078.html Plus a couple from manuscripts: http://ica.themorgan.org/manuscript/page/19/76833 http://ica.themorgan.org/manuscript/page/17/76888 http://ica.themorgan.org/manuscript/page/19/76926 On all of these images from different eras, including very modern images, the thumb is either barely visible or absent. Why? I propose that with this particular position of hands it is simply natural for a master to “hide” the thumb. (Note that, of course, there are also images with very visible thumbs. But that’s not the point, the point is the abundance of images without thumbs or with barely visible thumbs). So here’s one potential correlation, which would leave you with only 2 traits, because then nakedness and 4 fingers are not necessarily independent. I’m not stating this as a proven fact, but again, it’s up to you to disprove this by doing research. 3. Finally, you still haven’t addressed that fact that you haven’t substantiated your probabilities. Why 1 in 100 and not 1 in 20? You can only claim that after doing statistical research on the relevant material. That you claim that “those 6 features … are so rare on iconographic descriptions that no ‘iconographic tradition’ around them probaly exist” is just a claim, which it’s up to you to prove. Don’t forget: *you* are making a case here. So what we’re left with is that you basically have two traits with uncertain probabilities assigned to them. Versus the fact that the second image shows a tomb lid separately from a shroud. Which means that Codex Pray has nothing whatsoever to do with the Turin Shroud..","date":"2015-03-02","mins":"6:27 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192296","author":"skeptic","post":"“The fact is that the legs are indeed cropped there. This is undisputed coincidence with the Shroud.” The ends of feet were physically cropped with the rest of the page. *We know that the feet were there earlier*. Hence it can in no way be any meaningful coincidence. “But this could have been as well deliberate decision of the illustrator who put the legs on the very margin to be cut while trimming.” LOL? “Because you have selected those images with invisible or hardly visible thumbs.” Now you are going in circles without even trying to answer the question. “Besides lack of thumbs is something different, much stronger than “hardly visible thumbs” or thumbs obscured by geometric perspective.Э It is, in fact, the same principle. “This whole reasoning is obviously wrong. Your own illustration shows why: Here we have crossed hands, yet no nudity, as the loincloth is clearly visible. And there are 5 fingers visible on each hand.” And you have, once again, failed to grasp the very simple, really, trivial argument that I make. Once again: crossed hands don’t imply nudity, but nudity does (with huge probability) imply crossed hands. So you giving me an image of crossed hands without nudity does not in any way address my argument. Hopefully now that I have explained it in easy, short words for the second time, you will get it at last and stop making strawman arguments like “But crossed hands does not imply nudity nor 4 fingers..” – because of course I never implied otherwise and such a claim is irrelevant to the argument that I am making. “But 10^ 3.9 (close to 1 in 1000) is a small number, even if two orders of magnitude larger than 10^ 6. It is close to null and that’s the main point.” That’s not the main point, because it may be 1/5 for all I know. In any case, as has been demonstrated, you don’t have 6 independent features in need of explanation. Maximum one, and that one is rendered irrelevant by the fact that the miniature depicts a tomb lid, not the shroud..","date":"2015-03-03","mins":"1:49 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192294","author":"skeptic","post":"“They look similar, yes. But they are in fact different. While upper image shows tomb lid, the similar image Pray Codex shows the Shroud.” This is incorrect, since the similar image in Pray codex can only show the tomb lid, as I have shown through comparative analysis with numerous other contemporary miniatures..","date":"2015-03-03","mins":"1:40 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192303","author":"skeptic","post":"It is a tomb lid because it fully corresponds to how the tomb lid is drawn in other contemporary manuscripts: a rigid rectangle, at an angle to the sarcophagus, usually with the angel or Jesus stepping on it or sitting on it, usually decorated with some sort of an ornament. This is indisputable. It cannot be anything but the lid. Your argument doesn’t make sense, I’m afraid, because the area with the crosses is the wall of the sarcophagus as seen from the side. It shouldn’t be “black” or anything like that. Yeah, it’s not 3 D, but the drawing itself is rather crude..","date":"2015-03-03","mins":"2:58 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192297","author":"skeptic","post":"Indeed, Charles. Such nonsensical “probability calculations” are inherently one sided, because any sensible calculation *must* account for divergent features, as well as convergent ones. Any probability calculation [that assumes that the rectangle is the Shroud, although it is of course the tomb lid] *must* account for the absence of the image on the “shroud” (which fact alone actually disproves the whole “it’s the shroud” nonsense), it *must* account for the fact that the “burn holes” are present *despite* the fact that they would not be present during the Resurrection and are thus anachronistic. It must account for the fact that there are 4 “burn holes” on one rectangle and 5 on the other (the other one is actually the sarcophagus and not another half of the shroud, but let’s ignore this for a moment). It *must* account for what you point out – lack of bloodstains and scourge marks. Any “probability calculation” that does not account for all of this is useless..","date":"2015-03-03","mins":"2:03 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192304","author":"skeptic","post":"The usual explaining away of the damning evidence..","date":"2015-03-03","mins":"2:59 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192308","author":"skeptic","post":"The ridiculousness of your argument competes with that of the “trimming” hypothesis by O.K. :) Apparently you didn’t take the time to actually look at the similar resurrection/post resurrection scenes from medieval manuscripts I posted earlier, where the tomb lid likewise “hangs with no support”. Little learning is a dangerous thing, but you seem to lack even that ^ ^.","date":"2015-03-03","mins":"3:26 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192305","author":"skeptic","post":"“And I can show with numerous other fish photographs that dolphin is a fish as well.” Well, this would just show that you’re not a serious opponent. “There seems to be no argument at all.” There is, you’re welcome to re read the previous comments and address what I wrote without skipping the inconvenient parts. “Besides, the whole discussion is pointless as nudity and crossed hands are in fact listed as one point (A, and in fact complete nudity is primary feature there).” Congratulations, you have failed to understand my uncomplicated point for the third time. Of course, I never disputed that they’re listed as one point. It’s not about “nudity and crossed hands”. It’s about the relationship between nudity, crossed hands and missing thumbs. “Of course such possibility seems to be beyond your imagination…” Well, I could imagine something like this, for sure. Of course, I would never, ever, write it down for the fear of being seen as a fool. This self refuting parody of a hypothesis doesn’t really require a comment. But anyway: no, the trimming had nothing to do with the artist’s intent. The text was trimmed too. It obviously happened because of the damage to the manuscript. This it had nothing to do with the artist’s intent. Thus it cannot be a meaningful coincidence. This is in fact a perfect example of how “coincidences” can be fabricated. “No, it must account only for those features which are considered relevant to the subject” Which are all the divergent features too. Otherwise the calculation loses any sense. Anyhow, as we have established through comparison with contemporary manuscripts, the picture depicts a tomb lid with the shroud lying on it, so none of your probability calculations are at all relevant. “No ‘Skeptic’, you failed to refute my arguments presented here. You make basic errors (like making selection among the sample and claiming correlation, or assuming that implication in one way forces implication in another) , and don’t understand the fundamental principles behind the reasoning. But this is rather a norm for ‘smart’ skeptics.Э I have either refuted your arguments or have shown where you haven’t proven your case. I haven’t made a single error and I have pointed numerous errors of yours, including some basic comprehension problems, like your constant confusion about implications and correlations. You stand refuted, enjoy :).","date":"2015-03-03","mins":"3:09 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192320","author":"skeptic","post":"“from Physics” LOL, the troll thinks physics is somehow relevant to the medieval iconography. And of course most of the tomb lids have designs. The tomb lid in the Pray codex has nothing whatsoever to do with the Turin shroud. Once again, with feeling: go away, troll! :D.","date":"2015-03-03","mins":"5:08 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192313","author":"skeptic","post":"“or angel” LOL. Actually the tomb lid is propped up by the ground on one end and by the sarcophagus on the other. And many other lids have designs. And a herringbone design on a tomb lid would still establish nothing about the Turin shroud. Now go away, troll ^ ^.","date":"2015-03-03","mins":"4:28 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192404","author":"skeptic","post":"“Go away troll” said the guy living under the bridge.” So David, you’re here to defend the troll? Doesn’t that make you a troll yourself? Something to ponder..","date":"2015-03-04","mins":"12:34 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192321","author":"skeptic","post":"To sum up the debate: 1. The author did not provide any justification for his probability estimates. 2. The author committed numerous errors, such as: a) assuming that his variables are independent without doing any research (e.g. Assuming that nudity is independent from 4 fingers); b) assuming that cropped feet have any significance (even though little research would have shown him that the feet were originally there and were trimmed because the manuscript was damaged); Hence his assertion about a number of “features” are without any basis. 3. We know from the comparison with the medieval manuscripts, the links to which are posted above, that the Pray codex depicts nothing else but the tomb lid. 4. This established fact shows that none of the probability calculations whatsoever matter, because no probability calculation will make a tomb lid into a shroud. Ergo: this post is useless..","date":"2015-03-03","mins":"5:15 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192311","author":"skeptic","post":"If those other tomb lids which literally hang in the air can be described as being “propped” by columns or such (even though they go “through” the columns, and some literally hang in the air, as if the angel was the “magnet” for them), then the Pray tomb lid can likewise be described as being propped by the sarcophagus. You lose again, troll :).","date":"2015-03-03","mins":"4:05 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192428","author":"skeptic","post":"Fair enough. I’m not here to argue about the authenticity of the shroud anyway, here I’m interested in this particular issue. For all intents and purposes I could be a Shroud believer (no, I’m not, but in theory…). As for trolling: apart from what I see as dishonest misinterpretations of the miniatures in the other manuscripts, I just see his bringing up physics(!) into the discussion of medieval iconography as pure trolling He can’t be serious, now, can he?.","date":"2015-03-04","mins":"4:10 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192347","author":"skeptic","post":"Sometimes the most obvious is so invisible… So thanks for this insight. Indeed, the saint doing the anointing has 4 fingers, which means that in this position it was natural for the artist to “hide” the thumb..","date":"2015-03-04","mins":"12:59 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192322","author":"skeptic","post":"Addition: 5) The author willfully ignored the obviously relevant divergent features in his “calculations”, which on its own renders them invalid..","date":"2015-03-03","mins":"5:24 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192346","author":"skeptic","post":"“The skewed rectangle is inevitably recognised as a casket lid.” Thank you for agreeing. Even if you contradict yourself in the next paragraph, for there is no chance that this rectangle is anything but the lid. One need not do more than compare this with other miniatures. In fact, one need not do more than compare the top and the bottom images, because the shroud at the top looks nothing like the rectangle at the bottom. Oh and this: “The small cloth resting upon it, might wrap a head” – like some others, you have fallen into a trap of not studying the provided links. You can see clearly that on some of them both the covering and the shroud appear, and both are very small and “bunched up”. Moreover, it can easily be that the cloth on that image is supposed to extend up to the red zig zag lines, i.e. The area with the crosses may belong to the shroud. Be that as it may, this has no bearing on the function of the rectangle. “It would be the only tomb lid ever drawn with four poker holes drilled in it in the shape of an L.” That they’re holes is an interpretation in need of evidence. They’re circles, decorative elements beloved by the master of the Pray codex. These circles are everywhere. In fact, there are also 5 circles on the sarcophagus – which believers interpret as the second half of the shroud, thereby receiving an obvious contradiction, because the real Shroud has 4 holes on both sides. Conclusion: there is no evidence tying the Pray codex to the shroud of Turin. Personal feelings aside, it certainly cannot be used to disprove the carbon dating..","date":"2015-03-04","mins":"12:29 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192401","author":"skeptic","post":"The German Book of Hours ica.themorgan. Org/manuscript/page/31/143915 ica.themorgan. Org/manuscript/page/30/143915 (links mangled to avoid spam filter) Representation of granite etc. Is a representation of a texture. If you’re calling the herringbone weave texture a “design”, so I can call the alleged stone texture “design”. In any case, whether there are designs or not (and there are) has no relevance to the issue at hand. We know from the comparison with the medieval manuscripts that the Pray codex depicts the tomb lid. But we also know that that rectangle is not the shroud without any external comparison: the top picture shows the shroud under Christ and it looks *nothing* like the rectangle on the bottom picture. Case closed..","date":"2015-03-04","mins":"12:30 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192429","author":"skeptic","post":"Ah, so you’re interested in playing word games and semantics. Cool. Without me :) The medieval manuscripts don’t allow any other interpretation of the rectangle but the tomb lid, “designs” being completely irrelevant to the issue. The usual red herring. Plus the shroud is also depicted in the Pray codex, and it looks nothing like the rectangle, so the rectangle cannot be the shroud. Really, basic logic..","date":"2015-03-04","mins":"4:14 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192430","author":"skeptic","post":"PS: and of course you ignored the purely geometrical designs in one of those manuscripts, but that’s already par for the course..","date":"2015-03-04","mins":"4:16 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192344","author":"skeptic","post":"“It’s OK, homes, you’ve been schooled more than once here today, esp. Well so by daveb below.” I’m afraid I’m the only one doing the schooling here. The dogmatic believers are collectively beclowning themselves :) “None of your examples of tomb lids had designs,” Nope, most of them did, as anyone can see for themselves. And of course your claim doesn’t make any sense, for you’re dismissing these designs on the basis of them representing marble and such (not all of them do, there’s at least one case of a purely geometrical design, so you’re lying as usual), i.e. Texture of material, yet the “design” in the Pray Codex represents material texture *according to you* (herringbone weave is nothing but texture, after all). So you’re contradicting yourself. And of course there is the question of how that is relevant to the discussion at all. “All the available facts say: The Shroud. Live with it. I’m sure there are some nice skeptic sites somewhere where you could survive quite nicely.” Since the comparison with other medieval manuscripts leaves no doubt that this is a tomb lid, this cannot be a shroud. Live with it..","date":"2015-03-04","mins":"12:13 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192571","author":"skeptic","post":"“Skeppy. The Pray shroud has a design, you know, like cloths do.” You’re confusing design and pattern. Herringbone weave is not a design, i.e. Something deliberately made to look like a fish bone. It is a distinctive pattern though. “Your tomb lids don’t — geometrical designs? Ha. Post the picture here and let’s let everyone decide.” I have already posted 2 links above in response to this same inquiry, and you predictably ignored them in order to continue to spew lies like: “the rest of your cited tomb lids have nothing of the sort.” You’re welcome to go back and examine the links now. But once again you ignore the main question: how is this at all relevant to the issue? How does it matter whether there is any kind of a pattern, design or anything else on the lid? “And as O.K. Pointed out, your “tomb lid” does not have a matching scheme to the sarcophagus.” Nor must it. There is no requirement that the patterns must match. Moreover, if you look at my miniatures one more time, you will see that the patterns on the inside and on the outside the sarcophagi often do not match. Hence we could be seeing the inner side of the tomb lid, which would match the inner pattern of the sarcophagus which we do not see. (Not that I believe in this, because I don’t believe that the artist followed any “rules” in regard to his ornaments – there are no such rules. But for someone who foolishly believes that there are such rules this explanation should suffice). [Side note: it’s funny how you require the patterns to match for the tomb lid and the sarcophagus, yet seem blind to the fact that the pattern *must* match if those are not a lid and a tomb, but rather two halves of the same shroud, as sindonologists propose.] “Meanwhile, explain how your magical “tomb lid” in the P.C. Sticks to the side of a vertical side of a sarcophagus.” Like most other tomb lids on miniatures do: they’re crudely drawn images without regard to physics. You would have known this if you would have actually looked at the pictures. [No need to get personally insulting. — Dan].","date":"2015-03-05","mins":"7:33 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192405","author":"skeptic","post":"Thanks for the nice comment, Hugh..","date":"2015-03-04","mins":"12:37 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192431","author":"skeptic","post":"Why try to untie the Gordian knot when one can cut it? No amount of paragraphs can change the simple fact that what we’re seeing there is the tomb lid, and that the shroud is also depicted there and doesn’t look like a rectangle. Really, this is a brute fact. After this all musings about “poker holes” become irrelevant..","date":"2015-03-04","mins":"4:17 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192432","author":"skeptic","post":"Too bad the Pray codex has nothing to do with the Shroud, otherwise you would have a point….","date":"2015-03-04","mins":"4:20 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192488","author":"skeptic","post":"Nope, I have provided sufficient evidence above, so not only the statement not dogmatic, it’s also true..","date":"2015-03-05","mins":"8:39 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192573","author":"skeptic","post":"I have to disagree. I think that any attempts to leave the door open for the Shroud connection are a kind of special pleading. There is nothing specific in the image that would suggest the connection, only very general details like Jesus being naked (which is not unheard of in the contemporary iconography) or his hands being crossed (which is pretty much entailed by him being naked; interestingly the hands are crossed at the wrists – not at all like in the Shroud, but we’re supposed to ignore it somehow). The only way to establish a “connection” is through ridiculous ad hoc hypotheses, like that the rectangle is actually the shroud, etc..","date":"2015-03-05","mins":"7:47 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192489","author":"skeptic","post":"Yawn. You are getting too predictable. 1. Feet: I love how you arbitrarily drew long feet. The fact is that only a couple mm are missing, and they are explained by the trimmed edge. 2. Since we are not talking about fish, your spam picture is irrelevant and my statement stands unrefuted. 3. The “bench”, even if there is one (not a proven fact), is irrelevant. I’m not sure why you bring it up every time as if it was some relevant fact. It’s not. 4. The tomb lid is not a shroud, both from the comparison with other manuscripts and from the comparison with the top picture, where the shroud looks nothing like a rectangle. So: your disjointed illogical comment is same old, same old..","date":"2015-03-05","mins":"8:45 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192494","author":"skeptic","post":"PS: here is the actual size of margins when it comes to musical notation in the manuscript: mek.oszk .hu/12800/12855/html/hu b1 mny1 0064.html Indeed, the similar margin length is evident on the right side on the illustrated page *except* for the upper group of lines. And it is of course this very group – which is the exception, not the rule – that O.K. Chose to build the missing margin. Whether from this one can judge O.K.’s honesty or bias, I’ll leave to the reader to decide, but in any case O.K.’s interpretation is, once again, not in accordance with the evidence..","date":"2015-03-05","mins":"9:07 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192503","author":"skeptic","post":"As a rule, medieval manuscripts had wide margins. Because the scribes *knew* that the book would be rebound in a century or two, and since the edges of the pages would become a mess, they would be trimmed. We *know* that this happened to the Pray codex – the text at the top is neatly trimmed, which means that the manuscript as a whole underwent just such a treatment. It is contrary to all evidence to suggest that the current margins on that pages are the original margins give or take a centimeter. We’re most probably missing a few cm there, after trimming and rebinding. Here’s more on the medieval page lining rules: web.ceu. Hu/medstud/manual/MMM/ruling.html Here’s how a typical lined page would look like: web.ceu. Hu/medstud/manual/MMM/pic07.html The margins are huge. The older the manuscript, the more the probability that lots of the margin space has been trimmed out..","date":"2015-03-05","mins":"9:35 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192568","author":"skeptic","post":"“It is nothing compared to your predictability, regretful Mr ‘historian’.” Thankfully, I never claimed to be a historian. ;) Re: feet: you drew arbitrarily long feet, assuming that they were not positioned strictly vertically. But all your comments on the feet are irrelevant in any case, since, as I have shown, we are most likely missing a few cm of the margin space. ““Most probably”? Any speculation about the original size of the card is merely a speculation.” Interestingly how quickly you elevate your speculation (e.g. About feet) to the level of a sacred truth, but dismiss the actual facts, namely: 1. The medieval manuscripts as a rule had very wide margins because the scribes expected them to be trimmed. It was a purely practical consideration. 2. We know that the Pray codex *was* trimmed because we see e.g. The marginal text which is only partially there. Thus, from all the facts, we can conclude that we are, indeed, missing a few cm of page space. It’s up to you to prove otherwise. “The Codex Pray portrays the Shroud of Turin the same Shroud that Robert de Clari saw in Blacherne in 1203.” This is contrary to the facts as elucidated in the comments here, namely: 1. The comparison with other medieval manuscripts proves once and for all that the rectangle in question is the tomb lid. 2. The comparison of the shroud on the top picture with the rectangle on the bottom picture proves beyond any doubt that they’re unrelated objects..","date":"2015-03-05","mins":"7:11 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192578","author":"skeptic","post":"““Sounds” American to me. It was peculiar to me that he should try to call texture “a design”, though.” I was going with your terminology. You called the herringbone weave pattern a “design”, even though it’s not. It’s a pattern, like a marble pattern, granite pattern, etc. (Yes, one is created by humans, the others aren’t, but neither was the herringbone weave created to match the look of fish bones, it’s not an ornament and it’s not a “design”.).","date":"2015-03-05","mins":"8:10 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192574","author":"skeptic","post":"Fine. What about conspiracy theories?.","date":"2015-03-05","mins":"7:49 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192569","author":"skeptic","post":"[This comment and the image that followed were removed. — Dan].","date":"2015-03-05","mins":"7:13 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192610","author":"skeptic","post":"– 2+2=4. – You dumb rationalist, of course 2+2=6, everything proves it! – You both are dogmatists, no one can say whether 2+2 is 4 or 6. It is wise to settle on 2+2=5..","date":"2015-03-06","mins":"8:01 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192575","author":"skeptic","post":"Just for the record, the deleted comment was not a personal insult, it contained an “admiral Ackbar” joke based on the “it’s a trap!” meme..","date":"2015-03-05","mins":"7:54 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192611","author":"skeptic","post":"“Yeah, coming here you never intended to be a historian, especially proffesional medievist, right?” You got that right. I think my comments show what I intended, namely, to debunk a bogus argument. “I don’t think this ‘Skeppy’” “You are dealing with a psychopath” Didn’t the owner of this blog tell us to cut it out with the personal insults? Mr. Porter, I would like your input here..","date":"2015-03-06","mins":"8:05 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192627","author":"skeptic","post":"I have no idea of who you are and I have never debated you before. So stop with the personal insults and debate the actual arguments..","date":"2015-03-06","mins":"10:47 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192619","author":"skeptic","post":"“Your presumption that the herring bone weave is asserted as being represented by concentric circles is I think a distortion. What I believe has been asserted is that the weave is represented by the zigzag pattern. The five small circles arranged as an L echo the Shroud poker holes whose known origin is lost to history.” *Concentric* circles means circle within a circle, with a common center. Hugh is obviously not talking about the 4 circles, which are not concentric. He is talking about the pyramid like patterns, which he sees as exhibiting a sort of concentricity. I’m not sure why he terms them “circles” (though one time he puts the word “circles” in quotes), but his idea is more or less clear from the context..","date":"2015-03-06","mins":"9:25 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192626","author":"skeptic","post":"Agreed, it’s not the herringbone weave pattern. Doesn’t look like a straight fish bone at all. Once again, this can only be established through the eyes of faith :) PS: What’s more, what sindonologists claim is the second half of the Shroud, and what actually is the sarcophagus, has the pattern of crosses, even though it would also have to exhibit the herringbone weave pattern to be a part of the Shroud. Once again, the coincidences are imaginary..","date":"2015-03-06","mins":"10:41 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192631","author":"skeptic","post":"My new summary of the debate: This posting can be dismissed both on formal and on substantial grounds. 1. Formal grounds: a) The author did not provide any justification for his probability estimates. B) The author did not provide any justification for treating his probabilities as independent, which can only be established through actual statistical research of the contemporary iconography. For example, there is a probable connection between nudity and 4 fingers (a nude figure will almost certainly be exhibited with crossed hands, and there is an abundance of images from different eras with crossed hands which lack thumbs; indeed, the person anointing Jesus’ body in the top image on f.28 of the Pray codex also lacks a thumb while his hand is in the position similar to that of Jesus; thus it is not proven that nudity and 4 fingers can be treated independently for the purpose of estimating probabilities). 2. Substantial grounds: a) The author claims the cropping of Jesus’ feet as a significant coincidence with the Shroud of Turin, yet there are two facts that undermine this conclusion: a1) We know that as a rule medieval manuscripts had very wide margins, because the scribes knew that their books would be rebound and trimmed several times in the next few centuries. It is thus extremely improbable that the current very narrow margins are the original margins, give or take a few mm. A2) We know that the Pray codex *was* trimmed, because it has some marginal text neatly cropped, which means that the manuscript as a whole did undergo this standard treatment. It is thus the default fact based assumption that the original margins were a few cm wider than what we have now. This assumption must be proven false before one ascribes any significance to the cropped feet and uses them in any probability estimates. The author has failed to do this. B) The image has to be interpreted first and foremost in the light of the contemporary iconography. A comparison with other medieval manuscripts demonstrates that the bottom picture on f. 28 of the Pray codex shows three Marys standing behind the cross adorned sarcophagus, with the angel having his feet on the lid of this same sarcophagus. The contemporary iconography allows for no other interpretation, various fishy analogies notwithstanding. C) The author’s claim that the pyramid like pattern on the tomb lid refers to the herringbone weave pattern is false, because it looks nothing like the actual herringbone weave pattern, which looks like a series of parallel straight fish bones. Hence this alleged coincidence is also imaginary. D) The author’s claim that the tomb lid is actually the Shroud of Turin is also refuted by comparing the top and the bottom pictures on f.28: the top picture shows Jesus’ shroud, which, with its numerous folds and without any pattern, looks nothing like the rigid patterned rectangle on the bottom image. E) The author only takes into account what he thinks are convergent features, while ignoring the divergent features in his probability estimates. These divergent features include: e1) Lack of the image on the alleged shroud. E2) Lack of the actual herringbone pattern on the alleged shroud. E3) Lack of the corresponding pattern on the second half of the shroud (which is actually a depiction of the sarcophagus). E4) The different number of circles on the two alleged halves of the shroud (4 and 5). E5) Lack of wounds on Jesus’ body. E6) Jesus’ hands are crossed at the wrists (or even above them), not at all like the hands on the shroud. Conclusion: the author failed to show that his probability estimate is valid. Moreover, it has been shown that the rectangles on the bottom image of folio 28 in the Pray codex refer to the sarcophagus and its lid, not to the two halves of the shroud. The discussion about the Pray codex and its relation to the Shroud is now over..","date":"2015-03-06","mins":"11:22 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192667","author":"skeptic","post":"1. A) “The author makes a rough estimation of probability assuming plausible order of frequency for each feature 1/100 for the simplicity of calculation.” The author doesn’t provide any evidence that his numbers are plausible. Such numbers can only be based on actual research. The point stands. B) “The author sees no evidence for any correlation, nor for any plausible connections between discussed features.” It doesn’t matter whether author sees anything or not. He does not provide actual evidence for independence which can only be based on actual research. The point stands. “The attempts to show the connection between two features based on the biased, selective sample have no grounds.” The author has not dealt with the evidence, nor has he provided any evidence for independence between nudity and 4 fingers. The point stands. 2. “We cannot determine the original size of the relevant sheets in the Pray Codex.” The author admits this, thus admitting that he cannot show the significance of the cropped feet. Also the author ignores the fact that due to reasons a1 and a2 it is simply hugely more probable that we are missing a few cm, and it is thus up to him to prove otherwise. Without such a justification his cropped legs cannot be any kind of a significant coincidence. The points stand. B) “As the Codex Pray is unique with its exceptional Shroud linked features, any comparisons with contemporary iconography are baseless. The exceptions defy the rules by definition. This is the basic logic.” Every image is unique in some respects. This does not mean that it can be interpreted outside of the light of contemporary iconography. “See above. Contemporary iconography cannot be applied for a single very specific example which may go against it.” The contemporary iconography must always be applied. The author has given no reason whatsoever for ignoring it, other than special pleading. The point stands. C) “The interpretation of zigzag pattern as an attempt (even if inaccurate) to portray herringbone pattern is fully justifiable.” There is no reason to suggest such an interpretation, other than mounting an apologetic for the Shroud of Turin – which leads to a logical vicious “circle”. In any case this cannot be proposed as one of the “coincidences” to be explained since it’s in itself at most a hypothesis which requires stretching of facts. The point stands. D) “The difference between representation of the Shroud on top and bottom pictures of f:28r is irrelevant, if one takes into account other contradictory represenations in the Codex. For example f:27 shows Jesus crucified in traditional Byzantine style implying 4 nails used, while there are only three nails on the arm of the cross hold by an angel on f:28v:” Non sequitur. The author tells us that the same object is depicted by the same author on the same page in absolutely different forms, so that it is actually unrecognizable from image to image, and he “explains” it by bringing up irrelevant and not immediately obvious minute differences in nail depictions(!). This is absurd on its face. The point stands. E) “There are no features that would exclude the hupothesis that the Shroud of Turin is referenced in the Codex Pray.” The author misses the point. Whether or not such features absolutely exclude the hypothesis is irrelevant. They do go *against* the hypothesis, lowering its probability. Thus they must be a part of the calculation, otherwise the calculation is one sided makes no sense. Like a trial where only evidence for one side has been presented. The point stands. E1) “Lack of the image on the alleged shroud. Irrelevant. If illustrator decided not to portray the image on the Shroud for some reason, he had the right to do so. Demands of the skeptcis 800 years so about what the illustrator should and what should not have portrayed are lacking any basis.” The author’s suggestion that this most relevant point is “irrelevant” is absurd on its face. While there may be far fetched ad hoc hypotheses that explain this state of facts, this fact does add the “negative” (i.e. Against the hypothesis) probability to the wholesale count. It must be a part of the probability calculation. The point stands. E2) Same as above. E3) “The second rectangle on the lower image is irrelevant as it is hard to interpret what it represents. I have never claimed that it has to be the other half of the Shroud.” Fair enough, although other sindonologists have generally interpreted it as the second half of the shroud. Which only leads to further problems for the author, to wit: 2.1: Where is the second half of the shroud on the image? 2.2: What do the P circles on the second rectangle represent? If they don’t represent holes, why should one assume that the L circles represent holes? How does the presence of non hole P circles influence the probability that the L circles are holes rather than ornaments? e4) The point withdrawn for this particular author. However, see e3. E5) Same as e1. E6) Point withdrawn. Conclusion: most of the points stand. 3 points are withdrawn, 2 points are added. The main conclusion stays: “the author failed to show that his probability estimate is valid. Moreover, it has been shown that the rectangles on the bottom image of folio 28 in the Pray codex refer to the sarcophagus and its lid, not to the two halves of the shroud. The discussion about the Pray codex and its relation to the Shroud is now over.” PS: See, you can do almost without ad hominems when you try. Also, I’m not a historian..","date":"2015-03-06","mins":"6:39 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192402","author":"skeptic","post":"Since the picture depicts these circles on the tomb lid and not on the shroud, all your musings are irrelevant..","date":"2015-03-04","mins":"12:32 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192612","author":"skeptic","post":"I’m not saying that the zig zags are random squiggles. They’re either ornaments (e.g. The crosses on the sarcophagus are purely ornamental, so why can’t be the zig zag lines on the lid) or they very crudely represent some natural pattern as the artist saw it. Otherwise, I can only agree with you..","date":"2015-03-06","mins":"8:08 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192650","author":"skeptic","post":"“This guy has a doctorate from history” I wish :D.","date":"2015-03-06","mins":"3:02 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192648","author":"skeptic","post":"Interestingly, the personal insults still haven’t stopped, despite Dan Porter’s admonition. Now, why would that be? Or is only one side allowed to insult?.","date":"2015-03-06","mins":"3:02 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192653","author":"skeptic","post":"I discuss evidence. My opponents discuss me. Sapienti sat..","date":"2015-03-06","mins":"3:40 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192651","author":"skeptic","post":"“I have little interest in the various ad hominem comments, nor in exploring the motivations of other correspondents, nor their identity, nor their psychology.” All else aside, I wholeheartedly agree..","date":"2015-03-06","mins":"3:03 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192674","author":"skeptic","post":"[deleted].","date":"2015-03-06","mins":"8:30 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192695","author":"skeptic","post":"Agreed about Nabber. Skeptic, however, did nothing wrong, he doesn’t care about double standards though ;).","date":"2015-03-07","mins":"7:59 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192698","author":"skeptic","post":"“Yeah, double faced Mr ‘Skeptic’ does not care about double standards. He is eager to insult others, but he cries that other attack him ad hominem.” We are talking about the situation after Dan Porter told everyone to cut it out. I did immediately. The insults from OK and Nabber continued. ” Perhaps because the discussion turned form the Codex Pray (where all arguments have been actually repeated many times in this long discussion), to the not so mysterious person of Mr Skeptic” Thank you for confirming that you have turned to ad hominem arguments. Just like I said. I’m afraid you’re deluded about my person, just as you’re deluded about the Pray codex. I have asked around and searched around and I assume that you think that I am Andrea Nicolotti. Dr. Nicolotti’s knowledge of all matters pertaining to the Shroud is incomparably higher than mine. But I hope it won’t sound as an insult to say that my English is a little bit more free flowing than his. Which anybody with a modicum of intellect and common sense would have noticed..","date":"2015-03-07","mins":"9:56 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192704","author":"skeptic","post":"Yours are words of wisdom, but I am only human. My general rule is to give tit for tat..","date":"2015-03-07","mins":"11:50 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192737","author":"skeptic","post":"As usual, you have missed the point. I was comparing *my* knowledge with that of Dr. Nicolotti. Anyway, your tendency to find false coincidences and build false conclusions on their basis is amply established by now, Mr. O.Ko..","date":"2015-03-07","mins":"7:23 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192801","author":"skeptic","post":"I am not going to debate the more complex issue of authenticity here, seeing how even the extremely simple and clear cut issue of the Pray codex couldn’t be handled rationally and honestly here. But I think we can agree that we are not seeing any God bearing shroud on the Pray codex images, given how the shroud depicted there is blank..","date":"2015-03-08","mins":"12:22 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192721","author":"skeptic","post":"Thibault, I think this begs the question. But anyhow: do you think the two rectangles represent the two halves of the shroud?.","date":"2015-03-07","mins":"4:15 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192956","author":"skeptic","post":"Interestingly, quite a few of my comments are “awaiting moderation”, which shows that this blog deals in double standards and it’s hardly possible to properly “debate” anything here..","date":"2015-03-09","mins":"12:04 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192613","author":"skeptic","post":"I love how the author of this post found consolation in ad hominem arguments rather than defending his thesis. This is really all that needs to be said..","date":"2015-03-06","mins":"8:11 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"}]
