[{"id":"comment-160425","author":"john_green","post":"Well I agree. If I had a NBE and was looking down on my body the last thing I would be looking for is a sign. I would be flying around the hospital looking for more doctors!.","date":"2014-10-08","mins":"11:53 am","url":"https://shroudstory.com/2014/04/21/heaven-is-for-real-the-akiane-prince-of-peace-the-isa-mosaic-and-the-shroud-of-turin/","cat":"akiane_kramarik","title":"Heaven is for Real, the Akiane Prince of Peace, the ISA Mosaic and the Shroud of Turin"},{"id":"comment-160403","author":"john_green","post":"Dr. Parnia has written 2 books on this subject. In his second and latest book, “Erasing Death: The Science That Is Rewriting the Boundaries Between Life and Death” includes an update on his AWARE study, but I found nothing new in it as far as this study goes. Some people claim that during this NDE they float above their bodys and look down and see what the doctors are doing. And one of the things they have done in the four year study is place signs high up so the only way you can see them if is that you are floating up above. So far there is no claim that someone has reported seeing them. There are a lot of problems with the claim that people have seen the afterlife. Some people see Jesus, or whatever god they believe in, some see friends that are still alive and sometimes kid meet a man in a red suit (maybe Santa).Many people see Jesus and Jesus allows them to Judge themself rather than have God do it as in the Bible. After all the book I’ve read on this on this subject I now believe it’s something that’s is created in the mind but I’ll await the final release of the study(which we been promised for years) before I make up my mind. PS Some Christains believe that this is the work of the Devil (Well, NDE’s not my post) because some bad people go to heaven and sometimes good people go to hell..","date":"2014-10-08","mins":"9:43 am","url":"https://shroudstory.com/2014/04/21/heaven-is-for-real-the-akiane-prince-of-peace-the-isa-mosaic-and-the-shroud-of-turin/","cat":"akiane_kramarik","title":"Heaven is for Real, the Akiane Prince of Peace, the ISA Mosaic and the Shroud of Turin"},{"id":"comment-160452","author":"john_green","post":"It may get in the way of them trying to bring the person back and they wanted it was no one else could see it and tell him what the sign said I guess. I think when the person go code blue it’s quick and they would not have the time to run around looking for a sign..","date":"2014-10-08","mins":"2:09 pm","url":"https://shroudstory.com/2014/04/21/heaven-is-for-real-the-akiane-prince-of-peace-the-isa-mosaic-and-the-shroud-of-turin/","cat":"akiane_kramarik","title":"Heaven is for Real, the Akiane Prince of Peace, the ISA Mosaic and the Shroud of Turin"},{"id":"comment-197842","author":"john_green","post":"Hey, cool. I learned to paint watching Bob Ross. Want a picture of a mountain or a tree, I’m your guy. Need a painting of a person, well I’m almost as good as the kids in my granddaugther’s kindergarten class..","date":"2015-04-28","mins":"9:12 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-192408","author":"john_green","post":"Charles Here’s a picture of a dress that’s all over the internet. Some say they see gold and white( that’s what I see) others look at the same photo and see the dress as Black and blue. Http://mashable.com/2015/02/26/what color dress blue black white gold/.","date":"2015-03-04","mins":"12:48 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192774","author":"john_green","post":"This is getting very very strange..","date":"2015-03-08","mins":"6:51 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-193102","author":"john_green","post":"Sounds like that fits believers too..","date":"2015-03-11","mins":"3:23 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-189389","author":"john_green","post":"MAX, PLEASE stop posting one or two line post every few minutes. Sit down think it all out and put it in one post! PLASEEEEE.","date":"2015-02-05","mins":"11:34 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-191783","author":"john_green","post":"Hugh Your view would agree with the bible, but I think I see another problem. I seem to recall that they did some test or something where they found that if the nails were through the hands would not support the body. What’s you opinion on that?.","date":"2015-02-25","mins":"4:35 am","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"}]
