[{"id":"comment-214201","author":"john_green","post":"If he could walk through walls why would the be a need to move the stone?.","date":"2015-11-04","mins":"11:48 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214202","author":"john_green","post":"The=there, damn K mart keyboard.","date":"2015-11-04","mins":"11:49 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214207","author":"john_green","post":"The the angels moved the stone, but why would angels need to move the stone? “And, behold, there was a great earthquake: for the angel of the Lord descended from heaven, and came and rolled back the stone from the door, and sat upon it.” Well this is way off topic so I’ll drop it..","date":"2015-11-04","mins":"2:02 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214208","author":"john_green","post":"PS I’ll buy that the earthquake moved the stone. Makes sense to me..","date":"2015-11-04","mins":"2:09 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-209590","author":"john_green","post":"Louis Hindus and others in Eastern beliefs think highly of what Jesus said. Swami Prabhavananda wrote a book on it, “The Sermon on the Mount According to Vedanta.” Paul Brunton in his book, “The Short Path to Enlightmenment” quotes the bible often. Many ideas in the eastern beliefs are also in Christian beliefs, love, forgiveness, etc. As you know Hindus believe everyone one is part of the divine. One of the verses in the NT that always interested me is, “The kingdom of God is within you.” For the past 30 years I wondered what exactly is the writer trying to tell me. After starting to study Eastern beliefs a few years ago I believes it means we all are part of the divine. In fact for the only way the bible makes any sense to me is when I look at it with the mind of a Mystic, but that’s beyond the scope of this blog..","date":"2015-09-04","mins":"10:48 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209135","author":"john_green","post":"In reading Fr. Richard Rohr, ” The Naked Now” I find he writes that St. Francis, “told us friars that if we found a page of the Koran, we should kiss it and place it on the altar.” I could not find that direct quote but I found this by Pope Francis, “Jesus Christ, Jehovah, Allah. These are all names employed to describe an entity that is distinctly the same across the world. For centuries, blood has been needlessly shed because of the desire to segregate our faiths. This, however, should be the very concept which unites us as people, as nations, and as a world bound by faith. Together, we can bring about an unprecedented age of peace, all we need to achieve such a state is respect each others beliefs, for we are all children of God regardless of the name we choose to address him by. We can accomplish miraculous things in the world by merging our faiths, and the time for such a movement is now. No longer shall we slaughter our neighbors over differences in reference to their God.” I also find that many of the things that are taught in Eastern beliefs are the same as what is taught in the Bible..","date":"2015-08-27","mins":"1:05 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209144","author":"john_green","post":"Found it here John http://nationalreport.net/pope francis followers koran holy bible/.","date":"2015-08-27","mins":"2:42 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209147","author":"john_green","post":"Don’t know Hugh, but Fr. Richard Rohr did write in his book(pg 53), ” The Naked Now” that St. Francis, “told us friars that if we found a page of the Koran, we should kiss it and place it on the altar.”. As I wrote I was looking for what was behind what Fr. Richard Rohr wrote. I noticed in a footnote Rohr gives Kathleen Warren, “Daring to cross the Threshold” (Rochester, Minn.:Sisters of St. Francis,2003)..","date":"2015-08-27","mins":"3:04 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209155","author":"john_green","post":"Thanks Louis. Yeah, Fr. Rohr tends to put things in his own words and that’s why I was looking for a direct quote. Fr. Rohr is a Mystic and believe in nondualism, that’s why his books interest me..","date":"2015-08-27","mins":"3:48 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209303","author":"john_green","post":"This reminds me of a book I read in the 60’s, the “Pastover Plot.” Oh, and there were other books I read in the 60’s which claimed Jesus was a spaceman. I guess we’ll go there next..","date":"2015-08-30","mins":"8:12 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-212359","author":"john_green","post":"Noah? There is no evidence of Noah, an Ark, or a world flood. Http://www.pbs.org/wgbh/nova/ancient/secrets noahs ark.html Program Description In 1948, a British pilot serving in Iraq acquired a clay tablet with an intriguing, 3,700 year old inscription. The ancient writing tells the story of how the god Enki warns a Sumerian king named Atra Hasis of a future flood that will destroy mankind; Enki gives him instructions for building a boat to save his family and livestock. If that sounds like a familiar tale, it’s because this was one of several ancient flood traditions that, centuries later, would inspire the biblical story of Noah. But the tablet’s inscription describes a boat very different from the traditional image of the Ark—it’s said to be circular and made of reeds. Is this nothing more than a fanciful myth? Or could such a reed boat have carried Atra Hasis’ family of more than one hundred and his many animals? Join NOVA as a team of historians and expert boat builders investigates this fascinating flood legend and sets out to rebuild a tantalizing, ancient forerunner of the Ark..","date":"2015-10-12","mins":"8:20 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-212371","author":"john_green","post":"John, Clearly there were massive floods in the pass. Years ago NOVA did the story of a massive lake that formed in Canada when the ice was melting. At some point the ice dam that was holding back this lake melted and the water poured out and reshaped the northwest part of the United States on its way to the ocean. I’m sure that many other massive floods happened at the same time as that..","date":"2015-10-12","mins":"10:13 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-212376","author":"john_green","post":"You know many years ago I was involved in a Internet NG headed by Farrell Till (I posted under another handle not my real name). And I would say that most of the Christians that posted to that NG really believed in the story of a world flood that covered all the land on earth. And they believed in Noah and the Ark. Some even believed that man lived along side of real Dinosaurs like the one of millions of years ago ( like the Fred Flintstone). It’s refreshing to see people here that are willing to look at these stories in another way. One that agrees with science, yet doesn’t affect their faith..","date":"2015-10-12","mins":"11:41 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"}]
