[{"id":"comment-173764","author":"john_green","post":"What is on the shroud really tells us little. It could have been deposited at any time from people that have touched it or places it has been. One of the arguments against C 14 dating is that things may have been deposited at some later date and caused the reading to be off. Can’t have it both ways..","date":"2014-11-30","mins":"5:51 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-151846","author":"john_green","post":"Peter Enns in his latest book, ” The Bible Tells Me So… Why Defending Scripture Has Made Us Unable to Read it” argues that the words in the bible should not always be taken literally. If you disagree with that then you put yourself in the position of trying to defend the Adam and Eve story, the flood story and many other things in the bible..","date":"2014-09-17","mins":"8:09 am","url":"https://shroudstory.com/2014/09/16/and-interview-with-lind-and-antonacci/","cat":"carbon_14_dating","title":"An Interview with Lind and Antonacci"},{"id":"comment-206318","author":"john_green","post":"Thanks Hugh for clearing that up for me..","date":"2015-07-22","mins":"8:02 am","url":"https://shroudstory.com/2015/07/22/interesting-article-on-radiocarbon-dating/","cat":"carbon_14_dating","title":"Interesting Article on Radiocarbon Dating"},{"id":"comment-206312","author":"john_green","post":"Interesting! Now the question is that we know that the shroud was in a fire do we know if any burning wood was around that fire? If so would this cause a problem with the C 14 dating?.","date":"2015-07-22","mins":"7:02 am","url":"https://shroudstory.com/2015/07/22/interesting-article-on-radiocarbon-dating/","cat":"carbon_14_dating","title":"Interesting Article on Radiocarbon Dating"},{"id":"comment-192507","author":"john_green","post":"Gee if only experts can comment there would be very few, if any could post here, Maybe Mark Goodacre has read the same reports that everyone else had so he is using the expert’s opinions in his own opinion..","date":"2015-03-05","mins":"10:10 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193138","author":"john_green","post":"Charles, “One should never underestimate a period where apprentices started at ten or twelve” I think the average age they died to was like in the 20’s. That’s why that, “until death do us part” thing wasn’t that bad back then..","date":"2015-03-11","mins":"1:58 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-215129","author":"john_green","post":"Louis As you know there are scientist on both sides of the issue of God. One of great scientist Francis S. Collins wrote a book, “The Language of God A Scientist Presents Evidence for Belief.” Oh, and Mr. Collins believes in the God of the Bible. Another great book is, “Quantum Questions Mystical Writings of the World’s Greatest Physicists.” It has writings from people like Heisenberg, Schroedinger, Jeans, Pauli and others. I reread this book at least once a year. We had a program on PBS TV called “Closer to Truth” where they looked at questions about the universe, God, consciousness and meaning by interviews with our leading scientists, philosophers, scholars and theologians. They have a website with all the videos they did and they cover both sides of the issues. Http://www.closertotruth.com The debate of an uncaused event goes back to at least Aristotle and Plato. One side says the Universe is uncaused event, the other sides says no it’s not, God caused it. The other side comes back and ask, “What caused god?” Some accept the idea of a metaphysical necessity the other side rejects it. William Lane Craig defends the kalam cosmological argument the other side claims his reasoning is unsound. It goes on and on. Plato’s, “Allegory of the Cave” rings true. I think we are still in the stages where reality is just shadows on the wall. I feel Jesus, Buddha, Lao tzu and others have tried to bring us out of the shadows..","date":"2015-11-26","mins":"6:52 am","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215086","author":"john_green","post":"Carrol in part writes about the book , “The Soul Fallacy”. Just reading the reviews on Amazon he appears to uses science to argue that humans are just part of natural world and subject to the same laws. Here’s just part of one of the reviews, “Julien Musolino does for souls what earlier scientists did to witches: he explains why souls don’t exist, then shows that science offers a better explanation for the workings of the mind and other beliefs that souls supposedly explained, and finally offers a deeper, richer, and more fulfilling worldview grounded in science instead of superstition.” Since I have so many open the hard questions that science can’t answer right now I’ll keep an open mind on the idea of a soul..","date":"2015-11-25","mins":"8:07 am","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215130","author":"john_green","post":"PS Daniel Dennett also believes the universe had a cause, but it caused itself. Anyway the Dennett Mc Grath debate can be viewed on Youtube.","date":"2015-11-26","mins":"7:44 am","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"}]
