[{"id":"comment-193486","author":"john_green","post":"For me if there is real human blood found on the Shroud it would be a game changer. I don’t believe the evidence shows that now. Maybe someone should contact Dr. Henry Lee and ask him if one of his classes would take it on as a class project. I can’t do that right now, but it would be interesting to see what experts in forenic science have to say..","date":"2015-03-16","mins":"6:46 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193488","author":"john_green","post":"I forgot this https://www.facebook.com/UNH Dr Lee http://www.henryleeinstitute.com/.","date":"2015-03-16","mins":"6:55 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193497","author":"john_green","post":"Why would they use a human blood? Why not a goat or a sheep or just paint? Do you think he/she/they was thinking, Well I/we can’t do this because 700 years from now they will finds a way to tell if it’s real human blood (or paint for that matter)..","date":"2015-03-16","mins":"8:12 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193515","author":"john_green","post":"Charles Things like blood and DNA break down over time. Water and heat causes a faster break down and the Shroud was subject to both so we may never know if it’s human blood..","date":"2015-03-16","mins":"11:21 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193865","author":"john_green","post":"Eric Yeah Penrose and Hameroff wrote a rebuttal of Max Tegmark alone the same line as you and Tegmark has not as of yet replied. Now a research group in Japan says that they discovered warm temperature quantum vibrations in microtubules that would seem to help P & H in part of they theory, but I don’t believe it was confirmed yet by others. And as I wrote he is just one that has problems with it there are many others that disagree with P & H. Penrose and Hameroff are very smart guys, but so is Tegmark. His book, “Our Mathematical Universe” has been well received by people like Brian Greene and Michio Kaku, in fact Kalu wrote this about his book; “Daring, Radical. Innovative. A game changer. If Dr. Tegmark is correct, this represents a paradigm shift in the relationship between physics and mathematics, forcing us to rewrite our textbooks. A must read for anyone deeply concerned about our universe.” —Prof. Michio Kaku, author of Physics of the Future The back cover of his books says that he is the author or coauthor of more than 200 technical papers, twelve of which have been cited more than 500 times. He is also a well respected professor at MIT. He may be right or wrong, but he’s no idiot. What I see is that Penrose and Hameroff are saying that consciousness just a normal physical property of the brain not unlike V. S. Ramachandran and other has claimed. As far as “elite name” go, didn’t Newton believe he could turn metal into gold? But let me tell you a story of an my dealing with a elite name, In the 1980’s I had a beloved dog that came down with cancer. I took her all over trying to cure her and one day I was in a book store and found a book by Linus Pauling(Nobel Prizes) about using vitamin c for cancer. In the book he explained how vitamin c cures cancer and gave many cases where he said it work, but also cases that failed. Well he made excuse after excuse about why it didn’t work and that set off a flag, but I continued to believe in Pauling. I called his research lab in CA and I get this doctor with a heavy German accent. I explain my dog’s problem and he says to me, “Maybe it’s time for the Final Solution.” I was a little in shock, seems I heard that somewhere before, but he agrees to tell me how to treat my dog. Long story short, the dog died and Pauling continued claiming vitamin c cures cancer, then his wife died (of cancer) and then he died (of cancer). So I respect the works of Penrose and Hameroff (I have their books) but I also respect the opinions of others. Now I’m going to go wait for the last snow of this year (I hope)..","date":"2015-03-20","mins":"10:14 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193504","author":"john_green","post":"John I don’t believe you need a formal education in a field to research it and have an opinion. I made a name for myself in a field outside of my own with just a few months research. That does mean I don’t give a lot more weight to an expert in that field, I just don’t dismiss something because he’s not a expert. If they did they research and they are well reasoned I consider it. Having said that Penrose and Hameroff’s Orch OR theory has been harshly criticized by those in mathematics and science. Max Tegmark in just one of them. In his book, “Our Mathematical Universe” ( I’m a bookworn also) he argues that it’s killed by decoherences. He also wrote a paper on it. Http://arxiv.org/abs/quant ph/9907009.","date":"2015-03-16","mins":"9:55 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193874","author":"john_green","post":"“Tegmark [161] published a critique of Orch OR based on his calculated decoherence times for microtubules of 10−1310−13 seconds at biological temperature, far too brief for physiological effects. However Tegmark didn’t include Orch OR stipulations and in essence created, and then refuted his own quantum microtubule model. He assumed superpositions of solitons separated from themselves by a distance of 24 nanometers along the length of the microtubule. As previously described, superposition separation in Orch OR is at the Fermi length level of atomic nuclei, i.e. 7 orders of magnitude smaller than Tegmark’s separation value, thus underestimating decoherence time by 7 orders of magnitude, i.e. From 10−13 s10−13 s to microseconds at 10−610−6 seconds. Hagan et al. [162] used Tegmark’s same formula and recalculated microtubule decoherence times using Orch OR stipulations, finding 10−410−4 to 10−310−3 seconds, or longer. In any case, experimentally, Bandyopadhyay’s group has found 10 k Hz resonance, i.e. 10−410−4 seconds coherence times. Also, as stated earlier, there are versions of the beat frequency scheme that would require much shorter decoherence times, though at the expense of correspondingly larger bodies of material being involved in the quantum coherent states.” http://ac.els cdn.com/S1571064513001188/1 s2.0 S1571064513001188 main.pdf? tid=da8a9dd0 cf03 11e4 b214 00000aacb35f&acdnat=1426857798 1ba0f14847f4296ee65c9d4ccaa1a6e2.","date":"2015-03-20","mins":"11:23 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-194856","author":"john_green","post":"I did, You ask a question that already has your conclusion in it. You have already concluded it’s the body of Jesus on it in your question. Assuming it is Jesus you still only have a sample size of one, unless you have other Shroud from that period to compare it with. I think we already talked about sample size here before. I already posted a true case where a guy killed a lady and placed her nightgown over her face and buried her. When they found her there was an image of her face on the nightgown. Some will say it’s not the exact same image as the Shroud and that may be true, but it’s not the same conditions. The point is a dead body can leave an image. I’m not saying it’s not Jesus, only that so far there is no real proof, it’s still being debated by some really smart people here..","date":"2015-03-30","mins":"9:30 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-194852","author":"john_green","post":"Louis wrote, “why should it have happened only to the body of Jesus?” That’s like the question, “When did you stop beating your wife?” There are two problems here. First the conclusion is in the question itself. Second, you are working with a sample size of one..","date":"2015-03-30","mins":"8:58 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-177998","author":"john_green","post":"Demand a jury trial!.","date":"2014-12-20","mins":"11:10 am","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","title":"New Paper by Pam Moon"}]
