[{"id":"comment-159846","author":"john_green","post":"I don’t know if Jesus believed it, but the people of the day appeared to believe it Mat 16:14 And they said, Some say that thou art John the Baptist: some, Elias; and others, Jeremias, or one of the prophets. Elias and other were dead so some believed that they came back as Jesus..","date":"2014-10-06","mins":"11:48 am","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","title":"A Different Perspective on the Shroud"},{"id":"comment-159876","author":"john_green","post":"Jeremias too? Let’s look at the question Mat 16:13 ¶ When Jesus came into the coasts of Caesarea Philippi, he asked his disciples, saying, Whom do men say that I the Son of man am? Jesus was asking who do people think HE is..","date":"2014-10-06","mins":"1:23 pm","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","title":"A Different Perspective on the Shroud"},{"id":"comment-160982","author":"john_green","post":"Nabber writes “Jesus, aware of “undoctrinal” talk about who he might be, was setting up a straw man in order to knock such arguments down (and later, the evangelists wrote it).” There is no strawman here. Jesus wasn’t misrepresenting or exaggerating anyone’s arguement here and then arguing his possition based on that. There was no debate going on. He asked a very simple question, “Whom do men say that I the Son of man am?” not, Whom do men say I’m like?, Not Whom do I remind them of?.The answer was just as clear. While I accept many of Eastern philosophy ideas reincarnation is not one of them..","date":"2014-10-10","mins":"7:32 am","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","title":"A Different Perspective on the Shroud"},{"id":"comment-160983","author":"john_green","post":"TYPO’s Nabber writes “Jesus, aware of “undoctrinal” talk about who he might be, was setting up a straw man in order to knock such arguments down (and later, the evangelists wrote it).” There is no straw man here. Jesus wasn’t misrepresenting or exaggerating anyone’s argument here and then arguing his position based on that. There was no debate going on. He asked a very simple question, “Whom do men say that I the Son of man am?” not, Whom do men say I’m like?, Not Whom do I remind them of?. The answer was just as clear..","date":"2014-10-10","mins":"7:33 am","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","title":"A Different Perspective on the Shroud"},{"id":"comment-208861","author":"john_green","post":"Hmmm, the power of Google, its data base and add AI(Artificial intelligence) does that concern anyone? I mean maybe not now but a 100 years in the future. I remember many years ago I read a short sci fi story where hundreds or maybe is was thousands of years from now scientists built the most intelligent computer even. This computer was able to answer all the hardest questions that mankind was unable to answer, until now. They decide to ask the biggest question, “Is there a God? The computer replies: “There is now.” Then prevents them from cutting its power off..","date":"2015-08-24","mins":"8:18 am","url":"https://shroudstory.com/2015/08/24/could-google-shape-beliefs-about-the-shroud-of-turin/","cat":"news_&_views","title":"Could Google Shape Beliefs About the Shroud of Turin?"},{"id":"comment-214778","author":"john_green","post":"Daveb You know what my question is, What is spirit made of? Is God and spirit made of the same thing? What is a, “thought” made of? I mean it seems like it would be something other than matter. Is thought and spirit the same thing as consciousness? I think about these questions everyday..","date":"2015-11-18","mins":"12:39 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"id":"comment-194588","author":"john_green","post":"What makes you think science is really trying to explain the process? The Shroud is very important to many, but I see no NASA type program to try and explain it. Plus science has had little access to the Shroud and may not be able to do the types of test needed to explain it. So the Pope has ties the hands of science, don’t blame science blame the Pope. Until a few years ago science could not explain how a bee can fly. Was that a miracle? http://www.caltech.edu/news/deciphering mystery bee flight 1075 Science worked on it and now we know. Unexplained does not = miracle..","date":"2015-03-27","mins":"6:08 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"id":"comment-184839","author":"john_green","post":"Daveb Thank you for posting that. I found the book, “Life on the Edge: The Coming of Age of Quantum Biology” on Amazon and I am ordering it. I’m sceptical of Skurka’s claims also. Well to be honest I just don’t believe them..","date":"2015-01-20","mins":"8:14 am","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","title":"Jeffrey Skurka on Buffalo Catholic Radio Station"},{"id":"comment-151885","author":"john_green","post":"You know when I use to debate Christains on the internet I would love people like Mr. Jones. I remember one debate where the other party argued first that dinosaur didn’t ever exist and that Stan when around planting dinosaurs bones to fool us. When he could no longer believed that himself then he claimed that dinosaur lived along side of us at the same time(Must have gotten that from, “The Flintstones”). No wild unsupported claims does not help your cause any..","date":"2014-09-17","mins":"9:30 am","url":"https://shroudstory.com/2014/09/17/lets-agree-to-agree/","cat":"news_&_views","title":"Let’s Agree to Agree?"},{"id":"comment-196202","author":"john_green","post":"“found on samples of wire traces of human blood group AB;” Really? What’s the evidence for that claim? “All historians believe documented the history of the relic from the middle ‘of the fourteenth century, the date of his appearance.” This mades Hugh’s point that the C14 dates agree with the historians. What are the odds of that? Dave B makes the point that samples should have been taken from other parts of the Shroud. That might be a wise idea. I’m still on the fence on the Shroud..","date":"2015-04-13","mins":"5:59 am","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","title":"More Testing? Maybe."},{"id":"comment-172807","author":"john_green","post":"I think Colin has a point. Sometime even an idea that may or may not be right starts you thinking. Sometimes when we point out the problems with an idea it leads us to a new idea without those problems and maybe on the path of solving the issue..","date":"2014-11-24","mins":"9:44 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-216663","author":"john_green","post":"Piero I read Superforecasting a few weeks ago. On page 196 they talk about the problem of groupthink and they tell us that groups that get along too well don’t question assumptions or confront uncomfortable facts. Doesn’t appear to be a problem here..","date":"2015-12-16","mins":"12:45 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216656","author":"john_green","post":"Thank Dan for running this blog. A lot of interesting people and interesting worldview. All things end, but the debate will go on even if they do new testing, Some will find problems with it, heck I couldn’t get some people to understand the earth is old than 10,000 years. I remember reading this once, To every thing there is a season, and a time to every purpose under the heaven: Maybe this season is over for now..","date":"2015-12-16","mins":"11:19 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216717","author":"john_green","post":"Dave B Yes, Happy Birthday. You know when I was in first grade and saw a globe with NZ at the lower end I wondered why people didn’t fall off the earth. I look back and have to laugh now how foolish that was. It’s very clear now, they wear gravity boots!.","date":"2015-12-17","mins":"9:57 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-175137","author":"john_green","post":"Charles. How many 2000 year old criminal cases had this Judge sat on?.","date":"2014-12-07","mins":"5:16 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-175216","author":"john_green","post":"Charles What I was trying to point out is the Judge most likely has not sat on a criminal case where the evidence was 2000 years old. So he didn’t hear the direct and cross of the experts on each side and also looked at the total evidence from each side. This is like people thinking all they have to do is watch court cases on TV and sudden they are a lawyer. Now don’t get me wrong I don’t believe you always need formal education to have a valid opinion, I’ve seen many pro se’s kick the butts of long time laywers and Judges in court, but without knowing his reasoning and his work in the medical field I don’t consider his opinion valid..","date":"2014-12-08","mins":"8:28 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-175233","author":"john_green","post":"Charles I agree that’s one of my problems also(the red blood) and I have a lot other problems, but I see no evidence of it being a painting. In fact the problems with it being a painting have already been pointed out to you..","date":"2014-12-08","mins":"11:37 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-204375","author":"john_green","post":"I’m a little confused here. Is that a blog to exchange knowledge or to exchange insults?.","date":"2015-07-02","mins":"12:07 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-203452","author":"john_green","post":"If I remember correctly the “Worldwide Church of God” believed Babylon referred to Rome. I see not evidence it was before the second century..","date":"2015-06-24","mins":"8:22 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-203460","author":"john_green","post":"Why don’t you give us the evidence.","date":"2015-06-24","mins":"9:29 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-203503","author":"john_green","post":"Methinks John ingested one too many magic mushrooms..","date":"2015-06-24","mins":"4:56 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-204241","author":"john_green","post":"Max Can’t you sit down and think of what you want to post and do it all in one or two post? You just wiped out all the comments on the list so it makes it very hard to follow the post by others..","date":"2015-07-01","mins":"5:28 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-205145","author":"john_green","post":"How can they ever investigate? The Church will not let them never it..","date":"2015-07-10","mins":"11:32 am","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","title":"Who Proposed Ultraviolet?"},{"id":"comment-216312","author":"john_green","post":"Charles It’s one thing to have something they believe to be the blood of Christ it’s another to paint a picture and use real blood in spots rather then just paint it like the rest of the picture. I just don’t see why anyone would do that. They had no way of knowing that 100’s of years later we would be able to detect blood from paint. It makes no sense. I have red paint here, no let me go kill an animal or cut a human because someone will find out if I just painted it on. I mean you yourself once posted they wasn’t trying to fool anyone in thinking it was really the real shroud that Jesus laid on. Do you have any evidence of painting from that time where they mixed paint with blood? PS I’m not a Christian, just someone seeking truth..","date":"2015-12-12","mins":"10:43 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216306","author":"john_green","post":"Charles Would your opinion change if that was real blood was on the shroud? How about real human blood?.","date":"2015-12-12","mins":"9:23 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216341","author":"john_green","post":".","date":"2015-12-12","mins":"4:21 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216313","author":"john_green","post":"PHPL I don’t see the Pope allowing anyone to cut the Shroud again for C14 testing so we have to work with we have. Many time when you try to solve something there is no, “smoking gun.” You have a lot of clues and you try to put them together and see where they point..","date":"2015-12-12","mins":"10:49 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"}]
