[{"id":"comment-180715","author":"john_green","post":"Yes science may work without a god, but many of the leading physicists wrote that there may be something more to reality than we know. We have Sir James Jeans’s favorite phrase, ” God is a mathematician, and the universe begins to look like a great thought than a great machine.” And Ken Wilber put together some of the mystical writings of Heisenberg, Schroedinger, Einstein, de Boglie, Jeans, Planck, Pauli and Eddington is his book, “Quantum Questions Mystical Writings of the World’s Greatest Physicists.” So there is and was a lot of mystical thinking in Physics. Having said that I agree the question of evil is a big problem along with the myths of Adam and Eve, the flood, etc.. PS Some other really good books along the same lines are “The TAO of Physics An Exploration of the Parallets between Modern Physics and Eastern Mysticism” by Fritjof Capra and “How the Hippies Saved Physics Science, Counterculture and Quantum Revival” by David Kaiser.”.","date":"2015-01-02","mins":"7:10 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-201630","author":"john_green","post":"I’ve already posted about a guy who kills this lady and puts her nightgrown over her face and when they found the body and looked at the nightgrown there was an image of her face on it. Louis posted about this guy who died and left a outline of part of his body on the bed. So it appears that a dead body can leave an image. And when I heard people write that it’s not the same as the Shroud I’m reminded of what Heraclitus wrote, “No man ever steps in the same river twice, for it’s not the same river and he’s not the same man.” Since we really don’t the exact conditions of the event I don’t think we can rule out a natural event no matter how very, very rare it happens. If we don’t consider it may have be a natural event we have to deal with Louis’s question. I believe it was someone like, why this Shroud was saved..","date":"2015-06-11","mins":"9:54 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-155892","author":"john_green","post":"John, Reality is very complex as you write. In Plato’s “Allegory of the Cave” he talks about what we see as reality are really just shadows of reality. That’s as true back then as it is now. Having said that let me say I’m an agnostic and not a fool. For years I debated Christains on the internet many of whom were fundamentalist who believed the earth was only 10,000 years old, the grand canyon was caused by the world flood, Satan when around planting Dinasaw bones, etc.. They didn’t even know what their own Christain scholars have written. Should I consider all Christains fools because of a small group? Just because someone may disagree with you doesn’t mean they are less imformed as you. Nor does it mean they are any less able to judge the evidence..","date":"2014-09-25","mins":"11:26 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","title":"Mars, Weeping Mary and the Shroud"},{"id":"comment-161633","author":"john_green","post":"Just from the text of the NT Jesus was very big on faith. Matt 9:22 “thy faith hath made thee whole” Matt 9:29 “According to your faith be it unto you.” Mark 2:5 “When Jesus saw their faith, he said unto the sick of the palsy, Son, thy sins be forgiven thee.” Luke 7.50 “Thy faith hath saved thee; go in peace.” Luk 17:5 “And the apostles said unto the Lord, Increase our faith.” Now I can add a many more quotes but I’ll end it with this Jhn 20:29 “Jesus saith unto him, Thomas, because thou hast seen me, thou hast believed: blessed are they that have not seen, and yet have believed.” Jesus was also big on mystery but I’ll save that for another post. PS I’m not a Christain.","date":"2014-10-12","mins":"8:24 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-155907","author":"john_green","post":"Dinosaur.","date":"2014-09-25","mins":"11:40 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","title":"Mars, Weeping Mary and the Shroud"},{"id":"comment-156803","author":"john_green","post":"Yeah I also have a problem with people that don’t look at both sides. I don’t buy the carbon dating and I think it’s more likely than not that the shroud authentic and the image is of Jesus. What caused it I’m not sure right now..","date":"2014-09-26","mins":"9:28 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","title":"Mars, Weeping Mary and the Shroud"},{"id":"comment-154430","author":"john_green","post":"“While Colin Berry’s investigations into scorching by templates may assist in illuminating the possible process by which the TS image might have been formed,” Daveb I agree and what Colin is doing is important, but it tells us nothing about if it’s authentic or non authentic. Let’s assume that it’s a scorch done by heat. Does that mean that someone in the 13 hundreds used a hot rod like a soldering iron create the image? How about a hot metal figure? Well if you heat this figure and drape a linen over it you would have to heat that figure to the same even temperature all over. How would someone using technology in the 13 hundred do that? All those questions and many more have to be answered before you can claim it was produced by someone in the 13 hundreds..","date":"2014-09-23","mins":"4:15 pm","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","title":"Samuel Johnson Meets His Match"},{"id":"comment-149426","author":"john_green","post":"Has it been proven that it’s a, “first century fine linen shroud”..","date":"2014-09-08","mins":"7:55 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"}]
