[{"id":"comment-196841","author":"john_green","post":"Scholars are still debating certain words translated from the Greek, but that’s just part of the problem. Most likely Jesus spoke the Aramaic language. We can see that in Mark’s translation in Mar 15:34 “And at the ninth hour Jesus cried with a loud voice, saying, Eloi, Eloi, lama sabachthani? which is, being interpreted, My God, my God, why hast thou forsaken me?” So you have a translation of a translation. Here’s what can go wrong with transations. Some ad’s ran in other countries. Http://www.baetzler.de/humor/ads gone wrong.html.","date":"2015-04-19","mins":"12:37 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-142608","author":"john_green","post":"It appears that you assume that the shroud is forgery. What is your evidence for that? You and tens other others like you have tried to reproduce it with the technology of today and as far as I can see no one has done it so far and hot medal statue idea makes zero sense, but that’s for another post. I agree that there is no evidence for a supernatural event, but why can’t it be a natural event? Maybe it was a natural thermo chemical process with a human body. It seems that you started with a conclusion and are working backwards to support it. And a supernatural event is not any stranger than a Quantum event. I mean science makes up all type of crap to cover holes in their theories. Hawkins tries to explain away the universe with M theory (ZERO Evidence for M theory) and multiple universes (ZERO Evidence for universes). Other people in science just toss in multiple universes to solve the problems they can’t explain, the multiple universes did it, multiple universes of the gap. So tell me the what is the direct evidence for forgery. I’m an agnostic (eastern mystic wannabe) so I don’t have a dog in this fight. PS A great book to read is “Quantum Questions Mystical Writings of the World’s Greatest Physicists” edited by Ken Wilber..","date":"2014-08-06","mins":"11:38 am","url":"https://shroudstory.com/2014/08/05/5050-colin-berrys-most-outlandish-proposal/","cat":"other_blogs","title":"50/50  :  Colin Berry’s Most Outlandish Proposal"},{"id":"comment-213632","author":"john_green","post":"John, Have you ever considered giving a TED talk on the Shroud?.","date":"2015-10-26","mins":"9:29 am","url":"https://shroudstory.com/2015/10/26/dan-spicer-we-have-a-simple-explanation/","cat":"critical_summary","title":"Dan Spicer:  We have a simple explanation."},{"id":"comment-213639","author":"john_green","post":"I’m not sure not it works, but here’s the contact information. Https://support.ted.com/customer/portal/emails/new.","date":"2015-10-26","mins":"12:00 pm","url":"https://shroudstory.com/2015/10/26/dan-spicer-we-have-a-simple-explanation/","cat":"critical_summary","title":"Dan Spicer:  We have a simple explanation."},{"id":"comment-213640","author":"john_green","post":"Correction I’m not sure how it works, but here’s the contact information..","date":"2015-10-26","mins":"12:01 pm","url":"https://shroudstory.com/2015/10/26/dan-spicer-we-have-a-simple-explanation/","cat":"critical_summary","title":"Dan Spicer:  We have a simple explanation."},{"id":"comment-97186","author":"john_green","post":"“Usually, even a non Christian knows something about the earth, the heavens, and the other elements of this world, about the motion and orbit of the stars and even their size and relative positions, about the predictable eclipses of the sun and moon, the cycles of the years and seasons, about the kinds of animals, shrubs, stones, and so forth, and this knowledge he holds to as being certain from reason and experience. Now, it is a disgraceful and dangerous thing for an infidel to hear a Christian, presumably giving the meaning of Holy Scripture, talking nonsense on these topics; and we should take all means to prevent such an embarrassing situation, in which people show up vast ignorance in a Christian and laugh it to scorn. The shame is not so much that an ignorant individual is derided, but that people outside the household of the faith think our sacred writers held such opinions, and, to the great loss of those for whose salvation we toil, the writers of our Scripture are criticized and rejected as unlearned men…. Reckless and incompetent expounders of Holy Scripture bring untold trouble and sorrow on their wiser brethren when they are caught in one of their mischievous false opinions and are taken to task by these who are not bound by the authority of our sacred books. For then, to defend their utterly foolish and obviously untrue statements, they will try to call upon Holy Scripture for proof and even recite from memory many passages which they think support their position, although they understand neither what they say nor the things about which they make assertion.” Augustine(Bishop of Hippo).","date":"2014-04-06","mins":"5:03 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","title":"Stephen Jones is even questioning my beliefs about the Resurrection"},{"id":"comment-202500","author":"john_green","post":"This was on WNBC this morning http://www.today.com/video/centuries old debate over shroud of turin authenticity persists 465947203892.","date":"2015-06-17","mins":"8:38 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","title":"Stephen Jones on the Thomas De Wesselow Presentation"}]
