[{"id":"comment-204732","author":"john_green","post":"I found an author that is new to me, Fr Richard Rohr and his newest book is, “What The Mystics Know Seven Pathways to Your Deeper Self” He writes about enlightment, getting into a higher consciousness and finding the real Self. He is a Christain and believes in the bodily resurrection of Jesus, but he sounds a lot like another subject I’m studying, consciousness and Kashmir Shaivism. After finishing his latest book I went back on Amazon and ordered a few more of his book(he writes a lot), he has a very interest point of view..","date":"2015-07-06","mins":"8:14 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","title":"Christian Faith Eroded to the Very Core?"},{"id":"comment-198139","author":"john_green","post":"“Despite being the most studied artifact in history … modern science is still unable to explain the image or how it was made.” Two problems with that statement; 1. You assume that, “modern science” is really trying to solve it. Other than a few people I don’t see that. 2. They can’t get at it to do more test. Today’s science is not the same as 1978’s or 1988’s science. We know more on what to look for now. Here’s the way I see it. Daveb came up with a good idea to do new C14 test, but I don’t think that the church is ready for that. How about new blood test? Right now I’m 50 50 on the Shroud, but if there is real human blood than I would be 90 10 that’s it’s the real deal. I bet there are a lot of people like me. Real Human blood is very powerful evidence for me. What does the church have to lose? Most Christain I came across believe because of the Bible,not the Shroud. Other that don’t believe may take a new look at that Bible. It’s a win win..","date":"2015-05-02","mins":"9:01 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-200450","author":"john_green","post":"I remember reading a book call, ” The Passover Plot” back in the 60’s(That’s about all I remember of the 60’s, well maybe wookstock also). If I remember correctly it had the same idea that Jesus didn’t die on the cross. If a man is beaten that badly I just don’t see him up and around a few days later..","date":"2015-05-28","mins":"3:55 pm","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"id":"comment-197624","author":"john_green","post":"Angel It doesn’t matter unless you can tell us where the Shroud was every day in the last 700 years and every person who came into contact with the Shroud and where they came from. The pollen could have been deposited at anytime during the last 700 years..","date":"2015-04-26","mins":"4:42 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197514","author":"john_green","post":"The pollen is meaningless unless you can show a chain of custody. Someone from Jerusalem in the last 700 years could have traveled to where it was, carrying pollen on him and touch the Shroud. The Shroud could have traveled at some point to Jerusalem and picked it up in the last 700 years. Each is very possible ..","date":"2015-04-25","mins":"8:11 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197515","author":"john_green","post":"PS In no way do I agree with most of the statements made by Joe. ..","date":"2015-04-25","mins":"8:22 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197719","author":"john_green","post":"John Klote “Ultimately science and religion will meet on these issues and find expression for them in quantum mechanics.” If you read the mystical writings of De Broglie, Sir James Jeans, Werner Heisenberg, Erwin Schroedinger, Max Planck, Wolfgang Pauli and others you would think it already has began. For the last few years I’ve been studying Eastern Philosophy. Right now I’m studying the Kashmir Shaivism school of EP. In his book, “Consciousness is Everything” Swami Shankarananda he tells us that Kashmir Shaivism teaches us that there is only consciousness and that it’s the only substance in the universe. Everything that appears different is just consciousness vibrating at a particular frequency and behaving in a specific way ( sound like string theory or Penrose?). Everything is one. To them Shiva, the divine being, is consciousness itself. And we are all a part of the divine. The divine is in all of us? Isn’t that what Mat 25:35 40 telling us? You can replace Shiva with Jesus if you like. I don’t believe in their gods, or that we are born again but this helps me understand the Bible better. PS Got up this morning and hit my post toe on the bed post, hurt like hell, but it reminded me to write this post. I started thinking, all the books I’ve read on neuroscience they tell me that the brain itself doesn’t feel pain. Is it an illusion like some claim consciousness is? Just neurons firing? We don’t know! Oh and how many neuron connections do we need before something is conscious? Is a fruit fly conscious? Do we need neurons at all? Is the universe itself conscious? Is what Sir James Jeans said, “the universe begins to look more like a great thought than a great machine.” Is that true?.","date":"2015-04-27","mins":"5:29 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197722","author":"john_green","post":"Correction you would think it already began. To save time all othe typos are intentional.","date":"2015-04-27","mins":"5:34 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197737","author":"john_green","post":"Louis Religion: : the belief in a god or in a group of gods : an organized system of beliefs, ceremonies, and rules used to worship a god or a group of gods : an interest, a belief, or an activity that is very important to a person or group I think Hinduism falls under that. Next, you can have a philosophy of life with no god or gods. My beleif system is a philosophy so I agree on that point. Next, Chistains also has many schools of interpretations and they can’t even agree what books should be in the Bible. Next, The Bible also has man many, many contradictions. Next, The God of the OT was a;also a god of destruction. Remember the claimed flood? Remember all the times God told the jews to go over here and kill these people? Now go over here and kill those people. Oh and Sliva is also the restorer. I’ve Just added “Return to the Centre” to my Amazon wish list. I think there is about 300 books on it so it may take a while. But it looks interesting so thanks for suggesting that. I studied the bible and all the subject about is for about 30 years. I use to read all the debates in Biblical Archaeology Review. I’ve read the Nag Hammadi Library many times(I find the Coptic Gospel of Thomas very interesting). All this made me an agnostic. Many years ago I was debated Christian on the internet. Some of the debates were that the earth is 5 or 10 thousands years ago, dinasaurs and humans walked the earth together, maybe they got that from the flintstones, etc.. That turned me into an agnostic with atheist leanings. I started studying Eastern Philosophy only a few years ago so I’m still new to this. Now I’m a agnostic with Eastern Philosophy leanings. Having a philosophy allows me to pick from many areas. And it allows me to look at the Shroud without at this time to a belief system..","date":"2015-04-27","mins":"9:48 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197755","author":"john_green","post":"Louis Hinduism is clearly a religion unless you want to redefine the meaning of religion. Go to Amazon and type in “World Religions” and you will find books which that list Hinduism as a religion. The Norton Anthology of World Religions list Hinduism as a religion. Christains believe God revealed things to them and Lord Sliva is claimed to have revealed Tantra to them. Neither one of them can prove a god revealed anything so if that’s the test both are philosophy. Now remember I am talking about, Kashmir Shavism and for me I agree that’s a philosophy more than a religion. Http://www.themovementcenter.com/about/philosophical foundations/ Kashmir Shaivism “The practitioners of nondualistic Kashmir Shaivism came to view the world as absolute Consciousness, which they called Shiva. This Consciousness, being both one and free, creative and self reflective, was revealed as the fundamental I, or Divine Self. Thus, Kashmir Shaivism emphasizes the inner Self. The systematic growth of Kashmir Shaivism unfolded as practitioners reflected on the nature of the highest reality, describing it as pure Consciousness.” I have not read anything by Wendy Doniger yet. I looked on Amazon and read some of the reviews about her book, “On Hinduism.” It has 48% 1 stars and only 21% 5 stars. She is a Professor of Religions so I don’t dismiss her and since I like to read all sides of an issue maybe I’ll read her book, but right now I’m into the Yoga of .Kashmir Shaivism Now if the Shourd is proven to be authentic that would put it in a new ball park. I don’t know either way but I kind of like the Kashmir Shaivism idea that the person before me, like me, is part of the divine. And if I can suppress the ego I can find self and the divine within me..","date":"2015-04-27","mins":"11:51 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197822","author":"john_green","post":"Louis Maybe you missed it in my first post on this. I repeat, “I don’t believe in their gods, or that we are born again but this helps me understand the Bible better.” I can pick apart things they believe in and I can do the same for what Christains believe in. What you are saying is as wrong as if I was to say the Catholic Church believes it ok for priest to have sex with young boys and they will just cover it up. And guess what a Christain nation ruled India untill 1947, shall we blame them for all the problems india on Christains? How about all the suffering evil people caused in the name of Christ, does the Spanish Inquisition ring a bell? Louis give us your data that supports your claim that believing believing that the person before me, like me, is part of the divine is the reason for so much suffering in India. Using you logic I could never lose at the race tract because I noticed that every horse that wins has a jockey on it so all I have to do is bet every horse with a jockey. Kashmir Shaivism teachs that before you can come to the divine in you must get go beyond ego and come with love and forgiveness to others. How is that not Christ like? I don’t know where you are getting your information from, but it’s wrong. Here, how’s this; “One may amass wealth with hundreds of hands but one should also distribute it with thousands of hands. If someone keeps all that he accumulates for himself and does not give it to others the hoarded wealth will eventually prove to be the cause of ruin.” Atharva Veda 3: 24 25 Is that Un Christ like? PS I went to Catholic school when I was a kid, but I don’t let any group or person do my thinking for me. I do my own research and decide for myself what works for me..","date":"2015-04-28","mins":"5:54 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197834","author":"john_green","post":"Louis You’re right, I don’t understand you. Here’s what you wrote “This “inner self” concept you refer to leads to selfishness and that is the reason for so much suffering in India, with millions of beggars.” I’m still waiting for your data of that. Maybe that person kicking the begger was a Christain. It appears you don’t understand the concept. To find the “inner self ” is to go beyond the ego, it’s the ego that causes all these problem, not the teachings. Just because all Hindus don’t follow all the teachings of Hinduism does that make the teachings bad? Hey, guess what, not all Christians follow the teachings of the Bible, are the teachings wrong? Isn’t that why Jesus came? You do know that the peak of poverty in Indea was in the 1920’s under the rule of a Christian nation. Gandhi led the way to get rid of that Christain nations wrongs, oh and he was a Hindu. THE USA is a claimed Christian nation. We have lot of people homeless, we bomb other people, Long at all the people we killed in that war in the 60’s. Children go to bed without food, we shot unarmed people, the 1% control almost everything. India is growmg fast, more and more people are getting jobs. India is very young under non Christian rule. When the USA started Christians owned blacks and beat and killed them. Oh and the KKK, the group that killed blacks at will was a Christain group. Shall I can go on and on Louis. Shall I tell you how many, “Christains” commit horrible crimes all over the world? Shall I say that the teaching of Jesus theoretically sounds fine, but in practice it doesn’t work? You want to tell us what Jung said I can tell you what Bart D. Ehrman wrote. Why waste the time? Oh and Chriatians have contradictory beliefs also. Louis you may believe that only what you believe is valid, that’s fine. I don’t believe I and only I hold the truth and only my way is the right way. Many of the things I believe may be proven wrong. I just telling what works for me..","date":"2015-04-28","mins":"8:16 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197840","author":"john_green","post":"Louis I can go into detail the contradictory beliefs of the Bible and science and known facts, but I’m not going to do that. I did that for years and I have nothing to show for it. I believe that many belief systems have a lot in common and I’m trying to bring belief, science and consciousness together. This is taking for that so I will end my comments here..","date":"2015-04-28","mins":"8:39 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-192093","author":"john_green","post":"O.K. Wikipedia is totally unreliable by itself, this is well known. Http://www.dailymail.co.uk/sciencetech/article 2131458/Up articles Wikipedia contain factual errors.html http://www.catholicplanet.org/articles/wikipedia errors.htm.","date":"2015-03-01","mins":"7:48 am","url":"https://shroudstory.com/2015/02/28/hints-about-shroud-of-turin-episode-in-cnn-series/","cat":"press_coverage","title":"Hints About Shroud of Turin Episode in CNN Series"},{"id":"comment-189113","author":"john_green","post":"If you do a lot of reviews and they are helpful to customers Amazon will send you books (and products) for review before they are released to the public. Http://www.amazon.com/gp/vine/help.","date":"2015-02-04","mins":"11:45 am","url":"https://shroudstory.com/2015/02/04/a-most-anticipated-book-of-spring-2015-about-the-shroud-of-turin/","cat":"books","title":"A Most Anticipated Book of Spring 2015:  About the Shroud of Turin"},{"id":"comment-189338","author":"john_green","post":"Yeah Charles that is a big problem. In a sense Amazon is paying these reviewers with free stuff. I have also noticed that most times the first 5 reviewers are all 4 and 5 stars. If I read the author before and I like his/her work I may order a book just based on that without any reviews. If not I wait until it gets 1 and 2 star reviews before I read any of them..","date":"2015-02-05","mins":"8:11 am","url":"https://shroudstory.com/2015/02/04/a-most-anticipated-book-of-spring-2015-about-the-shroud-of-turin/","cat":"books","title":"A Most Anticipated Book of Spring 2015:  About the Shroud of Turin"},{"id":"comment-184018","author":"john_green","post":"Book are sent to some people to review before the publication dates. I’ve read reviewers stating that many times on Amazon. Unless I’ve read other books by the same authors I limit my buying a book unless there are over 30 reviews and I like a book with both bad and good reviews. I always read the one and two star reviews first. I feel that no matter what an author writes there will be some people that disagree with it and if I see none I question all the other 5 stars reviews..","date":"2015-01-17","mins":"7:21 am","url":"https://shroudstory.com/2015/01/16/book-the-physical-death-and-resurrection-a-surgeons-view/","cat":"books","title":"Book:  The Physical Death and Resurrection: A Surgeon’s View"},{"id":"comment-184030","author":"john_green","post":"BTW here’s an interesting book just exposed “Boy Who Came Back From Heaven.” Many times I find reading the reviews are as entertaining as reading the book..","date":"2015-01-17","mins":"8:01 am","url":"https://shroudstory.com/2015/01/16/book-the-physical-death-and-resurrection-a-surgeons-view/","cat":"books","title":"Book:  The Physical Death and Resurrection: A Surgeon’s View"},{"id":"comment-95148","author":"john_green","post":"Yeah, it sounds more like Eastern Philosophy or new age stuff..","date":"2014-03-31","mins":"6:06 am","url":"https://shroudstory.com/2014/03/30/john-klotz-wants-your-feedback/","cat":"books","title":"John Klotz Wants Your Feedback"},{"id":"comment-158873","author":"john_green","post":"John, You have to get some press. Maybe do a press release or 2. Maybe get on TV. Good luck..","date":"2014-10-03","mins":"9:25 am","url":"https://shroudstory.com/2014/10/02/new-book-the-coming-of-the-quantum-christ/","cat":"books","title":"New Book:  The Coming of the Quantum Christ:"},{"id":"comment-158932","author":"john_green","post":"PBS has a show, ” Religion & Ethics” they may be interested..","date":"2014-10-03","mins":"1:24 pm","url":"https://shroudstory.com/2014/10/02/new-book-the-coming-of-the-quantum-christ/","cat":"books","title":"New Book:  The Coming of the Quantum Christ:"},{"id":"comment-202950","author":"john_green","post":"John Klotz In Marilyn Schlitz’s new book, “Death Makes Life Possible” she has an interview with Hameroff and they are talking about what happens at the time of death. Hameroff ” As the heart stopped, and the blood stopped flowing, and the blood pressure pretty much went to zero, this number dwindled down to about zero, and the heart stopped. But then in seven out of seven cases that Chawla studied, there was a sudden burst of brain activity that turned out to be gamma synchrony. This is a correlane of consciousness, that lasted anywhere from ninety seconds to twenty minutes in one case” Interesting. Years ago I was reading a book by VS Ramachandran and he wrote about, “mirror neurons.” I found that to be very interesting, but I put it aside to study other things. Now since I started studying the yoga of Karhmir Shaivism I’m coming back to it and the idea that we are all really one and everything is consciousness. Here is a clip about mirror neurons. You may find it interesting..","date":"2015-06-20","mins":"12:19 pm","url":"https://shroudstory.com/2015/06/19/paper-chase-offensive-coins-heads-or-tails/","cat":"paper_chase","title":"Paper Chase:  Offensive Coins? Heads or Tails?"},{"id":"comment-173114","author":"john_green","post":"You already have had serious challenges here..","date":"2014-11-26","mins":"9:54 am","url":"https://shroudstory.com/2014/11/25/environmental-study-of-the-shroud-in-jerusalem-videos/","cat":"video","title":"Environmental Study of the Shroud in Jerusalem Videos"},{"id":"comment-203195","author":"john_green","post":"Daveb wrote, ” I think I have some competence in being able to make useful comments on many of these topics. ” We may agree or disagree on some points Dave, but I agree with your statement above..","date":"2015-06-22","mins":"8:19 am","url":"https://shroudstory.com/2015/06/19/paper-chase-offensive-coins-heads-or-tails/","cat":"paper_chase","title":"Paper Chase:  Offensive Coins? Heads or Tails?"},{"id":"comment-193196","author":"john_green","post":"Scholars like Robert Eiseman would disagree with you on that. Also Josephus wrote that James was the brother of Jesus..","date":"2015-03-12","mins":"6:32 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"id":"comment-193264","author":"john_green","post":"I agree. No one knows what was in Jesus’s mind when he said that. He could have figured the others were put in jail, or killed. He could have felt he had other things for James to do. R James had his hands filled as the head of the Jerusalem Church and leadership of early Christianity. The best we can say it we don’t know..","date":"2015-03-13","mins":"2:19 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"id":"comment-193201","author":"john_green","post":"Robert Eisenman covered that in his book, “James the Brother of Jesus” and Bart D. Ehrman in his book, “Did Jesus Exist?” mades the point that the language Jesus skope was Aramaic not Greek. Having said that, your own words,” full range of meaning from blood brother” means they may be correct. So Jesus, as Eisenman says Jesus may have a real brother. There is no evidence Joseph had kids outside of the ones with Mary..","date":"2015-03-12","mins":"8:05 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"id":"comment-193202","author":"john_green","post":"Oh and I think the writing on the ossuary was added by a fraud to sell it for a high price, it’s phony..","date":"2015-03-12","mins":"8:31 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"id":"comment-193481","author":"john_green","post":"There is no evidence that Mary was always a virgin. It’s very clear what the NT says all over the place. He was not a cousin because the greek word for cousin or relatives is “syggenē.” Paul wrote: Gal 1:19 But other of the apostles saw I none, save James the Lord’s brother. So Paul did not use the word brother in the generic sense at all..","date":"2015-03-16","mins":"6:11 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"id":"comment-192614","author":"john_green","post":"And NOVA on March 25 http://www.pbs.org/wgbh/nova/.","date":"2015-03-06","mins":"8:12 am","url":"https://shroudstory.com/2015/03/06/if-cnn-wasnt-enough-get-ready-for-nbc-on-easter-sunday/","cat":"television","title":"If CNN Wasn’t Enough, Get Ready for NBC on Easter Sunday"},{"id":"comment-190055","author":"john_green","post":"“Shall I repeat was i told David Goulet on February 5, 2015 at 2:13 pm?” I’m afraid you will in 50 post of 144 letters or less..","date":"2015-02-07","mins":"3:06 pm","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","title":"More Press Coverage of the Upcoming CNN Series About Jesus"}]
