[{"id":"comment-207595","author":"rick","post":"Looking forward on how you explain all the aspects of the shroud “just like the real thing”..not just one aspect. Glad you’re back…..though you had signed off this site for good..","date":"2015-08-06","mins":"1:19 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-2102","author":"rick","post":"With specialized photography that filtered for scorch, the real scorches from the 1532 fire show while the image disappears. The scorch was ruled out by STURP in 1978. A scorch would penetrate the cloth more than the few microns of the Shroud image. A scorch could not touch selected fibers 1/500th of an inch while not touching adjacent fibers. Also, the scorch does not account for the many other properties…3 Dimensionality, image not beneath blood, But if it is a scorch, than just make one. Surely with 21st century technology we should have a shroud duplicate from medieval technology..","date":"2013-04-14","mins":"6:55 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/17/doh-i-can-think-of-only-19-reasons-why-the-shroud-image-was-made-by-thermal-imprinting-scorching-onto-linen-from-a-heated-effigy/","cat":"heated_effigy","title":"Doh! I can think of only 19 reasons why the Shroud image was made by thermal imprinting (“scorching”) onto linen from a heated effigy"},{"id":"comment-186408","author":"rick","post":"Have to agree with John for the most part..but think John Paul was even more ecumenical …..not sure i’m as conspirasy minded as some in this thread though…. Why stop at Christians?…remember from an earlier post on this blog?”…How about Muslims? “The figure of Jesus as seen through the symbol of the Holy Shroud, will be the focus of the dialogue between Msgr. Ghiberti and Imam Pallavicini”.","date":"2015-01-26","mins":"10:52 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"},{"id":"comment-186493","author":"rick","post":"Often wonder that if barrie thinks the shroud is real…why he is not a Christian…..wanted to ask him that one of these days.","date":"2015-01-26","mins":"5:47 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"}]
