[{"title":"Barbet vs Zugibe","post":"Zugabe being wrong does not prove Barbet being right. The observation by Bevilacqua ea (‘Do we really need new medical information about the Turin Shroud?’ Injury 2013; p.2) should also be taken into account. According to the test performed by these authors, ‘…the nails pierced the space between the radial, scaphoid and lunate bones…’\n\n","date":"December 8, 2013 at 6:40 am","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","id":"comment-57229","author":"Jos Verhulst","site":"shroudstory"},{"title":"Barbet vs Zugibe","post":"Also read what Dr. Frederick Zugibe wrote about the image-formation process involved in the Jospice Mattress to understand why Dr. Pierre Barbet is superior.\n\n","date":"December 8, 2013 at 10:51 am","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","id":"comment-57249","author":"Louis","site":"shroudstory"},{"title":"Barbet vs Zugibe","post":"well, I’ve said it before and I’ll say it again – according to my measurements on shroudscope and corroborating back to my own hand, the wound is just below the mid point of the hand, NOT through the wrist\n\n","date":"December 8, 2013 at 4:44 pm","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","id":"comment-57297","author":"Matthias","site":"shroudstory"},{"title":"Barbet vs Zugibe","post":"¡Mides MAL!\nCarlos\n\n","date":"December 8, 2013 at 8:42 pm","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","id":"comment-57317","author":"Carlos","site":"shroudstory"},{"title":"Barbet vs Zugibe","post":"No matter who was right about the exact location of the nail, the simple fact that it clearly came out in the wrist area at the back of the hand is a very important data regarding the Shroud that point in direction of the authenticity of the cloth, unless you think the Shroud can be the product of a very ancient forgery that was done before the abolition of crucifixion at the beginning of the 4th century with the help of a real crucified corpse who was scourged and crucified with the Roman method.  Althought there is a slim possibility for such a scenario to be true, it is much more rational to see the Shroud as the authentic burial cloth of Jesus of Nazareth.  This conclusion is not a religious statement and that doesn’t prove at all the reality of the Resurrection.\nNote:  Personally, I’m fully convinced Barbet was right over Zugibe on the particular question of the nailing of the hands, for the simple fact that it is much easier to drive a nail directly through the wrists at an angle of 90 degrees of a person than diagonaly from the bottom of the palm all the way through the wrist…  The Romans were genuous at finding the easier way to torture someone.  They didn’t wanted to lose any time or effort doing their tortures.\n\n","date":"December 9, 2013 at 4:43 pm","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","id":"comment-57478","author":"Anonymous","site":"shroudstory"},{"title":"Barbet vs Zugibe","post":"I can’t agree with Matthias, that the wound is on the back of the hand.  Go to Shroudscope, choose Enrie Negative Vertical, centre on the wound, and zoom up close. Remember that you’re looking at the left hand, and you’ll see that the blood-mark is centred on the narrowest part of the arm, i.e. at the wrist. If you see something different, then it’s not what I see. Look at the shape of the back of your left hand, and then compare it with the outline of the TS wrist and hand.\n\n","date":"December 9, 2013 at 8:09 pm","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","id":"comment-57497","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Barbet vs Zugibe","post":"DaveB\nI’ve gone to the Enrie negative again, I measured the length from the tip of the middle finger to just above the knuckles at 95mm – which is almost identical to my own hand. If I then measure from the knuckle area to the upper edge of the hand wound, I measure about 50mm, which places the wound around the middle of the back of the hand. Looking at the Enrie negative up close, I also think  – at least to my eye it looks like the back of the hand –  not the wrist.\nI’ve done this a few times now and come to the same conclusion – the wound is clearly in the middle of the hand, not the wrist as per the conventional wisdom.\nSince DaveB and I clearly differ in opinion, it would be very good to hear other opinions.\n\n","date":"December 10, 2013 at 2:58 am","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","id":"comment-57569","author":"Matthias","site":"shroudstory"},{"title":"Barbet vs Zugibe","post":"Some time ago the report of the nuns who repaired the Shroud in 1534 was posted on this site with quite a full description of what they saw. The nuns reported that  ‘the nail holes are in the middle of the long and beautiful hands’. So the argument seems to be going Matthias’ way.\n\n","date":"December 10, 2013 at 3:38 am","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","id":"comment-57578","author":"Charles Freeman","site":"shroudstory"},{"title":"Barbet vs Zugibe","post":"Nuns in 1534 would not have had the advantage of the Enrie negatives. Nor unlike Pierre Barbet & Frederick Zugibe would they have the advantage of 20th century forensic pathology. Despite Zugibe’s disagreement with Barbet on the entry point of the nail wound, he still seemed to accept the exit point fairly close to the wrist. He illustrates this showing a needle through the hand of a stabbing victim, the exit point certainly close to the base of the hand, and pretty well at the wrist.  Other pathologists, Willis & Bucklin seemed to agree with Barbet on the matter, exit point at the wrist. Zugibe’s theories on the nail not completely through the wrist relies entirely on his assertion that adequate support at the feet would relieve the tension in the arms. Arm tension would be 207 lbs without any support at the feet. This tension would tear through the palms, unless it was taken by the carpal bones.  Zugibe claimed that foot support would reduce the tension to only 67 lbs. Doing the statics, Zugibe is therefore saying that the arm tension is only taking 56 lbs maximum of the vertical weight of 176 lbs, and that 119 lbs minimum are being taken by the single nail through the feet. I’m inclined to doubt that this scenario is credible. I rather suspect that efficiently-minded Roman soldiers had better ideas on what would be effective.\n\n","date":"December 10, 2013 at 5:50 am","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","id":"comment-57602","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Barbet vs Zugibe","post":"You mean like this:","date":"December 10, 2013 at 6:25 am","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","id":"comment-57608","author":"Dan","site":"shroudstory"},{"title":"Barbet vs Zugibe","post":"On Shroudscope I measure 109mm from the tip of the middle finger to the top of the major knuckles. That is based on the lower hand as the one on top doesn’t appear flat like the lower one. My corresponding finger is about 95mm. On the upper hand, I measure about 45mm from the knuckles to the top of the blood mark. That would position it on my hand in the centre of the lower hand. My conclusion is that the Man on the Shroud has very strangely shaped hands. Or perhaps mine are?\n\n","date":"December 10, 2013 at 8:35 am","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","id":"comment-57645","author":"ChrisB","site":"shroudstory"},{"title":"Barbet vs Zugibe","post":"thanks Chris, that’s pretty consistent with my finding\nHowever I measure about 100mm on the lower hand. But it could be more. It’s hard to get 100% accuracy on shroud scope.\nOthers?\nI think the “wrist wound’ myth needs dispelling.\n\n","date":"December 10, 2013 at 4:54 pm","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","id":"comment-57735","author":"Matthias","site":"shroudstory"},{"title":"Barbet vs Zugibe","post":"With all due respect I think most people who try and determine how the image was made, its significance, etc. are trying too hard and looking in the wrong direction. A very good place to begin is to ask the question what, exactly IS an image? I know it sound too sophomoric but by asking this one basic question and expounding on it, e.g. how images relate to the every day human experience, biologically, physically speaking, etc. hopefully a distinct pattern of reason can be obtained and created and draw one closer to the ultimate answer ( of course there are a plethora of other factors that will follow such as how does the idea of imagery relate to both a live body and one that is physically dead )\n\n","date":"December 12, 2013 at 10:01 am","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","id":"comment-58390","author":"michael jude","site":"shroudstory"}]
