[{"title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?","post":"I wonder what is Stephen Jones’ area of expertise?  Is he a medical doctor?\n\n","date":"December 13, 2013 at 1:18 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","id":"comment-58913","author":"Andy Weiss","site":"shroudstory"},{"title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?","post":"From Stephen’s own profile page in blogger:\nBlogs: CreationEvolutio…, Jesus is Jehovah!, The Shroud of Turin\nGenderMale\nOccupationHigh school teacher\nLocationWarwick, Western Australia, Australia\nInterestsChristianity, the Shroud of Turin, chess, mathematics.\n\n","date":"December 13, 2013 at 2:29 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","id":"comment-58952","author":"Dan","site":"shroudstory"},{"title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?","post":"Chess & mathematics ought to give him good skills in analysis and logic. High school teacher ought to give him good skills in communication, evident I think in his writing. The question would have to be if those skills provide a broad enough background. Authenticist though I may be, I think some of us find his approach somewhat narrow, and at times unwilling to be more open-minded about matters which remain inconclusive, a non-specific criticism I’d have to agree.  However, I for one find Zugibe’s assertions concerning support of the feet relieving arm tension to some 67lbs only, rather unconvincing.\n\n","date":"December 13, 2013 at 2:55 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","id":"comment-58963","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?","post":"This has been an opportunity to say something about which I have kept quiet and maintained my peace. Some years ago I was misled by Dr. Frederick Zugibe, but I will not publicly reveal the exact nature of what he did. All I can say was that it was written all over the walls that it was a reaction, a reaction from someone who could not accept the fact that my explanation about the image-formation process involved in the Jospice Mattress Imprint was different from his. The good God above judges hearts… and he knows the truth, and that is enough.\n\n","date":"December 13, 2013 at 1:32 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","id":"comment-58920","author":"Louis","site":"shroudstory"},{"title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?","post":"I’m not happy accusing people of deliberate malfeasance, but there are certainly discrepances between Barbet’s (and Bucklin’s) ideas and Zugibe’s. Rather than impugn his integrity, we might be better off exploring why Zugibe thought so differently.\nFor a start, they were both working from a picture of an indistinct bloodstain. I am rather taken with Mathias’s idea that the wound is too close to the knuckles to be a ‘wrist’ wound, but that’s assuming the big oval blob closest to the fingers is, in fact, the site of the nail-hole. It looks as if Zugibe took it to be one end of the thinner of the two arms of the famous bifurcation (the end nearest the thumb), while Barbet took it to be the middle of the thicker one.\nHowever, I’m not sure it really matters. It is apparent from the various dissections available on the internet – (not for the squeamish, but have a look at: http://nervesurgery.wustl.edu/NerveImages/Anatomy%20and%20Physiology/AP-Median-Nerve—IMG_3299.jpg, or http://4.bp.blogspot.com/-LUBKf8T5CfA/Tid4go2Yv7I/AAAAAAAABTo/XNwHvBtXKcM/s1600/human_body_dissection_05.jpg, or http://commons.wikimedia.org/wiki/File:Branches_of_median_nerve.jpg) – that wrist nerves, bloodvessels and tendons are rather squashed in just anyhow, and there are substantial variations from the standard model. A tap on a nail in the middle of the wrist is equally likely to send it sliding down either side of the capitate bone, whence it could equally well go through Destot’s, Zugibe’s or even Bevilaqua’s space. Any or all of the nerves of the wrist are quite likely to be damaged.\nTalking of which, there are several websites which refer to damage to the median nerve. In none of them is there any reference to the thumb being flexed tight across the palm, although there is some inward flexion towards the little finger. In spite of several model crucifixes with just such a contraction, does Barbet in fact claim it to that extent? There is a picture of one of Barbet’s crucified corpses in Zugibe’s response to him (http://www.crucifixion-shroud.com/Barbet.htm) and while it does appear to have nerve damage (the 4th and 5th fingers are curled inwards) the thumbs are not conspicuously flexed.\n\n","date":"December 13, 2013 at 8:13 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","id":"comment-59058","author":"Hugh Farey","site":"shroudstory"},{"title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?","post":"I agree with you. We shouldn’t be accusing people with dishonesty, especially if the are dead and can’t defend themselves. I believe Barbet was honest when he reported the flexing of the thumb which is an observation, we could differ on his explanation though. as you said any nail (8mm wide) passing through the wrist would likely cause significant damage to the nerves and tendons in the wrist. This may stimulate the flexion of the thumb, Zugibe even indicated that it might be the case, but only temporarily. It is logical to think that the thumb would be paralyzed afterward due to the damage of the median nerve. It is possible that a paralysed thumb would drop into that position due to gravity on the cross, also it is possible that the people arranging the corpse for burial placed the hands with the paralyzed thumbs inwards. It is impossible to tell what exactly caused the thumbs to be kept in this position, but I think Zugibe’s exit point matches the blood stain position more than Barbet’s\n\n","date":"December 13, 2013 at 10:22 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","id":"comment-59106","author":"Mike Morcous","site":"shroudstory"},{"title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?","post":"I’d be confident that Hugh is capable of doing the statics, but it all depends on how much of the weight gets transferred into the arms, and how much is taken by the feet.  Barbet envisaged a type of see-saw motion, necessary to enable the crucifarius to breathe.  Therefore he considered that the weight had to be taken completely by the arms, at least at some phase during this motion. For a 175lb body with arms at 65deg to the vertical, the arm tension is easily calculated to be 207lb.  That’s too high a tension to be taken by the flesh of the palms. It has to be taken somehow by the wrist bones if tearing is not too occur. \nZugibe’s experiment involved strapping the volunteer’s feet to the upright, and measuring the arm tension with load cells fastened to the volunteer’s gauntlets. He claimed that the maximum arm tension was then only 67lb.  So it all depends if you consider whether strapping the feet in this way is an adequate simulation of a nail through the feet. I personally can’t see it. Taking some 75% of the body weight onto the cluster of tarsal bones must have been excruciating, and I would think there would be a natural tendency to transfer the weight back onto the arms, and the risk of palm tearing would be too high. \nRoman executioners would no doubt vary in their competence and experience. I would expect that most would go for the wrist, and some would be better at it than others, sometimes possibly with the accuracy and expertise that Barbet claimed. Correspondents obviously vary in their opinions as to the whereabouts of the nail exit position. However it is just not possible to sustain a 207lb arm tension by palm flesh alone, and somehow or another it needs to be taken by a wrist bone, or a cluster of bones.\n\n","date":"December 14, 2013 at 6:46 am","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","id":"comment-59263","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?","post":"Dave: There is no evidence that single nail through the metatarsal was used, the two nails through the heels are more likely IMHO.\n\n","date":"December 14, 2013 at 7:40 am","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","id":"comment-59288","author":"O.K.","site":"shroudstory"},{"title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?","post":"O.K: You will have to provide evidence and sources for the comment. Barbet Ch.6 discusses wounds in the feet covering 8 pages in some detail. He refers to the post mortem signs of the feet having been crossed, one foot over the other, he detects blood flows towards both toes and heel, it took 20 hammer blows for a nail to pierce the tarsal area of an ampuated foot, but easily penetrated the second inter-metatarsal space, so that adequate support would be provided on the Lisfranc line. He considers that the Malijay theory locating the crucifixion in the direction of the heel cannot be sustained. \nThe Jehohanan example illustrates the difficulty of nailing through the heel, where the nail remained in the heel and could not be removed, see Dr Nicu Haas reconstruction illustrated in Ian Wilson’s 1978 text. \nWhere is the evidence for your assertion?\n\n","date":"December 14, 2013 at 2:49 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","id":"comment-59454","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?","post":"http://tiny.pl/qwl37\n\n","date":"December 14, 2013 at 2:55 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","id":"comment-59459","author":"O.K.","site":"shroudstory"},{"title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?","post":"Essentially Zugibe. Barbet addresses the Shroud image of the feet. Zugibe argues from principles and generalities. My money remains on Barbet!\n\n","date":"December 14, 2013 at 3:48 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","id":"comment-59481","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?","post":"If people who refuse to publicly challenge a position that is different from theirs when they are alive, and resort to dirty tactics behind the scenes, as though to get even, and an opportunity arises to say something about it when they are dead, what is the problem? I think anyone who thinks otherwise should read the Freud-Pfister correspondence before posing as a judge. It has a lot to say about what is preached and what is practiced.\n\n","date":"December 14, 2013 at 2:15 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","id":"comment-59437","author":"Louis","site":"shroudstory"},{"title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?","post":"Essentially Zugibe. Barbet addresses the Shroud image of the feet. Zugibe argues from principles and generalities. My money remains on Barbet!\nObviously you have a right to do so, but:\nThe Shroud image of the feet may be misleading. We don’t know whether both feet were put on each other and nailed with a single nail. They may be nailed separetaly through the heels (see:)\nand later joined together to put the corpse on the Shroud. Accidentally, the both feet imposed on each other, giving the wrong impression of a single nail used.\nRemeber, Barbet died in 1961. Only in 1968, the Jehohanan’s ossuary was found. Which proves that Barbet opinion:\nHe considers that the Malijay theory locating the crucifixion in the direction of the heel cannot be sustained. \nis wrong. The Jehohanan example illustrates not the difficulty, but possibility of nailing through the heel. So far no one has found any evidence that single nail through metatarsal area was used, perhaps, because Jehohanan is the sole victim of ancient crucifixion found!\nSee also those ancient graffiti\nThe first one is Puozzola grafitti near Naples, the second one is infamous Alexamenos grafitti from Palatinate Hill, dated between 60-220 AD.\nThey strongly suggest the feet were nailed separately.\n\n","date":"December 14, 2013 at 4:05 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","id":"comment-59493","author":"O.K.","site":"shroudstory"},{"title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?","post":"","date":"December 14, 2013 at 4:07 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","id":"comment-59495","author":"O.K.","site":"shroudstory"},{"title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?","post":"I think I may have come up with a strong argument supporting wrist nailing: \nThe crucifarius was required to carry his “cross” to the place of execution. This could only have been the patibulum, maybe about the size of a timber rail-road sleeper. This is feasible for your average rail-road man. The complete cross with upright would be far too heavy to be feasible for him to carry. It implies that the upright (stipes) was already in position securely in the ground. If it wasn’t already in the ground, but joined to the patibulum at the site, and the crucifarius nailed hands and feet while lying down, this is far too much work for the execution party to lift the body and cross complete into the hole, and is inefficient. \nIt implies that the hands only were nailed to the patibulum with the crucifarius being held lying down.  The patibulum with the crucifarius suspended from it, is then easily lifted onto the stipes. Now at this stage, the full weight of the body drops suspended by the hands, and the full arm tension of 207lbs has to be taken by the hands.  It is necessary that the hands take the full arm tension during this process, and this can only be done if the wrists are nailed so that wrist bones can take the tension.\nWith the patibulum now in position on the stipes, the feet can then be nailed onto the stipes with however many nails it takes. It is only then that the arm tension can be relieved by transferring some of the weight onto the feet. \nThe only other way it can be done is if two of the execution party take the weight of the body until the feet are nailed. This is extra work, and I have more confidence in the efficiency of Roman soldiery. \nWhere Zugibe’s theory fails, is that he had a ready made cross for his volunteers to mount. He did not simulate an actual crucifying scenario.\n\n","date":"December 14, 2013 at 4:52 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","id":"comment-59516","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?","post":"The crucifarius was required to carry his “cross” to the place of execution. This could only have been the patibulum, maybe about the size of a timber rail-road sleeper. This is feasible for your average rail-road man. The complete cross with upright would be far too heavy to be feasible for him to carry. It implies that the upright (stipes) was already in position securely in the ground. If it wasn’t already in the ground, but joined to the patibulum at the site, and the crucifarius nailed hands and feet while lying down, this is far too much work for the execution party to lift the body and cross complete into the hole, and is inefficient.\nThis is another myth, challenged in recent times. New studies suggest the whole cross was actually carried, not just transverse beam, see http://www.acheiropoietos.info/proceedings/GloriWeb.pdf\nThe Andrè Marion’s comparison of the blood marks on the Tunic of Argenteui and the Shroud, suggest not only the two objects belonged to the same person, but also that this person carried the whole cross.\nAs to the weight of the cross, we know with a high probability its original dimensions. The cross was slotted into a hole -a stone ring (11.5 cm in diameter) serving for that purpose was found in the Church of the Holy Sepulchre in 1986, see Witnesses of Mystery pg. 310-313. It is estimated the cross was no higher than say, 250 cm. The Good Theft Patibulum, currently in Rome’s Santa Croce in Gerusalemme (see Thiede&Ancona The Quest for The True Cross and Pierluigi Baima-Bollone Sindone, 101 domande e risposte) is  178 (but originally it was probably longer, say 200 cm) x13 x 13cm.\nThis gives us estimated cross volume of 59767 cm^3. Giving estimated wood density of 0.5 g/cm^3 this would give us about 30 kg. Contrary to widespread myth, it was entirely possible for a man to carry the whole cross. Thus Barbet reconstruction is challenged once more.\n\n","date":"December 14, 2013 at 5:35 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","id":"comment-59534","author":"O.K.","site":"shroudstory"},{"title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?","post":"daveb with all due respect let’s try and put the cognitive dissonance aside.\nGo to Shroud scope. The middle of the circular blob on the hand measures no more than 45-48mm from the knuckle area. this places it just about middle of the hand.\nUnless you think the circular blob is not where the nail was? \nWhatever theory is proposed, I can’t ignore the direct evidence discernible from measuring shroud scope that places the nail wound middle of the hand.\nWhether a wound in the middle of the  hand is consistent with a man hanging on a cross, I don’t know.\nAgain, I’m not averse to the theory of some “wounds” having been added to the shroud, which does not discount authenticity as a whole- in my opinion at least.\n\n","date":"December 14, 2013 at 7:52 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","id":"comment-59594","author":"Matthias","site":"shroudstory"},{"title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?","post":"Based on Shroud Scope:\n53-58 mm from the knuckles to the middle of the wound (marked by dark coma-like spot in the center). I compared also with my hands (I remind one of my previous posts https://shroudstory.com/2013/11/07/a-guest-posting-by-o-k-on-the-allegedly-too-long-fingers/). 99 % it is a wrist.\nMatthias remember also that the image of the body may be slightly distorted (shortened) by the projection on the cloth.\n\n","date":"December 14, 2013 at 8:40 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","id":"comment-59619","author":"O.K.","site":"shroudstory"},{"title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?","post":"Remider to all: the body image resolution is estimated as 4.9 +/- 0.5 mm\n\n","date":"December 14, 2013 at 8:43 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","id":"comment-59620","author":"O.K.","site":"shroudstory"},{"title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?","post":"disagree. 99% it is hand. Several other people did the measurement and came to circa 45-50mm finding.\nAlso it’s pretty obvious if you look to the edge of the hand and the hand shape that its in the middle of the hand.\nToo much cognitive dissonance.\n\n","date":"December 14, 2013 at 8:59 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","id":"comment-59631","author":"Matthias","site":"shroudstory"},{"title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?","post":"Matthias and all:\nSee those two pictures:The error is that you try to measure the distance from the knuckles to the edge of the bloodstain, while in fact, the nail was placed in its middle, probably close to that dark spot.\n\n","date":"December 15, 2013 at 7:39 am","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","id":"comment-59822","author":"O.K.","site":"shroudstory"},{"title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?","post":"I agree with your measurements. That puts the exit wound exactly where Zugibe indicated\n\n","date":"December 15, 2013 at 1:39 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","id":"comment-59912","author":"Mike","site":"shroudstory"},{"title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?","post":"who says the ‘nail’ isn’t between your two points, which measures around 48mm. Even your second point at a distance of 56mm is at the bottom of the hand more than the wrist.\nyou said:\n“The error is that you try to measure the distance from the knuckles to the edge of the bloodstain, while in fact, the nail was placed in its middle, probably close to that dark spot.” \nWho says the nail was right in the middle? If this is an authentic wound stain, then I think it’s more likely the nail was closer to the knuckles, and that the blood then collected then split into “two streams” down towards the wrist.\nIn my opinion the jury is very much out on the so called ‘truth’ of the wrist wound.\nDoesn’t mean the shroud isn’t authentic. I maintain a hunch that the hand wound, the trickles on the forearms, the marks on the head were medieval additions. I think the scourge wounds are authentic, I’m not sure about the side wound.\n\n","date":"December 16, 2013 at 2:16 am","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","id":"comment-60077","author":"Matthias","site":"shroudstory"}]
