[{"id":"comment-78728","author":"antero_de_frias_moreira","post":"After reading Sir Colin Humphreys’ wonderful book «The Mystery of the Last Supper I’ m really convinced by his studies of ancient calendars and documents backed by astronomy data that Jesus crucifixion and death happened on 33 A.D. And this date is the only one that fits all conditions as he explains. Excellent work, everyone interested in christian religion should read it. Regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2014-02-12","mins":"1:16 pm","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-194167","author":"antero_de_frias_moreira","post":"I could hardly believe what I was reading on this post «Non authenticists, on the other hand, have studied them in considerable detail, such that we can say with authority that any contamination of the radiocarbon corner of the shroud made it appear older, not younger, than it really is» Tank God this misleading skeptic claim has been absolutely debunked by qualified commenters of this blog like Professor Ray Schneider,, O.K.,Daveb and Dr. Thibault Heimburger.. In a previous post on March 20 «John Klotz delivers the knockout», Dr Thibault Heimburger has writen a thorough explanation on this skeptic claim from which I recall « No Hugh. Morgan’s paper has nothing to do with the amount of ‘contamination’ of the C14 corner. It has to do with the surface chemistry as shown by the UV Vis fluorescence photograph. »……….. «You are confusing surface contamination (likely Rogers’s dye, which has been eliminated by the C14 standard cleaning procedures) and “contamination” of the fabric itself by “new” pieces of threads.» For most of Shroud researchers seeking the truth what matters can be summarized as folows: The Quad Mosaic study and Dr John Morgan’s study on U.V. Fluorescence photograph digital image processing , concludes that the area of the Shroud that was cut for the 1988 radiocarbon sample HAD A SUPERFICIAL CHEMICAL COMPOSITION DIFFERENT FROM THE REST OF THE SHROUD (and neighboring areas).AND THAT’S BECAUSE A DYE HAD BEEN APPLIED by the artisan who has cunningly woven the so called invisible mending The color cannot be assigned to anomalous C14 enrichment from the new threads. Thus these studies are further pieces of evidence to support the theory that 1988 radiocarbon sample dating is invalid because it was cut from an «invisible» mediaeval repair Antero de Frias Moreira Centro Português de Sindonologia.","date":"2015-03-23","mins":"1:58 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194168","author":"antero_de_frias_moreira","post":"Correction Thank God.","date":"2015-03-23","mins":"2:00 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-122721","author":"antero_de_frias_moreira","post":"To Thomas: «More importantly how credible is the author Evaristo who claims these statements?» Dr. Carlos Evaristo is an historian and archaeological researcher and a member of Centro Português de Sindonologia. He has privileged relationship with portuguese Royal House and Italian Royal House of Savoy and he is an expert on study of Christian Relics. As far as I know him, I think he was honest in his statements based on information he obtained from King Umberto’s II testimony and other Savoy’s family members. If this is true indeed, it’s another historical argument to support the invisible mending theory against the validity of 1988 radiocarbon tests. Antero de Frias Moreira (Centro Português de Sindonologia) P.S. I read his book The Untold Story of the Holy Shroud and he claims that an extant Shroud painted copy brought to Portugal as a dowry by D. Maria Pia of Savoy who married King D. Luiz I in late 19th century had incorporated threads from the real Shroud I mean the copy kept in «Palácio da Ajuda» in Lisbon. Accordingly to an ancient tradition of the Savoy family this practice was done to «sanctify» and give more spiritual value to the painted copies of the Shroud. I can ‘t help being puzzled if this is indeed true how much of the original Shroud fabric has been removed through the centuries???.","date":"2014-05-21","mins":"1:44 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"id":"comment-209840","author":"antero_de_frias_moreira","post":"Dear Dr. Thibault Heimburger Shroud scholars like you who seeks the truth, and explains in a comprehensive way the fallacies of a paper that most of us have no scientific background to rebutt SHOULD BE PRAISED. I hope to read soon your next response to the Editor of TCA warmest regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2015-09-07","mins":"2:30 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209878","author":"antero_de_frias_moreira","post":"Dear Marco Simply because Professor Rogers had access to Shroud samples and analyzed them with several scientific methods including PMS and later was given material from Raes sample and radiocarbon sample. His conclusion was backed by integrating several scientific methods You did not test material you only draw disputable conclusions on an ONLY scientific tool I mean PMS.. Although I’m not a chemist my physics and chemistry background allow me to understand the reasoning of both papers and the agenda behind yours. Thank God scientists kike Dr. Thibault Heimburger have the knowledge to explain us in a comprehensive way the hidden fallacy of your paper. Regards Antero de Frias Moreira.","date":"2015-09-08","mins":"6:00 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209838","author":"antero_de_frias_moreira","post":"Dear O.K. You have all my support. You wrote a wise rebuttal. This paper seems to me like dejá vu remembering former Professor Garlaschelli’s experiment trying to produce an image similar to the original , but it turned out to be a complete failure. Unfortunately I have not enough chemical background to comment but I think that yours and Dr. Thibault Heimburger’s previous comments not to mention several others point to the obvious these skeptics aim is to debunk the Shroud whatever it costs. Unfortunately Professor Rogers is no longer among us but let’s settle down and eagerly wait for the promised next Dr. Thibault Heimburger’s response. Regards Antero de Frias Moreira.","date":"2015-09-07","mins":"2:06 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-127049","author":"antero_de_frias_moreira","post":"When I attended Valencia Shroud Conference two years ago Professor Bruno Barberis has done a lecture with a similar title. When he was asked when new tests would be done he answered that he hoped the Pope would grant permission in a near future, but two years have run since and nothing new. Emerged. I sincerely hope his presentation will bring anything new because the list of new non destructive tests he suggested was impressive. May be as he has privileged relations with Shroud custodians he presents some interesting data from studied Shroud material removed in 2002 restoration.that would be great. Regards Antero de Frias Moreira (Centro Português de Sindonologia).","date":"2014-06-05","mins":"11:20 am","url":"https://shroudstory.com/2014/05/31/were-both-ventral-and-dorsal-corners-of-the-shroud-rewoven/","cat":"carbon_14_dating","title":"Were both ventral and dorsal corners of the Shroud rewoven?"},{"id":"comment-206453","author":"antero_de_frias_moreira","post":"You’re absolutely right.","date":"2015-07-24","mins":"5:41 am","url":"https://shroudstory.com/2015/07/23/if-they-had-only-waited-until-2020-or-so/","cat":"carbon_14_dating","title":"If They Had Only Waited Until 2020 Or So"}]
