[{"id":"comment-150680","author":"antero_de_frias_moreira","post":"Hi Piero Just to clarify a quotation you made from us in your second comment on this post I «remember that Maria da Glória (and the husband Antero de Frias Moreira) wrote something in this blog (May 2, 2012) about the “Two Thousand Year Old Ointment Residue Discovered on the Shroud” Here the opinion: >…Dr.Marcia Boi’s presentation, which although it showed images with a good quality, did not convince us on the validity of her claims.» At Bari Dr Marzia Boi has done an interesting presentation about Shroud pollen issue the image quality was excellent, it had been agreable indeed to listen the speaker reasonig nevertheless in my humble opinion her claims are flawed and I’ll try to explain you why: The tenets of her theory are: As main pollens on the Shroud are from entomophilous pollination they could not have got iinto the fabric weave interstices by usual contamination. Max Frei and other botanists namely Professor Avinoam Danin and Uri Baruch misidentified Gundelia Tournefortii pollens which in her opinion are Helichrisum spp. And you may read on her paper «The genus of Helichrysum seems to be the most abundant pollen on the linen» and «by pressing the Helichrisum floers an excellent oil is produced» The body of the Man of The Shroud was anoited with oils and balsams, so the reason for finding entomophilous pollens like the alleged Gundelia Tournefortii which turned out to be Helichrisum was because of the body anointment. Placement of flowers on the cloth beside or over the body is once more categorically discarded « plants were never allowed to touch the cadaver directly» and the same applies to body washing «The body prepared for funeral and burial was not washed or cleaned with water; proof of this is the presence of blood and the stains from wounds that can be seen on the Shroud». My reasons to question this theory are as follows: It puzzles my mind why experienced botanists like Max Frei and most importantly, israeli botanists would misidentify a kind of pollen from their own country. Dr. Marzia Boi bases this claim only on photographs, not direct examination by microscope of any remainig pollen samples. The competence and honesty of professor Danin was personally mentioned to me by a jewish speaker at Bari conference. The presence of entomophilous pollen in this case Helichrisum not the allegedly misidentified Goundekla Tournefortii on the fabric is allegedly justified because the body had been embalmed with an expensive Helichrisum oil. Actually you can read references to deposition of flowers beside the body in ancient jewish burial rituals you just have to google it ,an a lot of reliable information will pop up. This practice was confirmed to me at 2012 Valencia Shroud Congress by Dr. Rebecca Jackson who is an expert in ancient jewish history and customs. So it turns out that the presence of entomophilous pollens can be easily explained by the deposition of flowers on the Shroud. Blood marks on the Shroud namely the scourge marks are very well defined and their boundaries are clear cut. If the body had not been washed and was extensively anointed with oils and balsams the bloody material would have surely spread. So it turns out scourge marks would be absolutely  undefined. The question of washing or not washing the body has already been approached on this blog and I agree with Professor Zugibe’s opinion that the Man of the Shroud «was washed» At least a kind of hasty washing had to be done namely life blood shed on the dorsal trunk otherwise we would see a big  undefined blood stain on the cloth, not the multiple so well defined dumbell scourge marks actually this is the proof that the body was washed, at least in some areas. These are the main reasons why we were not convinced at Valencia and this second presentation although quite well constructed did’t convince me either. Regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2014-09-13","mins":"7:52 am","url":"https://shroudstory.com/2014/09/10/a-report-on-the-bari-conference/","cat":"conference","title":"A Report on the Bari Conference"},{"id":"comment-193482","author":"antero_de_frias_moreira","post":"Our congratulations to Dr. Barrie Schwortz for his exccelent task. As a person with scientific background I could not find any scientific theory that can fit with every aspects of the Shroud Image. THE SHROUD IMAGE IS UNIQUE. As a Christian the only expanation from a spiritual and theological point of view is tha the Shroud is the living testimony of the Passion and why not say the material proof that something impossible happened in that that dark toumb about 2000 years ago I mean the Ressurection of Christ. I’m not ashamed to assume that the image on the Shroud is a miracle granted by God to mankind. (although I cannot state that from a scientific standpoint) regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2015-03-16","mins":"6:29 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-210046","author":"antero_de_frias_moreira","post":"«Professor Marinelli’s paper is an an excellent review of the evidence, but does not comment or evaluate it very thoroughly.» That’s your opinion from which I disagree and I invite people to read both papers and draw their own conclusions. I wonder if as time goes by pollen material under the tapes deteriorate and preclude a correct identification at higher taxonomical levels I’m convinced this really happens. Perhaps because of this condition Professors Scannerini and Caramiello disagree from former Dr.Frei’s classification not to mention Danin, Baruch and later Professor Litt, Nevertheless we should consider that more than 20 years elapsed from the time Dr.Frei collected the samples. The question is: if these botanists had observed the tapes in 1978 would the disagreement be so great? Although we cannot too much insist on the pollen issue as described by Dr. Max Frei as very strong piece of evidence on the geographical trail of the Shroud, we can’t dismiss it either as a fraud. Until further pallinological studies are done (perhaps on Frei’s tapes or even better on new collected samples)In my humble opinion I think the words of botanist Dr. Mariotti Lippi summarizes what we can state with safety on the pollen evidence «….I concluded that the Shroud in some unspecified period of time stayed in the Midle East.Where exactly I was not able to say, nor when. Http://www.sindone.info/VALENC 6.PDF Unfortunately it’s not wise to push the pollen evidence beyond reasonable limits and enter in disputable field regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2015-09-10","mins":"10:56 am","url":"https://shroudstory.com/2015/09/08/new-youtuibe-presentation-is-the-shroud-of-medieval-forgery/","cat":"presentation","title":"New YouTube Presentation:  Is the Shroud a Medieval Forgery?"},{"id":"comment-215171","author":"antero_de_frias_moreira","post":"Dear Sampath I’d summarize this issue like this: The sample removing did not follow the established protocol. Experts have chosen a bad location for cutting the sample. I do not question the technical laboratory procedures for dating the sample by AMS, but dating discrepancies should raise doubts about homogeneity of the sample and presence of rogue fibers, a fact that had not been considered. It’s true that at least british scientists were very glad with the results of radiocarbon dating, and there was an obscure funding for the British Museum after the press release announcing the results 1260 1390 A.D. NEVERTHELESS THIS IS BY NO MEANS EVIDENCE THAT THE RESULTS WERE FALSIFIED…. Later studies as everyone knows( I will not go on arguing..) confirmed what previous Shroud researchers as Professor Adler supposed I mean that the sample was not representative of the rest of the Shroud, backing Sue Benford and Joe Marino’s reweaving hypothesis. So it turns out we stil don’t have a valid radiocarbon dating of the Shroud. Professor Marinelli pointed out this important issue in Valencia Shroud Congress 2012: A new radiocarbon sample should be done only after a mature analysis by experts from several fields of science namely textile, physics and chemistry. Professor Rogers pointed out that thymol use in cleaning the Shroud container could compromise the accuracy of a new radiocarbon dating of the cloth. If the Savoy’s cutted small pieces of the Shroud and also extrated threads to integrate them into copies of the Shroud or as gifts as historian Dr. Carlos Evaristo claims, then this will make things even worse for an accurate new radiocarbon dating. Regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2015-11-27","mins":"5:21 am","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","title":"Finally, An Explanation for the Exclamation Mark!"},{"id":"comment-209969","author":"antero_de_frias_moreira","post":"Please try reading a much more balanced and elucidative paper by Professor Emmanuella marinelli titled «The question of pollen grains on the Shroud of Turin and the Sudarium of Oviedo»http://www.sindone.info/VALENC 6.PDF Nevertheless we cannot deny the great effort and honesty of the late Dr Max Frei and important cooperation of israeli botanists Professors Danin and Baruch who confirmed many of Frei’s taxonomical pollen classification at least at genus level. Regards Antero de Frias Moreira (Centro Português de Sindonologia).","date":"2015-09-09","mins":"10:39 am","url":"https://shroudstory.com/2015/09/08/new-youtuibe-presentation-is-the-shroud-of-medieval-forgery/","cat":"presentation","title":"New YouTube Presentation:  Is the Shroud a Medieval Forgery?"},{"id":"comment-98657","author":"antero_de_frias_moreira","post":"I congratulate Dr. Dan Porter for exposing his doubts on Bernardo Galmarini’s work , his approach was made in a truly scientific way as an expert in this field he is. Neverheless as he pointed out, there is 3 D information embedded in Shroud image that enabled Dr. Petrus Soons to achieve such a remarquable result I mean the Hologram of the Man of the Shroud, Curiously,the «two halves of the body» are like bas reliefs with same apparent imperfections in anatomical proportions I mean the head seems to be too small relative to trunk dimension, the right forearm is «too long» etc, there is a missing middle slice of the body about 18 cm? in correspondence to the distance between the front an dorsal head images on the Shroud. If the Hologram was an «artistic» artwork shouldn’t those imperfections be suppressed? Could the same result be obtained from any other image even with some artistic additions I mean from regular phptographs, paintings , phptographs from statues bas reliefs etc.? I guess the answer is straightforward NO! I had the privilege to wach the Hologram of the Man of the Shroud in Museo Della Sindone in Turin and it had been a very touching experience, no matter if a little artistic skill was blended with science. Dr. Petrus Soons has given the Shroud World an amazing gift and we should recognize this and give value to his work and commitment to Shroud studies.. Regards Antero de Frias Moreira (Centro Português de Sindonologia).","date":"2014-04-12","mins":"7:47 am","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","title":"Petrus Soons to Present His Scientific Research at the University of Miami"},{"id":"comment-99562","author":"antero_de_frias_moreira","post":"To Dr. David Bowman I praise your comments on holograms and I’ll read them carefully. I guess you’re an expert on holography so I’d like to put some questions. If you had to give an advice on Dr. Petrus Soons hologram of the Man of the Shroud and alleged holographic properties of the Shroud image what would be your straightforward answer? Accordingly to the criteria you mentioned on making holograms would it be possible to obtain an Hologram from a image impressed on a linen sheet like the image of the Man of the Shroud and would the same result be achieved with the Garlaschelli’s Shroud? I apologize for adressing you this way but I guess your opinion will be welcome to most people who comment on this wonderful blog regards Antero de Frias Moreira (Centro Português de Sindonologia).","date":"2014-04-15","mins":"9:33 am","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","title":"Petrus Soons to Present His Scientific Research at the University of Miami"},{"id":"comment-99859","author":"antero_de_frias_moreira","post":"To Anoxie Are you meaning that a «gray scale mapping» was produced from the Shroud image by Bernardo Galmarini and from it a 3 D image of the Man of the Shroud was achieved , and the Hologram was produced from treating those 3 D data? My interpretation of Dr. Petrus Soons explanation fits that. If this is true then the crux is can we get accurate gray scale mapping from images other than Shroud image to «build anatomically near perfect 3 D images» ? regards Antero de Frias Moreira ( Centro Português de Sindonologia) P.S. I thank Dr.David Bowman for his technical explanation on Holograms.","date":"2014-04-16","mins":"5:37 am","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","title":"Petrus Soons to Present His Scientific Research at the University of Miami"},{"id":"comment-99165","author":"antero_de_frias_moreira","post":"Why so categorically state that Dr. Petrus Soons is wrong? Who’s the expert in holography? It can be read in Dr. Petrus Soons website that theoretical physicist Dr. Sue Benson also considered the possibility that the Shroud image could be an hologram and no matter what skeptics claim on this blog it’s a FACT (not a guess or a wish…) that the only image that could be processed from photographs to obtain an HOLOGRAM was the Shroud Image. Despite there is still no peer reviewed paper on this issue as Louis suggested ,no Holograms can be obtained from regular photographs. And that is a fact. Regards Antero de Frias Moreira (Centro Português de Sindonologia).","date":"2014-04-14","mins":"7:42 am","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","title":"Petrus Soons to Present His Scientific Research at the University of Miami"}]
