[{"id":"comment-211649","author":"antero_de_frias_moreira","post":"Dear O.K. On behalf of Centro Português de Sindonologia I congratulate you on this excellent work It’s indeed a great contribution for the scientific study of the Shroud and I suggets it to be included in scientific papers in http://www.shroud.com Now Shroud scholars are provided with information that thoroughly includes everything studied on the 3 D properties of the Shroud Image and in a comprehensive way. Thank you for your gift and God bless you Antero P.S. I’ll keep your precious work in my Shroud archives.","date":"2015-10-02","mins":"5:07 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-211689","author":"antero_de_frias_moreira","post":"If this id not the definitive word on 3 D I wonder if there will ever be one. I’m surprised skeptics have not yet «attaked» Wise explanation of the banding effect I’m truly amazed! AWESOME!!! Antero de Frias Moreira.","date":"2015-10-03","mins":"6:41 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-171178","author":"antero_de_frias_moreira","post":"Why human sweat cannot produce a Shroud like imprint Sweat is composed mainly of water with dissolved minerals lactate and urea. It’s a fact that sweat glands have an uneven distribution in human skin, and the composition and quantity of produced sweat by a human depends on several factors. Leaving aside speculations,, if we assume the corpse wrapped in the Shroud had profuse sweating before death, then almost all skin surface would be covered by sweat, and the uneven distibution of sweat glands in dermal structure would not matter., even hair would be soaked with sweat (unless it had been washed…) Question 1 Is there any sweat chemical compound that reacts whith the polysaccharide layer involving linen fibers(Rogers theory) or pectin and hemicellulose of primary cell wall? Perhaps lactate? urea? If so does it produce the same color tone? AS FAR AS I KNOW THIS HAS NEVER BEEN ACHIEVED IN LABORATORY EXPERIMENTS Question 2 From a microscopical point of view IF sweat was responsible for color change of fibers, as a fluid it is, it would soak the fabric and probably there would be coloration on the other side of the cloth, and besides, contrary to what is observed on the Shroud there would be a continuum of colored fibers in «image» áreas ( I mean at microscopical level there would not be colored fibers and uncolored fibers side by side..) The question of superficial fiber coloration at thread level would not be fulfilled either. Question 3 A sweat imprint on cloth would be by defenition a contact imprint, ON THE CONTRARY THE SHROUD IMAGE IS NOT(al least in several anatomical áreas) A CONTACT IMAGE. Question 4 If it would be possible to wrap a naked human body with its skin covered with sweat in a linen sheet with the aim of obtaining an image, the result would be as follows (assuming that a color change would occur independently of the time elapsed to get it..) It would be a contact only blurred image, with different macroscopic and microscopic characteristics relative to Shroud image let alone the fact it would have no 3 D encoding. SWEAT THEORY HAS ALREADY BEEN DISPROVED, let’s not waste time speculating on old fashion and out of date issues, regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2014-11-14","mins":"5:11 am","url":"https://shroudstory.com/2014/11/13/a-sweat-imprint-that-is-a-negative-which-is-comparable-to-a-brass-rubbing/","cat":"image_theory","title":"A sweat imprint that is a negative which is comparable to a brass rubbing"},{"id":"comment-199453","author":"antero_de_frias_moreira","post":"«Note that the image of the man of the shroud has more than a hundred of impacts and not a single tearing of the skin is visible. The “perfect” form of the little balls is similar to the “perfect” form of the trails of blood. Too “perfect” to be true.» The last sentence simply is not true Daveb has already made reference to the excellent paper on this subject by Professor Giulio fanti and Barbara Faccini nevertheless I’d add the following: It’s simply not true that all scourge marks have perfect dumbell lshapes matching the roman flagrum whipping. It’s impossible for the punisher to apply the same strength and direction to every lash, so some lashes would produce only contusions and bruisings of soft tissues while most of them would probably injury the subcutaneous fat and even muscles below and skin tearing could occur. When subcutaneous fat tissue and muscles were injured by the «flagrum plumbatae» bleeding would occur and soon an extended area of blood smear anc clotting should follow. If this was the case neither clear cut scourging marks nor body image would be apparent. Dr.Thibault Heimburger has already mentioned Professor Zugibe’s hypothesis that the Man of the Shroud was washed. By removing that large dried blood area by washing reopened scourging lesions that reached subcutaneous fat and muscular layer would bleed again even if their correspondent skin area was torn away and it is not unreasonable to assert that the shape of this re bleeding would match the offensive object, bacause what bleeds is not the superficial skin layer but the subcutaneous fat and muscle,, in other words the shape of blood marks from scourging is related to bleeding from muscle an fat NOT THE SUPERFICIAL SKIN. This is exactly what we observe on the Shroud let alone the fact that besides U.V. Fluorescence photographs show a serum halo around the scourge marks. This is a FACT and no medieval forger would be able to accomplish such a deed!!!. For me this is the most plausible medical explanation and the most probable scenario that I share with you. For ethical motives it is not possible to reproduce such a scenario with a living person who would be killed by crucifixion partially washed and wrapped in a linen sheet Thus a definitive experimental answer cannot be given and I think the previous reasoning is enough. Regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2015-05-18","mins":"11:09 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199555","author":"antero_de_frias_moreira","post":"“Are these Shroud scholars wrong and misinterpreting the scourge marks?” Yes they are. Here is the most relevant image from Miller and Pellicori’s paper: The second line is what Dr. Hugh Farey wrote Another reference I found: THE 1978 SCIENTIFIC STUDY OF THE SHROUD OF TURIN ROBERT H. DINEGAR http://www.shroud.com/pdfs/ssi04part3.pdf « Bloodstains do not fluoresce—it is virtually totally absorbing in the ultraviolet. However, at the border of the scourge marks and around the periphery of the heavier blood flows, there is a white fluorescence, invisible in white light. When tested chemically this was identified as serum albumin. Blood degradation products in the form of bile pigments were also found.» Is the late S.T.U.R.P. Team researcher Dr. Robert Dinegar also wrong?.","date":"2015-05-19","mins":"3:20 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199529","author":"antero_de_frias_moreira","post":"As usual in this Blog Dr. Hugh Farey wrote a rebuttal of my comment « U.V. Fluorescence photographs show a serum halo around the scourge marks. This is a FACT» as follows: « No, it isn’t. The UV photos of the back of the body show rather a high background fluorescence, against which any extra fluorescence due to ‘serum’ is impossible to affirm. Some of the other bloodstains have partial fluorescent borders. Miller and Pellicori, who carried out the study, say “Fluorescing borders apparent around some areas.” Although they mention the fluorescence around many wound marks, they do not mention any around the scourgemarks of the back.» Dr. Alan Adler wrote: 1 « All blood images show evidence of clot rtraction rings of serumabout each wound, these being easily seen in the fluoescence photographic study» in The Turin Shroud Pst Preent and Future International Scientific Symposium, Torino2 5 March 2000 Chapter Chemical and Physical Characteristics of the Bloodstains page 220. 2 ….« …a series of ultraviolet fluorescent photographic images were made of the Shroud….Also the border of every blood mark shows the typical yellowish fluorescence of the serum exsudate ring…» in The Orphaned Manuscript Foreword pages 13, 14 Dr. Kelly Kearse wrote: «Each individual blood wound shows a distinct serum clot retraction ring; such blood halos are only visible under ultraviolet light (5), a detail that a forger is unlikely…. In« Blood on the Shroud of Turin an Immunological review» 2012 http://www.shroud.com/pdfs/kearse.pdf Dr Thibault Heimburger wrote: «Everybody can see the fluorescent halo around the main bloodstains in the UV Vis photographs. In fact, small fluorescent haloes were also observed around all the blood marks, even around the scourges.» in «A detailed critical review of the chemical studies on the Turin Shroud: Facts and Interpretations 2008 https://www.shroud.com/pdfs/thibault%20final%2001.pdf Are these Shroud scholars wrong and misinterpreting the scourge marks? I invite commenters to draw their own conclusions regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2015-05-19","mins":"12:59 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199690","author":"antero_de_frias_moreira","post":"Frankly it’s my guess that Shroud scholars have not examined in detail every bloodstain on every obtained U.V. Fluorescence photograph, namely the scouge marks nevertheless I’m sure a sufficient number was studied so a general conclusion could be drawn, and that conclusion has already been presented. Dr. Max Patrick Amon wrote “Pellicori and Miller (…) present seven photos of the shroud, from Dorsal Foot to Ventral Foot, and comment on the features of each one. No reference is made of fluorescence around the scourge marks is made until the third photo (the back, see above), when they say “Many scourge marks have fluorescing bordering areas. Nevertheless Dr. Hugh Farey wrote a rebuttal of my comment Are these Shroud scholars wrong and misinterpreting the scourge marks?” Yes they are. Here is the most relevant image from Miller and Pellicori’s paper: “Although they (Miller and Pellicori) mention the fluorescence around many wound marks, they do not mention any around the scourgemarks of the back”. These are absolutely opposite points of view!!!!! Who is right??? In a near future I predict the release of a new Shroud book titled « SINDONOCLASM How my science debunks the Myth» I’ll be the first to order it. Regards Antero de Frias Moreira Centro português de Sindonologia.","date":"2015-05-20","mins":"11:22 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199713","author":"antero_de_frias_moreira","post":"Max accept my apologies for misquoting you regards Antero de Frias Moreira.","date":"2015-05-20","mins":"2:49 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-52503","author":"antero_de_frias_moreira","post":"Tomorrow never dies is the title of one of James Bond movies, and it seems this title can be applied to some of Shroud Image Formation Theories, Why scorch theory never dies? Why you guys don’t accept as serious from a scientific stand point the excellent experimental works on this matter done by Professor John Jackson and more recently published by Dr. Thibault Heimburger? Let’s finish worthless discussion on this subject l Let’s bury once and for all this ludicrous theory, scorch theory is bogus so rest in peace for all eternity! FACT: SCIENCE HAS NOT YET PROVIDED A WAY TO EXACTLY REPRODUCE THE SHROUD IMAGE WITH ALL IT’S CHARACTERISTICS As far as I know Shroud image is still unique regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2013-11-23","mins":"8:25 am","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-52967","author":"antero_de_frias_moreira","post":"Dear Dr. Hugh Farey I apologize the readers of this wonderful blog because part of my comment is a personal response to a kind of reply on my own comment, which deserves to be answered. I know you are a scientist although I don’t know your field of expertise, but I have also a science background on anatomy physics and chemistry because I’m a Physical & Rehabilitation Medicine doctor. I’m surprised you know portuguese language because calling me «senhor» is evidence you know the polite way to adress a portuguese adult male and that’s good indeed. I’ve studied with much attention most of scientific papers on the Shroud and it puzzles my mind how «kitchen lab» experiments can hastily cast doubts on established facts, backed by studying samples from the Shroud with sophisticated technical tools. I mean for exemple the Shroud image not being a scorch was a conclusion Dr. Thibault Heimburger got from several linen scorch experiments and microscopical observation and even light scorch produces effects on linen fibers with microscopical characteristics different from Shroud image fibers.. Dr John Jackson, Dr. Adler Dr. Heller, Professor Raymond Rogers and other scientists OBSERVED THE SHROUD IN SITU AND GOT SAMPLES FROM IT for off site study. Photographs, fibers dusts particles have been thoroughly studied and characterized. Are these scientists dishonest or are they trying to fool people because they have an hidden agenda? I don’t think so. If Dr Thibault Heimburger states the Shroud image cannot be a scorch (and he is not the only scientist to conclude that…) it turns out it’s worthless to try to demontrate the opposite. As a science man I sicerely hope Vatican releases data gathered on material collected in 2002 restoration. Professor Bruno Barberis spoke an interesting lecture at 2012 Valencia Shroud Congress presenting a list of new physical and chemical tests to be done on the Shroud. Having been asked when, he said he hoped the Pope granted permission in a near future, I also hope so. May be questions skeptics are making can be answered in a definitive way,, namely the recent one of the possibility of colored image fibers under bloodstains. I’m pretty sure if protéases will be applied on such blood fibers the same result as Professor Adler will show up. Centro Português de Sindonologia is a modest non profit association, not a «publicity machine», and we can’t afford doing scientific investigation on the Shroud, and our presentations don’t have a religious agenda. Our presentations are backed on reliable historical and scientific works to make people aware of this awesome Christian relic.in a rational way. Regards Antero de Frias Moreira.","date":"2013-11-27","mins":"3:36 pm","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-168168","author":"antero_de_frias_moreira","post":"I utterly agree with Daveb when it comes to the excellence of Dr,Latendresse’s paper. I think the question of how the cloth was placed over the top of the head was already analyzed on this blog and it is my personal opinion that an air gap beteen the top of the head and the cloth cannot be excluded based only on empirical paper measurements and «medium» anatomical distances from the front and the back top of the head. This point of view shoud certainly be considered if a contact mechanism /normal to the skin mechanism is assumed as the way the image formed on the cloth. On the contrary if the Body wrapped in the cloth projected His image onto the cloth by an orthogonal collimated way as Professor Alan Adler (and other researchers) thought), then there’s no problem accepting that the cloth was firmly drawn over the top of the head. Professor Latendresse nicely explained the boodstain issue but a question puzzles my mind, and I think it would be useful to discuss it on this blog: BLOODSTAINS ON THE SIDES OF THE FACE APPARENTLY ON THE HAIR IF A CONTACT MECHANISM IS ASSUMED FOR THEIR IMPRESSION ON THE CLOTH DID THEY ORIGINATE FROM THE FACE OR FROM THE HAIR? There are contradictory findings Everyone remembers Dr. Gilbert Lavoie’s experience with a stained sheet covering the head of a long hair bearded man and the conclusion was staightforward: bloodstains beside the face of the Man of he Shroud and apparently on the hair originated from the anatomical face. On the other way Dr. Petrus Soons states that when image processing expert Bernardo Galmarini «replaced» the previously removed bloodstains over the 3 D face model they appear on the hair on two sides of the face!!! Weird enough isn’t it? regards Antero de Frias Moreira Centro Português de Sindonologia –.","date":"2014-11-03","mins":"6:22 am","url":"https://shroudstory.com/2014/11/02/paper-chase-a-significant-paper-by-mario-latendresse/","cat":"image_theory","title":"Paper Chase:  A Significant Paper by Mario Latendresse"},{"id":"comment-119218","author":"antero_de_frias_moreira","post":"Perhaps that Emeritus Professor of Physiology at London University did not pay much attention to what he read or has an anti authenticity Shroud agenda like the person who cited his conclusion. Any medical doctor after reading that paper or more recents like the ones of Dr. Thibault Heimburger ( with direct link in his previous May 13 comment) or Dr. Kelly Kearse ( on Immunological studies, and some wonderful comments he did on this blog), could draw no other conclusion than red stains being human blood. Excellent papers worthreading even by non Shroud enthusiasts I renew my appraisal to their authors. Regards Antero de Frias Moreira (Centro Português de Sindonologia).","date":"2014-05-14","mins":"10:01 am","url":"https://shroudstory.com/2014/05/13/schwortz-it-is-worth-reviewing-david-fords-noteworthy-blood-or-paint-paper/","cat":"image_theory","title":"Schwortz: It is Worth Reviewing David Ford’s Noteworthy Blood or Paint Paper"},{"id":"comment-206456","author":"antero_de_frias_moreira","post":"Dear Dave Hines I utterly agree with the first part of your comment. Actually persons like the one you mentioned are quite intelligent and try to «poison the well» to mislead people interested on the honest study of the Shroud, nevertheless a careful reading of their writtings will find contradictions and hidden fallacies. Your hypothesis is quite interesting and your assertions make sense, they seem to fit admitted Shroud image properties. Dr. Petrus Soons, the leading expert on holography applied to the Shroud wrote in his website http://shroud3d.com/home page/introduction holographic observations in the shroud image holographic theory interesting ideas that match your point of view. Perhaps Jesus body was the source of a laser radiation emission I recall eexperiences by Professor Paolo Di Lazzaro who obtained superficial discoloration of linen fibers exposed to bursts of U.V. Laser irradiation within narrow parameters of wavelength power anf time. Although science will never prove this scenario it’s not absurd to think that God granted mankind a unique image of His Son Jesus Christ. Regards Antero de Frias Moreira (Centro Português de Sindonologia).","date":"2015-07-24","mins":"7:03 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-206507","author":"antero_de_frias_moreira","post":"Buenos dias David I understand spoken spanish language nevertheless I cannot write correctly so I prefer to comment in english. I praise your interest on Shroud image study and what you wrote makes a lot of sense in my humble opinion. You made an interesting point «Also during the process of making a hologram there can be no sound vibration. Object must be 100% static. Cloth must also be 100% static.» This is exactly the conclusion drawn by Professor Latendresse http://www.academia.edu/9063899/The Turin Shroud Was Not Flattened Before the Images Formed and no Major Image and http://www.sindonology.org/papers/latendresse2005a Slides.pdf Go on with your research you have all my support P.S.: can you tell me your fireld of expertise? regards Antero de Frias Moreira Antero.","date":"2015-07-25","mins":"4:39 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","title":"The Shroud is a Holograph?"},{"id":"comment-101882","author":"antero_de_frias_moreira","post":"What a wonderful Easter gift from Dr. Thibault Heimburger! I was eagerly waiting his new work on the infamous scorch hypothesis now I’ll have the pleasure to read it carefully. Congratulations and many thanks to Dr. Thibault Heimburger Antero de Frias Moreira (Centro Português de Sindonologia).","date":"2014-04-21","mins":"4:43 am","url":"https://shroudstory.com/2014/04/17/the-turin-shroud-image-is-not-a-scorch/","cat":"image_theory","title":"The Turin Shroud Image is not a Scorch"},{"id":"comment-83777","author":"antero_de_frias_moreira","post":"This question has already been discussed on this blog nevertheless I’d like to point out this:. If you watch carefully a Durante’s 2000 image from Shroudscope and you magnify the image there is no doubt that a water stain is between the ventral and dorsal head images on the Shroud ,and the waterstain overlaps a bit the superior occipital area near the blood marks from the cap of thorns. There is a distance about 16 18 centimeters between the two head images as it has been stated. Are there any blood marks between the two head images? I see some spots with a color perhaps similar to the blood marks but I’m not sure, If those supposed marks are ibood indeed, then there was not any kind of fabric over the head of the Man of the Shroud namely a chin band. Does any one Know if Professor Baima Bollone or Professors Alan Adler and John Heller collected any samples for blood studies from this area? As far as I know this area has not been sampled, regards Antero de Frias Moreira Centro Português de Sindonoogia.","date":"2014-03-01","mins":"8:52 am","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"id":"comment-90012","author":"antero_de_frias_moreira","post":"All these comments on kitchen lab experiments on the «scorch hypothesis» are absolutely worthless. My advice for those who think that scorching linen can produce changes on fibers similar to those of Shroud of Turin image fibers is to read the thorough investigation on this issue by Dr. Thibault Heimburger. Which is available on this Blog. «The Turin Shroud Body Image: The Scorch Hypothesis Revisited» is a worth reading article where macroscopic and microscopic aspects of linen scorching are approached with extrerme accuracy, and THE CONCLUSION IS THAT SCORCHING LINEN CANNOT REPRODUCE CHANGES SIMILAR TO THE ONES IN IMAGE AREAS OF THE TURIN SHROUD (even light scorching…) Acidic linen fiber oxidation as in Professor Garlaschelli’s experiment, couldn’t produce an image on linen similar to the Shroud’s ( on a microscopical examination) either. For those who claim otherwise here goes my challenge: This year you’ll have the opportunity to do your own presentations and show your results at St. Louis and Bari Conferences. If you are able to reproduce an image with ALL the properties of the original I’ll be the first to praise your work. Regards Antero de Frias Moreira (Centro Português de Sindonologia).","date":"2014-03-17","mins":"9:03 am","url":"https://shroudstory.com/2014/03/14/two-comments-promoted-colin-berry-has-cracked-the-shroud-enigma/","cat":"image_theory","title":"Two Comments Promoted:  Colin Berry Has Cracked the Shroud Enigma?"},{"id":"comment-90026","author":"antero_de_frias_moreira","post":"Correction: « All these comments on kitchen lab experiments on the scorch hypothesis are absolutely worthless» I didn’t mean to say that comments were worthless. My opinion based on reliable previous investigations on this issue is that «Scorch Hypothesis» actually cannot be considered as a possible way of obtaining an image on linen just like the one on the Shroud ,because it has already been disproved by previous researchers namely S.T.U.R.P and Dr. Thibault Heimburger, so these kitchen lab experiments bring NOTHING new to unveil how the Turin Shroud image was produced. I did not intend to disrespect any commenter on this post. Antero de Frias Moreira.","date":"2014-03-17","mins":"9:52 am","url":"https://shroudstory.com/2014/03/14/two-comments-promoted-colin-berry-has-cracked-the-shroud-enigma/","cat":"image_theory","title":"Two Comments Promoted:  Colin Berry Has Cracked the Shroud Enigma?"},{"id":"comment-90393","author":"antero_de_frias_moreira","post":"To Chris: Your reasoning on fluorescence of scorch areas and non fluorescence of Image under U.V. Light is absolutely right. As far as I remember Dr.Alan Adler hypothesized that a faint fluorescence of non image areas of the Shroud could be explained by the presence of pectic residues on the fabric. To satisfy the request of Dr. Hugh Farey, the kind of scientific investigation on the Shroud I think is not worthless is the one done by honest scientists who are searching for the TRUTH, wihout an hidden anti authenticity agenda. Now just a little correction, you are mistaken stating that Professor Giulio Fanti investigated laser beams effects, his works studied rather the effects of Corona Discharge on linen fabrics, and he obtained interesting results indeed. Who studied the effects of Laser Beams on linen was Professor Paolo di Lazzaro’s team. May be one day I’ll have the pleasure to study a paper from your investigations on chemical scorching of linen fibers proving that a Shroud like image with ALL PROPERTIES LIKE THE ORIGINAL (namely microscopic, absence of medulla coloration, colored fibers side by side with non colored fibers, 3 D encoding etc.) can be obtained by this method. Regards Antero de Frias Moreira (Centro Português de Sindonologia).","date":"2014-03-18","mins":"11:04 am","url":"https://shroudstory.com/2014/03/14/two-comments-promoted-colin-berry-has-cracked-the-shroud-enigma/","cat":"image_theory","title":"Two Comments Promoted:  Colin Berry Has Cracked the Shroud Enigma?"},{"id":"comment-195059","author":"antero_de_frias_moreira","post":"«At the moment we can only say two things: the fabric is medieval and the image is not the imprint of a human body. At 99% if you want. The other 1% is for miracles.» PREPOSTEROUS ABSOLUTE NONSENSE Once more skeptics show themselves ignorant about serious scientific studies on the Shroud and uncover their fanatic antiauthenticity agenda driven comments. The Shroud of Turin did wrap a real Human body and that body was the crucified Jesus. And the Image imprinted on it is the result of a miracle granted by God. I’m a person with scientific background not a kind of gullible fanatic religious guy and I’m not ashamed to assume that the Shroud of Turin is the testimony of Christ’s Passion and Resurrection Antero de Frias Moreira Centro Português de Sindonologia.","date":"2015-04-01","mins":"4:36 am","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"},{"id":"comment-195091","author":"antero_de_frias_moreira","post":"«I have pointed out many times recently, non authenticist views are almost invariably based on detailed study of the “serious scientific studies” while authenticists frequently appear not to have read it at all.» « authenticists frequently appear not to have read it at all.» This is not fair and categorically does not apply to me, I try to be updated reading new papers and attending Shroud scientific events whenever possible. Authenticists should have a solid basis for their belief. I believe Dr. Hugh Farey did indeed study with detail «serious scientific studies» but his aim is completely different from mine. After all besides Dr Mc Crone’s controversial studies which skeptical «serious» studies on the Shroud have been done?excluding kitchen lab experiments? So it turns out that even skeptics are aware that to try to debunk the Shroud they have to get information from honest scientists who study the Shroud and try to mislead people with their point of view from that information. Regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2015-04-01","mins":"9:14 am","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"},{"id":"comment-195171","author":"antero_de_frias_moreira","post":"Just a short reply to Dr. Hugh Farey and David Mo «My aim is to try to establish whether the Shroud is 1st century or medieval, and how the image came about. That’s all. What is your aim?» I sincerely hope that in a near future a scientist with so high level of knowledge as you claim to have will be invited to a future Shroud scientific investigation team. May be then a definitive answer STURP could not get will be achieved by your contribution. I’d be delighted. «Senhor Frias de Moreira; “I’m a person with scientific background not a kind of gullible fanatic religious guy “. These are not mutually incompatible conditions, but I don’t remember I had called you neither the one nor the other. I have nothing to comment about your beliefs. But if you think you can present an evidence of a miracle (the Shroud miracle in this occasion) I’ll be glad to know how you are able to do so, because if your reasons are as feeble as Marino’s are, they do not impress me at all. NOTE: I feel very generous to give you a 1% of chance. You see, I am neither a gullible fanatic sceptic.» Correction Senhor de Frias Moreira Miracles cannot be reproduced in a laboratory or any other facility and who am I to perform miracles?I’m not God and miracles don’t happen whenever we want and besides science cannot dismiss miracles. I won’t accept your »generous gift» neither will I go on exchanging my points of view with skeptics like you. It’s utter useless. Feliz Páscoa(Happy Easter) Antero de Frias Moreira.","date":"2015-04-02","mins":"6:07 am","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"},{"id":"comment-177303","author":"antero_de_frias_moreira","post":"«What hypotheses does Antero think are worth discussing?» I feel very honored by Dr. Hugh Farey being concerned on what I think worth discussing. Although going astray from the subject of this post I’ll satisfy his curiosity. I recognize the difficulties in doing image research and honestly I think Shroud researchers should turn their attention to the effects of electric fields, U.V. Photons and amino carbonyl reations on linen fabrics. There was an interesting paper in St. Louis Conference although very hypothetical (dealing with electic fields) to which everyone can access above on this blog. Why Professor Valery Shalatonin from Minsk University detected an electric field around a real size replica of the Shroud of Turin? ( he showed the graphics of the electic field and I think that he was not deceiving the attendance) that’s really odd.(this presentation happened in Bari Conference) I attended Professors Fanti and Di Lazzaro’s lectures last September in Bari and I was impressed by microphotograps of colored linen fibers very similar to the colored image fibers of the Shroud namely absence of medulla coloration nevertheless the images obtained were quite different. Professor Di Lazzaro’s laser brush face on fabric seems an artistic depiction of the Shroud face. Professor Fanti’s ventral manikin image obtained by external electric field generating corona discharge is absolutely different from the original, namely significant distortions, although at microscopical level the results were quite similar to Shroud colored fibers. One silly question then came to my mind: why did not they place a corpse inside the device instead of a metallic manikin? would that improve the macroscopic aspect of the resulting image? Obviously ethycal and legal principles preclude that kind of experiment, but my guess is perhaps some kitchen lab scientists will pick up the idea to do experimental work with dead animals ( I recall an experiment with a pig some time ago but with poor results) I wish you all a Merry Christmas Antero de Frias Moreira ( Centro Português de Sindonologia).","date":"2014-12-17","mins":"1:47 pm","url":"https://shroudstory.com/2014/12/15/is-fluorescence-still-in-question/","cat":"science","title":"Is Fluorescence Still in Question?"},{"id":"comment-170335","author":"antero_de_frias_moreira","post":"Exellent article,, once more my sincere congratulations to O,K,. After reading such an informative paper only dishonest people with an hidden agenda to discredit the Shroud could state that old crap that a medieval forger did indeed achieve to produce a negative body image on a linen sheet, whith ALL GREY SCALE GRADATIONS AS THE SHROUD IMAGE. Nevertheless one question remains to be explained IF WE’RE TALKING ABOUT A PHOTOGRAPHIC NEGATIVE ON THE REAL SHROUD THEN THE HAIR SHOULD APPEAR WHITE (as in real black & white photographic negatives) unless the Man of the Shroud was an old man with white hair or he was ALBINO I think the answer is straightforward; THE IMAGE ON THE SHROUD IS NOT A REAL NEGATIVE ALTHOUGH IT SEEMS SO(and behaves like a negative) THE COLOR ON GREYSCALE IS FUNCTION OF THE DISTANCE OF THE ANATOMICAL BODY AREA RELATIVE TO THE SHEET COVERING THE BODY NOT THE GREYSCALE TONE OF THE ANATOMICAL BODY AREA,, This is one more reason to discard the photographic image theory namely the infamous Leonardo’s photographic negative crucified corpse image. The only word that comes to my mind when I read people stating that it’s very easy to obtain a body negative image on a linen sheet is NAIF (more accurately dishonest,, trying to fool people who reads them…) regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2014-11-10","mins":"5:07 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","title":"Guest Posting by O.K. on the Shroud as a Negative"},{"id":"comment-176993","author":"antero_de_frias_moreira","post":"It’s worthless discussing the «Scorch Hypothesis» Dr. Thibault Heimburger has already nicely discarded that theory just read on this blog his wonderful paper THE TURIN SHROUD BODY IMAGE:THE SCORCH HYPOTHESIS REVISITED Definitly whatever produced the Turin Shroud body Image was not a scorch and that’s it Merry Christmas Antero de Frias Moreira Centro Português de Sindonologia.","date":"2014-12-16","mins":"11:42 am","url":"https://shroudstory.com/2014/12/15/is-fluorescence-still-in-question/","cat":"science","title":"Is Fluorescence Still in Question?"}]
