[{"id":"comment-215184","author":"antero_de_frias_moreira","post":"This image appears in Dr. Petrus Soons interesting website http://shroud3d.com/home page/introduction image qualities of the shroud of turin regards Antero de Frias Moreira.","date":"2015-11-27","mins":"12:13 pm","url":"https://shroudstory.com/2015/11/27/i-hope-this-helps/","cat":"reader_inquiry","title":"I Hope This Helps"},{"id":"comment-209247","author":"antero_de_frias_moreira","post":"After reading all this, there is no alternative but to change my mind. Pope Francis certainly believes the Shroud is real otherwise he would not have attitudes of reverence with other relics, after all the Shroud is the most important christian relic. It does not surprise me at all that he had spoken about the Devil because he himself performed a kind of exorcism on a disabled boy allegedly with a demonic possession. Are exorcists fanatic priests or are they priest with a special training skill to fight with the dark forces? I don’t buy theories of «modern» so called theologians that deny the Devil’s existence and state that Christ’s ressurrection was a spiritual event ( I really don’t know what they mean with that). If Christian religions did not have a mystic side namely miracles and the fight with evil, christian doctrine would be just a kind of empty philosophy. The Shroud is the living testimony that something happened with Jesus body in that dark tomb, and no matter what the physics and chemistry of that event were they left the imprint of His body on the cloth. Regards Antero de Frias Moreira ( Centro Português de Sindonologia).","date":"2015-08-29","mins":"3:52 am","url":"https://shroudstory.com/2015/08/28/is-pope-francis-walking-on-the-mystical-side/","cat":"news_&_views","title":"Is Pope Francis Walking On the Mystical Side?"},{"id":"comment-214634","author":"antero_de_frias_moreira","post":"Our sympathy to French people and prays for those who were murdered in this abominable killing Centro Português de Sindonologia.","date":"2015-11-15","mins":"12:20 pm","url":"https://shroudstory.com/2015/11/14/paris/","cat":"news_&_views","title":"Paris"},{"id":"comment-142626","author":"antero_de_frias_moreira","post":"Professor Francesco Lattarulo had the kindness of sending me the program of the Workshop. I think it will be worth attending this event. I hope to meet some of you in Bari regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2014-08-06","mins":"1:23 pm","url":"https://shroudstory.com/2014/08/06/scientific-conference-on-the-shroud-of-turin/","cat":"news_&_views","title":"Scientific Conference on the Shroud of Turin"},{"id":"comment-169530","author":"antero_de_frias_moreira","post":"On behalf of Centro Português de Sindonologia I want to express our sympathy on your project. God bless you Antero de Frias Moreira.","date":"2014-11-07","mins":"5:02 am","url":"https://shroudstory.com/2014/11/06/status-update-on-the-new-mexico-shroud-of-turin-museum/","cat":"news_&_views","title":"Status Update on the New Mexico Shroud of Turin Museum"},{"id":"comment-216602","author":"antero_de_frias_moreira","post":"Dear Dr. Dan Porter It’s hard to believe that such a wonderful forum of discussion has come to an end. I and my wife Maria da Glória (who is learning Theology and teaching cathechesis in a parish) feel very sad for this great sindonological loss. We hope to have given a small contribution to your blog and we thank also the contrbution from all honest people who commented in this blog. On behalf of Centro Português de Sindonologia I praise your commitment to spreading reliable Shroud knowledge and all persons who seek the truth about the Shroud have a debt of gratitude to you. We have learned a lot from you and your blog and we keep in our archives many posts and comments. Warmest regards and God bless you Antero de Frias Moreira and Maria da Glória Gonçalves Barroso.","date":"2015-12-15","mins":"2:55 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"}]
