[{"id":"comment-96762","author":"antero_de_frias_moreira","post":"IN DEFENSE OF DR. THIBAULT HEIMBURGER AND OTHER SHROUD SCHOLARS I regret reading a previous comment crticizing Dr.Thibault Heimburger (and other shroud scholars) for doing research allegedly outside their field of expertise. Does knowlege have rigid boundaries? I can be a medical doctor and also have the skill to drive a fast race car in automobile race without being a professional pilot. Dr. Thibault Heimburger is a medical doctor (like myself) and so he undoubtedly has a background in microscopy, physics and chemistry, I recall that some medical doctors specialize in Biochemistry and are teatchers in Medical Schools. After reading attentively his papers I I get the idea that he has indeed a great knowlege in microscopy, physics and chemistry,, much greater than mine. His papers analyzing microscopical, chemical and physical aspects of the Shroud in a comprehensive way, gather overwhelming data to discard once and for all Mc Crone’s painting image theory, AND SCORCH THEORY. Nevertheless I eagerly wait reading his new paper on his new reaearch on the Scorch issue. Dr. Thibault Heimburger is an outstanding Shroud researcher who is seeking the scientific truth unlike pseudo Shroud researchers who get in kitchen lab experiments only to mislead readers of this wonderful blog. Dr. Kelly Kearse is another good example of a Shroud researcher who has given a great contibution to Shroud studies. His detailed studies on Blood issue enables us to conclude that the «blood stains» on the Shroud were produced by contact with a human body and not just a primate, and he also explained in a previous post why Dr. Charles Freeman’s statement that AB blood appeared only about 900 A.D. WAS WRONG, This is extremely important because if Shroud blood was only about 1000 years old despite many other facts, the Shroud could not be authentic ( could not have wrapped Jesus body). He debunked in a comprehensive way this theory presenting for example, archeological findings of 2000 years old AB blood mummies found in Israel and statements from experts who are in total disagreement with D’Adamos’ diet theory. He also explained on a genetic and molecular basis why the A gene appeared first than O gene,, and human AB blood group is much older than 900 A.D. As had been claimed. Till then nobody had solid arguments to disprove that theory ! I apologize for not mentioning ALL Shroud researchers who are doing excellent and honest research and contributing with their papers and presentaions to the advances in Sindonology, although a bit outside their field of expertise regards Antero de Frias Moreira (Centro Português de Sindonologia).","date":"2014-04-05","mins":"8:19 am","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","title":"Am I the only one?"},{"id":"comment-208226","author":"antero_de_frias_moreira","post":"Hi Louis I agree with you. I also have doubts if Pope Francis considers the Shoud as authentic, nevertheless I think he is not so well informed on all pertinent scientific data on the Shroud. My guess is that he is seriously worried will all kind of human sufferings , social issues and even church scandals like corruption, lobbies and pedophilia so there is no time left for him to read anything credible about the Shroud. I have talked with priests who know almost nothing about the Shroud and to make things worse don’t show any interest to get any kind of knowledge. J Ust for the record I know a priest who is also a historian BUT HE KNOWS ALMOST NOTHING ABOUT THE SHROUD who categorically denies the Shroud’s authenticity and even scoffs on the issue!!!! So this Pope’s attitude does not surprise me at all if he really has doubts on the Shroud’s authenticity. Nevertheless what is important is not the Pope’s opinion on authenticity but ALL CREDIBLE SCIENTIFIC AND HISTORIC DATA ( I i’m also including important conclusions from debates in this wonderful blog) pointing towards AUTHENTICITY. Regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2015-08-14","mins":"4:05 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"}]
