[{"id":"comment-210387","author":"antero_de_frias_moreira","post":"Concerning this post on the pollen question namely the misidentification of Gundelia Tournefoetii species versus «Carduus» I invite commenters to re read the interesting post on this issue on Dr. Stephen Jones’ Blog titled «Did Max frei Misidentify Carduus Argentatus Shroud Pollen as Gundelia Tournefortii?http://theshroudofturin.blogspot.pt/2008/11/did max frei misidentify carduus.html It’s worth reading it regards Antero de Frias Moreira.","date":"2015-09-14","mins":"2:13 pm","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"},{"id":"comment-214472","author":"antero_de_frias_moreira","post":"The Pollen Scam? NO Opponents of Shroud authenticity use the «difficulties» in interpreting the data of pollen studies as an argument to dismiss all the honest work done on this issue. If it’s true that Professor Danim changed his mind relative to his previous assertions on pollen classification and no longer used it as an evidence of including Palestine in the geographical track of the Shroud I must ask? 1 Was Palynologist Professor Baruch wrong interpreting Dr. Max Frei tapes? 2 Could the difficulties in classifying pollen on Dr. Max Frei tapes be caused by age deterioration of the samples? I We must remember that Dr. Frei’s classification was challenged namely by Professor Litt more than 20 years after he got the pollen samples. Several botanists did agree with Dr. Frei classification and botanist Dr. Mariotti Lippi wrote«I concluded that the Shroud in some unspecified period of time stayed in the Middle East.»in http://www.sindone.info/VALENC 6.PDF It seems to me that Professor Fanti’s et al studies on Shroud plant DNA is a serious study and a careful reading allows us to conclude that the Shroud had been in Middle East during a period of its existence. Professor Lucotte’s paper allows to conclude likewise. Perhaps authenticists cannot use the Pollen evidence as a very «strong» one for establishing an exact geographical trail of the Shroud but skeptics cannot use these problems with pollens to dismiss the Shroud’s authenticity or claim an european mediaeval origin either. So it turns out that the importancet of Professors Fanti and Lucotte’s studies (remember that the last one also mentioned the finding of mineral particles from a desertic soil) was to grant the possibility that the Shroud had been in Plalestine during a period of it’s existence. Were not these important papers, with all the controversy(possibly unjustified) on the Pollens, even the fact that the Shroud had been in the Middle East would be challenged by the skeptics. Regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2015-11-10","mins":"2:29 pm","url":"https://shroudstory.com/2015/11/10/the-pollen-scam/","cat":"science","title":"The Pollen Scam?"}]
