[{"id":"comment-213681","author":"antero_de_frias_moreira","post":"This is a very informative video nevertheless one thing puzzles my mind. There is correspondence between bloodstains on the occipital areas of the Sudarium and the Shroud as overlays allow us to conclude. But the question is: Was the helmet of thorns removed trom the head of the Man of the Shroud while He was hanging dead on the cross and before the Sudarium was placed? It seems to me that this question has not yet been discussed What do you think? regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2015-10-27","mins":"4:13 am","url":"https://shroudstory.com/2015/10/26/dan-spicer-we-have-a-simple-explanation/","cat":"critical_summary","title":"Dan Spicer:  We have a simple explanation."},{"id":"comment-213747","author":"antero_de_frias_moreira","post":"Dear Dr. Hugh Farey You wrote an interesting observation on serum halus and U.V. Photographs nevertheless I feel compelled to comment on another issue. You wrote « both red ochre and vermillion were found, both by Heller and Adler and Mc Crone. This is evidence» This is simply not true and may be misleading for someone not aware of Professor Adler and Professor Heller’s work. If it is true that Dr.Mc Crone claimed he found red ochre and vermillion because the Shroud had to be a painting HIS CONCLUSIONS WERE PROVEN WRONG. Professors Adler and Heller found red particles with different refractive indexes so called birefringent and non birrefringent red particles. The non birrefringent. Red particles are hematic material where iron is bound to heme group of Hemoglobin. The birefringent red particles correspond to Iron oxide resulting from the charring of blood and from oxidation of iron mainly in water stains. This form of iron oxide is clearly distinguished by them from the natural pigment red ochre because there is no contamination with Ni Co and Mn. They don’t mention «vermillion» either. What they found in their microscopical survey of the slides was a prysmatic hexagonal crystal and fragments of it« in the same area along a definite track» that was identified as cynnabar.(Hg S). They clearly asserted: «This is clearly an accidental artifact as we have seen nothing like it on other slides…» If there are indeed any particles of red ochre and vermillion on the Shroud that resulted from contact with painted copies of the Shroud , because the Shroud IS NOT A PAINTING regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2015-10-28","mins":"7:34 am","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213855","author":"antero_de_frias_moreira","post":"Dear Dr. Hugh Farey You wrote: «Heller (and Adler) found three forms of iron oxide, one of which “the chelated form” was found throughout the Shroud and supposed to be part of the retting process; another, the “heme bound form” is attributed to decayed blood, and the last, Fe2 O3 (red ochre), was found “primarily in the water stain margins and charred blood areas» Professors Heller and Adler wrote: «…Such cellulosic bound iron is probably a chelated covalent form held by the aldehyde and carboxylic groups of the partially oxidezed cellulose structure… Thus we find three types of iron on the Shroud a) a cellulose bound chelated form b) heme bound forms c) iron oxyde (Fe2 O3)…» (1) So it turns out there is only one form of iron oxyde and it is not red ochre because there are no contaminants such as Ni Co and Mn as I wrote in my previous comment You wrote:, « R.A.Morris found a direct correlation between image intensity and iron concentration, from 16.8ug/cm2 on the nose to 9.6ug/cm2 in the imageless space between the cheek and the hair. This is in direct contradiction to Heller’s conclusions, and agrees with Mc Crone.» This is in contradiction with: XRF facial scans (areas 1 to 11): measurements of the Iron content (microgr. /cm2): black dots; I have added the mean reflected light density of the same areas (on greyscale): red dots (only indicative because of the great scattering of the values). [Comments: One can see that there is no statistical difference in iron content from area 3 to 9, although there is no obvious image in areas 7 to 9 and a (relatively) “strong” image in areas 4 to 6. It must be noticed that the area 10 is considered as a partially “blood” area by the authors.] (2) I apologize for not being able to copy the XRF graphic I invite commenters on this blog to draw their own conclusions…. I’m done with this… 1 A Chemical Investigation of the Shroud of Turin, John H. Heller and Alan D.Adler the Orphaned Manuscript Effata Editrice pp. 41 42 2 A detailed critical review of the chemical studies on the Turin Shroud: Facts and interpretations, Thibault Heimburger https://www.shroud.com/pdfs/thibault%20final%2001.pdf regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2015-10-29","mins":"2:23 pm","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-213901","author":"antero_de_frias_moreira","post":"«ps. I’m not a Doctor.» In Portugal the standards of academic degree allow me to name you Dr. Because as far as I know you are a Science teacher. Actually not only medical doctors have Dr. Written before their name. Most of students that finish their university studies, namely languages, history archaeology ecconomics , sciences etc are called Dr.( Engineers and Architects have this academic degree before their names too..) University teachers who have their thesis approved are called «Professor Doctor… You can say Portugal is a country of «doctors» and I agree but I don’t care being just Antero….","date":"2015-10-30","mins":"4:28 am","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-214434","author":"antero_de_frias_moreira","post":"Dear Sampath You wrote: «If resurrection is a miracle then we may not get an image on the Shroud. So then some sort of process should have taken place during the resurrection.» This time I don’t agree with you. No matter what can be said about how the Image formed on the cloth the FACT is that whatever the «agent» responsible for the chemical changes that produced discoloration of the linen fibers THIS HAPPENED ONLY ONCE IN THE HISTORY OF MANKIND and with one Man whose name was Jesus Christ. Till now even the most sophisticated essays for duplicating the IMAGE OF THE SHROUD have not achieved a reliable result, I mean for example Professor Luigi Garlaschelli’s image, Professor Fanti’s (this one obtained by a process of corona discharge was quite grotesque…) and so on. I’m convinced that the so called process of image formation acted through the laws of nature which were established by GOD the creator of the Universe, no matter if it was a «naturalistic» process like a Maillard reaction, emitted radiation or some kind of supernatural event. The fact is that whatever happened in that tomb with Jesus dead Body left an imprint on the Shroud and what else can it be but a MIRACLE? This imprint on the Shroud is by itself a miracle and was produced as a by product of the biggest miracle, the Resurrection of Christ. We’ll never know what the Resurrection is from a scientific point of view because miracles are beyiond the realm of science but we do know that the Image of the Man of the Shroud is a miracle granted by God to mankind. Well these are just my thoughts. GOD bless you Antero de Frias Moreira (Centro Português de Sindonologia).","date":"2015-11-09","mins":"4:39 am","url":"https://shroudstory.com/2015/11/08/the-process-of-resurrection/","cat":"critical_summary","title":"The Process of Resurrection"},{"id":"comment-206969","author":"antero_de_frias_moreira","post":"Boa tarde Louis Não disponho de seu endereço electónico; pode contactar por favor fazendo um comentário para http://www.santosudariodeturim.blogspot.com. Antero.","date":"2015-07-30","mins":"2:19 pm","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-206956","author":"antero_de_frias_moreira","post":"Dear Daveb of Wellington As a Physical and Rehabilitation Medicine doctor I’ll try to respond your question: « Is it not possible for the nerve cells to respond to such a stimulus in that situation, i.e. As soon as they are severed from the central nervous system? I should like a professionally competent based response to that question.» From a motor point of view peripheral nervous system I mean peripheral nerves can have motor effects on muscle independently from Central Nervous System either in pathological conditions I recall for example Amyotrophic Lateral Sclerosis which causes medullar anterior horn cell degeneration and this condition causes involuntary fascicullations of muscles, or by external stimuli applied on peripheral nerves which is the condition under analysis. Actually, Barbet experiments were not on nerve cells but the effects of a noxious stimulation (a kind of mechanical parcial injury on the axons of the median nerve in the carpal tunnel of the wrist). Obviously I have never done such an experiment, nevertheless our therapeutic techniques on disabled patients namely cerebrovascular hemiplegic patients and paraplegic patiens who have no Central Nervous System command on medullar anterior horn motor neuron cell can benefit from electrical stimulalion applied to peripheral nerves that’s myelin axon stimulation to obtain a non voluntary functional muscle contraction. If we consider a severed limb for reimplantation, at room temperature muscles degenerate after about six hours, but peripheral nerves still function because axon Wallerian degeneration begins just about 3 or 4 days after the injury ( This conclusion is applied to the living patient, there is no such information for amputated limbs nevertheless it’s not unreasonable to think that survival interval can be a little shorter) But what really matters is that a nerve stimulation of a freshly amputated limb can produce a muscle contraction independently from Central Nervous System control regards Antero de Frias Moreira ( Centro Português de Sindonologia ).","date":"2015-07-30","mins":"8:34 am","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-207020","author":"antero_de_frias_moreira","post":"Bom dia Louis Segui sua sugestão mas o seu endereço e mail não me é acessivel no site academia edu dos seus trabalhos. Sugeria lhe que contactasse comigo atravez do endereço electónico em Shroud of Turin Centers & Organizations Portugal (Centro Português de Sindonologia) https://www.shroud.com/centers.htm Fico a aguardar seu contacto Antero.","date":"2015-07-31","mins":"6:00 am","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-207012","author":"antero_de_frias_moreira","post":"To Anoxie I guess once more you are misiunderstanding the physiology of muscle contraction. As can be deduced from what i wrote if you apply a stimulus to a peripheral nerve in a recently amputated limb it is expected a muscle contration to occur in muscles innervated by that nerve. The big question is besides electrical stimulation of axons can a mechanical stimulus initiate axon depolarization i. E. An action potential? Before trying to answer this question I’ve done research on scientific papers available in the web and in m owny library but frankly results were very poor. Nevertheless previous comment from Daveb contains some relevant elements and I found something useful « Mechanical[edit] In response to a mechanical stimulus, cellular sensors of force are proposed to be extracellular matrix molecules, cytoskeleton, transmembrane proteins, proteins at the membrane phospholipid interface, elements of the nuclear matrix, chromatin, and the lipid bilayer. Response can be twofold: the extracellular matrix, for example, is a conductor of mechanical forces but its structure and composition is also influenced by the cellular responses to those same applied or endogenously generated forces.[8] Mechanosensitive ion channels are found in many cell types and it has been shown that the permeability of these channels to cations is affected by stretch receptors and mechanical stimuli.[9] This permeability of ion channels is the basis for the conversion of the mechanical stimulus into an electrical signal..» https://en.wikipedia.org/wiki/Stimulus (physiology) I admit that during Dr.Barbet’s experiments with amputated arms a mechanical stimulus on the median nerve occured when part of the nerve was crushed by the nail piercing the wrist in the carpal tunnel so theorethically a muscle contraction of some thenar muscles would be possible. Obviously law and ethics now preclude such experiments so we must rely on Dr.Barbet’s honesty describing the results and frankly I see no reason for doubting him regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2015-07-31","mins":"5:41 am","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-207090","author":"antero_de_frias_moreira","post":"To Anoxie «In order to directly study the mechanical stimulation of crushing, Barbet should have crushed the median nerve in the forearm, not in the wrist just beside/through the ligament and the carpal bones.» What is the anatomic basis to support such assertion? I see none. «Obviously you can take a freshly amputated limb from a rabbit or a cow, and squeeze/brush/pierce the sciatic nerve for example, at distance from an articulation.» Obviously that’s a different condition namely different species and different muscle groups involved and besides such experiments are a cruelty to animals and I won’t perform them. Regards Antero de Frias Moreira.","date":"2015-07-31","mins":"1:24 pm","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-207353","author":"antero_de_frias_moreira","post":"Interesting paper indeed I’ll keep it, but there is a little caveat The hands of the crucified in the image on the Shroud ARE NOT IN THE SO CALLED ICONIC CLENCHED POSITION this was rather seen in artistic depictions so these theorethical considerations CANNOT BE APPLIED TO THE SHROUD. If I had to bet between Professor Zugibe and Dr.Pierre Barbet’s hypothesis on this issue I’d choose Dr.Barbet’s hypothesis on wrist nailing, median nerve nociceptive mechanical stimulation and position of the thumb. Actually NOTHING FROM ANATOMY AND PERIPHERAL NERVE PHYSIOLOGY CAN DISMISS DR. BARBET’S CLAIM. I think several previous comments from Dr. Stan Walker, Daveb , Carlos and myself have provided a thorough explanation WHY ! (you’re free to believe whatever you want, despite all evidence, and against all evidence) I’m done with this regards Antero de Frias Moreira.","date":"2015-08-03","mins":"12:44 pm","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-207425","author":"antero_de_frias_moreira","post":"Mr. David Mo «Is there any evidence about an injure similar to that alleged by Barbet in contemporary medicine? Is there any confirmation of the experiences of Dr. Barbet by an independent team? Are the experiences of Zugibe contradictory with Barbet’s claims? What is your concept of “evidence”? (I’m affraid your concept is a peculiar one). Thank you.» Certainly there are perforating injuries of the wrists similat to the ones described by Dr. Pierre Barbet in his experiments with amputated arms but don’t be naif because nobody is worried with the effects of the piercing object on the median nerves doctors are rather worried in diagnostic and therapeutic procedures and rehabilitation of residual physical disabilities Dont’t expect doctors (or anyone) to perform experiments with amputated arms because it’s obviously illegal and anti ethical so either you believe Dr. Barbet’s conclusions or not (as it is expectable) and don’t expect to hear anything from an hypothetical sadistic psychopath either. The experiments of Professor Zugibe are not by themselves contradictory of Dr. Pierre Barbet’s conclusions they are rather another point of view. My concept of evidence is the same of everyone with an open mind but unfortunately it seems to be different from yours. «One more thing: recent evidence presented by Dr. Borrini and Dr. Garlaschelli is important.» Gimme a break that’s utter garbage. If you want to know why follow my advice: go to https://shroudstory.com/2015/04/11/new garlaschelli and borrini study/#comments and read comments from O.K. Dr. Thibault Heimburger and from myself and perhaps you’ll change your mind. I’m sorry for making you waste your time for a moment I forgot you were a skeptic.","date":"2015-08-04","mins":"1:17 pm","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"}]
