[{"id":"comment-168987","author":"antero_de_frias_moreira","post":"To those who claim «A regular artist can obtain a similar or better 3 D effect with simple technics. I am not precisely a great draftsman but in 5’ with a pencil and a finger I have done my contribution to the sindonist theory of “exceptional 3 D” by heart. La voilà! My advice is before doing such claims they should first read what image processing experts concluded, namely Engineer Christophe Mignot(studying Joe Nickell’s «shroud» face and the Shadow Shroud face and comparing their alleged 3 D encoding to the original Shroud face) and the conclusions achieved by Professor Fanti and Dr Thibault Heimburger on Professor Garlaschelli’s replica of the Shroud, as O.K.nicely pointed out. My personal congratulations to O.K. For his(or her) comments. Nevertheless I think it is worthless discussing these issues with skeptics because they are not open minded persons and their aim is just try to debunk the Shroud whatever it costs even hiding objective facts and distorting information to misinform who may read their comments. Regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2014-11-05","mins":"2:22 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169293","author":"antero_de_frias_moreira","post":"To all commenters who think the Shroud was a mediaeval masterpiece and claim it’s very easy to reproduce it’s 3 D encoded information I adress these two challenges: 1 Show us just ONE known mediaeval masterpiece having image characteristics just like the Shroud. 2 Try to produce by any means you choose an image just like the Shroud image whith ALL macroscopic, microscopic and 3 D encoding properties. I’d be delighted to see someone accomplish these challenges. To Professor Charles Freeman. I have no doubt you are a qualified historian but all historical data about the Shroud I gathered from other historians as qualified as you makes me have a different point of view concerning the dating of the Shroud, and besides science has already discredited 1988 radiocarbon tests ( I won’t repeat all bla bla bla about that….) To Mr. David Mo: I’m sorry if I’ve not made myself clear concerning Shroud image 3 D encoding. I meant the comparison between Professor Garlaschelli’s face and the Shroud face which was an aspect analyzed by Dr. Thibault Heimburger and Professor Giulio Fanti in their paper «Scientific comparison between the Turin Shroud and the first hand made copy» Procedings of the International Workshop on the Scientific approach to the Acheiropoietos Images, ENEA Frascati Italy 4 6 May, 2010 You’ll find it in http://www.shroud.com The other paper by Engineer Christophe Mignot you’ll find it entitled « De l’aspect tridimensionel comparé du Linceul de Turin et des faux suaires realisés experimentalement» in french website http://www.suaire science.com Nevertheless I don’t expect you’ll change your mind. I’ve learned one thing Shroud skeptics will always remain like that, no matter what kind of evidence pointing otherwise will be presented. Although they claim to be searching the truth, the only« truth» for them are their own claims regards Antero de Frias Moreira Centro Português de Sindonologia..","date":"2014-11-06","mins":"12:34 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-117785","author":"antero_de_frias_moreira","post":"Just now I have some time to comment on this issue… The theory of right shoulder dislocation is not new but I was surprised by the possibility of associated brachial pexus palsy. The most prevalent variety of shoulder dislocation the anterior often occurs when patients fall sustaining their weigth by hand contact with the ground in external rotation/extension of the arm, or by a sudden movement of extreme arm abduction extension external rotation of the shoulder. If the Man of the Shroud had His superior limbs in an abducted shoulder position due to «rigor mortis» i before being removed from the cross, an applied force to put them in an adduction position as we see on the Shroud would hardly result in anterior shoulder dislocation it would rather produce perhaps a frature of the superior part of the Humerus or the Glenoid cavity. The inferior shoulder dislocation variety is extremely rare and before orthopedic reduction, the patient presents with an irreductible elevated arm.(I have observed it once only in my 33 year medical practice in a patient for rehabilitation…) so this situation is easily discarded by observing superior limbs position of Shroud image. Concerning the second pathological condition mentioned Brachial Plexus Injury a trauma involving a violent stretch of the cervical spine and scapular girdle as it could happen in a fall without hand protection, or a torture aggression, could in theory be responsible for a lesion involving superior roots of the Brachial Plexus maybe including the seventh cervical root, but complete Brachial Plexus injuries are characteristic of high velocity/high impact trauma as the ones in motor vehicle accidents namely motorcycles. The condition known as Claude Bernard Horner syndrome may be present only in complete (C5 C6 C7 C8 D1) lesions of the Brachial Plexus, and results from sympahetic cervical nervous system injury clinically producing a reduced ocular opening by ptosis of superior eyelid and apparent enophtalmos and a reduced pupilar diameter.(myosis). Bearing in mind all this and observing the Shroud Image my opinion as a medical doctor dealing with injured patients is as follows: If the Man of the Shroud suffered traumatic injuries from torture and falling to the ground without hand protection an anterior dislocation of the right or left shoulder is a plausible possibility,the same applies to injury of the Brachial Plexus, but it would be extremely uncommon a complete paralysis of the superior limb, and Claude Bernard Horner syndrome does not immediatly appear and besides as far as I know it is a condition observed in the living person and not in a corpse. Now let’s analyze the Shroud Image: We’re facing a real problem because there is no shoulder or arm image on both sides because those areas were destroyed by Chambery’s 1532 fire. Even if the right shoulder area was there I think we could hardly discern the clinical signs of anterior shoulder dislocation. The fact that right forearm is longer than letft and has a length apparently out of proportion with anatomy does not necessarily mean that the shoulder is dislocated. This observation can be explained by the position of right superior limb relative to the left and the way image was produced on the cloth, perhaps tensile forces applied to the fabric and unknown factors image experts advice on this issue would be welcome. Now ,looking at right eye area ,we observe a closed eyelid ,periorbital oedema and swelling of the cheek area of the face. All these findings can be explained by the severity of blunt traumas the Man of the Shroud endured and I agree with Dr. Thibault Heimburger that a fracture of the orbital part of the malar bone could produce such an aspect, so Claude Bernard Horner syndrome is perhaps a far fetched possibility. To summarize ,and with due respect to the authors of the paper under comment , my humble opinion is that stating that the Man of the Shroud had a dislocated right shoulder and a paralysis of the brachial plexus is very hard to prove indeed based only on visual image analysis, and pathophysiology of those injuries. Regards Antero de Frias Moreira (Centro Português de Sindonologia).","date":"2014-05-12","mins":"9:43 am","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","title":"Breaking News:  New Injury Details Seen on the Shroud of Turin"},{"id":"comment-118646","author":"antero_de_frias_moreira","post":"Dear colleague Dr. Carlos I respect your opinion and I’m aware of the existence of Shroud copies painted before 1532 Chambery’s fire, namely the one of Xabregas in my country, nevertheless just by observing these paintings frankly I don’t find enough criteria to make a diagnosis of right anterior shoulder dislocation.( what you called «luxation glenoidea» ). Actually the assimetry in shape of the shoulders and arm lenght is probably a technical painting imperfection and I think those bizarre depictions of the Shroud of Turin could never express the details of the original and ,much less show the clinical signs of shoulder dislocation. As you know the diagnosis of shoulder dislocation although with high accuracy clinical suspicion, can only be surely stated by radiograph exam and we do not have an X Ray exam of the Man of the Shroud’s right shoulder…. I did not deny categorically the possibility that the Man of the Shroud suffered a dislocation of the right shoulder what I meant is there is no evidence of such condition on the Shroud of Turin. Don’t get me wrong,, this is just a medical and technical detail that does not harm the authenticity of the Shroud I guess different opinions of Shroud researchers are welcome. Congratulations on your interesting website «La Sanana y los escépticos» I can read spanish quite easily I apologize for writing in english but I can’t write español.correctly. Regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2014-05-13","mins":"12:46 pm","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","title":"Breaking News:  New Injury Details Seen on the Shroud of Turin"},{"id":"comment-198906","author":"antero_de_frias_moreira","post":"«It would appear that we have all missed a recent article on the TS written for the Spectator by historian/novelist Dominic Selwood.» As it would be expected such article is written in a skeptical biased way with lots of imprecisions and pre conceived assumptions parroting the same old crap and deserves no further comments, and reading it is timewaste. Regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2015-05-12","mins":"4:20 am","url":"https://shroudstory.com/2015/05/11/double-dipping-in-the-ink-well/","cat":"press_coverage","title":"Double Dipping in the Ink Well?"},{"id":"comment-203825","author":"antero_de_frias_moreira","post":"SUPPORTING j OSIE TYNER Dear Josie Tyner Despite that unsympathetic rebuttal to your comment most of what you wrote in your own words about the scientific aspects of the Shroud of Turin is backed by the conclusions of honest scientists who studied the Shroud of Turin and the Sudarium of Oviedo. Actually the painting of a naked Christ was absolutely unusual in medieval art(most of historian arts agree with this), the blood marks on the Shroud are consistent with contact with a body that sustained the horrors of scourging, crowning with a helmet of thorns and crucified with nails on the wrists (not the palm) and had his side pierced with a spear – THESE ARE EVIDENCES PRESENTED BY FORENSIC EXPERTS, NOT SPECULATIONS. The question pf pollens is a bit more complex due to difficulties in taxonomical classification of pollen grains, namely ancient samples collected by Dr. Max Frei nevertheless there are pollens on the Shroud that allow us to conclude that it had been in the Middle East possibly in Palestine. New studies on contaminating human DNA and plant DNA from dust vaccuumed from the Shroud ( by Professor Fanti and an enlarged team of italian geneticists) coroborate the known historical Shroud trail. NO doubt blood marks on the occipital area area of the head image of the Shroud match the ones on the Sudarium of Oviedo, and this is not a matter of faith it’s enough to compare the photos side by side.. This is a subject that cannot be denied and recent studies by Centro Español de Sindonologia support this conclusion, and besides this fact is a classical argument against he validity of the infamous 1988 radiocarbon tests. You must be aware that skeptics always try to deceive us denying evidences and spreading controversy When we study all the evidences pro and con the conclusion can be no other than the Shroud is indeed the cloth that wrapped the Body of Jesus Christ. Regards Antero de Fias Moreira (Centro Português de Sindonologia).","date":"2015-06-27","mins":"4:37 am","url":"https://shroudstory.com/2015/06/24/in-the-eyes-of-the-befuddled/","cat":"press_coverage","title":"In the Eyes of the Befuddled"},{"id":"comment-193067","author":"antero_de_frias_moreira","post":"Skeptics wil never accept or understand the Shroud message because they only care trying to distort the truth and deceive people. I’d be happy to know what standards they consider to accept some importants issues discussed in this blog, but till now my curiosity has not been satisfied It seems nothing will satisfy them as long as the matter under analysis points toward authenticity. Excellent comment from Russ Breault highlighting the spiritual side of the Shroud that some commenters will never reach. Regards Antero de Frias Moreira.","date":"2015-03-10","mins":"2:11 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"id":"comment-192980","author":"antero_de_frias_moreira","post":"Dear Daveb of Wellington NZ On behalf of Centro Português de Sindonologia I sincerely hope you give up your purpose of withdrawing from this blog. You are a serious Shroud researcher and your comments are always very wise and we all learn a lot with them. Warmest regards Antero de Frias Moreira.","date":"2015-03-09","mins":"2:41 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"id":"comment-199212","author":"antero_de_frias_moreira","post":"To Sampath Fernando I read your May 14 comment and you’re absolutely right. As it would be expected the reply from Dr. Hugh Farey is misleading. I wion’t discuss every issue but if it’s true that nailing in the wrist like the Shroud image has till now no archaeological back up that’s easy to explain because carpal bones are small size and age effects namely separation and bone erosion would preclude or make very difficult to determine bone erosions due to nailing. Nevertheless I read somewhere that archaelogists found remains of a forearm with bone aspects of nailing through the distal radius and ulna near the first range of carpal bones. And you should also remember that Dr. Pierre Barbet conducted experiences with amputated arms and cadavers and concluded that it’s impossible to sustain a body on the cross by nailing through the palms. In my humble opinion as a medical doctor with anatomical knowledge the exit wound on the dorsal image of the left wrist matches the so called Destot’s space between lunate triquetrum capitatum and hamatum wrist bones(not the palm/metacarpal area) «The artist need not have known anything about negatives and 3 D, which effects are inevitable consequences of the visualisation of an image made by a body on a cloth. » Gimme a break…. I think that when you wrote tridimensional coding you meant an image with volumetric/tridimensional encoding that when submitted to 3 D computer analysis unveils a human body with reasonable anatomic accuracy , These image properties were verified in the Shroud Image by different image processing programs, not just with the VP 8. Notice that obtaining relief in relation with darker or lighter image areas IS NOT THE SAME AS 3 D ANATOMOAL ACCURACY Burn holes appear different than surrrounding non burned areas of the Shroud in VP 8 image analysis as expected nevertheless this fact has nothing in common with the details and reasonable anatomical exactness of the body image. If producing a Shroud like image by a «body on cloth» was that easy there would be «many shrouds»…. My reply ends here because those other issues have already been studied by qualified experts as you know. Regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2015-05-15","mins":"11:00 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","title":"Too Great to Be a Work of Art"},{"id":"comment-74978","author":"antero_de_frias_moreira","post":"Why are you so unfair with Professor Fanti? Professor Fanti has the merit to have developed a new non destructive ancient textiles dating method, and has published his methodology in a respected scientific journal I mean Vibrational Spectroscopy. As far as I Know his new method along with Professor Roger’s degradation kinetics of vanillin loss are the only alternative scientific ways to date Shroud fibers. People interested on the scientific study of the Shroud should feel grateful to his commitment to the Shroud and Shroud Science Group. I feel honored to praise Professor Giulio Fanti as the great scientist he his and for his excellent contributions to Shroud science. Antero de Frias Moreira (Centro Português de Sindonologia) P.S. Will an English edition of this book appear?.","date":"2014-01-28","mins":"12:01 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-75087","author":"antero_de_frias_moreira","post":"Dear Piero Thanks for your information. Although I can’t read italian I understood some words and the meaning of the article, but these techniques are far beyond my field of expertise. I trully believe professor Fanti did indeed test Shroud fibers, and his new method of ancient textile dating, although not accurate as radiocarbon brings new clues on this issue. Let’s hope experts will validate Professor Fanti’s method. Regards Antero de Frias Moreira.","date":"2014-01-29","mins":"1:49 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-192603","author":"antero_de_frias_moreira","post":"Centro Português de Sindonologia agrees with everything Dr. Barrie Schwortz stated. Actually the documentary dealt the Shroud issue in an incomplete way and highlighted already discredit skeptic theories, neglecting several important aspects, namely the discredited 1988 radiocarbon tests and the unique image characteristics. Nevertheless not everything was negative and we’re pleased that in the United States the Shroud of Turin is still a mater of interest for the general public which unfortunately does not happen in Portugal. Regards Antero de Frias Moreira.","date":"2015-03-06","mins":"5:21 am","url":"https://shroudstory.com/2015/03/06/barrie-schwortz-on-the-cnn-shroud-of-turin-program/","cat":"television","title":"Barrie Schwortz on the CNN Shroud of Turin Program"},{"id":"comment-189391","author":"antero_de_frias_moreira","post":"That’s an interesting tought but we have to consider other aspects. Uric aciid kidney stones form when patients suffer from a primary(unknown cause) or secondary hyperuricemia this situation occurs for exemple when there is increased cell turnover breakdown as in lymphomas and leukemia or chemotherapy of malignant diseases. Normouricemic people seldom develop uric acid calculi and although extrreme dehydration would be a precipitating condition for uric acid crystals formation and aggregation and stone formation it would take time for that to occur and we cannot exactly know how long would it take. And why not calcium oxalate crystals? Uric acid nephroitiasis no doubt could cause ureteral spasms with excruciating lumbar pain if it really happened during the hours preceding Jesus death on the cross, and it would be an addicional cause of suffering. Nevertheless for acute renal failure to occur, urine flow had to be completely compromised by obstruction of both ureters. Acute failure can be a primary cause of death but it will not kill the patient in a few hours. If this surmised renal failure was another cause contributive to the death of the Man of the Shroud in my modest opinion as a physician I think hypovolemic schock caused by scourging wounds, dehydration «per se» and neurogenic autonomic system disfunction by the extreme sufferings were the possible main causes, not obstructing renal calculi. But even if renal function impairment occured it would be a serious adverse clinical condition but not a direct cause of death. The death of the Man of the Shroud was caused mainly by asphixia hastened by muscle disfunction because of a state of impaired blood flow due to hypovolemic schock. I grant there are other possibilities as myocardial infarction or cardiac arithmia but this is my humble opinion. Regards Antero de Frias Moreira Centro Português de Sindonologia.","date":"2015-02-05","mins":"11:39 am","url":"https://shroudstory.com/2015/02/05/set-your-dvr-an-unprecedented-cnn-event-on-march-1/","cat":"video","title":"Set Your DVR:  An Unprecedented CNN Event on March 1"}]
