[{"title":"\n`The Turin Shroud is a fake ... and it's one of 40': Antonio Lombatti\n","post":"\n\nHi Stephen, WELL documented and articulated rebuttal of lamentable Church Hirorian AL's unashamed claim. I myself had to rply to his assertions, questions and comments. You can read them on Dan's Blog. On the latter's blog you'll find many post of mine on the Pray Ms miniature. Methink you'll much benefit from reading them...\n\n","author":"Max Patrick Hamon","date":"June 16, 2012 at 5:30 AM","url":"http://theshroudofturin.blogspot.com/2012/06/turin-shroud-is-fake-and-its-one-of-40.html","site":"moore"},{"title":"\n`The Turin Shroud is a fake ... and it's one of 40': Antonio Lombatti\n","post":"\n\nMax>WELL documented and articulated rebuttal of lamentable Church Hirorian AL's unashamed claim. Thanks.>I myself had to rply to his assertions, questions and comments. I expect there will be many pro-authenticity responses, including by English-writing Italians who can read his paper in the journal Studi Medievali. >You can read them on Dan's Blog.Sorry, but I don't normally read comments on Dan's blog.>On the latter's blog you'll find many post of mine on the Pray Ms miniature. Great.>Methink you'll much benefit from reading them...As I don't normally read Dan's blog, I will have to miss out on that benefit.Stephen E. Jones-----------------------------------Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. Each individual will usually be allowed only one comment under each post. Since I no longer debate, any response by me will usually be only once to each individual under each post. I reserve the right to respond to any comment as a separate blog post.\n\n","author":"Stephen E Jones","date":"June 16, 2012 at 8:16 AM","url":"http://theshroudofturin.blogspot.com/2012/06/turin-shroud-is-fake-and-its-one-of-40.html","site":"moore"},{"title":"\n`The Turin Shroud is a fake ... and it's one of 40': Antonio Lombatti\n","post":"\n\nSuperb critique Stephen.Speaking of Dan's blog, I have been debating the Pray Manuscript with Colin Berry. A significant development was that after much prompting I got him to admit that the two red streaks on the shroud were in fact blood. This is a significant victory, because as I pointed out to him it is unknown for art of that period and even up to at least the 14th-15th centuries, for images to show blood on the shroud in entombment scenes. This is further evidence that the manuscript is based on a viewing of the shroud.He's still saying that the 4 circles in a one-off, assymmetrical L shaped pattern are just a random decorative motif though, which just defies logic as far as I am concerned!\n\n","author":"Matt","date":"June 16, 2012 at 12:42 PM","url":"http://theshroudofturin.blogspot.com/2012/06/turin-shroud-is-fake-and-its-one-of-40.html","site":"moore"},{"title":"\n`The Turin Shroud is a fake ... and it's one of 40': Antonio Lombatti\n","post":"\n\nMatt >Superb critique Stephen.Thanks.>Speaking of Dan's blog, I have been debating the Pray Manuscript with Colin Berry. Great! I only get Dan's posts, not his comments, so I am blissfully unaware of that debate.>A significant development was that after much prompting I got him to admit that the two red streaks on the shroud were in fact blood. There is hope for him yet! As you state below it is a major concession for a Shroud anti-authenticist to admit that the blood on the Shroud is real blood (see below).I have just responded in a comment under my post, \"Shroud of Turin: Burial sheet of Jesus!: #9 The man has wounds and bloodstains matching the Gospels' description of the suffering and crucifixion of Jesus Christ\") to a private message to Gio which is about the blood on the Shroud soaking through to the underside, which I presume was based on comments on Dan's blog by Colin.>This is a significant victory, because as I pointed out to him it is unknown for art of that period and even up to at least the 14th-15th centuries, for images to show blood on the shroud in entombment scenes. Indeed it is \"a significant victory,\" which was resisted by Walter McCrone to his dying day. He knew that no medieval forger would use real blood in painting the Shroud. Apart from the fact that real blood normally turns black (the Shroud's blood is red because of the bile pigment bilirubin, which is a response to massive physical trauma), there is the inherent difficulty (not to mention repugnance) of painting with blood.And real blood on the Shroud makes hot statue/bas relief methods unviable because the blood was on the Shroud before the image and so would be cooked if the blood-soaked linen cloth was placed over the hot statue/bas relief.>This is further evidence that the manuscript is based on a viewing of the shroud.Sorry, but it is unclear to me why there being \"two red streaks on the shroud\" (there are a lot more than that) is \"further evidence that the [Pray] manuscript is based on a viewing of the shroud.>He's still saying that the 4 circles in a one-off, assymmetrical L shaped pattern are just a random decorative motif though, which just defies logic as far as I am concerned!Like most (if not all) non-Christian Shroud anti-authenticists, Colin is afraid to accept evidence that would point to the Shroud being authentic, because they rightly sense that it would be a `slippery slope' down (actually up!) the path of them becoming Christians.As the agnostic Professor of Anatomy at the Sorbonne, Yves Delage, responded to his fellow atheist/agnostic members of the French Academy of Sciences, who attacked and ridiculed him for reading a paper to them in 1902 arguing that the Shroud was authentic, `if it was anyone but Christ, the evidence would be accepted':\"If, instead of Christ, there were a question of some person like a Sargon, an Achilles or one of the Pharaohs, no one would have thought of making any objection ... I have been faithful to the true spirit of science in treating this question, intent only on the truth, not concerned in the least whether it would affect the interests of any religious party ... I recognize Christ as a historical personage and I see no reason why anyone should be scandalized that there still exist material traces of his earthly life.'\" (Walsh, J.E., \"The Shroud,\" 1963, pp.106-107).But as Colin the scientist knows, refusing to accept evidence because one doesn't like it for personal reasons, is the very antithesis of science.The true scientific attitude is to follow the evidence wherever it leads.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"June 16, 2012 at 2:59 PM","url":"http://theshroudofturin.blogspot.com/2012/06/turin-shroud-is-fake-and-its-one-of-40.html","site":"moore"},{"title":"\n`The Turin Shroud is a fake ... and it's one of 40': Antonio Lombatti\n","post":"\n\nStephenI should clarify that when I am referring to two red streaks on the shroud, I am referring to the shroud as shown on the Pray Manuscript image. Sorry for not articulating that clearly.Colin didn't admit to real blood on the real shroud, rather he admitted the two red streaks  on the object in the Pray Manuscript image which he thinks is the sarcophagus lid and we think is the shroud, represent blood.I think this is significant. As I say,in the history of the art of Jesus's entombment there is very little evidence of blood on Jesus's discarded cloths / shroud. Almost always the cloths / shroud are unblemished. I think that the Pray Manuscript artist shows two red streaks representing a bloodied shroud is therefore very significant.My interpretation is that the two red streaks represent the two long streaks of blood on the arms of Jesus in the real shroud. In my view this is all stacking up very nicely, as the two long streaks of blood on the arms in the real shroud, and the L shaped poker holes, are two of the most prominent features.\n\n","author":"Matt","date":"June 16, 2012 at 4:32 PM","url":"http://theshroudofturin.blogspot.com/2012/06/turin-shroud-is-fake-and-its-one-of-40.html","site":"moore"},{"title":"\n`The Turin Shroud is a fake ... and it's one of 40': Antonio Lombatti\n","post":"\n\nMatt>I should clarify that when I am referring to two red streaks on the shroud, I am referring to the shroud as shown on the Pray Manuscript image. Sorry for not articulating that clearly.OK.>Colin didn't admit to real blood on the real shroud, rather he admitted the two red streaks on the object in the Pray Manuscript image which he thinks is the sarcophagus lid and we think is the shroud, represent blood.That explains it. But it is still a problem for him, because the Pray Manuscript was created in 1192-95 and the artist depicted blood, including a mark exactly where the reversed 3 bloodstain is on the Shroud.>I think this is significant. As I say,in the history of the art of Jesus's entombment there is very little evidence of blood on Jesus's discarded cloths / shroud. Almost always the cloths / shroud are unblemished. Agreed. The Byzantine artists used the Shroud image to depict Jesus as living and ruling (which is what \"Pantocrator\" means). So it is very significant that the Pray Manuscript depicted Jesus nude and with bloodstains, as He is on the Shroud.>I think that the Pray Manuscript artist shows two red streaks representing a bloodied shroud is therefore very significant.By the other red streak, apart from the reversed 3, I thought you meant the crown of thorns mark(s) in Jesus' hair on plate III (but see below). There are also red marks on Jesus' hands and right side on plate IV, corresponding to the nail wound and the spear wound bloodstains on the Shroud, although the left hand is covered by the right hand on the Shroud.But most significantly, equivalent to the L-shaped `poker holes', Jesus' right hand on plate IV has the red nail wound mark on Jesus' wrist, exactly where it is on the Shroud! See my JPG of it in my 2010, \"The Pray Manuscript.\" The significance of this is actually strengthened by the fact the Pray Manuscript artist depicted the nail wound on the left hand of plate IV, which is covered by the right hand on the Shroud, in the palm as it traditionally is depicted by medieval artists. I am going to insert this as point 5 in \"My critique of `The Pray Codex,' Wikipedia, 1 May 2011, making 13 points (14 if the crown of thorns bloodstains are also inserted). I will also add an image of plate IV to that page.>My interpretation is that the two red streaks represent the two long streaks of blood on the arms of Jesus in the real shroud. I cannot see those \"two red streaks\" on plate III of my copy of Berkowitz.>In my view this is all stacking up very nicely, as the two long streaks of blood on the arms in the real shroud, and the L shaped poker holes, are two of the most prominent features.And the nail bloodstain in the wrist of Jesus' right hand of plate IV, exactly as it is on the Shroud, contrary to the traditional crucifix depiction of the nails being in Jesus' palms, as they are on Jesus' left hand in plate IV![continued]\n\n","author":"Stephen E Jones","date":"June 16, 2012 at 7:26 PM","url":"http://theshroudofturin.blogspot.com/2012/06/turin-shroud-is-fake-and-its-one-of-40.html","site":"moore"},{"title":"\n`The Turin Shroud is a fake ... and it's one of 40': Antonio Lombatti\n","post":"\n\n[continued]BTW Colin a few hours ago tried to post here a substandard comment (which I deleted as per my stated policy) about my \"travesty of a blog site and of blogging\" and in which he threatened, \"I am minded to report you to Blogger Blogspot for your abuse of the medium\" and my \"sticking your simplistic labels on me.\" And because my \"modus operandi here is highly obnoxious\"! He also complained about you, so presumably it was about me wrongly assuming you meant he had admitted there were bloodstains on the Shroud.It seems Colin's twice calling me \"a boil on the bum of the blogosphere\" is not him \"sticking a simplistic label\" on me! Colin, in the unlikely event you carried out your threat to report me to Blogger, for me using the very tools Blogger provides its blog Moderators to protect their blogs from wreckers, and in the even more unlikely event Blogger took any notice of your complaint, after even a cursory investigation they would no doubt remind you of the legal maxim, \"He who comes into equity must come with clean hands.\" But to help you make your complaint, here is a suggested pro-forma for you to use:-----------------------------------Dear Blogger,I wish to report Stephen Jones for refusing to let me make \"off-topic, offensive or sub-standard\" comments to his The Shroud of Turin blog. I have already told him twice that he is \"a boil on the bum of the blogosphere\" but he hasn't taken any notice.Can you please take away his Moderator's power to delete my nasty posts?Yours scientifically,Colin Berry  -----------------------------------All jokes aside Colin, you are entitled to correct here any misrepresentation (unintentional) of your position, but you must do it within my stated policies and without your usual nastiness. Otherwise your comments won't appear.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"June 16, 2012 at 7:53 PM","url":"http://theshroudofturin.blogspot.com/2012/06/turin-shroud-is-fake-and-its-one-of-40.html","site":"moore"},{"title":"\n`The Turin Shroud is a fake ... and it's one of 40': Antonio Lombatti\n","post":"\n\n>I cannot see those \"two red streaks\" on plate III of my copy of Berkowitz.I'm talking abut the two parallel red streaks on the image at the bottom of Plate 3, near the angel's foot, on the herringbone weave patterned object. The red streaks are next to cross motifs which I believe symbolise the image of Jesus on the real shroud.So, to sum up, what I interpret in the lower image of plate 3:- There is the herringbone weave patterned shroud (whether it is the shroud by itself or the shroud on top of a sarcophagus lid is fairly inconsequential)- On this representation of the shroud are crosses in its central area, to the right of the angel's foot. These crosses represent the image of Jesus on the Shroud- Immediately to the left of the crosses, just under the angel's foot, are two red streaks, which represent the blood marks on the shroud, possibly the two most prominent streaks of blood on Jesus's arms. The streaks are shown as the artist is moving progressively to showing Jesus's wounds and pain, from the small blood marks on the head in the upper image of Plate 3, to the more prominent red streaks in the lower image, to the blatant wounds on Jesus in Plate 4- Then to the right of the crosses and slightly overlapping them is the head cloth of Jesus, which is connected to the image of Jesus's head on Mary's sleeve. Colin Berry thinks this is the shroud.Note the original Greek of the Bible uses a word equivalent to \"entwined\" for the head cloth, rather than the commonly used word \"Folded\" in English translations. To my eye at least the head cloth looks entwined- Then to the right of this are the 4 circles which we interpret as the poker holes. Their placement is consistent with their placement on the real shroud just to the side of Jesus's image\n\n","author":"Matt","date":"June 17, 2012 at 7:25 AM","url":"http://theshroudofturin.blogspot.com/2012/06/turin-shroud-is-fake-and-its-one-of-40.html","site":"moore"},{"title":"\n`The Turin Shroud is a fake ... and it's one of 40': Antonio Lombatti\n","post":"\n\nStephen I got an interesting book on the Christian World in the Middle Ages, I found an image from the 11th century, a fresco from the church of San Clemente, Rome. It depicts scenes from the life of St Alexius, who lived in the fifth century, and interestingly was based in Edessa.In this image, St Alexius is praying over a sick girl, but look at the object by his right side. It looks suspiciously like a representation of the Shroud of Turin, although it is a bit hard to decipher the detail. At the very least, it is Jesus's full length image on \"something\". http://www.flickr.com/photos/hen-magonza/4641534107/Thoughts???Matt\n\n","author":"Matt","date":"June 17, 2012 at 3:54 PM","url":"http://theshroudofturin.blogspot.com/2012/06/turin-shroud-is-fake-and-its-one-of-40.html","site":"moore"},{"title":"\n`The Turin Shroud is a fake ... and it's one of 40': Antonio Lombatti\n","post":"\n\nMatt: it is a before-and-after scene, so the saint appears twice, and likewise so does the sick girl, probably at death's door (your \"Christ\")on the left restored to health on the right.Note the duplication of all the key figures.\n\n","author":"Later in the text there is a mention of his burial clothes being left in the tomb. Presumably if the cloth is the same as the Turin Shroud there is some other document that makes the link to these burial clothes.See above on \"sindon\", the same word used in the Gospels for Jesus' burial sheet.Stephen E. Jones.\n\n","author":"Stephen E Jones","date":"July 18, 2012 at 6:44 PM","url":"http://theshroudofturin.blogspot.com/2012/06/turin-shroud-is-fake-and-its-one-of-40.html","site":"moore"}]
