[{"title":"An Antonio Lombatti Poop Dump","post":"The man was not a scientist. He was a Timoth O’Leary sixties drop out who lost his way. He was not a “member” of STURP either. He was a hanger-on who performed menial services for the scientists who were members of STURP. That’s what I see.\nJerry Brown, the Governor of California, once dropped out, went to Calcutta and emptied bed pans for Mother Teresa. That did not make him a nun. \nThe real take away from this is the desperation of Shroud skeptics to tear down STURP and use any accusation available. It’s a tribute to STURP’s enduring legacy which remains the most authoritive scientific study of the Shroud. (and an  indication that the skeptics can no longer rely on the corrupted carbon dating fiasco, Thank you Thomas de Wesellow)\n\n","date":"June 15, 2013 at 6:37 am","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","id":"comment-37083","author":"John Klotz","site":"shroudstory"},{"title":"An Antonio Lombatti Poop Dump","post":"Oh, an another thing. He was arrested in 1981, three years after STURP’s 120 hours in Turin).\n\n","date":"June 15, 2013 at 6:40 am","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","id":"comment-37084","author":"John Klotz","site":"shroudstory"},{"title":"An Antonio Lombatti Poop Dump","post":"A final note and then back to Chapter 10.\nLast year, I was made privy to the personal copy of a STURP team member’s copy of the 978 test plan which included hand written interlineations made in 1978. It also included a roster of all the team members including those who were administrative. Brown’s name was not on it or at any other place. \nLombatti’s hatchet job on Brown would make Roy Cohn proud (or maybe Senator Ted Cruz).\n\n","date":"June 15, 2013 at 6:59 am","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","id":"comment-37086","author":"John Klotz","site":"shroudstory"},{"title":"An Antonio Lombatti Poop Dump","post":"This is what I would called ‘a massive scientific & archaeological argument against’ the TS authenticity by an arch-sceptic church historian losing it.\n\n","date":"June 15, 2013 at 6:54 am","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","id":"comment-37085","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Antonio Lombatti Poop Dump","post":"Agreed\n\n","date":"June 15, 2013 at 7:00 am","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","id":"comment-37087","author":"John Klotz","site":"shroudstory"},{"title":"An Antonio Lombatti Poop Dump","post":"A. Lombatti now scavenging for ‘arch-sceptic food’ in 1978 STURP dustbins!\n\n","date":"June 15, 2013 at 7:10 am","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","id":"comment-37088","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Antonio Lombatti Poop Dump","post":"Mi pare essere lo che costituisce ‘uno degli argomenti chiave’ nel dibattito scientifico e archeologico contra l’autenticità della Sindone da parte di un istoriano della chiesa chi perde la testa.\n\n","date":"June 15, 2013 at 7:37 am","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","id":"comment-37091","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Antonio Lombatti Poop Dump","post":"Correzione: Mi pare essere lo che costituisce ‘uno degli argomenti chiavi’ nel dibattito scientifico e archeologico contrano l’autenticità della Sindone da parte di uno storico della chiesa chi perde la testa.\n\n","date":"June 15, 2013 at 8:51 am","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","id":"comment-37095","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Antonio Lombatti Poop Dump","post":"Paterson, his wife and another man, Tom Dolle, were part of STURP’s support group along with the wives of several other STURP team members, and helped pack and unpack things and provided meals and other support while we were examining the cloth over 5 days and nights, nonstop. They were unpaid volunteers and paid their own expenses. \nThey were not in the room with the Shroud (although they helped to prepare the room before the Shroud was brought to us) and were not part of the scientific investigation. That is one of my photos on Lombatti’s blog as Jumper, Dolle and Paterson attached gold foil mylar to cover the removable steel panels of the Shroud examination table. That was BEFORE the Shroud was brought into the room.  They never appear in any of my photos taken during the 5 day examination because they were not there. They were never considered STURP team members (see the actual list at http://www.shroud.com/78team.htm). Neither was Marge Jumper, Mary Stevenson (the wife of Ken Stevenson) or Patti Lynn (the wife of Don Lynn) and several others, but they all helped loading and unloading the equipment, ran errands, helped administratively, etc. Those are the facts!\nSadly, Lombatti resorts to guilt by association to launch another attack on STURP. (If you can’t attack the science, attack the scientists)!  This man had nothing to do with STURP’s scientific mission and, as far as I know, we had nothing to do with him before or afterwards, except in a very peripheral way. I sincerely doubt that anyone on the STURP team had any knowledge of this blog information 35 years ago, or he certainly would not have been there. However, to use that to attack the STURP team and their work 35 years later is disappointing and rather sad. To stoop to such a new low makes me believe the skeptics are truly desperate and grasping at straws!  Frankly, I actually expected better of Lombatti.\n\n","date":"June 15, 2013 at 12:39 pm","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","id":"comment-37104","author":"Barrie Schwortz","site":"shroudstory"},{"title":"An Antonio Lombatti Poop Dump","post":"In reply to my posting:\n“This is what I would call ‘a massive scientific & archaeological argument against’ the TS authenticity by an arch-sceptic church historian losing it. \nLombatti wrote: Max, this is not a key point at all of course. However, I’d like to know why his name was removed from all official and non official lists of STURP members printed on books and articles. And, above all, how many STURP members belonged these two fundamentalist sects?\nMe: Paterson Brown non è uno scienziato neanche un membro dello STURP. Cerca l’errore.\nLombatti: From his CV: “1976-78: Original concept (in 1976, with Tom Dolle) of a computerized clarification of the Shroud of Turin image, and subsequent presence during the extensive scientific testing of the Shroud, Turin, Italy, October 1978”.\nSome pics: http://www.metalog.org/files/shroud/sturp.jpg http://www.metalog.org/files/shroud/turin11a.jpg http://www.metalog.org/files/shroud/turin07.jpg\nNot only did he work along with the STURP but he was of the founders. And you’re free to believe in the Easter Bunny and in Santa Claus.\nMe: Le due fotografie NON significano molto in se. Non sono del tutto la ‘prova del fuoco’ che PB fosse un scienziato neanche meno uno dei fondatori dello STURP. Quindi le ritorno il complimento “you’re free to believe in the Easter Bunny and in Santa Claus”. Si vede che tu sei stanco. Era solo uno sostenitore dello STURP.\nMe: Se pensi che un filosofe é uno scienziato davvero ‘”(no wonder) you believe in the Easter Bunny and in Santa Claus”.\n\n","date":"June 15, 2013 at 1:15 pm","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","id":"comment-37106","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Antonio Lombatti Poop Dump","post":"All things of this Earth serve God and His purpose.  What if all Lombartti said is true?  How does that affect the STURP findings?  Is this man serious?  I am sorry, but if the criteria for accepting scientifically proven facts is that the researches be free of sin, how crazy is that!  I mean, suppose the accused man is guilty. This matters how? I suppose I can’t say “Leonardo was a great Renaissance painter because he was a homosexual.” Or, “Tycho Brahe’s astronomical observations are incorrect because he had siphyllis”.  ?That isn’t even Christian doctrine, Protestant or Catholic!  I have no idea who this Lombartti, person is, but ‘so what’s your point’ is what I say..it makes no sense at all.\n\n","date":"June 15, 2013 at 1:40 pm","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","id":"comment-37107","author":"Josie L. Tyner","site":"shroudstory"},{"title":"An Antonio Lombatti Poop Dump","post":"The man is a…church historian!\n\n","date":"June 15, 2013 at 1:55 pm","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","id":"comment-37109","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Antonio Lombatti Poop Dump","post":"June 15, 2013 at 1:15 pm | #10 Reply | Quote\nYour comment is awaiting moderation.\nIn reply to my posting:\n“This is what I would call ‘a massive scientific & archaeological argument against’ the TS authenticity by an arch-sceptic church historian losing it.\nLombatti wrote: Max, this is not a key point at all of course. However, I’d like to know why his name was removed from all official and non official lists of STURP members printed on books and articles. And, above all, how many STURP members belonged these two fundamentalist sects?\nMe: Paterson Brown non è uno scienziato neanche un membro dello STURP. Cerca l’errore.\nLombatti: From his CV: “1976-78: Original concept (in 1976, with Tom Dolle) of a computerized clarification of the Shroud of Turin image, and subsequent presence during the extensive scientific testing of the Shroud, Turin, Italy, October 1978″.\nSome pics: http://www.metalog.org/files/shroud/sturp.jpg http://www.metalog.org/files/shroud/turin11a.jpg http://www.metalog.org/files/shroud/turin07.jpg\nNot only did he work along with the STURP but he was of the founders. And you’re free to believe in the Easter Bunny and in Santa Claus.\nMe: Le due fotografie NON significano molto in se. Non sono del tutto la ‘prova del fuoco’ che PB fosse un scienziato neanche meno uno dei fondatori dello STURP. Quindi le ritorno il complimento “you’re free to believe in the Easter Bunny and in Santa Claus”. Si vede che tu sei stanco. Era solo uno sostenitore dello STURP.\nMe: Se pensi che un filosofe é uno scienziato davvero ‘”(no wonder) you believe in the Easter Bunny and in Santa Claus”.\n\n","date":"June 15, 2013 at 1:55 pm","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","id":"comment-37110","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Antonio Lombatti Poop Dump","post":"The blog has been relaying Antonio Lombatti’s comments for a long time and only a handful of chummies are allowed to post comments and these are posted only if they do not clash with the anti-Catholic bias of the pastor. There is a mask there…\n\n","date":"June 15, 2013 at 3:14 pm","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","id":"comment-37113","author":"Louis","site":"shroudstory"},{"title":"An Antonio Lombatti Poop Dump","post":"Louis, 1000% agreed. \nLombatti finally wrote as a reply to my comments: “Ma chi lo dice chi è dello STURP o no, tu? È nella foto quando lo STURP è stato fondato ad Albuquerque nel 1977 ed è di nuovo con lo STURP a Torino nella Cappella della Sindone nel 1978. Lo so che per un sostenitore della Sindone come te è imbarazzante, ma la verità fotografica non mente. \nVedo che Brown aveva un cartellino di riconoscimento http://www.metalog.org/files/shroud/turin01.jpg come quello di Jackson http://www.metalog.org/files/shroud/turin09.jpg.”\nBy way of reply, I told ‘il Lombatti’  that Schwortz confirmed my view on Dan’s blog and pasted Barry’s #9 reply as additional comment. ‘Il Lombatti’ just deleted it! I told him he was a “un manipulatore senza vergogna ed un tartuffe” (“a manipulator and an abusive deceiver”). No surprise, ‘il Lombatti’ also deleted it…\n\n","date":"June 16, 2013 at 8:55 am","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","id":"comment-37148","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Antonio Lombatti Poop Dump","post":"Max, from what I heard from prominent Shroudies Lombatti is a “nice guy”, in fact he was even invited by one of them to a Shroud conference in Italy some years ago. He seems to have a good sense of humour and there seems to be no reason to blame Shroudies if they were kind to him. It is clear that Lombatti would largely be ignored if it was not for the anti-Catholic Baptist pastor relaying Lombatti’s provocations in the US. The former moderates his blog, allowing only chummies to post whatever they want because they write what he wants them to write and the latter, it seems, adopts a slightly different tact by deleting what is inconvenient to him.\n\n","date":"June 16, 2013 at 10:20 am","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","id":"comment-37151","author":"Louis","site":"shroudstory"},{"title":"An Antonio Lombatti Poop Dump","post":"The obituary and memorial accounts in Dan’s last link above to the Amherst College Magazine make for very sad reading. Here was a man at the top of the game in College, a charismatic leader, capable of writing a 10 page thesis with citations in a single evening which his confreres struggled for a week to produce. He was at the top of his class in Symbolic Logic, a particularly difficult discipline. This was not enough for him and he was captured by the Timothy O’Leary ’60s drug scene, turned to the anti-establishment hippie movement, advocated sex with young girls, and was eventually imprisoned on indecency charges. Perhaps his barely marginal involvement as a helper with STURP was prompted less by a generous volunteerism, than an unhealthy fascination with anything arcane. He would have been otherwise capable of truly great achievement. The cliche “How the mighty have fallen” is an aptly sad fit to the case. Achievement requires more than intellectual capability – a psychologically healthy outlook is essential. I recall just a few members of my ’60s classes who were destined to go much the same way.\n\n","date":"June 15, 2013 at 4:51 pm","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","id":"comment-37118","author":"daveb of wellington nz","site":"shroudstory"},{"title":"An Antonio Lombatti Poop Dump","post":"I also wrote as a comment on “il Lombatti”s purple patch of desinformation: La tua fotointerpretazione è soggetiva per non dire mentirosa, “your photo-interpretation is subjective and even a lie”. It was also deleted by the blog administrator.\n\n","date":"June 16, 2013 at 12:17 pm","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","id":"comment-37154","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Antonio Lombatti Poop Dump","post":"Typo: purple patch of venomous desinformation\n\n","date":"June 16, 2013 at 12:40 pm","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","id":"comment-37155","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Antonio Lombatti Poop Dump","post":"You see, Max, barricades have been at both ends in this two-man show, one uses moderation to allow only what is suitable to his biases and provocations, which even blogmaster Dan detected easily, the other deletes what is not convenient to him. My guess is that this will go on and on.\n\n","date":"June 16, 2013 at 1:13 pm","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","id":"comment-37156","author":"Louis","site":"shroudstory"}]
