[{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"1. Question: How many Objects were claimed  to be the Shroud of Jesus in the Middle Ages?\n    Answer: 40\n2. Question: How many have survived to modern times?\n    Answer: At least one\n3. Question: How many have been subjkect to more than a quarter million hours of modern scientific examination?\n    Answer: One\n4. Question: How many have never been subject to modern scientific examination:?\n    Answer : 39\n5. Question: How many fake Shrouds of Jesus were there in the Middle Ages?\n     Answer: 39\n\n","date":"June 12, 2012 at 5:36 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12243","author":"John Klotz","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"John, at least in Spain right now you have 2 or 3 surviving copies. One of them is kept in the Monastery of Silos, which by the way is one of the few in the world where Gregorian chant is still used in everyday celebrations.\nIn Silos and surrounding villages until 150 years ago, the most important celebrations for local people were in May because it was widely believed that their copy was the true original. These celebrations  stopped one century ago more or less when it became clear that it was a copy and not the original. However, in recent years again these celebrations are becoming more and more popular although everybody knows that it is a copy.\n\n","date":"June 12, 2012 at 6:45 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12255","author":"Gabriel","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Dan, can you name a historical article on the Turin Shroud published in the last 10 years on a peer-reviewed journal? (apart from Andrea Nicolotti’s paper on Barbara Frale’s conjectures). As for Ivory Towers, I’m happy to have joined you and other Christians who believe in people rising from the dead, men parting seas, gods fighting sea monsters, and fairy tales like those.\n\n","date":"June 12, 2012 at 6:04 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12247","author":"Antonio Lombatti","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"¡La desinformación de que hacen gala los escépticos es patética!\n¿De dónde salen los 40 ” burial cloths of Jesus”?\nEl escéptico italiano Antonio Lombatti se refiere al canónigo Ulysse Chevalier, historiador de la Iglesia más conocido por el hallazgo del “Memorandum DÁrcis” (documento no firmado, no sellado y no fechado atribuido al obispo Pierre DÁrcis, y que Chevalier dató en 1389 porque así le convenía).\nUlysse Chevalier escribía en su obra “Le st. suaire de Lirey-Chambéry-Turin et les défenseurs de son authenticité”, p.10. A.Picard et fils, 1902: \n“Le nombre des suaires connus atteint la quarantaine: je laisse a M. de Mély le soin de donner une description de chacun d´eux et d´indiquer les autorités qui attestent son existence.”\nNo eran pues 40, sino 38 los sudarios… como aclara el escéptico Maurice Vernes en la famosa “Controversia de París de 1902”,  Revue scientifique, n° 20 du 17 mai 1902, pp. 613-623: \n“L’abbé Ulysse Chevalier, fort compétent en la matière, a énuméré dix-neuf localités où étaient conservés, soit le linceul du Christ en son entier, soit de très notables portions du drap funéraire. Un archéologue de valeur, M. F. de Mély, est en mesure, pour sa part, d’en citer dix-neuf autres ; un petit nombre sont porteurs d’effigies ou empreintes, notamment celui qu’on exhibait jadis à Besançon et qui a disparu lors de la Révolution.”\n[ La “Controversia de Parí de1902” entre Maurice Vernes y Paul Vignon, con una carta al director de Ives Delage ha sido editada por Dominique Autié (q.p.d), es muy interesante pues se plantea la que será a partir de entonces la postura ESCÉPTICA respecto a la Sábana de Turín\nhttp://blog-dominique.autie.intexte.net/blogs/index.php/2006/04/16/title_9\nDe los 19 “sudarios” que estudió Chevalier solo merecieron su atención 2:\n– la Sábana de Cadouin ( que no tenía ninguna IMAGEN).  \n– la Sábana de Besançon que está documentada desde 1523 (copiada probablemente de la de Lirey y que mostraba sólo la imagen frontal).\nDe los 19 “sudarios” que citó el arqueólogo M. de Mély,  Ulysse Chevalier no valoró ninguno .\nEscribía el escéptico Maurice Vernes en 1902:\n“Parmi les nombreux linceuls du Christ qui ont été vénérés en Europe, celui de Turin, en raison des empreintes qu’il porte, a donné lieu à un rapprochement avec une pièce d’étoffe également désignée à l’attention par la présence d’une effigie, le suaire jadis conservé à Constantinople.”\nEs justamente y precisamente la excepcionalidad de la presencia de la IMAGEN CORPORAL en una pretendida mortaja de Jesús lo que distingue a la Sábana de Turín, al igual que siglo y medio antes había sucedido con la Sábana de Constantinopla, y justa y precisamente esa excepcionalidad la que apunta a su misma identidad. La que hoy conocemos como Sábana Santa.\nLos escépticos MODERNOS han distorsionado lo escrito por Ulysse Chevalier.\nSi el señor Chevalier, Mély o quien fuera hubieran propuesto en 1902 la existencia conocida de cuarenta sudarios, enteros o fragmentarios, no pueden estar fuera del listado de los conocidos en el año 2012 , y NO es conocida la existencia en la Edad Media de sudarios que pretendieran ser la mortaja de Jesús y tuvieran la imagen corporal de Jesús, a excepción de los apuntados, Constantinopla y Turín.\n\n","date":"June 12, 2012 at 6:26 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12249","author":"corneliotel","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Last but not least: where did you get this quotation? You should have said that I was replying to a journalist who couldn’t see the proof of my theory. Therefore, I suggested her to read my article.\n\n","date":"June 12, 2012 at 6:28 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12250","author":"Antonio Lombatti","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"ANTONIO LOMBATTI:”The proof is in my peer-reviewed paper, if you can read Italian or medieval Latin manuscripts. Lots of claims have been around lately on the Turin Shroud and none of them underwent the evalution (sic) of scholars in a journal.”\nThe journal he mentions is Studi Medievali which is a journal that due to its very low credibility and impact factor is not even included in the standard and widely acepted JCR ranking system. Therefore, publishing in this journal means exactly nothing for the academia and advance of science.\nIf we have a look at his own website http://www.antoniolombatti.it/B/Home.html all his publications in his career have been in this kind of journals.\nWe have seen this in the Shroud before : someone whose poor work has been rejected in truly scientific journals moves to the media and taking advantage of the attraction that the Shroud generates by itself, gets the attention from the public that the scientific community will never give him. In other words, becomes a new Shroud star. We will see this guy in a lot of interviews, talk shows on TV etc in the next months…..\nI am afraid we have seen this movie before…..\n\n","date":"June 12, 2012 at 6:33 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12251","author":"Gabriel","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"I agree Gabriel.  The profusion or proliferation of so many copies would rather substantiate the existence of a singular precursive model, which started the replication process.  And a way to identify that model is to see which one has consistently surfaced in history with much flair and fanfare.\n\n","date":"June 12, 2012 at 10:30 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12289","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Gabriel, please be so kind to tell us know your name, surname and teaching credentials. We aren’t downloading software illegally here, so you mustn’t be afraid of telling us who you are. \nNow, can you tell me where Shroud historians have published their articles? As for Studi Medievali, there’s no need to defend all the university professors who are in the editorial board or the peer-reviewers. But, in order to make you happier, I’d like to let you know that the same version of my paper has been accepted in the Journal of Biblical Literature.\n\n","date":"June 12, 2012 at 6:45 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12256","author":"Antonio Lombatti","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Antonio, I am just a plain man who can think by himself and is fully aware of his limitations as a scientist. It is you who claim that your work is peer-reviewed and high quality. Despite my limitations, I can use the internet and its resources and sorry to tell you, Antonio, your works have never been published in JCR journals which is the common standard for the advance of science. BY the way, the Journal of Biblical Literature is not in the JCR list either.\nI will tell you, that despite my difficulties with some of their results, in the last 10 years you will find the works by Marion, Fanti and Di Lazzaro, published in JCR journals.\n\n","date":"June 12, 2012 at 8:00 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12260","author":"Gabriel","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"There is one thing I would appreciate.\n If, as Lombatti claims, ”the shroud was most likely given to French knight Geoffroy de Charny as a memento from a crusade to Smyrna” and if the Shroud “appears to have originated in Turkey” this means that the D’Arcis memorandum (where the Shroud is said made in France by an artist who lived there and procured by the Dean of the Lirey Collegiate for gain) loses any historical value.\nSo, Mr. Lombatti with his peer-review article completely dismisses the D\\’arcis memorandum and backs the Shroud in the East.\nThe question is: what Geoffroy de Charny received ? something done then or something that was over there long time?\n\n","date":"June 12, 2012 at 8:16 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12261","author":"domenico","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Domenico, I have written that the relic was gained by Geoffrey for taking part to that crusade. It was given to him in France by those who organized the mission to Smyrna-Holy Sepulchre. I don’t think, therefore, that the Memorandum loses value: it’s one the few surviving documents of the period. But there’s also Marguerite who wrote that the relic was conquered by his grandfather.\n\n","date":"June 12, 2012 at 8:58 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12266","author":"Antonio Lombatti","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"let’s remind to Mr. Lombatti Emmanuel Poulle’s articles:\nhttp://cat.inist.fr/?aModele=afficheN&cpsidt=18512573\nhttp://www.rhe.eu.com/pages/rhe195.asp\n\n","date":"June 12, 2012 at 9:11 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12268","author":"domenico","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"The Lirey Pilgrim’s badge, commissioned by Geoffrey de Charny, showing both his and his wife’s coat of arms, has a remarkable feature that needs explaining if de Charny did acquire the Shroud in the East. I refer to the chain, best seen on the dorsal side, that is not just across the waist, but extends left and right, as if showing a chain-shackled figure. Now I know that he or his artist is said to have misinterpreted a catenated blood stain as a chain. But why show it extending beyond the body outline, and looking for all the world like a chain with regularly-spaced links, given there is no evidence of a chain figuring in the Biblical account of the last hours of Christ, nor, as far as I am aware, of a chain figuring as a symbol of the Passion elsewhere in Western art (or Eastern for that matter).\nI have my own theory re the chain, one that although somewhat iconoclastic is not entirely original, which I have quietly published elsewhere, attracting little interest or attention.  But I’d be interested to hear Antonio’s opinion re that chain – and why a souvenir-maker should have attached so much significance to it.\n\n","date":"June 12, 2012 at 9:19 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12269","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Colin, you should read the Book of Revelation, you’dread about a chain….\n\n","date":"June 12, 2012 at 9:37 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12273","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"actually the semblance/vision of it.\n\n","date":"June 12, 2012 at 9:39 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12275","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"To Antonio: If now your “breaking news” is that the Lirey Shoud was not painted or copied in France as reported by the D’Arcis memorandum, could you tell us then, by whom was “the fake shroud” copied or painted and when?\n\n","date":"June 12, 2012 at 9:26 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12270","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"…and where (as I suppose you must also know how it made)?\n\n","date":"June 12, 2012 at 9:28 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12271","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"typo error: “know how it was made)?”\n\n","date":"June 12, 2012 at 9:29 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12272","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Sorry, Max, I have no answers to your questions. My study focuses on the 1345-1346 crusade and how Geoffrey got involved in it, since it wasn’t clear if he took part or not to it. I don’t know who made the Shroud and where.\n\n","date":"June 12, 2012 at 9:39 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12274","author":"Antonio Lombatti","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"So, in the light of your theory, how could you then account for G. de Charny conquering a French-made fake Shroud in Smyrna? How did he get there?\n\n","date":"June 12, 2012 at 9:45 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12276","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Typo erro: “How did IT get there?”\n\n","date":"June 12, 2012 at 9:51 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12279","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"\nAntonio Lombatti :\nAs for Ivory Towers, I’m happy to have joined you and other Christians who believe in people rising from the dead, men parting seas, gods fighting sea monsters, and fairy tales like those.\n\nAmen.\n\n","date":"June 12, 2012 at 9:47 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12277","author":"anoxie","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"As I have written above, I believe the relic was given to him for taking part to the crusade by the French organizers of the expedition. I have found some documents that confirm that GdC was given landed estates and other properties by Humbert de Viennois.\n\n","date":"June 12, 2012 at 9:49 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12278","author":"Antonio Lombatti","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Oh I see you just BELIEVE… You mean you have no really solid ground to build up any theory of a FAKED Shroud given to G. de Charny by one of the crusade organizers whether in Smyrna or in France…\n\n","date":"June 12, 2012 at 9:59 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12280","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"It must be archsceptical belief then….\n\n","date":"June 12, 2012 at 10:00 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12281","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"All historians have theories. Don’t trust those who tell you “it went like this”. My hypothesis is supported by sources and a careful reconstruction of the events; it has been evaluated by other scholars for over a year. In case you were wondering, I didn’t find the written confession of the forger. But who knows, maybe next time I go to the Paris National Archives…\n\n","date":"June 12, 2012 at 10:08 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12282","author":"Antonio Lombatti","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"To Antonio:  Actually, there is a world of a difference between “conqueing a faked shroud” and ‘being given one” don’t you think? Don’t you think you are “a little bit” distorting  the testimony you rely on?\n\n","date":"June 12, 2012 at 10:12 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12283","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Marguerite is not a direct source, her words were reported. Moreover, I don’t think there is a contradiction with being given a relic for having participated to a crusade and a niece (probably) saying “my grandfather conquered it”.\n\n","date":"June 12, 2012 at 10:15 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12284","author":"Antonio Lombatti","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Antonio, have you any other example of a medieval knight being given a faked relic for an outstanding feast at war?\n\n","date":"June 12, 2012 at 10:23 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12287","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"The only example I may think of if Othon de la Roche receiving the alleged Christ Shroud in Constantinople.\n\n","date":"June 12, 2012 at 10:25 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12288","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Actually, in old French the verb “conquerre” means ‘to greed for”, “to win”. So G. de Charny would have won it on what specific occasion? Don’t you forget he rendered services as “agent du secret” (secret agent) for the Franch crown….\n\n","date":"June 12, 2012 at 10:19 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12285","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"typo error: “French Crown”.\n\n","date":"June 12, 2012 at 10:20 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12286","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Can a Christian knight greed for a faked relic unless he thinks it is authentic? Can G; de Charny have been deceited for “service rendu” to the Franch Crown by one of the crusad organizers? Very unlikely…\n\n","date":"June 12, 2012 at 10:33 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12290","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"typo error: “French Crown “, “crusade organizers”\n\n","date":"June 12, 2012 at 10:35 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12291","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Conclusion: YAntonio, your theory is MOST UNLIKELY if the shroud is a fake…\n\n","date":"June 12, 2012 at 10:39 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12292","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"If I had forty fake $100 bills and one truly genuine $50 bill, it would only be a matter of time, through the testing fires of transactional exchanges made in commerce, when the forty fakes dissapear and the authentic one wins out.\n\n","date":"June 12, 2012 at 10:42 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12293","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"I thought anti-shroud archsceptics had more…common sense.\n\n","date":"June 12, 2012 at 10:49 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12294","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Ironclad if you think you can deceive a Medieval Christian knight and give him a faked Christ shroud for the authentic one to pay him for “serviece rendu”, I woul think it twice befor edoing so if I were you…\n\n","date":"June 12, 2012 at 10:55 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12295","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Yes you’d better “ironclad” you….just in case.\n\n","date":"June 12, 2012 at 11:06 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12298","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Max, this is precisely the message I intended with my analogy.  The same thing could be said with another topic engrossed with similar themes, i.e., the Book of Daniel.  Many skeptics not wanting to deal with the supernatural implications the book brought upon the table decided to devise the theory that a forger disguised himself as a prophet and pushed the book as if authentic.  A highly unlikely scenario given the kind of feverish conservatism of the Jewish polity and its leaders.\n\n","date":"June 12, 2012 at 11:08 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12299","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Apologies Ironclad (I have misundertood you.. I am reading and writing in haste while working).\n\n","date":"June 12, 2012 at 11:23 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12303","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"If it is easy to demonstrate the 40 Christ shroud copies are copies, it is another story to prove the turin Shroud is not authentic.\n\n","date":"June 12, 2012 at 10:59 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12296","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"BTW 98% of the Christ shroud copies are post-14th century CE.\n\n","date":"June 12, 2012 at 11:02 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12297","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Ultimate conlusion: Antonion Lombatti’s theory  is likely to have some value IFand ONLY IF the Shroud was authentic.\n\n","date":"June 12, 2012 at 11:19 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12300","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Thank you Antonio.\n\n","date":"June 12, 2012 at 11:20 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12301","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Grazie mille!\n\n","date":"June 12, 2012 at 11:20 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12302","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Canon Chevalier doesn’t say having studied more than fourteen shrouds. He claims to have studied more than fourteen documents spooking of shrouds. They are very different things. (Le Saint Suarie de Turin. Histoire d’une rélique, Paris, 1902, p. 9-10). “Du dernier tiers du septième siècle à l’anée 1351, j’ai retrouvé au plus quatorze textes, qui concernent les uns au suaire de la tête, les autres le linceul ou les linges. La poursuite de ces reliques dans leurs péregrinations et leur identification actuelle ne sont point chose aisée. (…)Le nombre des suaires connus atteint la quarantaine: je laisse â M. de Mély le soin de donner une description de Chacón d’eux et indiquer les autorités qui attestent son existence”. \nFrom these words of M. Chevalier is not deductible or the amount of shrouds that had an image or the quality or type of them. M. Chevalier says it is difficult to identify them. For these words we do not know if M. de Mély made the description that Chevalier is speaking about. Therefore, we do not know if it was someone similar to the Shroud of Turin in the quarantine of linen shrouds that M. Chevalier mentions.\nIf anyone knows the M. de Mély’s work it would be very helpful for us. If you do not have that data we are speculating in vacuum.\n\n","date":"June 12, 2012 at 11:43 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12304","author":"David Mo","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Ulysse Chevalier proved INTELLECTUALLY VERY DISHONEST (actually a real crook) in his stubbornness to maintain the first version of the bull of January 1390, while he had it followed by the text of the June bull the same year, which contradicted it, ending up as a file of incoherence which should have disqualified him definitively.  Actually U. Chevalier sinned by deliberate omission (see  Pr. E. Poulle’s article entitled “Le LInceul de Turin victime d’Ulysse Chevalier”, in Revue d’histoire de l’Eglise de France”, t. 92 2006, pp. 344-358 + “Examination of the file published by Ulysse Chevalier”, RILT n° 29).\n“The conclusion of the study of Emmanuel Poulle, is that in 1390, Clement VII took by no means the responsability of the assertions hurled without proof by Pierre d’Arcis, to say the shroud, then kept at Lirey, was false, a painting/copy made by an individual who had been identified and who had recognised his work; correspondingly, moreover, by the constant attitude of the Church in relics, the Pope contented by asking to proceed to ostensions with a little caution, reminding that the worship does not address the relic as such but the fact that it represents, and  he did not hesitate to encourage the believes (the “L” file) to continue to honour the shroud of Christ.” Anri-Shroud’s INTELLECTUAL DISHONESTY… again…\n\n","date":"June 12, 2012 at 1:07 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12311","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"To Read seperately: “Another proof of Anti-Shroudists INTELLECTUAL DISHONESTY…again.”\n\n","date":"June 12, 2012 at 1:11 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12312","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"No wonder you are heavily relying on Ulysse Chevalier (an intellectual crook ) to make your point!\n\n","date":"June 12, 2012 at 1:49 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12319","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"This comment is addressed to David Mo.\n\n","date":"June 12, 2012 at 1:50 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12320","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Max, entre 1205 y 1308 el ducado de Atenas (tras el saqueo de Constantinopla por los cruzados) fue gobernado por la familia La Roche:\nOtón de la Roche (1205-1225)\nGuido I de la Roche (1225-1263)\nJuan I de la Roche (1263-1280)\nGuillermo I de la Roche (1280-1287)\nGuido II de la Roche (1287-1308)\n\n","date":"June 12, 2012 at 11:44 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12305","author":"corneliotel","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Corneliotel: Muchas gracias. No tenia de memoria los nombres de todos los ducados de Atenas con las correspondientes fechas.\n\n","date":"June 12, 2012 at 12:43 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12309","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"\ncorneliotel :\nEs justamente y precisamente la excepcionalidad de la presencia de la IMAGEN CORPORAL en una pretendida mortaja de Jesús lo que distingue a la Sábana de Turín, al igual que siglo y medio antes había sucedido con la Sábana de Constantinopla, y justa y precisamente esa excepcionalidad la que apunta a su misma identidad. La que hoy conocemos como Sábana Santa.\n\nFor proving an image is copied from another is necessary:\n1. Comparing the two images (better) or a precise description of one of them (worse).\n2. Having some kind of document to relate them. An unbroken chain guaranteed.\nThe relationship between the relic Robert de Clari speaks about (Constantinople, 1204) and the Shroud of Turin (Lirey 1354c.) does not meet either condition. The silence about them points in the opposite direction to the identity.\nIt is illusory to affirm the identity of both pieces.\nRobert de Clari text: \n.. .where was kept the sydoine [sic] in which Our Lord had been wrapped, which stood up straight every Friday so that the features of Our Lord could be plainly seen there. And no one, either Greek or French, ever knew what became of this sydoine after the city was taken.\n( Joe Nickell, Inquest of the Shroud of Turin, p. 54)\n\n","date":"June 12, 2012 at 12:39 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12307","author":"David Mo","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"I won’t enter this discussion because I don’t know the new documents, and I think that now is better to wait in silence. But there is an important thing, that Gabriel wrote here and made me feel flabbergasted.\n“Studi medievali” is one of the most important academic reviews in the world dealing with medieval history. It is known by all medievalists. It was established since 1904, and still has in its directive committee among the most important scholars. The Italian school of medieval history is among those with the most ancient tradition and value in the world.\nThe “JCR ranking system” mentioned by Gabriel doesn’t have any importance in the field of the historical studies, especially for the publications not made in English language. Therefore, to make a classification of reviews according to that method, means having no idea what is the historical research. And the same can be said about the “Journal of Biblical Literature”. If “Studi medievali” has a “very low credibility”, I can say that “Nature” is a parish magazine.  Please, let us avoid foolishnesses.\n\n","date":"June 12, 2012 at 12:40 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12308","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Andrea, in the JCR you have 43 journals specifically devoted to History. Sorry to say once again but Studi medievali is not one of them. A comparison with Nature can only be made out of ignorance\n\n","date":"June 12, 2012 at 1:15 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12313","author":"Gabriel","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Gabriel, 43 journals of history are nothing. What is inside JCR is not important for me, and for the scholars of our field. So I am not sorry at all. You are not obliged to know the medieval history or the importance of our reviews, but please, if you do not know, do not judge.\n\n","date":"June 12, 2012 at 1:22 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12314","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Andrea, please note that it is Antonio who from the beguining has tried to bypass discussion on the grounds of his merits regarding peer reviewing and journal system only. What I have written in my previous comments holds true 100% ……..but perhaps I am driving the discussion to a place the readers of this blog and Dan are not interested at all….\n\n","date":"June 12, 2012 at 1:46 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12318","author":"Gabriel","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Sorry to persist with my line of enquiry, but Antonio has so far failed to respond to my point re the Lirey badge while claiming that Geoffrey de Charny imported the Shroud from Turkey. If De Charny thought he was importing an image of the crucified Christ laid out on a burial shroud (correctly shown on the badge with a herringbone weave) then would he not have taken pains to ensure that his “tourist souvenir” was unambiguous in what it represented, leaving nothing to doubt, certainly not creating new puzzles in the superstitious medieval mind…\n I repeat:  why should de Charny have commissioned a pilgrim’s badge  aka the Lirey Medallion, one that shows a mysterious chain on the dorsal side (possibly one too on the frontal side too that looks as if it may have been subsequently gouged away)?  Why would he or his artist have interpreted any markings on the Shroud as a chain, and moreover a chain that is being used to shackle, i.e. to constrain an individual, preventing escape? Crucifixion by nailing is sufficient surely to constrain and prevent escape…\nThere are other points one could make about the somewhat bizarre Lirey badge – e.g. that the figure depicted does not look at all Christ-like, certainly not like the one on the Shroud – one that is supposed to have served as the basis for latter-day representations of Christ with long hair, beard, and with a resigned pose, that of someone who had anticipated what was in store etc. The figure shown on the Lirey badge looks anything but resigned to his fate.\n\n","date":"June 12, 2012 at 1:33 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12315","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"\nMax Patrick Hamon :\nUlysse Chevalier proved INTELLECTUALLY VERY DISHONEST (actually a real crook) in his stubbornness to maintain the first version of the bull of January 1390…\n\nM. Poulle says M. Chevalier was not honest. Attacking the honesty of a dead person that can not defend itself reveals very little honesty. However, we must believe it, because M. Poulle is an honest man.\nM. Poulle is an honest man, but his rabid attack against M. Chevalier ignores two facts clamorous. First, although the final text of the bulls omitted the sentence “painted image” and similes still maintained it was a “figure or representation” and “to avoid any fraud” demanded that it be said out loud when exhibited. And it banned paraphernalia that usually accompanied the exhibition of relics accepted. Secondly, M. Poulle is an honest man, but he forget that the investigation ordered by the bishop of Liege in 1449 confirmed the existence of this bull and ruled that the relic was not genuine.\nSo we will conclude that M. Poulle is an honest man… with unfortunate omissions.\n\n","date":"June 12, 2012 at 1:37 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12316","author":"David Mo","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"You’d BETTER READ E. Poulle research papers before passing comments…\n\n","date":"June 12, 2012 at 1:55 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12322","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"\nMax Patrick Hamon :\nTo Read seperately: “Another proof of Anti-Shroudists INTELLECTUAL DISHONESTY…again.”\n\nHonesty is a moral category. Never accuse someone of dishonesty because he disagrees with your ideas.\nPlease avoid heat up the debate with immoderate accusations. This forum has a tradition of fair play that we should keep together.\n\n","date":"June 12, 2012 at 1:44 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12317","author":"David Mo","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Intellectual dishonesty is no fairplay… Are you kidding?\n\n","date":"June 12, 2012 at 1:52 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12321","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Correction: “Intellectual dishonesty is fairplay… are you kidding?”\n\n","date":"June 12, 2012 at 2:03 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12324","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"To David Mo:  On the Hungarian Pray Ms miniature you’re not just disagreeing with me: you are in denial of spy details. If you cannot discriminate between intellectual dishonesty and simple intellectuel disagreement then you have a problem!\n\n","date":"June 12, 2012 at 6:03 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12331","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"To David Mo: Can you please answer the following questions:\n1/do you really believe all “the signs” on the sacorphagus lid are just random decorative elements and show me any similar decorative element in Medieval Empty Tomb scene iconograpgy? \n2/ can you explain to me your conception of “spy detail” in terms of iconology applied to the comparative study of the Hungarian Pray Ms miniature third panel upper and lower registers in the light of the Turin Shroud? What should they be to be valid?\nWaiting for your answers. Thank you.\n\n","date":"June 12, 2012 at 6:22 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12332","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Gabriel,\nI am not so interested on peer reviews and classifications among journals: it is a mostly American illusive mania (and we saw, with mr. Kouznetsov, how is unreliable) that, on humanistic field, generates only bad scholarship and detrimental competitions. But I could not omit to say how was wrong your statement about the value of “Studi medievali”, one of the most renowed reviews about medieval history on the world . Obviously, the validity of any article has to be judged reading it; I cannot understand why here so many people is speaking about what is not yet published.\n\n","date":"June 12, 2012 at 2:02 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12323","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"I think M. Lombatti and all the other skeptics here should read my recent open letter about the evidence of the bloodstains. He can find it here : https://shroudofturin.wordpress.com/2012/04/21/please-dont-forget-the-evidence-of-the-bloodstains/\nMaybe the reading of this letter could be an eye-opener for them ? Probably not but I think they should read it nevertheless…\n\n","date":"June 12, 2012 at 2:03 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12325","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Yannick: It’s funny because I think bloodstains are a major proof of the non authenticity of the Shroud of Turin.\n\n","date":"June 13, 2012 at 9:13 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12378","author":"David Mo","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Hello David,\nI’m curious about that observation.  So do you believe the bloodstains were placed after the formation of the image or before it?\n\n","date":"June 13, 2012 at 10:26 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12391","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"to  all the art historians has any picture ever been made before photography that  was done in a  wholly negatve mode. if not what does that signify?\n\n","date":"June 12, 2012 at 10:47 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12337","author":"paul","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Paul, it may seem strange, counter-intuitive even, but any quick sketch that one does with a soft pencil or charcoal is likely to resemble a photographic negative more so than a positive. You have only to compare a charcoal drawing done by a pro with one done by an amateur. The pro will make the nose very light, because being prominent it reflects a lot of light, whereas the amateur makes it dark – simply because it’s prominent – without a thought to its light-reflecting properties.  In short, it’s only good professional art that resembles a photographic positive. We amateurs content ourselves with near-negatives. However, the effect of converting any ‘pseudo-negative’ to a photographic light-dark reversed positive can be startling (as Secondo Pia discovered in 1898).\nHere’s a link to a post I did a few weeks ago starting with a  quick B/W sketch of a man’s face with charcoal. When it was B/W inverted (pseudo-negative to positive) then the end result had a luminous ghostly quality, and even responded magnificently to a little 3D enhancement. That’s due to harsh features being made light, while conversely white space becomes promoted to shadow-like soft greys. It looks like magic, or at any rate a conjuring trick, but is really just physics.\nSo the point I am making is that while there may be much speculation as to how the pseudo-negative Shroud image came into being (and much misreporting of its stunning transformation by light/dark reversal)  there is really nothing strange or unusual about amazing pseudo-negative to-positive transformation as such, even if Pia was the first to discover the effect.  Ask someone to do a quick sketch, then reverse the image as I have done and you’ll see what I mean…\n\n","date":"June 13, 2012 at 1:35 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12338","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"\nMax Patrick Hamon :\nTo David Mo: Can you please answer the following questions:\n[Etc., etc.]\n\nMy opinion on these points is clearly expressed in the two posts on the Pray codex. I do not understand why you insist on it.\nAlso, I hate to argue with someone who seeks to mix disagreements with moral disqualifications. It is unpleasant and useless. The game is over.\n\n","date":"June 13, 2012 at 2:05 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12339","author":"David Mo","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Good day to you David. Have you thought of challenging Max to show a single instance in Western art of a length of fabric being shown stiff as a board, miraculously propped up at an angle  and able to support a discarded cloth (that you or I would interpret as the real Shroud)? The nearest equivalent I can think of in art generally is a flying carpet, as used for transporting Sultans across the desert. We have Max and others to thank for spotting the Western counterpart – the magic shroud attempting lift-off! (Like in lift off a lid?).\nPerhaps Max could explain how his “Shroud” became so rigid. Maybe someone overdid the starch in the Ray Rogers/Pliny pretreatment?\n\n","date":"June 13, 2012 at 2:24 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12341","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Once again (If you take your glasses and have a minimum of iconological vista), you’ll see a wrinkle line and rumples amid the square-topped stepped pattern weave pattern in connection with the angel’s left foot resting on the SHROUD COVERED SARCOHAGUS LID. The latter, according to medieval standard can be see EITHER raised up OR just displaced. I hope you also know about artistic licence, you IGNORANT FOOLS.\n\n","date":"June 13, 2012 at 4:20 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12344","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Please, dont you confuse the shroud wrinle line and rumples with the rolled up napkin… If you can.\n\n","date":"June 13, 2012 at 4:25 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12345","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Max Patrick Hamon,\nFounder and Director,  Office for Studies and Reseach in applied Cryptology (applied to Late Antique and Medieval Archaeology, Thesaurology, Criminology and Psychophysiological Therapy)\n\n","date":"June 13, 2012 at 4:38 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12347","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"To Davod Mo The Eel number1 (even before Colin Berry):  Just archsceptic eels around here. Quite muddy waters (better to hide themselves I guess). The y just hate clear waters.\n\n","date":"June 13, 2012 at 4:11 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12343","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Correction: “(better to hide themselves away and thrive)”\n\n","date":"June 13, 2012 at 4:58 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12350","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"\nAndrea Nicolotti :\nGabriel,\nI am not so interested on peer reviews and classifications among journals: it is a mostly American illusive mania\n\nI don’t agree with you, Andrea. It is not a “mania”. It is a religion. The Peer Review Religion says all is in a peer review  paper is Truth. Holly Truth. And as all religion, the contrary evidence does not exist. Kouznetsov affair does not exist. Or it is a diabolical invention or it is irrelevant for the dogma.\n\n","date":"June 13, 2012 at 2:18 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12340","author":"David Mo","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"David Mo, why don’t you just ask yourself what is irrelevant to your own intellectual dogma and answer the  question for a change?\n\n","date":"June 13, 2012 at 4:06 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12342","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"“The Peer Review Religion says all is in a peer review paper is Truth.”\nThere’s a catch 22 with that statement when applied to other philosophical ventures, as for example in the area of biological origins, when we see a vast network of Darwinists who use the process, or at least the conceptual trappings of the phrase, as a barrier to entry of novel ideas or theories that may upend the Main Theory.\n\n","date":"June 13, 2012 at 10:43 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12393","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"“I cannot understand why here so many people is speaking about what is not yet published”…\ngood question Mr Nicolotti.\nBut where or by whom the journalist of the Daily Mail has taken this story?\n\n","date":"June 13, 2012 at 4:30 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12346","author":"domenico","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"“But I could not omit to say how was wrong your statement about the value of “Studi medievali”, one of the most renowed reviews about medieval history on the world .”\nI agree of course; but I have to disagree with Mr Lombatti’s claim that “lots of claims have been around lately on the Turin Shroud and none of them underwent the evalution of scholars in a journal”.\nSupposing that Mr Lombatti was talking about the historical field and not the scientific field he can not dismiss  Emmaunell Poulle’s article “Les sources de l’histoire du linceul de Turin. Revue critique” published in the peer reviewed ‘Revue d’Histoire Ecclésiastique’.\n\n","date":"June 13, 2012 at 4:40 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12348","author":"domenico","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"\nMax Patrick Hamon :\nOnce again (If you take your glasses and have a minimum of iconological vista), you’ll see a wrinkle line and rumples amid the square-topped stepped pattern weave pattern in connection with the angel’s left foot resting on the SHROUD COVERED SARCOHAGUS LID. The latter, according to medieval standard can be see EITHER raised up OR just displaced. I hope you also know about artistic licence, you IGNORANT FOOLS.\n\nWhat an amazing fit your Shroud has with the sarcophagus lid – neither a millimetre too big, nor a mm too small, perfectly fitting all 4 edges. And that’s one amazing face cloth (what I call THE Shroud) left on the lid with its bespoke table-top cover – one that could cover several faces by the looks of it.\nMax – stop digging this hole for yourself. At this rate you will soon end up with a view of the Sydney Opera House (one you will no doubt re-interpret as a Turner seascape).\n\n","date":"June 13, 2012 at 4:44 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12349","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"More muddy blabla by a square/rectangular minded scientific eel….\n\n","date":"June 13, 2012 at 5:03 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12351","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"To CB: YYou onlu demonstrate one thing for sure: you’re defintely ignorant of medieval standard /artistic licence in Medieval Art. As Stephen Jones would put it, there are many archsceptic empty vessels making noise on Dan’s blog.\n\n","date":"June 13, 2012 at 5:08 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12352","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"BTW, on the Lirey Pilgrim’s Badge, the same Colin Berry CAN SEE Jaques de MOLAY. This is a very good one!\n\n","date":"June 13, 2012 at 5:15 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12353","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"To Colin Berry: CANNOT YOU REALLY SEE the rectangular Turin shroud JUST ABOVE/as if topping the sarcophagus in the Lirey Pilgrim bage?\n\n","date":"June 13, 2012 at 5:23 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12354","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"This is to be related to “the floating shroud legend”. Ever heard of?\n\n","date":"June 13, 2012 at 5:31 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12356","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"In French Medieval literature, see e.g. Perlevaus or the High Book of the Grail.\n\n","date":"June 13, 2012 at 5:35 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12357","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"The floating shroud theme also appear in Byzantine literature. Check by yourself!\n\n","date":"June 13, 2012 at 5:40 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12358","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Actually, the flying carpet theme might well be derived from the Byzantine floating shroud legend. In “The Thousand and One Nights”, Christ shroud is referred to as “the Security Towel” (= Palladium).\n\n","date":"June 13, 2012 at 5:51 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12359","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"That is to be identied with “The Holy Face of The Holy Mandylion”. This “Security Towel” was  the palladium of the city of Edessa.\n\n","date":"June 13, 2012 at 5:54 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12360","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Colin Berry, David Mo and LyFe you really need more than an eye-opener to see!\n\n","date":"June 13, 2012 at 5:25 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12355","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Actually, this is not so much the Pray Ms Shroud (lying flat on the sarcopphagus lid) that is rigid as much as Colin Berry et al that ARE antishroud psychorigids.\n\n","date":"June 13, 2012 at 7:06 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12361","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Correction (sorry): “THAN” (instead of “as much as”)\n\n","date":"June 13, 2012 at 7:08 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12362","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"You and some others here need to take a look at a quickie I have just posted on my Shroud B site  – the one I reserve for the wrangles, as distinct from genuine worthwhile scientific debate.\n Your confusion between patterned sarcophagus lid and Shroud, and between Shroud and face-cloth, is dealt a mighty blow there methinks. Seek, and ye shall find (the unvarnished truth).\nThose two red wavy lines could indeed represent blood, as some have suggested, but they delineate the end of the SHROUD, which is way, way bigger than a face cloth, needless to say. The small black crosses are used to delineate Shroud from patterned tomb lid. The trailing end of the Shroud is shown thrown into folds, ending in that blood-stained wavy end.\n\n","date":"June 13, 2012 at 7:26 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12365","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"YOU REALLY SHOULD BUY ICONOLOGICAL GLASSES!\n\n","date":"June 13, 2012 at 8:08 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12370","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"I do think the greatest irony for an eel is to be psychorigid ;-)\n\n","date":"June 13, 2012 at 7:18 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12364","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"\nMax Patrick Hamon :\nThat is to be identied with “The Holy Face of The Holy Mandylion”. This “Security Towel” was  the palladium of the city of Edessa.\n\nyes\n \n \nhttp://translate.google.ru/translate?sl=ru&tl=en&js=n&prev=_t&hl=ru&ie=UTF-8&layout=2&eotf=1&u=http%3A%2F%2Fmagazines.russ.ru%2Fcontinent%2F2003%2F118%2Fsoi17-pr.html\n\n","date":"June 13, 2012 at 7:51 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12366","author":"Tornike Chiboshvili","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"link kharacho Tornike. Spasiva.\n\n","date":"June 13, 2012 at 9:37 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12383","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"I think they are clearly separated – you can see the gap on the tomb lid between the two pieces of cloth and the illustrator is depicting the sudarium as separate . The illustrator is taking his cue, as so many others did, from John’s gospel account where the sudarium is described as being apart from the other wrappings. The gospel text would be known to everyone, the Turin Shroud only to a very few indeed. If in doubt with these manuscripts, the gospel accounts should be seen as the main source as actual depictions of relics are very rare. (How many depictions of actual relics can you find in medieval art- some shrines certainly, but very seldom any actual relics- that is why the Pray Codex is unlikely to show the Turin Shroud -it would be completely out of keeping with the mainstream of medieval religious art.)\n\n","date":"June 13, 2012 at 7:51 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12367","author":"menedemus","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Rubbish.\n\n","date":"June 13, 2012 at 9:43 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12386","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"With the synoptic gospel accounts as a source, the points of resemblance of the two sheets (codex illustration and actual shroud) are anything but coincidental.\n\n","date":"June 13, 2012 at 6:02 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12416","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Lamentation of Christ. The fresco of the church of St. Panteleimon in nonresonant. 1164\n Оплакивание Христа. Фреска церкви св. Пантелеймона в Нерезе. 1164 г.\nhttp://artyx.ru/books/item/f00/s00/z0000001/st015.shtml","date":"June 13, 2012 at 7:52 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12368","author":"Tornike Chiboshvili","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Spasiva Tornike.\n\n","date":"June 13, 2012 at 9:09 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12376","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"sorry I do not know English …. :(  :))\n\n","date":"June 13, 2012 at 7:54 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12369","author":"Tornike Chiboshvili","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Ia nie panimaiu\n\n","date":"June 13, 2012 at 9:02 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12375","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"ok :)\n\n","date":"June 13, 2012 at 9:41 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12385","author":"Tornike Chiboshvili","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"BTW Dan is restricting my freedom of speech. Too bad, you just missed my allusions to Byzantine and Mieval legend of the floating shroud (see e.g. Perlevaus or The High Book of the Grail) and antishroud psychorigids. On the Lirey pilgrim’s badge, the Turin Shroud appears just above/as if topping the sarcophagus.\n\n","date":"June 13, 2012 at 8:15 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12371","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"\nMax Patrick Hamon :\nYOU REALLY SHOULD BUY ICONOLOGICAL GLASSES!\n\nYou, Max, should get your sight tested…\n\n","date":"June 13, 2012 at 8:38 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12372","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Just bablybabbling by an oldsciencebod.\n\n","date":"June 13, 2012 at 8:44 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12374","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Here’s my post on Colin Berry’s blog:\nCB, you really should wear/buy ICONOGICAL glasses! BTW my freedom of speech is also restricted on Dan’s blog…. Here what I wanted to reply to your last comments:\nThere are nothing more than muddy blabla by a square/rectangule minded scientific eel….\nYou only demonstrate, if anything, only one thing: you’re definitely ignorant of medieval standard and artistic licence in Medieval Art. As Stephen Jones would put it, you are one of the archsceptic empty vessels making noise on Dan’s blog.\nYou asked me for some iconiographic reference to back up my interpretation of the Pray Ms miniature re the shroud topping the sacophagus: CANNOT YOU REALLY SEE the rectangular herringboned weave pattern shroud JUST ABOVE/as if topping the sarcophagus in the Lirey Pilgrim badge?\nThis is to be related to the “floating” shroud legend. Ever heard of it? In French Medieval literature, see e.g. Perlevaus or the High Book of the Grail.The floating shroud theme also appears in Byzantine literature. Check for yourself.\nColin Berry, David Mo and LyFe, you really need more than an eye-opener to see!\nActually, this is not so much the Pray Ms Shroud (lying flat on the sarcopphagus lid) that is rigid than you Colin Berry et al that ARE antishroud psychorigids.\nI do think the greatest irony for an eel is to be psychorigid ;-)\n\n","date":"June 13, 2012 at 8:39 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12373","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"P.S. To my previous comment.You have to remember that the vast majority of those producing sacred texts were enclosed monks. They would not be able to get out and about to see any relics other than those in their own monastery unless they had special permission from their abbot. So they would rely for their inspiration  on what sources there were INSIDE the monastery which would include the gospels, of course, and other recognised texts. So we would assume that the illustrator of the Pray Codex would be using gospel texts and that this would explain why the sudarium is shown separately. He may also have known about burial customs such as placing the hands across the genitalia as was common practice in burials of his time. It is very unlikely that he  would have reproduced a relic.Why would he?\n\n","date":"June 13, 2012 at 9:09 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12377","author":"menedemus","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Sorry menedemus, but it is just rubbish. No need for more commenting.\n\n","date":"June 13, 2012 at 9:24 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12380","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"I think the point that menedemus is trying to make, valid in my honest estimation, is that the illustrator was not able to give us a 100% faithful reproduction, because that was not his main focus and usual convention.  So this may explain why all the points of contact are not going to be there.\n\n","date":"June 13, 2012 at 6:11 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12417","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Max? Although I agree with you that menedemus is in error, thats no way to answer someone’s post. Why don’t you explain to him how it is rubbish? That would go a longway better, don’t you think?\nR\n\n","date":"June 15, 2012 at 10:49 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12522","author":"Ron","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Ron, you are right, but I shall save up my time the most I can to address more interesting points and “dispatched” more futile or unimportant ones (as far as I can judge) while still giving my opinion…\n\n","date":"June 15, 2012 at 1:11 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12532","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"I cannot tell for sure whether Dan restricted or not my freedom of speech. The fact is the small icon topping my name swiftedf rom blue to grey and was modified starting from comment #83 till my last comment….\n\n","date":"June 13, 2012 at 9:22 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12379","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Correction: “shifted”\n\n","date":"June 13, 2012 at 9:26 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12381","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Max would have more credibility if a) he did not waste so much space having to correct his typing errors.\nb) he could provide a coherent explanation of why he is right and other people’s views are rubbish.  If he could do this just once in a way that people could understand and accept, even if they did not agree with him, then he would not have to spend all his time on his computer adding cryptic comments every five minutes.\n\n","date":"June 13, 2012 at 9:39 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12384","author":"menedemus","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"I comment in snatches WHILE working. Just trying to save up as much time to both post on Dan’s blog while working on professional files. It does seem you have plenty of time to waste it.\n\n","date":"June 13, 2012 at 9:47 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12387","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Anyway you are right to a certain extent: I should really try to redeem myself wiith this bad habit of mine. Too bad Dan’s blog is 99,99% for English writers….\n\n","date":"June 13, 2012 at 9:53 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12388","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Correction: “for bloggers using the English language”\n\n","date":"June 13, 2012 at 9:54 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12389","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"No, so that having made, I hope, my point clearly, I can retire to devote my time to MY professional work without interruption.\n\n","date":"June 13, 2012 at 9:55 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12390","author":"menedemus","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Well replied.\n\n","date":"June 13, 2012 at 11:33 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12398","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"I wrote: “…[with] a minimum of iconological vista), you’ll see a wrinkle line and rumples amid the square-topped stepped pyramid weave pattern in connection with the angel’s left foot resting on the SHROUD COVERED SARCOPHAGUS LID. The latter, according to medieval standard can be see EITHER raised up OR just displaced […].”\nTo really be aware of what I mean, just ask a graphic artist friend of yours how he would sketchily feature wrinkles and rumples in a lying flat square-topped stepped pyramid weave pattern shroud with on top a rolled up (semi-transparent?) napkin/veil, and you’ll get the answer. Now compare the resulting sketch with that of the miniature.\nFrom then on, you might well become aware the anonymous minaturist Benedictine monk actually found a rather ingenuous and economic solution.\n\n","date":"June 13, 2012 at 11:20 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12395","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Addition: you will ask your friend to sketch a view of the two items seen from above.\n\n","date":"June 13, 2012 at 12:16 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12401","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"\nIronclad :\nHello David,\nI’m curious about that observation.  So do you believe the bloodstains were placed after the formation of the image or before it?\n\nAll sindonists say that body image was done after the bloodstains. I have not read any contrary opinion. I think we must accept this opinion, unless new research says otherwise. Do you think so?\n\n","date":"June 14, 2012 at 1:28 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12420","author":"David Mo","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"I too uncritically accepted the claim that the blood stains were under the image, David, or rather that there was no image under the blood stains (with the take-away message that blood arrived first).  But I’m finding more and more that matters are not nearly as simple and straightforward as we have been led to believe. What iis assumed to be blood may not necessarily be real blood, and any real blood on the Shroud, in various degrees of chemical degradation, may not necessarily have been on the Shroud at the instant of image production. (In other words, one must not assume that the failure to find an image under one bloodstain means that all areas showing “blood” have no underlying image). To put it crudely – there may have been touching up with blood over the centuries – or with red or brown pigments that could be mistaken for blood. It is a very difficult area, and one that needs detailed information on precisely what was done in the past by those STURP investigators, as distinct from the sketchy accounts that are available on the internet. I’m hoping that Mario Latendresse’s Shroud Scope might at least help in identifying “suspect” area of bloodstaining.\nIncidentally, did you see my final conclusion re the Pray Codex, or rather the crucial image (see link to image) showing where the Shroud ends and the sarcophagus lid starts?  It provides an explanation for those two red wavy lines and the little black crosses, but kicks any speculation about poker holes and herringbone weave patterns back into the long grass methinks. I’d be interested to hear your opinion.\n\n","date":"June 14, 2012 at 2:18 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12421","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Colins: sorry, I should be working on something else now. As I’ll have time I shall watch what you say. Two quick notes: \n1. Your assumptions about the disappearance of the image under the blood are consistent. But I have no objection to admit that first it was produced the bloodstains and body image after. It’s what the sindonists claim\n2. My argument is independent of the bloodstains nature. You point the possibility of some further retouchins. They are possible, but it is not my issue now.\nFinally: take care with excessive especulation. It is a very common sindonist mistake. We do not have explanation for everithing and there are things perhaps we shall can never explain. The first duty of rationality is humility.\n\n","date":"June 14, 2012 at 2:57 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12422","author":"David Mo","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Colinsberry: “I too uncritically accepted the claim that the blood stains were under the image,”\nNow that’s contradicting Mr. David Mo’s statement and raises a red flag.  Did the blood come first or did the image?  I thought science had already answered the question, but now I see there might be controversy.  How could this be? If we can see a faint image just with our plain eyes, cannot we see even more with advanced instruments and techniques?  Forensically, the chemistry of blood should not be a barrier.  Or is it?  Who would have known science could be so limited with something palpable and present, yet grandiose when it comes to biological phenomenon occurring millions of years ago.  An odd contrast.  After all these years I was under the impression that the carbon dating was the one major item steeped in an unsettled, fiery storm.  And yet, were not the STURP scientists able to remove the ‘red covering’ (for lack of a better phrase, since now even the presence of blood is in question) and determine if there was an image under there?\n\n","date":"June 14, 2012 at 8:45 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12449","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"colinsberry: “ (In other words, one must not assume that the failure to find an image under one bloodstain means that all areas showing “blood” have no underlying image)”\nIf that is the case, then, scientifically, nothing conclusive could be learned about the shroud, as it would demand higher standards of testing, and so more damaging (e.g., removal of stains from more than one site), something the custodians would never allow. At what point do we say this or that is enough? After how many attempts?  I thought uniformity was one of the pillars of science.  Ironically, your stance only lends a hand to the crowd screaming foul play when it comes to the carbon dating, on account of the difference of fabric and weaving, they say.  I could see the nonuniformity principle being applied here, but in the case of the image itself?  To suggest it seems a bit unreasonable for whereas fabric can be stitched and unstitched, images can’t, especially when they are attached to bloodsoaked (or whatever other fluid)\n\n","date":"June 14, 2012 at 9:50 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12457","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"colinsberry: “ (In other words, one must not assume that the failure to find an image under one bloodstain means that all areas showing “blood” have no underlying image)”\nIf that is the case, then, scientifically, nothing conclusive could be learned about the shroud, as it would demand higher standards of testing, and so more damaging (e.g., removal of stains from more than one site), something the custodians would never allow. At what point do we say this or that is enough? After how many attempts?  I thought uniformity was one of the pillars of science.  Ironically, your stance only lends a hand to the crowd screaming foul play when it comes to the carbon dating, on account of the difference of fabric and weaving, they say.  I could see the nonuniformity principle being applied here, but in the case of the image itself?  To suggest it seems a bit unreasonable for whereas fabric can be stitched and unstitched, images can’t, more so when they are intertwined with bloodsoaked (or whatever other fluid) material, each preserving the fidelity of the other.\n\n","date":"June 14, 2012 at 10:01 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12458","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"David: “All sindonists say that body image was done after the bloodstains.”\nIf so, that will be contrary to common sense and sound judgement, since an artist and a forger, both aiming for the same thing, would want to do a good job and strive to minimize the cost of production, you know, start with a clean sheet or canvas first, draw the outlines, fill in the substance, and then add the blood stains.  Adding the bloodstains first would defeat the purpose as it would only complicate the process, something inconsistent with the genius of the forger/artist.  I can only imagine how hard it would be trying to trace and match the blood stains, and their flow patterns, to the areas of injury while creating the image, making sure all the while that they are not offline. The difficulty is made worse by the fact that the image is no ordinary ‘creation’ with its inverse properties and almost invisible contours when at close range.\nFrom a psychological standpoint, the presence of the bloodstains as a first event would argue against forgery or a purely artistic endeavor.\n\n","date":"June 14, 2012 at 9:05 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12454","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"By the same token, papers delivered at  Shroudology congresses- with kudos for those who perpetuate mystery – are better received if the blood came first, then the image, than the other way round. \nThe possibility for getting the chronology wrong are endless when the “blood” is highly degraded, or not even real blood, and when zilch is known about the chemical nature of the image. \nI’m not saying there has been outright fraud, or even selective reporting – only that the protocols and reporting need detailed and sober re-evaluation by those who have no stake in the outcome, and who are interested purely in how “blood” comes to be associated with some kind of high-energy chemical modification of linen carbohydrates. The two do not sit together easily – certainly not in terms of organic chemistry.\n\n","date":"June 14, 2012 at 9:34 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12456","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"colinsberry:”The possibility for getting the chronology wrong are endless when the “blood” is highly degraded, or not even real blood, and when zilch is known about the chemical nature of the image.”\nBut in what way are these hindrances to finding out if in fact an image is under it all?  The image has survived despite the passage of hundreds of years and it being subjected to all kinds of damaging elements.  I would think that if the staining fluid was the last finishing touch, then it would have offered a protective cover to whatever image that laid under it.\n\n","date":"June 14, 2012 at 10:26 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12460","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"…let me see if I could resolve the ‘italic’ problem\nTesting.  Ok, I also posted a response to David and Colin in another computer, which currently  is awaiting approval from the moderator.\n\n","date":"June 14, 2012 at 4:05 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12481","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Nope, the italics are not coming from me.\n\n","date":"June 14, 2012 at 4:07 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12482","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"David: heaven forbid that I should fall into the trap of idle speculation. I think I can safely say that I hold off from sharing speculation with others until I can offer some substantial evidence to back it up. \nTake the burial shroud in the Pray Codex for example that some dismiss as the face cloth. I believe it to be far too long and convoluted to be the face cloth, extending down to those two red wavy lines. Had I left it there, then yes it would be idle speculation. But I have concurred with others that the red markings are indeed blood, and what’s more have shown a role for the artist’s little black crosses to delineate shroud from sarcophagus.\n  In fact my blog posting yesterday on the Codex was the first I have ever done on the subject, despite posting numerous comments here and elsewhere while waiting for thoughts to gel. I have trodden warily where the Codex is concerned.\nThose of us with a scientific background at least try to get the timing right re our discoveries and insights – not too fast, not too slow – but I grant you that none of us are perfect.\n\n","date":"June 14, 2012 at 3:14 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12423","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"“We shall never explain”. Sorry for may English.\n\n","date":"June 14, 2012 at 3:15 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12424","author":"David Mo","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Colin Berry Oilscienceboiled wrote: “heaven forbid that I should fall into the trap of idle speculation.” HA HA HA HA HA!\n\n","date":"June 14, 2012 at 5:13 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12434","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Hell does permit it, Oilscienceboiled eel!\n\n","date":"June 15, 2012 at 4:54 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12502","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Ironclad: I have great respect for David Hume as a philosopher. But folk – including philosophers- who attempt to lay  down track for how science and scientists operate are invariably simplistic, and often just plain wrong. David Hume’s uniformity principle was plain wrong. I don’t wish to get involved in a philosophical debate on this – but here’s a link that alludes to some of Hume’s failure to grasp the subtleties of the scientifc method. \nhttp://phil224f11.eripsa.org/12/11/the-uniformity-principle/\nIndeed, some of us have spent a lifetime in scientific research, and are still not certain how the interplay of hypothesis and experiment generally (but not always) takes one along paths that are finally productive…\n\n","date":"June 14, 2012 at 10:07 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12459","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"\nIronclad :\ncolinsberry:”The possibility for getting the chronology wrong are endless when the “blood” is highly degraded, or not even real blood, and when zilch is known about the chemical nature of the image.”\nBut in what way are these hindrances to finding out if in fact an image is under it all?  The image has survived despite the passage of hundreds of years and it being subjected to all kinds of damaging elements.  I would think that if the staining fluid was the last finishing touch, then it would have offered a protective cover to whatever image that laid under it.\n\nHave you taken a look at the “bloodstains” on the Shroud, e.g. with Mario Latendresse’s Shroud Scope? Many are indistinguishable from those of skin, hair etc – a far cry from any notion that they can be peeled off with forceps – since they are just a coloration on the most superficial parts of the weave.\nNothing is certain, far less predictable in surface chemistry, not when you are dealing with highly superficial layers that are in the micron region of thickness or less, where gaseous diffusion or any other kind of access or penetration is not the rate-limiting factor. \nIt’s infuriating I know, but while the image of a man can be imprinted on linen, the chemical makeup of that image – modified linen, bloodstains etc – cannot as yet be displayed on a computer screen at the molecular level.\n\n","date":"June 14, 2012 at 10:57 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12462","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"colinsberry: “Nothing is certain, far less predictable in surface chemistry,”\nBut I thought you conceded that least in one instance there was no image under a particular stain.  Your problem was that you wanted this proven more than once at another section of the shroud, just for confirmation sake,  not that it was untestable or that science cannot find out.  I have a little more faith that science can.  It is not impossible verify the constituents of that fluidy substance and see if it has the same chemical signature of the dehydrated cellulose of the image mixed in, if in fact the image was the first thing that was formed there.\n\n","date":"June 14, 2012 at 11:33 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12465","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"As I say Ironclad, the chemistry is not straightforward. You refer to ‘the chemical signature of dehydrated cellulose”. First, we don’t know if it’s dehydrated cellulose or hemicellulose – but is more likely to be the latter, something that Rogers did not consider, or at any rate comment on. The changes that carbohydrates undergo on mild pyrolysis are exceedingly subtle, and the eye is in fact far better at picking up surface pyrolysis that any amount of chemical instrumentation. \nLikewise the signature of heated or age-degraded blood is by no means a straightforward one, which is why we saw Alan Adler switching from testing for haemoglobin to testing for hydrazine-solubilized iron-free porphyrins, and being largely content to characterise those porphyrins by their uv/visible or fluorescence spectra which does not constitute conclusive evidence for anything. And let’s not forget that some say the only signature that aged blood would leave after centuries is iron oxide which puts a question mark over claims that the blood stains are AB group or test positively for albumin etc. And there’s Adler’s admission that his bloodstains did not contain potassium or other physiological cations or anions that should act as a signature of even the most degraded blood: his explanations in terms of haemolysis, clot retraction etc groaned under a load of qualifying assumptions, something that was sadly all too symptomatic of STURP science.\nI’d describe alleged bloodstains on the Shroud as a can of worms, except that a can of worms would be far easier to work with.\nI’m aware this is not a complete answer, but this is perhaps not the appropriate post to delve more deeply further into the subtleties and complexities. I might try posting an overview of bloodstains on my own blog (when I’ve completed my Shroud Scope scan) and invite comments here as well as my own site(s).\n\n","date":"June 14, 2012 at 3:12 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12476","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"colinsberry: “First, we don’t know if it’s dehydrated cellulose or hemicellulose – but is more likely to be the latter, something that Rogers did not consider”\nMr. colinsberry, how do you know that Rogers did not consider this?  And I thought the science was pretty much clear and well established that we’re  are indeed dealing with dehydrated cellulose.  This is the first time I’m learning that there may be questions still lingering about this.  On what basis are you making such statements?  Rogers and the rest of the STURP scientists were personally involved in the direct inspection and testing of the shroud and subjected their findings to peer-review.  Who is now challenging it and has he or she had the privilege of also inspecting the shroud upfront as has Rogers so as to make these challenges?\n\n","date":"June 15, 2012 at 3:51 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12555","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"\nIronclad :\nFrom a psychological standpoint, the presence of the bloodstains as a first event would argue against forgery or a purely artistic endeavor.\n\nPlease, Ironclad. I made a simple and clear question and would like a clear answer without additives.\nAll sindonists say that body image was done after the bloodstains. I think we must accept this opinion, unless new research says otherwise. Do you think so?\nYes or not?\n\n","date":"June 14, 2012 at 1:34 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12468","author":"David Mo","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"\nDavid Mo :\n\nIronclad :\nFrom a psychological standpoint, the presence of the bloodstains as a first event would argue against forgery or a purely artistic endeavor.\n\nPlease, Ironclad. I made a simple and clear question and would like a clear answer without additives.\nAll sindonists say that body image was done after the bloodstains. I think we must accept this opinion, unless new research says otherwise. Do you think so?\nYes or not?\n\nI stand in unison with the rest of the reasonable observers, and I thought I made my point clear.  The evidence shows that the image came after the blood stains and I proceeded to logically demonstrate how this could be devastating to the position that holds forgery or artistry as the cause.\n\n","date":"June 14, 2012 at 2:13 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12473","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Someone can close italics? All right?\n\n","date":"June 14, 2012 at 1:37 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12469","author":"David Mo","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"  Here’s an attempt to close italics…\n\n","date":"June 14, 2012 at 1:50 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12470","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Since that did not work, how about opening and closing italics and opening and closing bold just for good measure. And we’ll try opening and closing italics a second time (belt and braces)\n\n","date":"June 14, 2012 at 1:53 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12471","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"OK, so let’s try a string of ‘close italics’  html tags:            Has that worked?\n\n","date":"June 14, 2012 at 1:57 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12472","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"On Facebbook (Examiner.com), you can read:\nAntonio Lombatti’s 1st question: -To get a real value of my research, read my paper. Have you read it, Max? \nmy reply: – If you feel like sending your research paper to me , I will read you and even make a critical study of it if need be.\nAntonio Lombatti’s 2nd question: – One more thing, Max: can you name ONE article on the history of the Turin Shroud published on a peer-reviewed journal in the last 10 years or so?\nmy reply: – Yes, and in… your own field (Church History°): Emmanuel Poulle’s article, Revue Ecclésiatique de France! BTW have you read it, Antonio? I had a few words with you on Dan’s Porter blog. It rapidly appears to me, by the answers you gave, you are VERY FAR from demonstrating the Turin Shroud is a fake. On the contrary, if GdCh really conquered/gained the shroud, to pay him for “service rendu” to the French Crown during the Smyrna crusade, then I STILL very much, doubt the Christian knight, “agent du secret” (secret service agent) accepted to receive a fake Christ shroud to be paid off. BTW Could you tell me HOW MANY fake shrouds you can trace in History BEFORE 1357? Any better candidate with a front AND back image?\n\n","date":"June 14, 2012 at 2:27 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12474","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"\ncolinsberry :\nAs I say Ironclad, the chemistry is not straightforward. You refer to ‘the chemical signature of dehydrated cellulose”. First, we don’t know if it’s dehydrated cellulose or hemicellulose – but is more likely to be the latter, something that Rogers did not consider, or at any rate comment on. The changes that carbohydrates undergo on mild pyrolysis are exceedingly subtle, and the eye is in fact far better at picking up surface pyrolysis that any amount of chemical instrumentation. \nThis view seems to decry the level of scientific work that has been done and the experimentally verified conclusions reached.\nFrom the “statements of fact” extracted from Rogers’ Frequently Asked Questions @ http://shroud.com/pdfs/rogers5faqs.pdf, which “can be proved from the scientific observations,” the following are pertinent to this discussion:\n1. The blood can be removed with a proteolytic enzyme.\n2. The image color can be chemically reduced with diimide, leaving colorless, undamaged linen fibers behind.\n3. The image color was NOT due to chemical changes but came as a result of dehydration of the cellulose to produce conjugated-double-bond systems.\n4. The blood still evolved hydroxyproline on mild heating, and the cellulose crystals were largely undistorted.\nGiven these factors, we can deduce that if the image formation process was the first event, the fluid substance, being the successive event and covering the image, could be removed using a proteolytic enzyme thus exposing the image color, which apparently is not affected by this or any other eliminative process, this function being better served by the diimide reagent.\nTherefore, it is possible to see if there is an image under the blood, and if it is not there following the above procedures, then reason forces us to conclude that the stains are an event occurring prior to the image process.\nNotwithstanding the committal of fraud to the contrary, Rogers’ scientific reputation and the rest of the scientists that worked directly with the shroud are greatly impugned if the above scientific “facts” are not facts at all.\n\n","date":"June 14, 2012 at 3:34 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12479","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Antonio Lombatti’s 3rd comment:\n– I’m talking about a paper on a hypothesis on how the relic came into possession of the Charny family. Poulle only reviews Chevalier’s work. It’s not an article on the Shroud.\nI don’t have to demonstrate anything. The Shroud is medieval. It appeared in France in the middle of the XIV century. This is what all professional scholars think (apart from a couple of taliban Christians). Soldiers or knights were given fake relics. This was quite ordinary. The imprint of the buttocks of Jesus or the milk of the Virgin Mary. Relics were a big business at the time (and still now for the Catholic Church): they attracted pilgrims. They enriched the men of God. And don’t tell me the fairy tale of the Edessa image, an apocryphal legend debunked even by a pope. Last but not least, don’t forget about the other full 16 burial cloths of Jesus in the Middle Ages. All genuine. All venerated by they faithful at the same time. With the approval of the Church.Your assertion, as professional Church Historian, is that the TS is mediieval.\nMy comment:\n– As a professional Late Antique and Medieval Archeaocryptologist, my contention is that the TS IS Late Antique (1st century CE). I can prove it on a rather solid collective ground (numismatics, iconology, literature, Second TempleJudean History & Archaeology etc). I am no Taliban/Student. I am a former university professor. You still did not answer my question: How many medieval faked shrouds with a front and back image dating BEFORE 1357 have reached us if they were that many/that ordinary to make faked Christ shroud. STILL waiting for your LEARNED OBJECTIVE answer… Please don’t you tell me your mantric psychorigid antiauthenticist tale about the shroud authenticists. Can you tell instead the exact date of at least a couple among the 16 Medieval faked shrouds you mentionned. How can you tell for sure between a faked Christ Shroud and a copy from a possibly original Christ Shroud. What are you objective archeaological criteria. to be so assertive (It is a faked shroud) Thank you for a very detailed LEARNED reply\nYou wrote: “Poulle only reviews Chevalier’s work. It’s not an article on the Shroud.” That’s a really good one! The work is about the Shroud History as perceived by Ulysse Chevalier, a scholar and a real intellectual crook when it comes to the objectivity of his Lirey Shroud file.\nCannot you remember? You asked me: “can you name ONE article ON THE HISTORY OF THE TURIN SHROUD published on a peer-reviewed journal in the last 10 years or so? Are you used to change your “à-geométrie-variable” question whenever you don’t like the reply?\n\n","date":"June 14, 2012 at 7:48 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12488","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"My additional comment to Antonio Lombatti’s:  \n– Antonio you also wrote: “I don’t have to demonstrate anything. The Shroud is medieval.” Don’t you think your content is precisely verging on Shroud antiauthentistic TALIBANISM?\n\n","date":"June 14, 2012 at 8:00 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12489","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"My additional comment: \n– A PROOF the Turin Shroud is a fake…Really? I very much doubt ” so. In terms of History, just tell me how can your so-called “proof” meets all the criterias of “the” proof beyond any rational doubt? BTW can you PRECISELY tell me what could be such criteria. Methink no matter how cautious a Church Historian strive hard to reconstruct a seven centuries’ old event of the past, only a Histoty Taliban can be that assertive.\n\n","date":"June 14, 2012 at 9:12 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12490","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"My additional comment #3: \n– I cannot help thinking the man is just trying here to SELL IT to…ignoranti..\n\n","date":"June 14, 2012 at 9:28 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12491","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Could Dr. Lombatti prove that Geoffroy de Charny was given a ‘fake’ relic made in France and not a ‘true’ relic carried by crusaders returning from Turkey?\n\n","date":"June 15, 2012 at 3:29 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12496","author":"domenico","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Summary. — The first goal of this inquiry, carried out on sources of the history of Christic relics, was to discover those among them which might involve the Shroud of Turin, notably so as to fix the vocabulary used. It has thus been established that the frequent identification of the Shroud of Turin with the Mandylion coming from Edessa in Constantinople in 944 was impossible, the two relics being simultaneously conserved in Constantinople from an unknown date on, perhaps from the 11th c. on. Later testimony describing the image on the Mandylion as being of a body and not just of a face rely on an erroneous interpretation of a Latin text, oft repeated at the end of the Middle Ages. The texts (in Latin and in Greek) are cited within a context wide enough to clarify their meaning, and they are translated.\nThey attest the presence of the shroud at Constantinople before 1204.\nEmmanuel Poulle, Les sources de l’histoire du linceul de Turin. Revue critique\nRevue d’Histoire Ecclésiastique, 2009/3-4\n\n","date":"June 15, 2012 at 4:12 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12497","author":"corneliotel","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"BTW this is the summary of a SECOND peer-reviewed article by E. POULLE.  Most obviouly Antonio HASN’T READ IT YET!\n\n","date":"June 15, 2012 at 4:41 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12499","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Thank you, gracias, grazie Cornelio.\n\n","date":"June 15, 2012 at 4:46 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12501","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Iread it two years ago and was just focusing on the Ulysse Chevalier’s file.\n\n","date":"June 15, 2012 at 4:57 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12503","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Antonio wrote: “Soldiers or knights were given fake relics”. TO be REALLY intellectually honest, he should have added “the also stole/gained AUTHENTIC RELICS.  His “historical view” is agenda driven as archsceptical Shroud antiauthenticist…. This is NOT GOOD  HISTORY, I am afraid, you’ll read in his paper.\n\n","date":"June 15, 2012 at 4:29 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12498","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Could Antonio Lombatti please get down from his aprioristic agenda-driven ivory tower and try to be less desinformative and misleading. The public reader would very much appreciate.\n\n","date":"June 15, 2012 at 4:45 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12500","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Lombatti writes: “I’d like to let you know that the same version of my paper has been accepted in the Journal of Biblical Literature”…\nThis is a little puzzling. As far as I know the JBL does not accept articles appeared elsewhere even in another language.\nCould Dr Lombatti clarify this point?\n\n","date":"June 15, 2012 at 5:04 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12504","author":"domenico","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Corneliotel’s summary is useful .Thank you. It would be good to have access to the full article if it is on line.\nIt seems( please correct me Corneliotel if I am wrong)  that E.Poulle accepts that the Mandylion/ the Image of Edessa  and the Shroud of Turin are NOT  the same relic, but two distinct relics, one ,of course, of the face of the living Christ, and one the double image of the dead Christ. This is ,of course, what has long been argued here by Yannick and it makes good sense – they are so different that they cannot be the same,  contrary to what Ian Wilson argues. It seems that Poulle accepts that texts such as the Gregarius text of 944 do show that the Image was just of a face and it was a later misinterpretation to suggest that this sermon talked of a body on the cloth. Is that correct?\nBut E.Poulle does accept that the Turin  Shroud was in Constantinople. Does he argue that it is the separate burial cloth reported by Robert de Clari in the Blachernae Chapel in 1203? I would be interested if  Poulle tells us where he thinks this Shroud came from originally – how did it arrive in the Blachaernae Chapel?\nThe Poulle article does seem to be very important in giving a scholarly overview and I hope we can be able to read it in full. Thank you Max and Corneliotel for telling us about it.\n\n","date":"June 15, 2012 at 5:08 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12505","author":"menedemus","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"You’re welcome, Menedemus. The fact is I don’t quite agree with POULLE here (he is not a Byzantinist but a Medievist, that can make a world of a difference if you ask me).\n\n","date":"June 15, 2012 at 5:58 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12508","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"David Mo: “Do you agree with Mr.Lavoie? Or have you another way to explain the anomalous blood trails over the hair?”\nI have one of Lavoie’s books on the subject and tend to agree with him.  I’m at a loss as to how this may disprove the authenticity of the shroud since Lavoie’s position is one for and not against.  This, however, has nothing to do with the original question concerning what event came first: the blood or the image.  If the blood came first, then this greatly increases the odds that the cloth was not a product of artistry for precisely the reasons I have elucidated in my previous postings.\n\n","date":"June 20, 2012 at 1:23 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12738","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"See my comment June 19, 2012 at 1:59 am, please.\n\n","date":"June 20, 2012 at 2:14 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12745","author":"David Mo","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"\nIronclad :\nI stand in unison with the rest of the reasonable observers, and I thought I made my point clear.  The evidence shows that the image came after the blood stains and I proceeded to logically demonstrate how this could be devastating to the position that holds forgery or artistry as the cause.\n\nThank you. Your answer is clear. \nI think the bloodstains nature is not the main problem with them. My objection is maintained even if it was shown that the bloodstains are actually blood.\nThe main question arises in other terms: Independently of their nature, are the bloodstains natural or painted? \nThe subject was presented by “a leading forensic pathologist (Michael Baden, deputy chief medical examiner of New York for Suffolk County) [who] says(…) «Blood never oozes in nice neat rivulets, it gets clotted in the hair. The anatomic accuracy is more what Michelangelo would have done in a painting than what actually happens to a body».” (Cfr: Marvin M. Mueller, reply to William Meacham “The Authentication of the Turin Shroud: An Issue in Archaeological Epistemology”, http://www.shroud.com/meacham2.htm ). \nThe reply came by hands of several sindonists. The referential work for all them is G. Lavoie. I shall comment his “Turin Shroud: a medical forensic study of its blood marks and image”, (http://www.acheiropoietos.info/proceedings/LavoieWeb.pdf). Lavoie accept the starting point (namely, drops of blood can’t flow over the hair), but he found an ingenious answer: the bloodstains do not really flowed over the hair. The blood drops were done by contact with the cloth when it wrapped the body. Later the linen became plane and the body prints on it by another different way. It is necessary to superpose the two images for an accurate location of marks. So, the bloodstains don’t flow over the hair, but on the face. \nThis reply is widely accepted by sindonists (Fanti et allia). \nDo you agree with Mr.Lavoie? Or have you another way to explain the anomalous blood trails over the hair?\n\n","date":"June 15, 2012 at 9:44 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12517","author":"David Mo","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"\nmenedemus :\nBut E.Poulle does accept that the Turin  Shroud was in Constantinople. Does he argue that it is the separate burial cloth reported by Robert de Clari in the Blachernae Chapel in 1203? I would be interested if  Poulle tells us where he thinks this Shroud came from originally – how did it arrive in the Blachaernae Chapel?\nThe Poulle article does seem to be very important in giving a scholarly overview and I hope we can be able to read it in full. Thank you Max and Corneliotel for telling us about it.\n\nI would be interested too to know how Poulle links de Clari shroud with Codex Pray or the shroud of Turin. I am very interested.\n\n","date":"June 15, 2012 at 9:47 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12518","author":"David Mo","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"To David Mo: Actuallly E, POULLE links it with the Pray Ms miniature. Once again, YOU’D BETTER READ before passing comment.\n\n","date":"June 15, 2012 at 12:56 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12527","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"E;POULLE wrote a study on the Pray Ms (See RILT N°25, pp 7-19).\n\n","date":"June 15, 2012 at 1:00 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12528","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"E, POULLE passed away in 2010.\n\n","date":"June 15, 2012 at 1:02 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12529","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"So, don’t you keep asking him to reply, please.\n\n","date":"June 15, 2012 at 1:19 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12534","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"colinsberry: “Who’s to say that the proteolytic enzyme do not just digest the blood proteins, but proceed to attack the plant cell proteins too, loosening and lifting off an image that was UNDERNEATH the blood stains.”\nAs demonstrated by the scientistS through their experiments, I state again: the colored coating cannot be dissolved, bleached, or changed by standard chemical agents.  Additionally, according to Heller and Schwalbe, two original STURP scientists who worked directly with the shroud, no image formed under the blood stains, later also confirmed by Carlo Brillante.  If these findings, which were arrived at following sound protocols of science, are in doubt, then nothing could be learned about anything.  I would think that anyone having any misgivings about these or any other such verifiable scientific discoveries would come as a result of having done some objective work of their own instead of subjective “what-ifs,” “could haves,” or “maybes.”\n\n","date":"June 20, 2012 at 12:27 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12791","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"\nIronclad :\ncolinsberry: “First, we don’t know if it’s dehydrated cellulose or hemicellulose – but is more likely to be the latter, something that Rogers did not consider”\nMr. colinsberry, how do you know that Rogers did not consider this?  And I thought the science was pretty much clear and well established that we’re  are indeed dealing with dehydrated cellulose.  This is the first time I’m learning that there may be questions still lingering about this.  On what basis are you making such statements?  Rogers and the rest of the STURP scientists were personally involved in the direct inspection and testing of the shroud and subjected their findings to peer-review.  Who is now challenging it and has he or she had the privilege of also inspecting the shroud upfront as has Rogers so as to make these challenges?Max Patrick Hamon :\nE, POULLE passed away in 2010.\n\nOn the contrary, Rogers was quite adamant that it was not the cellulose that was dehydrated, but other more reactive carbohydrates. He briefly alluded to hemicelluloses, but then focused exclusively on extraneous impurities – starch and saponins – in making his case for his gaseous diffusion hypothesis and Maillard reactions. I’ve just this minute composed a similar answer to Yannick, which has taken a fair bit of time, so I hope you won’t mind if I  refer you to that (see link below) for some background on Raymond Rogers – that man who sadly in my view rather lost the plot in the last few years of his life, or maybe didn’t like the major plot on offer (pyrolysis of PCW hemicelluloses). \nhttps://shroudofturin.wordpress.com/2012/06/14/gas-diffusion-and-the-banding-effect/#comment-12558\n\n","date":"June 15, 2012 at 5:15 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12560","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"colinsberry: “On the contrary, Rogers was quite adamant that it was not the cellulose that was dehydrated, but other more reactive carbohydrates……….\n{…}\nhttps://shroudofturin.wordpress.com/2012/06/14/gas-diffusion-and-the-banding-effect/#comment-12558”\nThis is the same document I referenced in my earlier response to you dated June 14 (response # 157).  I should have been more clear, and now reading the document, I stand corrected.  Item # 3 of my response should have read:\n“ 3. The image color was NOT due to chemical changes, which, if it was, the most likely explanation would have been the dehydration of the cellulose to produce conjugated-double-bond systems.”\nRogers, after all, was doing good science!!\nNotice, that the other three points I made (#s 1, 2 and 4) extracted from that document, still stand as regard the conclusion that we can determine which event came first (i.e, the image or the blood), here again repeated once more:\nWe can deduce that if the image formation process was the first event, the fluid substance, being the successive event and covering the image, could be removed using a proteolytic enzyme thus exposing the image color, which apparently is not affected by this or any other eliminative process, this function being better served by the diimide reagent.\nTherefore, it is possible to see if there is an image under the blood, and if it is not there following the above procedures, then reason forces us to conclude that the stains are an event occurring prior to the image process.\nNotwithstanding the committal of fraud to the contrary, Rogers’ scientific reputation and the rest of the scientists that worked directly with the shroud are greatly impugned if the above scientific “facts” are not facts at all.\n\n","date":"June 20, 2012 at 7:38 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12770","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"But he was not doing good science, as that sentence you quote in bold shows. A chemist who knows of the existence of hemicelluloses, and has indeed mentioned them briefly as being more reactive than cellulose, would and should not have written that sentence, referring only to cellulose. He muddies the water even further by referring to hemicellulose as an undesirable  “impurity”, the presence or absence of which contributed to banding and to his strange and I believe untenable conclusions about image intensity. In short, he put every one off the scent, and even now there are folk who consider his quirky ideas to be mainstream, and who bang on incessantly about Pliny, bleaching, banding, saponins, starch etc etc.\nAs for the experiments with the proteolytic enzymes, they may have arrived at the correct conclusion (no image under blood) or there again they may not. There are so many unknowns that could have generated a false positive. For example, did you know there are proteins in the cells of flax linen? Who’s to say that the proteolytic enzyme do not just digest the blood proteins, but proceed to attack the plant cell proteins too, loosening and lifting off an image that was UNDERNEATH the blood stains. One quickie test with trypsin, pepsin or whatever is simply not sufficient evidence on which to base a claim with major implications for Shroud research. So much in Shroud research seems to have acquired the status of Holy Writ, especially anything that supports ‘authenticity’ but then I guess that is hardly surprising. Personally, I loathe pseudo-science, but have also developed a nose for slapdash science too that poses as the last word on the subject…\n\n","date":"June 20, 2012 at 9:34 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12779","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"colinsberry: “But he was not doing good science, as that sentence you quote in bold shows.”\nI must remind you that Rogers wasn’t the only scientist working with the shroud.  The FAQ document is a summary of all the findings collected up to that point by all the scientists who were directly involved in administering the various kinds of tests that brought the shroud into the space age.  Are you saying, then, that the scientific reputation of these scientists are impugned?\nYou wrote; “A chemist who knows of the existence of hemicelluloses, and has indeed mentioned them briefly as being more reactive than cellulose, would and should not have written that sentence, referring only to cellulose.”\nAnd yet, by your own admission, this contention about not involving the hemicellulose is a moot point since, axiomatically, the color is not due to a chemical reaction within the fibers, which if it was, would have also affected hemicellulose, not just the cellulose.  This explains why further elaborations concerning the fibers were not considered.  This, this also throws asunder the other statement you made in a posting dated June 14 @ 3:12 PM, viz: “we don’t know of it’s dehydrated cellulose or hemicellulose.” The fact of the matter is that we DO know the image was not due to chemical changes of the fibers.  Bringing this up as an argument point in an attempt to reason away the ability that science has of determining which came first (the image or the blood) is a sure way of stopping any meaningful progress, and just muddies the water.\n\n","date":"June 20, 2012 at 11:17 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12788","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Adding another scientific fact: the colored coating cannot be dissolved, bleached, or changed by standard chemical agents.  Given these scientifically verified observations, IT IS THEN POSSIBLE to determine if an image exists under the stains, considering that the fluidy substance can be removed with a proteolytic enzyme which itself does not affect the image.\n\n","date":"June 20, 2012 at 11:29 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12789","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Menedemo, Poulle estima en efecto que las 2 reliquias son DIFERENTES.\nYo no he estudiado el tema y no tengo por lo tanto un criterio propio.\nLe sugiero la lectura de:\nhttp://www.suaire-turin.com/skylitzesyl.htm\n\n","date":"June 15, 2012 at 5:33 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12561","author":"corneliotel","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"colinsberry: “On the contrary, Rogers was quite adamant that it was not the cellulose that was dehydrated, but other more reactive carbohydrates.”\nMr.colinsberry, would you care to provide a link or source where readers could verify this?  I provided a link with Rogers’ findings and statements, and yet, you are saying that Rogers completely contradicts himself in another juncture.  This is starting to look fishy.  I was hoping you would have provided some back up, considering that the contradiction is a bug deal and would considerably undermine Rogers’ work.\n\n","date":"June 20, 2012 at 1:14 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12737","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Good day Ironclad. What a pity you could not simply have requested a link without all the innuendo   (“starting to look fishy”). I shall accede to your request this time, but respond to similarly-phrased ones in future with an x.\nThe link in question is a 2004 pdf in which  Raymond Rogers answered a range of FAQs.\nSee especially Pages 8/9\n: “Where darker bands of yarn intersect image areas, the image is darker. Where lighter bands intersect an image area, the image appears lighter. This proves that the image color is not a result of reactions in the cellulose of the linen. Some impurities on the surface of the different batches of yarn produced the image color. This observation is extremely important when tests are being made on image-formation hypotheses. If image color is not simply a result of color formation in the cellulose of the linen fibers, image formation must be a much more complex process than we originally though.”\nSee also point 13 on Page 15:\n“The medullas of colored image fibers are not colored: The cellulose was not involved in color production.” (Rogers’ own italics)\nDo try and keep up, Mr.Ironclad… Oh, and do your own googling in future before casting nasturtiums, as my mother used to say …\n\n","date":"June 20, 2012 at 1:58 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12742","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"\nIronclad :\ncolinsberry: “First, we don’t know if it’s dehydrated cellulose or hemicellulose – but is more likely to be the latter, something that Rogers did not consider”\nMr. colinsberry, how do you know that Rogers did not consider this?  And I thought the science was pretty much clear and well established that we’re  are indeed dealing with dehydrated cellulose.  This is the first time I’m learning that there may be questions still lingering about this.  On what basis are you making such statements?  Rogers and the rest of the STURP scientists were personally involved in the direct inspection and testing of the shroud and subjected their findings to peer-review.  Who is now challenging it and has he or she had the privilege of also inspecting the shroud upfront as has Rogers so as to make these challenges?\n\nOn the contrary, Rogers was quite adamant that it was not the cellulose that was dehydrated, but other more reactive carbohydrates. He briefly alluded to hemicelluloses, but then focused exclusively on extraneous impurities – starch and saponins – in making his case for his gaseous diffusion hypothesis and Maillard reactions. I’ve just this minute composed a similar answer to Yannick, which has taken a fair bit of time, so I hope you won’t mind if I  refer you to that (see link below) for some background on Raymond Rogers – that man who sadly in my view rather lost the plot in the last few years of his life, or maybe didn’t like the major plot on offer (pyrolysis of PCW hemicelluloses). \nhttps://shroudofturin.wordpress.com/2012/06/14/gas-diffusion-and-the-banding-effect/#comment-12558\n\n","date":"June 15, 2012 at 5:35 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12562","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Menedemus: \nIf you read French and Italian, the work of reference is Adele Monaci Castagno, ed. Sacre impronte e oggetti «non fatti da mano d’uomo» nelle religioni, Atti del Convegno Internazionale – Torino, 18-20 maggio 2010. Articles by Anca Vasilu, Andrea Nicolotti and Bernard Flusin. You can read it on line: http://www.unito.it/unitoWAR/ShowBinary/FSRepo/X033/Allegati/sacre_impronte.pdf . They are academics talking to academics. An anomaly in the world of sindonology.\n\n","date":"June 16, 2012 at 1:48 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12577","author":"David Mo","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Thank you, David, for ponting out the Acts of our congress. My article is only a very abbreviated version of my book about the mandylion, descripted here:\nhttp://unito.academia.edu/AndreaNicolotti/Books/951200/Dal_Mandylion_di_Edessa_alla_Sindone_di_Torino._Metamorfosi_di_una_leggenda\n\n","date":"June 18, 2012 at 12:15 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12674","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Actually when authentisitic academics talked to antiauthenticistic non academics, the formers  are not even taken seriously by the latters….\n\n","date":"June 16, 2012 at 7:12 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12582","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Thanks, David Mo . Yes the article by Nicolotti is pretty devastating to the Ian Wilson case- it is a pity there is as yet no English translation as Nicolotti goes through Wilson’s arguments one by one and shows why they are unsustainable. I wonder if anyone in the Shroud community will ever wake up to the dead -ends that Wilson leads them into.\nI am still waiting to hear from Max where he thinks the Shroud of Turin was in 400 AD if it was used for the model for the Santa Pudenziana  mosaic. I am not an art historian but Max’s world seems completely removed from any art history that I have ever dealt with. Who are all these people able to understand the cryptic clues in these paintings?\nSo please Max. ANSWER IN ONE SENTENCE: WHERE DO THINK THE TURIN SHROUD WAS IN 400 AD?\n\n","date":"June 16, 2012 at 7:38 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12583","author":"menedemus","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Menedemus, have you ever heard of the use of staganography in art works? I bet you haven’t but still you criticized me… How long will you speak out of mere IGNORANCE?\n\n","date":"June 16, 2012 at 8:02 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12587","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"This is precisely what I am trying to make out (for free) for people ineterested in the TS! To reply to such a question by just passing comments would amount to prove nothing just to trigger off an endless debate/wrangle. I have still to study in-depth the issue…I do have good cryptographic and steganograzphic tools to help me along the dark passage of CRYPTOchristianism…. a real adventure in Archaeocryptology!\n\n","date":"June 16, 2012 at 8:45 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12591","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Antonio is definitely not a “Shroud of Turin Expert”. Had he been a genuine one, he would not have cared to recur to intellectual dishonesty…unless this is just here sheer ignorance of his subject of “premalediction”…\n\n","date":"June 16, 2012 at 8:37 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12589","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Max. I am not criticising you – I am asking you a question. You are making an important claim- that the Turin Shroud can be seen in a mosaic dating to 400 AD in Rome. So the mosaicists must have seen the Shroud and so it must have been exposed somewhere. So I masking you where you think it was exposed,  If you cannot give an answer no one will take you and your many posts seriously and it is much better that you concentrate on your professional works for clients and do not bother this blog.\n\n","date":"June 16, 2012 at 8:38 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12590","author":"menedemus","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Menemus, I do appreciate your most Christian charitable ignorantia…\n\n","date":"June 16, 2012 at 8:47 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12592","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Menemus, you WANT TO KNOW. Why not diving for/by yourself for a change and find the PEARL you IDLY want me to search for you?\n\n","date":"June 16, 2012 at 8:55 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12593","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Again no answer to a simple question.Can anyone else reading this understand what Max is talking about? Can you not ask yourself Max what is the point spending so much time writing on this blog when no one can understand what you are talking about?\n\n","date":"June 16, 2012 at 8:56 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12594","author":"menedemus","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"“Menemus is just doing the minimum”, must be your favorite motto, meguess.\n\n","date":"June 16, 2012 at 8:57 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12595","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Menemus if your are “no one”, that is your problem not mine.\n\n","date":"June 16, 2012 at 8:59 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12596","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"I am Nothing.\n\n","date":"June 16, 2012 at 9:01 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12597","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Max: Dan introduced a valuable feature to this site a short while ago called “Recent Comments”. That feature is being rendered useless by your serial posting of one liners. \nUnless you know of a way of accessing older comments without trawling back through older posts, could you please stop blitzing  the site with your largely opaque witterings and go for longer, more structured, more widely-spaced contributions. \n Have you considered setting up your own site?\n(I have another altogether unconnected reason for submitting this comment, which is to confirm that Dan has put me back again on watch (“pre-moderation”) and that last night’s block was no accident). .\n\n","date":"June 16, 2012 at 9:39 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12600","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Hahaha Colin I mentioned this same issue weeks ago, although I find Max’s comments interesting the method of his insistant bombardment is annoying. Please Max, wait to respond, write a proper paragraph ATLEAST! It would be much appreciated. AND Colin don’t feel so bad I posted a comment yesterday which was screened and took hours to appear, rendering it basically useless. Another one the day before that never showed up at all…So your not alone…Maybe there is some issues with the blog software?\nR\n\n","date":"June 16, 2012 at 9:53 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12601","author":"Ron","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"If Dan Porter wants me ou tof the blog, that’s OK with me. Is your name Danm, you old Oilscienceboiled eel??\n\n","date":"June 16, 2012 at 11:11 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12604","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Bombarding is more lively AND spontaneous…\n\n","date":"June 20, 2012 at 4:22 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12754","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Me,tioning  “A” case, Stephen John was onto your case lately. Dan Porter’s bloggers should go on Stephen Jones’ blog to see a very funny post of ST in answer to OOsBE. if need be, I’ll go on Stephen’s instead (or an  Italian, Spanish, French, Arabic etc blog) if need be. It was/is pratical to make comments in snatches while you’re working. In On pensioned/retired CB WOULD keep pouring all his muddy waters (in spite of Dan giving him restricted access), for sure, I’ll leave this blog…, Happy CBeel?\n\n","date":"June 16, 2012 at 11:31 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12605","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Hey Max, you just broke 100 comments with your last one, on this one Post! THats gotta be a record. I’m sure Dan will happy your bringing his blog view numbers up, substantially. But, for us other bloggers here it gets quite annoying when we look at ‘recent comments’ and all we see his your name 20 times! We don’t want you out of here, just want you to stop bombarding the site with sentence long posts….get it?\nThanks,\nR\n\n","date":"June 16, 2012 at 2:32 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12608","author":"Ron","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"I like bombarding. See David Mo second best bombader…\n\n","date":"June 20, 2012 at 4:19 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12752","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"I don’t like lenghty endless prose…\n\n","date":"June 20, 2012 at 4:20 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12753","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Everyman/woman to his/her taste…\n\n","date":"June 20, 2012 at 4:24 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12755","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Odd Ron, CB etc don’t ask Yannick to be more synthetical. Can they think ONLY ONE WAY? Why not restrain then the blogger to ONLY a couple of posts per theme and so on?\n\n","date":"June 20, 2012 at 4:29 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12756","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Why not restrain freedom of speech even to regular contributors to this blog then as they have too many posts per head per month/weeek?\n\n","date":"June 20, 2012 at 4:36 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12757","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Perhaps Dan is onto the case of the Demon Italicizer, whose dastardly deeds have so far not been undone. I’m wondering if I may inadvertently have been responsible – and thus back on Dan’s list of People Who Need Watching. \nBeing irritated by comments that have no reply tab, that insist on inserting someone else’s quote in its entirety, I simply wiped the quote and inserted my spiel.  I now wonder if that has left an unclosed html tag (not a standard close italics tag) that makes everything new appear here in italics.\n\n","date":"June 16, 2012 at 10:22 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12602","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"\nDavid Mo :\nDo you agree with Mr.Lavoie? Or have you another way to explain the anomalous blood trails over the hair?\n\n(Five days ago I made this question to Ironclad. I think I’ll have to answer myself.)\nI suppose you accept Mr. Lavoie transfer of the blood from hair to face. Then you have a main problem. See that:  \nhttp://www.redentoristas.org/sabanasanta/cascodespinas.htm \nEffectively. In the first image of this page may be seen as trails of blood running from right to left, up and down…on the hair! No ingenious explanation can avoid this. Lavoie, Fanti and other forgot something very simple: look at all the streams of blood. Not only that suited their theory.\nI see more problems with Lavoie explanation of bloodstains. But I thik this is enough to show that the bloodstains are painted. Remember, blood drops does not run on the hair. \nBut if the bloodstains are painted and the body image came later the conclusion suggests itself: it is also manufactured. The artificiality of the bloodstains imply the artificiality of body mark.\nSo I am certain that the image of the man of the shroud of Turin is printed by human hands. It is not natural or supernatural.\n\n","date":"June 19, 2012 at 1:59 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12691","author":"David Mo","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"I personnally don’t agree at all with Mr Lavoie’s most erroneous interpretation (tranfer of the blood hair to face).\n\n","date":"June 20, 2012 at 8:08 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12827","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"David Mo: “But if the bloodstains are painted and the body image came later the conclusion suggests itself: it is also manufactured.”\nIf that is the case, then our supposed forger/artist is a madman for no painter in his right mind will start with stains first and then draw out the image.  That is neither cost effective nor productively efficient, and would potentially undermine the work because of the risks involved.  The rarity, quality and expensiveness of the fabric alone would suggest that the alleged artist knew what he was working with, and had he failed with the correct placement of drops here or an outline of the image there, he would have squandered the whole artistic project.  Pure insanity.  We are the fools for having wasted so much time, money and energy  on a piece of trash fabricated by a genius gone zany.\n\n","date":"June 20, 2012 at 11:19 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12831","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"There are few certainties in the subject of the Shroud of Turin.One of them is that the streams of blood are painted, as I have demonstrated. Another is that we do not know the method by which the figure was printed. So it would be best not make hasty conclusions on the technique used or on the author’s mental state.\nWe’re not even sure that the body image came after the blood streams. Alternative hypotheses are possible.\n\n","date":"June 21, 2012 at 2:21 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12833","author":"David Mo","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Just guess what lurks within the letters of ANtonio LomBATTI’s name: TTALIBAN…\n\n","date":"June 20, 2012 at 4:51 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12758","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"On Examiner. com, I posted: “Just guess what lurks within the letters of ANtonio LomBATTI’s name: TTALIBAN… a Turin Shroud antiauthenticistic TALIBAN! The fact is\nAntonio is definitely not a “Shroud of Turin Expert”. Had he been a genuine one, he would not have to recur to intellectual dishonesty…unless this is just sheer ignorance of his subject of “premalediction”..\nPLEASE, DON’T LET YOURSELF BE MANIPULATED AND DISINFORMED BY (CHURCH) HISTORIAN IALIBAN ANTONIO LOMBATTI!”\n\n","date":"June 20, 2012 at 5:01 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12759","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"\nDavid Mo :\nSee my comment June 19, 2012 at 1:59 am, please.\n\nHello Mr. Mo.  I am aware of your comment.  I still cannot see how Lavoie’s work, who performed experiments with the blood flow patterns and made a case for the authenticity of the shroud, could be implicated in its denunciation.\n\n","date":"June 20, 2012 at 7:27 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12768","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"\nIronclad :\ncolinsberry: “But he was not doing good science, as that sentence you quote in bold shows.”\nI must remind you that Rogers wasn’t the only scientist working with the shroud.  The FAQ document is a summary of all the findings collected up to that point by all the scientists who were directly involved in administering the various kinds of tests that brought the shroud into the space age.  Are you saying, then, that the scientific reputation of these scientists are impugned?\nYou wrote; “A chemist who knows of the existence of hemicelluloses, and has indeed mentioned them briefly as being more reactive than cellulose, would and should not have written that sentence, referring only to cellulose.”\nAnd yet, by your own admission, this contention about not involving the hemicellulose is a moot point since, axiomatically, the color is not due to a chemical reaction within the fibers, which if it was, would have also affected hemicellulose, not just the cellulose.  This explains why further elaborations concerning the fibers were not considered.  This, this also throws asunder the other statement you made in a posting dated June 14 @ 3:12 PM, viz: “we don’t know of it’s dehydrated cellulose or hemicellulose.” The fact of the matter is that we DO know the image was not due to chemical changes of the fibers.  Bringing this up as an argument point in an attempt to reason away the ability that science has of determining which came first (the image or the blood) is a sure way of stopping any meaningful progress, and just muddies the water.\n\nAll I will say for now, looking at the language employed, is that the heavies of Shroudology are now piling in –  that much is clear.  Phrases like “throws asunder” are not those customarily employed in scientific debate. If the heavies of Shroudology wish to elicit further responses for this retired science bod, then they will need to use the language of science…\n\n","date":"June 20, 2012 at 2:09 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12797","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"colinsberry: “Phrases like “throws asunder” are not those customarily employed in scientific debate.”\nIt is appropriate if at the other end a person is deprecating the lab work of a group of scientists without any demonstrable lab work of his own as a follow-up, falsifying those experimental findings he rages against.\n\n","date":"June 20, 2012 at 3:19 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12808","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"” without any demonstrable lab work”…  ?\nSo what’s your definition of a lab, “Ironclad” ? Men in white coats? Distilled water on tap, test-tubes,  Bunsen burners…? \nWhatever gave you the idea that a lab is needed to research the Shroud?\n I have been reporting  experiments on my own Shroud blogs since Jan this year. Only once have I wished I had lab equipment – i.e. a temperature-controlled oven and maybe a uv lamp. \nWhy? Because a scientist with access to lab equipment, Paolo di Lazzaro no less, he who thinks it’s all to do with uv excimer laser beams, tried to dismiss my ‘scorching’ theory by describing his  quickie experiment with a heated euro coin and a single arbitrarily-chosen temperature that I considered too high.\nYou talk about “deprecating the work of scientists”. I am a scientist – albeit a retired one.  Scientists criticize each others work. If the scientist I criticize does not like my criticism, then he or she is free to come here and say so. Admittedly, some have sadly passed on, but if their ideas have survived, as good ideas should, then there should be disciples around ready to spring  to their defence. But I’ve yet to encounter a single disciple of a STURP scientist who is scientifically qualified, unless they are here under pseudonyms…\nMaybe you think old scientists should just fade away, like old soldiers. Sorry to disappoint you. There is still life in some of us…\n\n","date":"June 20, 2012 at 4:27 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12818","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"colinsbery: “So what’s your definition of a lab “Ironclad” ? Men in white coats? Distilled water on tap, test-tubes, Bunsen burners…?”\nI was referring to the actual scientific work done by Rogers and the other STURP members, who had the shroud in front of them, touched it, performed tests at close inspection and used instruments to arrive at the conclusions they have published for the rest of us who did not have the privilege.  As a stickler for precision and evidence, it is hard for me to accept scientific statements, that supposedly contravene these findings, made by people who have never even touched the shroud or performed rudimentary tasks as checking sample items under a microscope.\ncolinsbery: “Whatever gave you the idea that a lab is needed to research the Shroud?”\nOur discussion does not concern general research, such as history and other similar academic fields that intersect the study of this object.  We’ve been strictly dealing with the scientific facts.  Have we not?  Where did I state that only scientists should be given the key?\ncolinsberry: “I have been reporting experiments on my own Shroud blogs since Jan this year”\nWait a minute.  You’ve conducted experiments with actual shroud specimens?  The real thing?  If not, wouldn’t that compromise your results?  From what I gather, there’s nothing in this planet quite like the shroud with its image, cloth and extraneous properties.  If you are going to state that the image was the first event and then the blood stains, because of some experiment with a cloth sheet that doesn’t share the properties of the Turin shroud, any reasonable person would justifiably have reservations about whatever conclusions that experimenter was trying to reach.\n\n","date":"June 20, 2012 at 5:49 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12821","author":"Ironclad","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"Many scientists have to be content with secondary sources. Thus the imperative, indeed obligation, on the part of those with privileged access to the primary sources to record all their observations in meticulous detail, and to write up their experiments in  a detached and objective manner, not to mix fact and fantasy, and in such a way that others can establish exactly what was observed and measured. Sadly that has not always been the case. Indeed, it tends to be the exception rather than the rule… There has been massive self-indulgence on the part of some STURP members with much “begging of the question”, but that is in the past, and is no longer what occupies my mind…\nWhy not? Because all of us now have access to high-definition images of the Shroud ( a “secondary source”), and can look at those “bloodstains” and those “scourge marks” in relation to the weave, and compare with what has been written in the past. That is what I am doing at present, as well pursuing and reporting model studies (and let’s not forget that Adler, Rogers and current researchers like Paolo di Lazzaro have also reported model studies with non-Shroud material). So your attempts to marginalize me for not being a member of the STURP team  and having seen and handled the Shroud will not cause me to lose sleep.\nThis retired science bod can observe and  evaluate those secondary sources through a fresh set of eyes (sceptical eyes). I publish on my blog,  the latter being just one of millions out there. No one is obliged to read what I write, far less to believe it. It is Dan’s decision on whether or not to include me in his news gathering and blog-watching. Having my postings copied-and-pasted  here probably makes for more hits on my site, but fewer comments so is a mixed blessing so to speak.\n But you know what they say – the truth will out… Some of us soldier one without worrying too much about the flak we draw here or on other sites… This is a useful site in many ways, but is not primarily a scientific site.\nThat’s really all I wish to say to you, Ironclad. If it’s all the same to you I would prefer that this line of conversation – devoid of any concrete scientific content –  and tending towards the personal – now be regarded as closed. Thanking you in advance.\n\n","date":"June 21, 2012 at 5:32 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12851","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"One of the main arguments against Rogers’ is surely this, that he did not have the opportunity to examine the Shroud in as much detail as Mechthild Flury-Lemberg did in 2002 which is why most scholars, and even Ian Wilson, accept that on the Carbon-14 dating and the possible reweaving, his views are not to be trusted. The fullest refutations come from Mark Antonacci and can be found online. There is also the very detailed photographic evidence that failed to show any reweaving.\nThe StURP researchers only saw the Shroud for a very few hours, in very rushed conditions, not even in a laboratory and it is not at all clear how the samples they took back to the USA were conserved and protected from contamination over the years that followed. We know ,of course, that they have been passed around, starting with McCrone, and then to others. I assume that many scientists would say that they have become worthless with time because of this- once the original context is lost, as when samples are totally removed from the environment which they came from, scientific work on samples becomes very difficult. We have to be absolutely sure that there was no chance of deterioration or contamination when the samples were distributed around the STURP community. How do they monitor this?\n In addition, and this is Ian Wilson’s view, not one of the STURP scientists had ever dealt with ancient textiles before they visited Turin in 1978. Imagine doing work on the pigments of a famous medieval painting when one had never done a course on art conservation. Certainly Rogers, if Antonacci is right, had no relevant background to work in this field.\n(N.B. As you can see I am relying on what other people have written about these issues and I am happy to be corrected if I have misrepresented anyone.)\n\n","date":"June 21, 2012 at 4:44 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12844","author":"menedemus","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"David Mo wrote: “I see more problems with Lavoie explanation of bloodstains. But I thik this is enough to show that the bloodstains are painted. Remember, blood drops does not run on the hair.\nBut if the bloodstains are painted and the body image came later the conclusion suggests itself: it is also manufactured. The artificiality of the bloodstains imply the artificiality of body mark.\nSo I am certain that the image of the man of the shroud of Turin is printed by human hands. It is not natural or supernatural.”\nDavid Mo’s ignorance has no limits… He would rather read “What is the Sudarion” by César Barta and Mark Guscin, RILT n° 26. Then he would have read the most likely archaeological answer (experimentally checked by pratical simulation): \n“The physical existence of the Sudario of Oviedo and its utilisation for the pre-funeral of the man of the Shroud, would […] explain by itself the position of the hair […]. The inclination of the head of the crucified (see Pray Ms upper section miniature spy detail) makes the locks fall in front over the cheeks (on the TS). The blood leaking off the wounds produced by a crown[/headdress] mixed with sweat and dust, make a substance that gives a certain stability to the hair. A soudarion around the head, like that of Oviedo, congeals the hair in its position, and after two hours the hair takes permanent disposition, which is not easy to modify.”\n\n","date":"June 21, 2012 at 6:48 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12858","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower","post":"More than 10 day ago I asked DMo: \n“Can you please answer the following questions:\n1/do you really believe all “the signs” on the sacorphagus lid are just random decorative elements and show me any similar decorative element in Medieval Empty Tomb scene iconograpgy?\n2/ can you explain to me your conception of “spy detail” in terms of iconology applied to the comparative study of the Hungarian Pray Ms miniature third panel upper and lower registers in the light of the Turin Shroud? What should they be to be valid?\nWaiting for your answers. Thank you.”\nI am still waiting for his reply and do think I will not wait till the end of time. Can DMo  contradict himself and show how cheap & rampant is his dogmatic rationalism…\n\n","date":"June 22, 2012 at 12:00 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","id":"comment-12908","author":"Max Patrick Hamon","site":"shroudstory"}]
