[{"title":"Article on the Sudarium of Oviedo","post":"Tossed aside like a dirty rag? The author did not study the topic nor read the NT as he should have. It was a Jewish burial. if the Sudarium of Oviedo is authentic, it may have been the “cloth which was folded” and kept aside, not tossed aside, in the tomb. It had served its purpose, it was not necessary for wrapping the body, but it was folded and kept aside because it contained blood and there were Jewish laws and customs.\n\n","date":"September 11, 2014 at 9:48 pm","url":"https://shroudstory.com/2014/09/11/article-on-the-sudarium-of-oviedo/","cat":"article","id":"comment-150330","author":"Louis","site":"shroudstory"},{"title":"Article on the Sudarium of Oviedo","post":"Confusion about the Sudarium….How and Why? …\nThe skeptics obviously have not taken the time to study deeply into the subject. Why would they assume the Sudarium would still be over the face during burial and /or covered by the Shroud? ..There’s no evidence for this anywhere, not in scriptures, not in the Talmud, no where!….so why is it even assumed? Scriptures state it was in a place by itself, away from the burial cloths, not with the burial cloths.\nOn the other hand, if one was to study fully the Sudarium of Oviedo, which claims with good reason to be the ‘face cloth’ folded in a place by itself, and there is much evidence that suggests it to be just that. With study, one would find the very intense studies done to date on the Sudarium of Oviedo would suggest it was placed on the head whilst Jesus was still on the cross and removed before the final burial/ wrapping occurred.\n\n","date":"September 12, 2014 at 12:50 am","url":"https://shroudstory.com/2014/09/11/article-on-the-sudarium-of-oviedo/","cat":"article","id":"comment-150365","author":"Ron","site":"shroudstory"},{"title":"Article on the Sudarium of Oviedo","post":"To Ron:  I’m not a skeptic.  Of course the sudarium was taken off and set aside before covering Christ’s body with the shroud.\n\n","date":"September 12, 2014 at 6:53 am","url":"https://shroudstory.com/2014/09/11/article-on-the-sudarium-of-oviedo/","cat":"article","id":"comment-150433","author":"Ashton","site":"shroudstory"},{"title":"Article on the Sudarium of Oviedo","post":"Sorry I wasn’t talking to the article, but to the comment below. I believe was written by Dan.\nRon.\n\n","date":"September 16, 2014 at 10:09 am","url":"https://shroudstory.com/2014/09/11/article-on-the-sudarium-of-oviedo/","cat":"article","id":"comment-151449","author":"Ron","site":"shroudstory"}]
