[{"title":"The Sudarium of Oviedo as Evidence?","post":"I’m sorry/not sorry but when I was first convinced of the reality of the Shroud I did not see coins covering the eyes.  All I can do now is when I kind of stare at the Shroud of Turin picture , I ask myself “are there coins there ?”, to me it is just not a coins over eyes image. I’m not saying they are not there, I just don’t see them.\n\n","date":"February 12, 2015 at 4:26 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190782","author":"ekmcmahon","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"More work and cooperation between Shroud groups is needed to do the job correctly.\n\n","date":"February 12, 2015 at 5:24 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190790","author":"Louis","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Dan:\nCan anyone really say the stains show typical Jewish features? I’m open to being convinced.\nMichael Hesemann in his popular book “Das Bluttuch Christi” describes anthropometric reasearch of professor Jose Antonio Sanchez. According to him, the face parameters of “Sudario Man” are as follows:\nFace height: 139 mm\nTotal nose length: 80 mm\nThe length of the bridge of the nose: 60 mm\nThe nose width :25-30 mm\nThe height of the tip of the nose: 21 mm\nAccording to him the typical values of Spain are:\nFace height: 126.55-130 mm\nThe length of the bridge of the nose: 51.18-54 mm\nThe nose width :32-35 mm\nThe height of the tip of the nose: 15-18 mm\nSo according to him, it is unlikely that “Sudario Man” was of Spanish origin -more likely Middle-Eastern, semitic origin.\n\n","date":"February 12, 2015 at 5:31 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190791","author":"O.K.","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"And also:\nMatching coins and matching bloodstains is something different altogether.\nMoreover, I am convinced by other evidence that those coin images that supposedly match coins, do not exist on the shroud. That makes those points of congruence seem meaningless. So why are the bloodstains POC any different?  \nBecause, contrary to the ghostly coin images, which may be real or just illusion of random noise patterns, the bloodstain certainly exist on both cloths. So they can be compared on each other to see if they match (and according to guys who made such comparison, they match).\n\n","date":"February 12, 2015 at 5:36 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190793","author":"O.K.","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"As usual with Sudarium articles, it is remarkably difficult to check any of the alleged forensic findings. Whatever one may think of the conclusions of Heller, Adler, Schwalbe, Rogers or others of the STuRP team regarding the Shroud, as least we know what they did to arrive at those conclusions. With the Sudarium, from the composition of the stains (pleural fluid? really?) to their origin (marks of fingers? really?) to the pollen (quercus calliprinos? really) to the radiocarbon datings, very little of the primary investigation is available.\nI could only check one sentence. “The pollen quercus caliprimus was found, being limited only to the area of Palestine.” There is no such species nor ever has been. Either the author of the article got it wrong, or the authors of his sources got it wrong, or the original identifier got it wrong, which casts doubt upon his authority. What they all meant, I’ve no doubt, was Quercus calliprinos, which although commonly called the Palestine Oak, is native throughout the middle east and south-west Asia, and is certainly not “limited only to the area of Palestine.”\nAs for the ‘points of congruence’ game, it is invariably forgotten that ‘points of non-congruence’ must also be taken into account. Take any two random scribbles and overlay them and there will be dozens of ‘points of congruence’. It is only by demonstrating that there are no ‘points of non-congruence’ (or at least be explaining why they can be ignored) that any identification can be made.\nBecause of the lack of sources I don’t really know what to make of the Sudarium, which is why I rarely comment on it, but this article is so clear and authoritative that it is necessary to ask how much is based on speculation, and how much can be verified independently.\n\n","date":"February 12, 2015 at 5:55 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190797","author":"Hugh Farey","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"As usual with Sudarium articles, it is remarkably difficult to check any of the alleged forensic findings. Whatever one may think of the conclusions of Heller, Adler, Schwalbe, Rogers or others of the STuRP team regarding the Shroud, as least we know what they did to arrive at those conclusions. With the Sudarium, from the composition of the stains (pleural fluid? really?) to their origin (marks of fingers? really?) to the pollen (quercus calliprinos? really) to the radiocarbon datings, very little of the primary investigation is available.\nI agree that primary sources in case of Sudarium are hardly available, yet we have a lot of reliable secondary sources providing essential information. Check \nComparative Study Of The Sudarium Of Oviedo And The Shroud Of Turin from\nIII Congresso Internazionale Di Studi Sulla Sindone, Turin, 5th To 7th June 1998: \nhttp://www.shroud.com/heraseng.pdf\nAlso there is a book by Janice Bennett, Sacred Blood, Sacred Image, although little confused at times:\nhttp://books.google.ca/books?id=fU1J4So7OL8C&printsec=frontcover&hl=pl#v=onepage&q&f=false\nI also have similar book by Hesemann. There are also some papers about Sudarium as well.\nFinally there a few documentaries about Sudarium:\n\nThere is also excellent Spanish documentary on the topic, including interviews with primary reasearchers:\n \nI have a polish version of this documentary, and it s really a treasure!\nhttp://gloria.tv/?media=137213\n\n","date":"February 12, 2015 at 7:44 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190812","author":"O.K.","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"They must be referrencing quercus calliprinos. But…\nIt’s really hard to do an assessment on how reliable a report is when they publish and re-publish a typo. At the very least it shows that no botanist was involved.\n\n","date":"February 13, 2015 at 7:21 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190973","author":"Eric","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"* referencing\nOh, the irony.\n\n","date":"February 13, 2015 at 7:22 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190974","author":"Eric","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Shall I repeat, forensically speaking BOTH typological AND accidental characteristics (whether it be just bloodstains or coin blood decals) have to be taken into account to REALLY build a crucial/gun smoking evidence. \nPersonnally, I haven’t studied the TS in light of the OS yet but did study and analyze configurations of very tiny bloodstain patterns (about 0.4-0.8 mm high) recorded at right and left eyesocket and eyebrow level. In light of two eidomatic reconstructions of two  Roman colonial coin obverses (Pilate coins struck in the regnal years of Tiber), at least two of the tiny haematic configurations at right and left eyesocket level did prove to be VERY GOOD (if not perfect) matches (one at scale nearly 1:1; another at scale 3/4 due to subsequent slight shrinking of the stretched textile receiving surface) in terms of both TYPOLOGICAL and current ACCIDENTAL characteristics evidenced by extant (existing/available) coins.\n\n","date":"February 12, 2015 at 7:19 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190809","author":"Max patrick Hamon","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Hugh:\nAs for the ‘points of congruence’ game, it is invariably forgotten that ‘points of non-congruence’ must also be taken into account. Take any two random scribbles and overlay them and there will be dozens of ‘points of congruence’. It is only by demonstrating that there are no ‘points of non-congruence’ (or at least be explaining why they can be ignored) that any identification can be made.\nBut the point is that bloodstains on the Sudarium surely are not random. Thus the POC approach is fully valid. Because if you can find enough number of POCs you have a very good chance (approching certainty) that there is some direct correspondence between the two objects. And any ‘points of non-congruence” are then just nothing but the ‘random noise’ blurring the picture a little bit -but not invalidating the amin conclusions.\n\n","date":"February 12, 2015 at 7:56 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190814","author":"O.K.","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Biometric systems for human recognition are very interesting…\nobviously you must extract facial features from the Sudarium of Oviedo\n(and, if I am right, this is not too easy to do…).\n— — —\nIn any case “Facial feature extraction” consists in localizing the most\ncharacteristic face components (eyes, nose, mouth, etc.) within\nimages that depict human faces.\nI believe that we can try to measure :\n-Distance between the eyes\n-Width of the nose\n-Distance between nose and mouth\n-Height and Width of forehead and total face\nand then we can apply the comparison\nWhen we have to do with religious art representations (in comparison with the TS and Sudarium of Oviedo) we can use PCA (= Principal Component Analysis).\nThe same can be performed on numismatic field (see also: prof. Giulio Fanti and his “numismatic dating”).\nAs I wrote in the past, in the book (2014) by Giulio Fanti the Byzantine coins of Justinian II of 692-695 were reevaluated to better understand the influence of the Shroud image.\nProf. Eng. G. Fanti in his own book used nose/eyes ratio…\n… and then Barrie Schwortz rejected “Freeman’s claims” and indicated the numismatic proof about the early coins (= byzantine coins, IMO).\nAnd, if I’m not mistaken, you have never considered this simple fact.\n— —\nPerhaps you can improve the discussion reading the paper:\n“Facial Feature Extraction and Principal Component Analysis\nfor Face Detection in Color Images”\nLink:\nhttp://doras.dcu.ie/285/1/lncs_3212.pdf\nAbstract.\n>A hybrid technique based on facial feature extraction and\nPrincipal Component Analysis (PCA  =  PCA is a useful statistical technique.\nSee also: http://en.wikipedia.org/wiki/Principal_component_analysis ) is\npresented for frontal face detection in color images.\nFacial features such as eyes and mouth are automatically detected based on properties of the associated image regions, which are extracted by RSST color segmentation. While mouth feature points are identified using the redness property of regions, a simple search strategy relative to the position of the mouth is carried out to identify eye feature points from a set of regions. Priority is given to regions which signal high intensity variance, thereby allowing the most probable eye regions to be selected. On detecting a mouth and two eyes, a face verification step based on Eigenface theory is applied to a normalized search space in the image relative to the distance between the eye feature points.\nIt’s useful the use of a facial feature extraction step prior to performing\nPCA analysis…\n— — —\nI have found another paper:\n“An application of caricature: How to improve the recognition of facial composites”\nCharlie Frowda, Vicki Bruceb, David Rossc, Alex McIntyrec & Peter J. B. Hancockc\nat pages 954-984 of “Visual Cognition”, Volume 15, Issue 8, 2007 \nLink:\nhttp://www.tandfonline.com/doi/abs/10.1080/13506280601058951\nAbstract\n>Facial caricatures exaggerate the distinctive features of a face and may elevate the recognition of a familiar face. We investigate whether the recognition of facial composites, or pictures of criminal faces, could be similarly enhanced. In this study, participants first estimated the degree of caricature necessary to make composites most identifiable. Contrary to expectation, an anticaricature was found to be best, presumably as this tended to reduce the appearance of errors. In support of this explanation, more positive caricature estimates were assigned to morphed composites: representations that tend to contain less overall error. In addition, anticaricaturing reduced identification for morphed composites but enhanced identification for individual composites. Although such improvements were too small to be of value to law enforcement, a sizeable naming benefit was observed when presenting a range of caricature states, which appeared to capitalize on individual differences in the internal representation of familiar faces.\n— — —\nHere a question:\nIs the caricature a key to understand the strange Manoppello’s Veil?\n— — —\nHere (obviously) I have kept aside the controversial issue of the two\nancient Roman coins (… that with the Sudarium of Oviedo have nothing to do !!!).\n\n","date":"February 12, 2015 at 8:45 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190820","author":"piero","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Comparing the cloths…\n>The Trappist nun Blandina Paschalis Schloemer, a German pharmacist and icon painter, recognized congruities of the facial features on the sudarium of Manoppello and on the shroud of Turin. Using points of alignment, she developed a technique of superimposition, and based on the congruities found, she was able to prove that the images on both cloths were of the same person. Later she applied this technique to the sudarium of Oviedo with the same result.\nlink:\nhttp://www.sudariumchristi.com/uk/tomb/compare.htm\nBut there is no statistical work (using PCA) on artistic religious images …\n\n","date":"February 13, 2015 at 8:59 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190930","author":"piero","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Thanks for the references, OK, but I can’t really agree with your statement “But the point is that bloodstains on the Sudarium surely are not random.” How, after all, can you tell? If the ‘points of congruence’ argument is used to establish that the two cloths are related, you have to start with the premise that there is no relationship, and show that that premise is wrong. If you start by assuming the two cloths are related, then of course you are likely to find the points of congruence more telling than the points of non-congruence. However, as I said, it is not easy to discuss this without a clearer indication of what, exactly, the 120 or so points of congruence actually are. Is there a diagram of them? Who counted them up?\n\n","date":"February 12, 2015 at 10:21 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190825","author":"Hugh Farey","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"I missed the collection of measurements by professor Jose Antonio Sanchez quoted by Michael Hesemann earlier, but it epitomises my point of view.  As quoted the comment is bordering on absurd. The ‘typical’ measurements of a Spanish man? Are all Spanish men ‘typical’, or are any Spanish men who are not typical also not Spanish? What are the measurements of a ‘typical’ Jewish man, or a ‘typical’ inuit for that matter.\nI trust that Prof. Sanchez actually reported his findings as a range of measurements, and probably in terms of proportion rather than absolute size, as larger people might be expected to have different measurements but in similar proportion if there is truly a racial stereotype. But all we have here is that the Sudarium face is 139mm, and a typical Spanish face is 127-130mm, therefore the Sudarium man is probably middle-eastern. What about Norwegian? What is their national stereotype? Or Brahmin? Or Inuit? Or Bantu? As quoted, Michael Hesemann is far from convincing.\n\n","date":"February 12, 2015 at 12:12 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190838","author":"Hugh Farey","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Reported with conviction & certainty but scientifically nowhere close to a slam dunk.  The ball is still being passed around at mid- or full-court, take your pick.  Agreeable blood type, agreeable blood patterns, to scientifically conclude this involves the same person, is at best, circumstantial.  Comparison of a DNA consensus profile for each, if obtainable, would be the best chance towards supporting such a conclusion.\n\n","date":"February 12, 2015 at 2:25 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190847","author":"Kelly Kearse","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Hugh:\nI missed the collection of measurements by professor Jose Antonio Sanchez quoted by Michael Hesemann earlier, but it epitomises my point of view. As quoted the comment is bordering on absurd. The ‘typical’ measurements of a Spanish man? Are all Spanish men ‘typical’, or are any Spanish men who are not typical also not Spanish? What are the measurements of a ‘typical’ Jewish man, or a ‘typical’ inuit for that matter.\nTypical, that means that anthropometric parameters measured on Sudarion of Oviedo are much closer to semitic than Spaniard average. It is not absolute evidence by any means -simply another clue, which cannot be simply disregarded.\nHow, after all, can you tell? If the ‘points of congruence’ argument is used to establish that the two cloths are related, you have to start with the premise that there is no relationship, and show that that premise is wrong. If you start by assuming the two cloths are related, then of course you are likely to find the points of congruence more telling than the points of non-congruence. \nThe fact that the bloodstains on Sudarium are not just random has been convincingly shown by forensic analysis by Spanish specialists. They described in detail their origin and way in which they were made. They were able to associate those stains with appropraite face features like nose, mouth and forehead. Thus those are not just random stains of spilled blood like in the Rorschasch test, but have their own forensic explanation.\nStarting with this, the method of counting congruence points with the Shroud absolutely makes sense. First you must check whether there are any characteristics that exclude common origin with the Shroud (there are none). \nThen you set up your null hypothesis: the both cloths have nothing in common and similar bloodstains on both are result of purely accidental coincidence\nThen you start looking for POCs. The more (non-trivial) you find, the more unlikely is your null hypothesis (that the cloths are unrelated). If you can find enough POCs you can reject your null hypothesis and accept that the both cloths are related, that means they covered the same face.\nHowever, as I said, it is not easy to discuss this without a clearer indication of what, exactly, the 120 or so points of congruence actually are. Is there a diagram of them? Who counted them up?\nThe 120 POCs (70 for the fron, 50 for the back) references goes to Whanger and his polarized images overlay technique. Unfortunately I have found no independent confirmation of that. Had I possesed enought resolution Sudarium images, I would try to verify this myself (but unfortunately I don’t have them). Anyway if just a dozen (10 % of Whanger claims) gets confirmed, than this would be enough to confirm direct relation between Sudarium and the Shroud. And although I don’t believe that all POCs claimed by Whanger are in fact valid, neither I believe that  more than 90 % of them are just the result of his imagination.\n\n","date":"February 12, 2015 at 3:10 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190852","author":"O.K.","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Kelly:\nReported with conviction & certainty but scientifically nowhere close to a slam dunk. The ball is still being passed around at mid- or full-court, take your pick. Agreeable blood type, agreeable blood patterns, to scientifically conclude this involves the same person, is at best, circumstantial. Comparison of a DNA consensus profile for each, if obtainable, would be the best chance towards supporting such a conclusion.\nComparison of DNA cannot prove that the cloths belonged to the same person!!! There is still a chance that they belonged to twin brothers!\nThis was of course a joke. But seriously, what evidence do you need to “scientifically” conclude that hose two cloths belonged to the same person?\nWhat we have here are two cloths with bloodstains on their surface.\n* Both belonged to crucified men, with beard and mustache.\n* Both crucified had something resembling Crown of Thorns on their heads.\n* Both crucified had the same blood type, AB, belonging to the 5 % of of the population, according to the indications of blood type tests.\n*Both men had their heads banked to the right after their death (there is 50 % chance for such coincidence).\n* Both men had identical, or at least very similar face features, as indicated by blood patterns on Sudarium.\nThat’s only a few from the list of mutual coincidences.\nNo, Kelly. We don’t need DNA to prove that those two cloths belonged to the same person.\n\n","date":"February 12, 2015 at 3:31 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190854","author":"O.K.","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"OK wrote:\n“But seriously, what evidence do you need to “scientifically” conclude that hose two cloths belonged to the same person?”\nFor me, it would take (much) more than the mutual coincidences listed to form a hard, scientific conclusion. That would be the type I’d be interested in.\n\n","date":"February 12, 2015 at 4:01 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190857","author":"Kelly Kearse","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Kelly.\nIf you are researcher, you must be very careful and doublecheck yoyr results to be cerain about your conclusions and avoid making erroneous and pretentious claims. But on the hand, if you are too cautions, have too much unnecessary doubts and useles considerations “what if”  or simply too shy to proclaim something, you will discover nothing.\nSo Kelly (and Hugh), what is the alternative scenario? If two cloths are unrelated to each other?\n\n","date":"February 12, 2015 at 4:13 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190862","author":"O.K.","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"OK,\nSee previous comments-my belief still stands.\n\n","date":"February 12, 2015 at 4:58 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190864","author":"Kelly Kearse","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Kelly.\nYou haven’t answered my question: what is the alternative scenario to the two cloths covering the face of the same man?\n\n","date":"February 12, 2015 at 5:07 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190867","author":"O.K.","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Some useful research has been done, however more is needed.\n\n","date":"February 12, 2015 at 5:02 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190866","author":"Louis","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"OK,\nThe alternative scenario is the cloths covered two different people or one (or both) was created to appear as though they covered a body/face.  Sorry, not much time for a blow by blow debate on this.  I believe there is some congruence in the bloodstain patterns-key word “some”-I also think the AB designation for both only takes you so far-bear in mind, I believe this (AB) on either needs to be verified by additional experimentation (methods).  Forward typing says AB, yes, but there are limitations.  This is the antithesis of being shy, it’s a desire to be critical & objective.  The most definitive call would be comparative DNA analysis, if doable, the rest is circumstantial-and don’t confuse circumstantial with meaningless or trivial-that is not what I am implying.\n\n","date":"February 12, 2015 at 5:27 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190869","author":"Kelly Kearse","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Kelly:\nThe alternative scenario is the cloths covered two different people or one (or both) was created to appear as though they covered a body/face.\nSo the alternatives scenarios are:\n1.) one or both cloths was created  to imitate the other in ancient/medieval times -when obviously there was neither knowledge nor abilities to create such close imitation, withstanding modern scrutiny.\n2.) The two clothes covered two distinct bodies with following features:\n* Both belonged to crucified men, with beard and mustache.\n* Both crucified had something resembling Crown of Thorns on their heads.\n* Both crucified had the same blood type, AB, belonging to the 5 % of of the population, according to the indications of blood type tests.\n*Both men had their heads banked to the right after their death (there is 50 % chance for such coincidence).\n* Both men had identical, or at least very similar face features, as indicated by blood patterns on Sudarium.\nTwo distinct men, two distinct corpses, by pure accident having so many common traits! An unbelievable coincidence!\nReminder: both clothes are burial cloths. Both were preserved for some reason. And both have been claimed to belong to the very same person: Jesus of Nazareth. So there are even more coincidences (and I even haven’t started  counting points of congruences between bloodstains and images on both cloths).\nDo you really think that Sudarium of Oviedo was just an ordinary bloodied napkin, found somewhere in the dump, and it eventually turned up having so many correspondences with the Shroud of Turin just by pure accident?\nThe most definitive call would be comparative DNA analysis, if doable, the rest is circumstantial-and don’t confuse circumstantial with meaningless or trivial-that is not what I am implying.\nKelly.\nDNA analysis is, in principle, circumstantial evidence as well. It bases on premise that chances for false positive match of DNA code is so small (1 in 14 bilion or so), that it can be ignored in most cases, and treated as direct evidence. But I would like to ask what is in fact stronger evidence, a DNA match solely on its own -or such incredible chain of coincidences described above?\n\n","date":"February 12, 2015 at 6:03 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190872","author":"O.K.","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"I bet there are layers and layers of DNA on the Shroud. Countless people over the last 700 or 2000 years have touched the Shroud and they may have left their DNA on it to mix with other DNA already there. And there would be degraded DNA on it too. \nYou touch something and you transfer DNA. How do you propose to separate all the DNA?\nhttp://www.ncbi.nlm.nih.gov/pubmed/23623709\nPS If the persons touching it has any pollen on them that can be transfer too.\n\n","date":"February 19, 2015 at 5:46 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-191371","author":"John Green","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"There is one big problem in Shroud studies. It is people blowing their tops when flaws are detected in their research. How far will that get us?\n\n","date":"February 12, 2015 at 6:05 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190873","author":"Louis","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"“But I would like to ask what is in fact stronger evidence, a DNA match solely on its own -or such incredible chain of coincidences described above”\nI think it’s fair to say that different people have different opinions on the matter.  I’ll just leave at that.\n\n","date":"February 12, 2015 at 8:20 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-190885","author":"Kelly Kearse","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Interesting.\n\n","date":"February 15, 2015 at 8:29 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-191159","author":"Andy","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Hold on, there will be more about the topic shortly.\n\n","date":"February 18, 2015 at 5:59 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-191351","author":"Louis","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"JG wrote: “I bet there are layers and layers of DNA on the Shroud. Countless people over the last 700 or 2000 years have touched the Shroud and they may have left their DNA on it to mix with other DNA already there. And there would be degraded DNA on it too.\nYou touch something and you transfer DNA. How do you propose to separate all the DNA?\nhttp://www.ncbi.nlm.nih.gov/pubmed/23623709\nPS If the persons touching it has any pollen on them that can be transfer too.”\nJohn,\nMy reply is rather lengthy.  I have broken it up into several parts.\nMy comments: \n1. I would agree there is both contaminating & degraded DNA on the Shroud.  I also agree that both issues could be challenging.  In my original reply to OK I said “The most definitive call would be comparative DNA analysis, if doable…”.  When asked in a hypothetical situation, which is more telling, the fact that two people both have a beard & a mustache and/or even share the same blood type versus a comparative DNA analysis between the two, to me, there is no contest.  \nIn the previous context, considering that all four Beatles at one time had beards & mustaches, the strongest piece of scientific evidence on the “amazing list of circumstances” was the same blood type.  Even with shared blood type, albeit one that is the least represented in the population (~5% currently), this can only take you so far, you are still unable to reach a solid, scientific conclusion that the same individual is involved.  In my view, DNA analysis, would be the most definitive way to begin to extend this beyond circumstantial.  Numerous artifacts could share the same the same blood type (AB) and still be unrelated.  It would be much more difficult to understand how two unrelated artifacts would share the same DNA profile (see below comments).  \n2. All of the above, of course, hinges on your main point, “how do you propose to separate all the DNA”?  It could be a very challenging issue.  Perhaps one advantage the bloodstains may have is that samples could be taken from beneath the surface, or even from the reverse side (beneath the surface), to help minimize contamination (as well as disturb the appearance of the cloth).  Samples would have to be taken from multiple bloodstains for any type of meaningful comparison.  The latter is a minimum for trying to determine if any consensus profile sequences could be achieved.  Maybe it could be done, maybe it couldn’t.   \nDegradation could be very challenging-it would be important to consider both mitochondrial & nuclear DNA analysis.  The sensitivity and capabilities of molecular biology techniques has significantly advanced within the past two decades-DNA analysis (on either artifact) could potentially extend the current information in a way that other methods/techniques cannot.\nMaybe it could be done, maybe it couldn’t-there are certainly no guarantees. \nSuch methods also offer the potential to confirm the AB blood type , to look at if certain bloodstains were touched up throughout the years (heterogenous), and if blood from other species (in addition to primate/human) is present on either cloth, among other things. For more details, if interested see: https://www.shroud.com/pdfs/kearse3.pdf\n3. Contamination is a major consideration.  I raised this issue several years ago to temper the oft-promoted selling point for authenticity that “Human DNA has been found on the Shroud”.  (DNA from a human male, no less).  This is related to another major challenge that exists: to demonstrate that there is DNA on the Shroud that originates from bloodstains, as opposed to contaminating skin cells.   I have written about this previously.\nFor more details, if interested see: https://www.shroud.com/pdfs/kearse2.pdf\nIn my opinion, one has to at least consider bringing more modern technology into the discussion, even if it is hypothetical.  If you don’t look, you don’t know.  Even knowing (from empirical data) that degradation and/or contamination is too vast a limitation, is in my mind, progress.  There are only so many times you can retread a tire and repeat the same points from previous studies, again & again (& again).\n4. Finally, bear in mind, with any of this, I am not a DNA expert.  I don’t consider myself an expert on anything.  Like most scientists active in any aspect of cell biology in the 80s and beyond, I have had some experience working with DNA.  It is not that uncommon-I collaborated with others (molecular biologists) for the heavy lifting.  The oldest artifact I ever worked on were cells that had been growing for three weeks in my incubator.  I continue to read scientific journals weekly, stay in touch with various colleagues, and follow certain lines of interest.  These are simply my thoughts.\nI trust that God knows what He’s doing with either of these cloths.  Perhaps studies will continue at some point in the future.  Perhaps they won’t.  As a scientist who happens to be a Christian, and a Christian who happens to be a scientist, the subject is a unique & intriguing mix.  I’m okay either way it goes.  If the Shroud were ever conclusively determined to be non-authentic, I would find it ironic that the hand of a forger could be the instrument to summon so much attention to the message of Christ’s redemption for mankind.  To me, that’s the most important thing about the cloth, no matter where one stands on authenticity.\n\n","date":"February 19, 2015 at 9:54 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-191385","author":"Kelly Kearse","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Kelly,\nThanks for your thoughts on this and I agree with what you wrote. \nI’m no expert on this either. I have more questions than answers. In fact every time I pick up a book on science, the bible or philosophy I go in with maybe have 3 questions and by the time I’m finished I may have 1 answer and 20 new questions.\n\n","date":"February 20, 2015 at 8:03 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-191431","author":"John Green","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Kelly, Personally I’m committed to authenticity.  But your last paragraph is the most succinctly sensible approach I’ve seen here in a very long time.  I love your touch of irony.  Meantime the rest of the clowns of whichever ilk will continue to dogmatize and entertain.\n\n","date":"February 20, 2015 at 1:54 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-191438","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"When asked in a hypothetical situation, which is more telling, the fact that two people both have a beard & a mustache and/or even share the same blood type versus a comparative DNA analysis between the two, to me, there is no contest.\nIn the previous context, considering that all four Beatles at one time had beards & mustaches, the strongest piece of scientific evidence on the “amazing list of circumstances” was the same blood type. Even with shared blood type, albeit one that is the least represented in the population (~5% currently), this can only take you so far, you are still unable to reach a solid, scientific conclusion that the same individual is involved. \nKelly, I think this is misrepresentation of the problem. \nAll four Beatles had beards & mustaches at one time point, and so had both Shroud Man and Sudario Man, whether identical or not. But the problem is much more complex. \n1. Both cloths (Shroud and Sudarium) beloged to crucified men. Fine, but there where many crucified individuals in history, and the fact that we have two cloths (and only those two cloths!) belonging to the victim(s) of crucifixion does not prove that there was one and the same person involved … yet. But…\n2. Both cloths covered the face of the individual(s) that was apparently crucified with Crown of Thorns. There is only one recorded instance of the crucifixion combined with Crown of Thorns torture: Jesus of Nazareth. But of course this still does not prove antything… yet! Maybe there were several other crucifixions with the use of crown of thorns that went unrecorded? Maybe… but they couldn’t have been frequent. So how many? 1/100 crucifixions applied crown of thorns, or similar torture instrument? 1 in 1000? Yet we have, (by pure accident, sceptics would claim) two cloths that covered the face of crucified and crowned with thorns.\n3. Test on both cloths indicate blood type AB. Only 5 % of world population has such group (18 % Sephardi Jews). Fine, this reduces the chance for coincidence 20 times (or only 5 if we assume that the cloths belonged to crucified Jew(s)). But of course this still does not prove anything… Maybe the tests were false positives due to contamination (amazing accident) or maybe we just found in the dump two cloths belonging to individuals with AB group. There are still such possibilities. \n4. Both cloths belonged to individuals that had their heads bowed to ther right after death. Fine, this still does not prove anything, but there is 50 % chance for such coincidence…\n5. Both crucified individuals had their right cheek swollen to much greater extent than left. Another interesting coincidence. Or maybe it is something we should have expected, because Jews considerd the right side as pure, and left as unclean? So that would be explanation, but of course the price is that we should assume that both Shroud and Sudario Men were beaten by Jews. \n6. The facial features on both cloths (nose and face lenght, width etc.) are fully comparable. So both individuals had very similar features. Of course this does not prove anything -there are many different people with similar facial features -but that’s another similarity…\nAnd so on, if we make more studies of those both cloths we perhaps find more coincidences.\nBut according to you, Kelly, this still isn’t evidence….\nSo according to you, Kelly, perhaps we may have heree two cloths belonging to two different individuals, but who were both severly beaten in their right cheeks, both were crucified and tortured with Crown of Thorns (we haven’t checked the correspondence of wounds yet), both had the same blood type, both had fully comparable face features, both had their heads banked to the right after death and so on…\nDo you really believe that this wheel within a wheel may be just accidental? Or do you need DNA tests to make ANY conclusions?\nOne another thing about DNA, what if we extract them and the results turn different? Do you reject the identity of both Shroud and Sudario Men then, because the DNA comparison is the only real (and not circumstantial ) evidence for you (just like C-14 for the sceptics, at least till they turn in their favor)?\n\n","date":"February 20, 2015 at 3:08 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-191441","author":"O.K.","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"The responses to questions 9 and 10 in the following interview are optimistic when it comes to Turin Shroud DNA, both plant and human. Of course, the pro-authenticity stand is not a result of this, the optimism lies in refining the finds.:\nhttps://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\nMy doubt lies in what Professor Frank Tipler, a Jewish convert to (conservative) Catholicism has said, found in the last line of response 10. He has gone further and is said to be a brilliant scientist, however his books sparked controversy in scientific circles.\n\n","date":"February 20, 2015 at 6:43 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-191449","author":"Louis","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Worth noting that Tipler’s proposal of a XX male genotype (as opposed to XX representative of a typical female) is from a report that also included analysis of 4 other genes from locations other than X and Y chromosomes.  These results, performed in the same study, indicate that there are six more alleles (forms of a gene) present than could be accounted for from a single individual.  The maximum for 4 genes would be 8 alleles, since a single person has only 2 copies of each of these genes.  Such findings indicate contamination, a point the authors, themselves mentioned.\n\n","date":"February 20, 2015 at 8:31 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-191452","author":"Kelly Kearse","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Although it is not explicitly stated in the interview the implication was that what Professor Frank  Tipler stated could confirm the Virgin birth.\nWell, Professor Tipler was strongly influenced by Wolfhart Pannenberg, which paved the way for his conversion to Christianity, specifically Catholicism. The emphasis was on the Resurrection of Christ and history as a form of Revelation — which is also what led Heidegger back to Catholicism! — and importance was laid on ancient apolcalyptic texts, both Jewish and Christian. It was the latter that generated criticism.\nI have not read what exactly Professor Tipler wrote, however my doubt arises because he is a physicist, well-versed in theology. Would his interpretation of the DNA be correct?\n\n","date":"February 21, 2015 at 10:05 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-191486","author":"Louis","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"OK,\nSorry, bud, sticking to my guns.  There is some major misconstruing of ideas/intent, but you’ll have to try me in abstentia-would rather spend my time on other things\nOh, by the way, I would suggest considering decaf.\n\n","date":"February 20, 2015 at 9:02 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-191455","author":"Kelly Kearse","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Kelly.\nTo the point.\nDid those two cloths belonged to the same person or not? Can we determine this already given all our knowledge (without involving DNA analysis, given all problems with decayed DNA and possibility of contamination)? Yes or No.\nWhat are the odds for the opposite conclusion (that these two belonged to different persons)? Can you give any rationale for that?\nAs far as I know DNA identification is made through finding a dozen or so identical independent DNA markers. Essentially looking for points of congruence (so in fact this is merely circumstantial technique, basing on the concept of improbability of exact match). So  the principle is virtually the same as face matching; we are looking for corresponding details. Can we then say that there is an advantage of DNA match over other methods of identification? Or maybe in different words: that only DNA match is valid, and other techniques cannot give ‘definite’ answer?\n\n","date":"February 21, 2015 at 6:19 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-191472","author":"O.K.","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Louis,\nI read Tipler’s book a couple of years ago, TPOC (from my local library), here is the relevant passage (which I selected & pasted from another website), fellowship of the minds.com, that showed up in a Google search:\n“Here is Dr. Tipler’s account (from pages 183-187 of his book):\nNormally, the results of a DNA test of the blood on such a famous object would be published in English in a major scientific journal. … Not so the results of this DNA test. The results were published, in Italian, in the very obscure Italian journal devoted to the study of the Turin Shroud. Furthermore, only the raw data were published. That is, the Genoa team published black-and-white Xerox copies of the computer output of the DNA analyzer. This is never, never done. Always, the data are presented in a neat table or figure, and they are accompanied by a discussion of their significance. The Genoa team made no effort to interpret their data.\nBut I was able to interpret the data at once. They are the expected signature of the DNA of a male born in a Virgin Birth! … \nThe Turin Shroud data show 107 (106+1) but not trace of a 112 base pair gene. The Oviedo Cloth data show 105 (106-1) but no trace of a 112 base pair. The X chromosome is present, but there is no evidence of a Y chromosome. This is the expected signature of … virgin birth, the XX male generated by an SRY inserted into an X chromosome. It is not what would be expected of a standard male.\nOther explanations are possible. The DNA analyzed could be entirely contamination from people who later touched the Shroud and the Cloth. But we have witnesses that men touched the two samples also, and it seems incredible that no trace of male contamination would be seen…. Another possibility is that the Turin Shroud and the Oviedo Cloth are fakes and that the fakes used real blood from males they knew were born of virgins. This possibility, in my opinion, has zero probability.”\nYou asked, Would his interpretation of the DNA be correct?\nMy comments: \n1. The basis for the standard chromosomal sex determination is evaluation of the amelogenin gene, which is present on both X & Y chromosomes.  In the X, a 106 base pair version exists, in the Y, a 112 base pair version is found.  This difference in length is the basis for sex determination: in typical females (XX) only the 106 signal is seen; in males (XY), both 106 and 112 versions are detected.\n2. Tipler proposes that Jesus was XX, with portions of genes from a Y chromosome inserted into the X.  Specifically, the SRY gene (unrelated to amelogenin), which stands for Sex determining Region gene on the Y chromosome, plus he suggests a few other Y specific genes may have been inserted as well.  \n3. The findings which Tipler is referencing report only a 106 signal, although the same group (Canale) would also state they found “male DNA with traces of female DNA after tests of two threads of the cloth” p 250 in “Enigma of the Shroud” by Petrosillo & Marinelli (1996), ref 7, CHI no 30, August 4, 1995, p 94-97.  So, there is contradiction even there.  As previously noted above, the same group evaluated additional genes that revealed contamination.\nBe that as it may, just based on the fact of Tipler’s eyeing of raw data with only a 106 signal, to even come remotely close to supporting his idea, insertion of the SRY gene (or other Y specific genes) would need to be evaluated.  This was not done-is entirely speculation, hypothetical\n4. The only thing I agree with about his interpretation is that normally such results would be published in a major scientific journal.\n\n","date":"February 21, 2015 at 1:07 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-191497","author":"Kelly Kearse","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Hi, Kelly!  \nHope you are well.\nI have a question.  \nThere are many who believed Ron Wyatt was a fake, but I do not believe this to be the case.\nAlthough Ron is now deceased, what is interesting is that he found the cross hole where Jesus was crucified and digging beneath the cross hole into Zedekiah’s cave, he supposedly found the Mercy Seat (altar) that contained dried blood.\nIsn’t it strange that the blood Ron attributed to Jesus had 24 chromosomes (XXY), same as that of the Shroud?\nHere is an excerpt of someone familiar with DNA analysis, referencing the blood Wyatt found.\nA Scientist Analyzes Mr. Wyatt’s Chromosome Theory\nDr. Eugene Dunkley, Geneticist\nAugust 1999, England\n“Ron was convinced that the blood of the altar was in fact the divine blood of Jesus because the chromosome count was 24.  If Jesus was ONLY human we would expect 46. In fact, if he found 46 chromosomes I would have my doubts, because the argument would be that it was simply the blood of a human being (except of course that the white blood cells were re-vitalized after almost 2000 years….).  Russell is wrong about the frequency of chromosomal diseases in humans: a number of conditions involving either 47 or 45 chromosomes have been well characterized, besides Turner’s, such as, Klinefelters, Down’s syndrome, Pateau’s syndrome, Cri-de-Chat syndrome, XYY, XXY, etc. and in fact there was a case in which a young man was found alive with only 24 chromosomes.”\n http://www.arkdiscovery.com/chromosomes.htm \nMy question is Ron found this blood, before the Shroud DNA analysis.  Why are the results, (XXY chromosome) exactly as that found on the Shroud of Turin?\nSee also the photos of Zedekiah’s cave where Ron found the blood.\nZedekiah’s Cave\nhttp://www.arkdiscovery.com/zedekiahs_cave.htm\nWhat are your thoughts?\nBest,\n\n","date":"April 21, 2015 at 3:40 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-197087","author":"Angel","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Kelly, thanks for the explanation. It now makes sense why Professor Tipler’s contention did not receive wide attention.\n\n","date":"February 21, 2015 at 1:38 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-191501","author":"Louis","site":"shroudstory"},{"title":"The Sudarium of Oviedo as Evidence?","post":"Directed to O.K.:\nIt is meaningful and important to compare the properties of the Shroud & Sudarium to evaluate their possible relation to one another.  It is also important, however, to consider each artifact independently to provide the most objective approach when investigating the properties ascribed to each.  This is a key point.   If an underlying assumption of any investigation is that the two cloths must be related, subjectivity & bias has already crept in.\nIn your previous interrogation, I was asked Yes or No if I thought the cloths belonged to the same person.  My answer is: It’s  possible.  I had the opportunity to visit with Dr. Whanger in his home several years ago and he very patiently demonstrated to me the overlay system featuring the two cloths.  This allowed me to better appreciate the congruence of some of the bloodstains in various regions\nYou stated that both the Shroud & Sudarium both belonged to crucified men.  On the Shroud, the crucifixion wounds are obvious in the wrist & feet.  The Sudarium is a head cloth.  What objective scientific evidence from the Sudarium do you feel demonstrates that this represents an article from a crucified man?  Would like you to be as specific as possible.\n\n","date":"February 22, 2015 at 8:04 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","id":"comment-191600","author":"Kelly Kearse","site":"shroudstory"}]
