[{"title":"The Sudarium:  A Better Provenance and History?","post":"I think that, for both the Shroud and the Sudarium, the only way we could scientifically get to the conclusion that there’s a solid probability for authenticity or for fake is not through historical researches (even if such researches are important), but through a new series of C14 dating done more properly this time (and maybe supported by another dating technique that would be recognized by most of the scientific community as accurate, if such a technique exists).\nUntil that time, speculations and ad nauseam debates between pros and cons will continue without any real tangible results…\n\n","date":"November 30, 2015 at 10:49 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215360","author":"Joe","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"In principle I am opposed to dating\nwith the C14 because this is a destructive method.\nWe should be careful in the analysis of the two relics.\nHere’s an example: what do we know\nusing the method of C14 about the differences\n(if they really exist) between the blood\non the Shroud and that of the Sudarium of Oviedo?\nLink:\nhttp://www.scirp.org/journal/PaperInformation.aspx?PaperID=61556\nHere I wanted to link the words about\nbloodstains with the last interesting work\nby\nAdrie A. M. van der Hoeven\n(Utrecht, The Netherland):\n“Cold Acid Postmortem Blood Most Probably\nFormed Pinkish-Red Heme-Madder Lake on\nMadder-Dyed Shroud of Turin”\nPDF (Size:9161KB)     PP. 705-746   \nIn other words:\nWhat is the exact difference for\n“the pinkish red bloodstains” of the\nHoly Shroud with respect the bloodstains\npresent on Oviedo’s Cloth?\nI think this requires a new work…\nOr not?\nWhat say your researches on the\nexact “color difference for the blood\nof the Shroud with respect color of\nthe blood of the Shroud of Oviedo”?\nI think we have to investigate in a better\nmanner the  colored surface layers, using SPMs tools…\nAll this is very far from the destruction\nof the C14 (a test thinkable only as a last resort!).\n\n","date":"November 30, 2015 at 12:21 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215368","author":"piero","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Do you know Infrared & Raman Users Group?\n>IRUG is a community that encourages\nthe sharing of high quality comparative\nreference spectral data….\nLink:\nhttp://www.irug.org/\nThen, see also the\n“Proceedings of the Sixth Infrared\nand Raman Users Group\nConference (IRUG6)”\n[organized by Istituto di Fisica Applicata\n“Nello Carrara” IFAC – CNR]\nFlorence, Italy\nMarch 29 – April 1, 12004\nSERS and madder:\n>M. Leona (Metropolitan Museum of Art, USA) Sub-nanogram level identification by Surface Enhanced Raman Scattering of alizarin from madder lakes found in works of art.\nLink:\nhttp://www.gbv.de/dms/tib-ub-hannover/503884707.pdf\n… And so then we return back to …\nMarco Leona and the Metropolitan Museum of Art!\n= New York…\n\n","date":"November 30, 2015 at 12:36 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215372","author":"piero","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"I am always very curious to what\nmay concern the SERS technique…\nI have found the following work:\n“Development of silver nanorod array based fiber optic probes for SERS detection”\nby\nYu Zhu, Richard A. Dluhy, Yiping Zhao\nSensors and Actuators B: Chemical\nVolume 157, Issue 1, 20 September 2011,\nPages 42–50\nHere an excerpt from the Abstract:\n>The development of intrinsic SERS\nfiber optic sensors, i.e., fiber optical sensors\nthat also serve as SERS active platforms,\nis challenging in that an easy, robust method\nthat integrates the SERS active platform\nwith fiber optics is still largely missing.\n>There is a trade-off between implementing\noptimal morphology of SERS active nanostructures\nfor best enhancement effect and preserving\noptical transparency that allows maximum transmission\nof the excitation radiation and the detected signals.\n>In the present work, highly sensitive and\nreproducible silver nanorod arrays (AgNRs)\nhave been integrated to a fiber optic probe\nfor SERS detection. …\nBut now I have no more time at disposal…!\n\n","date":"November 30, 2015 at 12:45 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215373","author":"piero","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Quote from the 1997 report and this more immediate blog entry:  \n“An investigation by Dr. Jose Villalain showed that the victim died in an upright position, and the stains are comprised mostly of fluid from the lungs, along with blood. This illustrates death by asphyxiation while bleeding, consistent with crucifixion, which tends to suffocate the victim rather than cause death from blood loss.”\nThis conclusion is wrong, wrong, wrong.  So if the sudarium does, indeed, identify a victim that died from asphyxiation, it was not covering the face of a crucifixion victim.\nDr. Frederick Zugibe demonstrated in his 1988 book, The Cross and the Shroud, updated in 2005 in The Crucifixion of Jesus, that crucifixion puts no undue pressure on the chest cavity and therefore could not cause asphyxiation.  I don’t know why this notion persists since anyone can easily disprove it.  Just stand up and extend your arms outward.  Stand on your toes for more verisimilitude. Feel any pressure on your chest?  No, of course not.  Here’s the point: crucifixion victims are not hanging.  They are standing.  On a nail.  Or maybe a small wooden support if time on the cross were to be prolonged.  But the effect on the skeletal structure is the same as standing on your feet.  You are not hanging.  Even if you were hanging with your arms outstretched, it would not cause asphyxiation.  Only by hanging with the arms directly overhead is there sufficient pressure on the chest cavity to possibly cause asphyxiation.  \nStill don’t believe me?  Here’s a little experiment you can try:  Find a vertical wall.  Nail a pair of shoes on that wall and two handles where your hands would be on outstretched arms if you were standing in the shoes.  Get someone to help you (“spot” your “gymnastics” so you don’t hurt yourself) and try it.  You will find that you could stay there all day as far as your lungs are concerned.  But other parts of your body.  That’s a very different story.  \nLastly, I appeal to common sense.  The pains and agonies of crucifixion were so severe that if a victim could end his life by simply hanging loosely and letting asphyxiation do him in, probably the only one in history who would not have taken this route would have been Jesus who had a specific divine mission in mind for his crucifixion.\n\n","date":"November 30, 2015 at 9:10 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215396","author":"Jim Carney","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Jim, it is not wrong, wrong, wrong at all.  It is at least definitely arguable.  And it all depends on who is right, Zugibe or Barbet.  And it also depends on how the crucifixion was carried out.  There is not necessarily a majority of Shroudie medical experts who concur with Zugibe. \nWhat did Zugibe do to prove his hypothesis?  He fundamentally had a volunteer step up to a cross;  he bound his feet to the upright; and the volunteer had his hands strapped into gauntlets fastened to the crosspiece.  Let’s not kid ourselves that this represents a real crucifixion. \nDid  the crucificerius carry the full cross, or only the cross-piece?  Barbet argues that he only carried the cross-piece (patibulum) and that the upright (stipes) was already in place.  Others have asserted that he carried the full cross and after the nailing, the cross was raised and dropped into a ready made hole and stabilised maybe with a few rocks.  \nNow if it was just the cross-piece, then after the hands(wrists) had been nailed, it would be the work of not more than five men to lift the cross-piece onto the upright.  During this raising process, the full weight of the body is taken by the arms, and that would have required wrist nailing.  Once the cross-piece is in place, and at this point there is a tension of 207 lbs on each arm, (very difficult to breathe), then the feet are nailed to the upright.  This is not like stepping up to a footrest! \nIf he carried the full cross, then he is nailed to the cross with it lying on the ground.  The cross then has to be raised into position.  This is a fairly tricky process, but it might be done by placing the base of the upright near the hole and anchoring it.  Executioners then have to raise the cross, probably using ropes which have to be fastened near the top of the cross without slipping;  when it is upright, they have to get it to drop into the hole, and then stabilise it.  This is altogether a more complicated way of doing the job, and I therefore tend to favour Barbet’s scenario of cross-piece only.  \nThe gospel accounts claim that Jesus died within a few hours, and Pilate was surprised at his rapid death.  Asphyxiation seems more likely.  The Shroud image shows a distended chest, which is one reason why Barbet favoured asphyxiation as the cause of death. \nYou see indeed it is quite credible!\n\n","date":"December 1, 2015 at 12:14 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215402","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Daveb, alas, my most admired commentator has some clay in his feet.  You are missing the point entirely.  It is not whether nails are used or gloves or any other device that has more or less torture involved.  There is no asphyxiation because the victim is standing, not hanging.  And theoretical scenarios–or even mathematically constructed ones–about the weight on one’s arms does not change that fact.  If the weight of 207 lbs or whatever was too much for the human body to bear, the arms would have broken and death or injury would have ensued.  That obviously did not happen–ever, apparently, given the huge number of crucifixions of slaves, criminals, rebels, etc. etc.\nAs for how crucifixions were physically accomplished, I suspect you are a man of letters (clearly) more than a man of labor, much less an engineer.  After severe beatings, such as those described for Jesus in the scourging, and who knows what other deprivations prior to the time of crucifixion (hunger, general abuse, not to mention the paralyzing fear of impending crucifixion), it seems highly unlikely that prisoners were required to drag the entire cross to Calvary.  It’s not practical.  In some, perhaps most cases, it would not even be possible.  Further, leaving the posts upright in the ground was a reminder to all the passersby that crucifixion awaits those who defy the Roman rule–which is exactly what the Romans hoped to accomplish by these horrific executions–and why they staged them at crossroads and other highly visible public places.  Further, once the prisoner arrives at the place of crucifixion with the cross beam, it is not difficult but easy to pull the post out of the ground, lay the cross beam in its already-cut slot in the post, fasten the two pieces together, nail the victim onto the assembled cross, then using a team of one or two persons per side pull the whole assemblage up with ropes into the hole where the post resides.  Trying to lift a heavy cross beam with the dead weight of a squirming, screaming victim into some slot in the post would be the worst possible way to accomplish this task.  So we need not speculate nor calculate the weight on the victim’s arms while his feet are nailed into the upright post, a much more difficult task, by the way, than nailing while he is lying down.\nSorry, old friend, you are wrong, wrong, wrong on this one.\n\n","date":"December 1, 2015 at 12:42 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215403","author":"Jim Carney","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Jim, if the victim’s merely standing, then you need to come up with a better explanation than Zugibe’s mere shock and trauma as the cause for the rapid death.  See Barbet, “Doctor at Calvary”, he devotes a whole chapter to it, Ch 3, ‘The Cause of the Rapid Death’.  He also carried out far more experiments of various kinds than Fred Zugibe ever did.  To achieve this, there can be no seat (sedile) nor foot-rest.  You have a nail through the foot at the base of the second inter-meta-tarsal space, and it can only support your weight by pressing against the Lisfranc space-line separating the tarsal bones from the meta-tarsals.  That’s painful, so you transfer your weight back onto the arms.  With your arms at 65 degrees to the vertical, that results in 207 lb tension in each arm.  That’s not only painful but exhausting.  So you transfer your weight back on to your feet.  Etc, etc.  \nThe distended chest of the shroud image gives it away as cause of death by asphyxiation.  Pilate was amazed at the rapid death.  What do you think it was if not asphyxiation? But first, check out Barbet’s chapter 3 !\n\n","date":"December 1, 2015 at 2:58 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215407","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"We engineers are trained to deal with forces. I think no one has ever seen a crucifixion. May be Jesus on the standing position initially but when time goes on he had to be on the hanging position. His legs couldn’t take the weight of his body after loosing blood That is why they nailed Jesus from wrists rather than from the palm.\n\n","date":"December 1, 2015 at 3:40 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215444","author":"Sampath Fernando","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"One of my favorite lines in the Cross and the Shroud was borrowed by Dr. Zugibe from Arduous Huxley and applied to the asphyxiation theory: “the slaying of a beautiful hypothesis by an ugly fact.”  p. 85.  \nZugibe’s two books utilizing multiple volunteers irrefutably rebutted Barbet’s asphyxia hypothesis as well as his untested imaginings of the crucified person raising and lowering himself on the cross in order to breathe.  Zugibe demonstrated in his book, The Crucifixion of Jesus (2005), p. 117 that it is not possible to raise oneself at all.  He used healthy volunteers fastened to a cross in a position of outstretched arms at 65 degrees with knees bent at 120 degrees (the positions postulated by Barbet and confirmed by historical evidence for Christ’s crucifixion as well as physiological responses to outstretched arms and feet fastened flat against the upright beam of the cross).  No volunteer was able to budge upward.  The reason is that the body in this position does not permit the muscles of the arms and legs to exert force in the right direction.  Could a trained gymnast using his arms only as if in the rings event raise himself?  Possibly, but obviously beaten and tortured crucifixion victims were hardly comparable to trained gymnasts.  \nI tested Zugibe’s experiments myself about 20 years ago using shoes nailed to a vertical wall and handles at the outstretched limits of my arms for support.  In fact, I could not raise myself.  The only way to gain relief from the immediate and severe cramping that began in the legs and shoulders was to try to lean forward as much as possible. Leaning backward as little as that could be done only increased the pressure on the hands and feet.  So there was no way the crucifixion victims could obtain any relief by transferring their weight between arms and legs.  Such transfers cannot be done.  In all of this, there was no discernible pressure on my diaphragm to restrict breathing.\nAnd because it is the skeletal structure that is supporting the body, the weakness of any of the musculature is wholly irrelevant for determining the response of the crucified victim.  One does not “hang” more because of weakness in the legs.  Nor is there any significant weight on the hands and wrists.  As I mentioned earlier, stand up and hold your arms out.  That’s what gravity is doing to your body whether you are crucified or not.  All the supposition about needing to nail through the wrists in order to support the body is wrong with a possible exception for victims who for whatever reason were not supported by their feet.  This would include, for example, those for whom the skeletal structure is broken when the legs were fractured as the gospels tell us happened to the two criminals executed with Jesus.\nAnd as I noted earlier, Barbet’s chapter 3 on the causes of Christ’s death depends in part upon the reported observations of his colleague, Dr. Le Bec.  But Le Bec was observing prisoners whose arms were pulled directly over their head (which does constrict the diaphragm) and whose feet were not touching the ground.  Comparing the crucifixion experience of Jesus to this is like comparing not just apples to oranges but apples to bananas.  Barbet could carry out experiments until the cows came home and it would not compare to using volunteers who actually simulated the conditions of crucifixion.  Besides, experiments are only as good as their correspondence to reality.  Zugibe noted in his 1988 book that Barbet was wrong in his connection of Destot’s space (down near the little finger) with the median nerve, which runs up near the thumb.\nAs for the actual cause of death, traumatic and hypovolemic (loss of fluids) shock is more than ample to explain Christ’s death on the cross.  Even Barbet noted the severe dehydration that would have occurred given the extreme suffering in the Garden of Gethsemane and the multiple beatings, including the scourging and crowning with thorns, that Jesus endured.  Severe dehydration and the shock that follows from it is, I believe, the main cause of death from cholera.  Traumatic shock, resulting from severe and unrelenting pain, would obviously have been at work here too.  When the body goes into shock, the heart is unable to pump properly, tissues and organs begin to die, and heart failure follows unless remedial measures are taken.  As a certified medical examiner with decades of experience, Zugibe certainly was qualified to make this call.  But note that when a body in shock begins to fail, respiration will also be affected.  Breathing may be labored for awhile and in the end will obviously cease.  This is not death by asphyxiation but a manifestation resulting from other causes.\nFinally, I do not believe nor have I ever heard it suggested that the two-dimensional Shroud of Turin image of the crucified Jesus indicates that he died of asphyxiation.  Since he could not have, that is obviously not a valid conclusion from anything that could be deduced from the Shroud.\n\n","date":"December 2, 2015 at 1:30 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215501","author":"Jim Carney","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Frankly, I had never heard of Lisfranc\n(“daveb”, December 1, 2015 at 2:58 am),\napart another message\nby “daveb” (dated “December 14, 2013”).\nThen…\nI think you have some interesting\nmedical knowledge to share\nwith the other persons… \nHere what I have found:\n>The Lisfranc joint, or tarsometatarsal articulation of the foot, is named for Jacques Lisfranc (1790–1847), a field surgeon in Napoleon’s army. Lisfranc described an amputation performed through this joint because of gangrene that developed after an injury incurred when a soldier fell off a horse with his foot caught in the stirrup. …\n>…To lessen ambiguity, some investigators have suggested that the term “Lisfranc joint complex” should be used to refer to tarsometatarsal articulations and that the term “Lisfranc joint” should be applied to medial articulation involving the first and second metatarsals with the medial (first) and middle (second) cuneiforms. … \n>…The Lisfranc ligament is a large band of plantar collagenous tissue that spans the articulation of the medial cuneiform and the second metatarsal base.\n>While transverse ligaments connect the bases of the lateral four metatarsals, no transverse ligament exists between the first and second metatarsal bases.\n>The joint capsule and dorsal ligaments form the only minimal support on the dorsal surface of the Lisfranc joint\nLinks:\nhttp://www.aafp.org/afp/1998/0701/p118.html\n\nBut … see also:\n>…The third discovery has to do with the right foot of the Man of the Shroud: it was nailed to the cross twice. An analysis of the imprint of the sole of the right foot shows two nails were driven into it: one between the second and third metatarsal and another at heel level which other academics had not spotted clearly. …\nLink:\nhttp://www.lastampa.it/2014/05/07/vaticaninsider/eng/world-news/new-study-shows-man-of-the-shroud-had-dislocated-arms-dsfGr2euXrvlxBASsEwi1M/pagina.html\n\n","date":"December 3, 2015 at 11:21 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215559","author":"piero","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Unfortunately it was omitted the link:\n\n…And then here it is quite clear that from the head (= Sudarium of Oviedo) we came to regard the feet !!!\n\n","date":"December 3, 2015 at 11:26 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215560","author":"piero","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"I don’t understand the reason for continue the omission about the link:\nhttps://dailyem.wordpress.com/2013/12/17/not-just-an-footankle-sprain-lisfranc-injurie\nI do not want a repetition for the image!\n\n","date":"December 3, 2015 at 11:30 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215561","author":"piero","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"There are also the two contradictory positions of the head during rigor mortis to be considered. For the Sudarium scenario, the head was jammed so tight against one shoulder that the cloth could not be passed around it. For the Shroud, it is sitting serenely on the shoulders. Also Mark Guscin has Jesus lying for hours in various positions in order for each layer of superimposed stains to dry before the next one is added, which does not seem to me very likely.\n\n","date":"December 1, 2015 at 3:09 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215408","author":"Hugh Farey","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Dan cited my paper above, Hugh’s question is valid and I can answer for myself.\nWe do not know when exactly rigor mortis set in, since this process takes about two hours to start and goes on till there is complete postmortem stiffness.\nIt is clear that the man who used the cloth to cover Jesus’ face was concerned with restraining the blood coming from the nose and the right hand side of the mouth (see the larger illustrations in the paper, particularly the face image). He may therefore not have thought it necessary to wrap the cloth around the head.  What he may have done was to fold the cloth so that it would become more thick and thus more pressure could be applied. It would be more effective. It is a possibility.\nThere is no general agreement about how the cloth was used on the face, not even in Spain. The pathologist and coroner I mentioned has limited information.\nWhatever, it is evident that this does not affect the perfect model produced by the professor of sculpture.\n\n","date":"December 1, 2015 at 1:35 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215439","author":"Louis","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Here’s a problem for authenticity – the lack of image from the top of the head. If the hair makes an image on the frontal and dorsal why not from the top of the head.\nIt’s hard to buy the head band argument. I have also heard it said that maybe the crown of thornes was left on Christ’s head and that would have the shroud away from the top of the head and hence no image. But again hard to believe. The crown of thornes was an act of mocking and surely it would have been removed.\n\n","date":"December 2, 2015 at 5:18 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215474","author":"Thomas","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"But your problem would apply to a forgery as well. Why is there no image on the top if it is a bas relief type imprint? Why such precision in other areas but not on the top of the head? Artistic decision? But this wasn’t meant to be art (if it is a forgery I’m inclined to go with Colin’s theory that is meant as a relic).\n\n","date":"December 2, 2015 at 3:44 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215506","author":"David Goulet","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"The cap of many long, thick, thorns, pointing in different directions,  was repeatedly driven into His head, so it would have been very difficult to remove it without taking some of the flesh with it.  Maybe they did leave it on his head?\n\n","date":"December 2, 2015 at 6:03 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215510","author":"nag","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Valid point. It may have required careful religious observance while removing it as blood and flesh were involved. An activity that may have had to wait until after Sabbath to complete. If it was a cap that covered just the top rear part of the head then this is plausible. Otherwise we’d likely have some sign of it on the frontal face image.\n\n","date":"December 2, 2015 at 8:20 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215515","author":"David Goulet","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"good! Possible! To explain lack of image, it would need to be on top of the head, so that the cloth fell back down behind the head (leading to the image we see on the back of head then back of body)\n\n","date":"December 3, 2015 at 1:42 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215522","author":"Thomas","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"The crucial thing that has to be borne in mind where the medieval forgery narrative is concerned (for the few here willing to give it credence) is this: it didn’t have to be true, as per scripture: it had only to be credible and consistent. So the last two comments re the gap between the heads (visible) and the crown of thorns (invisible) are key pieces of information that have to be fitted into the narrative jigsaw.\nIn fact, they fit very neatly, being complementary in fact. First, the medieval pilgrim arriving footsore at Lirey was told the image was entirely due to imprinting in body fluids, immediately following remval of the body from the cross, i.e. in blood and sweat only. So there was no point in looking for a crown of thorns, or even wounds per se. Everything has to be deduced from the blood and sweat imprints. Why the gap between the heads? Answer: because the crown of thorns was still in place during the imprinting process, preventing contact between linen and the top of head, despite the two being closely apposed.\nWhy the blood on the hair, as if it had been dribbled from on top, rather than coming from the underlying scalp? Answer: because it DID come from on top, not underneath. How? Because while the body was on the cross there was time for blood from the scalp to run to the far ends of the thorns, furthest from the scalp, especially when the head drooped down. Later, when the body was removed from the cross, a few drops of that migratory blood then dripped off the twiggy or thorny ends onto the image left by the hair at the sides.\n of the head.\nThere’s arguably the legitimate resort to artistic licence (if one’s an artist). If a forger, rather than an artist, one resorts to narrative licence, the important thing being to have an answer for everything.\n\n","date":"December 3, 2015 at 2:40 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215525","author":"Colin Berry","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"good!\nmaybe a bas relief with a gap between front and dorsal relief?\n\n","date":"December 3, 2015 at 1:40 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215521","author":"Thomas","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"As no one has seen the crucifixion and also the resurrection process people are making a lot of assumptions. Some assumptions may be correct and the other may be wrong.\nMy assumption for the formation of image is dematerialization of the body and related radiation from it. As most of the Christians believe, Jesus did not resurrect bodily but resurrect only spiritually. Jesus resurrected with his spiritual body and discarded his material body. (Remember Jesus once said that spirit (or spiritual body) is willing but flesh (material body) is weak)\nSo no one knows how the radiation initiated and also during that process how the body was reacted. Also no one knows what happen to the hair. My assumption is that most probably hair got blown out during this process. As I have previously stated the force of the blown out hair helped to raise the wrapped cloth such a way the image of the hair got printed on the formally blood tainted area of the cheeks. That was the main reason that image got blood in hair. This expansion of cloth in the face area is main reason for not to have image from the top of the head.\nNo forger or no painter place blood in the hair. Blood in the area of the hair of the image is the trade mark of authenticity of the Shroud of Turin.\n\n","date":"December 2, 2015 at 8:19 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215514","author":"Sampath Fernando","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Sampath, the vast majority of Christians believe that Jesus rose both bodily and spiritually.  That is pretty much the point Jesus was trying to make to the apostles, who were deathly afraid he was just a ghost, when he appeared to them in the upper room on Easter Sunday.  See, for example, Luke 24:39 where Jesus says to the apostles: “Touch me and see that a ghost does not have flesh and bones as I do.”  He then ate some fish to show them that his bodily functions were still physical.\nAs for how the image on the Shroud of Turin was formed, if it is indeed the burial cloth of Jesus Christ, then the formation of the image is a miraculous event preserving a picture of Christ’s sufferings on the cross for the redemption of mankind.  We need not speculate in this case on how the image was formed since it is, by definition, accomplished by means that we do not understand.  Endless analysis and speculation about how the image might have been formed by natural means is of interest only if the image is not a divinely-created one of Jesus in the period before his resurrection.  In considering this basic question, however, it is relevant to discuss whether there is any possible natural explanation for how the image was formed and whether there is any evidence to establish its actual age.  In my opinion, nothing that I have read offers any persuasive evidence that the Shroud is not the true burial cloth of Jesus.  The least convincing of all arguments is that it could not be valid since we cannot figure out how the image might have been formed.\nIn this sense, the Shroud of Turin is like the Tilma of Our Lady of Guadaloupe.  This enduring image of the Blessed Virgin Mary on a cactus fiber cloak of a Mexican peasant nearly 500 years ago (1531) is inexplicable both for how the image was formed and how it is that this fragile garment has not fallen into dust centuries ago.  And I refer you to my own book, The Seton Miracles: Weeping Statues and Other Wonders (1993, 94, 98) for a more contemporaneous account of seemingly natural occurrences that cannot be explained by natural causes innocent or otherwise.  Although there, again, I would be happy to entertain explanations of how statues and images of Mary and Jesus could be made to shed “tears” from their eyes without prior human manipulation.\n\n","date":"December 3, 2015 at 2:11 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215577","author":"Jim Carney","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Thank you Mr. Carney.  Yes I have meditated many times on Luke 24:39, then when I read the word Jesus “disappeared” from the site I couldn’t understand how a solid body able to disappear from the site or able to enter from the solid walls and locked door.\nI think like angles Jesus spiritual body also managed to gain material features when essential. This transformation body status is the most difficult thing to understand.\n\n","date":"December 3, 2015 at 3:50 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215581","author":"Sampath Fernando","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"It might help you to understand Christ’s ability to appear and disappear by considering that current cosmological concepts include string theory (everything in the universe at the sub-Planck level is vibrating bits of energy), the mathematics of which, in turn, requires the existence of multiple dimensions.  Physicists are contemplating what this might mean in terms of multiple universes or the so-called “M-Brane” concept.  Well, we already have a good notion of at least one dimension: the spiritual one that we call heaven or the afterlife.  Since it is obvious that God must transcend all the dimensions in the existence that he has created, then it should be no problem for Jesus to move easily between dimensions.  Thus, when he appeared in the upper room to the apostles, he was simply stepping from the spiritual dimension that we are familiar with (at least in concept) into the physical dimension that we live in.  Mary obviously moves between these dimensions in the same way as she has appeared to various persons down through history, including at Fatima, Lourdes, and Tepeyac, Mexico (Virgin of Guadalupe).\nIt is also common Christian understanding that after our lives on earth, the resurrected body that we will eventually have will be physical but have far more capabilities (and permanence) than the sin-laden one we have here.  In the meantime, souls in the afterlife have some kind of corporeal substance because they are recognizable as the people they were on earth.\n\n","date":"December 3, 2015 at 6:12 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215586","author":"Jim Carney","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Mr. Carney “It is also common Christian understanding that after our lives on earth, the resurrected body that we will eventually have will be physical but have far more capabilities (and permanence) than the sin-laden one we have here”.\nJesus never mention anything like this and from where this thought originated?\nMr. Carney I also believe in Multiverse. Spiritual Universe and Material Universe have a common area. (intersection of set theory). That is why Guardian angles can take material bodies when they want.\nSorry this is only a logical question. If Jesus died for our sins then why did he resurrect with same body? If he resurrected from the same body then purpose dying for our sins is lost.\n\n","date":"December 4, 2015 at 2:58 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215606","author":"Sampath Fernando","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Jesus certainly did mention the notion of a vastly improved body in the next life when he promised his followers would have eternal life with him in heaven.  Since the body we have here on earth is subject to disease and deterioration leading to death, obviously the bodies of the faithful in heaven will be of a very different kind.  One cannot live forever in the body that we have on earth.  And it has long been Catholic teaching, and I believe mainline Protestant teaching as well, that the nature of our physical existence here on earth reflects the nature of our souls, which is subject to the sinfulness generated by being descendants of Adam and Eve.  Having been redeemed by Christ, our admittance to heaven will be free from any kind of sinfulness or weakness or disease or defect.  It is also logical to assume that such heavenly bodies will have greater abilities than the ones we inhabit here.\nWe also get an idea of the nature of our beings in the next life by considering the gospel accounts of the transfiguration of Jesus.  See, for example, Luke 9:28-31.  Besides Jesus being changed in appearance with his clothes dazzlingly white, Moses and Elijah also appeared “in glory” (v. 31) with him.  \nAs for his appearance after the resurrection, it was important that Jesus appear in the form that he presented during his life on earth so that the apostles would understand that it was the crucified Jesus who was now resurrected.  This is the message of the resurrection down the ages to all of us: we who are faithful to the teachings of Christ will live on after death in glory with him.  No matter what form Jesus might have chosen to appear in after his resurrection, in his crucifixion he took on the weight of mankind’s sins and obtained God’s forgiveness for them to the extent that those who try to live by Jesus’ teachings can draw upon the grace obtained for all of us by his sacrifice.  Thus we are made whole by Christ’s sufferings and can share eternal life with him accordingly.  You are missing the whole point of the sacrificial redemption of Christ if you think it has anything to do with the form of his appearance after his resurrection.  \nFinally, we don’t need a theory to explain how angels and other heavenly figures (for example, the Blessed Virgin Mary) can appear on earth in corporeal bodies.  God can empower such transformations, appearances and transitions as he wishes.  It strikes me as a little arrogant–and foolish–to suggest that we can understand how these things are accomplished, much less to say that they could not be accomplished unless it conformed with some theory we come up with.\n\n","date":"December 4, 2015 at 6:01 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215654","author":"Jim Carney","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"I do not understand the sympathy of some sindonists for the sudarium of Oviedo which only complicate things. For example: The possibility that three radiocarbon labs commit the same error is very unlikely (Ramsey). The possibility of an error with seven datings (3 Turin plus 4 Oviedo) makes the margin of error very, very unlikely.\nIs it a relic mania?\n\n","date":"December 3, 2015 at 3:25 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215527","author":"David Mo","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"The flip side of course is that if the two relics are authentic then whatever (potentially) threw off the carbon dating (contamination) could have affected both linens.\nIs there evidence of other ancient linens, which have been exposed to the elements in a similar manner to these relics, providing unusual C-14 readings? Or are our two relics anomalous?\nThe only way to establish any true link between the relics is to test the blood of both for a direct match. Until this is done it is all conjecture. But the Sudarium is a intriguing relic to be sure. We have many Shroud copies in existence — but how many Sudariums — which would be even easier to copy convincingly than the Shroud.\n\n","date":"December 3, 2015 at 9:56 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215552","author":"David Goulet","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"There is a lot of 14C datings of textile samples similar to those of Oviedo and Turin without any problem.\nNote the fantastic “contamination”: it moves back the dating  in different magnitudes (13 and 7 centuries) that “by chance” matches with the date of first records of both cloths. Fantastic! Is it not?\n\n","date":"December 4, 2015 at 2:20 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215602","author":"David Mo","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Define ‘similar’. Or perhaps provide an example or two for comparison sake. The C-14 dating remains the strongest evidence for the non-authentist argument for both relics – there’s no denying that.\n\n","date":"December 4, 2015 at 12:38 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215635","author":"David Goulet","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"If you search with Google “radiocarbon dating textile” you will find some things as these:\nhttps://journals.uair.arizona.edu/index.php/radiocarbon/article/viewFile/17757/pdf\nhttp://www.sciencedirect.com/science/article/pii/S0168583X08002462\nhttp://digilander.libero.it/Hard_Rain/Radiocarbon1994.pdf\nhttps://journals.uair.arizona.edu/index.php/radiocarbon/article/download/18103/17842#page=256\nhttp://www.researchgate.net/profile/Irka_Hajdas/publication/267846457_APPLICATIONS_OF_RADIOCARBON_DATING_METHOD/links/54b677340cf2bd04be3212b2.pdf\nhttp://www.sciencedirect.com/science/article/pii/S0305440309003434\nEtc., etc. \nYou can see also:\nTaylor, R. E; Bar-Yosef,  Ofer; Renfrew, Colin: Radiocarbon Dating. An Archaeological Perspective, Left Coast Press, Walnut Creek (California), 2014; 2ª ed\n\n","date":"December 5, 2015 at 3:27 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215669","author":"David Mo","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"If you search with Google “radiocarbon dating textile” you will find some things as these:\nhttps://journals.uair.arizona.edu/index.php/radiocarbon/article/viewFile/17757/pdf\nhttp://www.sciencedirect.com/science/article/pii/S0168583X08002462\nhttp://digilander.libero.it/Hard_Rain/Radiocarbon1994.pdf\nhttps://journals.uair.arizona.edu/index.php/radiocarbon/article/download/18103/17842#page=256\nhttp://www.researchgate.net/profile/Irka_Hajdas/publication/267846457_APPLICATIONS_OF_RADIOCARBON_DATING_METHOD/links/54b677340cf2bd04be3212b2.pdf\nhttp://www.sciencedirect.com/science/article/pii/S0305440309003434\nEtc., etc. \nYou can see also:\nTaylor, R. E; Bar-Yosef,  Ofer; Renfrew, Colin: Radiocarbon Dating. An Archaeological Perspective, Left Coast Press, Walnut Creek (California), 2014; 2ª ed\n\n","date":"December 5, 2015 at 3:28 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215670","author":"David Mo","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"The impression one gets is that Turin does not take seriously any of the proposals presented to explain why the 1988 radiocarbon dating results may have been skewed. That is in fact sort of echoed in Ian Wilson’s last Shroud book.\nWe now know that Turin has brushed aside the proposals and the attention is focused on radiocarbon dating but, even then, they are hesitant to go forward. The reason can be read in the last q/r:\nhttps://www.academia.edu/11355553/Dr._Paolo_Di_Lazzaro_explains_his_research_on_image_formation_on_the_Shroud_of_Turin\nWith the recent Vatileaks scandals one notices that there is no lack of traitors, clerics included.\nNow, when it comes to dating ancient textiles, although the Masada excavation is still the object of controversy despite the good intentions of Y. Yadin, we at least know that the cloths found there were dated to AD 70.\nFor more, the cloths used to wrap the Dead Sea Scrolls were also correctly dated. Note: By Willard Libby himself, around 1950. The results he obtained matched the studies made by Father Roland de Vaux. who excavated Qumran and was the first editor-in-chief of the Dead Sea Srolls.\nRadiocarbon dating is an important tool in deciding chronology in biblical archaeology and micro-archaeology will not change the picture. It is used together with C14:\nhttps://www.academia.edu/18994343/The_key_role_of_Biblical_Archaeology_in_Exegesis_An_Interview_with_Professor_Israel_Finkelstein\nThat is why the questions in the thread “SSG member wants to know” are important. They may be one among other leads.\n\n","date":"December 6, 2015 at 10:28 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215724","author":"Louis","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"I’ll just add a little tidbit here about carbon dating porous materials; It is pretty well established, I believe, from my readings that linens, clothes etc. are prone to contamination and unless they have been left undisturbed such as a mummies wrappings, contamination would be a very big issue and especially with flax. Seeing how both the Shroud and Sudarium have been handled and transported many times over the centuries,  I would conclude carbon dating would be next to a useless endeavour. As for the mention of carbon dating seeming to bring up the 7th & 13th centuries and how there may be a plausible answer to this;…I read an article recently where ancient trees in Japan had shown, through the study of their rings, a massive increase/burst in Carbon 14 amounts in the atmosphere dating to the 7th century. Could this possibly effect the Shroud and Sudarium?\n\n","date":"December 9, 2015 at 2:38 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215957","author":"Ron","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"David \nI once posted the question of could the smoke and fire change the C14 dating. I decided to do a little research on it and I found this,\n ” Effects of fires and biofractionation of carbon isotopes on results of radiocarbon dating of old textiles: the Shroud of Turin.” \nhttp://www.sciencedirect.com/science/article/pii/S0305440396900096\nBeing unwilling to fork over $35 for the full article, and having other mysteries I’m looking into right now, I wonder if anyone here has read this and has an opinion on it.\n\n","date":"December 5, 2015 at 8:13 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215680","author":"John Green","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Dimitri Kouznetsov?\nNo thanks.\nhttp://scienceblogs.com/aardvarchaeology/2007/10/13/dimitri-kouznetsov-repeat-offe/\n\n","date":"December 5, 2015 at 8:23 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215681","author":"Colin Berry","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Thanks Colin, you saved me the time to look into that.\n\n","date":"December 5, 2015 at 9:02 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215683","author":"John Green","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"One must always remember that the Sudarium was only one of a cache of Passion relics, including a phial of the blood of Christ, that was found to be in the chest when it was opened in medieval times. ( the chest itself was said to have been made by the apostles.) Unless the other documented relics from this chest have been lost, then they should be tested too to give the wider context of the Sudarium. There is no justification for isolating and highlighting the Sudarium as it would certainly be less important than the phial of Christ’s blood.\n\n","date":"December 4, 2015 at 2:24 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215603","author":"Charles Freeman","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"One of the lines I would like investigated is whether the double image of the Turin Shroud is actually derived from earlier Spanish examples. It would mean a lot of painstaking. work on the Spanish images without the assumption that they all derive from the Turin Shroud. Perhaps David Mo can know someone who would be interested.\n\n","date":"December 4, 2015 at 2:31 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215605","author":"Charles Freeman","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"That’s a very good point raised by David Mo.  I have a tendency to think the same and that explain why I’m much more skeptical about the probability of the Sudarium to be genuine.  People should remember that, on the contrary to the Shroud radiocarbon dating and Raymond Rogers’ Thermochemica Acta’s paper, we don’t have any solid facts or data published in the scientific literature that can seriously explain why the 2 radiocarbon dating of the Sudarium should be considered inaccurate…  And we must remember that the 2 radiocarbon dating of the Sudarium are close to match the first known appearance of the relic in Spain.\n\n","date":"December 4, 2015 at 1:56 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215640","author":"Joe","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"I do’t think the lack of head-top image has been sufficiently investigated. An area for fruitful research?\n\n","date":"December 3, 2015 at 4:19 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215530","author":"Thomas","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"It is incorrect to say it is unlikely that three radiocarbon labs committed the same error. They were using parts of the same sample. Professor Pier Luigi Baima Bollone commented on the dating of the Sudarium, and this can be read in paragraph 2:\n https://www.academia.edu/11804110/Is_the_Sudarium_of_Oviedo_the_key_to_unraveling_the_mystery_of_the_Shroud_of_Turin\nContamination is a big problem when it comes to objects that are subjected to C14,\n\n","date":"December 3, 2015 at 8:43 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215544","author":"Louis","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"I would rather say “Contamination CAN BE a big problem…”  In the case of the Sudarium, there’s nothing in the scientific literature that can back-up the idea that some contamination could have changed the dating results, which are still quite far from the 1st Century A.D.\n\n","date":"December 4, 2015 at 2:18 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215644","author":"Joe","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"I was looking for evidence that there might once have been real thorns, or remnants thereof, in the head region of the TS, and recalled the Poor Clare nuns repair team  having been somewhat ambiguous in 1534 re thorns or the blood they produced. Whilst failing to find references to physical thorns per se, I came across this passage, previously overlooked, certainly by me, and possibly Shroudology generally, with specific reference to the image looking as if made from “sweat and blood” (my bolding).\nIn April of 1534, Pope Clement VII sent his envoy, Louis Cardinal Gorrevod, to make an official recognition of the Shroud and have it repaired. Card. Gorrevod knew the Shroud well. For over four decades, he had been intimately associated with the Savoy family, and profoundly devoted to the Shroud. Many times, his hands had held it at expositions and ceremonies. It was he who first suggested that the image was formed by sweat and blood. And it was he who, in 1506, successfully intervened with Julius II to grant Carlo III’s petition for a liturgy and feast of the Shroud.\n[PDF]The Report of the Poor Clare Nuns – The Shroud of Turin\nhttps://www.shroud.com/pdfs/ssi02part6.pdf\nby D CRISPINO \nHow come that observation and conclusion, attributed to someone who had studied the TS closely with his own two eyes some 500 years ago or more, has not received wider currency? Why do we have to endure the dismissive “only a painting” fiction when the historical evidence (at least) points in an entirely different direction to IMPRINT from two body fluids (real or more probably contrived), NOT painting?\n\n","date":"December 3, 2015 at 11:31 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215595","author":"Colin Berry","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Thank you Colin for this interesting information.\n\n","date":"December 4, 2015 at 1:03 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215599","author":"Sampath Fernando","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"It is a pity that Crispino did not give any reference for her assertion about Cardinal Gorrevod. If one reads the actual account of the St.Clare’s nuns, it is quite clear, and in this they echo the report of Antonio de Beatis in 1517, that there was a lot more to the images in the sixteenth century than can be seen today. This is born out by any study of the depictions of the Shroud expositions, of course.\nFanti at least made the point that linen degrades over time so that one should not expect the Shroud to be now as it was then ( this point is crucial to his dating hypothesis). He does not seem to have grasped that the images also will have degraded, and probably more so than the actual linen. The question is establishing what they were originally.\nColin appears to believe that they exist now as they always have done which seem a surprising position for a chemist to hold. In my archaeological past, we just assumed that,apart from special objects like gold, anything old would have been degraded by the passage of time and the original form of the object might not be recoverable. This seems the best position from which to start understanding the original make-up of the  Shroud images.\n\n","date":"December 4, 2015 at 5:45 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215614","author":"Charles Freeman","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Addressed to Jim Carney:\nHi\nNot all “Shroudies” believe in the Resurrection, much less in miracles. You may have noticed that not many Catholics who go to church think in traditional terms. That is because they have learnt about developments in science, which seem to clash with what the Bible tells us. I have seen people giving up their faith overnight.\nThere were attempts to get rid of the idea of Jesus’ resurrection:\n https://www.academia.edu/7471223/Jesus_was_not_buried_in_Talpiot_-_Part_III\nwhich were not taken seriously as they did not involve archaeologists but those in the film/documentary making indutsry..\nThat much for New Testament archaeology, on which work is still being done.\nWhen it comes to Old Testament archaeology and the Bible things become worse:\nhttps://www.academia.edu/18994343/The_key_role_of_Biblical_Archaeology_in_Exegesis_An_Interview_with_Professor_Israel_Finkelstein\nAs one who has also written on the science-theology dialogue, my guess is that we can go beyond physics and biology and cut the story short by deriving lessons from what we know about the findings in biblical archaeology.\nIt is the only that way that systematic theologians can take the right direction. Right now many of them are so lost that hey keep on making vague assertions, confusing people even more.\n\n","date":"December 4, 2015 at 1:40 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215638","author":"Louis","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Quote: “That is because they have learnt about developments in science, which seem to clash with what the Bible tells us.”\nI think these Christians should start to reconsider the whole idea (which is wrong in my mind) of the Bible being the “word of God”… In fact, I believe it is much more the “word of some men from Antiquity about God”, which explain the discrepancies between some claims, data and events found in that book and the discoveries of science. \nJesus didn’t wrote one word of the Bible.  No more for his Father…  I don’t say that some of the things we find in the Bible are not inspired by the Holy Spirit, but there’s a big gap between a word inspired by God (which can be “translated” more or less accurately) and the exact word of God…\n\n","date":"December 4, 2015 at 2:07 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215642","author":"Joe","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Might I humbly suggest that the best approach for studying that remarkable entity we call the “Shroud of Turin” is not that of the ivory tower academic, regardless of discipline. It is that of the crime detective, seeking out clues, consulting specialists where necessary without becoming beholden to them.\nA crime detective looking at, say, a Penny Black postage stamp for the first time, and realizing it’s quite old (175 years in fact, unless a more recent forgery) would not immediately assume that its appearance has to be totally different from what a subject of Queen Victoria attached to a letter in 1840, far less that the original must have been painted freehand rather than being mechanically imprinted.\nInterestingly, the TS image that was reported on in 1534 by the Poor Clare nuns was also chronologically more advanced to almost the same extent relative to what was displayed in Lirey in 1350 approx, namely 184 years. I bet those nuns didn’t think the original might have been a painting originally that had since suffered the ravages of time (and the Pope’s visiting envoy certainly didn’t). None of them needed to consult experts in ancient painted linens to be certain of that. Granted, old painting gradually deteriorate, but they don’t morph or mutate.\n\n","date":"December 5, 2015 at 3:32 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215671","author":"Colin Berry","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"We don’t know the extent to which the Shroud might have deteriorated by 1534 but we can be sure from the descriptions and depictions that the images had a lot more to them then that they have now. The blood appears to have been much more prominent to observers than it is now and the Crown of Thorns still appears to have been in place with the hair long round the back. I agree with Colin that we just need detective work by specialists. If a Penny Black, printed with 1840 methods, has been kept dry in a stamp album, it will have kept close to the original. According to the sources we have on painted linens (which include valuations which show how quickly newly painted cloths lost their value),  an unstable cloth, subject to its surface being folded and unfolded, will have in the vast majority of recorded cases, seen its images disintegrate quite quickly. According to the specialists such as the late Caroline Villers this is the best explanation for cloths such as the Shroud (‘The Turin Shroud ,one of the best-known surviving medieval images on a textile support’) but, as I have said, before, one awaits more systematic examination with modern scanning technology within the assumption that it likely that with its history of continual display in the open air  and visible to large crowds that the surface of the Shroud is not what it once was.\n\n","date":"December 5, 2015 at 6:43 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215678","author":"Charles Freeman","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Since the relic’s coating/image coloration can be scraped off or removed only with adhesive or diimide, actually just thinking alike Charles Freeman “anything old would have been degraded by the passage of time and the original form of the object might not be recoverable”, is definitely NOT “the best position from which to start understanding the original make-up of the Shroud images. \nReminder for Charles: Yeshu’a’s likeness on the cloth of Edessa was described of old as “imprinted” and consisting of “a moist secretion with no paint or artistic craft, transferred with no artistic intervention onto the cloth”. What does the historian Charles Freeman make of such Shroud Image-like characteristics of the Edessa image on the cloth: nothing!\n\n","date":"December 7, 2015 at 10:18 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215803","author":"Agnieszka Jaworowska","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Here Max Patrick Hamon, I’m commenting from Agnieszka Jaworowska’s place.\n\n","date":"December 7, 2015 at 10:21 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215804","author":"Agnieszka Jaworowska","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"As the Turin Shroud has nothing whatever In common with the Edessa image, I cannot see the relevance.\nThe description Max gives is typical of sacred images which someone wants to pass off as somehow miraculous as the Edessa image was assumed to be. How could the Edessa image be described as anything else if it was assumed to have the imprint from the moisture of Christ’s face on it. You would blow your cover if you described it as ,say, a painted cloth.\n\n","date":"December 7, 2015 at 11:48 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215805","author":"Charles Freeman","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"“Charles wrote: “As the Turin Shroud has nothing whatever In common with the Edessa image.  I cannot see the relevance”. \nActually the Shroud image ALIKE the Image of Edessa (in Yeshu’a’s likeness) can be described as “an imprint” and “a moist secretion with no paint or artistic craft, transferred with no artistic intervention onto the cloth”. Another historian, Ian Wilson, can see the relevance re the two characteristics if Charles Freeman just can’t \nBesides ALIKE the cloth of Edessa, (see The Acts of Holy Apostle Thaddaeus, –6th Century CE– that calls the cloth a tetradiplon (cloth doubled-in-four-layers),  a Greek term that only appears twice in historical texts, and both times refers to the Image of Edessa, the Turin Shroud was doubled in four layers (see the symetrical burn-marks as proof). \nCan some bell ring in a deaf the British Roman Historian’s ear? Has the word “relevance” a real meaning in British English?\n\n","date":"December 7, 2015 at 5:33 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215835","author":"Agnieszka Jaworowska","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"“Charles wrote: “As the Turin Shroud has nothing whatever In common with the Edessa image.  I cannot see the relevance”. \nActually the Shroud image ALIKE the Image of Edessa (in Yeshu’a’s likeness) can be described as “an imprint” and “a moist secretion with no paint or artistic craft, transferred with\nno artistic intervention onto the cloth”. Another historian, Ian Wilson, can see the relevance re the two characteristics if Charles Freeman just can’t \nBesides ALIKE the cloth of Edessa, (see The Acts of Holy Apostle Thaddaeus, –6th Century CE– that calls the cloth a tetradiplon (cloth doubled-in-four-layers),  a Greek term that only appears twice in historical texts, and both times refers to the Image of Edessa, the Turin Shroud was doubled in four layers (see the symetrical burn-marks as proof). \nCan some bell ring in a  British Roman Historian’s deaf ear? Has the word “relevance” a real meaning in British English?\n\n","date":"December 7, 2015 at 5:35 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215836","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Besides The Edessa cloth was described in turns as a “rakkos tetradiplon” (it already had the symetrical series of burn-holes and was , a “himation” (implying a piece cloth about 4m x 1m) and a… “SINDON”!\n\n","date":"December 7, 2015 at 5:40 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215837","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"There is nothing to link the Shroud of Turin with the Image of Edessa except in the imagination of I an Wilson and his followers who should have applied some more common sense to the issue. The Parthenon Cloth was always folded tetradiplon , e.g doubled four times to make sixteen layers, as can be seen on the cloth on the Parthenon frieze in the British Museum, so we have a precedent here to signify a cloth which has a sacred quality.\nFor years now as a result of following Wilson , no one has followed up the other leads which are established by ordinary historical methods,e.g. The first millennium tags on relics from Jerusalem including the ‘ Lord’s Tomb’ that are to be found in churches such as Chelles close to Lirey. Let’s get some real history, not imagination, into this one, Max!\n\n","date":"December 7, 2015 at 5:57 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215838","author":"Charles Freeman","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Max, from what you have written above, it seems that you may be of the view that the Mandylion and the Shroud were the same object.  Are you able to provide any references that the Image of Camuliana was no more than a facial image, as I have been unable to discover any such evidence, although I think it may be Fr Heinrich Pfeiffer’s assertion.  I do not know the reasons for this viewpoint.  Otherwise I believe the Camuliana may be a better candidate for the Shroud, and became known in Constantinople as the Image of God Incarnate.\n\n","date":"December 7, 2015 at 6:03 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215839","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Daveb, I am not of the view that the Mandylion and the Shroud were the same object. However at some point in time, methinks they were closely kept together in one reliquary as the Holy Face of the TRANSPARENT Holy Mandylion (now kept in Mannopello) was placed over the Shroud face. Hence the resulting confusion between a sudarium and a sindon (see the French word “suaire” that can be applied BOTH to a small face cloth and a larger shroud).\nMethinks Charles cannnot disicriminate between “tetradiplon” (re the result = folded/doubled infour layers) et “tetraplon” (re the process = folded/doubled four times = 16 layers).\n\n","date":"December 7, 2015 at 6:29 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215842","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"BTW Charles, can you account for the use of the Geek words tetradiplon (“folded in four layers”), rakkos (a rag most likely soiled and with holes), himation (implying a piece of cloth about 4.20 x 1.20 m to drape and adult man) to describe the Edessa cloth bearing Yeshu’a’s earthly likeness if the latter was a “small face cloth”? Show me what is your historical common sense really consist in, please. If the Edessa cloth is the Turin Shroud, all the above descriptions do make sense, if ever the phrase “to make sense” has a real meaning in British English!\n\n","date":"December 7, 2015 at 6:47 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215843","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Sorry for all the typos.\n\n","date":"December 7, 2015 at 6:51 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215844","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"The practice of covering the face of the dead (the Shroud face as face of a crucifixion victim can be regarded as equivalent to a “death mask”) is referenced in the Talmud (Moed Katan 27a). This could account for the placing of a transparent touched-up small burial face cloth over the Shroud face (Yeshu’a’?) for display.\n\n","date":"December 7, 2015 at 7:22 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215846","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Max- if you go to a Greek lexicon and work you way through the150 plus words beginning with tetra, the most likely translation is doubled over four times, as the Parthenon cloth was ( and so we have a good precedent for a cloth actually folded this way) . It is just possible that it could mean doubled into four, e.g. doubled twice, although, if this was the Shroud, this would leave a half figure exposed.\nMy guess is that tetradiplon came  generically to mean ‘ sacred’ after many centuries of being  the way that the ‘sacred’ Parthenon cloth was folded, and so gave status to the cloth that was given to Jesus to wipe his face on but this is purely speculative.\nWilson’s images show it doubled three times into eight so he is clearly out of the running on this one.\nWilson has muddied the waters in other ways, although those who actually believe his myth are also to blame. Not only has he discouraged research in alternative routes of the Shroud to Lirey but ,through the rIdicule he has earned from Byzantine scholars ( as you will find if you actually talk to scholars working in this complex field of Byzantine relic texts), he has discredited Shroud research in general.\nP.S.If you happen to believe that de Clari saw the Turin Shroud in the Blachernae Church, then you need to research the origins of that relic  collection. You will find that it leads back to the early fifth century Pulcheria , sister of the emperor Theodosius II , who imported relics direct from Jerusalem. No need to have the convoluted Edessa route which has a complete blank for the first five hundred years in any case. A direct Jerusalem link either to Constantinople or Northern France, both of which are documented for relic transfers, would be much more likely.\nAnd it might just be the case that the shroud was made in Europe on a medieval treadle loom in the early fourteenth century ( and it is a pity that the BBc could not afford to employ the weaver who said that she could recreate it on her treadle loom to show it was done).\n\n","date":"December 8, 2015 at 3:48 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215873","author":"Charles Freeman","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Hi Max! Where is the image of Edessa, or the cloth of Abgar, described as a “rakkos tetradiplon”?\n\n","date":"December 8, 2015 at 6:59 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215887","author":"Hugh Farey","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"To Charles: \nYou wrote: “Wilson’s images show it doubled three times into eight so he is clearly out of the running on this one.” Thank you, I was the first, in this very blog, to draw your attention on this very contradiction re Wilson’s alleged ‘reconstruction’ of the TS folding in Constantinople!\nThe Image of Edessa could have been stored with and without the touched up transparent burial face cloth (today most likely known as the Veil of Mannopello and most unfortunately reduced in size). Reminder: most curiously and strikingly, the Edessa cloth image iconography does show us Yeshu’a’s face BOTH with AND without a neck alike the Turin Shroud face image (apparently recorded with a ‘neck’ and looking like a bearded adult) and the Manoppello Veil face (without a neck an looking like a slightly bearded young man).  \nMost likely, “doubled onto itself in four layers” (see Greek tetradiplon, in reference to the result of the folding process), the Edessa cloth aka Turin Shroud was used as an altar cloth on Easter. Indeed, the TS four sets of symmetrical burn holes do document this specific folding mode. Besides the same Greek word tetradiplon could have also referred not so much to the result of the folding process as to the process per se and meant “doubled onto itself four times” so as to get 4X2 layers and have Yeshu’a’s face at the center of the folded large linen cloth kept in a ‘monstrance’ (reliquary with an agatha pearl-rimmed vast central oculus for the face only to be seen in conjunction or not with the touched-up transparent byssus cloth face placed over the Sindon face). Most likely this latter folding mode was used both in the periods between its exposures to the public and during solemn processions. \nCan you PLEASE account for the Edessa cloth being described as a himation (i.e. about a 4x1m sindon used to drape the body of a man)? Can you tell us how come the Turin Sindon set of four geometrical burn holes do refer to the same specific folding for a Byzantine altar cloth “folded onto itself in four layers” = tetradiplon? How come the Turin Shroud bearing the image of crucifixion victim’s face, alike the Edessa cloth bearing the face of Yeshu’a, can be seen as a dirty “old rag” (rakkos)? You STILL haven’t replied to my questions!\n\n","date":"December 8, 2015 at 1:02 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215910","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Still can you tell me the difference between “tetraplon” and “tetradiplon”, or can’t you?\n\n","date":"December 8, 2015 at 1:25 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215911","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Correction: How come the Turin Shroud bearing the image of crucifixion victim’s face can be describes as a dirty “old rag” (rakkos) alike the Edessa cloth bearing the face of Yeshu’a?\n\n","date":"December 8, 2015 at 1:35 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215914","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"And you haven’t replied to my question, Max. Where is the Shroud referred to as a “rakkos tetradiplon”?\n\n","date":"December 8, 2015 at 1:42 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215915","author":"Hugh Farey","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Hi Hugh, for the Greek word rak(k)os (=, “torn, pierced old “rag” or “rag moisted with secretion”)  in conjunction with the word tetradiplon to describe the Edessa cloth see the three texts derived from “The Teaching/Acts of Addai/Thaddai” and Dobbschutz, p.48** bis PG 121,345 C.\n\n","date":"December 8, 2015 at 2:59 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215919","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Max, I cannot believe that after years of Wilson reproducing his three doublings into eight you were the very first to spot something which is quite obvious except to those who believe that Wilson is some sort of guru whose word cannot possibly be challenged.\nNo idea about tetraplon – why is this relevant? \nNote: the word tetradiplon is used only of the cloth BEFORE Christ wiped his face with it- no text says that it was folded back this way.\nI have no idea why a solitary scholar who probably never saw the Image of Edessa described it as a himation.\nNo Byzantine scholar, and I mean people who actually can read original texts unlike Wilson, supports the Edessa theory. You seem to be in the group who accept it as true and try and manipulate texts to fit it rather than just accepting that it is without any foundation. But good luck anyway- it is just a pity that the endless attempts to make texts fit an imagined journey divert attention from the other possible and more likely routes of the Shroud from Jerusalem to Lirey, whether it came via Constantinople or not.\nI agree with you over the Turin Shroud being used at Easter – in the Quem Queritis ceremony most likely.  I suspect that when the Three Mary’s entered the ‘tomb’ to retrieve the Shroud, carrying an incense burner as the ritual for this ceremony demanded, they spilt the  incense as they bent down to pick up the shroud!\n\n","date":"December 8, 2015 at 3:20 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215922","author":"Charles Freeman","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Charles,  \nYou wrote: “There is nothing to link the Shroud of Turin with the Image of Edessa”. Oh really? \nYou mentioned Greek “words beginning with tetra” \n…but have “no idea” of what is the difference in meaning between tetraplon and tetradiplon and fail to see how relevant or irrelevant it is to the TS-Edessa cloth connection issue, which speaks volumes on how reliable your understanding of the word tetradiplon is! At some point in time, the TS was doubled in four layers and so used as a “tetradiplon” altar cloth. Ring some sindonological bell?\nThe Edessa cloth is described (see three ms derived from The Teaching/Acts of Addai/Thaddai” and Dobbschütz, p.48** bis PG 121,345 C) as tetradiplon in conjunction with the Greek word rak(k)os meaning “torn, pierced rag” “dirty kerchief/rag moisted with secretion” (= human body fluids). ring some sindonological bell?\nYou have “no idea” either why the Edessa cloth is described as a sindon and a himation too, which speaks volumes how thoroughly you studied “the relevance” of Edessa Image to the Turin Sindon! Answer: it was described as a himation because its was a sindon about four meters long and one meter wide i.e. the very length and width to drape a man’s body! Ring some sindonological bell?\nThe Edessa cloth bearing Yeshu’a’s is described BOTH as a dirty kerchief and a sindon about four meters long and one meter wide that was doubled in four layers and his moisted with human body fluids. Ring some sindonological bell? Etc.\nMethinks the real pity is in your non applying some more common sense and professionalism to the TS-Edessa cloth connection issue.\n\n","date":"December 8, 2015 at 4:52 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215931","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Typo: The Edessa cloth bearing Yeshu’a’s face is described of old BOTH as a dirty kerchief and a sindon about four meters long and one meter wide that was moisted with human body fluids and doubled in four layers.\n\n","date":"December 8, 2015 at 5:01 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215934","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Addendum: dirty kerchief/towel/rag\n\n","date":"December 8, 2015 at 5:16 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215936","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Thanks, Max. Sorry to be pushy but I only have access to one Greek version of the Acts of Thaddeus (Tischendorf and Lipsius), where ‘rakkos’ does not appear in conjunction with ‘tetradiplon.’ Indeed, it does not appear at all as far as I can see. I would be interested in your context. \nFor the benefit of other readers, there is a point to all this. The word ‘rakkos’ (or ‘rhakos’) does not necessarily mean ragged or tattered, nor does it derive from any word which implies it might. Although it means ragged in the Odyssey, in the bible it refers to the clean new patch which must not be sewn onto old wineskins (Matthew 9:16, Mark 2:21). I think the whole essence of the word is that it is a small piece of cloth cut or torn from a larger piece. If the Edessa image, or the Addai cloth, is anywhere described as a ‘rakkos tetradiplon’, it refers to something much smaller than the Shroud. Max’s idea that it means “torn, pierced rag” or, even more extremely, “dirty kerchief/rag moisted with secretion” is wildly over-interpretative.\n\n","date":"December 8, 2015 at 5:23 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215937","author":"Hugh Farey","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Hugh, you wrote: “Max’s idea that rakkos/rhakos means “torn, pierced rag” or, even more extremely, “dirty kerchief/rag moisted with secretion” is wildly over-interpretative.”\nIn Mat 9:16 and Mk 2:21, rhakos/rakkos means “torn/ragged piece of cloth”. The etymology of te English word rag is definitely the Greek word rhakos/rakkos! Besides in the Lexicon of Patristic Greekby Lampe, rhakos/rakkos refers to a large kerchief to wipe out a monk’s tears of compunctio! \nMethinks Hugh’s idea that is has nothing to do with human body fluids and a dirty old rag/lage kerchief/towel is wildly sub-interpretative.\n\n","date":"December 8, 2015 at 5:38 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215941","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Hugh, It is not because you cannot find the three references as variants from the Acts of Thaddeus that the word rakkos is not used in conjunction with tetradiplon  to describe the Edessa cloth! Are you kidding? See the Vienna ms (hist. gr. 45) + liturgical intructions (August 16th, Holy Mandylion day) + Georges Kedrenos’ relation in his Synopse des Histoires.\n\n","date":"December 8, 2015 at 5:50 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215942","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Addendum: the Lexicon of Patristic Greekby Lampe, rhakos/rakkos refers to a large kerchief to wipe out a monk’s tears of compunctio (PG 65, 105 C).\n\n","date":"December 8, 2015 at 5:52 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215943","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Hugh, could you tell why is the Edessa cloth is described IN TURNS  as a sindon, a himation (i.e. a piece of cloth about 4x1m) and a rakkos (a ragged cloth used as a large kerchief, towel or bandage)?\n\n","date":"December 8, 2015 at 6:02 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215945","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Typo: a large kerchief, towel or bandage to receive or wwipe out human body fluids?\n\n","date":"December 8, 2015 at 6:03 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215946","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Stephen Jones wrote: “A commenter on Dan Porter’s Shroud of Turin blog pointed out what I had previously realised, but had forgotten, that Dan’s “Tetradiplon” graphic illustrating how the Shroud of Turin, when “four-doubled” (Greek tetradiplon), with Jesus’ face uppermost, results in Jesus’ face only within a rectangle, in landscape aspect (exactly as in the oldest copies of the Image of Edessa), has a flaw in that it only shows three doublings of the Shroud (see above).”\nCharles, just guess who it was? Methibks alike Stephen Jones you “had previously realised, but had forgotten” till I pointed it out in words for you!\n\n","date":"December 8, 2015 at 5:29 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215940","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Max- anyone looking at Wilson’s illustration can see that he is misleading here. That sort of mistake is why he is not taken seriously as a professional historian.\nAnd if you read on in the tetradiplon article you will find that the burial shroud of Christ is referred to as a separate cloth from the one offered to Jesus.\nSo the tetradiplon text is actually one that shows that the Image of Edessa is not a burial shroud. Wilson misleads everyone in his text by suggesting that the word tetradiplon is used of the cloth after Jesus used it , not before. You seem to have been one of the many people misled by his text. There is absolutely b no evidence that the Image of Edessa was refolded as tetradiplon any more than there is evidence that the tetradiplon Parthenon cloth was refolded that way either.\nIf you were researching any exotic object in Europe whose origin was in the east, you would assume that it came along the documented trade routes. Similarly those who believe the shroud originated in Jerusalem should take as their starting point the  documented relic routes from Jerusalem to Northern France and from Jerusalem to Constantinople as their starting point, especially when we have relics from the ‘ Lord’s tomb’ in northern France\n\n","date":"December 9, 2015 at 2:54 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215958","author":"Charles Freeman","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"“Documented relic routes”? Hilarious. If this is supposed to be “professional history” then give me commonsense any day.\nOh, and anyone who considers Ian Wilson to be unprofessional should take a detailed look at his essays in past BSTS newsletters on the Lirey badge, the Machy Mould, the relationship between Geoffroi de Charny and King John the Good of France, the shortlived Order of the Star etc. OK, the link with the Image of Edessa was audacious, and probably wrong too, and less charitably still intended to sell a particular book, but Ian Wilson is not the only historian to have launched an eye-catching thesis to ensure brisk sales of a book (or magazine article).\n\n","date":"December 9, 2015 at 3:07 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215962","author":"Colin Berry","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Colin – why is this hilarious? There is tons of evidence of documented relic routes, notably, of course, from the Holy Land both before and after the Crusades.\nThe route to northern France- the most relevant for anyone researching the origins of the Shroud is explored by Michael McCormick in his The Origins of the European Economy AD 300-900, Cambridge University Press, 2001, Chapter Ten, ‘Hagiographical horizons: collecting exotic relics in early medieval France.’\nThe theme of this chapter is the revival of early trade in the Mediterranean, notably between the early Islamic states and mainland Europe. McCormick uses the evidence of relic collections in northern France that survive with their original tags attached to show that there was an early trade in relics between the Holy Land and France.  These relics include those from the ‘Lord’s Tomb’’\nIn addition to the northern French collections at Sens and Chelles, McCormick provides a text from the ninth century abbot of St.Riquier thanking the pope for sending him relics. After acknowledging the gifts from Rome he goes on to talk of his relics from other sources: ‘from Constantinople and Jerusalem, by the ambassadors sent there by more Lord [the pope], and next relics sent to us from Italy, Germany,Aquitaine, Burgundy and Gaul by the most holy Fathers.\nThere was, in fact, a busy trade in relics along documented routes, one of which was from Jerusalem to Constantinople in the years before Jerusalem fell to the Arabs.\nConstantinople. I attach a short extract from Holgar Klein- the expert on relics in Constantinople, from his’ Sacred Relics and Imperial Ceremonies at the Great Palace of Constantinople’ – found online on Holgar Klein’s website. He gives many more examples of relic transfers but Jerusalem to Constantinople was the obvious one, attested as early as the 320s when Helena sent Constantine relics.\n‘Apart from relics intended for private use and possession by members of the court, there were others that should develop a more prominent profile. One such relic arrived in the capital from Jerusalem around 421.45 Granted in exchange for an imperial gift of money for distribution to the needy and a golden, gem-studded cross to be erected on Mount Golgotha, the archbishop of Jerusalem sent the right arm of St. Stephen to Constantinople, where it was received with great honor and deposited in a small church, newly built by the emperor’s sister Pulcheria Augusta inside the Great Palace (fig. 1).46 Further relics of St. Stephen arrived in the capital in 438. As recorded by Marcellinus Comes, they were brought back from Jerusalem by the emperor’s wife Eudokia and deposited in the church of St. Laurence, another church associated with the name of Pulcheria.47 Earlier the same year, on 27 January 438, Constantinople had celebrated the arrival of the relics of St. John Chrysostom, whose body was brought to the capital from Komana, the city of his exile.’\nYou, as a scientist, might believe that Wilson is a professional. I can assure that he is treated with ridicule by other professional historians.\n.\n\n","date":"December 9, 2015 at 4:11 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215963","author":"Charles Freeman","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"No, Max, you’re wriggling. There is no way that Mark and Matthew use the word ‘rakkos’ to mean tatty, dirty, pierced, ‘moisted’ or unclean. It is specifically used to describe a clean new piece of cloth with which to patch wine skins. It may have been torn, neatly from a larger piece, and if so, the edges were not a clean as a knife cut, but to equate the word’s use in the bible with the dirty, holed sheet you are claiming is wholly unjustified.\nAnd I gather that you now agree that the Acts of Thaddeus do not use the phrase “rakkos tetradiplon”. This kind of stuff: “See the Vienna ms (hist. gr. 45) + liturgical instructions (August 16th, Holy Mandylion day) + Georges Kedrenos’ relation in his Synopse des Histoires,” is unhelpful. Can I ask, again, who, if anybody, referred to the image of Edessa or the cloth of Addai as a ‘rakkos tetradiplon’?\nI do not think a rakkos could possibly define a cloth as large as the Shroud, and its use to describe the image of Edessa or the cloth of Addai, if it was ever used, means that these artefacts could not be the Shroud.\n\n","date":"December 8, 2015 at 6:13 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215947","author":"Hugh Farey","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Hugh, you wrote: “No, Max, you’re wriggling. There is no way that Mark and Matthew use the word ‘rakkos’ to mean tatty, dirty, pierced, ‘moisted’ or unclean.”\nNo, I am not wriggling at all. Once more you’re attempting to put words in my mouth. Rakkos/rhakos per se DOES refer to a torn piece of cloth or rag. That’s a fact.\nIn a historical text (see e.g. Ian Wilson’s video “The Case for the Turin Shroud” at 22:20 and 22:35), the Edessa cloth face image of Yeshu’a is described as an “imprinted/impressed” and “moist secretion”. That’s another fact.\nIf the word rakkos/rahkos can refer to a clean new piece of cloth just cut off from a larger cloth, it can refer to a dirty torn (cut and resewn on the main body of cloth?) old piece of cloth or rag TOO. The word can be used BOTH pejoratively AND deprecatorily. That’s another philological fact you most curiously dismissed. \nBesides, out of intellectual laziness, you misleadingly wrote: “This kind of stuff: “See the Vienna ms (hist. gr. 45) + liturgical instructions (August 16th, Holy Mandylion day) + Georges Kedrenos’ relation in his Synopse des Histoires,” is unhelpful. Can I ask, again, who, if anybody, referred to the image of Edessa or the cloth of Addai as a ‘rakkos tetradiplon’?\nMethinks you NEVER heard before or read the three texts I mentioned referring to the Edessa cloth not only as tetradiplon bur as rakkos too. That’s a real shame for an alleged “Shroud scholar”/shroudie. Had you, e.g. read Dubarle’s Histoire Anciene du Linceulde Turin jusqu’au XIIIème, pp. 105-106, you would have known the Edessa cloth is referred both as tetradiplon and rakkos in the Vienna ms (hist. gr. 45), in the Menaia i.e. the liturgical texts for celebrations\n(in reference to the annual fixed cycle of services in the Eastern Church) and in Patristic chronicles (see George Kedrenos’s chronicle, PG 121,345 C! All the three texts are derived from the Acts of Thaddeus. That’s another fact yu want to dismiss.Yes, shame on you! \nAfter dismissing all the above It ca facts, you wrote: “I do not think a rakkos could possibly define a cloth as large as the Shroud, and its use to describe the image of Edessa or the cloth of Addai, if it was ever used, means that these artefacts could not be the Shroud.”\nWrong! It can. Just take the TS, doubled it onto itself in four layers (tetradiplon) and you’ll get a long towel or rag (about 110x55cm) with scars of time such as a set of L- or slanted P-shaped  like hole burns (see Ian Wilson’s same video at 03:37 till 03:52) and an apparently “cut and resewn” lateral band. \nHugh, you can be wrong in your opinion NOT in your facts!\n\n","date":"December 9, 2015 at 6:58 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215976","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Typo: The word (rakkos) can be used BOTH pejoratively AND negatively. That’s another philological fact you most curiously dismissed.\n\n","date":"December 9, 2015 at 7:00 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215977","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Sorry, typing in haste: The word (rakkos) can be used BOTH positively AND pejoratively. That’s another philological fact you most curiously dismissed.\n\n","date":"December 9, 2015 at 7:01 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215978","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Hugh, BTW, on December 8, 2015 at 6:02 pm I asked you:\nCould you tell me/us why is the Edessa cloth is described IN TURNS as a sindon, a himation (i.e. a piece of cloth or sindon about 4x1m) and a rakkos (a torn piece of cloth used as a large kerchief, long towel or bandage when doubled in four layers (tetradiplon)? \nSTILL waiting for you reply!\n\n","date":"December 9, 2015 at 7:13 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215980","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"I wrote: Just take the TS, doubled it onto itself in four layers (tetradiplon) and you’ll get a long towel or rag (about 110x55cm) with scars of time such as a set of L- or slanted P-shaped like hole burns (see Ian Wilson’s same video at 03:37 till 03:52) and an apparently “cut and resewn” lateral band + stains of ‘moist secretions”/human body fluids (degraded blood and sweat).\nIn the Hungarian Pray codex, the TS doubled in four layers i.e. tetradiplon (as an altar cloth) is steganocally/cryptically depicted as a sarcophagus box oddly topped with a tilted slab.\n\n","date":"December 9, 2015 at 7:34 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215983","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Having seen numerous paintings with sarcophagi and tilted lids, I just love Max’s explanation for the cryptic Shroud. It really has lightened my day! I still can’t make out whether Max thinks he is being serious or whether he is having us on!\n\n","date":"December 9, 2015 at 8:24 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215989","author":"Charles Freeman","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Charles, what exactly do you know about Benedictine monk use of steganography and cryptography applied to medieval images an illustrations? NOTHING!\n\n","date":"December 9, 2015 at 10:54 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-216009","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"So the pray Codex is a Benedictine production?\nWell, I prefer that Max is just having us on- it is much more entertaining to read his posts that way.\n\n","date":"December 9, 2015 at 11:28 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-216014","author":"Charles Freeman","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Charles, do you infer the HP ms is not a Benedictine production? Are you just kidding or just ignorant of the fact? Do your historian homework unless you are just having me on, so funny!\n\n","date":"December 9, 2015 at 12:42 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-216028","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"I asked you for your evidence that it was a Benedictine production. No description of it suggests this but no doubt you can give a Hungarian Benedictine monastery that used Hungarian rather than Latin for their texts. So please go ahead!\n\n","date":"December 9, 2015 at 3:23 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-216040","author":"Charles Freeman","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Charles, Question for question, first how can you tell it is NOT a Benedictine production when you are totally ignorant of Benedictine monks’s medieval cryptography, steganography and iconography? What are your sources/criteria? On which ground can you assert the HP ms is not a Benedictine production, I very much like to know! What do you mean exactly by your most cryptic “NO DESCRIPTIONS (upper cases mine again) of it (= the HMP ms illustrations) SUGGEST (upper cases mine) it is a Benedictine production). Can you substantiate your assertion or are your words just words of contradiction? Substance, please!\n\n","date":"December 9, 2015 at 3:57 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-216044","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"I am not saying that it is not a Benedictine production- I am being neutral,of who produced it -you are the only person I have ever come across who says that the Pray Codex- do you mean all the texts or just this picture- is Benedictine in origin so I am asking you why you think this.\nYou would need to provide a Benedictine monastery which is a pioneer in writing its texts in Hungarian rather than Latin and explain why it did so.  So far as I know the Pray Codex has not been linked to any monastery but you obviously know better.\nSubstance to your assertion,please.\nAnd please don’t a wriggle out again- Hugh and I are on your case!\n\n","date":"December 9, 2015 at 5:48 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-216067","author":"Charles Freeman","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"No, Max. Good try, but no. I agree that ‘rakkos’ has been used both as a dirty cloth and a clean cloth – indeed, I said so myself if you recall – but your arbitrary announcement that it meant a dirty cloth in this case was unjustified. And the fact that any particular ‘rakkos’ might be full of holes or dripping with secretions does not mean that the word itself implies any such thing.\nThe word as used by the other sources you mention is not derived from the Acts of Thaddeus. It may be that, assuming the Acts of Thaddeus to be referring to a small cloth, that is why Kedrenos introduced it.\nAnd I disagree with your opinion about a ‘rakkos’ being as large as the Shroud. You don’t make a small cloth by folding up a large one. The best you have come up with here is a ‘large kerchief’, which by no stretch of the imagination can be 4m long.\nAnd no, you didn’t ask me about sindons or himations, you asked Charles. However, I would agree that you would have some philological justification if the same author, in the same place, referred any cloth as both a ‘rakkos’ and a ‘himation’. Is this in fact the case? A quote from John of Damascus might help your argument.\nAnd the Pray Codex, of course, shows no such thing, cryptosteganographically or otherwise.\n\n","date":"December 9, 2015 at 9:09 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-215991","author":"Hugh Farey","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"NO Hugh, bad try in light of the historical text that describes the Edessa cloth face image per se as “impressed/imprinted and a “moist secretion” in conjunction with the Greek words rakkos, tetradiplon, sindon and himation (an about 4x1m sindon used to drape a human body) used to describe the cloth per se, a sceptic observer can see the latter as a dirty towel or rag 110x55cm or a precious relic of Yeshu’a’s blood and body.\nYou wrote; “And I disagree with your opinion about a ‘rakkos’ being as large as the Shroud. You don’t make a small cloth by folding up a large one.”\nDon’t you put words in my mouth and distort my opinion when actually I do mean an himation i.e. a sindon about 4x1m that makes a small cloth showing a set of burn hole in conjunction with a round stain and body secretion (degraded blood  and sweat) by folding the roughly 4m long and 1m wide sindon.\nWhether the observer is an anti-authenticist or an authenticist he will tend to see the cloth folded onto itself in four layers as a dirty rag or a clean towel. Both readings are possible AND can be subjectively justified. See e.g. the following site http://www.rotten.com/library/religion/relics/shroud-of-turin/ Its first sentence reads: “The Shroud of Turin: a dirty cloth, a work of art or a miraculous relic?”\nStill putting words in my mouth and distorting my opinion, you misleaddingly wrote: “The WORD (upper cases mine) as used by the other sources you mention is not derived from the Acts of Thaddeus.” I NEVER say the word (rakkos) was derived from the Act of Thaddeus BUT that it was found in three texts derived from the Acts of Thaddeus. Can you get it right or can’t you to clutch at less than straws?\nThe TS whether doubled in four layers or folded onto itself four times to get 4×2 layers can look like a towel (roughly 110 long and 55cm wide) with a set of hole burn hole back and front + an apprently ‘cut and resewn’ lateral band + “moist secretion(s)” (degraded blood and sweat) + a round stain back and front or a large kerchief (55 high and 110 wide) bearing “the moist secretion” of Yeshu’a’s “imprinted” face.\nCan you account for the Edessa cloth being called a himation and sindon since a himation is a roughly 4x1m sindon? YOU JUST CAN’T unless you admit it can refer to the TS in light of additional pieces of textual and archaeological evidence (reconstruction of the specific folding)!\nIn conclusion, you wrote: “And the Pray Codex, of course, shows no such thing, cryptosteganographically or otherwise.”\nActually it does to the eye-and-brain of somebody familiar with Benedictine steganoraphy and cryptography, medieval images and has a very good descriptive knowledge of the TS in light of the HP ms illustrations.\nYou may excel as a Teacher of the Science of the Earth, indeed you’re a very poor medieval Benedictine monk image crypanalyst or steganalyst. You have NO EYES for steganographic forms no question.\n\n","date":"December 9, 2015 at 10:48 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-216008","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Splendid. Now, focus on the question, Max. Does any author refer to the image of Edessa or the cloth of Addai as both ‘rakkos’ and ‘himation’ in the same article? Many thanks.\n\n","date":"December 9, 2015 at 11:10 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-216012","author":"Hugh Farey","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Hugh, shall I endlessly repeat: if the rare word tetradiplon is isolated in the Acts of Thaddeus (9th c. CE ms, Paris, Bib. Nat., 548 gr.), the same rare word is specified by rakkos (torn piece of cloth, towel or rag) in three derived texts (see above).\nActually the astute reader has to FOCUS ON ALL the descriptions made of the Edessa cloth\nbearing the image of Yeshu’a’s face (see historical texts AND legends) not just one text and make a synthesis of the said descriptions. Then and only then, he could see they do point at a himation (i.e. a sindon about 4x1m) doubled in four layers or folded four times that looked like a clean towel, dirty rag or large kerchief with the ‘moist secretion’ (degraded sweat and blood, –see the two traditions first just sweat then sweat and blood–in The book of ceremonies / Constantine Porphyrogennetos) of Yeshu’a’s face imprinted/impressed onto/into the sindon tetradiplon. \nArcheaolgically speaking, the Turin Himation/Sindon-Edessa Himation/Sindon/Tetradiplon/Rakkos connection works indeed!\n\n","date":"December 9, 2015 at 12:19 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-216025","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"No, don’t repeat anything, Max, just answer the question: Does any author refer to the image of Edessa or the cloth of Addai as both ‘rakkos’ and ‘himation’ in the same article? Many thanks.\n\n","date":"December 9, 2015 at 12:35 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-216027","author":"Hugh Farey","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Methinks you cannot read my English. for sure I won’t repeat anything.\n\n","date":"December 9, 2015 at 12:44 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-216031","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Reminder for Hugh (just in case he still could not get it): the himation (garment draped around a human body) looked like a rakkos (a torn piece of cloth/towel/rag) 110cm long and 55cm wide (i.e. two cubits long and one cubit wide) when doubled in four layers.\n\n","date":"December 9, 2015 at 12:49 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-216032","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"No, Max. The word ‘rakkos’ cannot mean a 4m long piece of cloth. Not at all. Never.\nUnless, of course, somebody has used it in conjunction with the word ‘himation’….\n\n","date":"December 9, 2015 at 2:07 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-216038","author":"Hugh Farey","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"The Edessa cloth is described BOTH as a himation AND a rakkos in the corpus of the texts and legend that describe the relic, that’s a fact. \nTo solve the apparent contradiction, the very synthesis of the descriptions of the Edessa cloth does imply the himation/sindon 4x1m can look like a towel/rag when doubled in four layers see PLEASE WATCH Ian Wilson’s video for an illustration of this at 03:37 till 03:52. Without even his knowing it, Ian Wilson proves via its reconstruction, the TS when doubled in four layers, does prove the Turin Sindon/Himation can look like a towel much like rag about 110 LONG and 55cm WIDE bearing scars of time such as a set of L- or slanted P-shaped like hole burns, an apparently “cut and resewn” lateral band, a roundish stain front and back and stains of ‘moist secretions”/human body fluids (degraded blood and sweat).\nWhat about you? Can you account for the Edessa cloth being described in the same corpus of historical texts and legends that describe the relic as BOTH a himation AND a rakkos/towel/rag or can’t you? BTW this is the third time I’am asking you! How long will I wait for your an answer? You are good to ask questions but not as good to provide answers!\n\n","date":"December 9, 2015 at 4:25 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-216052","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Typo: How long will I wait for your to answer my question? You are good at asking questions but not as good to provide answers!\n\n","date":"December 9, 2015 at 4:27 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-216053","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"No, Max. A corpus is not an article. John of Damascus appears to have thought that the image of Edessa/Addai was a long cloth. The Acts of Thaddeus and Georgius Cedrenos seem to have thought it was a kerchief sized cloth. One of the two traditions is wrong. Nobody has described it being both at the same time. The fact that a long cloth can be folded to look like a small cloth is not an adequate reconciliation of the dichotomy.\n\n","date":"December 9, 2015 at 5:29 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-216064","author":"Hugh Farey","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"No Hugh. An article is not a corpus of testimonies. Besides, the two traditions can be right! The only snag with you is you have to dismiss data that doesn’t fit into your pre-conceived idea as if the either/or decoding was the sole answer the both/and decoding could not prevail for the Edessa cloth just because you are unable to cope with ALL the data (intellectual laziness).\n\n","date":"December 9, 2015 at 6:02 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-216068","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"or just because you think the TS is a 14th c. CE fake!\n\n","date":"December 9, 2015 at 6:05 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-216070","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Hugh, methinks you should study Yeshu’as/Christ’s himation and loros Byzantine iconographies. They could tell you how the loros once symbolized Yeshu’a’s himation/sindon doubled lenghwise in two layers and used as a long ceremonial scarf draped around the body much alike a himation.\n\n","date":"December 9, 2015 at 6:23 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-216071","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Reminder for Hugh:  The Byzantine loros a lavishly adorned long ceremonial scarf (worn only by the Imperial family, twelve of the most senior officials and archangels) was symbolic of Yeshua’s burial shroud bearing his transluscent body image and blood imprint.\n Now the first representations of the loros are on coins from the reign of Justinian II (r. 685–695 CE and 705–711 CE). Besides, on a late 13th c. CE altar antependium, the loros worn by two archangels  (Michael and Gabriel) each time shows exactly the same herringbone pattern as the TS and is draped around each archangel’s body in the same way an himation was. Ring some bell?\n\n","date":"December 9, 2015 at 6:56 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-216073","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Yawn! That’s me, Max, bone idle – but right! While you scurry about making up unjustified assertions and philological prestidigitations – all wrong! Never mind, it’s all such… yawn… fun…\n\n","date":"December 9, 2015 at 6:35 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-216072","author":"Hugh Farey","site":"shroudstory"},{"title":"The Sudarium:  A Better Provenance and History?","post":"Hugh, you won’t be right as long the facts won’t go away! I mean substance and out of intellectual laziness and prejudice, you’re just dimissing a literary data on a ‘take-and-leave’ fact. For what do you make of the Edessa cloth described of old as a himation (a 4x1m sindon): NOTHING since the description (an himation/sindon) fits too well with the Turin Shroud (436x111cm – 440x113cm)! YOU got it all wrong! Go to bed lazy intellectual!\n\n","date":"December 9, 2015 at 7:09 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","id":"comment-216074","author":"Max Patrick Hamon","site":"shroudstory"}]
