[{"title":"How good is the match up between the Sudarium and the Shroud?","post":"I was fortunate enough to have the opportunity a few weeks ago to spend the afternoon with Dr. Alan Whanger & one of the things we discussed was the overlap of the bloodstains on the two cloths.  He demonstrated the polarized overlay technique which allowed going between the Shroud & the Sudarium as you wished-Each image is projected separately through a polarized filter, then a hand-held filter is used to switch back & forth.  For me, this was a huge help in appreciating the congruence between bloodstain patterns, especially the neck region on the dorsal image of the Shroud-I had always found it somewhat difficult to compare specific areas in photographs between the two.  I am unsure if this has ever been computer simulated to overlay/morph between them, but I found this type of approach extremely helpful.\nBlood typing comparison is an exclusion type test; the only definitive conclusion that can be made from such studies is if distinct blood types exist, indicating that the cloths could not have wrapped the same person.  In the case of the Shroud and Sudarium, with the same blood type, AB, such results are consistent with the idea that the cloths may have at one time covered the same individual, but they are by no means conclusive.  The overlap in bloodstains helps to provide additional evidence of a shared relationship.  \nIf feasible, it would be interesting to evaluate mitochondrial DNA isolated from the bloodstains on both cloths (unlike chromosomal DNA, which is inherited from both parents, mitochondrial DNA is received only from the mother; mitochondrial DNA is typically less fragmented than nuclear DNA and more copies per cell exist).  This is again an exclusion type test, but the chance of two unrelated individuals having the same mitochondrial DNA is extremely low.\n\n","date":"August 2, 2012 at 7:27 am","url":"https://shroudstory.com/2012/08/02/how-good-is-the-match-up-between-the-sudarium-and-the-shroud/","cat":"blood_studies","id":"comment-14409","author":"Kelly Kearse","site":"shroudstory"},{"title":"How good is the match up between the Sudarium and the Shroud?","post":"Kelly always provides delightful and informed new insights with her comments, and this polarized overlay technique of viewing the two artifacts is yet another example.  A computer simulation overlay/morph as she suggests can’t be all that too difficult to set up and it would be a fascinating exercise to see the results.  Her scientific conservatism in referring to such tests as “exclusion type” is understandable from her disclipined approach, but the correspondence found is at least peruasive if not corroborative for the ordinary layperson. \nWorldwide, the occurrence of blood type AB is 5.1%, about 3% in Europe, and about 8% in the Middle East.  The random probability that two blood-stained cloths would both be AB, is about 0.25%, giving quite a high likelihood that the two cloths are indeed associated.  A concurrence in mitochondrial DNA, if it could be so shown, would tend in lay-persons terms to be absolutely conclusive\n\n","date":"August 2, 2012 at 8:24 pm","url":"https://shroudstory.com/2012/08/02/how-good-is-the-match-up-between-the-sudarium-and-the-shroud/","cat":"blood_studies","id":"comment-14430","author":"daveb of wellington nz","site":"shroudstory"},{"title":"How good is the match up between the Sudarium and the Shroud?","post":"There is a wealth of evidence to the Sudarium and Shroud match. If anyone has not done so, I’d highly suggest they purchase the book linked to above, written by J. Bennett: “Sacred Blood, Sacred Image” it is an excellent read and covers all that is known of the Sudarium of Oviedo. As for the blood match; I personally have no doubt about it, but Kelly makes an excellent point about the DNA, in finally put this issue too bed…I doubt there would be a problem getting DNA from the Sudarium, from what I’ve read there is still blood scabs clinging to the cloth! The Shroud I think would be a different matter.\nI’d also like to mention I look forward in anticipation, to reading Kelly Kearse’s paper which should be posted this month on shroud.com\nR\n\n","date":"August 3, 2012 at 8:22 am","url":"https://shroudstory.com/2012/08/02/how-good-is-the-match-up-between-the-sudarium-and-the-shroud/","cat":"blood_studies","id":"comment-14441","author":"Ron","site":"shroudstory"},{"title":"How good is the match up between the Sudarium and the Shroud?","post":"For a long time, my estimation of the probability that the Sudarium was used on the same head than the Shroud was very high.  But since a month or so, I’m not so sure about that !!!  I have a very important question regarding the level of coherence between the 2 cloths.  I have send some emails to some researchers but so far, I never was able to get a precise response for this important question.  I have even done a Google research about that and come up empty, which I though was pretty strange…  So far, I just get an weak answer from the Spanish forensic researcher who has leaded the research about the Sudarium (doctor Hermosilla) who told me that the Spanish Centro could not answer me about that since it was a question relevant to Baima Bollone.  Since that time, I’ve tried 2 times to reach Baima Bollone (I’ve got his email adress from a friend) but go no reply, which is also a bit strange, since my question is very clever and relevant.  I still search to get a precise answer and when I’ll found it, I’ll come back to all of you via Dan to let you know both the question and the answer.  And I’m convinced that this answer will help us to evaluate more correctly if the Shroud and the Sudarium really were in contact with the same bleeding head.  I hope to found something in a near future… Stay tune !!!\n\n","date":"August 3, 2012 at 8:14 pm","url":"https://shroudstory.com/2012/08/02/how-good-is-the-match-up-between-the-sudarium-and-the-shroud/","cat":"blood_studies","id":"comment-14461","author":"Yannick Clément","site":"shroudstory"},{"title":"How good is the match up between the Sudarium and the Shroud?","post":"Colinberry stated; “but thats the least of his(Stephen Jones)problems as far as equating a burial cloth with a face cloth, both supposedly draped over the same part of the anatomy, AND PRESUMABLY COMPETING FOR QUALITY IMAGE TIME” (bold emphasis mine)…This statement proves without a doubt that colinberry has done little or no research when it comes to the Sudarium, or even the Shroud!! As he does not understand the simple fact that not only from scripture (John 20:7), but from details observed from the study of the Sudarium and also evidenced on the Shroud, that the Sudarium and the Shroud did not compete for image quality. As the Sudarium was removed before the the Shroud wrapped the body and before the image mechanism occurred. This point was made by Stephen Jones on his blog, I just thought it needed mentioning here.\nAs for his statement that there is “no correspondence whatsoever”, I think colin should atleast read one book on the subject of the Sudarium before making such rediculous comments. There is not just a simple “correspondence” of blood image shapes;( 70 points of congruence front and back to be exact), but also the stains are of very close dimensions, slightly larger stains are found on the Sudarium, as would be expected. The stains show the nose length being identical, as well as the beard stain on the Sudarium when compared to the Shroud. I can go on and on here, but that should be sufficient in my argument…\nR\nR\n\n","date":"August 6, 2012 at 6:02 am","url":"https://shroudstory.com/2012/08/02/how-good-is-the-match-up-between-the-sudarium-and-the-shroud/","cat":"blood_studies","id":"comment-14525","author":"Ron","site":"shroudstory"},{"title":"How good is the match up between the Sudarium and the Shroud?","post":"There is one more thing CB seems also not to be much aware: bloodstains and other body fluids on old linens shall be studied AT LEAST not only from reflected but also transmitted and raked light images + UV and X ray images.His approach is totally unscientific.\n\n","date":"August 6, 2012 at 6:31 am","url":"https://shroudstory.com/2012/08/02/how-good-is-the-match-up-between-the-sudarium-and-the-shroud/","cat":"blood_studies","id":"comment-14526","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How good is the match up between the Sudarium and the Shroud?","post":"Mistypings: There is one more thing CB seems not to be much aware of:\n\n","date":"August 6, 2012 at 6:33 am","url":"https://shroudstory.com/2012/08/02/how-good-is-the-match-up-between-the-sudarium-and-the-shroud/","cat":"blood_studies","id":"comment-14527","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How good is the match up between the Sudarium and the Shroud?","post":"Wasn’t the Sudarium carbon-dated to the 7th century? I think I read that somewhere.\n\n","date":"August 6, 2012 at 10:57 pm","url":"https://shroudstory.com/2012/08/02/how-good-is-the-match-up-between-the-sudarium-and-the-shroud/","cat":"blood_studies","id":"comment-14556","author":"Tim","site":"shroudstory"},{"title":"How good is the match up between the Sudarium and the Shroud?","post":"When it comes to CONCLUSIVELY carbon date claimed old burial linens,  history of their conservation conditions (and first and foremeost the specific burial rite they were subjected to)  is vital information. Now both for the Turin Sindon and the Oviedo Sudarium much of the information is lacking\n\n","date":"August 7, 2012 at 7:43 am","url":"https://shroudstory.com/2012/08/02/how-good-is-the-match-up-between-the-sudarium-and-the-shroud/","cat":"blood_studies","id":"comment-14569","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How good is the match up between the Sudarium and the Shroud?","post":"Check a copy of an article by Jim Dunning originally published in “Ireland’s Magazine”, and can be viewed on a website devoted to “Mystics of the Church”.  Title of article: “THE SUDARIUM OF OVIEDO AND THE SHROUD OF TURIN”.  View at: http://www.mysticsofthechurch.com/2010/03/sudarium-of-oviedo-and-shroud-of-turin.html  \nThere seems ot be some good solid info here, assuming it’s reliable:  Extract: \n“The Sudarium was subjected to Carbon 14 dating by a Professor Baima Bollone and the resulting date was the 7th century, but the Professor himself was unable to vouch for the test’s validity. His actual words in his contribution to the First International Congress on the Sudarium of Oviedo were : ‘The result is not easy to interpret due to the well known difficulties of dating textiles and to the conditions under which the sample was kept when it was taken in 1979 until it came to us in 1983.’ A supporting statement from the Conference reads : ‘Textiles left alone in normal atmospheric conditions are prone to becoming highly contaminated…. The Carbon dating should be nothing more than a stimulus to more precise investigation under better conditions.’ ”\n“Since then more precise investigations have taken place. In particular, scientific comparisons have been made of the bloodstains on the Sudarium with those on the Shroud of Turin. Tests have shown that the man whose face the Sudarium covered, like the man of the Shroud, had a beard, moustache and long hair tied up at the nape of his neck into a pigtail. Since there were no signs of breathing he must already have been dead. The stains show a series of wounds produced in life by some sharp objects, such as thorns.” \nThere also references to pollen samples, history of the Sudarium, and comments on matching with Shroud, blood type etc. etc. .\n\n","date":"August 7, 2012 at 8:01 am","url":"https://shroudstory.com/2012/08/02/how-good-is-the-match-up-between-the-sudarium-and-the-shroud/","cat":"blood_studies","id":"comment-14570","author":"daveb of wellington nz","site":"shroudstory"},{"title":"How good is the match up between the Sudarium and the Shroud?","post":"For the Oviiedo Sudarium carbon dating see  the César Barta Gil paper, Datacion radiocarbonica del Sudario de Oviedo,  proceedings of the/Actas del “II Congreso Internacional sobre el Sudario de Oviedo” (2007), pp. 137 -155.\n\n","date":"August 7, 2012 at 10:03 am","url":"https://shroudstory.com/2012/08/02/how-good-is-the-match-up-between-the-sudarium-and-the-shroud/","cat":"blood_studies","id":"comment-14584","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How good is the match up between the Sudarium and the Shroud?","post":"Statistically speaking, the true reliability of 14c dating is only about 70% (from Barta’s, Meacham’s and Voruz & Meanen’s studies). It is even lower for textile samples.\n\n","date":"August 7, 2012 at 10:19 am","url":"https://shroudstory.com/2012/08/02/how-good-is-the-match-up-between-the-sudarium-and-the-shroud/","cat":"blood_studies","id":"comment-14585","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"How good is the match up between the Sudarium and the Shroud?","post":"Big +1 to Max’s references! One must also keep this very important point in mind; Radiocarbon Dating results ON THEIR OWN are irrelevant…(All evidence must be weighed in the course of study, with no exception!)\nOfcourse one also should educate themselfs on the shortcomings of C14 dating; Especially with textiles, and most especially with Linen/Flax materials themselves. Time and time again C14 results of linen have shown extremely difficult to sample. Countless examples of erroneous dating has occurred and much is still not understood as to why.\nAs for the Ballone c14 and as the saying goes; Garbage in, Garbage out.\n\n","date":"August 7, 2012 at 9:48 pm","url":"https://shroudstory.com/2012/08/02/how-good-is-the-match-up-between-the-sudarium-and-the-shroud/","cat":"blood_studies","id":"comment-14602","author":"Ron","site":"shroudstory"}]
