[{"title":"Paper Chase:  New observations on the Sudarium of Oviedo","post":"Who first thought up the idea of a pigtail? Every depiction of the Shroud from the Lier copy onwards shows the long hair round the back of the head. The pigtail effect is only where the original has deteriorated.\n\n","date":"December 5, 2014 at 7:42 am","url":"https://shroudstory.com/2014/12/05/paper-chase-new-observations-on-the-sudarium-of-oviedo/","cat":"archaeology","id":"comment-174748","author":"Charles Freeman","site":"shroudstory"},{"title":"Paper Chase:  New observations on the Sudarium of Oviedo","post":"ponytail – not pigtail\n\n","date":"December 5, 2014 at 7:58 am","url":"https://shroudstory.com/2014/12/05/paper-chase-new-observations-on-the-sudarium-of-oviedo/","cat":"archaeology","id":"comment-174750","author":"Stan Walker, MD","site":"shroudstory"},{"title":"Paper Chase:  New observations on the Sudarium of Oviedo","post":"The point remains that there is the assumption that the Image on the Shroud now is the same as the image of the Shroud in some previous century when quite clearly it is not. Obviously one can discuss what were the differences between now and then at different points in the past centuries but to assume that the Shroud has been physically inert for centuries  is very unlikely in view that it has not been given special conservation care.\n\n","date":"December 5, 2014 at 1:06 pm","url":"https://shroudstory.com/2014/12/05/paper-chase-new-observations-on-the-sudarium-of-oviedo/","cat":"archaeology","id":"comment-174772","author":"Charles Freeman","site":"shroudstory"},{"title":"Paper Chase:  New observations on the Sudarium of Oviedo","post":"The main point of the paper is not the ‘ponytail’, but the coincidence between the calcium deposits between both pieces. The sudarium is not a paiting, there is no image of any kind AFIK, which means no gesso. So then, if deposits of the same type are found in exactly the same locations that makes the case interesting. Why? Because the pieces are C14 dated centuries apart.\n\n","date":"December 5, 2014 at 2:10 pm","url":"https://shroudstory.com/2014/12/05/paper-chase-new-observations-on-the-sudarium-of-oviedo/","cat":"archaeology","id":"comment-174777","author":"Eric","site":"shroudstory"},{"title":"Paper Chase:  New observations on the Sudarium of Oviedo","post":"The main point is that two independent radiocarbon labs have dated the “sudarium” between the 7th and 9th centuries. Another invisible mending?\n\n","date":"December 6, 2014 at 3:17 am","url":"https://shroudstory.com/2014/12/05/paper-chase-new-observations-on-the-sudarium-of-oviedo/","cat":"archaeology","id":"comment-174870","author":"David Mo","site":"shroudstory"},{"title":"Paper Chase:  New observations on the Sudarium of Oviedo","post":"From Mark Guscin’s report from The Second International Conference on the Sudarium of Oviedo\nOviedo, Spain, 13-15 April 2007, in BSTS Newsletter No. 65 http://www.shroud.com/pdfs/n65part6.pdf \nJust weeks before the congress took place, new samples from the Sudarium were subject to carbon dating. Five samples were dated from five different cloths –three of them came up with the expected date, while the cloth from an Egyptian mummy returned a date of any time in the 19th or 20th centuries. The laboratory immediately concluded that the cloth (and the mummy) were fakes. The sample from the Sudarium was dated to around 700 AD. Scientist César Barta spoke about the carbon dating process, emphasising the fact that if carbon dating is always absolutely accurate, then we could just as well finish the congress there and then. However, there were several points to bear in mind – in specialist carbon dating magazines, about half the samples dated come up with the expected date, around 30% with an “acceptable” date, and the other 20% is not what one would expect from archaeology. The laboratory used (via the National Museum in Madrid) said they were surprised by the result and asked if the cloth was contaminated with any oil based product, as oil is not cleaned by the laboratory processes used before carbon dating and if oil is present on a sample, the date produced by carbon dating is in fact the date of contamination.\nI would like to know more details about the dating of Sudarium. Nevertheless given the correspondences between the Sudarium and the Shroud, and that it seems that they covered the face of the same man, there is a contradiction</B< between 1260-1390 AD dating for the Shroud, and circa 8th century for the Sudarium. Probably neither of these datings is correct.\n\n","date":"December 6, 2014 at 4:26 am","url":"https://shroudstory.com/2014/12/05/paper-chase-new-observations-on-the-sudarium-of-oviedo/","cat":"archaeology","id":"comment-174883","author":"O.K.","site":"shroudstory"},{"title":"Paper Chase:  New observations on the Sudarium of Oviedo","post":"I don’t know any radiocarbon dating done by the “National Museum”  in extremis. It is more, I don’t know any “National Museum” in Madrid. I know two previous dating made by the well reputed labs of Toronto and Tucson. It would be useful to know where these scandalous results of the test were published. In the official webpage of the “Centro Español de Sindonología” nothing is said about the radiocarbon dating, that is a subtil way of lying.\nAntonio Alonso was the unique independent participant in the scientific enquiry about the Sudarium of Oviedo. He is member of the Instituto Nacional de Toxicología y Ciencias Forenses (National Institute of Toxicology and Forensic Sciences). He is contrary to the position of Barta and had said: «La única evidencia científica es la del Carbono 14 y dice que la reliquia es falsa».”(“The 14 carbon is the unique scientific evidence we have and it says the relic is false”.) “…no estamos dispuestos a mantener un bulo».(“ We are not willing to support a hoax”).\nI don’t know any radiocarbon dating made after 1988 with a failure of 700 or1300 years. This is possible when some contaminant circumstances are detected or when the test was made in previous years, when de radiocarbon test was beginning. This is not the case of the Shroud of Turin. When two (or are they three?) labs coincide in the dating of a piece archaeologists are clear: this is strong evidence and no hearsay or indirect hint can contradict it.\n\n","date":"December 7, 2014 at 3:17 am","url":"https://shroudstory.com/2014/12/05/paper-chase-new-observations-on-the-sudarium-of-oviedo/","cat":"archaeology","id":"comment-175057","author":"David Mo","site":"shroudstory"},{"title":"Paper Chase:  New observations on the Sudarium of Oviedo","post":"What makes you think that I’m defending that? You need to give the agenda a breather, David.\nThe correlation between both pieces is not equal to authenticity, but it is interesting.\n\n","date":"December 6, 2014 at 5:38 pm","url":"https://shroudstory.com/2014/12/05/paper-chase-new-observations-on-the-sudarium-of-oviedo/","cat":"archaeology","id":"comment-174997","author":"Eric","site":"shroudstory"},{"title":"Paper Chase:  New observations on the Sudarium of Oviedo","post":"@ O.K.\nCan anyone elaborate which “Egyptian mummy” specimen is cited there?\n\n","date":"December 6, 2014 at 5:44 pm","url":"https://shroudstory.com/2014/12/05/paper-chase-new-observations-on-the-sudarium-of-oviedo/","cat":"archaeology","id":"comment-174999","author":"Eric","site":"shroudstory"},{"title":"Paper Chase:  New observations on the Sudarium of Oviedo","post":"See https://shroudstory.com/?s=Sudarium+dating\nSudarium is claimed to be heavy polluted by soot, wax, oil, smoke from the candles, even explosives (it was bombed by anarchists in 1934) and lipstick. it has a hole in the center made by the wax falling out of the candle. So -in theory at least -it is likely that the results are skewed. But of course I would like to know more details.\nAnd as it seems that Shroud and Sudarium covered the same face, the results -660-890 AD for Sudarium, and 1260-1390 AD for the Shroud -are incompatible, and thus unreliable.\n\n","date":"December 7, 2014 at 5:28 am","url":"https://shroudstory.com/2014/12/05/paper-chase-new-observations-on-the-sudarium-of-oviedo/","cat":"archaeology","id":"comment-175074","author":"O.K.","site":"shroudstory"},{"title":"Paper Chase:  New observations on the Sudarium of Oviedo","post":"A Soxhlet purification process, which I believe is standard in cases of suspected organic contamination, would have removed the pollutants. What was the cleaning regime?\n\n","date":"December 7, 2014 at 6:07 am","url":"https://shroudstory.com/2014/12/05/paper-chase-new-observations-on-the-sudarium-of-oviedo/","cat":"archaeology","id":"comment-175076","author":"Hugh Farey","site":"shroudstory"},{"title":"Paper Chase:  New observations on the Sudarium of Oviedo","post":"Truly, I would like to know myself, as all the informations on carbon-datings of the Sudarium are scarce and reported by non-specialists, like Bennett and historians Guscin and Hesemann.\n\n","date":"December 7, 2014 at 6:13 am","url":"https://shroudstory.com/2014/12/05/paper-chase-new-observations-on-the-sudarium-of-oviedo/","cat":"archaeology","id":"comment-175079","author":"O.K.","site":"shroudstory"},{"title":"Paper Chase:  New observations on the Sudarium of Oviedo","post":"Just I would like to remind on the Barrie’s site, on the Valencia conference page (http://www.shroud.com/valencia.htm ), there is listed a paper called Dating the Cloths by the C14 Method – The Oviedo Sudarium  by Felipe Montero Ortego. Unfortunately, it seems to published nowhere on the Internet. \nI planned to contact Ortego about this paper, and ask him whether he could allow Barrie to publish it -yet lacking time, and not hurrying with it, I haven’t done it yet. But of course someone may try to do it before me.\n\n","date":"December 7, 2014 at 11:30 am","url":"https://shroudstory.com/2014/12/05/paper-chase-new-observations-on-the-sudarium-of-oviedo/","cat":"archaeology","id":"comment-175104","author":"O.K.","site":"shroudstory"}]
