[{"title":"Charring, fluorescence and image-forming mechanisms. Beware Shroudology’s junk science and flawed logic…","post":"Here’s a comment from Carlos on The Other Site, using a Google translate from his Spanish first:\nJuly 30, 2012 at 9:26 pm | #5\n“Colin Berry has evolved, began burning the fabric with hot metal plates and now, shortly thereafter, maintained the hypothesis of light burn.Ha, ha, ha, ha.\nColin end up being a defender of the authenticity of the Shroud!\nI’m at that point, the light burn, according to Colin Berry.\nBe very careful with the use of words, associating the word burn (SCORCH) HIGH TEMPERATURE only a source of ERROR.\nA burn is an oxidation-dehydration and oxidation-dehydration there produced by HEAT (high temperature), oxidation-dehydration from COLD (low temperature), oxidation-dehydration by a chemical CHEMISTRY (without reference to temperature) likely …….. and other ways.\nLazzaro di obtains oxidation-dehydration of the fibril flax ultraviolet light apparently without appreciable increase in temperature…  ”\nIn Spanish: “Colin Berry ha ido EVOLUCIONANDO, empezó quemando las telas con planchas de metal caliente y ahora, poco tiempo después, mantiene la hipótesis de la quemadura por LUZ. ¡ ja, ja, ja, ja !.\n¡Colin terminará siendo defensor de la autenticidad de la Sábana!\nEstoy en ese punto, la quemadura por LUZ, de acuerdo con Colin Berry.\nHay que tener mucho cuidado con la utilización de las palabras, asociar la palabra quemadura (SCORCH) sólo con ALTA TEMPERATURA es una fuente de ERROR.\nUna quemadura es una oxidación-deshidratación y existe la oxidación- deshidratación producida por CALOR (alta temperatura), la oxidación-deshidratación producida por FRIO (baja temperatura), la oxidación-deshidratación por una sustancia química QUÍMICA ( sin tener relación con la temperatura)……..y otras probables maneras.\nDi Lazzaro obtiene la oxidación-deshidratación de la fibrilla del lino mediante luz ultravioleta al parecer sin aumento apreciable de la temperatura”\nReply:  I don’t recall if I have made any distinction between a light scorch and a heavy one, Carlos. But rest assured that when attempting to model the Shroud body image I prefer a light sepia-coloured scorch to a heavy red-brown one. OK, so some of my photographs show the latter, like those on my banner above, but that’s simply to display an image with more impact. \nYou mention Di Lazzaro. I  criticized him recently for some experiments he reported using hot coins to scorch, which he said would never reproduce the superficial image of the Shroud. My answer: well yes, if you operate at 230 degrees C, then you have arbitrarily chosen a temperature that guarantees pyrolysis of cellulose. I then stated what should have been obvious: use lower temperatures, ones that have little or no effect on cellulose, but which would pyrolyse the chemically more reactive hemicelluloses of the primary cell wall. That way you can achieve a highly superficial image. In fact, with careful control of temperature (and maybe time and contact pressure as well) one can get an image that is as faint and as superficial as one wishes. I’m afraid that coin experiment of Di Lazzaro’s did nothing to repair his reputation in my eyes after those OTT experiments of his late last year with the uv excimer laser beams, based on entirely fallacious grounds, i.e. that plain old thermal energy (conducted heat)  must invariably result in  excessive scorching. I repeat: one can make a scorch as light or as heavy as one wishes – that should be plain commonsense (a quality that our Dr. Di Lazzaro appears to be lacking).\nForgive my plain-speaking – but you too should try not to trivialize or misrepresent other people’s experimental approaches. I have shown serial thermal imprints from horse brasses as they cool down, showing how the image intensity fades progressively almost to nothing. I would not expect the faintest images to fluoresce under uv light, given they are unlikely to have proceeded to the later aromatic compound stage that one gets with higher temperatures and greater charring.\n","date":"July 31, 2012 at 8:22 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/07/26/charring-fluorescence-and-image-forming-mechanisms-beware-shroudologys-junk-science-and-flawed-logic/","cat":"1532_fire","id":"comment-402","author":"colinsberry","site":"colinberry"},{"title":"Charring, fluorescence and image-forming mechanisms. Beware Shroudology’s junk science and flawed logic…","post":"This comment has just appeared on The Other Site:\n Yannick Clément\nJuly 30, 2012 at 1:02 pm | #2\n “…   The bloodstains on the cloth are a huge PROOF that the Shroud is not some kind of artistic forgery… In that regard, the body image cannot be a scorch, unless you believe that the resurrection could have caused a light scorch on the top-most fibers of the cloth. If that’s an hypothesis you think is possible, then it would fit into the scenario #4 I describe in my article. But because scorched linen normally caused a fluorescence visible on UV fluorescence photos, the body image on the Shroud don’t react like a scorch, so I think it’s fair to say that this hypothesis is highly unlikely (to say the least)…”\nThere are two entirely different points made there, both of which I shall address briefly. Yannick persists in referring to “bloodstains” as indeed do most commentators (and I’m guilty of it myself, but for different reasons – I usually enclose it in quotation marks, but don’t like to overdo it). But the chief STURP authority on ‘bloodstains’ (Alan D.Adler) found there were no blood cells visible, no potassium worth speaking of, and even an anomalous porphyrin spectrum. His response: to claim that what we see is not whole blood, but a serum exudate from blood clots  (and the atypical spectrum was attributed to a novel, some might say fanciful complex with bilirubin). So why claim that the bloodstains PROVE the authenticity of the Shroud when even STURP failed to find whole blood, but instead a highly depleted  fraction thereof that might be described as serum with some scanty products of haemolysed red blood cells?  One cannot base a major argument for authenticity on blood when what is present is apparently not whole blood but a fraction thereof, whose presence depends on a series of hypothesised steps that release some components but allegedly hold back others. Sorry, Yannick, but you do not appear to understand the difference between fact and theory. You do not understand the rigour that is needed when framing a scientific argument. You do not understand that science works more often by disproving rather than proving.\nAs for the fluorescence argument, you are repeating the same old mantra – that if the Shroud image were the product of scorching, then it should show the same fluorescence as the blackened charred margins of the 1532 burn holes. That is faulty logic, and can also be shot down in chemical terms (read this posting, if you have not already done so, with its references to high-temperature pyrolytic products, notably those with aromatic ring systems, that are fluorescent but NOT likely to be formed at lower temperatures, ones that merely produce a faint sepia-coloured scorch –  recalling that the Shroud body image can be described as, wait for it, a faint sepia-coloured scorch).\n","date":"July 30, 2012 at 5:52 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/07/26/charring-fluorescence-and-image-forming-mechanisms-beware-shroudologys-junk-science-and-flawed-logic/","cat":"1532_fire","id":"comment-401","author":"colinsberry","site":"colinberry"}]
