[{"title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)","post":"Posted – just 5 minutes ago…\n","date":"January 25, 2016 at 6:39 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","id":"comment-6851","author":"Colin Berry","site":"colinberry"},{"title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)","post":"Until now I have only read your answer.\nSo…\nI am waiting for your “King Neptune”…\nProbably your future “Shroud-Legoland”\nwill offer several “new entries”.\n","date":"January 25, 2016 at 5:44 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","id":"comment-6850","author":"piero","site":"colinberry"},{"title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)","post":"Progress update: 25 Jan 2016\nAm now fairly confident that a contact image of the face would have been obtained using LOTTO (face up), not LUWU (face down) presentation to wet linen.  LUWU had its attractions, since the imaging is purely a function of the pressure and ‘give’ in the underlay, there being no manual moulding. The pressure helps solve the problem of the prominent nose – it flattens under pressure!  But there’s a downside to LUWU, as shown with modelling with terra cotta and doll’s head templates – the linen develops unsightly radial creases over which one has not control which would have compromised the end-result.\nSo for now at any rate the focus is on LOTTO, which is more variable in its outcome and less ideal for scientific modelling where reproducibility of results is the aim. But LOTTO it has to be.\nLOTTO has been piloted with the inanimate models (see above) to give promising results. But can it cope with a real human face, or will recourse be needed to a bas relief, as was considered the case by Garlaschelli with his “frottage” imaging with powders – a technology that has much in common with the one used here, except for the powder imprinting medium being on top of the linen, instead of sandwiched between template and linen?\nHere’s a rough and ready attempt on my part to see what happens to wet linen when pressed and/or stretched over the contours of my own face. The right hand was used to hold the camera so it’s a less than ideal result in the stretching department when one is forced to ‘let go’.\n\nIt may just be possible to obtain a satisfactory imprint, provided the wet linen is pulled down tightly over the extremity of the chin and then turned underneath. That tension helps flatten the nose AND allows for imprinting of the lips. Might one have an explanation for what I’ve previously termed the “baked-in chin/neck crease”? It has a small kink in the middle that some might think is the result of linen having been placed under tension and having buckled at chin level, so to speak..\nAs I said earlier, the direction of this project takes its cues from the results of practical modelling. There is no need or justification for rushing into full-scale modelling, especially as one can be fairly certain – based on prior experience –  that any results deemed unsatisfactory for whatever reason will be immediately seized upon as evidence that the basic approach is wrong.\n I say the basic approach is right. It’s getting the details right that is important, no easy task when there are few if any pointers from the STURP or any other previous  investigations as to the kind of technology employed. Everything is basically guesswork, though driven in this instance by the (literally) hands-on modelling.\n","date":"January 25, 2016 at 8:48 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","id":"comment-6847","author":"Colin Berry","site":"colinberry"},{"title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)","post":"can u show marks like the alleged whip marks on the SoT?\n","date":"January 25, 2016 at 4:55 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","id":"comment-6843","author":"Mutant Buzzard","site":"colinberry"},{"title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)","post":"Hiya MB.\nI’ve just added  a response to your question onto the end of this posting, together with this image from June 2012,\n\nHope that answers your question.  Blood is problematical, one need hardly say, albeit for entirely different reasons from body image.  But until one is ready to put on the table a credible explanation for the basal body image – or basal blood image, as per Adler and Heller whatever – there seems little point addressing  technological aspects of the blood problem in detail. Even the scientific aspects remain uncertain, given the atypical porphyrin spectrum which may or may not have been satisfactorily accounted for by Adrie’s vdH’s madder-mordanting  hypothesis.\n","date":"January 25, 2016 at 6:53 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","id":"comment-6846","author":"Colin Berry","site":"colinberry"},{"title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)","post":"Folk in general, and commentators in particular, are of course free to do their own experiments in accordance with their own priorities. What they should not be doing is attempting to impose their priorities on me.I have my own longstanding research programme, now in its 4th year, and have my own entirely scientific priorities, centred on (a) model building and (b) asking the the right questions, guided by model-building.\nTo complete this posting I have just added a final postscript, together with new previously unpublished postings from one of my model-building exercises, using a terra cotta model for the face,\nHere’s one of the attached photographs.\n\nI shall shortly be testing out an idea for improving the LUWU methodology. One might then be in a better position to decide whether the TS image, if as I believe a contact imprint, was made by LOTTO, LUWU or a combination of the two. That, and re-opening the question of the chemical nature of the TS image (polymeric partially-aromatized melanoidins, possibly with a lipid peroxidation involvement?)  are MY research priorities.\n","date":"January 24, 2016 at 8:35 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","id":"comment-6838","author":"Colin Berry","site":"colinberry"},{"title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)","post":"Colin, please call me Thibault and not TH.\nYou proposed a testable scientific model, namely the “flour imprinting model” for the TS image.\nNice.\nThis model must be tested and compared with the original.\nAt first glance, it seems that this model is interesting.\nOne of the main question is:  is it possible to get an imprint similar to that of the TS face using your model?\nI’m just asking the answer to this question, knowing that you could give us the answer easily.\nFor your information, I am doing experiments based on McCrone’s claims and based on own flour imprinting model (using a Christ-like bas-relief face).\n","date":"January 23, 2016 at 8:52 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","id":"comment-6836","author":"HEIMBURGER","site":"colinberry"},{"title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)","post":"I could have given you a very detailed account of my thinking, TH, with references to the amphipathic properties of egg yolk phospholipids, notably lecitihins, the historical use of egg yolk in tempera paints pre-oil paints etc etc.\nGiven the belligerent and insulting tone of this comment, you will have to wait while I get on with MY science.\nColin Berry MSc, PhD.\n","date":"January 22, 2016 at 9:13 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","id":"comment-6825","author":"Colin Berry","site":"colinberry"},{"title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)","post":"Still waiting for the result of your previous flour imprint model applied to a real human face and/or a bas-relief (not only the hands).\nNo more no less.\n","date":"January 22, 2016 at 9:18 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","id":"comment-6826","author":"HEIMBURGER","site":"colinberry"},{"title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)","post":"As I say, you will have to wait while I complete MY investigations in my own good time, and as I see fit, TH. I owe you no favours. Quite the contrary in fact, given your failure to correct serious errors in your previous pdfs that have attempted to debunk my previous experimental  findings and conclusions. Try doing your own open-ended research, unwedded to preconceptions, and then maybe we can discuss the nature of real objective science. I do not take lessons from you, a medical practitioner, TH, on how to do scientific research. Where else have you seen a viable model for the TS  body image comparable to the one I have developed with flour imprinting?\n","date":"January 22, 2016 at 9:34 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","id":"comment-6828","author":"Colin Berry","site":"colinberry"},{"title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)","post":"And now a new experiment with eggs! Why ?\nWhere are you going Colin?\nI am waiting for the result of your previous flour imprint model applied to a real human face and/or a bas-relief (not only the hands).\nScience (and the problem of the TS image) is not a game.\n","date":"January 22, 2016 at 8:59 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","id":"comment-6824","author":"HEIMBURGER","site":"colinberry"},{"title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)","post":"Lettering on the Shroud? U-shaped boxes? So how come I can’t see them on Durante 2002 images (“Shroud Scope”)  despite increasing (or as I would say, restoring) the contrast?  Why 3 different languages (supposedly)? Why are the claimed translations/meanings so inconsequential and yawn-provoking?  Why bother with such things when there are far more important issues that need addressing, like the precise chemical composition of the body image (something I’m deliberating on at present, being unimpressed with the STURP description  as “conjugated carbonyls”, at least where yellow fibre coloration is concerned, given that the simplest conjugated carbonyl, acrolein, CH2=CH-CHO is colorless.).\nFailed attempt to obtain a decent face on the doll you say? Failed attempt to get a complete face, maybe, though the part that did imprint had I thought captured a remarkable degree of detail. The flour imprinting technique is not well suited to imprinting off a smooth polymer, the flour failing to transfer cleanly and completely  to wet linen despite the template being smeared with oil etc to trap flour. See the late addition this morning to my current posting, where vegetable oil is replaced with egg yolk without better result (but egg yolk and egg white performed brilliantly  when imprinting off real human skin – my hand, indeed as good if not better than vegetable oil – see 3D-rendered  results). \n\nMy name is not uncommon in England. There’s the one you mention, there’s also Sir Colin Berry, the pathologist who’s an influential Govt advisor, and  there’s a now elderly radio disk jockey too.  I met another namesake at a friend’s wedding, purely by accident. None are relatives as far as I’m aware.\n","date":"January 22, 2016 at 6:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","id":"comment-6822","author":"Colin Berry","site":"colinberry"},{"title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)","post":"Colin,\nI ask to you a favor:\nAre you able to do an nteresting (and “simple”) new work on a face (not on hands)?\nI would be curious to see what are the exact differences (= different geometry = different immage): with the wooden (…or plastic) framework and without the framework…\nSo…\nI wait…\n","date":"January 23, 2016 at 2:55 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","id":"comment-6833","author":"piero","site":"colinberry"},{"title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)","post":"Why not try yourself, piero? The technique is exceedingly simple, once you have selected a template of your own choosing.. What I can’t guarantee at present is that flour will transfer cleanly and completely to wet linen from all template materials and surfaces.\n","date":"January 23, 2016 at 7:11 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","id":"comment-6835","author":"Colin Berry","site":"colinberry"},{"title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)","post":"Yes… the technique is exceedingly simple.\n— —\nUnfortunately I am too confabulatory and, moreover,\nI cannot work in my personal Lab!\nMy feeble points, my faults:\n– I must remember to avoid the humbling approach to your works…\n– I have to admit that I don’t find the time to deepen\nall your huge amount of works.\nYou are right if you want to avoid the production\nof hugger-mugger content in your blog, a situation\ngenerated from all the possible strange requests.\nBut it would be wonderful if you’ll write a positive\nanswer about my previous request.\nIt’s my belief that I need somebody who works,\nwho can build what I previously indicated.\nIn the past (several years ago) I asked to a Lab in order\nto see what we can observe (problem = gaseous diffusion\nand image geometry)  from linen clothes treated with\nLead Acetate submitted to the H2S gas (emitted, for example,\nfrom an object). This “little work” was indicated useful\nmodel to use in order to improve the knowledges.\nBut I didn’t received a positive answer.\nHere few lines (an, obviously, this is only\nfor the readers. Not for you!) about the\n“Lead Acetate paper” test:\n>This test is used for the detection of hydrogen sulphide.\n>Sulphides occur in the processing of raw oil and can\nbe found in gas, exhaust fumes and sewers.\n>As sulphides can be toxic even in low concentrations,\ncritical points are checked for the presence of\nsuch gases. Sulphide containing solutions will\nalso give a positive result using this test paper.\n>The test with lead acetate paper has been\nalmost universally used in gas testing, and\nit seems to be the one best adapted for that purpose.\nClearly this “old way” is very different with respect\nyour “flour imprint” and then was only a rough\nattempt to create an “useful model” for the alleged\n“cadaveric emissions”.\nIn any case this is the key issue to be explored:\nWhat should be the total amount of cadaveric emissions\nto get a picture like that of the Shroud?\nMaybe a mixed mechanism, multifactorial, can be\nmuch more realistic.\nHere I do not want to disturb too who use the\nelectronic nose (…and the possible statistics\nrelated to the measures done in morgues).\nSo…\nI hope you can also try to study (after the idea of\na particular wooden framework to use in order to\nimprove the area of the Face) the issue of the\npossible interactions:\n“flour imprint” with “gaseous emissions” …\nIn any case, I preserve all my doubts about\nthe possibility to obtain a good imitation about\nthat ancient hugely successful Image …\n— —\nAs usual, I wait for your next patient answer\nabout my purposals/queries.\n","date":"January 25, 2016 at 4:00 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","id":"comment-6848","author":"piero","site":"colinberry"},{"title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)","post":"Actually, I did briefly see a use for your wooden framework, piero, albeit in a non-authenticist context. But wishing to avoid a lot of sawing and nailing, I decided to achieve the same goal using the lid off an expanded polystyrene box and a Stanley knife. The purpose? All shall be revealed in my next posting, hopefully in the 24 hours that follow this comment (new posting). Look for a King Neptune likeness in the next flour imprint (tone-reversed) sporting  an apparent beard that is not actually present on the template,. \nSorry. I’m rather too busy right now to comment on entirely different approaches, like your proposed Pb++/H2S model. Piero: I have to say that were I in your position, I’d be placing orders on the internet right now for what are simple chemicals anyone can buy, and checking out those ideas to see if they work in practice.\nI now have to go and wash King Neptune with soap and water and  look at his attenuated image.\n","date":"January 25, 2016 at 4:35 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","id":"comment-6849","author":"Colin Berry","site":"colinberry"},{"title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)","post":"The pear-shaped head is easy to explain – some flour was left on the doll, failing to transfer from vinyl to linen. It’s possible I used to too much oil. I’ll repeat the tests with the faintest smear, just enough to assist uniform dusting with flour, and see if that gives a better result.\nYes, the cheeks were well-imprinted, but that’s hardly surprising, wouldn’t you say, given they are prominent on the doll, so receive more of the applied pressure from one’s imprinting hand than would the less elevated relief?\nHair? Yes, I’m interested to see whether hair imprints as well as skin, and whether there would be little if anything to distinguish hair from skin in the final imprint, as per the Shroud.\n","date":"January 21, 2016 at 5:49 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","id":"comment-6815","author":"Colin Berry","site":"colinberry"},{"title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)","post":"Yesterday I wrote:\n>Have you tried to add a framework (see also:\nthe strange U shaped sign on the Shroud)\nto sustain /  to support (in some manner) the cloth?\nI think you have understood that\nI referred to the subject similar to the presumed\n “two U shaped boxes” indicated by Marion and Courage\n(see also, for example, what wrote Mark Guscin on this subject:\n“The “Inscriptions” on the Shroud”, BSTS  Newsletter,\nNovember 1999).\nAltough one perhaps cannot agree with Marion\nand Courage (regarding the presumed writings),\nthe “U-shaped sign(s)” seems to still be an interesting\nopen argument.\nAm I wrong?\nSo…\nSince you are the proprietary of your blog and\nyou have disregared the argument, then\nI think is a real waste of time the idea to\ndiscuss (= I do not want to invade your blog with\nmy arguments) with you about the “presumed\nU-shaped sign” that (in my opinion) is present\non linen cloth.\nIn any case, I hope you will forgive me if\nI take this opportunity to ask:\nHave you an interesting objection against\nthe “U-shaped sign”?\n— — —\nA further speculation can be connected with the\nfamous “Fayum portraits”…\nUnfortunately there is no record of such particular objects\n(= wooden frameworks used to improve the imprint of\nthe Face…) as being used in the ancient burials.\nPerhaps they failed to obtain a decent image (perhaps like\nin your failed attempt to obtain a decent face with your doll)\nand then they turned their choice to the true picture (a\nportrait/painting) of the deceased persons…\nUntil now this can be only a fairy tale because no archaeological\nparallel can be adduced to confirm the presumed ancient\nuse of frameworks (for faces) in burials…\n— — —\nSorry…\nI have found another “Colin Berry” and he is\nProfessor of Cardiology and Imaging (Institute\nof Cardiovascular and Medical Sciences)…\nIs that professor perhaps a relative of yours?\n","date":"January 22, 2016 at 4:41 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","id":"comment-6819","author":"piero","site":"colinberry"},{"title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)","post":"The image of the head “pear-shaped” (therefore with\ndifferent geometry with respect the Face of the Shroud)\nis really curious … and the cheeeks seem to be too great.\nHave you tried to add a framework (see also:\nthe strange U shaped sign on the Shroud)\nto sustain/ tosupport (in some manner) the cloth?\nBut… what if you then add hair to the head of the doll?\n","date":"January 21, 2016 at 5:31 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","id":"comment-6814","author":"piero","site":"colinberry"},{"title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)","post":"The purpose of science is to illuminate – not to create an all-enveloping fog of ifs and maybes. Sorry piero. Someone had to say it.\n","date":"January 21, 2016 at 5:22 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","id":"comment-6813","author":"Colin Berry","site":"colinberry"},{"title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)","post":"Several years ago I had the opportunity to follow the special\ntheory of lightning (a thunderbolt !!?!)…\nThis lightning would have caused the fire, and according\nto some speculations even more daring was the cause\nof the radiocarbonic rejuvenation … (What do you think?).\nBut I never saw a careful analysis about the Fire of 1532: the exact\nignition origin, ignition time and flame spread (perhaps from a more\nexact visual inspection we can guess something)…\nFlame spread : see also the top layers of the cloth…\n— —\nFirst of all we have to remember that flame retardancy is measured\nby the amount of oxygen needed to support combustion\n(= Limiting Oxygen Index or LOI31).\nDo you know the “Critical Oxygen Index Apparatus”?\n>…To determine the minimum percentage of Oxygen\nrequired to just support flamming combustion of a material\nat Room Temperature in FTA mode or at a Higher Temperature\n(up to 400`C) in HFTA mode.  … …\n>…Test applicable for wide range of materials such as Polymers,\nCables, Textiles, … etc. … etc. …\nLinks:\nhttp://www.saassociates.com/criticaloxygen.html\nhttp://www.saassociates.com/products.html\n— — —\nHave you read the article by Hugh Farey?\nHere a further information about “hot iron” (…because\na magnet was used to ascertain that the temperature\nwas at least 770°C…):\n>…In the periodic table of elements only Fe, Co and Ni\nare ferromagnetic at and above room temperature.\nAs ferromagnetic materials are heated then the thermal\nagitation of the atoms means that the degree of alignment\nof the atomic magnetic moments decreases and hence\nthe saturation magnetisation also decreases.\nEventually the thermal agitation becomes so great that\nthe material becomes paramagnetic; the temperature\nof this transition is the Curie temperature,\nTC (Fe: TC =770°C, Co: TC =1131°C and Ni: TC =358°C).\nAbove TC then the susceptibility varies according to\nthe Curie-Weiss law. …\nLink:\nhttp://www.gitam.edu/eresource/Engg_Phys/semester_2/magnetic/types.htm\n","date":"January 21, 2016 at 4:31 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","id":"comment-6812","author":"piero","site":"colinberry"}]
