[{"id":"comment-210953","author":"marco_bella","post":"Dear Hugh, I am doubtful that even with the full set of spectra anyone would be able to draw any conclusion. It is difficult to understand mass spectra. With pyrolysis mass spectra you warm up a sample, chemical compounds are broken down, you see only some fragments. You have to solve a complex puzzle, sometimes without all the pieces. It might be feasible if you have one or two compounds, but with several molecules hardly any conclusion can be drawn. Consider that pyrolysis mass spectra was a technique used in the eighties. Do you remember the technology at that time? How computers and mobile phones looked like? Today, mass spectrometry has completely different instrumentation, and can give totally different information. With those spectra done in the eighties, we can just conclude that one is contaminated with a compound bearing a long aliphatic chain and besides that, they are the same. I tried to answer to all your concerns in this forum because it might be useful also for others, but if you need additional information for your article, please feel free to contact me..","date":"2015-09-22","mins":"3:31 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","title":"Faint Images:  The Case of the Shroud of Arquata"},{"id":"comment-214580","author":"marco_bella","post":"—————— Why did I not pay more attention when the paper was included in the Proceedings of the International Workshop on the Scientific approach to the Acheiropoietos Images in Frascati in 2010? —————– Maybe because the lyric singer Giovanna De Liso is more known for telling about her experiences of “alien abduction” and her photos of UFO. Sorry: only Italian ——– http://oggiscienza.it/2012/10/01/alieni energia piezonucleare e fusione fredda/.","date":"2015-11-13","mins":"4:24 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","title":"Nevertheless, the images are real enough!"},{"id":"comment-214583","author":"marco_bella","post":"I am surely not denigrating anyone! I enjoy classic music and I believe that Giovanna De Liso is a good singer. I can definitively say that her singing is much better that my piano playing. However, I am afraid I cannot share the same opinion about her “research”. The publisher “scientific research” is cited here: http://scholarlyoa.com/2015/01/02/bealls list of predatory publishers 2015/ And yes, there is little doubt that the opera singer, the earthquake “researcher” and the “occasionally” alien abducted are indeed the same person. Http://ocasapiens dweb.blogautore.repubblica.it/2012/10/21/sbigottimento/.","date":"2015-11-13","mins":"5:53 pm","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","title":"Nevertheless, the images are real enough!"}]
