[{"id":"comment-212204","author":"marco_bella","post":"Not that it really matters, but I understand that Gonnella made a survey of STURP team members’ religious beliefs. I think that only few were atheists. Rogers should have been listed as episcopal and some as “fundamentalist”. As said before, this is not really relevant. Scientists should be chosen only on the basis of 1) Scientific Reputation (CV) 2) Research Project. That it is how you get reliable results. Religion an nationality should be not taken into account. This is the way science is supported all over the world and I do not see why the study of the Shroud should be an exception..","date":"2015-10-10","mins":"1:40 am","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","title":"No Closer to the Truth Because of Simony"},{"id":"comment-212238","author":"marco_bella","post":"I quite agree with daveb. Highest costs in the STURP examination of 1978 should have probably been logistic and instrumentation. However, today we can get much more information with a fraction of that money. Just imagine how computers and cell phones (!!) looked in the eighties. A smartphone of today probably cost much less of the biggest computer available at that time and it is much more powerful. The same is true for scientific apparatus. The mass spectrometer reported in Rogers’ papers was at that time a state of the art apparatus, but today it is a technological fossil. With tiny amounts of sample a lot of questions can be answered. What is really needed is few reliable people who collect the samples and distribute to the selected laboratories. I believe that it should be relatively easy to find private sponsors and we are not looking to huge amounts. Real issues for new tests are not scientific, technological or financial, but human (get permission from Vatican; select trustable scientists; avoid “Mc Crone” like cases, in which someone that says something “undesired” is out of the project, and so on)..","date":"2015-10-10","mins":"12:45 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","title":"No Closer to the Truth Because of Simony"},{"id":"comment-212159","author":"marco_bella","post":"…the STURP results should be the starting point… ———— The starting point should be the radiocarbon done in 1988, when no STURP member was involved. If new studies should be done, they should be conducted as far as possible from the STURP approach. The STURP members payed most of their campaign of research by themselves. I am not sure that someone did actually receive a salary. In this way, one does not select the best scientists, but just those who strongly believe in the “mystery”. People who finance the research should be distinct from the scientists actually operating. A committee should raise the money. Conflicts of interest should be avoided as much as possible. The committee should select scientists who can present a scientifically sound research project, possibly not anymore regarding datation (since this is one of the few sure aspect). This project should be evaluated together with the scientist CV (expertise, education, scientific achievements etc). Radiocarbon can be repeated since it will not require much material as the one in 1988, and the new analysis can restrict the data range. Actually, the idea of Rogers to perform it on the charred material is a good one. Except from C14, I believe that the analysis should be decided by the scientists, not the people raising the money..","date":"2015-10-09","mins":"4:21 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","title":"No Closer to the Truth Because of Simony"}]
