[{"id":"comment-61247","author":"gian_marco_rinaldi","post":"Here is the source for Luther: “Wider das Papsttum zu Rom vom Teufel gestiftet” (1545). The sentence is: “… gleich wie sie mit der Veroniken auch thun, geben für, es sei unsers Herrn Angesicht in ein Schweistüchlin gedruckt, Und ist nichts, denn ein schwarz bretlin viereckt, da henget ein klaretlin für, darüber ein anders klaretlin, welches sie auffzihen, wenn sie die Veronica weisen, Da kan der arm Hans von Jene nicht mehr sehen, denn ein klaretlin für eim schwarzen bretlin, Das heisst denn die Veronica geweiset und gesehen, und hie ist grosse andacht, und viel Ablas bey solchen ungeschwungenen Lügen.” O.K. May indicate the words where Luther speaks of a transparent veil. I cannot find them. At any rate, Luther’s passage cannot be ranked as a first hand testimony..","date":"2013-12-17","mins":"10:32 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica."},{"id":"comment-61941","author":"gian_marco_rinaldi","post":"O.K., you can find English translations on the web, for example here (search for the word Luther): http://www.mutualart.com/Open Article/A Point–Ceaselessly Pushed Back—The O/36 D330 CF8 CEF6 AB6 or in the book “Life of Luther” by Sears, p. 144, available on Google Books. The word “Klaretlin” is practically unheard of in German, apart from that sentence by Luther. In very few examples I have found, German authors who refer to that passage, may intend it as a piece of cloth without specifying that it should be transparent. Add to it that Luther was writing in 1545 and had been in Rome many years before in 1510. He was not so much interested in giving a precise description as to discredit the cult of the Veronica. As far as I know, in the course of centuries there have been no statements by first hand witnesses who testify a transparent veil and the words of Luther, whatever they mean, taken alone have little weight. If you like transparent Veronicas, you find several examples in this page from a rich website: http://veronicaroute.com/tag/velo trasparente/ I do not worry about the words of Pfeiffer or Badde or Gaeta. They believe that the Manoppello veil was produced by a miracle 2000 years ago in a sepulchre in Jerusalem. May I think that the portrait is not beautiful enough for being a miracle?.","date":"2013-12-18","mins":"8:23 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica."},{"id":"comment-61007","author":"gian_marco_rinaldi","post":"In an article I published some years ago, I gave this example of Campin and two more examples of transparent veil. Flemish School, 15th Cent., Bourg en Bresse (look below the hands to see how much it is transparent): Michael Wolgemut, 15th Cent., Lorenzkirche Nürnberg which is a detail from this painting We can only conclude that among countless artists who painted a not transparent Veronica veil, there were just a few who painted a trasparent veil, among them the author of the Manoppello veil. A question for O.K.: How do you know that the Rome Veronica was transparent? Nobody knows what it looked like. The painters who painted a Veronica (at least those who painted before ca. 1600), as far as we know, had never seen the (supposed) original that was in Rome. They painted out of their fantasy and according to their own style. The one painter who might have had a chance to see the original was Ugo da Carpi who in 1525 painted this Veronica just for the altar (in old St. Peter) where the Veronica itself was kept. Http://veronicaroute.com/1525/04/29/1525 ca/ But there is no proof that Ugo had really seen the original. Possibly he copied the face from a mandylion like portrait that also was in Rome. At any rate his Veronica is not transparent. Ugo was copying from a contemporary drawing by Parmigianino which is shown at the end of the same webpage. He reproduces the drawing faithfully but changes the face of Christ, and rightly so, whether he had seen the original or not, because the style of Parmigianino was not compatible with a Veronica that should have been in Rome since several centuries and therefore had an earlier style. Neither the Manoppello painting is compatible..","date":"2013-12-17","mins":"2:15 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica."},{"id":"comment-191819","author":"gian_marco_rinaldi","post":"Imagine a man with a brush who put a stain “circa” where painters of his day put it. He would be amused in learning of your discussions..","date":"2015-02-25","mins":"1:07 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","title":"Maybe the Nails Didn’t Go Through the Wrists"},{"id":"comment-129516","author":"gian_marco_rinaldi","post":"One cannot but agree with Hugh Farey. If his examples are not enough, here are some more. Http://www.getty.edu/art/gettyguide/art Object Details?artobj=3409&handle=li.","date":"2014-06-14","mins":"2:29 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-192825","author":"gian_marco_rinaldi","post":"Heimburger: “Therefore, the lower rectangle can not be a representation of a sarcophagus.” If so, where is the sarcophagus? This it the scene of the women at the sepulchre. All similar scenes, besides the women and the angel, show the sarcophacus with its lid variously displaced if not absent (the tomb may have a different form in the Byzantine area or in various periods, but a tomb there must be),.","date":"2015-03-08","mins":"3:52 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"}]
