[{"id":"comment-73092","author":"gian_marco_rinaldi","post":"Hugh, you may try with this address of Onysko, hoping that it is still operative: dlonysko@integrityonline13.com Indeed it would be interesting to have a number of such photos published or somehow available. Those who might provide them are Alan Whanger and Paul Maloney, as far as I can tell..","date":"2014-01-11","mins":"6:44 pm","url":"https://shroudstory.com/2014/01/11/if-you-will-be-in-the-cleveland-area-on-january-25th/","cat":"event","title":"If you will be in the Cleveland area on January 25th"},{"id":"comment-27800","author":"gian_marco_rinaldi","post":"An entirely new website of the Turin Center is under construction. Check here: http://www.sindone.it/Index.htm?LL=it.","date":"2013-03-19","mins":"12:10 pm","url":"https://shroudstory.com/2013/03/19/junk-alert-more-on-the-official-website/","cat":"event","title":"Junk Alert:  More on the Official Website"},{"id":"comment-56306","author":"gian_marco_rinaldi","post":"The English text of the announcement in the official website: http://www.sindone.org/the holy shroud  english /news and info/00045909 Message from the Custodian of the Shroud.html.","date":"2013-12-04","mins":"8:15 am","url":"https://shroudstory.com/2013/12/04/official-an-extraordinary-exposition-of-the-holy-shroud-in-2015/","cat":"event","title":"Official:   An Extraordinary Exposition of the Holy Shroud in 2015"},{"id":"comment-126789","author":"gian_marco_rinaldi","post":"Mike M.: “you haven’t given the reason why Centini was unreliable”. Massimo Centini was born in 1955 and has a long career as an author of books. From the catalogue of an online bookshop, considering only the last few years, one finds that he has published 9 books in 2009, 13 in 2010, 9 in 2011, 5 in 2012, 9 in 2013, already 7 in 2014. I translate some titles: Witches in Piedmont: pages of history and mystery. The afterlife: the places of the soul. Plague in Turin: the city during the infection. Witchcraft in Insubria: popular tradition, the Inquisition and pagan rites between Lombardy and Piedmont. Unusual guide to the mysteries, secrets, legends and curiosities of Piedmont. Sacred medicine: travel among the magic medical practices of Italian folklore. Killing for Satan: devil and crime in Piedmont. The Big Book of the mysteries of Piedmont, resolved and unresolved. The places of the Apocalypse: a journey in the footsteps of the “end of the world”. Fantastic creatures: fairies, goblins, monsters and devils: travel in popular mythology in Piedmont, Liguria and Aosta Valley. Brothels in Turin: when the brothels were open. The great Italian crimes, solved or unsolved. Sea monsters: mysterious creatures between myth, history and science. The symbolic language of esotericism. Wicked Italians: the most shocking facts and personages of our history. The last mystery: the Shroud and the Knights Templar: when history and myth merge. The strangler of women: the dramatic story of Vincenzo Verzeni “sexual sadist, vampire and devourer of human flesh”. I do not say that Centini is unreliable as an author, but he can hardly be ranked as a specialist in ancient Byzantine history..","date":"2014-06-04","mins":"12:02 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-57074","author":"gian_marco_rinaldi","post":"Dan, the three messages you have translated with Bing are available in English on the official website sindone.org. Start from here: http://www.sindone.org/the holy shroud  english /00024122 The Holy Shroud.html.","date":"2013-12-07","mins":"6:10 am","url":"https://shroudstory.com/2013/12/07/the-shroud-of-turins-chamber-of-commerce/","cat":"event","title":"The Shroud of Turin’s Chamber of Commerce"},{"id":"comment-148828","author":"gian_marco_rinaldi","post":"Piero, for those of us who have not been trained in ancient alchemic wisdom, would you explain the difference between monoatomic gold, biatomic gold, triatomic gold etc.?.","date":"2014-09-05","mins":"1:45 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"}]
