[{"id":"comment-63393","author":"gian_marco_rinaldi","post":"From O.K.: “Look at this picture of 1350 frame, taken from Falcinelli’s paper. What’s there in the topmost corner?” I cannot see anything of interest. I have written to Roberto Falcinelli himself and he has kindly sent me another photo with a detail of that corner of the frame. There is only a small splintering in the glass pane. So what? I add that in the same Frascati 2010 paper by Falcinelli, just above its Fig. 15 that you have reproduced in your link, he quotes a sentence by Giacomo Grimaldi, early 17th century, where one, and only one glass is mentioned. Perhaps there had formerly been two glasses, but where have you found the information?.","date":"2013-12-20","mins":"1:37 pm","url":"https://shroudstory.com/2013/12/18/paper-chase-john-iannones-the-veil-of-veronica-fact-or-fiction/","cat":"history","title":"Paper Chase:  John Iannone’s The Veil of Veronica: Fact or Fiction?"},{"id":"comment-61983","author":"gian_marco_rinaldi","post":"It is true that the image of the St Peter Veronica now, and since some time, has almost completely disappeared. But this favours the hypothesis that the veil is still the same that was in Rome in medieval time. If the present veil was a new copy made at the beginning of 17th century, the image should now be still clearly visible. Indeed looking at the copy now in Vienna (ca. 1617) one may think that already then the original was degraded. Http://veronicaroute.com/1617/04/29/1617/ Possibly the painter of the Vienna copy did not see the eyes in the original, that had faded away, and painted a face with seemingly closed eyes. Other copies followed with closed eyes. There is no proof that the old frame, still extant in Vatican, had two glasses (or panes of rock crystal). Presently it has one (broken) glass and there is no indication that it had ever had two. Lastly, needless to say, the Manoppello veil is evidently an earthly painting, not a divine miracle..","date":"2013-12-18","mins":"10:37 pm","url":"https://shroudstory.com/2013/12/18/paper-chase-john-iannones-the-veil-of-veronica-fact-or-fiction/","cat":"history","title":"Paper Chase:  John Iannone’s The Veil of Veronica: Fact or Fiction?"},{"id":"comment-64264","author":"gian_marco_rinaldi","post":"O.K., if you contact Roberto Falcinelli, he is ready to share the details of his examination of the frame and his photographic documentation. You find his email address for example in his Frascati 2010 paper that you know (and is available on the internet). As to the label of the frame in the Museum, Falcinelli tells me that it has been recently changed. Now it reads simply: “Antica cornice [ancient frame] della Veronica, già Volto Santo”.","date":"2013-12-21","mins":"11:49 am","url":"https://shroudstory.com/2013/12/18/paper-chase-john-iannones-the-veil-of-veronica-fact-or-fiction/","cat":"history","title":"Paper Chase:  John Iannone’s The Veil of Veronica: Fact or Fiction?"},{"id":"comment-31991","author":"gian_marco_rinaldi","post":"The Templecombe panel was radiocarbon dated between 1280 and 1440 (not 1340)..","date":"2013-04-26","mins":"6:05 pm","url":"https://shroudstory.com/2011/01/18/templecombe-and-the-shroud-of-turin-continued/","cat":"history","title":"Templecombe and the Shroud of Turin (Continued)"},{"id":"comment-32031","author":"gian_marco_rinaldi","post":"Radiocarbon results are given as 95% confidence intervals. You have to quote the whole interval, not just its early years. This result was published by the Oxford AMS laboratory in their paper: Archaeometry, volume 29, issue 2, August 1987, pp. 289–306 Radiocarbon dates from the Oxford AMS System: Archaeometry Datelist 6 R.E.M. Hedges, R.A. Housley, I.A. Law, C. Perry and J.A.J. Gowlett I quote from p. 303: <<Templecombe. Two samples taken from the edges of two planks of a door with a Shroud like image of Christ. The door was found on the site of a former Templar preceptory at Templecombe in Somerset (Wilson 1986). The dating was requested by C. Watson of TV South West. <<Ox A 1042 Wood from plank I: 580 ± 60. <<Ox A 1043 Wood from plank 2: 580 ± 60. <> But it is not important to discuss about the dating of the panel. The important point is that there is absolutely no evidence that the Templars owned or had ever seen the Shroud (much the less that the Shroud had ever been in England) and there is not any resemblance between the Templecombe portrait and the Shroud, apart from the fact that both have beard and long hair (beard and long hair were a common feature of men of those times). As to the thesis of Barbara Frale, she has been severely criticized by historians in Italy. Suffice it to say that she read a passage in a manuscript as “signum fustanium” while the words were clearly written as “signum fusteum” (“fusteum” = made of wood). PS: “Accelerator”, not Excelerator..","date":"2013-04-27","mins":"8:20 am","url":"https://shroudstory.com/2011/01/18/templecombe-and-the-shroud-of-turin-continued/","cat":"history","title":"Templecombe and the Shroud of Turin (Continued)"},{"id":"comment-32032","author":"gian_marco_rinaldi","post":"For some unknown reason, in my previous message a whole paragraph was deleted. The text of the Oxford paper, after “…580 ± 60”, continued: <>.","date":"2013-04-27","mins":"8:34 am","url":"https://shroudstory.com/2011/01/18/templecombe-and-the-shroud-of-turin-continued/","cat":"history","title":"Templecombe and the Shroud of Turin (Continued)"},{"id":"comment-32035","author":"gian_marco_rinaldi","post":"I wonder why this website insists in deleting a whole passage from my posting and substituting it with. I try once again. The deleted passage from the Oxford paper is: Using the calibration curve of Stuiver and Pearson (1986) the two identical dates give three possible means, namely AD 1328, 1333 and 1395. The one sigma (68% confidence) age range is AD 1290 1420, whilst the two sigma (95% confidence) range is AD 1280 1440. The dates are entirely compatible with the wood being cut in the period AD 1280 1310, and thus the painting might be associated with the Knights Templar, perhaps commissioned prior to their suppression in 1307 by King Philip the Fair of France. On the other hand, a later date for the wood of up to around 1440 cannot be ruled out, whilst the painting could of course have been executed much later than the timber on which it appears..","date":"2013-04-27","mins":"8:50 am","url":"https://shroudstory.com/2011/01/18/templecombe-and-the-shroud-of-turin-continued/","cat":"history","title":"Templecombe and the Shroud of Turin (Continued)"},{"id":"comment-32051","author":"gian_marco_rinaldi","post":"After Max Patrick’s mention of the “Bocca della Verità”, I expect that some sindonologists will state that the Turin Shroud was already famous in first century Rome!.","date":"2013-04-27","mins":"11:51 am","url":"https://shroudstory.com/2011/01/18/templecombe-and-the-shroud-of-turin-continued/","cat":"history","title":"Templecombe and the Shroud of Turin (Continued)"},{"id":"comment-2225","author":"gian_marco_rinaldi","post":"The panel of Templecombe was dated not to 1280 but to an interval between 1280 and 1440. I have written an article here, but it is in Italian http://sindone.weebly.com/templecombe.html.","date":"2011-01-17","mins":"6:44 pm","url":"https://shroudstory.com/2011/01/14/templecombe-and-the-shroud-of-turin/","cat":"history","title":"Templecombe and the Shroud of Turin"},{"id":"comment-207469","author":"gian_marco_rinaldi","post":"For essential information about sea silk, you may see the website by Felicitas Maeder (Basel, Switzerland): http://www.muschelseide.ch/en/projekt.html.","date":"2015-08-05","mins":"6:58 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"}]
