[{"id":"comment-176326","author":"gian_marco_rinaldi","post":"Hugh: yes, there is confusion among the several works attributed to a Della Rovere and representing the Shroud. I had given the link to a page by Leonardo Caviglioli devoted to the most famous Giovan Battista della Rovere, “il Fiamminghino” (=Flemish). You quote from another page of the same 1989 edition of the Treccani dictionary, by Giovanni Romano, devoted to the Turinese Della Rovere family of painters. Your page, not mine, seems to be the right one for our quest. As specified at the beginning of the page, there is no relation between the Turinese family and the “Fiamminghino”.from Milan. Therefore the Giovanni Battista from Turin, mentioned in your quote, has nothing to do with the most famous Giovan Battista. At any rate, neither of them has relation with the family of the Pope. As mentioned in your quote, a certain document has been erroneously attributed to the Fiamminghino. Perhaps a similar error has been perpetuated and still now the paintings of the Shroud are sometimes attributed to the wrong Della Rovere. If so, you have happily solved the doubt. But the problem is not so simple because as you quote, the three portraits of the Shroud are attributed to Pietro Francesco, another member of the Turin family. (The word “nre” in the original is clearly a mistake for “tre” = three.) A couple of paragrahs above your quote (beginning with “Già il 1° giugno 1606 il duca Carlo Emanuele I di Savoia”) it is stated that in 1606 the Duke had given to Gerolamo, the eldest Della Rovere, and to his family the privilege of painting the Shroud. During the following years, until the death of Gerolamo in 1638, any number of paintings of the Shroud may have been produced by Gerolamo or his sons. I cannot go further than this. Really an art historian is wanted. Lastly, the word “ruere”, not used to day in Italian, can well stand for “rovere” in the language, or some dialect of the time..","date":"2014-12-14","mins":"11:02 am","url":"https://shroudstory.com/2014/12/13/is-there-an-art-historian-in-the-house/","cat":"3d","title":"Is there an art historian in the house?"},{"id":"comment-176266","author":"gian_marco_rinaldi","post":"Hugh, Della Rovere is just a surname, nothing to do with the noble family. The painter was of Flemish descent. See here: http://www.treccani.it/enciclopedia/della rovere giovan battista detto il fiamminghino (Dizionario Biografico)/.","date":"2014-12-14","mins":"6:13 am","url":"https://shroudstory.com/2014/12/13/is-there-an-art-historian-in-the-house/","cat":"3d","title":"Is there an art historian in the house?"},{"id":"comment-161112","author":"gian_marco_rinaldi","post":"Yannick, I do believe you when you say that you did not know the names of the referees. Speaking in general, I have often found that scientific journals publish sindonology papers that (in my opinion of course) are invalid or even complete nonsense. I wonder why sindonology papers happen to be reviewed by referees who are so Shroud friendly. One possibility is that the authors themselves have suggested the names of the referees (this is not your own case). There are journals which accept suggestions from the authors as to the names of the referees. Apart from this, when an editor receives a paper on the Shroud (a subject about which he knows nothing) it is natural for him to submit the paper to referees who are themselves sindonologists. At any rate, if I read a paper for which I have myself a negative opinion, I do not change my opinion because the paper has passed the peer review or because the authors have academic credentials. Incidentally, you probably know that Giulio Fanti has published a note criticizing another 2014 paper by Fazio et al: http://www.tandfonline.com/doi/full/10.1080/00405000.2014.961265#.V Dglercc TIV.","date":"2014-10-10","mins":"3:36 pm","url":"https://shroudstory.com/2014/10/07/to-revisit-a-stochastic-process/","cat":"image_theory","title":"To Revisit a Stochastic Process"},{"id":"comment-160379","author":"gian_marco_rinaldi","post":"Clément: “I’ve learn through Mr. Fazio that one of the referee was Alan Mills,” Allan Mills can scarcely be considered to be an independent judge. He is a sindonologist and is quoted three times in the paper by Fazio et al. Now I understand what is the meaning of “peer review”: a paper written by a sindonologist must be reviewed by his “peers”, that is other sindonologists!.","date":"2014-10-08","mins":"7:19 am","url":"https://shroudstory.com/2014/10/07/to-revisit-a-stochastic-process/","cat":"image_theory","title":"To Revisit a Stochastic Process"},{"id":"comment-160434","author":"gian_marco_rinaldi","post":"Allan Mills has been Honorary Chairman of the BSTS. Searching for Mills in the index of the Newsletter in the BSTS page at shroud.com, one finds a 2002 paper on the formation of the image, a 2009 shorter article, the 1996 account of a lecture on the singlet oxygen theory..","date":"2014-10-08","mins":"12:28 pm","url":"https://shroudstory.com/2014/10/07/to-revisit-a-stochastic-process/","cat":"image_theory","title":"To Revisit a Stochastic Process"},{"id":"comment-216405","author":"gian_marco_rinaldi","post":"Louis: “Dolimetic Limestone”. Probably you mean “dolomitic”, but dolomite (calcium nagnesium carbonate) is differente from both calcite and aragonite..","date":"2015-12-13","mins":"11:28 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"id":"comment-216433","author":"gian_marco_rinaldi","post":"From the books by Sox and Gove, respectively, one learns what follows. Gove and his secretary Ms Brignall were in London from 15 to 19 June 1988 and met Sox. Immediately after they left, on 20 June, Sox went from London to Turin for informing Rinaldi about the result of the radiocarbon test. It is tempting to suppose that Sox was informed by Gove or Brignall or both. I would suspect of Brignall. Indeed Gove, without Brignall, had been in London on 12 May, and the following days, and had met Sox, but that time Sox did not travel to Turin. Therefore Gove, when alone, had not informed Sox. Of course all of this is only hypothetical but it seems to be an interesting clue..","date":"2015-12-13","mins":"7:15 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"id":"comment-216438","author":"gian_marco_rinaldi","post":"I think that Saracino’s is one of the worst documentaries ever produced. I have written a criticism here: http://sindone.weebly.com/uploads/1/2/2/0/1220953/notte complottopart 1.pdf It is a 67 pages pdf and I have considered only one aspect, the conspiracy theories. Sorry it is in Italian. Ms Saracino, with whom I have been in contact by mail, has not attempted any reply..","date":"2015-12-13","mins":"7:36 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"}]
