[{"id":"comment-29585","author":"gian_marco_rinaldi","post":"Hugh, the mechanical tests have been done with fibers under tension. The parameters were: breaking load, an elastic modulus (two methods), a loss factor (two methods). The five results are not given in the book as numerical figures but are only represented in a graphic diagram. Approximately, from the diagram one can guess that the five intervals are: 190 AD 810 AD, 340 BC 360 AD, 90 BC 990 AD, 760 BC 300 BC, 220 AD 940 AD. Supposedly the intervals are at the 95% confidence level but this is not explicitly stated. The respective means would be: 500 AD, 10 AD, 450 AD, 530 BC, 580 AD. Thus the means are widely scattered. Averaging these results, Fanti finds a final result at 400 AD +/ 400. He does not describe his method for calculating the average. The spectroscopic tests measure chemical (or chemico physical) alterations in the structure of the fiber but for full details we have to await the publication of a technical report. PS: Hugh, thank you for the translation!.","date":"2013-04-05","mins":"11:20 pm","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","title":"A Committee Far Removed from Padua"},{"id":"comment-146871","author":"gian_marco_rinaldi","post":"Louis, what is your source for stating that Cooray will present a paper at Bari?.","date":"2014-08-28","mins":"4:18 pm","url":"https://shroudstory.com/2014/08/28/breaking-news-on-the-bari-conference/","cat":"news_&_views","title":"Breaking News on the Bari Conference"},{"id":"comment-169145","author":"gian_marco_rinaldi","post":"The page for the reservations is now working: http://www.sindone.org/pls/diocesitorino/V3 S2 EW CONSULTAZIONE.mostra pagina?id pagina=24632&rifi=guest&rifp=guest.","date":"2014-11-06","mins":"4:19 am","url":"https://shroudstory.com/2014/11/05/breaking-news-make-reservations-to-see-the-shroud-starting-tomorrow/","cat":"uncategorized","title":"Breaking News:   Make Reservations to See the Shroud Starting Tomorrow"},{"id":"comment-215187","author":"gian_marco_rinaldi","post":"I do not see the pins in the books by Baima Bollone, but, apart that the printed photos are small, the frames are a little reduced as compared with the copies on the internet, that is they are cut on the borders and do not extend to include those corners..","date":"2015-11-27","mins":"12:47 pm","url":"https://shroudstory.com/2015/11/27/i-hope-this-helps/","cat":"reader_inquiry","title":"I Hope This Helps"},{"id":"comment-215178","author":"gian_marco_rinaldi","post":"In the 1990 book, Sindone o no, this is fig. 34 with no acknowledgements and with the following caption: “Fibrille di filo di lino prelevato in corrispondenza della pianta del piede destro con granuli di materiale pigmentato che le indagini di immunofluorescenza hanno dimostrato essere sangue umano.” Translation: “fibrils from a linen thread taken from the sole of the right foot with granules of pigmented material that immunofluorescence investigations have shown to be human blood.” The same photo is in the 2010 and 2015 books by Baima Bollone with similar caption (lacking the last words). In all cases the photo is rotated with respect to the one shown above. I have not found the photo in books of 1998, 2000 and 2006..","date":"2015-11-27","mins":"9:08 am","url":"https://shroudstory.com/2015/11/27/i-hope-this-helps/","cat":"reader_inquiry","title":"I Hope This Helps"},{"id":"comment-19357","author":"gian_marco_rinaldi","post":"Hugh, the image side is indicated by Schwortz in the captions as “Side 1” (Top in Fig. 1, Bottom in Fig. 2). The warp threads are in evidence on Side 1 and they run vertically in Fig. 1, horizontally in Fig. 2. As far as I can tell by comparing with a photo of the whole piece of cloth that was removed, this subsample comes from the top part of the (larger fragment of the) original sample. I mean “top” with reference to the standard manner of showing the Shroud, with the C14 corner on top left. The subsample is the same that had already been photographed and published by Jull (and Rachel Freer Waters) in 2010. It is a pity that Schwortz could not take a photo of the other subsample that should be still extant in Tucson. Such a photo might confirm that the other subsample is the smaller of the two fragments of the original sample. Hopefully, a photo of the other subsample will be soon made available. If Schwortz cannot travel to Tucson again, the photo can be taken by Jull himself or by the staff in Tucson..","date":"2012-11-22","mins":"9:08 am","url":"https://shroudstory.com/2012/11/21/last-update-this-year-to-shroud-com/","cat":"news_&_views","title":"Last update this year to shroud.com"},{"id":"comment-950","author":"gian_marco_rinaldi","post":"Stephen Jones himself, in a 200 post on his website: http://theshroudofturin.blogspot.com/2008/11/did max frei misidentify carduus.html wrote that the identification of Gundelia was in doubt. I quote from his text: “I have been advised in a private email, which I am not at liberty to quote, that what the late Max Frei identified as Gundelia tournefortii pollen on the Shroud of Turin, had in 2001 been re identified by a leading palynologist, Bonn University Prof. Thomas Litt, as within the different genus Carduus.” Jones also refers to a 2008 book in Italian by Avinoam Danin, “L’Uomo della Sindone”, where Danin quotes a sentence from a letter by Litt to CSST (the Whangers). Litt wrote: “The images of light microscopy (interference contrast) and by confocal laser scanning microscopy show clearly that waxes are preserved and cover the structure and sculpture of the pollen grains. This is the reason why I cannot make a precise identification of the pollen at the genus level, even less at the species level. However, with a high level of probablility, I can exclude that the pollen I have seen from the sticky tapes belong to Gundelia.” The report by Litt has not been published, except for the short excerpt above as disclosed by Danin, and it would seem that it is kept secret at CSST since 2001. It is to be hoped that it will be divulged soon. Gian Marco Rinaldi.","date":"2010-01-24","mins":"4:03 pm","url":"https://shroudstory.com/2010/01/22/more-death-certificate-on-the-shroud-of-turin/","cat":"news_&_views","title":"More: Death Certificate on the Shroud of Turin?"},{"id":"comment-45920","author":"gian_marco_rinaldi","post":"Dan, thank you for giving notice to my previous comment. I add that in July the American magazine “The Scientist” has published two articles by Kerry Grens about Kuznetsov. In the first article Grens explains that Kuznetsov has been accused of scientific fraud: http://www.the scientist.com/?articles.view/article No/36299/title/Accused–Fraudster– Heads Two Journals/ As an immediate consequence, Kuznetsov was expelled from his position as chief editor of two scientific journals, as told by Grens in her second article: http://www.the scientist.com/?articles.view/article No/36441/title/Editor Quits After Fraud Allegations/ Then Kuznetsov has sent three long letters to Grens that are published as comments under the latter article. I am preparing a counter reply I will add to my page that you have already linked. I will also add a post 2002 biography of Kuznetsov where his amazing career is described..","date":"2013-09-30","mins":"10:25 am","url":"https://shroudstory.com/2013/09/30/on-dmitry-a-kuznetsov/","cat":"news_&_views","title":"On Dmitry A. Kuznetsov"},{"id":"comment-45919","author":"gian_marco_rinaldi","post":"Dmitry Anatolievich.","date":"2013-09-30","mins":"10:21 am","url":"https://shroudstory.com/2013/09/30/on-dmitry-a-kuznetsov/","cat":"news_&_views","title":"On Dmitry A. Kuznetsov"},{"id":"comment-45937","author":"gian_marco_rinaldi","post":"Louis: “Why waste time with him?”. So as to remind sindonologists how easily they can be fooled..","date":"2013-09-30","mins":"2:15 pm","url":"https://shroudstory.com/2013/09/30/on-dmitry-a-kuznetsov/","cat":"news_&_views","title":"On Dmitry A. Kuznetsov"},{"id":"comment-45967","author":"gian_marco_rinaldi","post":"Louis: “Kouznetsov was an exception, and belongs to the past”. It would seem that in Italy he belongs to the present. From the website of Centro Internazionale di Sindonologia, Turin: http://www.sindone.org/the holy shroud  english /science/00025127 Cloth dating.html “Recent experimental studies (by Leoncio A. Garza Valdes in San Antonio (Texas) and by Dmitrij A. Kouznetsov and Andrej Ivanov in Moscow) have furthermore opened the sientific debate about the tissue dating once again, with results seeming to prove a possible and considerable chemical and biological contamination of the tissue…” In her website, Emanuela Marinelli has deleted the name of Kuznetsov but continues to quote his results as valid: http://www.shroud.it/STUDIES.HTM 7.3 – The fire and the biological patina The high temperature reached during the fire in Chambéry (the case with the Shroud burned during the fire on December 4, 1532) could have caused exchanges of isotopes increasing the radiocarbon, so that the material results in proportion “younger”. Http://www.shroud.it/EVENTS.HTM 1988: … In fact, the 1532 fire could have modified the quantity of radiocarbon in the Shroud, altering its dating. Bruno Barberis still refers to Kuznetsov in two 2010 books..","date":"2013-09-30","mins":"11:05 pm","url":"https://shroudstory.com/2013/09/30/on-dmitry-a-kuznetsov/","cat":"news_&_views","title":"On Dmitry A. Kuznetsov"},{"id":"comment-184823","author":"gian_marco_rinaldi","post":"Not Avellino. This was the arrival at the “Porta Nuova” station in Turin, 31 October 1946..","date":"2015-01-20","mins":"6:45 am","url":"https://shroudstory.com/2015/01/20/picture-tweet-of-the-day/","cat":"news_&_views","title":"Picture Tweet of the Day"},{"id":"comment-163472","author":"gian_marco_rinaldi","post":"Louis: “Shortly before his death he [Ballestrero] gave an interview saying that he had been “manipulated”.” I would not think that Ballestrero said that he had been manipulated. At any rate, his interview is reproduced here (in Italian): http://www.mondosindone.com/Site/documenti/DSS001 10%20 %20intervista%20 Ballestrero.pdf.","date":"2014-10-18","mins":"10:34 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"id":"comment-163479","author":"gian_marco_rinaldi","post":"In the text of the Ballestrero interview I linked above, there are just a few spelling mistakes. In particular, the year of the death of Ballestrero is given as 1989 instead of 1998. The interview was published in 1997..","date":"2014-10-18","mins":"10:47 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"id":"comment-163530","author":"gian_marco_rinaldi","post":"The interview was first published in “Messaggero di Gesù Bambino di Praga”, the monthly of the sanctuary of Arenzano (near Genova) of the “Padri Carmelitani Scalzi”. I have that issue here at home, even if not at hand at the moment. The text was subsequently reproduced in various places and sometimes with some slight changes. From what I can recall, the text in the above link should probably be true to the original, but I have not checked now. If you can read Italian, there is a 2010 interview with Father Giuseppe Caviglia and he speaks just of the Shroud: http://www.arenzanotracieloemare.it/IMMAGINI/2010 03 SINDONE/Arenzano Sindone.PDF Caviglia, former secretary of cardinal Ballestrero, was the author of the 1997 interview..","date":"2014-10-18","mins":"2:11 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"id":"comment-163545","author":"gian_marco_rinaldi","post":"Some people, prone to conspiracy hypotheses, have made much of this reference to freemasonry, I think that there has been a misunderstanding. I consider this issue in section 16 (“Il cardinale Ballestrero e la Massoneria”) of this critical article about the conspiracy thesis in an Italian documentary, “La notte della Sindone” by Francesca Saracino: http://sindone.weebly.com/uploads/1/2/2/0/1220953/notte complottopart 1.pdf As it seems that you both, Louis and Hugh, can read Italian, possibly you might find something interesting, if not just in this article, in some of the many other articles in the website sindone.weebly.com..","date":"2014-10-18","mins":"2:50 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"id":"comment-163593","author":"gian_marco_rinaldi","post":"For “La Notte della Sindone” I have the DVD that was sold until recently, but now I see that amazon.it says that at present it is not available. Possibly it may be found on the second hand market. The documentary was aired, not long ago, by a national television in Italy (Rete 4). The DVD has some supplementary material besides the television documentary. I have once found the entire documentary online in a Russian site but it was spoken in Russian..","date":"2014-10-18","mins":"6:05 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"id":"comment-47829","author":"gian_marco_rinaldi","post":"Here is the program of Habermas’ tour in Sweden (easily translated with Google): http://www.credoakademin.nu/images/events/habermas turne.pdf There are about twenty lectures in various places but the Parliament is not even mentioned..","date":"2013-10-17","mins":"8:19 pm","url":"https://shroudstory.com/2013/10/17/swedish-parliament-to-hear-about-the-shroud-of-turin/","cat":"news_&_views","title":"Swedish Parliament to Hear About the Shroud of Turin"},{"id":"comment-216900","author":"gian_marco_rinaldi","post":"Ntesdorf; If you mean the seam, that type of stitch has always been used in the middle ages and down the centuries until now. If you mean the selvedge, it is not true that a similar type has been found in Masada. Would you please name that “seamstress historian”?.","date":"2015-12-20","mins":"10:24 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216909","author":"gian_marco_rinaldi","post":"Charles, Flury Lemberg gives just one example, as far as I know, of a 3/1 twill in wool: Dominique Cardon, Les damassés de laine de Krokodilo (100 120 apr. J. C) in: “Bulletin du CIETA”, no. 76, Lyon, pp. 7 21..","date":"2015-12-20","mins":"3:31 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216923","author":"gian_marco_rinaldi","post":"I have not that article available but some information is here: http://www.igl.ku.dk/~bulow/Krok97.html I quote a passage: “Un type de production, représenté par une dizaine d’exemples parmi les textiles étudiés, mais non encore attesté parmi les textiles des autres sites, contemporains ou plus tardifs, du désert Oriental égyptien, s’avère particulièrement intéressant à cet égard: ce sont des sergés bayadères 3 lie 1 / 1 lie 3, dessinant des chevrons sens trame en reliefÝ: or l’exécution de ce type de tissu implique très clairement l’emploi d’un métier à tisser à chaîne horizontale équipé d’un corps de remisse de 6 lisses, donc une machine déjà perfectionnée et dont l’origine et l’introduction progressive dans le monde méditerranéen et en Europe est un problème historique d’importance majeure.”.","date":"2015-12-20","mins":"8:56 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216934","author":"gian_marco_rinaldi","post":"Here is an example of a fragment in 4/1 from Israel, but it is of the Byzantine period (after the 4th century). It is in cotton and Z spun. Probably it was imported from abroad. Http://www.academia.edu/2276718/Cooke W.D. and Shamir O. 2000. A Textile from Deir Abu Mghar. In U. Dahari. Monastic Settlements in South Sinai in the Byzantine Period. The Archaeological Remains. IAA Reports No. 9. Jerusalem. Pp. 247 248 The fragment is very small and the original dimensions are not known. Dimensions are important because for a textile so large as the Shroud a type of loom was necessary that permitted a rather quick execution. The same fragment is also considered in another paper where, among other things, O. Shamir gives information about the chronology of the introduction of cotton in Israel. Http://www.academia.edu/2276733/Shamir O. 2001. Byzantine and Early Islamic Textiles Excavated in Israel. Textile History 32 93 105.","date":"2015-12-21","mins":"5:27 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-44802","author":"gian_marco_rinaldi","post":"The radiocarbon dating was conducted in Rome, Italy, not in Arizona..","date":"2013-09-20","mins":"4:09 am","url":"https://shroudstory.com/2013/09/19/the-divine-jest-the-shroud-of-turin/","cat":"news_&_views","title":"The Divine Jest: The Shroud of Turin (Amended)"},{"id":"comment-44824","author":"gian_marco_rinaldi","post":"Daveb, the only connection with Arizona is that the paper by Bella and Azzi was published by Radiocarbon (44, 2002, 685 689), a journal from that University. The paper is freely available on the internet. I quote: “Dating was performed in a new radiocarbon (14 C) laboratory (“E. Amaldi” Physics Department of “Roma Tre” University) using 2 highly sensitive liquid scintillation spectrometers. Control measurements were performed on samples of known historical dates.”.","date":"2013-09-20","mins":"6:50 am","url":"https://shroudstory.com/2013/09/19/the-divine-jest-the-shroud-of-turin/","cat":"news_&_views","title":"The Divine Jest: The Shroud of Turin (Amended)"},{"id":"comment-149216","author":"gian_marco_rinaldi","post":"From this article in the Filipino media, it would seem that the Veil itself will travel there. Far from it. Not the Veil but father Carmine Cucinelli, prior of the Manoppello sanctuary, is going to Manila and other places in the Philippines. In the meantime he is visiting the States (Seattle, San Francisco, Las Vegas)..","date":"2014-09-07","mins":"6:17 am","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","title":"The Veil of Manoppello to Visit the Philippines This Month"},{"id":"comment-149217","author":"gian_marco_rinaldi","post":"Here were the dates of fr. Cucinelli visit to the USA, from 2 to 7 September: http://holyfaceofmanoppello.blogspot.it/2014/08/west coast of usa and also.html.","date":"2014-09-07","mins":"6:25 am","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","title":"The Veil of Manoppello to Visit the Philippines This Month"},{"id":"comment-80016","author":"gian_marco_rinaldi","post":"In the paper by Carpinteri et al there is confusion between Nisaea (Isthmus of Corinth, Greece) and Nicaea (Bosphorus, Turkey). They write: “The ‘‘Old Jerusalem’’ earthquake is classified as an average devastating seismic event, that it has also destroyed the City of Nisaea, the port of Megara, located at west of the Isthmus of Corinth.” There is no ancient source for an earthquake in Nisaea. For the source for an earthquake in Nicaea, see: http://www.textexcavation.com/phlegontestimonium.html The source for Nicaea does not speak of Jesus. Both Nicaea and Nisaea are over 1000 km far from Jerusalem..","date":"2014-02-17","mins":"8:25 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?"}]
