[{"id":"comment-157658","author":"gian_marco_rinaldi","post":"There is no need to consult an expert of ancient Jewish custom for realizing that there are no such images on the cloth. Simply look at the photos (even the same photos where Whanger, Danin or Baima Bollone see all those things). Do you see flowers or coins? No, simply because the images are not there, quite independently from Jewish funerary rituals..","date":"2014-09-29","mins":"8:14 am","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-157721","author":"gian_marco_rinaldi","post":"As to Baima Bollone, for the “simpulum” coin he has used the 1931 photo that all of us know. The two dimensional “eidomatic” elaboration of Balossino is here at Fig. 14: http://www.cicap.org/new/articolo.php?id=273767 It is identical to the Enrie photo, only with a stronger contrast and a worse definition. There is also a three dimensional elaboration that you can see here at the bottom of p. 36: http://www.cmc.milano.it/Archivio/2010/Approfondimenti/100301 Sindone.pdf Baima Bollone can read six letters of the coin insciption: the first three (TIB) and the last three (LIS, where I have written S for the Greek “stigma”). Surely you can see them yourselve. A couple of years ago I assisted to a lecture of Baima Bollone in Lucca, Italy. One of his slides was the latter photo. At the end of the lecture I went near the screen and asked Baima Bollone to show the photo again. I asked him to point to the letters on the screen. He promptly with his finger pointed at three spots in succession and said: lambda, iota, stigma! I have a question for you, Oskar. Baima Bollone saw the three letters LIS on the low right corner of the photo and in clockwise order. Do you think that the letters (if they existed) should be in that position or elsewhere? And are they in clockwise or counter clockwise order? Are they specular or not (I mean those letters that are not themselves symmetric)? These questions are relevant because Baima Bollone has sometimes published such photos in different configurations, for example with right/left or top/bottom inversions (I leave it to you to ascertain the configuration of this particular photo). One should consider that Baima Bollone asserts that the coins were put in straight up position with a vertical axis and that the images on the cloth are imprints, that is they should be specular. As to the flowers of Whanger and Danin, they have published their photos several times. If you think that they have seen the flowers in other photos, not those they have published, you have to ask them, not me, to unveil them..","date":"2014-09-29","mins":"1:01 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-157739","author":"gian_marco_rinaldi","post":"Oskar, can YOU see the flowers and coins, whether in scientific quality or bad quality photos? And please note that the proponents themselves use bad quality photos. I have indicated the very same photos that were used by Bauma Bollone. He sees the letters of the inscriptions on them. If you see them you can answer my question in my previous comment. If you don’t see them, you cannot say that it is only I who do not see..","date":"2014-09-29","mins":"2:18 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-148338","author":"gian_marco_rinaldi","post":"From the website (in four languages) of Felicitas Maeder, a Swiss specialist about sea byssus: http://www.muschelseide.ch/en/biologie/byssus/faseranalyse.html “Sea silk fibres have a smooth surface, are not very regular (compared fibre to fibre) and don’t have any structure. The fibre cross section is elliptical. The fibre diameter is between 10 and 50 µm. Using infrared spectroscopy, the fibre cannot be distinguished from silk or other animal fibres, because they have a similar chemical structure. The nitrogen content is much lower than in other animal fibres. Sea silk is extremely flexible, especially when wet. The resistance is low compared with other fibres, even weaker than wool. In wet state the resistance decreases by about 50%. Sea silk fibres are flammable. “…………. The cross section of the byssus fibre is – in contrast to all other natural fibres – significantly elliptical or almond shaped. It shows no structure. The fibre diameter varies within a single fibre. With 10 50 microns it is comparable with other natural fibres, such as mulberry silk or Egyptian linen 11 15 micron, Merino wool 18 25 micron, cotton 12 35 micron, mohair/alpaca 20 40 microns. From ancient times we know linens of a yarn diameter of 50 microns and a diameter of each fibre of 11 microns (Cook & El Gamal 1990). So the statement of Zanetti (1964), that sea silk is much finer than the finest silk – «molto più fine delle sete più fini» – can be refuted.”.","date":"2014-09-03","mins":"3:26 pm","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K."},{"id":"comment-148300","author":"gian_marco_rinaldi","post":"Piero: “it is not possible to paint on fabric made of marine byssus”. How do you know that the veil is made of sea byssus?.","date":"2014-09-03","mins":"12:02 pm","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K."},{"id":"comment-148334","author":"gian_marco_rinaldi","post":"Oskar, Chiara Vigo was taken to Manoppello by Paul Badde, watched the veil from outside the frame and without a microscope or a magnifying glass and immediately stated that it was sea byssus. And you think that this is a proof? Among other things, sea byssus has a somewhat golden colour. Badde had subsequently to postulate that a miracle had discoloured the threads in the areas where the veil is white. Several students have examined the veil during past years but nobody could demonstrate that it is made of sea byssus..","date":"2014-09-03","mins":"3:02 pm","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K."},{"id":"comment-149585","author":"gian_marco_rinaldi","post":"Moreover it is possible that in the course of time strips of cloth had been cut out at the extremities (under the feet) and originally the Shroud was longer..","date":"2014-09-09","mins":"3:34 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149594","author":"gian_marco_rinaldi","post":"Hugh: “all the edges of the Shroud are turned over and hemmed”. The most recent and possibly most accurate measurements were done soon after the 2002 restoration. The results are shown on p. 121 in the book (in Italian, English and German) by M. Flury Lemberg, Sindone 2000, L’intervento conservativo, Editrice ODPF, 2003. It is not there specified that at the time of the measurements the edges were turned over and I presume they were not. (Before the restoration, the short edges were turned over, while the long edges had a selvedge.) In 2002 Barberis and Zaccone took several measurements at various places. For the lenght the values are 4425, 4404, 4399, 4395, 4415 mm. For the width 1137, 1123, 1110, 1111, 1112, 1130 mm..","date":"2014-09-09","mins":"4:35 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-150270","author":"gian_marco_rinaldi","post":"Wilson’s diagram on p. 74 is the very same as given by Flury Lemberg who has copied it from the volume Masada IV where it is given among several examples from the Masada finds. I cannot tell if this is the seam of the Shroud, but surely is a common type of stitching and by no means exclusive of Masada..","date":"2014-09-11","mins":"4:27 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-150441","author":"gian_marco_rinaldi","post":"The Wilson/Masada diagram has four layers. The reason for the two folds is because each of the borders of the two pieces of cloth is closed and hidden within a fold so as it does not fray out..","date":"2014-09-12","mins":"7:39 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149492","author":"gian_marco_rinaldi","post":"Farey: “but the weight (“about 2.45 kg) is much more speculative.” The weight was estimated by Piero Vercelli (Turin symposium 2000) as 1140 gr..","date":"2014-09-08","mins":"4:27 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149515","author":"gian_marco_rinaldi","post":"For the previous values of over 2 kg, possibly somebody added the weight of the Holland cloth and of the borders. For the Holland cloth, Vercelli presumes 910 gr. (Pietro Vercelli: The cloth of the Holy Shroud: A technical product analysis of the cloth and its reproduction with similar characteristics. Pp. 169 175 in Sindon, n. 13, June 2000. Also printed as a volume: The Turin Shroud: past, present and future. International Scientific Symposium. Torino, 2 5 March 2000. S. Scannerini and P. Savarino, eds. Effatà Editrice. The values for the weights are on p. 174.).","date":"2014-09-08","mins":"6:50 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"}]
