[{"id":"comment-168891","author":"gian_marco_rinaldi","post":"David: “but some deformations imply an ulterior retouch”. This is just what Garlaschelli has done. He has used a real body for the general proportions and has completed the details with retouching by free hand. However some alteration in the proportions may be due to the draping of the cloth and to any slight shifts of the cloth while working. Once I tried (or let somebody try) the execution of the hands by rubbing over the real hands (of a subject with long fingers) and the result was ratehr good even without retouching. “… the legs are extended but this is incompatible with the mark of the sole”. Put a man prone (lying face down) on a bed with the feet extended and one over the other. The cloth can follow any curves of the legs so that it might produce a contact, if any, everywhere along them. The cloth envelops the exposed sole, which is face up, and the resulting imprint is similar to the Shroud’s. I once tried also with the real feet..","date":"2014-11-05","mins":"7:52 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169158","author":"gian_marco_rinaldi","post":"David: “Perhaps Garlaschelli may explain us how he got this effect.” As I said, Garlaschelli did retouch. From his report in JIST (July August 2010): “The image obtained can then be completed freehand and improved in a few spots by adding some more pigment, after removing the cloth from the volunteer’s body. This procedure also allows one to rub the pigment more evenly and more easily than when the cloth is resting over a 3 D human body. In particular, the “covered,” partially visible hand is a difficult feature to reproduce by rubbing, possibly because the stiff fabric cannot adequately conform to the sharp relief of this spot. Therefore, we completed the prints of the fingers by painting them subsequently with ochre and a small brush. If the mediaeval artist, too, had this problem and solved it in our same way, this would finally explain why the fingers look so puzzlingly unnatural and anatomically unconvincing.”.","date":"2014-11-06","mins":"5:15 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-168818","author":"gian_marco_rinaldi","post":"David: “The Shroud is not a “medieval artwork” in the usual sense of a portrait or a pictorial scene.” I agree. Indeed I have little doubt that the figure was produced, for the face, with a rubbing method on a basrelief as first proposed time ago by Joe Nickell. For the body, at least partially a similar method was used but with the aid of a real human body, not a basrelief, as recently performed by Luigi Garlaschelli. Therefore it is not even necessary to think that a painter or an artist had a role in the work (a basrelif of a face could easily be found already completed). The “blood” could have been added by anybody, even lacking an artist hand. Any stylistical considerations can only be applied to the sculpture of the face that was used for the rubbing, as far as we can now imagine its appearance. For the rest of the body, apart from the face, there is no artistic style. For example, an artist should have put the long hair also on the dorsal image, where we see only what may well be the imprint of a real human head. Also the feet have no correspondence with any representation ever made by an artist, but can be obtained from the feet of a real body..","date":"2014-11-05","mins":"4:36 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-166232","author":"gian_marco_rinaldi","post":"The Cope of Saint Louis d’Anjou is not herringbone and not three in one in its texture. The diagonal appearances are an added decoration..","date":"2014-10-28","mins":"12:39 pm","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-166367","author":"gian_marco_rinaldi","post":"Hamon, go for example to this page: http://www.mariemadeleine.fr/index.php/chape.html#livre Click and enlarge the photos of details of the cope. Some of the photos are enough close up to clearly see the texture. In some photos the cloth is only partially covered with the embroidery. Look for example at these: Where is the 3:1 herringbone? And do you think that one needs a medieval textile expert for recognizing the 3:1 herringbone? It is common knowledge among sindonologists that Tite and others tried to find a 3:1 medieval textile for the C14 dating but did not succeed. Now you presume that Tite’s emissaries, Vial and Evin, had a 3:1 herringbone in their hands and did not realize it: big news! Evidently you know nothing about the cope of St Louis and I have to suppose that if you challenge me, it is because you hope that I too know nothing. No, Hamon, as a rule people assert something if they know that it is true. And before asking me to give a proof of my assertion, you should better be sure of yours..","date":"2014-10-28","mins":"9:17 pm","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-165927","author":"gian_marco_rinaldi","post":"Farey: “William Meacham, without giving sources, says: “The thread was hand spun and hand loomed; after ca. 1200, most European thread was spun on the wheel.”” During the period ca. 1200 1500 two spinning methods coexisted in Europe: the ancient method with the spindle and the new method with a primitive type of wheel. Some people think that the thread spun with the spindle was worse (less strong, less regular, coarser). The contrary is true. The wheel spinning was worse and was used only because it was quicker and saved time and money. Indeed in many places rules were emanated that prescribed that the warp threads, which had to be stronger, had to be spun with the spindle. Only the weft threads might be spun with the wheel. It so happens that in the Shroud (according to Flury Lemberg) the weft threads are coarser and less regular than the warp threads. This by itself does not imply that in the Shroud the warp threads were spun with the spindle and the weft threads were spun with the wheel because at any rate it was usual to use better threads for the warp threads. But surely the fact that the threads of the Shroud were “hand spun” does not indicate that they were produced before 1200..","date":"2014-10-27","mins":"9:47 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-166556","author":"gian_marco_rinaldi","post":"Hamon, I am happy to leave the last word to you! It is fatiguing to discuss with you and I am too old for bearing the fatigue..","date":"2014-10-29","mins":"10:23 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-56294","author":"gian_marco_rinaldi","post":"It is official. The announcement of the archbishop is here on the website of the diocese: http://www.sindone.org/santa sindone/news e info/00045893 Ostensione 2015  annuncio del Custode Mons. Nosiglia.html.","date":"2013-12-04","mins":"7:37 am","url":"https://shroudstory.com/2013/12/04/not-yet-an-announcement-but-its-front-page/","cat":"press_coverage","title":"Not Yet An Announcement But It’s Front Page"},{"id":"comment-191106","author":"gian_marco_rinaldi","post":"About Masada. It is true (or so it seems) that the seam of the Shroud is similar to one of the examples of seams from Masata, but it is a common type of seam, not exclusive to Masada, that can also be found, for example, in medieval (and present day) Europe. It is not true that the selvedge of the Shroud is similar to examples of Masada. The selvedge of the Shroud is peculiar because the weft thread turns around the last and the last but one warp thread, alternatively. No similar examples are reported from Masada. It is not true that Flury Lemberg refers to inexistent texts..","date":"2015-02-15","mins":"6:14 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-191133","author":"gian_marco_rinaldi","post":"David, what I wanted to point out is that all the texts that are quoted in Flury Lemberg’s bibliography do exist. As to their interpretation, it may happen that there is disagreement, of course..","date":"2015-02-15","mins":"2:58 pm","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-29387","author":"gian_marco_rinaldi","post":"1978 or 1988? Gonella and Riggi kept and distributed some material from 1988, and perhaps Fanti himself owns part of it. But as concerns this particular research of Fanti about the dating, it was done with the fibers in the dust collected by Riggi in 1978. This is what I understand from reading the book..","date":"2013-04-04","mins":"4:41 pm","url":"https://shroudstory.com/2013/04/04/a-critical-review-of-giulio-fantis-new-book-unreliable-results-because-of-inadequacy-of-methods/","cat":"books","title":"A Critical Review of Giulio Fanti’s New Book:   Unreliable Results Because of Inadequacy of Methods"},{"id":"comment-145794","author":"gian_marco_rinaldi","post":"Daveb, the facts were widely known at the time in the media in German language. Something can still be retrieved from the internet. I have now done a quick search and have spotted the following. (Note that when Google searching websites in German, you have to insert Max Frei Sulzer, not simply Max Frei.) From Wikipedia: http://de.wikipedia.org/wiki/Fall Gross From Der Spiegel 1971: http://www.spiegel.de/spiegel/print/d 43144609.html In the next page,see second section: “Aus der Tätigkeit des Wissenschaftlichen Dienstes der Stadtpolizei Zürich”: http://www.nadir.org/nadir/archiv/Repression/bad kleinen/28objektivitaet.html The next page has a resume of three cases of wrong expertises, and the Shroud is one of them: Falsche Gutachten Die Hitler Tagebücher, das Turiner Grabtuch, der Gross Prozess im Aargau – und immer hatte der gleiche Kriminologe die Hand im Spiel http://www.webcitation.org/6 G Cb Uod C9 The texts are in German but can be easily automatically translated..","date":"2014-08-24","mins":"5:16 am","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"id":"comment-146237","author":"gian_marco_rinaldi","post":"Oskar, I have simply given some information that many sindonologists ignored. And I have signed it with my name..","date":"2014-08-26","mins":"5:21 am","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"id":"comment-145777","author":"gian_marco_rinaldi","post":"By 1973 Frei had been completely discredited in his profession. He was the protagonist of a judiciary scandal and a man in Switzerland had been kept 12 years in jail, with a life sentence, as a consequence of wrong proofs given by Frei. Then the Zurich police instituded a commission ot three esperts for judging Frei’s activity in general. The response was negative and Frei hurriedly retired from service. This was in 1972. A year later he came to Turin and began his adventure with the Shroud. It is telling that this circumstance is never mentioned by sindonologists. Apart from this, Frei published photos of reference pollens as if they were pollens from the Shroud and said to have used the SEM, in particular for the 1978 tapes, but this was not true. This is sufficient for doubting of Frei’s reliability. By no means Frei was a pollen specialist. His degree was in Natural Sciences with a thesis on the flora of Sicily, at a time when palynology had scarcely been born. His professional career was as a generic criminalist. As far as I know, he never published a scientific paper about pollens in the specialized literature. His work on the Shroud is sufficient to discredit him as a palynologist: if he pretended to have identified 58 out of 59 pollens at the species level, he was not familiar with the problems of pollen research..","date":"2014-08-24","mins":"2:34 am","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"id":"comment-31105","author":"gian_marco_rinaldi","post":"As to the twist of the threads, a similar statement to Fanti’s can be found in a 2010 book by Roberto Giacobbo (Italian TV journalist): “Templari, dov’è il tesoro?”, p. 119. I translate: “The particular twist of the linen thread [of the Shroud], which is that described in the Bible (Exodus, 28, 6 8) for making the sacred dress of the high priest of Israel.” I copy this passage from Exodus in a standard translation. There is no mention of Z or S twist. “6 Make the ephod of gold, and of blue, purple and scarlet yarn, and of finely twisted linen—the work of skilled hands. 7 It is to have two shoulder pieces attached to two of its corners, so it can be fastened. 8 Its skillfully woven waistband is to be like it—of one piece with the ephod and made with gold, and with blue, purple and scarlet yarn, and with finely twisted linen.”.","date":"2013-04-17","mins":"6:27 pm","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"id":"comment-82907","author":"gian_marco_rinaldi","post":"Fanti has a new chapter about Byzantine coins, 70 pages (pp. 131 200) with many photos of coins. He does a quantitative statistical analysis of the details and concludes that there is an almost absolute certainty that the coins had been copied from the Shroud, with odds of 1 against something of the order of 10^ 15. Needless to say, I am not convinced….","date":"2014-02-26","mins":"10:43 pm","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"id":"comment-5441","author":"gian_marco_rinaldi","post":"The name is Mark Andersen, not Anderson..","date":"2011-12-11","mins":"3:49 pm","url":"https://shroudstory.com/2011/12/11/mark-anderson-disputed-walter-mccrone-substantiated/","cat":"books","title":"Mark Andersen Disputed Walter McCrone. Substantiated?"},{"id":"comment-75011","author":"gian_marco_rinaldi","post":"@ Louis. I think it is probable that Fanti really took the debris from Riggi’s filters and that Riggi aspirated from under the cloth of the Shroud, but in so aspirating he could collect also fibres from the Holland cloth, from the many patches and from any other inquinating source..","date":"2014-01-28","mins":"4:41 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-75006","author":"gian_marco_rinaldi","post":"Daveb: “All other evidence suggests it is 1st c.” I know of only one piece of evidence, the Pilatus coins. Try looking at a good photo of the Shroud: can you see the coins and the letters of the inscriptions? As to the “pioneer experiments” of Fanti, he has compared the minute fragments of fibres collected among the debris and dust of Riggi’s aspirator with fibres freshly extracted from whole threads. No wonder if the Shroud fibres (if really they are from the Shroud) are weaker and more deterorated..","date":"2014-01-28","mins":"4:13 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-29284","author":"gian_marco_rinaldi","post":"I have just published a critical review here: http://www.queryonline.it/2013/04/04/sindone le datazioni alternative di giulio fanti/ It concerns only the third chapter of Fanti’s book about the new dating methods. Sorry it is in Italian..","date":"2013-04-04","mins":"8:13 am","url":"https://shroudstory.com/2013/04/04/sales-and-amazon-reviews-of-fantis-new-book/","cat":"books","title":"Sales and Amazon Reviews of Fanti’s New Book"},{"id":"comment-45893","author":"gian_marco_rinaldi","post":"I have translated into English my 2002 inquest on Kuznetsov, originally in Italian (a biography of Kuznetsov up to 2001 and an analysis of his papers from 1989 to 2000). Moreover I have published an account of my recent inquest on papers he published after 2002 (the latter do not concern the Shroud). Here is the link: http://sindone.weebly.com/kuznetsov special.html.","date":"2013-09-30","mins":"4:01 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-53579","author":"gian_marco_rinaldi","post":"Daveb, this sewing, or some variants of it, is quite simple and it is the obvious means of joining two pieces of cloth so as to render the seaming less visible on the front side. All women who have some practice of stitching know it. There is no reason to think that it was not known in medieval times. Indeed there are examples from medieval times which are analogous but more elaborate..","date":"2013-11-28","mins":"10:46 pm","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","title":"Unraveling Unusual Stitches in the Turin Shroud"},{"id":"comment-53853","author":"gian_marco_rinaldi","post":"For the variety of medieval seams, see for example: http://heatherrosejones.com/archaeologicalsewing/index.html Look also at the wool samples which are more numerous. Other examples are here: http://nvg.org.au/documents/other/stitches.pdf There are examples that are similar but more complex than the sketch in Masada IV, but if medieval people were able to do a complex seam they were also able to do a simple one. I would add that the seam on the Shroud might itself be of a complex variety because the underside edges appear to be somewhat rolled and not flat as they should be in the basic “flat felled” type..","date":"2013-11-29","mins":"8:08 am","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","title":"Unraveling Unusual Stitches in the Turin Shroud"},{"id":"comment-53538","author":"gian_marco_rinaldi","post":"Here is a reference for Mechthild Flury Lemberg: “The linen cloth of the Turin Shroud: Some observations on its technical aspects”, “Sindon”, n. 16, December 2001, pp. 55 76. I copy from p. 59 60: “The seam that connects the 8 cm wide strip to the larger segment is not a simple one. The type of seam construction chosen clearly displays the intention to make the seam disappear on the face of the cloth as mucu as possible. This is another reason to believe that the Shroud was planned and produced by professionals. The sewing has been done from the reverse of the fabric and the stitches have been executed with great care and are barely noticeable on the face of the Shroud (fig. 3a). The seam appears flat on the face (fig. 3b) and raised like a roll on the reverse of the fabric (fig. 3c). Examples of this same kind of seam are again to be found among the textile fragments of Massada [5] (fig. 3a), already mentioned above. To conclude this chapter it can be said that the linen cloth of the Shroud of Turin does not display any weaving or sewing techniques which speak aginst its origin as a high quality product of the textile workers of the first century A.D.” So far Flury Lemberg. Her figures 3abc are photos of details of the Shroud. Her second mention of fig. 3a is to be intended as another figure on the same page with the scheme or drawing of the stitch from the Masada IV volume, fig. 23 p. 171. This article is the translation of the original German text of Flury Lemberg that had appeared in a previous volume of the same journal: Sindon n. 13, June 2000. That volume contains the proceedings of the March 2000 Turin Symposium. I can also provide the German text but it seems that this English translation is correct..","date":"2013-11-28","mins":"9:22 pm","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","title":"Unraveling Unusual Stitches in the Turin Shroud"},{"id":"comment-203970","author":"gian_marco_rinaldi","post":"You should read chapter five of this book (chapter two in the Italian edition), in particular the third and last section. If the contents has not been changed in the English edition, then you discover that Fanti has accurately selected the most damaged fibres for the experiment. Indeed he wanted to distinguish between the fibres of the Shroud and the fibres of the Holland cloth, He thought that the Shroud fibres are much older and used the microscope for individuating the most “old” fibres. No wonder that he ended up with really “old” fibres! This was a second selection of the worst fibres. There had been a first selection because the fibres in the dust collected by Riggi cannot be compared with the fibres freshly taken from whole threads for the control samples..","date":"2015-06-28","mins":"11:19 am","url":"https://shroudstory.com/2015/06/28/update-on-new-book-by-giulio-fanti-and-pierandrea-malfi/","cat":"books","title":"Update on New Book by Giulio Fanti and Pierandrea Malfi"},{"id":"comment-145466","author":"gian_marco_rinaldi","post":"Searching Google for “Materials Evaluation Subject Index. 1942 to 2013” one finds a PDF where the name Andersen does not appear, nor any papers in volume 40 beginning on p. 630. It seems that this quote is only given by the Wikipedia page for the Shroud. The matter was considered by Porter in this blog in 2011: https://shroudstory.com/2011/12/11/mark anderson disputed walter mccrone substantiated/ Also by Porter in his “An open letter to journalists” that can be retrieved with archive.org as captured in 2008. It would seem that the Andersen story is a hearsay with only Ray Rogers as a source. If really there is a printed source authored by Andersen himself, it is strange that sindonologists have not yet been able to obtain it..","date":"2014-08-22","mins":"12:48 pm","url":"https://shroudstory.com/2014/08/22/looking-for-a-paper-by-mark-andersen/","cat":"paper_chase","title":"Looking for a paper by Mark Andersen"},{"id":"comment-192353","author":"gian_marco_rinaldi","post":"Daveb: “in the seismic zone of Piedmont”. De Liso lives west of Turin, bordering on France. It is not a seismic zone as you may check on a seismic map: http://zonesismiche.mi.ingv.it/mappa ps apr04/italia.html.","date":"2015-03-04","mins":"3:19 am","url":"https://shroudstory.com/2015/03/03/nine-selected-and-revised-papers-from-the-bari-conference/","cat":"paper_chase","title":"Nine Selected and Revised Papers from the Bari Conference"},{"id":"comment-192371","author":"gian_marco_rinaldi","post":"Here in Italy we have long been acquainted with De Liso’s claims. I fear that even sindonologists (not to speak of the skeptics like me) have not given much attention to them..","date":"2015-03-04","mins":"7:55 am","url":"https://shroudstory.com/2015/03/03/nine-selected-and-revised-papers-from-the-bari-conference/","cat":"paper_chase","title":"Nine Selected and Revised Papers from the Bari Conference"},{"id":"comment-4264","author":"gian_marco_rinaldi","post":"M.P. Hamon was at the Frascati (Italy) conference in May 2010. An extended abstract of his presentation (in English) may be seen here: http://www.acheiropoietos.info/abstracts/poster.html Here too, the subject is about the coins over the eyes. I copy the unusual credentials of Hamon: “Former professor at the University of Riyadh (Kingdom of Saudi Arabia) Founder and director of LE CER Cle (Office for Studies and Research in Cryptology), Reze (France) Independent researcher in Late Antique and Medieval archaeoperceptive cryptology” His address was in France..","date":"2011-10-23","mins":"1:50 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue"},{"id":"comment-182561","author":"gian_marco_rinaldi","post":"Farey: “I had no idea Fanti’s book had been published elsewhere.” The 2014 book by Fanti (with P. Malfi) is not another edition of the 2013 book. It is a different book: “Sindone: primo secolo dopo Cristo!”. Here one discovers that the situation is still worse. Among the many fibres of Riggi’s debris, Fanti, after observing them with a petrographic microscope, has selected only a few fbres for the experiments and has selected the most damaged ones. In this way he thought to distinguish the fibres from the Sfroud from fibres from the Holland cloth..","date":"2015-01-11","mins":"10:22 am","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"id":"comment-182031","author":"gian_marco_rinaldi","post":"The video is now online: “Giulio Fanti and the Turin Shroud!.","date":"2015-01-08","mins":"6:31 am","url":"https://shroudstory.com/2015/01/03/television-an-italian-professor-believes-he-has-the-answer/","cat":"video","title":"Television:  An Italian Professor believes he has the answer."}]
