[{"id":"comment-6270","author":"jeannie","post":"I just finished reading Heaven is for Real and I was truly inspired and touched. It compelled me to share a story about my father. He was diagnosed with cancer at the age of 53. One week before he died, he was on constant oxygen and could barely speak without taking a few seconds in between words. He could speak one word and then had to have a deep breath to speak another word. Also during the last week of his life, he was in and out of reality. Sometimes he was lucid and sometimes he was not. Some days he recognized us and, in his labored speech, talked competely rational. On the last day of his life, all of our family was in the hospital room with him. His brother and sister were there too. He and his brother were very very close. Most of that day, he was not “with us”. EXCEPT when he looked at his brother. Although it was difficult for him to say, he kept telling him that Jesus was coming at 6 o’clock. Throughout the entire day, he would tell his brother, and only him, that Jesus was coming. We didn’t know if he was in his right mind or not. Just minutes before 6 o’clock on that Saturday afternoon, he got a “look” in his eyes. He sat himself up in the bed, with strength he hadn’t had in weeks, and said the 23rd Psalm from start to finish without taking a breath in between. He spoke as easily as you or I can. After he said the 23rd Psalm, he began to sing. Again, with no effort and his words flowed a beautiful tune. In the middle of the hymn, he died. Although I was devistated at losing him and still to this day cry over losing him so young, what a wonder thing to leave us with. Jesus did come, at 6:o’clock and carried him to heaven. After reading this book, I am even more excited to see him again. To see him well, without pain and sickness. Thank you to Colton and his family for sharing this beautiful message..","date":"2011-12-29","mins":"8:06 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6277","author":"jeannie","post":"So sorry for you. The only thing I can do is pray for you so you will, one day see the face of Jesus. My heart aches for for you….","date":"2011-12-30","mins":"12:26 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]
