[{"title":"\n\"Atomic resolution studies detect new biologic evidences on the Turin Shroud,\" Shroud of Turin News, June 2017 \n","post":"\n\nOnce more on behalf of Centro Português de Sindonologia I congratulate Dr. Stephen Jones for this excellent new post.If this website did not exist honest Shroud researchers would have an hard time to get such important scientific data.As a medical doctor I understand the importance of such findings because an elevated blood creatinine value means among several pathological situations, either renal failure or severe muscle trauma, two conditions Jesus endured in His ordeal, and besides Ferritin nanoparticles being wrapped by Creatinin means that the «painting theory» is bogus.And besides even if desperate anti-authenticity guys state that a clever forger painted the blood on the Shroud that had been taken from a tortured man I recall at least two differences from the real Shroud:Neither Image nor bloodstains could have been painted because Shroud researchers Don Lynn and Jean Lorre studied them with FFT (Fast Fourier Transform) and obtained an isotropic pattern which precludes painting as a method of obtaining Image and Bloodstains.The classical FACT: There is no Image under Bloodstain(How would an hypothetical clever forger overtake this difficulty????)I'm eaggerly waiting for your next update                                           warmest regards                         Antero de Frias Moreira( Centro Português de Sindonologia)\n\n","author":"Anonymous","date":"July 26, 2017 at 4:14 AM","url":"http://theshroudofturin.blogspot.com/2017/07/shroud-of-turin-news-june-2017-stephen-e.html","site":"moore"},{"title":"\n\"Atomic resolution studies detect new biologic evidences on the Turin Shroud,\" Shroud of Turin News, June 2017 \n","post":"\n\nAntero>Once more on behalf of Centro Português de Sindonologia I congratulate Dr. Stephen Jones for this excellent new post.Thanks. But again I am just plain \"Mr\".>If this website did not exist honest Shroud researchers would have an hard time to get such important scientific data.I believe that Jesus, the Man on the Shroud, has called me to this work in these last days (2Tim 3:1; 2Pet 3:3) before he returns . And that my whole 70-year life has been a preparation for it. >As a medical doctor I understand the importance of such findings because an elevated blood creatinine value means among several pathological situations, either renal failure or severe muscle trauma, two conditions Jesus endured in His ordeal, and besides Ferritin nanoparticles being wrapped by Creatinin means that the «painting theory» is bogus.Thanks for that medical confirmation.>And besides even if desperate anti-authenticity guys state that a clever forger painted the blood on the Shroud that had been taken from a tortured man I recall at least two differences from the real Shroud:>>Neither Image nor bloodstains could have been painted because Shroud researchers Don Lynn and Jean Lorre studied them with FFT (Fast Fourier Transform) and obtained an isotropic pattern which precludes painting as a method of obtaining Image and Bloodstains.Agreed. See my \"Non-directional #17: The man on the Shroud: The evidence is overwhelming that the Turin Shroud is authentic!\" >The classical FACT: There is no Image under Bloodstain(How would an hypothetical clever forger overtake this difficulty????)That will be a topic, \"Blood before image and clots intact #24,\" of my next post in my \"The evidence is overwhelming that the Turin Shroud is authentic!\" series.That \"difficulty\" and many (perhaps hundreds) more! In my series, \"The evidence is overwhelming that the Turin Shroud is authentic!\" I am collecting all the problems of the forgery theory, which I will eventually present in a post by that name, \"Problems of the Forgery Theory.\" There will also be a chapter of that name in my book, \"The Shroud of Turin: The Burial Sheet of Jesus!\" (see 02Jun17 and 06Jul17).>I'm eaggerly waiting for your next updateThanks for your interest. I have one more installment of this post to publish which will be today. Then tomorrow I hope to start on \"Chronology of the Turin Shroud: Eleventh century\">warmest regards>Antero de Frias Moreira( Centro Português de Sindonologia)Regards,Stephen E. Jones----------------------------------MY POLICIES. Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. Except that comments under my latest post can be on any one Shroud-related topic. To avoid time-wasting debate I normally allow only one comment per individual under each one of my posts.\n\n","author":"Stephen E. Jones","date":"July 26, 2017 at 9:06 AM","url":"http://theshroudofturin.blogspot.com/2017/07/shroud-of-turin-news-june-2017-stephen-e.html","site":"moore"}]
