[{"title":"Paper Chase:  Uncovering the Sources of DNA on the Shroud","post":"What is more probable: 1) the dust and debris found on the cloth is of very recent origin; 2) it is centuries and millennia old. Dust comes and goes every day.\n\n","date":"September 20, 2014 at 3:54 am","url":"https://shroudstory.com/2014/09/20/paper-chase-uncovering-the-sources-of-dna-on-the-shroud/","cat":"paper_chase","id":"comment-152630","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Paper Chase:  Uncovering the Sources of DNA on the Shroud","post":"An interesting and quite tantalising document, leaving one very anxious to read the full paper describing the experiments and the identifications. It is probably unwise to comment in detail when all we have here is a very basic taster, but when did that ever stop me? Some observations, then.\n1) Eleven genera of plants identified are listed in the paper. Is it curious that only two of these (Prunus and Carpinus) also appear on Max Frei’s pollen identifications?\n2) According to various sources, the shroud was liberally scattered with Gundelia, Matricaria, Anthemis, Helichrysum and/or Carduus. None of these names appears in the report above.\n3) Presumably the largest component of the vacuumings from the Shroud, by quite a long way, is Linum usitatissimum. Does the manufacture of linen destroy its DNA, or couldn’t that be used to locate the source of the material rather more precisely than the various adventitious plants whose appearance is only in minute traces?\n\n","date":"September 20, 2014 at 6:42 am","url":"https://shroudstory.com/2014/09/20/paper-chase-uncovering-the-sources-of-dna-on-the-shroud/","cat":"paper_chase","id":"comment-152648","author":"Hugh Farey","site":"shroudstory"},{"title":"Paper Chase:  Uncovering the Sources of DNA on the Shroud","post":"Hugh is probably correct that it is unwise to comment in any kind of detail at this stage.  I did feel that the conclusion at the end begged the question, and there was too much ambiguity, with DNA apparently from every place in the globe from America to the Far East.  I felt it was a catalogue which needed more analysis to arrive at any true conclusions.  Perhaps I’m being precipitate, but I was unable to draw anything definitive from it.\n\n","date":"September 20, 2014 at 7:33 am","url":"https://shroudstory.com/2014/09/20/paper-chase-uncovering-the-sources-of-dna-on-the-shroud/","cat":"paper_chase","id":"comment-152659","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase:  Uncovering the Sources of DNA on the Shroud","post":"The far-back origin in America or the Far East can be disregarded if the plant grows or is cultivated to-day in Italy.\n\n","date":"September 20, 2014 at 12:24 pm","url":"https://shroudstory.com/2014/09/20/paper-chase-uncovering-the-sources-of-dna-on-the-shroud/","cat":"paper_chase","id":"comment-152732","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Paper Chase:  Uncovering the Sources of DNA on the Shroud","post":"Are there any links to Orit Shamir’s presentation?\nI believe that it deserves a separate post, where it can be debated on its own merits.\n\n","date":"September 20, 2014 at 2:14 pm","url":"https://shroudstory.com/2014/09/20/paper-chase-uncovering-the-sources-of-dna-on-the-shroud/","cat":"paper_chase","id":"comment-152762","author":"Eric","site":"shroudstory"},{"title":"Paper Chase:  Uncovering the Sources of DNA on the Shroud","post":"I join this request. Orit Shamir is an authority in ancient Palestine fabrics and it will be very interesting to discuss her text here.\n\n","date":"September 21, 2014 at 5:20 am","url":"https://shroudstory.com/2014/09/20/paper-chase-uncovering-the-sources-of-dna-on-the-shroud/","cat":"paper_chase","id":"comment-153088","author":"David Mo","site":"shroudstory"},{"title":"Paper Chase:  Uncovering the Sources of DNA on the Shroud","post":"The text of Shamir’s paper is not yet available online. For what it can help, a webpage has a great many photos from Bari and among them about 30 photos of slides from Shamir’s presentation as they were shown on the screen.\nhttp://www.monitorenapoletano.it/sito/the-vaticanist/236-settembre-2014/3012-photogallery-advanced-turin-shroud-investigation-bari-4-5-settembre-2014.html\nShamir’s photos start at n. 7257.\n\n","date":"September 21, 2014 at 6:20 am","url":"https://shroudstory.com/2014/09/20/paper-chase-uncovering-the-sources-of-dna-on-the-shroud/","cat":"paper_chase","id":"comment-153110","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Paper Chase:  Uncovering the Sources of DNA on the Shroud","post":"The final conclusion of the paper reads as follows:\n“Overall DNA data were compared with historical information to verify whether the geographic areas of origin and distribution of land plant species (embryophytes) and human mitochondrial haplogroups are coherent with the proposed temporal and spatial paths of the Turin Shroud. Our experimental findings and additional clues pose a further difficulty to those who postulate a central European origin and a historical interval corresponding to the Middle Ages of the Relic.” \nPerhaps I am missing something, but I was not so persuaded by the content of the paper.  But there may of course be more to come. \nI saw no reference to plant types that still remained unique to a specific Middle Eastern region.  For instance, some of the pollens claimed by Frei, Danin and others, were said to be confined to the Dead Sea area, or the environs of Jerusalem.  I saw no such references to similar particular unique geography in the paper. \nWhen it came to human mtDNA we read characterized by distinct haplotypes: R, U, H, and few L and M haplotypes.  R0 occurs Arabian plateau (Saudi Arabia, Pakistan), smaller frequencies in Anatolia to Dalmatia;  R8 in East India;  U in Western Eurasia, North Africa, South Asia;  U5 among ancient and most common in EUROPE (11%); U2 in South Asia; H is the most frequent in EUROPE;  And so on … \nFrom this catalogue, I am not following the logic of the last sentence of the conclusion given.  But perhaps I am missing something??!!\n\n","date":"September 20, 2014 at 4:43 pm","url":"https://shroudstory.com/2014/09/20/paper-chase-uncovering-the-sources-of-dna-on-the-shroud/","cat":"paper_chase","id":"comment-152791","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase:  Uncovering the Sources of DNA on the Shroud","post":"Linus usit. Hugh (3) above: the retting process may be somewhat harsh on flax DNA, although sequencing might be doable-some might survive-this is what several plant genomics scientists replied to me via e-mail last year-The above study is via surface vacuum, not direct thread analysis-this would be the best bet for that. The entire flax genome has been sequenced, although I am unsure if a database is at the point to discriminate genetically flax from different regions (if possible) or mutation rates in certain segments with time (probably not long enough?), to help further characterize the cloth.\nCatalogue (daveb), yes, I think that’s a good description-it will be interesting to follow any further developments-making solid connections with a historical type trail can be difficult as there are many unknowns.  Hopefully such  studies could progress, eventually, to the level of publication in a science journal, as more details come forth\n\n","date":"September 21, 2014 at 7:39 am","url":"https://shroudstory.com/2014/09/20/paper-chase-uncovering-the-sources-of-dna-on-the-shroud/","cat":"paper_chase","id":"comment-153142","author":"Kelly Kearse","site":"shroudstory"}]
