[{"author":"flagrum3","post":"To Anonymous; Seriously, have you done any reading? The statement you raise has been covered by many many people. It has been brought to conclusion that the Shroud in no way contradicts the John passage, whatsoever, and in some ways along with the Sudarium of Oviedo, the Shroud enlightens us more on the scripture of John 20. I think Stephen has covered this before actually, in some detail. Further reading on your part is defiantely warranted.Thanks,Sorry Stephen for jumping in like this but it irks me when people make irresponsible comments.F3.","date":"2012-06-01","mins":"6:09 AM","url":"http://theshroudofturin.blogspot.com/2012/05/my-critique-of-pray-codex-wikipedia-1.html","title":"\nMy critique of \"The Pray Codex,\" Wikipedia, 1 May 2011\n"},{"author":"flagrum3","post":"Nice write up Stephen, when your done fixing up some misinformation on the Wiki 'codex' page, maybe you can fix some on the Wiki 'Shroud' page also. Seems there is alot of misinformation on Wiki and alot of young folk seem to use Wiki as their prime source of info nowadays. Anyways a couple of points to the Pray Manuscript drawing at the top of this page; 1. I tend to believe there is actually a second cloth represented in the bottom image, which extends beyond the Shroud slightly towards the Alpha symbol. I have not come to a conclusion of whether it is depicting the face cloth or 'more likely' the strips which would have been used to bind the Shroud around the body. I also think the face image cloth hanging from the ladies arm is depicting more likely the Sudarium...your thoughts? Secondly; I believe the image which many mistake for the sephulchre is actually the Shroud, with all the red x's as it also depicts the holes of the burn marks and I think the red is to imply blood on the inside of the cloth....Anyways, just a couple of thoughts.Thanks,F3.","date":"2012-05-28","mins":"2:41 AM","url":"http://theshroudofturin.blogspot.com/2012/05/my-critique-of-pray-codex-wikipedia-1.html","title":"\nMy critique of \"The Pray Codex,\" Wikipedia, 1 May 2011\n"},{"author":"flagrum3","post":"Stephen I wouldn't have used such a hostile tone in most cases but this Anonymous, seems to be \"trolling\" as he has left the exact same comment word for word on other blogs including Dan's Shroud of Turin blog plus several other places.But with that said, perhaps I shall strive to be more as that passage proposes.Thanks,F3.","date":"2012-06-01","mins":"6:46 PM","url":"http://theshroudofturin.blogspot.com/2012/05/my-critique-of-pray-codex-wikipedia-1.html","title":"\nMy critique of \"The Pray Codex,\" Wikipedia, 1 May 2011\n"},{"author":"flagrum3","post":"Matt I agree 100% with your comments. I'd like to add to the decorative pattern issue: If one looks closely, the artist depicted the decorative circles in basically a specific pattern throughout all drawings. This being two small circles followed by one large circle/or diamond, followed by two more small circles. Obviously to anyones eye this does not agree with the poker holes pattern. Making the poker holes and their pattern \"blatantly destinctive\", I would say.F3.","date":"2012-05-28","mins":"11:36 PM","url":"http://theshroudofturin.blogspot.com/2012/05/my-critique-of-pray-codex-wikipedia-1.html","title":"\nMy critique of \"The Pray Codex,\" Wikipedia, 1 May 2011\n"}]
