[{"author":"flagrum3","post":"Just to add to the problems of the Shroud radiocarbon dating; One must remember this Shroud has been 'around', meaning it has not sat in a sealed tomb or buried for 2000 or more years. Archaeologists usually deal with items that have been 'secluded', not carried all over, handled, mended or exposed to outside influences/contaminations. Even in the cases of 'secluded' RCD testings there have been anomolies! I have read that up to 50% of tests must be redone because of anomolies. Where does that put the Shroud in the error percentage scale? I'd say it's up there; Like a 95% chance of error from from a 'single' reading, possbly.F3.","date":"2012-04-03","mins":"5:39 AM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n"},{"author":"flagrum3","post":"Hi Steve,May I suggest before you get around to doing a more detailed post on c14 dating. You read all papers by Remi Van Healst on RC Dating. If you haven't already. There is some surprising first hand facts that prove the c14 result was in error....I'm amazed actually with all of his study and findings that they are not mentioned more often in defence of the S Hroud. Here is one little bit I learned from his close scrutiny of the 'supposed' peer review of the '89 Nature paper for the 1988 RCD. It was required that a minimum size of samples be 5g, however close scrutiny showed all samples from all labs used for the testing were well below this threshold, basically nullifying any results on a very basic level.Curious as to your thoughts on these findings.F3.","date":"2012-04-04","mins":"7:48 PM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n"},{"author":"flagrum3","post":"Hi Steve,Sorry I got stuck off topic. Look forward to your c14 blog.F3.","date":"2012-04-05","mins":"8:19 AM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","title":"\nFour proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)\n"}]
