[{"id":"comment-2026","author":"flagrum3","post":"I don’t know exactly what your talking about here or what you see, but any close examination of the image clearly shows a gap between front and dorsal head images.A gap of approx 6 8 inches.It’s pretty clear!! Also there is no image in that area as no body side images show anywhere on the cloth.Whatever mechanism casued the image seemed to follow gravitational lines, vertically only..","date":"2010-12-26","mins":"6:18 pm","url":"https://shroudstory.com/2010/12/24/the-shroud-of-turin-and-the-new-testament/","cat":"news_&_views","title":"The Shroud of Turin and The New Testament"},{"author":"flagrum3","post":"Stephen. I find here in lies another issue over the discussion on the Shroud; Some people just not using any logic! i.e; The poster who questions the authenticity of the Shroud due to misinterpretation of scripture. John never states the body was wrapped in Othonia (cloths plural), he only states he SAW the othonia (cloths plural) in the tomb. There is a huge difference between the two. When John mentions othonia, it could mean several things; The Shroud itself and bound by strip(s) (As hypothesized by Dr. Jackson) or there could have been more cloths involved lying there. It has been suggested another large cloth was (needed)or used, to actually carry Jesus from the cross to the tomb, and I think this is evident in that if the Shroud was used to carry the lord from the cross, it would be very evident on the Shroud itself, and it is definately not, meaning there could have been a number of other cloths in the tomb amongst the Sudarium and the Shroud...So basically this argument is mute to the discussion of the authenticity of the Shroud.F3.","date":"2012-07-12","mins":"4:29 AM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n"},{"author":"flagrum3","post":"To Matt's last comment on Bela III; This is a very important point, as it does create a strong connection between Hungary and Constantinople. It makes it quite possible that Bela III had seen the Shroud in Constantinople face to face, or even stronger that the monk who drew the PM had also or had accompanied him there...making for a very plausibly connection...this would or could explain alot of the coincidences found on the PM to the Shroud.Now if I may go off topic also, I'd like to go back to the Sakli fresco painting and my thoughts on it. I am in question to the circles having any relation to the 3 circles of the esophagus or to the poker holes on the Shroud. Reason; there is no logic in it. If the artist was depicting the poker holes; W Hy not depict them exactly as are seen? and why 3 holes? Even with the faintest of the poker holes, atleast 4 burns can be seen and why angled? ...this theory also would propose the artist had seen the Shroud 'unfurled' and not folded as the Mandylion/Edessa cloth was described and known to exist. The link to the Constantine 3 holed esophagus in Jerusalem seems too far reaching. If so, then why the need or meaning to the four holes? My thoughts are that the artist may have known that the Edessa cloth/Mandylion was actually a larger sindon (burial cloth) but had not neccesarily seen it as such, as it can be supposed most people would not have been able too, just a few of the higher clerics, nobles etc; but he was aware of it's distinctive folding. Hense the odd circle patterns of 3 on one side, four on the other along with the fold lines which can be viewed on either side of the painting, reminiscent of layers. I may be way off here on my proposition and Mr. Guscin did actually relate to me that the painted circles were common on many paintings, so unlikely they had much or the indepth meaning as I proposed....but for some reason I cannot agree and feel there is.F3.","date":"2012-07-14","mins":"5:46 AM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n"},{"author":"flagrum3","post":"Stephen. I don't believe I am too far off in my proposals. 1.)Several cloths may have been used and could have been kept with the body in keeping to Jewish burial traditions and not necessarily being attached or placed on the body. (The sudarium is a case in point)...So it is still a logical statement. The minimal number of cloths (jawband) etc; is not an issue, as time was of the essense. A single strip bound around the Shroud could suffice as illustrated clearly by Dr Jacksons hypothesis using the 4 inch side strip, which is tangible evidence. Remember John separates the Sudarium from the othonia so othonia (cloths plural) could mean several cloths; Including the Shroud, a strip or strips to bind the body and other cloths used for other purposes. The scripture does not in any way go against this (my) proposal.2) I also find it highly unlikely, viewing the Blood evidence found on the Shroud (closely) that the Shroud itself could have been used (dual purpose)i.e; In carrying the lord from the cross. I believe there would be found massive amounts of blood smeared on much of Shroud if being so, which there is not. The blood traces are very exacting, hardly showing any sign of movement. Again it is not against scripture or Jewish burial custom that these 'other' clothes may have been placed on or about the body. It is quite clear that Nichodemus et al. Needed to improvise and quickly, using a long strip instead of several small ones to bind the body is not out of the question, and actually quite logical. John most likely had witnessed the burial and seen the exact way the body was left in the tomb when left. This could explain why John 'believed' after 'seeing' the cloths and the Sudarium, because they were all where they were left with only the body missing.F3.","date":"2012-07-13","mins":"1:48 AM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","title":"\n`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\n"}]
