[{"id":"comment-1748","author":"flagrum3","post":"Whilst making my breakfast this morning, to my astonishment as I pulled the second piece of toast out of the toaster, I saw the face of Dan Porter, clear as day!….But seriously, although I agree mostly with the article, I have to admit I see objects on the eyes! Forget the different photo film types, as it appears in the VP 8 renderings very clear.Would be nice if they had a way to enhance the vp 8 images detail to finally clear this up..","date":"2010-11-19","mins":"3:22 pm","url":"https://shroudstory.com/2010/11/14/i-dont-see-flowers-and-coins-and-teeth-on-the-shroud-of-turin/","cat":"image_theory","title":"I Don’t See Flowers and Coins and Teeth on the Shroud of Turin"},{"author":"flagrum3","post":"Stephen, thank you for that last passage and your final comment. It has actually made me feel better about this whole mess and my bewilderment to people's opposition to the Shroud and the Lord's teachings.F3.","date":"2012-05-20","mins":"12:47 PM","url":"http://theshroudofturin.blogspot.com/2012/05/you-state-that-there-is-no-paint-dye-or.html","title":"\nYou state that `there is no paint, dye or pigment on the Shroud that forms its image' but it is claimed that `the Shroud contains red ochre and other paint pigments'\n"},{"author":"flagrum3","post":"Here in lies one of the biggest problems with the Shroud authenticity debate; People will 'listen' to arguments from people like Nickell's, whom is not a scientist or a chemist or physicist or has any training in any fields which would allow him to make any educated remarks about the Shroud. Yet people keep quoteing his writings. Maybe if they would just check his credentials against those of authors of dozens of peer reviewed papers, minds might change a bit about the Shroud's authenticity.It's truly dumbfounding.F3.","date":"2012-05-11","mins":"2:38 PM","url":"http://theshroudofturin.blogspot.com/2012/05/you-state-that-there-is-no-paint-dye-or.html","title":"\nYou state that `there is no paint, dye or pigment on the Shroud that forms its image' but it is claimed that `the Shroud contains red ochre and other paint pigments'\n"}]
