[{"id":"comment-2305","author":"chidambaram_ramesh","post":"Though the intensity distance correlation demonstrated by the Shroud image could not be explained by current science, it conforms to the idea that it can be a holographic imprint. As explained in the last two chapters of my book “The Shroud of Turin: An Imprint of the Soul, Apparition or Quantum Bio Hologram”, a hologram reconstructs two images – one real (or, pseudoscopic) and the other virtual (or, orthoscopic). Both are exact replicas of the object but for their manifestation. The virtual image is produced at the same position as the object and has the same appearance of depth and the parallax as the original 3 D object. The virtual image appears as if the observer is viewing the original object. The real image is also formed at the same distance from the hologram, but in front of it. In the real image, however, the object depth is inverted. It can be compared to looking at the mould of a sculpted object or the inside of a mask, i.e., the observer has the sensation of looking straight through the back surface and seeing the front surface image from the inside out (with convex shapes becoming concave). For example, the image of a convex chess piece will appear as concave or reversed contour. Similarly, a 3 D brick lying on the ground would look like a brick sized hole sunk into the ground. Such an inside out image is called ‘pseudoscopic image’ and this inquisitive effect is called ‘pseudoscopy’ or depth reversal. This is due to the fact that the corresponding points on the two images (virtual and real) are located at the same distances from the hologram. Pseudoscopy is a notable feature of holograms and is an interesting phenomenon of optical phase conjugation due to 180° phase change. Though it is difficult to see this real image with an unaided eye, if one places a photographic plate, or frosted glass, in the plane where the real image is formed, one can obtain its two dimensional projection (imprinted on the linen cloth in the case Shroud). Another interesting and remarkable characteristic of the pseudoscopic image is that a photographic contact copy of a hologram does not yield a negative image, but another positive image. The basic theory is that a negative of a negative is a positive. Leith and Upatnieks point out: The hologram, which is the first recording on film, ordinarily is considered to be the negative. Yet the reconstruction gives a positive image. If a contact print if made of this, again a positive reconstruction is obtained. It is impossible to obtain a negative reconstruction’. (Leith, 1964) Thus the twin problems of the Shroud image – photographic negativity as well as image reversal (side reversal) could be well explained with the help of the holographic model of image reconstruction. Assuming that the quantum self manifested from the corpus inside the Shroud was a pseudoscopic (real) image, and that its two dimensional projection was imprinted on the Shroud, would settle almost all the conundrums shrouding the image. The body image penetrates into the cloth to a depth of two or three fibres only (in the order of 1/100th of hair thickness) and there is no cementation among the fibrils. Beneath them, the fibres remain undisturbed. Thus the radiation that acted on the Shroud material should have been low intensity and volumetric, representing the exact geometry of the body of the crucified man. As stated by Roger, any hypothetical conversion of entre body matter into energy (following E = mc2 formula) would have proved hazardous as such energy release would have been in the order of 200 300 megatons of TNT. Concerning the holographic model, science has proved that any kind of physical field, whether acoustic, electromagnetic, even perhaps gravitational, can create a hologram (volumetric representation of the exact geometry of the body), because what is needed is ‘wave coherence’ and ‘phase conjugate adaptive resonance’, which are independent of other factors like intensity or nature (wave kind). Thus, it is convenient for us to assume radiation of any kind and of any intensity under the quantum holographic model, till the exact kind and intensity of the radiation forming the bio holographic matrix is discovered. The double superficiality of the image, as discovered by Professors Guilo Fanti and Roberto Maggiolo, could also be explained by this holographic flux model. The second image contains the face image (though fainter) on the reverse side of the Shroud. Under the quantum bio holographic model, the manifestation of the 3 dimensional image of the host is hypothesized to be due to ‘phase conjugation adaptive resonance’ and no outside source of light or radiation is considered. Thus, the model is capable of explaining the non directionality of the Shroud image. Optimal Viewing Distance: Minute observers could note that there is an optimal viewing distance to see the Shroud image, and as once approaches it very closely, it disappears! After the fire in 1997, Aldo Guerreschi, a professional photographer in Turin, was asked to photo document the examination of the Shroud. He narrates his observations; “Moving around that table from a certain angle I saw this image so faded as if to practically disappear, while from others it seemed as if the figure were almost outside the sheet; it was, I repeat, an incredible emotion…. I approached the face placing my camera at a distance of about 20 – 30 cm, aimed the camera at the face and saw…nothing in the viewfinder; … I could only see it as I moved away from it.” (Guerreschi) Like him, Dr.Petrus Soons (who has proposed that the Shroud image contains holographic information), observes that the image appears more distinct at a distance and fades when viewed at certain angles, particularly as one comes closer to the Shroud. “The image is faint, without well defined boundaries so that the eye has no point of reference and it appears simply as variation of the background density.” Peter M. Schumacher says, “It is difficult to orient oneself relating to the image, if the observer is in close proximity to the cloth.” Parallax and viewing at an angle are the consistent features of hologram. While looking at the steroemetric holographic displays, one can move one’s head and can observe the continually changing the image aspect with the viewing angle. These effects can readily be experienced in lenticular displays, anaglyphs and stereograms. Half tone effect and the Dehydration of linen The formation of the image on the Shroud is a unique “pixel like” phenomenon. Where the image appears darker, it is not due to more or darker substances, it is because of a greater number of pixels. Thus the pixel density decides the colour intensity in the Shroud, as can be seen in a newspaper photograph. The size of the pixels that make up the image is one tenth the width of a human hair. Some skeptics are keen to argue that this tonality or pixel effect is due to the reflection of light and hence the Shroud image is a photograph. But the fact is different. The hologram stores the information of the object in the form of a wave front. Therefore, every point of the object has an influence on every pixel of the hologram. The x, y position of each ‘holographic pixel’ corresponds to the x, y position of each object point. To put it the other way around, each pixel of the hologram contributes to each point of the 3 D object. The depth information for each image point is also encrypted as the overall size of the single pixel interference pattern; an image point which reconstructs as being deep within the hologram will have a ‘pixel’ with a large width and with long radius slightly curved fringes, while a shallow point will have a tiny ‘pixel’ and small radius fringes. This is what happened in the case of Shroud image. Moran, in his paper, says that pixels vary in length along the fibrils from about 200 to 1000 microns (i.e. From 0.2 to 1mm). The intensity of the yellow colour is very uniform from one pixel to another, so that the image is formed by the closeness of the spacing of the pixels (similar to formation of an image in a half tone reproduction where it is the spacing of uniform black print dots that form the print image and not a variation in the blackness of the individual dots themselves. (Power, 2003) In an article “Optically Terminated Image Pixels Observed on Frei 1978 Samples”, Kelvin Moran describes the image pixels: ‘The individual image pixels have very sharp boundaries at their ends across the 15 micron diameter of the fibres. When seen at a magnification of 200 power, these pixels show uniformly darkened area over the natural color of the non imaged fibre. At the boundary between the image pixel and the clear fibre, there is a sharp change. There is no gradual edge as expected from a shadow mask or external light source…The fact that the pixels don’t fluoresce suggests that the conversion to their now brittle dehydrated state occurred instantly and completely so no partial products remain to be activated by the ultraviolet light. This suggests a quantum event where a finite amount of energy transferred abruptly.’ (Moran, 1999) This holographic pixel concept is even used for holographic image enlargement by repeating small pixels of a first hologram over large areas to form an expanded version of the first hologram. ‘Mechanically Transparent’ Man is a Hologram! Jackson proposed that “the body of the Man in the Shroud became mechanically transparent to its physical surroundings; it emitted radiation from all points within and on the surface of the body. This radiation interacted with the cloth as it fell into the mechanically transparent body, thereby forming the body image on the Shroud.” (Jackson 1977, 1984, 1990) Another point that strengthens this idea is that the body image is almost completely coherent with a vertical projection of the corresponding human body as if the Shroud was draped naturally over a body shape lying in the supine position. Physicist Thaddeus Trenn also thinks that, “due to a radiation event, the body of the man became mechanically transparent to the physical surroundings, and that a stimulus was generated that recorded the passage of the cloth through the body region and onto the cloth as an image.”(Parker) Linking the X ray effect noted by US chemist Dr. Giles Cart, Dr. Trenn opines that it is only a secondary effect to the primary phenomenon of dematerialization of the body. If the holographic manifestation of the quantum self is assumed to be behind the Shroud image, then Jackson’s theory of a man ‘mechanically transparent to the environment’ can be explained easily and justifiably..","date":"2011-01-28","mins":"1:10 pm","url":"https://shroudstory.com/2011/01/28/evidence-of-jesus-resurrection-in-the-shroud-of-turin/","cat":"image_theory","title":"Evidence of Jesus’ Resurrection in the Shroud of Turin?"},{"id":"comment-2402","author":"chidambaram_ramesh","post":"The mystery wrapping the Holy shroud is multi dimensional. As debated, it can be either man made or natural. Any theory which attempts to untie the knots should invariably explain all the unique characteristics hitherto identified by scientists like photographic negativity, 3 dimensional encryption of light intensity, anatomical exactitude etc. If the hands of a faker are assumed, then such theories should unequivocally explain how could the faker have envisioned the idea of ‘negative image’ or a painting with reverse shade, and executed it as back as in the 14th century? How could he have incorporated the image intensity versus distance correlation into the Shroud image? How could he have ensured that the impression of the image did not penetrate a depth less than 1/100th of a hair? How could he have been able to bring in the X ray effect amazingly in the case of hands, where one could easily observe metacarpal bones and phalange bones of each finger? What could have made the pollens grains, endemic to Palestine region, appear on the Shroud? Who could have brought the samples of limestone on the Shroud from Jerusalem? And, as Stevenson commented, if the Shroud was a creation of the Middle Ages, then its forger must have ordered the mites to go with it! The painting theory of Mc Crone may be, as he believes, able to prove that the bloodstains on the Shroud do not relate to human or that they are not blood at all. But he should not close his eyes to other perspectives of the problem. It requires a holistic view, comprehensive analysis and a complete package of solutions. Any attempt to pick out a single characteristics and to solve it without considering the connected facts will not be good. It is like the description of an elephant by four blind men. One grasps the trunk and concludes it is a snake. Another explores one of the elephant’s legs and describes it as a tree. Third finds the elephant’s tail and announces it is a rope. And the fourth blind man, after discovering the elephant’s side, concludes that it is, after all, a wall!.","date":"2011-02-06","mins":"1:10 pm","url":"https://shroudstory.com/2011/02/06/thoughts-for-a-sunday-morning-if-i-am-right-then-i-am-right/","cat":"image_theory","title":"Thoughts for a Sunday Morning: “If I am right, then . . . I am right.”"},{"id":"comment-2269","author":"chidambaram_ramesh","post":"De La Warr, Abrams, Drown and other researchers in radionics found that a blood sample from an individual is in permanent contact with every part of that person’s body even though he may be miles away. In one case, the lifelike image of a foetus was developed from a blood sample of a mother (during pregnancy) who was about 54 miles away ! Such ‘action at a distance’ and non local interactions have now been scientifically proved and explained by the discovery of ‘quantum entanglement’. Deplorably, when De La Warr told these things half a century ago, he was brought before the court of law on charges of cheating (though he won the case finally)!.","date":"2011-01-23","mins":"12:40 pm","url":"https://shroudstory.com/2011/01/23/humorous-comment-of-the-day-on-quantum-entanglement/","cat":"news_&_views","title":"Humorous Comment of the Day on Quantum Entanglement"},{"id":"comment-2273","author":"chidambaram_ramesh","post":"I can cite an article entitled “Empirical Evidence Supporting Macro Scale Quantum Holography in Non Local Effects” written by Sue Benfore and published in a non profitable scientific peer reviewed journal ‘ Journal of Theoretics ‘ (ISSN: 1529 3548). The article can be read at: http://www.journaloftheoretics.com/Articles/2 5/Benford.htm It will be interesting to note that Benford who wrote this remarkable article is none other than who (along with her spouse Mr.Marino) discovered the ‘French weave’ in the Shroud and that the C 14 sample was not a true representative of the shroud cloth. Again, Finnish theoretical physicist Dr.Matti Pitkanen, in his paper entitled “TGD Universe as a conscious hologram” has written about “Dela warr camera and field representation of genetic information” and another chapter on the experimental work of William Tiller about intentional imprinting of electronic devices, which is also noteworthy for the current discussion of quantum entanglement. It will be of great interest and importance to compare these with the latest findings of science in bio holography. Dr.Marina Shaduri and her colleague George T.Shitshinadze (Gogi) have experimentally demonstrated that it is possible to study shapes and structural details of most affected organs or tissues of organisms using only some distal parts of a living body as the source of information. They found, when fingertips are placed in the electromagnetic field of high frequency, their radiation displays exact images (holograms) of the body’s pathological structures. Based on experimental and clinical data, they suggest that physical waves of different types (mechanical, electromagnetic, magnetic etc) comprise dynamic web like structure, which is organized like a multilevel (multiplex) holographic grating with bounded space of a living body. Such a fragile and highly sensitive fluctuating (“flowing”) medium is capable of altering its whole organization according to the structure of its misbalanced parts. Thus, previously unknown functional mechanism, which has been defined as “Holo Informational System” serves not only as a system integrating factor, but also as a functional system that might affect some particle associated process within the entire body. Details of their work can be found at http://www.holoimaging.org/.","date":"2011-01-24","mins":"11:07 am","url":"https://shroudstory.com/2011/01/23/humorous-comment-of-the-day-on-quantum-entanglement/","cat":"news_&_views","title":"Humorous Comment of the Day on Quantum Entanglement"},{"id":"comment-1787","author":"chidambaram_ramesh","post":"My book “The Shroud of Turin: An Imprint of the Soul, Apparition or Quantum Bio Hologram” is released now. Please let me know your address to which I can send a copy of the book..","date":"2010-11-28","mins":"11:52 am","url":"https://shroudstory.com/2010/11/01/quantum-science-or-alchemy/","cat":"news_&_views","title":"Quantum Science or Alchemy"}]
