[{"id":"comment-168203","author":"aljones909","post":"Mike M. I think your picture shows the problem almost as much as mine. The important consideration is the amount of cranial capacity above the eye line. This is the space where the bulk of the brain HAS to fit. Other facial features can vary but any normal human must have the space to fit a brain. I’ve taken your image and aligned the mid point of the eyes. The problem is now more obvious..","date":"2014-11-03","mins":"8:33 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-169163","author":"aljones909","post":"Further on the dimensions of the shroud head image. It’s simple to show it’s a deliberate fabrication with an obvious mistake ‘encoded’ in the image. Take a tape, or a piece of string, and hold it between your eyes, level with your pupils, then take the tape over the top of your head to the corresponding point at the back of your skull. I.e. The string measures from your eye line at the front, over the top of your head, to the corresponding ‘eye line’ at the back. I’m reasonably normal and get a length of 35.5 cm. The corresponding mesurement on the shroud is around 20cm. This is a totally impossible result if a continuous cloth covered the front and back of the head. It must be an artifice. See http://tinyurl.com/nkn8naf if you want to verify the shroud measurement.","date":"2014-11-06","mins":"5:53 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-167996","author":"aljones909","post":"Piczek claims “The professional arts cannot find any such discrepancies and distortions in the anatomy of the Shroud Man”. This is plainly wrong. The image on the shroud is a common ‘gothic/byzantine’ art style with the limbs and head elongated. The head is particularly peculiar. This picture compares the shroud head with a head of more normal proportions (it’s an image used as an artist’s guide). There is something very, very wrong. The eyes are too high and the skull is too narrow. Getting these basics wrong (deliberately or inadvertently) was common in pre renaissance art. Bear in mind that almost all of the brain must fit in the region of the skull above the eyes. There simply isn’t enough room for a human brain that is within normal limits...","date":"2014-11-02","mins":"8:39 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-169621","author":"aljones909","post":"Thomas. Be as rude as you want. I’ll tell it like it is as well. No serious case has been put forward to suggest the radiocarbon dating of the shroud is wrong. The contra ideas range from the crazy (invisible patch) to the outlandish (unexplained neutron emissions). Then, because of a conviction that the date is wrong, we have new dating methods for ancient artefacts invented by an explosives expert (Rogers) and a Mechanical Engineer (Fanti). See Colin Berry’s article here: http://tinyurl.com/nqgp6su to get a glimpse of how threadbare the Rogers paper was. It reveals his partner in this paper was Kosiewicz. His speciality was nuclear waste disposal. This ‘miles out of area’ is typical for ‘shroud scientists’. The Fanti idea is beyond ridiculous. Amazingly, these new dating methods gain no converts among the wider scientific community. No one takes them seriously as a way to date, or confirm the dating, of ancient artefacts. They have no use beyond the bizarre world of ‘shroud science’..","date":"2014-11-07","mins":"12:37 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-169604","author":"aljones909","post":"Henrik, correct. The ‘back’ image is very faint. I was looking at an ‘unenhanced’ version. Happy(sort of) to accept a correction. It still leaves 2 big problems with the head image. 1. My previous posting shows (with diagrams) there is not nearly enough skull above the eyeline. There has been a deafening silence in response to this. 2. There is no image from the top of the head. Why not? What are the theories?.","date":"2014-11-07","mins":"11:19 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-169652","author":"aljones909","post":"David, the response to my post about ‘not enough skull above the eyeline’ was an alternative picture comparing a real head with the shroud head image. I re aligned this, matching the eyeline, to clearly show the problem remained with this alternative image. I’ve now looked at the posts on the second problem – the missing ‘top of the head’ image. The reasonable explanation is that the artist did not consider it or decided it would not be aesthetically pleasing. This image from Charles Freeman’s article is strong evidence that there always was a ‘void’ between the images of the front of the head and the back of the head. Vivid depictions of blood but absolutely nothing in the head gap (Charles has indicated that other images can be seen in the print version). The full article here: http://www.historytoday.com/charles freeman/origins shroud turin An image of the shroud from 1608 here (from the article): The accompanying podcast is well worth a listen: http://www.historytoday.com/the podcast.","date":"2014-11-07","mins":"4:08 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-169937","author":"aljones909","post":"Mike,I watched part of the video. The morphing stuff is quite convincing. See https://www.youtube.com/watch?v=p JBS5 S Eml Mc..","date":"2014-11-08","mins":"5:34 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-170066","author":"aljones909","post":"Mike M, science is not about having a conclusion then finding numerous (often contradictory) ways to arrive at that conclusion. It’s not the truth shroudologists seek – it’s the TRUTH. The most miraculous thing in that video is the hair of the CGI guy (Downing I think). It truly defies all known laws of physics Maybe you can point me to the peer reviewed papers where he explains how he extracted all this ‘encoded 3d information’. That would be real science. Detailed descriptions of assumptions, algorithms and methods..","date":"2014-11-09","mins":"6:36 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-170452","author":"aljones909","post":"Mike M, Fanti? Really? Single handed inventor of 3 new dating techniques! I notice from comments on this site that he even embarrasses many shroudies. Peter Schumacher is more academic. There’s a few caveats there. I find the ‘encoded 3d information’ idea very overblown. Here’s one of the images Fanti has in the article: It’s not terribly impressive. Certainly not miraculous. The point is that the hard science by real scientists puts it firmly in the 14th century. How the image was created doesn’t really interest me..","date":"2014-11-10","mins":"2:57 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-170581","author":"aljones909","post":"Mike M, “Since when was the number of inventions someone makes considered derogatory?” I think you are not taking into account thath his newly invented dating methods are not supported by a peer reviewed paper and are inherently inaccurate. Probably to the point of being completely useless. To suggest this trumps the relentless random decay of carbon molecules is ridiculous. “Did you compare the shroud’s 3 D relief to the 3 D relief of a real painting?”. No. Did you compare it to the 3 D relief of images produced by applying pressure to a cloth over an object?.","date":"2014-11-11","mins":"5:25 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-170883","author":"aljones909","post":"Mike M, Regarding Fanti and his new dating methods. It’s a host of assumptions, uncertainties and plucking numbers out of the air somehow, miraculously you might say, he gets it to average out at 33 AD. The idea seems to be that 3 piles of crap will combine to form one jewell. As Fanti said: “From a religious point of view, I am sure that the Holy Shroud is authentic and it is the most important Relic of Christianity. This because, following a precise question of mine, I had a personal answer in 1998 in front of the Relic.”. He has the “answer”. He just needs to make the data fit. These revolutionary dating techniques will never be heard of again (just like Rogers’ vanillin method). It’s “shroud science” but has no existence outside this domain. Regarding Thibault Heimburger, M.D and his critique of Garlaschelli’s demonstration. I agree with his general thrust that the 3 D aspects Garlaschelli acheived are pretty crude. The techniques Garlaschelli used (baking in an oven to simulate 600 years of aging etc) are unlikely to produce the same result as 600 years of actual aging. Garlaschelli was demonstrating a principle – that a relief template produces 3d effects. Bear in mind that the most impressive 3d images of the shroud head are reconstructions. They owe more to the skill of the reconstructer than they do to “3d encoded data”. Dan has also done a post on processed photos that can show 3d effects. Https://shroudstory.com/2014/06/05/good 3d from a conventional photograph/.","date":"2014-11-12","mins":"2:59 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"}]
