[{"id":"comment-183304","author":"aljones909","post":"Again, it’s astonishing the contortions theists will engage in to deny ‘the problem of evil’. If any theists are still following this I’d ask one question: Do you find any of O,K.’s explanations credible? Please study them. Infinities, broken fingernails and all. “As the residents of each of these worlds do not know the alternatives, their perception of evil is actually the same. Thus elimination of some forms of evil (or we can say forms in which the evil manifests) won’t make the world any better.” This is the most ludicrous nonsense – and it’s easily testable. A simple comparison: Cambodia 1975 1979 versus Denmark 2010 2014. The residents of these 2 godless worlds had very different experiences. The suggestion that godly infinities equalised their experiences is clearly nonsensical. If your ‘infinitely good’ deity sees it that way then you’re welcome to him..","date":"2015-01-14","mins":"4:57 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-183601","author":"aljones909","post":"I do realise Cambodia and Denmark are both on planet Earth. I was ridiculing your ‘broken fingernail’ argument. Your suggestion that the amount of suffering we experience on earth is is of little consequence (I think you resorted to algebra – measuring it against the infinite goodness of the christian god or something). “Have you eliminated all evil? ” I’ll leave magic wands and ‘perfect worlds’ to the theists. The real world will always be much messier. Less evil is what most folk want. “Do men feel happy in your ‘perfect’ world?” There is a sad fact about this horrible, interim world that theists should note. Most people are happy. Many people that aren’t happy can be made happier by effective treatments for brain cancer, multiple sclerosis, motor neuron disease muscular dystrophy, depression etc, etc..","date":"2015-01-15","mins":"7:18 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-184117","author":"aljones909","post":"“to state that some of them are “extreme” or “moderate” you need reference scale.”. The reference scale is our own conscious experiences. I challenge any theist to tell me they can’t distinguish between an agonising toothache and the discomfort of too tight underwear. I don’t need to ask a deity which is the most uncomfortable. Do you really need a godly scale to distinguish between broken finger nail and childhood brain cancer? “Could perfect God create a perfect world? Of course….. But how would you eliminate serial killers (and other criminals)?” If you’re suggesting that an omnipotent and omniscient god can’t create beings that are free of moral defects then one thing is certain – he’s not omnipotent and he’s not omniscient..","date":"2015-01-17","mins":"5:47 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-184299","author":"aljones909","post":"“The problem is that this is only your subjective scale…” Yes, my subjective scale informs me that agonising pain is much worse than too tight underwear. You go on: “too tight underwear might be the most ‘extreme’ evil. Yet, from there would be still ‘terrible suffering’ from the perspective of entities living in such world.” The idea you’ve presented above is plainly nonsensical. See Denmark/North Korea. “Yes he can – robots without free will programmed to be “good”.” The christian heaven will be populated by robots?.","date":"2015-01-18","mins":"11:56 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-180849","author":"aljones909","post":"“the pain and suffering I have endured has ultimately grown me spiritually and as a person”. Wonderful – but what of the suffering of the 90 billion people who either pre dated christianity or have never heard of it? Then there are the trillions of sentient creatures over a time span of 500 million years. All this suffering and pain to give an elect few spiritual growth?.","date":"2015-01-02","mins":"6:40 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-180732","author":"aljones909","post":"“Since things do not naturally combine in complexity but degrade when left to themselves”. That could hardly be more wrong. Islands of complexity form spontaneously. Atoms, galaxies, stars, planets, chemical compounds (amino acids detected have been detected on comets)..","date":"2015-01-02","mins":"8:31 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-181603","author":"aljones909","post":"Apologists are keen to move suffering on to the philosophical plane. Specific cases are very hard to make consistent with a loving god. Take the Fritzl case. He made a dungeon in the basement of his house. His daughter was imprisoned in the dungeon at the age of 18. During her 24 years of imprisonment she was repeatedly and frequently raped by Fritzl. She had 7 children. Four were kept in captivity with their mother. The others were raised by Fritzl. Most normal humans, if they had knowledge of the situation and they had the power to act, would have intervened in a heartbeat. In the immortal words of Christopher Hitchens “heaven watched on with indifference”..","date":"2015-01-06","mins":"6:17 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-181650","author":"aljones909","post":"“So what Heaven should have done? Sent a bolt of the blue and some angel police or peaceking forces intervention?” Something far more subtle could easily be achieved. Rer route a few neurons in Herr Fritzl’s brain? How about a stroke after his first rape conviction in 1967? Was the exercise of free will by this moral monster sacrosanct? “Do you want to compulsory enforce no evil on this world? Making all harm, doing all bad things physically impossible? Would such a world have been better? “. If childhood brain cancer did not exist I think the world would be better. I could produce a long list of similarly undesirable features of our world. Do you think a world with childhood brain cancer is better than one without childhood brain cancer?.","date":"2015-01-06","mins":"12:34 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-181687","author":"aljones909","post":"I’m suggesting that there are an infinite number of ways an all good, all powerful deity could act to prevent egregious evils. Why not make us more bonobo and less chimpanzee? In every culture males are responsible for about 90% of murders and serious violence. Higher testosterone levels seem to reduce empathy and increase reckless and violent behaviour. So why not have a more feminine world? Free will would still exist (assuming you think women have free will) but the worst excesses would be removed. No holocaust, no wars, no torture, no psychopaths. You abstain on the question of childhood brain cancer? I’m as astonished by that as I was by W.L. Craig’s defence of the Israelite slaughter of the Canaanite children..","date":"2015-01-06","mins":"6:33 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-181934","author":"aljones909","post":"“Do you want God to make all harm (no matter whether human inflicted or “natural”) physically impossible? Yes or No?” My opinion is that the christian god does not exist. The question therefore makes no sense. What you seem to be repeatedly evading is the charge that the christian idea of god is utterly incompatible with the amount and varieties of evil we see. You also failed to explain why the christian heaven can be free of evil while (presumably) populated with free willed entities. All this dancing around without a straight answer leads me to think you are not terribly comfortable with the topic. If you think a world with childhood brain cancer is better than a world without childhood brain cancer then please explain WHY..","date":"2015-01-07","mins":"7:38 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-182237","author":"aljones909","post":"“You cannot objectiely state what is “extreme” evil and what is only “moderate” evil.”. Extreme evil is childhood brain cancer. Moderate evil is when I get soap in my eye. There are, of course, an infinity of gradations between the most extreme evil and the mildest evil. This random list I’d put the following at the extreme end: torture, genocide, slavery, inner ear parasites that cause wildebeest to wander in circles until they collapse from exhaustion, motor neuron disease, multiple sclerosis, children dying of starvation, blindness caused by vitamin A deficiency, birth defects that result in the sufferers having short lives filled with suffering, intractable nerve pain, polio, smallpox (now eliminated), malaria, tsunamis, earthquakes..","date":"2015-01-09","mins":"7:37 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-182343","author":"aljones909","post":"Thomas, evil, as referred to in terms of ‘The Problem of Evil’, usually means all’evils. I.e. Natural and moral evils. Suffering would probably be a better term. If you want to hear a Swinburne (noted intellectual) giving a defence, listen to his conversation with Bart Ehrman here: It’s a truly chilling and nauseating performance. A smug, privileged englishman talking about the ‘opportunities’ to be had by others from the tsunami, child starvation and the holocaust. A couple of points: 1. There is, apparently, no limit on the amount of suffering that a Swinburne or a Plantinga could explain away by finding some ‘good’ in it. 2. Their explanation in the the Bible is quite clear. Suffering is caused by God meting out punishment (in “page after page after page of the old testament” according to Ehrman)..","date":"2015-01-10","mins":"5:39 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-182644","author":"aljones909","post":"“yet we cannot say that total elimination of some forms evil by external intervention will make that there will be less evil in the Universe. ” The implication of this is that it would be foolish to try and lessen the effects of any kind of evil. A psychopath is abducting, torturing and killing people. Don’t despair – it’s all for the best. Are you serious?.","date":"2015-01-11","mins":"5:52 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-182872","author":"aljones909","post":"O.K. At last you seem to be getting around to the thrust of your argument. I paraphrase: “If egregious suffering did not exist non believers would just complain about stubbed toes”. It’s a feeble argument. The ‘problem of evil’ addresses the world as it is. To claim “you’d just complain about something else” does not answer it. Your response to millennia of terminal cancer sufferers, screaming in agony during their final days (or weeks), is what? It’s all for the best? Childhood brain cancer is no different to a broken fingernail? “you cannot be certain whether God has not spared you potentially much more terrible (in human sense) evils than human brain cancer” A moral being could not justify torturing someone by saying “I could be torturing you in a much worse manner. We would class a human acting in this way as “monster”. If your claim is that childhood brain cancer PREVENTS greater suffering then let us know how this would work..","date":"2015-01-12","mins":"6:14 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-183116","author":"aljones909","post":"“The main problem is not whether they stole from you 1000 $ or 10 $, but the fact of stealing.”. I disagree with your analogy. You can’t admit there is a qualitative difference between millions of cancer sufferers screaming in agony and a broken fingernail? Your god, his mind filled with infinities, thinks it’s much of a muchness. Is that where rationalising theism leads you? “you must know what actually is the source of evil.”. I have a vague idea (given my rudimentary knowledge of biology) why cancers can arise and cause enormous suffering. What (or who) do you think is the source of this evil?.","date":"2015-01-13","mins":"6:45 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-171459","author":"aljones909","post":"Girolamo Segato (1792 – 1836) developed a method for turning cadavers to stone (petrification). No one has been able to duplicate his work..","date":"2014-11-15","mins":"5:48 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"}]
