[{"id":"comment-7757","author":"media_e_midia","post":"Mistyping “Surely people did not HAVE to belong…”.","date":"2012-01-31","mins":"10:53 am","url":"https://shroudstory.com/2012/01/23/has-playful-leonardo-left-us-a-clue-in-the-salvator-mundi/","cat":"news_&_views","title":"Has Playful Leonardo Left Us a Clue in the Salvator Mundi?"},{"id":"comment-7756","author":"media_e_midia","post":"Surely people did not to belong to secret societies in order to have access to the Veronica. Ostensions were public, small reproductions were available to pilgrims who pinned them to their hats and Francis Petrarch wrote a poem about the “grizzled and white old man” that leaves home in pilgrimage “to gaze on the image of Him/whom he hopes to see again in heaven” http://www.poetryintranslation.com/PITBR/Italian/Petrarch.htm# Toc13045785.","date":"2012-01-31","mins":"10:53 am","url":"https://shroudstory.com/2012/01/23/has-playful-leonardo-left-us-a-clue-in-the-salvator-mundi/","cat":"news_&_views","title":"Has Playful Leonardo Left Us a Clue in the Salvator Mundi?"},{"id":"comment-7438","author":"media_e_midia","post":"LOL. Just to add a touch to the Leonardo soap opera, could he have stolen the idea from a gifted German youth? http://arthistorynews.com/articles/797 Did Durer see Salvator Mundi.","date":"2012-01-23","mins":"5:23 pm","url":"https://shroudstory.com/2012/01/23/has-playful-leonardo-left-us-a-clue-in-the-salvator-mundi/","cat":"news_&_views","title":"Has Playful Leonardo Left Us a Clue in the Salvator Mundi?"},{"id":"comment-7471","author":"media_e_midia","post":"Just my cent on the ‘globe or lens’ topic. Or rather Sir Kenneth Clark’s cent, as he said “… the average man had become progressively less able to recognize the subjects or understand the meaning of the works of art of the past. Fewer people had read the classics of Greek and Roman literature, and relatively few people read the Bible with the same diligence that their parents had done. It comes as a shock to an elderly man to find how many biblical references have become completely incomprehensible to the present generation.”(KC, introduction to”Dictionary of subjects and symbols in Art” by James Hall) The object is labelled a globe because a globe is the correct attribute for an image meant to depict Christ as the Salvator Mundi (Saviour of the World). The globe or sphere does stand for the Universe. Not knowing this has lead some fancyful people to draw very odd conclusions http://sprezzatura.it/Arte/Arte UFO 1 eng.htm (scroll down to “ESALTATION OF THE EUCARISTY” (Detail of the Trinity) by Ventura Salimbeni) Viviana Castelli.","date":"2012-01-24","mins":"8:36 am","url":"https://shroudstory.com/2012/01/23/has-playful-leonardo-left-us-a-clue-in-the-salvator-mundi/","cat":"news_&_views","title":"Has Playful Leonardo Left Us a Clue in the Salvator Mundi?"}]
