[{"id":"comment-214986","author":"jim_giordano","post":"Isn’t it enough to look at the ‘quad mosaic’ pictures of the Shroud, see the huge difference of color between the sample area and the image area, and determine that the C14 samples are not representative of the Shroud?.","date":"2015-11-22","mins":"5:41 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-214989","author":"jim_giordano","post":"What is absurd is to think that the discontinuity in colouration is due to the lighting. Just focus on the area of the sample, see how the dark green follows the edges of the holes at the bottom and the edges where a relic and the earlier, pre 1978 sample was cut out. That dark green is a sign of contamination. The fact that the dark green runs parallel with the weave near left edge and has a sharp end, instead of gradually fading as near the holes, indicates or at least implies a systemic or intentionally man made contamination, such as possibly a re weave, though could also be the applying of dyes or colourant to hide a patch, say if at one time the big rectangular hole may have been patched and coloured to hide the ugly hole. I doubt they would have put it up for display with that big eyesore..","date":"2015-11-22","mins":"9:22 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-214991","author":"jim_giordano","post":"I would add the picture of the Shroud in the Hungarian Prayer Codex of ~AD1195, with the signature L and F shaped patterns of holes, also sheds a lot of doubt on the validity of the C14 tests..","date":"2015-11-22","mins":"10:02 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"}]
