[{"id":"comment-212135","author":"jim_giordano","post":"How is this “simony”? Please, Dave B look up a word that you don’t know before you use it. If they are so desperate for $, why didn’t the Turin custodian and other clergy protest the C14 results? They just accepted it and rolled over and went back to sleep. They could have at least wondered out loud, why is a linen from 1260 1390 shown in a book from the late 1100’s? Time travelling aliens?.","date":"2015-10-09","mins":"9:43 am","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","title":"No Closer to the Truth Because of Simony"},{"id":"comment-212173","author":"jim_giordano","post":"Most of the STURP team were atheists and agnostics. Barry and Alder were Jews. I think only John Jackson was a believer (obviously, since you can see his pectoral cross in pictures and vids of the STURP analysis). So don’t think STURP was a whitewash or Kinghts of Columbus meeting. A totally new group is fine, of course, and preferable too, the more eyes and minds the better. Maybe two or three separate groups (American/Canadian, British, Continental European, what the heck, how about a couple of teams from Asia too). Anyways, before they even get a look at the Shroud they should have to read everything, EVERYTHING STURP and any other team discovered, read all the criticisims, develop their plans and publish them, to expose them to the world for further suggestions, etc., so that the final plans will make a definitive, unassailable finding – unless they uncover some other ‘mysterious’ qualities. Well, that is what science loves the most. Anyways, if the C14 teams had looked at the results and suggestions of STURP, they wouldn’t have picked the worst place in the world for a sample..","date":"2015-10-09","mins":"6:04 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","title":"No Closer to the Truth Because of Simony"},{"id":"comment-212206","author":"jim_giordano","post":"I objected to “those who strongly believe in the “mystery” ” because it sounded like you thought STURP was the Shroud fan club. From Barrie Schwortz: they thought they’d get to Turin, take pictures of the brush strokes and be done in 5 minutes. And he gave the impression that most were agnostic. Maybe the survey of the participants beliefs was done AFTER their investigations, as I heard there was a number of conversions. (again from Schwortz or possibly the documentary Unwrapping the Shroud (?) Rev. Kim Dreisbach was in it, great voice, thought he was Catholic priest (really protestant clergy should get their own uniforms, avoids the embarrassing “oh, no, I’m not a priest” when I come up and say “Hi Father”). Rest in peace Rev. especially peaceful since you know the ‘secret of the Shroud”..","date":"2015-10-10","mins":"2:08 am","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","title":"No Closer to the Truth Because of Simony"},{"id":"comment-212195","author":"jim_giordano","post":"I think you found the biggest issue stopping new tests: the lack of a sponsor with deep pockets..","date":"2015-10-09","mins":"11:21 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","title":"No Closer to the Truth Because of Simony"},{"id":"comment-212260","author":"jim_giordano","post":"I concur a 1000% with what you said, and love that you mentioned Matthew 25:31, one of the many verses that some so called bible believing, faith alone types never seem to come across. If it proves authentic, that only means it’s a 1st century burial cloth, probably of Jesus, as who else was treated in such a way. But the atheists will make up something, like, a lot of political prisoners would have been treated this way, or it doesn’t matter, as it doesn’t prove He rose from the dead. If it’s not authentic, it’s still an incredible gospel of its own, but the trolls will go into over drive, in the media and internet, or even at the water cooler. We shouldn’t get too excited about further tests. Positive results won’t heal the splits in Christianity – imagine the evangelizing power of only one united message of Christ, instead of many competing versions, a lot of which are ‘lite’ and false, misleading versions. It would be better, if we want tangible proof of His existence, to feel His presence, to “keep watch with [Him] for one hour” in Eucharistic Adoration for the intention of Christian unity. Thanks for listening to my soap box, but it was divine inspiration and hard to resist..","date":"2015-10-11","mins":"12:29 am","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","title":"No Closer to the Truth Because of Simony"},{"id":"comment-212153","author":"jim_giordano","post":"Do we have any direct communication or statement from Turin about future testing? Is anyone really asking, officially to test it again, who? It always seems like it is some unnamed entity that is proposing new tests or rejecting any new tests. IMHO there is enough STRUP and circumstancial evidence (like the Hungarian prayer codex) to convince any disinterested party that it is authentic..","date":"2015-10-09","mins":"3:18 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","title":"No Closer to the Truth Because of Simony"}]
