[{"id":"comment-212736","author":"jim_giordano","post":"I meant that we don’t see the sides if the imaged areas, its like light from top and bottom reacted with the flesh to generate a reaction in the flesh that then dehydrated the fibres. If it was the body on its own then the sides of the body would have affected the fibres too – unless it was pulled tight side to side so that it wasn’t in line of sight of the body. The shroud seems to follow the body around its head to foot perimeter but no around the other direction. However it has been shown that the blood stains do seem to follow around the body contours in both axises (axes?)(axis’s?). See how that starts to affect our understanding of how the Shroud was faked, made naturally, or shows how the Resurrection happened. Is it possible, that if the Shroud was just allowed to drape around the body, but tight around the head and feet since we have a good image of the feet, that the imaging process would be gentle enough not to affect the fibres noticeably, but yet strong enough to give the image that we have. Why is there no image of the top of the head? (just the water stain)?.","date":"2015-10-16","mins":"9:24 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-212583","author":"jim_giordano","post":"I thought of another idea why the Church might be reluctant to do more testing, even if most of the testing has been positive. If PROVED positive, then they would have to give the Shroud back to the Orthodox in Constantinople, from where it originally came from. Or… is there a Catholic church still in Edessa??.","date":"2015-10-15","mins":"2:30 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-212605","author":"jim_giordano","post":"Rick, are you replying to me? I would agree with you wholeheartedly, but you know the crap that happens for the sake of ecumenism. The Orthodox are still mad at us for sticking a few extra words in the creed to make things more clear, more than a thousand years later. I was thinking that if the Patriarch made a stink about it, then the Church in Odessa (Urfa) could make a bigger stink about it, as Constantinople took it from them, who got it apparently from St. Thomas, as a posthumous, post Resurrection, gift from Christ..","date":"2015-10-15","mins":"6:37 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-212606","author":"jim_giordano","post":"Demonic things would cause people to leave God, not increase the faith in Him. Big serious fail for the stinky guy in red pj’s..","date":"2015-10-15","mins":"6:39 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-212581","author":"jim_giordano","post":"Piczek is a physicist, and a gifted large form artist that won commissions even as a young lady (teen I think), but speaking as a nuke eng – I don’t know what she has been smoking when she talks about her event horizon ideas – google it, there’s videos of her talking about it with dramatizations. It’s weird that the shroud image is undistorted. If it’s a fake, that’s what you would expect from an artist doing something to a flat sheet, unless made in the manner of Colin Berry’s experiments where you would expect some distortion and forshortening from projection. There’s diffenently projection shortening going on under the legs, and the top the legs look longer, like the shroud is following the general contour of the top – so the shroud being pulled taunt while imaging was happening wouldn’t have to be the case. I imagine the shroud loosely draped over the body, pulled and tucked around the feet, and then something imaged the body only from up and down direction and not perpendicular from the skin surface (there is no image from the side of the body or arms and legs). The imaged depended a bit on the pressure, as IMHO the back side looks more distinct than the front. So the either the resurrection event produced energy up and down, or a natural effect (radiation? piezo electrical?) from the stone slab/bench and the roof of the tomb or niche in the tomb, or the faker for some reason used only a bass relief, as Colin asserts, but I don’t know why or how he could have done under the legs – or with what to make the image. Wasn’t it Rodgers who worked out a theory that the image could be be a chemical reaction from the body and ointments, worked out that it would take about two days to get a good image and more would over saturate it – and then realized that the only way decay products wouldn’t be embedded in the shroud or that 1st century Jews would touch such a cloth on the third day stopping the process, would be if the body wasn’t there….(and that is what really stopped the process…).","date":"2015-10-15","mins":"2:27 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-209929","author":"jim_giordano","post":"I take exception to his comment about the ‘ ridiculous idea’ that the side strip was cut off and use to tie up the body. I’ll find the link later, but that idea is confirmed by the stitching using a technique only seen from artifacts recovered from Masada (last occupied AD70)..","date":"2015-09-09","mins":"2:00 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"}]
