[{"id":"comment-127723","author":"phpl","post":"Interesting to learn that Professor Ramsey is a practicing Christian. Laboratories throughout the world are willing to open their doors for another carbon dating test , but the Vatican don’t agree. Why ? What is the Vatican afraid of ?.","date":"2014-06-08","mins":"4:34 am","url":"https://shroudstory.com/2014/06/07/1988-pictures-and-details-from-oxford/","cat":"carbon_14_dating","title":"1988 Pictures and Details from Oxford"},{"id":"comment-173613","author":"phpl","post":"Need I say that I also respect Mr Farey ? I am also grateful to Dan Porter for allowing everyone to write what they wish. Thumbs up for this beautiful act Dan ! In fact I like most people on this website, including pro authenticists like Louis, O.K, Daveb of Wellington, etc. I sometimes exchange arguments with them but I like them. People that I dislike are these cunning foxes who never believed in the shroud’s authenticity in the first place (or if they ever did believe, it was a long time ago), but who pose as guides so as to ruthlessly achieve financial gains..","date":"2014-11-29","mins":"11:07 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-173610","author":"phpl","post":"I respect you Mr Berry..","date":"2014-11-29","mins":"10:31 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-173686","author":"phpl","post":"I’m afraid that the final part of my post was ambiguous. When I talk about those “who pose as guides so as to ruthlessly achieve financial gains” I’m talking about people who don’t believe in the shroud’s authenticity, but pretend to be fully convinced that it is real in order to obtain financial gains. Your work is fully appreciated by many, including me Charles..","date":"2014-11-29","mins":"8:43 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-173596","author":"phpl","post":"OHIO STATE UNIVERSITY BLACKWELL HOTEL August 14 through August 17, 2008 Abstracts of Papers Invisible Mending and the Turin Shroud: Historical and Scientific Evidence by Joseph G. Marino (J Marino240@aol. Com) and M. Sue Benford (MS Benford@aol.com). Saturday, August 16, 9:15 a.m.–9:45 a.m. One prominent theory regarding the results of the 1988 Carbon 14 (C 14) dating of the Shroud is that the sample Text Box: area had been repaired with a patch or “invisible reweave,” thus producing a dating resulting from a combination of 16th century and first century cloth. This paper recounts the initial doubts about the validity of the C 14 results; the history behind the patch theory; the abundant historical and scientific information support of the theory, especially from the findings of the late Ray Rogers in his paper published in 2005 after his direct examination of the C 14 samples compared with other samples from the main cloth; independent confirmations of Rogers’ findings; criticisms of Rogers’ findings; and refutations of these criticisms. The authors conclude that the invisible reweave is the most reasonable explanation for the dating of the Shroud. No comment..","date":"2014-11-29","mins":"8:55 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-173601","author":"phpl","post":"“Even though all the criticisms of the C 14 result are valid,” That can’t be true as the criticisms sometimes contradict each other..","date":"2014-11-29","mins":"9:15 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-173607","author":"phpl","post":"Since you talk about betting Hugh … Some years ago I was having a chat with an accountant and he told me this. I was in my late twenties and had just passed my final exams. I was pretentious at that time. I decided one day to go to a casino and have some fun. So, I went there with one thousand dollars in my pocket. I at first observed the players and the casino staff and decided to start gambling. As soon as I started to gamble , I also started to win. It was incredible, after a while I had gained more than three thousand dollars. A guy that I met some time before at a business meeting began to chat with me. I told him that I came here with one thousand dollars and had now tripled this amount. He smiled at me, congratulated me , and asked me to lend him five hundred dollars. I was a little bit annoyed by his demand, but accepted. I continued to play and by midnight I had won more than six thousand dollars. I couldn’t believe it. The same guy again started to talk with me, and once more asked me to lend him five hundred dollars. I hesitated, but he was a charming fellow and I accepted to lend him this amount. Luck sometimes visits a fool, but it never sits down with him and by the end of the day I had lost everything. As the casino was closing the guy came to talk to me for a third time and I told him what had happened. He looked at me and said “I knew by experience how this was going to end , that’s why I asked you to lend me this money. Here’s your one thousand dollars … and never, never again enter a casino.” Patrick P.S – Wagering on the shroud’s authenticity is very risky, but betting on people’s credulity and exploiting it to make money is a sure bet..","date":"2014-11-29","mins":"10:10 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-192872","author":"phpl","post":"For “Sindonists”, it’s not only Testore, Vial and Flury Lemberg who were incompetent. You also have to add the scientists (Christopher Ramsey, Timothy Jull , etc) who performed the test, Franco Testore, Giovanni Reggi, Luigi Gonella, the photographers, the camera operator … Fortunately, Zorro, A.K.A Raymond Rogers came afterward and cleaned the mess. God bless Raymond Rogers..","date":"2015-03-09","mins":"3:18 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-159472","author":"phpl","post":"” … but the doubts must still remain.” The only indisputable thing that remained following the C 14 dating was a date tallying perfectly with skeptics’ forecast. The worst possible date for the “shroudies”..","date":"2014-10-05","mins":"6:50 am","url":"https://shroudstory.com/2014/10/04/an-abstract-for-today/","cat":"carbon_14_dating","title":"An Abstract for Today"},{"id":"comment-159388","author":"phpl","post":"….You forgot to mention Stephen E. Jones’ magnificent KGB conspiracy theory Hugh..","date":"2014-10-04","mins":"11:21 pm","url":"https://shroudstory.com/2014/10/04/an-abstract-for-today/","cat":"carbon_14_dating","title":"An Abstract for Today"},{"id":"comment-185647","author":"phpl","post":"It takes considerable imagination to see the shroud in the pray codex..","date":"2015-01-23","mins":"5:15 am","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","title":"BSTS Article by Hugh Farey"},{"id":"comment-185269","author":"phpl","post":"“To those who don’t really grasp statistics, it seems crazy that if two people count 70 and 80 cows in a field, there is a statisitical probability that there are in fact only 4, but that’s how they work” Apparently it works everywhere except in New Zealand ….","date":"2015-01-21","mins":"10:53 pm","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","title":"BSTS Article by Hugh Farey"},{"id":"comment-197022","author":"phpl","post":"The Holy See officially agreed with the Radio Carbon dating result in October 1988. I have since then never read or heard of any official statement from the Holy See questioning the validity of the 1988 results or agreeing with any of the hypotheses or theories formulated by supporters of authenticity in attempts to discredit the Radio Carbon dating medieval date..","date":"2015-04-21","mins":"4:08 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-197074","author":"phpl","post":"” It was 50 years old, but carbon dating said it was 350 years old. There might have been A PROBLEM CREATED BY DETERGENT (upper cases mine) which had been used on the cloth.” So, the carbon dating said that it was much older than it really was. Saloperie ….","date":"2015-04-21","mins":"12:10 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-197116","author":"phpl","post":"“If the Vatican really believed that the 1988 C 14 results proved the Shroud was not authentic, it’s most unlikely that they would have allowed exhibitions in 1998, 2000, 2010 and 2015.” I couldn’t disagree more..","date":"2015-04-21","mins":"10:45 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-197149","author":"phpl","post":"The only thing that I agree with is that since Joaquin Navarro Valls was at that time Vatican’s official spokesman, his oral statement was official..","date":"2015-04-22","mins":"4:15 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-197143","author":"phpl","post":"“(The radiocarbon test was) an experimental datum among the others with the validity and also the limits of the sectional tests that have to be integrated in a multidisciplinary field» An incidental, ambiguous, and low keyed oral unofficial statement that doesn’t even address the issue directly..","date":"2015-04-22","mins":"3:38 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-197146","author":"phpl","post":"You should immediately inform the Radiocarbon experts who dated the old cloth about this. I bet that they’ll be very grateful..","date":"2015-04-22","mins":"3:59 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-88051","author":"phpl","post":"Sad to see how someone as intelligent as Mr Stephen E. Jones has turned out ….","date":"2014-03-13","mins":"12:51 am","url":"https://shroudstory.com/2014/03/09/comment-promoted-on-the-hacking-hypothesis/","cat":"carbon_14_dating","title":"Comment Promoted:  On the Hacking Hypothesis"},{"id":"comment-127886","author":"phpl","post":"“And again, a misunderstanding of statistics.” – Strange for a mathematics teacher ….","date":"2014-06-08","mins":"11:37 pm","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","title":"Conspiracy Theory Part 4"},{"id":"comment-124489","author":"phpl","post":"Stephen E. Jones has not only criticized the Marino and Benford reweave theory , but also ” all shroud pro authenticists attempts to discredit the radiocarbon date.” He has put himself in a very awkward position indeed. Anti authenticists will appreciate ….","date":"2014-05-25","mins":"12:50 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-125188","author":"phpl","post":"Do you speak French Hugh ?.","date":"2014-05-28","mins":"1:55 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-215168","author":"phpl","post":"It’s funny that Hugh Farey , a Shroud skeptic, went to the recent Shroud exhibition and that Stephen E. Jones , a serious contender to ” The world’s most passionate, most vociferous Shroudie ” title didn’t. A short message to Dan : There is no need for you to ask Jones to visit your website. Despite his claims, he is perfectly aware of what’s being posted here everyday..","date":"2015-11-27","mins":"3:07 am","url":"https://shroudstory.com/2015/11/21/computer-hacking-theory-for-carbon-dating-continues/","cat":"uncategorized","title":"Computer Hacking Theory for Carbon Dating Continues"},{"id":"comment-148242","author":"phpl","post":"It’s very courageous for Stephen E. Jones to make accusations against people who can no longer defend themselves. I must admit that I’m very impressed by Jones’ courage..","date":"2014-09-03","mins":"6:11 am","url":"https://shroudstory.com/2014/09/03/conspiracy-theory-part-nine/","cat":"uncategorized","title":"Conspiracy Theory Part Nine"},{"id":"comment-199491","author":"phpl","post":"“So those who continue to dismiss my theory as merely a “conspiracy theory,” in the full knowledge of my above disclaimers, do so dishonestly.” Dan is dishonest. PHPL is dishonest. Hugh Farey is dishonest. Et cetera Thanks God, Stephen E. Jones is honest..","date":"2015-05-19","mins":"1:40 am","url":"https://shroudstory.com/2015/05/18/i-tried-to-ignore-the-carbon-dating-computer-hacking-conspiracy-theory/","cat":"conspiracy_theory","title":"I Tried to Ignore the Carbon Dating Computer Hacking Conspiracy Theory"},{"id":"comment-215965","author":"phpl","post":"“This paper came out of an online conversation with Joe Marino and Paul Maloney, with additional input from Bill Meacham, Professor Emanuela Marinelli and Barrie Schwortz. I am deeply indebted to them for sharing their knowledge, wisdom and advice.” All the people who shared their knowledge, wisdom and advice are fully convinced that the Shroud is authentic. Where is the objectivity , the impartiality, the neutrality ?.","date":"2015-12-09","mins":"4:50 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-124368","author":"phpl","post":"“I’ve asked the AMS lab at Arizona University if they’d like to comment.”. Did you receive any reply Hugh ?. ” To anybody (even a statistician) the answer is none whatever, but statistically the answer is not zero. ” – I must tell you that I greatly appreciated this sentence Hugh. I think that “the answer is not zero” is not only valid on a statistical perspective, but also on a philosophical one. Questions like ” Who am I ?”, “Do I really exist?” , may seem irrational or senseless, but that’s not the case..","date":"2014-05-25","mins":"3:57 am","url":"https://shroudstory.com/2014/05/24/stephen-jones-the-kgb-allegedly-executed-both-shroud-of-turin-hackers/","cat":"hacking","title":"Stephen Jones: The KGB allegedly executed both Shroud of Turin Hackers"},{"id":"comment-216481","author":"phpl","post":"I first read your last sentence too quickly and thought that David Sox was your son. Anyway, I think that David would have been proud to have Charles Freeman as dad..","date":"2015-12-14","mins":"10:02 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-206309","author":"phpl","post":"Okay, but what does this has to do with the Shroud of Turin 1988 Radiocarbon 14 testing ?.","date":"2015-07-22","mins":"5:08 am","url":"https://shroudstory.com/2015/07/22/interesting-article-on-radiocarbon-dating/","cat":"carbon_14_dating","title":"Interesting Article on Radiocarbon Dating"},{"id":"comment-206311","author":"phpl","post":"Thank you Dan. I appreciate that..","date":"2015-07-22","mins":"5:46 am","url":"https://shroudstory.com/2015/07/22/interesting-article-on-radiocarbon-dating/","cat":"carbon_14_dating","title":"Interesting Article on Radiocarbon Dating"},{"id":"comment-193946","author":"phpl","post":"Even a broken clock is right twice a day and you nail it perfectly when you write about the glaring differences ..","date":"2015-03-21","mins":"8:52 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","title":"John Klotz Delivers the Knockout"},{"id":"comment-193875","author":"phpl","post":"Hi Hugh, I see there’s someone named Hugh Farey who posts videos on youtube, is that you ? I must tell you that I’m pretty shocked by the way that Stephen E. Jones talks and refers to you on his blog. I do understand that someone may occasionally behave inappropriately by loosing his temper, but this guy seems unable (or has absolutely no intention ) to talk and communicate with you in a decent and civilized manner. Is all this normal ? You should perhaps consider ignoring him completely or start retaliating. Cordialement Patrick.","date":"2015-03-20","mins":"11:30 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","title":"John Klotz Delivers the Knockout"},{"id":"comment-193849","author":"phpl","post":"“The odds against the fact that the artist of the Pray Codex did NOT copy either the Shroud of Turin or a copy of the Shroud of Turin are astronomical” The odds were thoroughly discussed on this blog recently. Https://shroudstory.com/2014/06/21/discussion about the pray codex and its relation to the shroud is over/ If two persons decide to depict Jesus’ shroud, there will always be some resemblances, some similaries between these two depictions even if the only thing that connects them is Jesus’ shroud. If I decide to draw a horse , it doesn’t mean that I am copying someone’s else drawing. I am just drawing a horse , and yes, it will definitely bear some resemblance with other people’s horse drawings that I never saw and will never see..","date":"2015-03-20","mins":"6:33 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","title":"John Klotz Delivers the Knockout"},{"id":"comment-193859","author":"phpl","post":"All this has been previously discussed before at length on several websites including this one by people much more qualified than PHPL, John Klotz or Nabber, and I don’t want to start a long and endless discussion, If I follow shroudies’ logic, the guy who drew the Codex Pray (a very bad draughtsman by the way) cared about minor details like holes, (or was it just a decoration .. ?) but why didn’t he drew the much more important significant beard and moustache ?? Why is it that in the Shroud of Turin image, the right palm is over the base of the left hand, while in the Pray codex, the arms intersects above the wrists ?? As I wrote above, two drawings depicting the same subject can obviously share a few similarities, but this doesn’t mean that there is any connection between these two drawings as such. ..","date":"2015-03-20","mins":"9:15 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","title":"John Klotz Delivers the Knockout"},{"id":"comment-177775","author":"phpl","post":"What Went Wrong With the Shroud’s Radiocarbon Date? Nothing..","date":"2014-12-19","mins":"10:20 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","title":"Just Published:  What Went Wrong with the Radiocarbon Date?"},{"id":"comment-179059","author":"phpl","post":"“… the 1988 results did not match with all of the data collected by the 1978 examination” Not really a revelation !.","date":"2014-12-25","mins":"1:46 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","title":"Just Published:  What Went Wrong with the Radiocarbon Date?"},{"id":"comment-195188","author":"phpl","post":"Tout ça c’est bien joli but the C14 dating result tallied PERFECTLY with the date that skeptics had predicted prior to the test. They were NOT wise after the result. Just to name a few clear cut examples : ” In 1986, reviewing Ian Wilson’s Evidence of the Shroud for the Christchurch Press, I predicted that if the cloth ever were to be carbon dated it would come in at A.D. 1335, plus or minus 30 years. When the Shroud was finally dated and the results came back from the participating laboratories, the collated result was A.D. 1325, plus or minus 65 years. I was ten years off ” (Dennis Dutton) ” I believe the ‘Shroud’ was painted by an artist shortly before it first appeared in history in 1356, say 1355 to allow a year ‘for the paint to dry.’ There is NO blood on the ‘Shroud.’ That was my position by January 1, 1980 and I have maintained that position at every opportunity since.” (Walter Mc Crone) ” …the shroud was created by an artist near the time it was first publicly introduced around 1353 ” (Joe Nickell – 1983).","date":"2015-04-02","mins":"8:51 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-195336","author":"phpl","post":"“Are you aware that the AIM is a product of your fancy and/or wishful thinking ?” Shroudstory.com or fancystory.com ?.","date":"2015-04-04","mins":"2:24 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193339","author":"phpl","post":"“I would hazard a guess that even a toy microscope would be an instrument of mystery to Frau Flury Lemberg” daveb should send a toy microscope and a personal memo to Mrs Flury Lemberg by express courier. I bet that she’ll reply to him..","date":"2015-03-14","mins":"3:11 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-194377","author":"phpl","post":"Louis, can’t you see that all these people are clutching at straws in a sad and worthless attempt to discredit the radiocarbon 14 dating ?.","date":"2015-03-25","mins":"11:34 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-192481","author":"phpl","post":"Klotz will educate the expert..","date":"2015-03-05","mins":"7:35 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-100366","author":"phpl","post":"I am obviously relieved to note that we have people like Hugh Farey on this website. I highly appreciate your intelligence, objectivity and common sense Hugh..","date":"2014-04-17","mins":"2:07 pm","url":"https://shroudstory.com/2014/04/16/okay-we-will-need-to-wait-several-weeks/","cat":"carbon_14_dating","title":"Okay, we will need to wait several weeks"},{"id":"comment-142241","author":"phpl","post":"I don’t know what was Emanuela Marinelli’s first intention , but the final result is that after looking at her presentation skeptics will be even more skeptical than before…and some “shroudies” were claiming that the sample was taken behind close doors with no cameras or witnesses !.","date":"2014-08-04","mins":"11:48 am","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli"},{"id":"comment-105767","author":"phpl","post":"Irony is aristocratic..","date":"2014-04-29","mins":"9:28 am","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","title":"Sabotage?"},{"id":"comment-143800","author":"phpl","post":"Hi Dave, How could scientists’ supposedly anti authenticist opinions have an impact on another carbon dating test in the first place ? The main argument of authenticists is that the sample was taken from a medieval patch woven into the shroud. Fair enough, then let the scientists perform a new test with one or more sample(s). Barry and his friends who so eagerly say now that the chosen sample used in 1988 was the worst possible one could choose and cut the new chosen sample(s)..","date":"2014-08-14","mins":"12:13 am","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-143866","author":"phpl","post":"Dave, Anyone who read your posts will be impressed by your general knowledge level. An open minded, well educated intellectual indeed. But many will also think that when you defend the shroud’s authenticity , you make a striking, eye catching about turn. I suggest that you read your above post again..","date":"2014-08-14","mins":"6:16 am","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-144357","author":"phpl","post":"“if a first century date does come up on a radiocarbon redating” Good luck ….","date":"2014-08-17","mins":"7:30 am","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-94811","author":"phpl","post":".Concerning your highly controversial computer hacker theory, you should at least have the moral decency to contact the labs and ask them their opinion before exposing your theory..","date":"2014-03-30","mins":"2:26 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","title":"Stephen Jones’ Revised Hacking Theory Part I is Available"},{"id":"comment-94848","author":"phpl","post":"Stephen Jones’ new photo definitely bears a striking resemblance to the face on the shroud .May be that he and Jesus are identical twins ? Who knows..","date":"2014-03-30","mins":"5:31 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","title":"Stephen Jones’ Revised Hacking Theory Part I is Available"},{"id":"comment-125922","author":"phpl","post":"I would like new radiocarbon tests to be performed with daveb of wellington nz as chief witness..","date":"2014-05-31","mins":"10:59 am","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","title":"The Challenge for Stephen Now"},{"id":"comment-126232","author":"phpl","post":"Are you suggesting that the three laboratories selected were not of the highest level ?.","date":"2014-06-02","mins":"3:29 am","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","title":"The Collapse of the Fraud Theory"},{"id":"comment-206862","author":"phpl","post":"Hi Dan, I felt just like you when reading his “new” post and I contacted him to ask him why he had to write the very same thing again, again and again. It’s very unlikely that I’ll receive a reply..","date":"2015-07-29","mins":"9:31 am","url":"https://shroudstory.com/2015/07/29/the-hacking-of-the-carbon-dating-over-and-over-and-over/","cat":"carbon_14_dating","title":"The Hacking of the Carbon Dating Over and Over and Over"}]
