[{"id":"comment-206261","author":"thomas","post":"I struggle to see how the Shroud could have been created as a liturgical tool when it was being exhibited in Lirey in 1355 as a relic. Also I really don’t think a liturgical aid would have displayed Christ’s buttocks. That’s a nonsense. Give me Colin’s theories any day!!!!.","date":"2015-07-21","mins":"5:40 am","url":"https://shroudstory.com/2015/07/21/a-rare-piece-of-cloth/","cat":"history","title":"A Rare Piece of Cloth"},{"id":"comment-207933","author":"thomas","post":"What seems clear is there are several accounts of the Mandylion where reference is made to both a face AND body image. There are a number of possible explanations, including: – Several objects were referred to as the Mandylion, including the Shroud (hence these references) – There was confusion of the relics, leading to false descriptions (Yannick’s explanation) There seems to be an assumption from some commentators that the term “Mandylion” could only have ever been applied to a singular object. I don’t think that is necessarily the case. There may have been a number of objects masquerading as the Mandylion., with different characteristics, and hence different descriptions..","date":"2015-08-11","mins":"12:20 am","url":"https://shroudstory.com/2015/08/10/a-superbly-detailed-exploration-of-the-image-of-edessa/","cat":"history","title":"A superbly detailed exploration of the Image of Edessa"},{"id":"comment-207848","author":"thomas","post":"Wonderful resource. Very interesting to read of multiple attestations to a cloth with not only face but full body image of Christ. I strongly believe they are allusions to the Shroud. Also interesting to read of Guscin’s view on the likely latin origins of the word ‘mandylion’.","date":"2015-08-10","mins":"4:12 am","url":"https://shroudstory.com/2015/08/10/a-superbly-detailed-exploration-of-the-image-of-edessa/","cat":"history","title":"A superbly detailed exploration of the Image of Edessa"},{"id":"comment-166782","author":"thomas","post":"Excellent daveb.","date":"2014-10-30","mins":"1:10 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"id":"comment-102157","author":"thomas","post":"Islam and democracy do not – and cannot – coexist. I imagine some lily livered liberal will challenge my assertion..","date":"2014-04-21","mins":"9:58 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!"},{"id":"comment-166823","author":"thomas","post":"Daveb raises a very good point about the position of side wound, which is NOT raised in the article. It is atypical and almost certainly suggests the image was created by contact with an object (Jesus’s body if you are authenticist, or bas relief if not) rather than painted on. Why would an an obvious painting created for ceremony – as Freeman suggests – be then exhibited and venerated? Freeman suggests an association with a miracle as a possibility. I think it far more likely that it was exhibited as Christ’s true burial shroud or at least a representation of it, and its mysterious and unique ghostly image (totally unlike a painting) was part of its attraction. I have previously argued that the image was always faint, referring to a number of depictions from the 1500s that clearly attempt to depict its faint ghostly nature. I also argued that the bolder depictions do not prove that the image was once much bolder, but rather represent a less skilled depiction OR the artist’s desire to show the detail of the image rather than faithfully try to depict its faintness. Crowds go to see the ghostly image today so why not crowds in the 1600s. Why does its display and attraction of large crowds imply that the image was much bolder? I also struggle to see why a ceremonial prop as Freeman proposes would need to show frontal and dorsal images. Why depart from a tradition of just showing a frontal image? eg. The epitaphios And the nudity remains a problem. Very rare indeed in depictions of Christ. Even in the 1300s the overwhelming majority of depictions showed Christ with loin cloth. I know of one or two small paintings, but am unaware of statues or large artistic representations used for public display / worship that show Christ without loincloth. There are many more problems with this theory but I don’t have the time now..","date":"2014-10-30","mins":"4:12 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"id":"comment-207458","author":"thomas","post":"I think there are some compelling links between Mandylion and Shroud. Daveb in addition to Latendresse and Scavone you should add the name Thomas de Wesselow, well credentialed art historian. Have you read his book? I think he makes quite a compelling case. In particular, several historic references to the Mandylion being a large sheet, and having a body image (ie. Not just a face image)..","date":"2015-08-05","mins":"3:27 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207529","author":"thomas","post":"You are a very arrogant man. There are still plenty of suggestive links to suggest that the Mandylion / Shroud connection cannot be ruled out. I would suggest that there aren’t many “unbiased” researchers, living or dead, working around the shroud!.","date":"2015-08-05","mins":"10:52 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207460","author":"thomas","post":"Personally, I don’t find the argument that goes as follows particularly compelling : “the Shroud can’t be the Mandylion because the Mandylion has Christ’s face with eyes open and no blood stains” We know now that the eyes appear closed with the advantage of the negative image, but without the benefits of modern photography ancients could have just as easily concluded that the eyes were open. After all, it’s rather hard to the naked eye to make out any eyes within those eye sockets. It’s also a fallacy to consider that the Mandylion can’t be the Shroud because it didn’t show blood on the face image. There is always the potential for artistic licence, and then a tradition to build upon that artistic licence! And the cultural climate through the 800s, 900s and 1000s was ripe for a depiction that showed a non blooded face. As we all know, the depictions of Jesus from this period were typically non bloodied – Christ was glorified and all powerful, not the “suffering servant”! Some here who attack the Mandylion / Shroud connection believe that the Pray Manuscript is a representation of the Shroud. Yet the PM displays almost none of the bloodied Christ as we see on the Shroud. Look at some of the Shroud depictions. They didn’t always show blood on the face.They didn’t always show the scourge wounds. They often (but not always) showed a loin cloth (when that does not exist on the Shroud). They usually don’t show the “blood belt”. They sometimes do not show the “poker holes”. Does that mean they aren’t depictions of the Shroud? No!!! They shows differences because they: worked from memory and/or exhibited artistic license and /or responded to cultural sensitivities..","date":"2015-08-05","mins":"3:49 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207530","author":"thomas","post":"De Wesselow: Re: Wilson’s theory: “Wilson’s theory is patently better than the current orthodoxy. Although much remains to be clarified, I conclude, therefore, that the Mandylion was indeed the Shroud” I don’t have time to go into the details of the case De Wesselow makes, but in brief: Account from 944 suggestive of final Shroud like face image, references to it being a sweat like secretion. – from same time, account of Emperor’s sons unable to see eyes and ears of the face – 4 written sources dating from 7th to 10th centuries refer to Mandylion as a ‘sindon’ – Referred to as a ‘himation’ (cloak or mantle) in 730 – The tetradiplon reference – Oldest Latin Abgar Text, from 10th / 11th century: “I am sending you this linen cloth, on which you will be able to see not only the form of my face but the divinely transformed state of my whole body” That last one seems very interesting..","date":"2015-08-05","mins":"11:10 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207543","author":"thomas","post":"OK Daveb, I’ll keep an open mind, and try and read that paper when I have some spare time..","date":"2015-08-06","mins":"4:01 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207544","author":"thomas","post":"A quick thought on a quick skim of the paper – there are a lot of historical references to the Mandylion / Image of Edessa, and complexities in accounts, I don’t believe the theory can be dismissed quite yet. There might have been several “Mandylion”, just like there have been several “Shrouds”. I still think the potential exists that some references to the “Mandylion” are to a Mandylion that is the Shroud, and others are to a Mandylion that wasn’t the Shroud…if you follow my drift. History is not necessarily simple or linear, it can be complex, non linear.","date":"2015-08-06","mins":"4:09 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207779","author":"thomas","post":"OK, thank you Daveb. But any thoughts on this quote: Oldest Latin Abgar Text, from 10th / 11th century: “I am sending you this linen cloth, on which you will be able to see not only the form of my face but the divinely transformed state of my whole body” Is there anything dubious about it? De Wesselow quotes it, and it seems more than suggestive of the Mandylion comprising a body image…..","date":"2015-08-08","mins":"6:47 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207788","author":"thomas","post":"Thoughts for the day…. If a medieval faker was trying to mimic an imprint of Christ on the Shroud then wouldn’t he most likely have shown the full back of rhe legs imprinted on the cloth? Don’t think it makes sense that he would have executed the image as we see it with distance between much of the back of legs and cloth..","date":"2015-08-09","mins":"2:49 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207811","author":"thomas","post":"Thanks daveb. Regardless of mandylin connection or not I believe the reference to the full body image is suggestive of the shroud..","date":"2015-08-09","mins":"3:32 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-167785","author":"thomas","post":"Q. How do you explain the all over flagellation marks on the Shroud when we know that they first appear in medieval iconography of other paintings only in 1300? A. If the Shroud was authentic – an option you seem to rule out – then that would explain the flagellation marks. An alternative options is the image was created by bas relief and the marks were stamped on. This would be consistent with a 14th century iconography. Q. How do you explain the fact that the ‘bloodstains’ on the Shroud have an almost identical pattern to the Holkham Bible of 1330. A. Really? They are generically similar but this means very little. Q. An artist was copying them from similar works of art of his time. You also need to look at the examples of t He faded cloths that I provided in my article to show that painted linens can fade as the Shroud has. Provide an alternative explanation of how a fourteenth century iconography was created by a first century body. A. That the Shroud is actually Christ’s authentic burial cloth! Or the Shroud was created in the 14th century via bas relief etc. Although I believe in authenticity I am not so close minded as to acknowledge a possible 14th century origin via some form of bas relief approach. But the painting hypothesis is fatally flawed for several reasons..","date":"2014-11-01","mins":"9:31 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-167829","author":"thomas","post":"Mike M you can be assured that Freeman won’t do the necessary reading and research, he has proven time and time again that he consistently ignores other valid and often stronger viewpoints. Time will tell whether we hear from his expert mates. They better do their homework, or their positions will be torn apart, as many of his have legitimately been here..","date":"2014-11-02","mins":"2:08 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-167778","author":"thomas","post":"Thank you Colin. It’s good to have a “Non authenticist” put to bed Freeman’s silly ideas. The man, in all his arrogance, is unlikely to listen, though..","date":"2014-11-01","mins":"9:14 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-167828","author":"thomas","post":"Mike M – The problem is Freeman is putting forward himself almost as a Shroud authority when many on this website know all these things, having read widely and deeply on the topic for several years..","date":"2014-11-02","mins":"2:04 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168157","author":"thomas","post":"Something useful from a skeptic! Please advise of the ‘contemporary testimonies’.","date":"2014-11-03","mins":"5:41 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-169168","author":"thomas","post":"That was just what I was going to say ok. Yet another pathetic skeptic attempt.","date":"2014-11-06","mins":"5:11 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-169174","author":"thomas","post":"Tut tut. Being a direct person I for one won t hold back on telling it like it is.","date":"2014-11-06","mins":"5:35 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-114902","author":"thomas","post":"Fascinating. Before I read any of the dialogue associated with this (by Dan or readers) I have formed the following views: – The “x’s” are highly suggestive of depicting a weaved cloth – The cloth seems to extend well up beyond Christ’s head, but does not “end” anywhere: this is suggestive of a long shroud which would have covered Christ’s front and back None of this implies, however, that this piece of art was based on the Shroud. The similarities noted above are consistent with the biblical tradition. The crossed hands? Maybe a Shroud influence, maybe not. Having said that, the hidden thumbs are quite suggestive of a Shroud influence. I’ll now read the comments and see how they reconcile with my view..","date":"2014-05-08","mins":"6:25 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-114932","author":"thomas","post":"Further thought. The extension of the length of the shroud up above Christ’s head is interesting. It certainly implies that the shroud then came down and covered Christ’s front, like “The Shroud” In this respect this piece is more “Shroud like” than the Pray Manuscript which suggests more width than length. The loin cloth is there. Unlike the Pray Manuscript which was presumably something for private “monk’s use” the ivory work would have been on public display, hence modesty protection..","date":"2014-05-08","mins":"7:09 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-114939","author":"thomas","post":"Note the feature under Christ’s upper calf…curious. Might this be meant to represent the blood flow across the small of the back and to the sides? But represented a bit low by the artist? Or the poker holes? Or….quite possibly, just a decorative motif (however seems rather superfluous as a decorative motif).","date":"2014-05-08","mins":"7:21 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-114926","author":"thomas","post":"The crosses could both depict weave and / or be used to more clearly texturally distinguish the shroud from the base beneath it..","date":"2014-05-08","mins":"7:00 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-118181","author":"thomas","post":"Definitely a red herring in my view..","date":"2014-05-12","mins":"8:33 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-201046","author":"thomas","post":"Great photo. And demonstrates well the true faintness of the image (we get so used to the enhanced images!).","date":"2015-06-04","mins":"3:58 am","url":"https://shroudstory.com/2015/06/04/picture-for-today-shroud-on-the-steps-of-the-cathedral-by-enrie-1931/","cat":"history","title":"Picture for Today:  Shroud on the Steps of the Cathedral by Enrie, 1931"},{"id":"comment-201048","author":"thomas","post":"Perhaps that is how the Shtoud was raised up every Friday in the early 1200s in Constantinople (de Clari).","date":"2015-06-04","mins":"4:20 am","url":"https://shroudstory.com/2015/06/04/picture-for-today-shroud-on-the-steps-of-the-cathedral-by-enrie-1931/","cat":"history","title":"Picture for Today:  Shroud on the Steps of the Cathedral by Enrie, 1931"},{"id":"comment-201055","author":"thomas","post":"John how do you know it wasn’t raised up this way? If it was raised vertically, how? And what evidence do you have?.","date":"2015-06-04","mins":"5:25 am","url":"https://shroudstory.com/2015/06/04/picture-for-today-shroud-on-the-steps-of-the-cathedral-by-enrie-1931/","cat":"history","title":"Picture for Today:  Shroud on the Steps of the Cathedral by Enrie, 1931"},{"id":"comment-143346","author":"thomas","post":"But then thats an awful lot of stamping! Why go that far?.","date":"2014-08-11","mins":"3:41 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143263","author":"thomas","post":"Well Colin I don’t necessarily think that text should be read literally..","date":"2014-08-10","mins":"4:24 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143345","author":"thomas","post":"Nice points Colin. The number of wounds does seem problematic. So are you thinking something along the lines of a medieval person apply the markings vua a bloodied stamp?.","date":"2014-08-11","mins":"3:27 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143357","author":"thomas","post":"Colin I didn’t know there were scourge marks visible on the Lier depiction. I will have a look..","date":"2014-08-11","mins":"4:08 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143348","author":"thomas","post":"We have no pictorial record that I can think of that depicts the scourge wounds of the shroud. That could imply: 1. The scourge marks were a very late addition, maybe post 1700s, to try and dupe an increasingly skeptical post enlightenment world. 2. The scourge marks were viewed as secondary or inconsequential. This seems hard to support given their prominence..","date":"2014-08-11","mins":"3:48 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-142355","author":"thomas","post":"Remember guys, love is the heart of Christian faith Chill out and accept the differences of opinion.","date":"2014-08-05","mins":"2:31 am","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"id":"comment-112570","author":"thomas","post":"Fascinating. I had never read of the Man of Sorrows parallels. Just on the Pray Manuscript. I find it interesting that Jesus is portrayed with only minimal facial hair. Contrast with the heavily bearded male figures anointing him. Indeed historically Jesus has been quite lightly bearded in art. Often heavy beards in art denoted wisdom. Logically it would follow that Jesus should be depicted heavily bearded. He often isn’t. Perhaps this is the influence of the relatively lightly bearded face on the Shroud?.","date":"2014-05-06","mins":"4:35 am","url":"https://shroudstory.com/2014/05/06/ten-reasons-to-believe/","cat":"history","title":"Ten Reasons to Believe"},{"id":"comment-174579","author":"thomas","post":"Seeing this reminded me of the abrasion we see on Christ’s right cheek on the shroud. What chance of this on a bas relief? It’s a level of detail one would really not expect to see in a 14th century “fake”.","date":"2014-12-04","mins":"3:12 am","url":"https://shroudstory.com/2014/12/03/the-shroud-of-turin-is-not-the-image-of-edessa/","cat":"history","title":"The Shroud of Turin is not the Image of Edessa?"},{"id":"comment-181970","author":"thomas","post":"“Citing the late first century dates of NT composition is a weak argument against their authenticity, and under rates the value and strength of oral tradition in pre literate societies.” Well put. Gospel of Mark likely dates from circa 70 AD and less than 40 years from Jesus’s death is nothing in that context (ie. People who would have been circa 15 – 20 years old when Jesus died would have been circa 55 60 years old in 70 AD) Earliest letters from Paul date from the 50s and their content reiterate already well established knowledge and traditions around Jesus. Ex biblical writings provide clear evidence of active Christian communities in the 50s – 60s AD. From what I can tell, the view that Jesus never existed is a very marginal viewpoint. These writings come from a period very close to Jesus’s lifetime..","date":"2015-01-07","mins":"11:17 pm","url":"https://shroudstory.com/2015/01/07/we-also-have-the-shroud-of-turin/","cat":"history","title":"We also have the Shroud of Turin"},{"id":"comment-171164","author":"thomas","post":"Well he’s at one end of the fundamentalist spectrum and Chuck is at the other.","date":"2014-11-14","mins":"2:53 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-171160","author":"thomas","post":"I don’t think it’s Colin but I wonder who? Regardless it’s a petty little affair.","date":"2014-11-14","mins":"2:26 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-207538","author":"thomas","post":"I agree Colin that the Shroud was a temporary tool, to transport and then keep the body till the proper burial occurred. That’s consistent with the gospels.","date":"2015-08-06","mins":"2:30 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"}]
