[{"id":"comment-178372","author":"thomas","post":"There’s a good piece in there too on the liberal groupthink bias in academia. Some may recall a rant of mine on this a few weeks ago..","date":"2014-12-22","mins":"5:50 am","url":"https://shroudstory.com/2014/12/22/a-miracle-debate/","cat":"news_&_views","title":"A Miracle Debate"},{"id":"comment-214802","author":"thomas","post":"Daveb A reasonable argument can be mounted that, generally speaking, the descriptions of Christ’s resurrected body became more corporeal over time. So in Paul’s letters, our earliest sources, there is much more of a spiritual emphasis. I think with any interpretation there is a strong element of speculation. My own view is that Christ’s resurrected body was apparition like, but somehow more ‘formed’ than that. I consider that the oral and written tradition evolved into a more corporeal tradition. But my own belief is that the resurrected body was not, in fact, corporeal. But that’s only my view and I think people can validly argue the other way..","date":"2015-11-19","mins":"3:21 am","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"id":"comment-207324","author":"thomas","post":"Thank you Colin, good points – so I can accept Lirey wasn’t such a backwater, based on that. Still, requires a compelling explanation as to how the image might have been created… And of course, the influence of those people may not explain an ingenious invention, but rather a means of obtaining a highly sort after holy relic! The argument could be run both ways..","date":"2015-08-03","mins":"5:11 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","title":"Cherry Jam, the Metaphor"},{"id":"comment-195456","author":"thomas","post":"Don’t you just love the subtle flick of linen protecting His modesty..","date":"2015-04-05","mins":"9:16 pm","url":"https://shroudstory.com/2015/04/05/easter-2015/","cat":"2015","title":"Easter 2015"},{"id":"comment-111082","author":"thomas","post":"Hell is distance from God, heaven is closeness. The punishment will be ‘the joy that is missed’, rather than pain and torment. In my opinion no loving God would inflict eternal suffering on even grave sinners. It is dangerous to read the Bible too literally..","date":"2014-05-04","mins":"6:05 pm","url":"https://shroudstory.com/2014/05/04/everyone-goes-to-heaven/","cat":"news_&_views","title":"Everyone Goes to Heaven?"},{"id":"comment-111184","author":"thomas","post":"Hmmm, to what extent was that the licence of the gospel writers? I have no doubt that Jesus preached on this, but hell as a place of pain and torture does not square with his principal teachings of love and of foregiveness. I read the “hell as torture ” concept more as metaphor / hyperbole, but still points to a truth that ‘hell’ is a place not close to God – that might even be an ‘eternal extinction of the soul’.","date":"2014-05-04","mins":"8:12 pm","url":"https://shroudstory.com/2014/05/04/everyone-goes-to-heaven/","cat":"news_&_views","title":"Everyone Goes to Heaven?"},{"id":"comment-195233","author":"thomas","post":"Aren’t those red legs curious!!!!!.","date":"2015-04-03","mins":"2:35 am","url":"https://shroudstory.com/2015/04/02/good-friday-2015/","cat":"uncategorized","title":"Good Friday 2015"},{"id":"comment-172846","author":"thomas","post":"I repeat we really need to see the Venice example. How? I’ve contacted the museum San Marco and they can’t provide any decent sized reproductions. I might just have to visit Venice and see it for myself.","date":"2014-11-24","mins":"4:27 pm","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","title":"How to Become Famous"},{"id":"comment-172882","author":"thomas","post":"Thanks. Would be interesting to know how / when it arrived in Venice. Following the sacking of Constantinople, maybe..","date":"2014-11-25","mins":"12:37 am","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","title":"How to Become Famous"},{"id":"comment-173041","author":"thomas","post":"If the Venice epitaphios – dated by Schiller as circa 1200 – was from the sacking of Constantinople, then that points to a tradition of depicting the dead, bloodied and scourged Christ at least 100 years earlier than Charles’s 1300 AD claim of the beginning of that artistic tradition. The epitaphios tradition is very suggestive of a Shroud influence. I wonder if the epitaphios tradition is derived from two great relics in Constantinople – the stone of unction, and a / the shroud..","date":"2014-11-26","mins":"3:09 am","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","title":"How to Become Famous"},{"id":"comment-172756","author":"thomas","post":"Would love to see the earliest extant example of the epitaphios which dates to circa 1200. It’s in a museum in Venice. There is a very small image of it on the museum’s website but nowhere near big enough to see in detail. I am not aware of any decent online images of it. I wonder if any of our Italian friends could help?.","date":"2014-11-24","mins":"12:21 am","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","title":"How to Become Famous"},{"id":"comment-173042","author":"thomas","post":"“In 1169/70, Byzantine Emperor Manuel I Komnenos brought the Unction Stone to Constantinople. In 1180 he was buried with the relic, and an inscription on his tomb described Manuel as the new Joseph of Arimethea, because like Joseph he “bare[d] on his shoulders that stone upon which Christ’s body was placed.” In the centuries following the translation of the relic to the imperial capital, imagery featuring the Unction Stone proliferated. Entombments and lamentations were pictured in both wall painting and in other media, most commonly on the embroidered epitaphios, a textile used during the Divine Liturgy. This paper explores the ways the relic, as both literally possessed by the emperor and as pictured in hundreds of images throughout the Byzantine and post Byzantine worlds, prompted worshipers to reenact the roles of the biblical mourners, and thereby insert themselves more fully into the ritual remembrance of Christ’s Crucifixion and Resurrection.” Hedrick, Tera. “Mourning Reenacted: The Stone of Unction and Late Byzantine Liturgy”.","date":"2014-11-26","mins":"3:12 am","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","title":"How to Become Famous"},{"id":"comment-204096","author":"thomas","post":"I thought Hawkins was an atheist, not agnostic.","date":"2015-06-30","mins":"12:44 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"id":"comment-214654","author":"thomas","post":"Interesting thoughts Daveb. This got me thinking about homeopathy…skeptics call it pseudoscience. It doesn’t seem to have any scientific basis. But it also works for many people. It really helped my stomach problems. Placebo? Or something working at a level that science can’t explain?I felt it worked for me at some deeper level, but that might just all be mental. The Shroud….","date":"2015-11-16","mins":"5:37 am","url":"https://shroudstory.com/2015/11/14/joel-bernstein-on-good-science-bad-science-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Joel Bernstein on Good Science, Bad Science, and the Shroud of Turin"},{"id":"comment-93620","author":"thomas","post":"Colin, I personally keep an open mind in terms of your scorch theory, and look forward to hearing your progress. However I must say I find the “Templar Totem” fanciful, although certainly imaginative! In my view, if the image was a scorch then it was done to portray Christ. I do have several problems with the artistic creation theory. I articulated one a day or two ago. Another major problem in my view is the display of buttocks. That’s a huge departure from the historical depiction of Christ with a loin cloth, and its difficult to comprehend why an artist intent on fooling the gullible masses would show buttocks which would not only be a major departure from artistic norms but would probably also be considered highly offensive (potentially punishable?).","date":"2014-03-26","mins":"6:49 pm","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”"},{"id":"comment-184799","author":"thomas","post":"Wonderful. Look at the sense of anticipation..","date":"2015-01-20","mins":"4:08 am","url":"https://shroudstory.com/2015/01/20/picture-tweet-of-the-day/","cat":"news_&_views","title":"Picture Tweet of the Day"},{"id":"comment-166447","author":"thomas","post":"Well, Charles, it will be interesting to see their responses. However, the responses are only as meaningful as the brief, and if the brief is as one sided as I expect from you, then we can expect the responses to be of limited value..","date":"2014-10-29","mins":"2:13 am","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","title":"Posting Correction"},{"id":"comment-173252","author":"thomas","post":"Been doing some research on pieta…an artistic form from the 1300s onwards that showed an intensely tortured Christ. Interesting to see the quite crude examples in the 1300s, wasn’t really till the 1400s or later that sculptors were able to achieve reasonably realistic body forms: https://sosreb.wordpress.com/2014/04/23/pieta/.","date":"2014-11-27","mins":"3:46 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-200116","author":"thomas","post":"Bless you Sampath. Put your misgivings aside. You will find love and foregiveness in the Bible. Very sadly, many Christians fall well short of the behaviour Christ demands of us. I’ve seen plenty of shocking behavior from Church congregants. Often worse than non Believers. It does make you wonder what Bible some of these people are reading..","date":"2015-05-24","mins":"10:20 pm","url":"https://shroudstory.com/2015/05/24/rejecting-authenticity-out-of-hand/","cat":"news_&_views","title":"Rejecting Authenticity Out of Hand"},{"id":"comment-216933","author":"thomas","post":"One of the things I have been mulling over the last few days is this…. Why would a medieval artist do a back and front portrayal of Jesus’s burial sheet? We know there were traditions of an imaged face cloth, and even a sheet with a body image. But it’s not as if there was a tradition – that we know of at least – of a front and back image of a tortured and naked Christ. Pretty hard to contemplate what blokes in the 14th century may have been thinking, but for what it is worth wouldn’t there be other more obvious fake relics eg. Maybe a bloodied and partially imaged (just head?) linen. Just a thought. You see I do my best to think of possible non authentic scenarios but I generally struggle….","date":"2015-12-21","mins":"5:14 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216617","author":"thomas","post":"Sad! Although I tend to think recent discussions have kind of reached a stalemate position. Thanks so much for your efforts Dan. I’ll miss it. God Bless and Merry Christmas, from Down Under..","date":"2015-12-15","mins":"6:22 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217041","author":"thomas","post":"Charles I have to say you have a quite nice theory but I am afraid to say it falls down on many counts, in my opinion. So where do I start? ‘The Quem Queritis ceremony…required a burial cloth to be held up to show Christ had risen’ Problems: – the Shroud image is not one of a glorified risen Christ – people such as yourself argue that the silence of history in describing an imaged shroud is a problem for the authenticist’s case. But then you argue for an imaged (front and back for good measure) shroud to be held up in a ceremony as opposed to say a non imaged but bloodied shroud. I think this is logically inconsistent. Why show an imaged burial shroud ‘to show Christ had risen’ if there was no tradition of a full body imaged shroud? – the Shroud itself is of such length as to be quite a nuisance to ‘hold up’ – why ‘manufacture’ a front and back image? A frontal image would have been enough and a lot easier to manage. Your theory suggests a purely ceremonial origin for the shroud but the ultra realistic front and back image flies in the face of this. – the nude image goes against the art history grain….yes yes there were one or two rare exceptions but they were discrete images not things for widespread public display. And sorry I don’t buy your argument at all that there was originally a loin cloth on the image that wore off. – I just don’t buy your argument that the image is the product of a faded painted image. For many reasons. A painted shroud makes sense for an Quem Queritis object, a novel and as of yet inadequately explained image does not (when a painted image would be all that was required for an abstract and symbolic ceremonial use).","date":"2015-12-22","mins":"4:18 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-203325","author":"thomas","post":"John, according to the Wikipedia entry on Charles he is not an “art historian”. He is a “historian”. I would think there is a significant difference. Thomas de Wesselow is a highly credentialed art historian. John, you are a lawyer. I presume in a court the art historian would hold greater expert authority than a historian in terms of the art historical aspects of the Shroud?.","date":"2015-06-23","mins":"4:26 am","url":"https://shroudstory.com/2015/06/22/the-day-was-not-about-the-shroud/","cat":"2015","title":"The Day Was Not About the Shroud"},{"id":"comment-174802","author":"thomas","post":"Yes I struggle to see any similarity whatsoever. Non event and unworthy of any time or effort to discuss. Move along please.","date":"2014-12-05","mins":"7:38 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-175325","author":"thomas","post":"I understand Daveb’s frustrations. There are few on this site who seem willing to move whatsoever in their entrenched positions despite strong arguments that challenge positions. I think in any debate one wishes to see some flexibility, movement and evolution. If none occurs then there seems little point in dialogue. Some will say they haven’t shifted in their views because they have not been convinced. I think many times that has not been due to a weakness in an argument but rather the obstinance of certain.personalities..","date":"2014-12-09","mins":"4:05 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173342","author":"thomas","post":"I’ve ALWAYS thought of the Shroud in this way. On the third day, the intention was to execute Jesus’s burial in accordance with proper rites. The shroud was a temporary “tool” to transport and then temporarily enshroud Him..","date":"2014-11-27","mins":"3:17 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-202547","author":"thomas","post":"So if you do’t believe in dematerializing bodies how do you explain the resurrection, empty tomb etc. Presumably, that Christ’s body was ‘transformed’ rather than dematerialized. I’m sure that is the conventional way of thinking of the resurrection. Of course the transformation of the body could quite conceivably have exerted an image making effect. I still personally see the resurrection in terms of a dematerialization of the physical body and simultaneous creation into a spiritual body – like a ghost but not like a ghost (more 3d or realistic if you like) I believe in the resurrection so I think that it a very real possibility.that it was behind the image. But I can’t prove it and acknowledge there could still be a naturalistic explanation..","date":"2015-06-17","mins":"4:40 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","title":"The Masters of Comedy in Piedmont"},{"id":"comment-95767","author":"thomas","post":"Great idea Yannick could it be organised?.","date":"2014-04-02","mins":"4:04 am","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","title":"The Shroud that Defies Scientific Explanation (Part 2)"},{"id":"comment-95766","author":"thomas","post":"If carbon dating showed it to be 2000 years old this would not be categorical proof however it would be highly suggestive of authenticity.","date":"2014-04-02","mins":"3:58 am","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","title":"The Shroud that Defies Scientific Explanation (Part 2)"},{"id":"comment-95772","author":"thomas","post":"De wesselow in his excellent book drew some neat parallels between the mystery of the shroud and the mystery of the resurrection.","date":"2014-04-02","mins":"4:10 am","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","title":"The Shroud that Defies Scientific Explanation (Part 2)"},{"id":"comment-95765","author":"thomas","post":"An explanation has not yet been reached – this does not mean one will not be!.","date":"2014-04-02","mins":"3:56 am","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","title":"The Shroud that Defies Scientific Explanation (Part 2)"},{"id":"comment-203563","author":"thomas","post":"A thought….the shroud is a metaphor….for the mystery of God….the mystery of life and the universe… the Shroud exists but cannot be explained…we try to fathom it but we can’t.","date":"2015-06-25","mins":"5:44 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-205074","author":"thomas","post":"Sorry, off topic but… I’ve been re reading ‘The Sign’, and de Wesselow mentions 2 3 historic references with regard to the Mandylion as a ‘himation’ or ‘mantle’. Clearly references that imply something much bigger than a small cloth. Does anyone have any independent thoughts on this? Also, every time I read his analysis of the de Clari and Mesarites descriptions of a shroud in Constantinople around 1200 I always come away thinking there is a very compelling case that this object in Constantinople was the shroud! Skeptical views very welcome.","date":"2015-07-10","mins":"2:33 am","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","title":"Who Proposed Ultraviolet?"},{"id":"comment-205084","author":"thomas","post":"Thank you Dave. What are the primary concerns with the mandylion theory? In my opinon de wesselow presents quite a compelling case for mandylion and shroud being one and the same..","date":"2015-07-10","mins":"3:15 am","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","title":"Who Proposed Ultraviolet?"},{"id":"comment-215769","author":"thomas","post":"I don’t buy the argument that because there is no extant description of a “full length double image” that the Shroud couldn’t have existed through all those years. I agree with Mario. There may have been descriptions once which have simply not survived that very long passage of time..","date":"2015-12-07","mins":"2:35 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-141591","author":"thomas","post":"Here here. You do a great job Dan.","date":"2014-08-01","mins":"5:14 am","url":"https://shroudstory.com/2014/07/31/your-comments-count-intellectual-clarity-and-open-discussions/","cat":"news_&_views","title":"Your Comments Count: Intellectual Clarity and Open Discussions"},{"id":"comment-215755","author":"thomas","post":"However, there are historic references, or at least historic allusions, to the Mandylion being a large cloth and/or comprising a fully body figure..","date":"2015-12-06","mins":"10:30 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"}]
