[{"id":"comment-176079","author":"stan_walker_md","post":"Colin, Thanks for pointing this out. The painting is a facsimile of the shroud. Of course it will have some 3 D qualities. You are inadvertently supporting the authenticity argument..","date":"2014-12-13","mins":"8:39 am","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-175353","author":"stan_walker_md","post":"Let’s see Colin replicate another shroud with all of the forensic and anatomic details – including those not recognizable by the human eye..","date":"2014-12-09","mins":"6:46 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175389","author":"stan_walker_md","post":"Mario, TS may not be a true photographic negative but it sure looks line one. I also agree that the the 3 D information in the image is one good reason to believe that the 1988 Carbon Dating is incorrect – but it is not sufficient. There are better reasons why the CD is incorrect. Getting back to CB’s scorch theory – it would be better to use a term better than scorch. Scorch is too vague. Not specific. Not scientific. Any transfer of energy to linen could be considered a scorch. The notion of a heated cruficix with linen overlayed – giving this image – seems so crude. Max P.H. Rightly observed the CB would have needed to have “pressed” the linen against the heated crucifix. Many of us probably remember helping our mothers do the ironing when we were younger. That hot iron – and the scorch – on dad’s shirt or on the pillow case – varied dramatically not only with the heat and time of exposure but also to the pressure applied. I applaud CB’s theories but wish he would considere more scientific – and more elaborate causes of scorches. Daily, I work with lasers – femto, argon, yag, excimer, etc. As a physician and an opthalmolgist I have always been intrigued by the shroud image and have wondered if it was created by an intense burst of light energy. We know to create an image on the outermost fibrils of the linen – a very sophisticated transfer of energy is necessary. Heat – in the thermal range – as an exlpanation of the scorch is ridiculous. There is indeed – 3 D information on the shroud – simply because we can perceive a 3 D image. The distance of the shroud from the linen – adds an interesting theory as to the embedding of the 3 D information – but understanding how the image – and discoloration – of the outer fibrils – was established seems to take primacy. The monochromatic nature of image and its superficiality points us in a different direction from a thermal scorch or some chemical reaction. As Goethe’s last words were, “More light!”..","date":"2014-12-09","mins":"12:50 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175397","author":"stan_walker_md","post":"Colin, you are still not taking a scientific approach..","date":"2014-12-09","mins":"1:39 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175401","author":"stan_walker_md","post":"Colin, Ph D – I am glad to hear you say you are not able to take a scientific approach with the information and tools that you have. Using language like “medieval hoaxers who produced the shroud” as you have done – is insinuating that the rest of us are chumps for believing the hoaxers. No? Your contributions – which I must say – prima facie – are worthy of further investigation. It perplexes some of us that you take a blind eye to details. Such as the superficiality of the image – that it is simply inconceivable that anyone – then or now – can or could reproduce it. Or, details on the anatomy such as the shape of the metal dumbbells from the flagrum – and its pathognomonic lesions. Try reproducing that with your hot crucifix…..too hot to handle methinks. Yes, it is a detective story and there are many scraps of evidence. But we cannot pick and choose the evidence we want and ignore the rest..","date":"2014-12-09","mins":"2:41 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-208336","author":"stan_walker_md","post":"Why dwell on the eyes? Even the blood stains on the forehead show elevation. This 3 D scan is crude and serviceable for generalities only. As for the eyes, the right eye in this image protrudes. This would be consistent with an orbital hemorrhage and proptosis and consistent with the the trauma incurred to this side of the face. This, I am an expert on..","date":"2015-08-15","mins":"8:04 pm","url":"https://shroudstory.com/2015/08/15/3d-of-the-day-imprinted-in-a-contact-only-mechanism/","cat":"image_theory","title":"3D of the Day:  Imprinted in a Contact-Only Mechanism?"},{"id":"comment-205980","author":"stan_walker_md","post":"All speculation. While we are at it let’s consider the possibility of other sub atomic particles interacting with the Shroud. Why not? Perhaps the Higgs boson? Is it not possible the elements in the Shroud are still entangled with the Christ?.","date":"2015-07-16","mins":"6:42 pm","url":"https://shroudstory.com/2015/07/16/a-reason-to-doubt-the-image-was-formed-by-radiation/","cat":"image_theory","title":"A Reason to Doubt the Image Was Formed By Radiation"},{"id":"comment-171560","author":"stan_walker_md","post":"I agree with Mr. Klotz. The theories by Freeman and Berry are amusing and compelling only if one turns a blind eye to all of the other facts. Foremost, is that no one on earth can duplicate the shroud. Everyone has their own reasons as to why they believe the shroud is authentic or not. As a physician, the elephants in the room are all of the forensic/pathological/anatomical findings on the shroud that are what we call in medicine “pathognomonic” for the shroud being authentic. For instance, do Berry and Freeman truly believe that some 14th century artist knew what a Roman flagrum looked like and was able to create identical scourge marks on the shroud. Or, does the fact that the blood stains have surrounding – invisible – serum plasma surrounding them – a separation of blood components that could have only occurred naturally – not speak to some natural or better yet – supernatural event?.","date":"2014-11-16","mins":"8:01 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-171046","author":"stan_walker_md","post":"The “sweat imprint” at first glance seems plausible to some. As a well trained physician it makes me take pause. The number of sweat glands and their density varies dramatically throughout the entire body. I would suggest the proponents of the sweat imprint theory do their due diligence before making these fantastic assertions. It reminds me of patients tellig the doctor that their body itches all over. To which the doctor would respond, “do your teeth itch?” Based on the appearance of the teeth on the shroud I would like to know whether or not Mr. Berry believes the teeth have sweat glands too..","date":"2014-11-13","mins":"10:01 am","url":"https://shroudstory.com/2014/11/13/a-sweat-imprint-that-is-a-negative-which-is-comparable-to-a-brass-rubbing/","cat":"image_theory","title":"A sweat imprint that is a negative which is comparable to a brass rubbing"},{"id":"comment-208725","author":"stan_walker_md","post":"[Redacted. Comment was in very poor taste and insulting.].","date":"2015-08-22","mins":"9:43 am","url":"https://shroudstory.com/2015/08/21/close-to-the-finishing-line-or-the-starting-line/","cat":"image_theory","title":"Close to the finishing line or the starting line?"},{"id":"comment-208733","author":"stan_walker_md","post":"Speaking of nonsense – this current hypothesis – is a classic enthymeme..","date":"2015-08-22","mins":"2:14 pm","url":"https://shroudstory.com/2015/08/21/close-to-the-finishing-line-or-the-starting-line/","cat":"image_theory","title":"Close to the finishing line or the starting line?"},{"id":"comment-200071","author":"stan_walker_md","post":"Colin, We study your theories and experiments with genuine interest. Why would you want to suppress any scientific analysis? Your efforts have only proved how the Shroud image was not formed. This I do appreciate. “By doubting we come to truth.” Cicero.","date":"2015-05-24","mins":"8:02 am","url":"https://shroudstory.com/2015/05/24/colin-berry-on-rogers-and-arnoldi-paper/","cat":"image_theory","title":"Colin Berry On Rogers and Arnoldi Paper"},{"id":"comment-207592","author":"stan_walker_md","post":"With every “scientific” experiment and every hypothesis Colin comes up with – the more I am convinced the Shroud is authentic. I hope he continues his research. Thomas Edison made 10,000 attempts before getting the light bulb rigtht. Colin may try 10,000 times but it seems we will still be in dark as to the true nature of the Shroud. Colin’s failures are enlightening. I do respect his efforts..","date":"2015-08-06","mins":"12:49 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-196575","author":"stan_walker_md","post":"Daveb and Sampath, I concur with your assessment. The mystery deepens. Let the Shroud speak. I would enjoy a discussion by this group on the nature and physics of the Transfiguration. My speculation is that whatever energy emanated then may have been similar at the resurrection. A different sub atomic particle being released? Neutrinos? A good read – The Physics of Christianity by Frank Tipler. Intriguing. The forensics still offer the greatest clues. I have yet to see ANY artistic rendition of a brutalized corpse with the details on the Shroud..","date":"2015-04-16","mins":"8:16 pm","url":"https://shroudstory.com/2015/04/16/rogers-impurity-layer-and-di-lazzaros-experiments/","cat":"image_theory","title":"Rogers’ Impurity Layer and Di Lazzaro’s Experiments"},{"id":"comment-209197","author":"stan_walker_md","post":"And Colin can insult Di Lazzaro ad nauseam? Some of us find Colin’s “theory du jour” bordering on entertaining to insulting. Come on Dan, Jesus coated with flour and half baked? Why not Jesus fricassee? Many of us are extremely well educated in the sciences and are not bamboozled by Colin’s liberal use of chemical terminology and his verbosity. I value Colin’s contributions because he is interesting. His concepts are a stretch scientifically and only if one ignores a plethora of all other scientific data on the shroud. And you ignore Colin’s insults to those – in the medical field – who identify forensic data on the shroud that defies explanation..","date":"2015-08-28","mins":"6:53 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","title":"You may reassure Mr. Berry"},{"id":"comment-209204","author":"stan_walker_md","post":"It is all too well understood David. In debate terminology this tactic is known as a riposte. The point inferred is Colin’s theory is half baked. The Bread has risen..","date":"2015-08-28","mins":"8:55 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","title":"You may reassure Mr. Berry"},{"id":"comment-209201","author":"stan_walker_md","post":"You hit the nail on the head Dcn Andy. Let’s see if Colin gets published in a peer reviewed scientific journal. Maybe he would rather be on a sensationalist TV program..","date":"2015-08-28","mins":"7:23 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","title":"You may reassure Mr. Berry"},{"id":"comment-209162","author":"stan_walker_md","post":"Come Holy Spirit. Fill the hearts of the faithful. Kindle them in the spirit of your love. Send forth your Spirit and they shall be created. And You shall renew the face of the earth. O, God, who by light of the Holy Spirit, did instruct the hearts of the faithful, grant that by the same Holy Spirit We may be truly wise and enjoy His consolations, Through Christ Our Lord, Amen. Colin, do you believe by the light of the Holy Spirit you are truly wise?.","date":"2015-08-27","mins":"5:29 pm","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","title":"You may reassure Mr. Berry"}]
