[{"id":"comment-208396","author":"stan_walker_md","post":"“All things excellelent are as diffificult as they are rare.” Spinoza Many scientists have attempted experiments to explain he shroud. None have come close to the excellence of the shroud nor have they diminished its rarity. So far, the shroud is the holy grail of historical enigmas. That which remains is the sublime, the mystery and transcendence..","date":"2015-08-16","mins":"9:09 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-200479","author":"stan_walker_md","post":"Has there ever been a case of any person surviving a crucifixion – documented or anecdotal? Of course not. So Jesus would have been the only one to do so? Pretty stupid line of reasoning..","date":"2015-05-28","mins":"8:12 pm","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"id":"comment-181684","author":"stan_walker_md","post":"I sense you are correct Louis..","date":"2015-01-06","mins":"6:25 pm","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","title":"News Story from Sindone.org"},{"id":"comment-207504","author":"stan_walker_md","post":"It’s funny that Colin believes the forgers – from medieval times – have still outsmarted him – conceptually and scientifically. They were pretty smart scientists those darn medieval forgerers..","date":"2015-08-05","mins":"4:26 pm","url":"https://shroudstory.com/2015/08/05/scientist-barrie-schwortz/","cat":"article","title":"Scientist Barrie Schwortz"},{"id":"comment-174960","author":"stan_walker_md","post":"Quite frankly, it is conceivable that he could have had Prinzmetal’s angina with myocardial infarction. Under such medical duress anything is possible. I often wonder if Christ died of a broken heart. We now know that a broken heart can in fact lead to heart damage and sudden death..","date":"2014-12-06","mins":"1:12 pm","url":"https://shroudstory.com/2014/12/05/new-paper-on-the-crucifixion-of-the-turin-shroud-man/","cat":"paper_chase","title":"New Paper on the crucifixion of the Turin Shroud man"},{"id":"comment-183258","author":"stan_walker_md","post":"Interesting points Louis. The complexities – of the image on the cloth – the science of it – as well as the complexities of the anatomy conveyed in the image – such as swelling – are far beyond explanation. In regards to C.G. Jung – I wonder if he was moved by the fact that the image on the Shroud – seems to be that of a living man – serene and at peace. I have been in on enough autopsies and cadavre disections – of the human face/head/body – to know that a dead person’s body appears sunken – skin and muscles sagging away from bone. One could argue this could be achieved in a sculpture used in the forgery of the shroud. Nonetheless, Jung apparently felt the image was speaking a truth to him. Or as philosopher Michael Polanyi would say, “We know more than we can tell.”.","date":"2015-01-14","mins":"1:06 pm","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","title":"Papers by the Skeptic of STURP"},{"id":"comment-182082","author":"stan_walker_md","post":"Personally, I like Colin Berry’s theory – the scorch theory – better. In this instance, Jesus is lying in the shroud thinking about how he just got crucificied by a bunch or knuckleheads from Rome and that Barabas rascal gets set free. Free! So He gets madder and madder – to the point where he is smokin hot. And poof! He scorches the shroud and gets resurrected. Don’t mess with Jesus..","date":"2015-01-08","mins":"4:35 pm","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"id":"comment-181376","author":"stan_walker_md","post":"Its Fantis!.","date":"2015-01-04","mins":"10:04 pm","url":"https://shroudstory.com/2015/01/03/television-an-italian-professor-believes-he-has-the-answer/","cat":"video","title":"Television:  An Italian Professor believes he has the answer."},{"id":"comment-195600","author":"stan_walker_md","post":"Good golly, Miss Mollie. Are you the devil with a blue dress on? I hope you can dance..","date":"2015-04-07","mins":"7:25 am","url":"https://shroudstory.com/2015/04/07/this-unbelievable-claim/","cat":"video","title":"This Unbelievable Claim"}]
