{"art":[{"author":"alicia","post":"Let me start off by saying my life up until 6 years ago was full of anger and hate towards anyone who wasnt my oldest daughter and for the most part self pitty. Until my youngest was born 9 years after my first.Even tho I prayed at night and i was close to God after finding him almost 6 years ago I never really said much about any of it to Gracie my youngest . One day she was around age 3 and as I tucked her in and picked up her bedroom she said Mom, god and Jesus are my best friends. I stopped looked up and said lol Huh? She said yeah they’re here! I said who is here? She said God and Jesus! I look around and with chills I said, God and Jesus are here now!?She shook her head yes so curious, I ask her What does Jesus look like (knowing she had never seen a pic that I can remember)I said “what does he look like? what color is his hair? and she said brown and went on to tell me about his eyes all the way down to his shoes she said he was wearing a green shirt and I think green shoes… So I said really curious, ” and God? She said he had white eyes and had on a white shirt ….. I sat down on her bed and brought up pictures from google and sure enough she pointed out Jesus and said one picture kinda looked like God….As days went by she continued to talk about God and Jesus and one night I was putting her to bed and she was talking about them I said well where do they live? She said, ” together!” I laughed and I said really she said yes they live together in heaven. My heart stopped and I just stood there I knew I had never talked about heaven because I wasn’t quite sure how with her being so young. I asked her, ” what is heaven like baby?” She said its so pretty there’s lots of trees and pretty colors its very pretty! She said it so excited and with a huge smile on her face like she could really see it. So I sat down and showed her pics of paintings and people’s ideas of heaven and came across a painting this same artist did of Jesus but only what she says heaven is. She says she seen heaven and painted it. The same little girl who painted Jesus. After seeing the painting and reading all about this I discovered my daughter who was at the time the same age as the two children some how said she seen and talked to God and Jesus. It strengthens my faith. She is 5 and a half now and she doesn’t seen them much anymore she says… Last time was in May getting ready to head home from our vacation as I’m loading the car she stands there beside me and we prayed before we left the hotel for a safe trip home. My daughter standing beside the car half hour layers says “Jesus and God are here mommy” we all just stopped and looked at one another. I said, ” they are here? Now?”She said, ” yes mom they’re right here”and put her hand out to show me where but I didn’t see anything none of us did. I said ” ok well that’s great” she replied, ” yeah, and they’re going to go with us.” My heart felt so warm tears filled my eyes and I said” ok god and Jesus hop in its kinda cramped but we can get you in. She laughed and ran and got in and said yeah come guys. Since then she said she hasn’t really seen them and when I ask why I think she said something like because they don’t want to scare me or im growing up and she said they are in heaven. Keep in mind my daughter even tho we love God and pray and give thanks we do not attend any church or practice a religion We just try to be good people, do right and give thanks. There’s no way she could make this up. I love my beautiful daughters and life we have all been giving. Thank you God and his beautiful children.","date":"October 7, 2013 at 8:17 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"alicia","post":"I apologize for all the typos I was pressed for time but wanted to share my story :) my life is so much brighter and peaceful with God and Jesus.","date":"October 7, 2013 at 8:28 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
