{"image":[{"author":"alonso","post":"The Shroud image is essentially a Print, everywhere the cloth contacts the Body (front, nose,  hair etc…).  There, the theoretical resolution is the fiber size itself (0,015 mm), increased by area liquid diffusion (small for flax- 2 or 3 fibers- would be much larger for cotton fibers). Between contacts (between skin and cloth) gazeous diffusion occurs (giving the specific tridimensional encoding). There, the resolution is a function of various parameters, the most important being chemicals (too complex to be explained here) and distance (between skin emitting vapors and cloth fibers). It varies from 1 mm to more than 1 cm, particularly when the cloth falls away from the Body.","date":"June 20, 2015 at 5:08 am","url":"https://shroudstory.com/2015/06/20/resolution-of-the-shroud-image/","cat":"image_theory","title":"Resolution  of the Shroud Image"},{"author":"alonso","post":"The reactants are Fluids (corporal ) and Solids (Shroud fibers). The scientific approach of their interactions is “Fluids mechanics in porous média”. This discipline must be completed by the classic “oxydo-reduction in organic chemistry”.Corporal fluids include liquids and vapors. Both are adsorbed on flax fibers surface. Liquids directly after contact (sweaty or bruising reliefs, watered clots, post-mortem flows, hairy spots). Vapors after some delays, depending on space, molecular weights, temperature decay, etc..).Solid surfaces, which adsorb emitted fluids, are essentially flax fibers whose properties are complex.Known laws of Physics can explain (and calculate) the observed features: 3D, low distortion for diffusional transferts….Known chemical reactions can explain the progressive development of latent images with time.The resulting image, very complex, exhibits a complex spatial resolution which starts from tiny clots smaller than a fiber diameter, threads clearly visible in Halta pictures, anatomical organs clearly identifiabe (like fingers, lips etc..).Paolo is right saying the “resolution” concept cannot be evaluated simply (we have to restrict it to a given purpose).","date":"June 21, 2015 at 1:05 pm","url":"https://shroudstory.com/2015/06/20/resolution-of-the-shroud-image/","cat":"image_theory","title":"Resolution  of the Shroud Image"}]}
