{"art":[{"author":"amy","post":"I just bought a copy of the book because I have a 3 year old son who has been saying some scary things and I’m looking for some explanations, I hope. My son was born 1 month early and was born with a diaphragmatic hernia. He had a hole in his diaphragm and had organs in his chest and not much of a left lung. They did not know this before he was born for some reason because they almost always catch before the baby is born. After he was born we were told only 50% of these babies live and if he made it through the next so many hours it increased his chances of survival. Well we made it to 3 days later and he had surgery to repair it, which again they didn’t know if he would survive and we went hour by hour again. My son is 3 years old now and has talked about things that he shouldn’t know about in our family. One day he told me my uncle was on the play phone to talk to me and called my uncle by name.This uncle died 5 years ago and my son is only 3, it brought me to tears because right then and there I realized how close we actually came to losing my son. My son had another surgery around 18 months because his muscle didn’t grow over the opening. He is 3 now and has always been very verbal for his age. The thing that scares me the most is, he talks about people in our house that he can see. I don’t know what to do about this. I am hoping to somehow get in touch with Colton’s father also. My son is a very special 3 year old that is wise beyond his years and I am anxious to see what he grows up to be because he truly touches people that meet him. He is very strong willed too, had he not, he probably wouldn’t be with us today. Please pray for his body to stay strong as he does have a small left long, chances of this recurring, and his chest caves in pretty bad which makes his heart close to his chest wall and will need more surgery some day. His left kidney is also up too high on the left side, but they are leaving it there. The Children’s Hospital in Peoria, IL is amazing, but God is awesome! We had people praying for him all over the U.S. God Bless You and others who have had similar experiences. I also have a brother that was in a coma for 3 days about 5 years ago and he sure has stories like this also, very amazing.","date":"November 30, 2011 at 2:30 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
