{"history":[{"author":"antonio_lombatti","post":"Do you really think that reading news on my website and reporting them to you as if Di Lazzaro has ever read once in his life HA to be a honest action? It’s a matter of deontology. That’s all.","date":"January 1, 2014 at 12:27 pm","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","title":"Paper Chase:  Z Twist Again"},{"author":"antonio_lombatti","post":"The day after I’ve published a link to the HA paper, Di Lazzaro spots this article. What a coincidence! A miracle, I’d say. Di Lazzaro would rather quote his REAL source, since his IP is recorded in my website stats. By the way: the linen is from the late Ottoman period. But I fear he didn’t understand what it meant.","date":"January 1, 2014 at 10:47 am","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","title":"Paper Chase:  Z Twist Again"}],"researchers":[{"author":"antonio_lombatti","post":"Domenico, I have written that the relic was gained by Geoffrey for taking part to that crusade. It was given to him in France by those who organized the mission to Smyrna-Holy Sepulchre. I don’t think, therefore, that the Memorandum loses value: it’s one the few surviving documents of the period. But there’s also Marguerite who wrote that the relic was conquered by his grandfather.","date":"June 12, 2012 at 8:58 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"antonio_lombatti","post":"Dan, can you name a historical article on the Turin Shroud published in the last 10 years on a peer-reviewed journal? (apart from Andrea Nicolotti’s paper on Barbara Frale’s conjectures). As for Ivory Towers, I’m happy to have joined you and other Christians who believe in people rising from the dead, men parting seas, gods fighting sea monsters, and fairy tales like those.","date":"June 12, 2012 at 6:04 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"antonio_lombatti","post":"Sorry, Max, I have no answers to your questions. My study focuses on the 1345-1346 crusade and how Geoffrey got involved in it, since it wasn’t clear if he took part or not to it. I don’t know who made the Shroud and where.","date":"June 12, 2012 at 9:39 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"antonio_lombatti","post":"As I have written above, I believe the relic was given to him for taking part to the crusade by the French organizers of the expedition. I have found some documents that confirm that GdC was given landed estates and other properties by Humbert de Viennois.","date":"June 12, 2012 at 9:49 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"antonio_lombatti","post":"All historians have theories. Don’t trust those who tell you “it went like this”. My hypothesis is supported by sources and a careful reconstruction of the events; it has been evaluated by other scholars for over a year. In case you were wondering, I didn’t find the written confession of the forger. But who knows, maybe next time I go to the Paris National Archives…","date":"June 12, 2012 at 10:08 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"antonio_lombatti","post":"Last but not least: where did you get this quotation? You should have said that I was replying to a journalist who couldn’t see the proof of my theory. Therefore, I suggested her to read my article.","date":"June 12, 2012 at 6:28 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"antonio_lombatti","post":"Marguerite is not a direct source, her words were reported. Moreover, I don’t think there is a contradiction with being given a relic for having participated to a crusade and a niece (probably) saying “my grandfather conquered it”.","date":"June 12, 2012 at 10:15 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"antonio_lombatti","post":"Gabriel, please be so kind to tell us know your name, surname and teaching credentials. We aren’t downloading software illegally here, so you mustn’t be afraid of telling us who you are. Now, can you tell me where Shroud historians have published their articles? As for Studi Medievali, there’s no need to defend all the university professors who are in the editorial board or the peer-reviewers. But, in order to make you happier, I’d like to let you know that the same version of my paper has been accepted in the Journal of Biblical Literature.","date":"June 12, 2012 at 6:45 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"}]}
