{"dating":[{"author":"ayaz_ayaz","post":"Respectable Author,If you study the history carefully, You will find that the Body of the Holy Jesus Christ was rubbed with an ointment, after it was removed from the cross. The formulation of this ointment is also mentioned in some literature. This was made from some herbs. After application of this ointment, the body was wrapped in the cloth,(shroud of Turin). The body heat was enough to evaporate some valatile components of the ointment, these vapors got deposited on the fibres of the cloth and generated a negative image.This is a simple test that the same ointment be produced and applied to a human body. The body be wrapped in a similar cloth and kept wrapped for about three days. The cloth is to be aged under duplicate conditions and later examined for any negative image is produced or not.I strongly beleive that c-14 test were carried correctly, the problem lies in the method of sampling. The samples should have been taken from different parts of the shroud.Ayaz.","date":"January 2, 2010 at 1:35 am","url":"https://shroudstory.com/2008/09/21/the-big-carbon-dated-mistake-shroud-of-turin-and-the-scientific-quest-for-god/","cat":"carbon_14_dating","title":"The Big Carbon Dated Mistake: Shroud of Turin and the Scientific Quest for God"},{"author":"ayaz_ayaz","post":"Hello Readers,The Carbon Dating Test is very sensitive to impurities in the specimen. All the specimens were taken from one spot of the shroud. So the results should have been within experimental error. The specimens should have been taken from near the burnt part of Shroud and from the area which was never repaired. These samples will certianly give totally different results.God is so forgiving.Ayaz.","date":"January 2, 2010 at 12:59 am","url":"https://shroudstory.com/2009/10/20/richard-dawkins-on-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Richard Dawkins on the Shroud of Turin"}],"misc":[{"author":"ayaz_ayaz","post":"Hello Maria da Gloria,I am very much pleased to hear about the Exhibition 2010 of Shroud of Turin. I am of the opinion that this is the genuine cloth in which Holy Jesus Was wrapped after removing from the Cross. The picture was formed by the Special Ointment rubbed on the body of the Jesus. This ointment is said to have some volatile components, which evaporated by the heat of the body and were absorbed or deposited on the cloth. This further indicated that The Holy Jesus was alive at that moment, otherwise cold body had not evaporated the ointment rubbed on his body. Only a hot body can do it. The appearance of negative image on the shroud is the scientific proof that he never died on the cross and Romans / jews failed to kill him. His prayer was accepted by the Father God and he was spared from disgraceful death. Please read the book ‘Jesus Papers’ which details life of Jesus after crucifaction.The Jesus lived about 120 years, as per some stories and died in Kashmir India. His Tomb has been discoverd in Sari Nagar Kashmir, India.Best Regards,Ayaz.","date":"January 2, 2010 at 12:44 am","url":"https://shroudstory.com/2008/08/20/dates-for-2010-exhibition-of-the-shroud-of-turin/","cat":"2010","title":"Dates for 2010 Exhibition of the Shroud of Turin"}]}
