{"art":[{"author":"barrie_schwortz","post":"50 years ago the only organization making Shroud materials available in the U.S. was the Holy Shroud Guild.  I would bet that the “great salesman” referred to in the article was Fr. Francis Filas.","date":"November 29, 2011 at 4:37 pm","url":"https://shroudstory.com/2011/11/29/getting-on-antiques-roadshow/","cat":"art","title":"Getting on Antiques Roadshow"},{"author":"barrie_schwortz","post":"Here is a link to the website of Annig Raley-Agemian, the daughter of Ariel Agemian, that honors her father’s work:  http://www.agemianpaintings.com/","date":"May 19, 2014 at 3:18 pm","url":"https://shroudstory.com/2014/05/19/name-that-picture/","cat":"art","title":"Name that picture"},{"author":"barrie_schwortz","post":"This is in fact the so-called Sai Baba image. It has been on the internet for years.","date":"May 19, 2014 at 3:11 pm","url":"https://shroudstory.com/2014/05/19/name-that-picture/","cat":"art","title":"Name that picture"},{"author":"barrie_schwortz","post":"This is definitely NOT the painting by Ariel Agemian, although it could be a copy of his work made by someone else.","date":"May 19, 2014 at 1:13 pm","url":"https://shroudstory.com/2014/05/19/name-that-picture/","cat":"art","title":"Name that picture"}],"blood":[{"author":"barrie_schwortz","post":"I think it is important that I correct and clarify the statement made by this blogger and some of the comments that followed.  First, my actual comment regarding the crucifix in 1978 was made only to John Jackson. What I told John was that 20 years from now, when looking at my photographs of the STURP team at work, someone would see the crucifix and use that against us or our work. That proved to be prophetic since 20 years later, Harry Gove did just that in his book, “Relic, Icon or Hoax.” He included one of those photographs and stated: “Note the wooden crucifix around Jackson’s neck” (or words to that effect), as if somehow that would affect our data or conclusions. Remember that there were 3 Jews (including Adler) and several atheists and agnostics on the team so the wearing of a crucifix by one team member was totally irrelevant. As I have pointed out for years, that had no impact on the spectral, chemical, photographic and other data gathered by STURP and would simply be used as a red herring by some future skeptic to attack STURP on a personal basis.  Jackson had every right to wear that symbol of his faith if he so desired. I never asked John to remove the crucifix but only that he tuck it under his shirt. However, in 1978 most of the STURP team members were not very media savvy (due to the nature of their work in the weapons industry) and did not understand the impact such a simple and innocent gesture might cause years later. So sadly, Gove (and now Colin Berry) have proven me to be correct. As for Heller and Adler (and several other team members who did not go to Turin for the data gathering portion of our work but examined the data upon our return), that was mainly because we were under-funded and the cost of airline tickets and hotels had to be kept to a minimum, so only those team members who were essential for the data gathering went to Turin.  To be clear, NO ONE ever claimed that Heller and Adler were present during the examination in 1978.  One only has to look at the 1978 STURP Team page of Shroud.com, which has been online for nearly 20 years (http://www.shroud.com/78team.htm) to see a complete list of all the formal team members and which ones participated directly in the data gathering event. Frankly, I find it totally ridiculous that Colin would claim that Heller and Adler used their positions on the team to “boost their credentials as fully-involved rather than associate-status STURP” (members).  Both were fully involved and were active, full-fledged team members BEFORE we went to Turin and did not need the STURP project to boost their careers. The only one who fell into that category was Walter McCrone, who became an associate member when Rogers delivered his tape samples to him AFTER our return and it was only then that he signed the appropriate non-disclosure agreement. That is why McCrone is not on that list, as it reflects only those who were original members of the team. Others who were full fledged team members but did not participate in the data gathering included Diane Soran and Larry Schwalbe (of Los Alamos National Laboratory), Dr. Robert Bucklin and Dr. Joseph Gambescia (forensic and medical experts), and Jim Drusik of the Los Angeles County Museum of Art (who I have mentioned previously to Charles Freeman on this blog). So once again Colin, you have selected and presented certain facts completely out of context to try and prove your point and once again, you attack the character of the researchers rather than their science or their conclusions. I suppose I’ll have to compile a list of the deceased STURP team members and send it to you to make it easier for you to plan your next ad hominem attack on those who are not alive to defend themselves. Like several other skeptics over the years, you must believe that if you can’t attack the science, your only recourse is to personally attack the scientists themselves. Shame on you.","date":"August 25, 2015 at 1:35 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"author":"barrie_schwortz","post":"Colin, perhaps I should remind you that STURP’s primary objective was to determine the properties of the image on the Shroud. To that end, the majority of the experiments were oriented towards that goal. We understood the blood would be significant, which is why we welcomed Heller and Adler to the team, but they did not have to be in Turin to gather the data, since they had complete access to ALL of STURP’s data, including the tape samples, Vern Miller’s superb scientific photography and Mark Evans’ excellent photomicroscopy, not to mention all the spectral and other data. That is what they used to evaluate the bloodstains (just as you have).There was no time in STURP’s test plan to do any in situ analyses in Turin. The goal was to gather as much data as we could in the short time allowed to us and evaluate it in depth after we returned. A geologist doesn’t have to take the core sample himself, he just has to evaluate it afterwards. I should also mention that Adler was given the opportunity to examine the Shroud up close and personal on multiple occasions in later years. He was the only American scientist on the conservation commission of the Turin Archdiocese and was highly regarded by everyone. This also explains why a significant amount of STURP’s time was spent performing the various photographic and imaging experiments. They would provide a qualified database of accessible materials for future research, since we were the first group ever given such access to the Shroud and it was unknown whether any similar research would be permitted in the future. As you know, no such permission has ever been granted since. In many ways we were charting new territory, as no other similar examinations had ever been performed.However, calling Adler and Heller’s absence in Turin a “gross breach of professional standards” is a gross exaggeration and doesn’t take into account any of the countless factors and circumstances that STURP encountered along the way in their effort to obtain permission to examine the cloth. It is very easy to be critical 38 years later, but you do so without any real knowledge or context of what took place. It’s too bad you weren’t there in 1978, as I am sure you could have made a valuable contribution, but you weren’t there and now you are passing judgement on these men without any of the facts.I am sure you had an esteemed career and held many responsible positions. Just remember that Ray Rogers had an equally esteemed career and advised the U.S. government and military on matters of national security, even after his retirement as a Fellow at Los Alamos National Laboratory. As he was dying of cancer, he devised a method to foil IED’s in Iraq, and probably saved many lives by doing so.As for writing memoirs, only Heller wrote such a book, and it was less a memoir than an overview of STURP and his personal experiences as a member of the team. Adler wrote a number of papers about the Shroud that were posthumously compiled into a book by Dorothy Crispino. Heller spent considerable time with each team member during his research for his book. In fact, he spent a full week at my studio in Santa Barbara, California interviewing me and did the same with most of the others. He did it when the experiences were all fresh in our minds so it is probably the most accurate rendition of what we did throughout the process. To my knowledge, you are the first (and only) person to level that type of criticism on what is a truly important historical document.It is perfectly acceptable to disagree (even strongly) with the methods and conclusions of any researcher. In fact, Rogers and the others would have vehemently defended your right to do so. But it is absolutely unnecessary to launch baseless attacks on their character and accuse them of negligence or worse, which you have done on numerous occasions. That is true whether they are alive OR dead. A little respect goes a long way.","date":"August 25, 2015 at 5:47 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"}],"dating":[{"author":"barrie_schwortz","post":"“…the so-called UV-F photo of the radiocarbon corner of the Shroud (whose provenance I cannot determine but which is certainly not from Vern Miller’s 1978 collection)…”To my knowledge, the only researchers to ever perform UV fluorescence photography on the Shroud were the STURP team and Vern Miller.  The provenance of those images is without question. Every member of the STURP team had access to all the images taken in 1978, including Vern’s. All data was shared equally amongst team members.","date":"March 8, 2015 at 5:34 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"author":"barrie_schwortz","post":"I see your point Hugh. If that is one of Miller’s UV photos, it has been heavily manipulated, perhaps when someone drew the overlay on it.  The actual UV images are considerably darker and with greater contrast.","date":"March 8, 2015 at 6:16 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"author":"barrie_schwortz","post":"Charles, as I explained to you in an earlier post on this blog, STURP had Jim Drusik of the Los Angeles County Museum as a member of the team and our resident expert when it came to art and art history. However, STURP’s purpose was primarily to characterize the image on the cloth scientifically and not trace its historic origins. Our primary goal was to determine what formed the image. To that end, we obtained the spectral characteristics of every paint, pigment and binder used from medieval to modern times and did detailed spectral analyses across the entire Shroud. We found none. As I said before, it’s called SCIENCE!","date":"April 20, 2015 at 4:23 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"author":"barrie_schwortz","post":"I knew both David Sox and Fr. Peter Rinaldi personally. Take my word for it, between the two I would ONLY trust Rinaldi.","date":"April 20, 2015 at 6:36 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"author":"barrie_schwortz","post":"“I am quite happy to accept that the original pigments had largely fallen off by 1978…”You don’t seem to understand the technology Charles. Had the Shroud been created using any quantity of paint or pigment, it would have penetrated the cloth and there would have been plenty there for STURP’s instruments to detect. At best, only some of the surface pigment would have flaked off, but there would have been plenty remaining within the weave and fibers of the cloth.","date":"April 20, 2015 at 8:16 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"author":"barrie_schwortz","post":"Hugh said: “Rogers had no opportunity to examine the shroud for interwoven cotton, only stray fibres on sticky tape slides.” That is incorrect. Not only did Rogers examine the actual Shroud in close detail, so did Jackson and Jumper and Pellicori and Devan and many others. I have posted a pdf with some photos I made during the 1978 exam that shows this clearly. The last photo is Rudy Dichtl purchasing the infamous “white cotton gloves” that left modern cotton on the surface of the Shroud. Here’s the link: http://www.shroud.com/pdfs/sturpmicroscopy.pdf  I hope this is helpful.","date":"January 21, 2014 at 8:56 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"barrie_schwortz","post":"I only need to have it in my possession for one day, so it can be photographed in the exact same manner as the other samples I imaged at the lab in 2012 and added to the collection (which STERA, Inc. has made publicly available). After that, it can go back to the lab. No, I don’t think a petition is a good idea. I would rather hope they realized the importance of documenting the remaining sample, which might be equally useful in quelling some of the conspiracy theories. I doubt it would ever show up on e-bay, but stranger things have happened!","date":"March 16, 2014 at 5:46 pm","url":"https://shroudstory.com/2014/03/16/so-was-the-small-arizona-piece-in-doug-donahues-custody-ever-made-available-to-barrie-schwortz/","cat":"carbon_14_dating","title":"So, was the small Arizona piece in Doug Donahue’s custody ever made available to Barrie Schwortz?"},{"author":"barrie_schwortz","post":"To date, I have received no answer from Dr. Jull to the several e-mails I sent him to follow up on photographing the remaining sample.  I am still prepared to photograph it should it be made available.  According to the experts I spoke with, most labs would never destroy or use all of an existing sample but would typically keep some small pieces in reserve. The Zurich and Oxford labs now state that they have no Shroud samples remaining, while Arizona apparently kept substantial portions after their tests. I don’t believe they were required to return them to Turin, much as STURP was not required to return any of the materials they gathered. I am still hopeful that the Donahue sample will be made available at some point in time so it can be photographed and included with the other images I made.","date":"March 16, 2014 at 3:11 pm","url":"https://shroudstory.com/2014/03/16/so-was-the-small-arizona-piece-in-doug-donahues-custody-ever-made-available-to-barrie-schwortz/","cat":"carbon_14_dating","title":"So, was the small Arizona piece in Doug Donahue’s custody ever made available to Barrie Schwortz?"},{"author":"barrie_schwortz","post":"Good science must be done with complete transparency, particularly when dealing with something as controversial as the Shroud. Even Dr. Jull admitted to me that the 1988 tests were rather poorly performed. Arguing over the sample site, leaving the room for 30 minutes and returning with sealed, stainless steel (opaque) containers rather than glass, failure to perform chemical analyses on the samples (required by their own protocol) or release the raw data or explain mathematical inconsistencies in the process, etc., etc., have led to many conspiracy theories. I still personally prefer to look for a credible, scientific answer (like the reweave theory) than to resort to conspiracies.  In the end however, you reap what you sow.","date":"March 16, 2014 at 5:14 pm","url":"https://shroudstory.com/2014/03/16/so-was-the-small-arizona-piece-in-doug-donahues-custody-ever-made-available-to-barrie-schwortz/","cat":"carbon_14_dating","title":"So, was the small Arizona piece in Doug Donahue’s custody ever made available to Barrie Schwortz?"}],"events":[{"author":"barrie_schwortz","post":"I hope to see you there Dan!","date":"October 10, 2013 at 8:16 pm","url":"https://shroudstory.com/2013/10/10/barrie-schwortz-to-speak-in-savannah/","cat":"event","title":"Barrie Schwortz to Speak in Savannah"},{"author":"barrie_schwortz","post":"All of Rogers’ blood tape samples were in Alan Adler’s possession when he died and shortly thereafter, the Adler family packaged all of Adler’s Shroud materials, including the Rogers tape samples, and returned them to the Archdiocese of Turin. When Rogers discovered this, he wrote to the Archdiocese on five different occasions and asked for their return, but he never received any response. Rogers considered them “lost.” Their current status and how they were preserved is unknown.","date":"March 16, 2015 at 1:42 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"author":"barrie_schwortz","post":"Good catch!  The page you referenced was scheduled to be updated in our January 21, 2013 17th anniversary update. It was one of the original html pages provided to us by BSTS member Chris Jones back in 1996 and has never been updated. Our primary focus over the past year or two has been to complete the scanning and ocr of all the back BSTS issues, and the last of these will go online in January. We will also be adding pdf versions of all the old, html-only issues (#43 through #48) at that time.  But since you brought it up, the page in question has now been updated.As for the confusion over the “home page,” I believe David’s page is an excellent means of the BSTS getting news out quickly and serves a very good purpose in giving people advance notice on things like meetings and lectures. However, shroud.com is more of a permanent archive and long term reference library and does not try to be a “daily news blog.” We have been providing an internet presence for the BSTS since 1996. Try searching for “British Society for the Turin Shroud” on Google.","date":"October 3, 2012 at 5:55 pm","url":"https://shroudstory.com/2012/10/01/davor-aslanovski-to-attend-b-s-t-s-british-society-for-the-turin-shroud-meeting/","cat":"event","title":"Davor Aslanovski to attend B.S.T.S. (British Society for the Turin Shroud) Meeting"},{"author":"barrie_schwortz","post":"Let me start by thanking Hugh Farey, Thibault Heimburger, Joe Marino, O.K. and David G. for their kind words and their support. It is truly appreciated. Even though Hugh and I disagree on many issues, we share a mutual respect for each other’s points of view and we definitely had an enjoyable time together at the Hampshire event in August.For the record, the term “sold out” in my recent post was taken directly from the description of my presentations on the Museum’s website (https://www.childrensmuseum.org/exhibits/national-geographic-sacred-journeys/barrie-schwortz) and had nothing to do with finances. Admission to my lectures was free and was simply included with a paid admission to the museum. All of the proceeds go directly to support this amazing facility, which happens to be the largest children’s museum in the world. (Look it up). I would never get to travel and lecture anywhere if STERA, Inc. had to bear the costs, so all airline tickets, hotels and most meals are typically covered by the sponsoring organizations. As for the event in England, all my expenses were covered by the Review of Religions, the publication that invited me to attend and served as my sponsor. However, neither STERA, Inc. nor I received ANY honorarium or payment for speaking at their Jalsa event. I attended solely to open a dialogue about the Shroud with a very large Muslim group that expressed a sincere interest in the subject matter and a deep belief in its authenticity. That was enough for me to set aside my own personal concerns and inhibitions and gratefully accept the invitation. How would YOU like to be a Jewish man attending a Muslim convention to discuss a Christian relic?Yes, I do express my personal beliefs when I am lecturing or appearing publicly (as does every other Shroud lecturer), but I try to never do so on Shroud.com unless the article is clearly labeled as an editorial. That way people can separate my personal views from those of our board members or the organization itself. And no, there is never total agreement, even among the board members. If total agreement were essential for friendship in the Shroud world, NO ONE would have ANY friends! Most importantly, I never attempt to convince anyone of anything and always say so in my lectures. However, that philosophy is best expressed on the front page of Shroud.com, which has carried the following statement for almost 20 years:“We believe that if you have access to the facts, you can make up your own mind about the Shroud.”As for “pandering” at the U.K. event, I was very open with the audiences and clearly stated that I personally believe the man of the Shroud was dead, knowing full well that I was challenging a core belief of the group that invited me. But I did so honestly and respectfully and I know that my position was appreciated by the audience. It was anything but pandering. In fact, the blogger in question lives in England and he could have easily attended the Hampshire event himself. If he had, he would have graciously been given an opportunity to express his own views, just as Hugh Farey, Pam Moon and David Rolfe did. Maybe he will do so at next year’s event, but I suspect he prefers the semi-anonymity of the internet rather than appearing anywhere in person. Yes, STERA, Inc. usually does receive an honorarium for most of my lectures (including the ones I gave at the museum), but that is paid directly to STERA, Inc. and not to me personally. The lecture fees are a small part of our very modest revenue stream that supports our work and keeps the website free of any advertising. I receive a fixed monthly salary for my full time work in maintaining the website and taking care of the organization’s day to day business. Since we are a formal 501(c)(3) non-profit organization granted tax free status by the I.R.S., our tax returns are a matter of public record. In fact, Dan Porter has included that information on this blog in past years.One final thought. I absolutely do believe that one can have a personal point of view and still remain objective. Does anyone actually believe that they are mutually exclusive or that every objective person in the world has NO point of view?  I have changed my mind many times on various facets of Shroud research and am willing to do so again whenever credible evidence is presented. I have been doing this for 38 years and have dealt with just about every skeptic that has come down the path. Fortunately, most of them are reasonably respectful and state their views professionally without the ad hominem personal attacks that this blogger has become notorious for. As I stated in a previous post on this blog, a little respect goes a long way.","date":"September 24, 2015 at 10:16 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"author":"barrie_schwortz","post":"Hi Matthew – Contact me directly by e-mail via http://www.shroud.com/email.htm and I might be able to help.","date":"September 25, 2015 at 12:41 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"author":"barrie_schwortz","post":"Really Louis?  I guess they must have been spinning in their graves in 2010 when the spiritual leader of the Ahmadiyya Muslim sect (the one I visited in England) was given a personal viewing of the Shroud while it was on public display in Turin by none other than Msgr. Giuseppe Ghiberti, the then President of the Turin Diocesan Commission on the Shroud. (I’ll post a link to a video of that event in our next update). Do you think that was a mistake too? Apparently, you did not know Otterbein or Rinaldi personally or you would understand that they would not have allowed the fundamental differences between the two faiths to inhibit sincere dialogue about the Shroud.","date":"September 25, 2015 at 5:19 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"author":"barrie_schwortz","post":"The cabinet in which the Shroud is stored in an nitrogen/argon environment is the same cabinet in which it is displayed. The framed Shroud is raised hydraulically into position and then lowered at the end of an exhibition. It is always stored in its temperature and humidity controlled case.","date":"February 27, 2013 at 9:32 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral"},{"author":"barrie_schwortz","post":"In 2010 the reservation system did not go online until around nine months before the start of the exhibition. If Turin follows the same pattern this time, we can expect the system to go online within the next few weeks. Definitely much ado about nothing.","date":"July 15, 2014 at 3:44 pm","url":"https://shroudstory.com/2014/07/15/reservations-for-viewing-the-shroud-of-turin-in-2015/","cat":"2015","title":"Reservations for Viewing the Shroud of Turin in 2015"},{"author":"barrie_schwortz","post":"If you translate the current Italian language web page into English you will find, among other notices about the 2015 Exposition, the following statement:  ReservationsAt the moment you can not book any pilgrimage to the exposition in 2015. Reservations will be carried out, however, from this site, http://www.sindone.org . All information will be soon available on the net.In 2010 the reservation system went online about 9 months before the exposition. It is obvious they have not yet updated the page completely. Here’s a link to an English translation of the Italian language page: http://translate.googleusercontent.com/translate_c?depth=1&hl=en&rurl=translate.google.com&tl=en&u=http://www.sindone.org/santa_sindone/00023930_Santa_Sindone.html&usg=ALkJrhi4qux22aV7qVpWahno6AnHGRPCJw Obviously, they have not yet updated the English version on their site.","date":"July 2, 2014 at 2:22 pm","url":"https://shroudstory.com/2014/07/02/the-official-site-wants-you-to-come-to-the-exhibition-in-2010/","cat":"event","title":"The Official Site Wants You to Come to the Exhibition in 2010"},{"author":"barrie_schwortz","post":"You can also visit Richard’s website at http://www.museumoftheholyshroud.net/index.htm and see photos of many of the items on display at the museum.","date":"January 2, 2015 at 2:33 pm","url":"https://shroudstory.com/2015/01/01/the-wabash-museum-of-the-holy-shroud/","cat":"exhibition","title":"The Wabash Museum of the Holy Shroud"},{"author":"barrie_schwortz","post":"Hi Rick. Unfortunately, there are two major errors in your posting. ONE: I did not DISMISS the Tilma but simply stated that I did not believe it would withstand the same scientific scrutiny as the Shroud. TWO: My comment was NOT based on “secondhand comments I had heard…” but on all the scientific data presented by three experts on the Tilma from Mexico City who presented it to a group of Shroud scholars at a conference held in Jerusalem over a period of 5 days in 2013.  Here’s a link to an article about that conference with the details and the names of all the experts in attendance: http://www.shroud.com/late13.htm#3rd3. No rush to judgment here. Just my personal opinion based on that data.","date":"February 25, 2015 at 10:18 pm","url":"https://shroudstory.com/2015/02/25/upcoming-presentation-by-john-c-iannone-in-winter-park/","cat":"presentation","title":"Upcoming Presentation by John C. Iannone in Winter Park"}],"dna":[{"author":"barrie_schwortz","post":"Here are a few links on shroud.com about Archbishop Gewargis Sliwa and his Shroud studies from 2003, 2007 and 2009:  http://www.shroud.com/late03.htm#archbishop, http://www.shroud.com/late07.htm#sliwa, http://www.shroud.com/late09.htm#sliwa","date":"October 6, 2015 at 5:44 pm","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"}],"forensic":[{"author":"barrie_schwortz","post":"My busy schedule makes it difficult for me to keep up with all the Shroud blogs out there, but this particular posting called for a response.There is no way to coat a porous linen surface like the Shroud with any light sensitive elements in liquid form without some traces of those elements soaking in and remaining in the cloth, even hundreds of years later.  The pyrolysis mass spectrometry used on the Shroud would have detected as little as one part per billion of those elements if they were there.Blueprints, platinum chloride platinotype prints and gum bichromate or chromium prints are all products of the late 19th or early 20th century so they could not have been used in medieval times to create the Shroud.  J.H. Schulze is credited as the first man to discover the fact that silver salts exposed to light turned black.  He made this discovery in 1727.  In the same year he discovered that silver chloride turned black under light. In 1737 he used silver nitrate in the same manner.  He used cut stencils to expose his silver salts.Thomas Wedgewood and Humphrey Davy repeated Schulze’s experiments some years later by printing leaves instead of stencils. They tried to make a permanent emulsion but did not succeed.It was not until 1818 that Joseph Niepce produced the first photographic negative, which I believe still exists.Since silver, platinum and chromium were NOT found on the Shroud, those processes must be eliminated as possibilities.Of course, the Shroud’s image properties themselves are the best evidence that it was NOT created photographically (even though its lights and darks are reversed, like a photo negative). You might wish to read the article I wrote in 2000 titled “Is the Shroud of Turin a Medieval Photograph” (http://www.shroud.com/pdfs/orvieto.pdf) that addressed Nicholas Allen’s camera obscura experiments in which Allen produced an excellent photographic image using silver salts and other medieval raw materials. However, that process resulted in an image dramatically different than the image on the Shroud.One of my college professors used to say that “common sense is the least common of all the senses!” If we are going to make outrageous claims that modern processes were used hundreds of years prior to their actual invention, then we should start searching ancient ruins for medieval digital cameras (Ye Olde I-pod)!","date":"August 22, 2011 at 4:19 pm","url":"https://shroudstory.com/2011/08/22/razor-swift-the-shroud-of-turin-is-real/","cat":"flagrum","title":"Razor Swift: The Shroud Of Turin Is Real!"}],"history":[{"author":"barrie_schwortz","post":"Excellent point WmW!  Here is the first sentence of the comment I wrote (that the Catholic Herald editor deleted):  “Those aspects of the Shroud are far from my areas of expertise.”","date":"October 29, 2014 at 4:04 pm","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"author":"barrie_schwortz","post":"For those not familiar with the 2002 restoration of the Shroud, read the Comments on the Restoration page of shroud.com at http://www.shroud.com/restored.htm for details.","date":"March 25, 2012 at 3:31 pm","url":"https://shroudstory.com/2012/03/25/comment-promoted-travertine-aragonite-limestone/","cat":"history","title":"Comment Promoted: Travertine Aragonite Limestone"},{"author":"barrie_schwortz","post":"For some interesting background on some authentic Shroud relics I saw in Portugal that came from the Savoy family, read the article by Portuguese relic expert Carlos Evaristo at http://www.shroud.com/pdfs/fatima2011.pdf Here is a brief quote:“Maria Pia, who was the daughter of the first King of unified Italy, Vittorio Emanuele II, at 15 years of age wed Portugal’s King Luis I in 1862 bringing with her to Portugal a series of Holy Relics from the Shroud of Turin.”","date":"January 10, 2014 at 8:58 pm","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","title":"How many more purported pieces are out there?"},{"author":"barrie_schwortz","post":"Thank you Gabriel. I was not aware of this particular paper so it was not included on our Bibliography of STURP Published Papers page (http://www.shroud.com/78papers.htm). Of course, it was authored and published many years after the STURP team ended its formal existence. However, since you brought it up, I have added it as #29 to the list on our site as of today. Also note this quote from Larry Schwalbe on the page: “As I said, these papers do not deal directly with the data collected in 1978. Instead, the work was intended to serve as background to support a future investigation that we thought was still possible in the late 80s. There are probably more papers like these. Perhaps including these will flush out more such information.” And that’s exactly what happened! Thank you for your contribution!","date":"September 26, 2012 at 5:06 pm","url":"https://shroudstory.com/2012/09/26/paper-chase-barrie-schwortz-the-shroud-of-turin-research-project-1978-scientific-examination-of-the-shroud/","cat":"history","title":"Paper Chase: Barrie Schwortz’ “The Shroud of Turin Research Project 1978 Scientific Examination of the Shroud”"}],"image":[{"author":"barrie_schwortz","post":"Hi Ron, I am not convinced that the problem was with the Vatican, but it certainly existed in Turin. The Pope had to rely on information provided to him by his official custodian, the Archbishop of Turin, to make his decision to permit the restoration. If the Pope was told this was a necessary intervention, he would certainly have accepted that as fact and granted his permission. I believe that has all changed since the restoration and Rome is far more aware of the issues in Turin than they were in 2002.  Sadly, it is too late for the Shroud and the damage was done.  My personal opinion of the restoration is in total agreement with Ray Rogers and most other scientists who have studied the Shroud. I strongly urge you to read Meacham’s book when you can. It is well worth it.Perhaps the most unsettling part of what occurred was the attachment of a “new” backing cloth to the Shroud that was much whiter and brighter than the previous Holland cloth, lowering the apparent contrast of the image.  Worse yet, no chemical analysis was performed on the “new” cloth to determine if it had been treated in any manner that might prove harmful to the Shroud. Remember, it is permanently attached to the back of the Shroud. In one of the press releases from Turin after the restoration, they stated that the intervention “wasn’t about science but about conservation,” as if science plays no role in the conservation of the cloth. It was that attitude that was most disappointing.I leave for a series of lectures in Canada tomorrow morning and won’t be back in my office until April 4th.  I am not sure I’ll have internet access while there, so I may be silent for the next week or so.  I hope this information is helpful.Barrie","date":"March 26, 2012 at 4:26 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","title":"Two thousand years of chemical history was destroyed"},{"author":"barrie_schwortz","post":"Hi Ron,It is hard to know exactly what Pope John Paul II knew about the planned intervention but we have to assume he was told it was necessary.  By 2002 his health was declining and he might not have known much else.My current lectures are in Delta, B.C. near Vancouver. I may be in the Toronto area in October however.  The Vancouver Shroud Association has a Shroud exhibit that might be going to Toronto late this year. If that is confirmed, I’ll be there too.  If so, I hope to see you there. I’ll try and post the info on the website once it is finalized. You can see my current lecture schedule at this link:  http://www.shroud.com/latebrak.htm#lecturesWarmest regards,Barrie","date":"March 26, 2012 at 6:02 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","title":"Two thousand years of chemical history was destroyed"},{"author":"barrie_schwortz","post":"For those not familiar with the 2002 restoration of the Shroud, read the Comments on the Restoration page of shroud.com at http://www.shroud.com/restored.htm for details.","date":"March 25, 2012 at 3:48 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","title":"Two thousand years of chemical history was destroyed"},{"author":"barrie_schwortz","post":"To help you find the materials on the restoration that we published in 2002, here are some links to the articles we included on the 2002 Late Breaking News page:Dramatic News From Turin – http://www.shroud.com/late02.htm#restoredRestored Shroud Unveiled – http://www.shroud.com/late02.htm#restored2Comments on the Restoration – http://www.shroud.com/late02.htm#restored3Comments on the Comments – http://www.shroud.com/late02.htm#restored4Here is a link to the resulting page of comments from Shroud scholars:Comments on the Restoration Page – http://www.shroud.com/restored.htmHere is a link to an article provided by the Rev. Albert Kim Dreisbach Jr. with a translation of an Italian article by Mons. Joseph Ghiberti regarding the restoration:Story of the Restoration 2002 – http://www.shroud.com/pdfs/restore.pdfThese should provide some useful background material.","date":"March 25, 2012 at 5:42 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","title":"Two thousand years of chemical history was destroyed"},{"author":"barrie_schwortz","post":"One final note. You can use the Website Search Engine on http://www.shroud.com and enter “restoration” to find much more material about the 2002 restoration.","date":"March 25, 2012 at 6:06 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","title":"Two thousand years of chemical history was destroyed"},{"author":"barrie_schwortz","post":"Sadly, Max Frei died years ago.  However, in 1978 NO researchers were permitted to take sticky tape samples from the face of the man of the Shroud. I documented every minute of Max’s tape sampling experiment photographically and I can assure you that neither he nor Rogers took any tape samples from the face.","date":"December 11, 2012 at 6:08 pm","url":"https://shroudstory.com/2012/12/11/coins-on-eyes-issue-again/","cat":"image_theory","title":"Coins on Eyes Issue Again"},{"author":"barrie_schwortz","post":"Frei was given the opportunity to go first and take his samples at the very beginning of the examination in 1978.  It was then that the incident I previously described occurred, with Max attempting to place tape on the face and Jackson stopping him. He completed his sampling under the gaze of at least 20 people in the room and he never went back to the face after Jackson’s intervention. That was his ONLY opportunity to take any tape samples from the Shroud. He never was given any additional time for further sampling. STURP worked around the clock and there was NEVER a moment when some experiment was not being performed. Consequently, there was no way for Frei to take any additional tape samples without being noticed. He could not sneak in and take samples when nobody was looking, because experiments were going on 24 hours a day around the clock during the entire five days and nights of the examination.  Paul Maloney obtained a complete set of my Frei photographs in the late 1990’s and carefully produced a map of where Frei took each of his samples from, based on the photos and Frei’s notes.  NO samples were taken from the face and there was NO WAY that Frei could have done so during the 1978 examination. I have no idea what the basis is for Lucotte’s claims, but it could not have been from a tape sample of the face taken by Frei in 1978.  Riggi did several experiments on the cloth using an endoscopic camera system and a special vacuum but he never did ANY tape sampling himself.  I hope this helps clarify the issue.","date":"December 13, 2012 at 4:26 pm","url":"https://shroudstory.com/2012/12/11/coins-on-eyes-issue-again/","cat":"image_theory","title":"Coins on Eyes Issue Again"},{"author":"barrie_schwortz","post":"Sadly, Don Lynn died in October 2000.  Before his death he was the Imaging Project Manager on the Voyager, Viking, Mariner and Galileo projects at NASA’s Jet Propulsion Laboratory in Pasadena, California.  He was probably the most qualified imaging expert on the STURP team.","date":"December 12, 2012 at 5:42 am","url":"https://shroudstory.com/2012/12/11/coins-on-eyes-issue-again/","cat":"image_theory","title":"Coins on Eyes Issue Again"},{"author":"barrie_schwortz","post":"Great comments by Daveb, Kelly and Ray!  Watch for the next update on shroud.com (due at the end of this month) for an article titled, “Behind the Scenes of a New Smithsonian Channel Shroud Documentary” in which I will give some details on the techniques the producers used for creating the program.","date":"May 18, 2013 at 3:20 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"author":"barrie_schwortz","post":"Nice catch!  I’ll have to rewrite the opening to that very old article written in 1996. It is incorrect. The recent comments I made are accurate and I thank Andy and Pete Schumacher for correcting my comments yesterday. I did not know the VP-8 had been donated to STURP by the manufacturer. I’ll update the article later today. Thanks Mike!","date":"March 30, 2014 at 2:36 pm","url":"https://shroudstory.com/2014/03/30/nasa-had-nothing-to-do-with-it/","cat":"image_theory","title":"NASA had nothing to do with it."},{"author":"barrie_schwortz","post":"Oops. The last sentence should have read thanks Hugh and Mike!","date":"March 30, 2014 at 2:38 pm","url":"https://shroudstory.com/2014/03/30/nasa-had-nothing-to-do-with-it/","cat":"image_theory","title":"NASA had nothing to do with it."},{"author":"barrie_schwortz","post":"Thanks for reminding me Thibault! That is very helpful.","date":"May 13, 2014 at 6:36 pm","url":"https://shroudstory.com/2014/05/13/schwortz-it-is-worth-reviewing-david-fords-noteworthy-blood-or-paint-paper/","cat":"image_theory","title":"Schwortz: It is Worth Reviewing David Ford’s Noteworthy Blood or Paint Paper"},{"author":"barrie_schwortz","post":"Al Adler was in possession of all of Rogers’ blood tape samples when he died. Sadly, the Adler family packed up all his Shroud materials, including Rogers’ samples, and sent them back to Turin after Al’s death. Rogers wrote five letters to the Archbishop of Turin requesting their return but never received even one reply. In the end, Rogers considered those samples lost. So I am not so certain there are any credible Shroud blood samples  actually “floating around out there.”  Perhaps this issue is still open in the minds of some researchers, but the evidence shows McCrone was wrong. Remember, he never even saw the Shroud and based his conclusions solely on his visual examination of the tape samples. Watch for my article titled, “Answering a Skeptic” in our next website update in early June which deals with this in more detail.","date":"May 13, 2014 at 6:31 pm","url":"https://shroudstory.com/2014/05/13/schwortz-it-is-worth-reviewing-david-fords-noteworthy-blood-or-paint-paper/","cat":"image_theory","title":"Schwortz: It is Worth Reviewing David Ford’s Noteworthy Blood or Paint Paper"},{"author":"barrie_schwortz","post":"Rogers paper was reviewed over a period of many months and he had to rewrite several portions and perform additional experiments before it was finally accepted. Because of the subject matter, they put Rogers through a very intensive review process. They do not publish papers that are NOT peer reviewed. It is only considered “apologia” by those who don’t like Rogers’ conclusions.","date":"September 16, 2013 at 6:30 pm","url":"https://shroudstory.com/2013/09/16/speaking-of-more-scientific-testing-of-the-shroud/","cat":"image_theory","title":"Speaking of more scientific testing of the shroud"},{"author":"barrie_schwortz","post":"The evidence for what I stated in my last posting is on the front page of the paper itself:  received by the journal on 14 April 2004 and accepted for publication on 12 September 2004, five months later. During that time the review process was ongoing and Rogers made all the necessary corrections or changes that were recommended by the reviewers.","date":"September 18, 2013 at 3:56 pm","url":"https://shroudstory.com/2013/09/16/speaking-of-more-scientific-testing-of-the-shroud/","cat":"image_theory","title":"Speaking of more scientific testing of the shroud"},{"author":"barrie_schwortz","post":"I think everyone is forgetting an important fact. The idea of the Shroud image being the product of scorches caused by a heated metal statue has been around for a long time (since the STURP days), and was first proposed by Joe Nickel, avowed atheist and Shroud skeptic.Since the color of the image is very similar to the color of the scorches, STURP understood the need to test this theory and performed specific experiments for that purpose.  A primary test was to photograph the Shroud using ultraviolet fluorescence photography, since true scorches on linen will always fluoresce in the red. As there are many documented scorches on the Shroud from the 1532 fire, testing this was not difficult and the results of the tests were published in this peer reviewed reference:Miller, V.D. and S.F. Pellicori, “Ultraviolet Fluorescence Photography of the Shroud of Turin,” Journal of Biological Photography, Vol. 49, No. 3, 1981, pp. 71-85.Every documented scorch on the Shroud fluoresced in the red, as expected. However, the image did NOT fluoresce and in fact, even quenched the background fluorescence in the image areas. The only conclusion possible from these observations is that the Shroud image is NOT the product of scorched or heated linen.","date":"February 10, 2012 at 8:20 pm","url":"https://shroudstory.com/2012/02/10/the-image-on-the-shroud-of-turin-is-not-a-scorch/","cat":"image_theory","title":"The image on the Shroud of Turin is not a scorch"},{"author":"barrie_schwortz","post":"Sadly, that’s why I don’t post to blogs very often. I don’t have time to waste debating folks who simply choose to ignore the published science. They obviously have already made up their minds so why bother?  Perhaps they have more time on their hands than I do, but I am not interested in arguing for the sake of argument. That is why I never try to convince anyone of anything. Frankly, I don’t really care what this gentleman thinks and will leave him in your and Dan Porter’s able hands.The article I referred to was published in a highly respected scientific journal. However, due to copyright restrictions,  I do not have the right to distribute or publish the article or the UV fluorescence photographs it contains in a public forum. The photographs are all copyrighted to Vern Miller. However, there is a great Table in the paper that makes the very specific comparisons you have been discussing in this forum, so I highlighted them in yellow and posted a jpeg image of the table to this link:   Perhaps that will be helpful to your skeptic (but I doubt it). Have a great weekend!Barrie","date":"February 10, 2012 at 11:21 pm","url":"https://shroudstory.com/2012/02/10/the-image-on-the-shroud-of-turin-is-not-a-scorch/","cat":"image_theory","title":"The image on the Shroud of Turin is not a scorch"},{"author":"barrie_schwortz","post":"Hi Kelly, Ray Rogers told me personally that he believed, “Something else was at work with the Maillard reaction,” but he didn’t know what that was and didn’t live long enough to explore it.","date":"May 21, 2013 at 11:53 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","title":"The pig experiment was not Barrie’s experiment"}],"misc":[{"author":"barrie_schwortz","post":"Thank you all for your comments!  I totally agree and have already started working on the redesign of the Main Menu page.  I particularly appreciate the technical suggestions and will include them when I update the site for our 16th anniversary update on January 21, 2012. And no, this is not going to get anyone into trouble with me! The site has needed a face lift for years but other priorities always got in the way. Thanks for giving me a much needed nudge!","date":"September 20, 2011 at 1:33 pm","url":"https://shroudstory.com/2011/09/20/a-call-to-freshen-up-shroud-com/","cat":"news_&_views","title":"A Call to Freshen Up shroud.com"},{"author":"barrie_schwortz","post":"The corrected version is now online. Thanks for pointing it out to me.","date":"January 21, 2014 at 5:24 pm","url":"https://shroudstory.com/2014/01/21/18th-anniversary-for-shroud-com/","cat":"news_&_views","title":"18th Anniversary for shroud.com"},{"author":"barrie_schwortz","post":"We already include those words (and others) in the Metadata and Keywords on our Spanish language pages, which is why Dan found us when searching on La Sábana Santa de Turín. Still, it wouldn’t hurt to add them to our English language pages as well. Thanks for the tip.","date":"June 15, 2015 at 2:08 pm","url":"https://shroudstory.com/2015/06/15/a-tip-for-shroud-of-turin-website-owners/","cat":"other_sites","title":"A Tip for Shroud of Turin Website Owners"},{"author":"barrie_schwortz","post":"The video in question is an edited and shortened version of a program produced in 2010 by nuns from the Chemin Neuf community in Lyon, France. The original title is “He Is the Image of the Invisible God – Shroud of Turin,” which was released in June 2010 on a 16 language DVD. Here is a link to the original program on our website store page: http://www.shroud.com/obtain.htm#Video. Also appearing in the original program were Thibault Heimburger, Christian Cataldo, Ed Prior and others. I have no idea who re-edited the program or whether they obtained permission to do so. You can view the entire original 35 minute version of the program on the Net For God website at this link: http://www.netforgod.tv/VOD/index.html (Scroll down the list of programs and select: “Il est l’image du Dieu invisible Le Linceul de Turin,” then select the language you wish to view in).","date":"June 19, 2014 at 1:26 pm","url":"https://shroudstory.com/2014/06/19/hathos-warning/","cat":"uncategorized","title":"Hathos Warning"},{"author":"barrie_schwortz","post":"I strongly urge anyone using Internet Explorer to switch over to Mozilla Firefox immediately. It is free and far more robust than IE.  Once installed, find and download the following two add-ons (also free):  NoScript, which blocks web pages from running scripts on your computer. This can affect the functionality of certain web pages but you can permanently allow the pages you trust. Otherwise, you can temporarily allow pages that don’t properly function when you visit them. The default is to block all scripts and give you the options (which can be a hassle sometimes – but it keeps you safe).The second add-on is KeyScrambler, which encrypts all of your keystrokes while on the web, making your passwords and the other information you enter much safer. It used to be an add on to Firefox but is now a standalone program. The personal version is free and you can find it via Google.","date":"April 30, 2014 at 6:20 pm","url":"https://shroudstory.com/2014/04/30/browser-issues-this-blog-and-more/","cat":"news_&_views","title":"Browser Issues:  This Blog and More"},{"author":"barrie_schwortz","post":"Ooops!  Sorry.","date":"June 19, 2014 at 9:27 pm","url":"https://shroudstory.com/2014/06/19/hathos-warning/","cat":"uncategorized","title":"Hathos Warning"},{"author":"barrie_schwortz","post":"Hello O.K.!  Yes, I intend to include it in our next update, which will go online as soon as the Archdiocese of Turin activates their reservation system. I just got two e-mails from you but there was no message in either.","date":"June 19, 2014 at 3:08 pm","url":"https://shroudstory.com/2014/06/19/hathos-warning/","cat":"uncategorized","title":"Hathos Warning"},{"author":"barrie_schwortz","post":"Hello O.K. – I got your e-mail and have just responded. I also have house guests for the next 3 days so cannot do an update until the beginning of next week at the earliest. However, I expect the reservation system will be going online by the end of this month. (In 2010 it went online about 9 months before the beginning of the exposition).","date":"June 19, 2014 at 3:31 pm","url":"https://shroudstory.com/2014/06/19/hathos-warning/","cat":"uncategorized","title":"Hathos Warning"},{"author":"barrie_schwortz","post":"For more information on the 2002 intervention, see Comments on the Restoration at http://www.shroud.com/restored.htm.","date":"June 5, 2015 at 6:56 pm","url":"https://shroudstory.com/2015/06/05/housekeeping-how-to-participate/","cat":"news_&_views","title":"Housekeeping:  How to Participate"},{"author":"barrie_schwortz","post":"Dear David – Read the 2005 article on the Manoppello by Roberto Falcinelli at http://www.shroud.com/pdfs/roberto.pdf.  It has been available online for 8 years.","date":"September 11, 2013 at 5:11 pm","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"author":"barrie_schwortz","post":"The Turin authorities designed and commissioned a new display cabinet for this exposition, which is what we see pictured in all the photos. It is different than the permanent reliquary in which the Shroud is usually stored.","date":"June 12, 2015 at 2:52 pm","url":"https://shroudstory.com/2015/06/12/lights-cameras-action-and-the-drones-of-turin/","cat":"2015","title":"Lights, Cameras, Action and the Drones of Turin"},{"author":"barrie_schwortz","post":"Thanks Dan!  Good idea!","date":"August 10, 2013 at 1:53 pm","url":"https://shroudstory.com/2013/08/10/more-on-the-shroud-affair/","cat":"crowdfunding","title":"More on The Shroud Affair"},{"author":"barrie_schwortz","post":"I am always happy to speak about the Shroud, no matter what the point of view is of the sponsoring organization. Since many Evangelical Christians do not accept the Shroud as authentic, the opportunity to address such a group is a great opportunity to inform them of the facts and perhaps open their minds a bit to the Shroud. I never involve myself in theology in my presentations and simply share the facts and my own personal experience with it over the last 35 years.  And yes, they will pay a modest honorarium to STERA, Inc. for my services, but that is not the primary reason for making the presentation.","date":"January 22, 2013 at 3:03 pm","url":"https://shroudstory.com/2013/01/22/pitn-taking-advantage-of-the-shroud-of-turin/","cat":"news_&_views","title":"PITN Taking Advantage of the Shroud of Turin"},{"author":"barrie_schwortz","post":"We started using the pdf format in 1999, before it became widely accepted, and the first 23 papers we published in that format were placed in the root directory of the website. It quickly became apparent that this was the ideal format for papers on the site, so we created a new folder specifically for files of that format and all new pdfs were placed in that directory. It currently contains 1600 pdf files. The root directory only includes those first 23 pdf files and we have left them in that directory to avoid changing any links on the website, since those are often used as references in published papers, books and presentations.","date":"December 2, 2015 at 4:37 pm","url":"https://shroudstory.com/2015/12/02/searching-for-papers/","cat":"other_sites","title":"Searching for Papers"},{"author":"barrie_schwortz","post":"The problem has now been corrected and the blocking file removed. Unfortunately, we added the blocking file in January 2014 when our bandwidth shot through the roof and generated over 130GB of traffic in just a few days, nearly tripling our average monthly bandwidth. According to our service provider, this was mostly generated by search engines. With the file removed, search engines can once again access the pdfs.","date":"August 5, 2014 at 3:35 pm","url":"https://shroudstory.com/2014/08/05/searching-shroud-com-academia-edu-and-other-sites/","cat":"news_&_views","title":"Searching shroud.com, academia.edu and other sites"},{"author":"barrie_schwortz","post":"Due to my travel and lecture schedule this year, we had to apply for an extension to our normal July 15 filing date. Our return was filed on October 29, 2014 so the 2013 data should show up soon.","date":"November 21, 2014 at 12:51 pm","url":"https://shroudstory.com/2014/11/20/steras-annual-fundraising-campaign/","cat":"other_sites","title":"STERA’s Annual Fundraising Campaign"},{"author":"barrie_schwortz","post":"Hi Kelly,  I spoke with Richard today and the website and museum are not quite ready. The site currently is using place keeper photos (with new ones soon to replace them)and the current captions are only temporary until the finals are written. Richard doesn’t have a date for the grand opening yet.","date":"September 12, 2013 at 6:52 pm","url":"https://shroudstory.com/2013/09/12/the-wabash-shroud-of-turin-museum/","cat":"news_&_views","title":"The Wabash Shroud of Turin Museum"},{"author":"barrie_schwortz","post":"I was contacted by this company about a month ago and they sent me their printed literature. I also spoke to the owner on one occasion. They wanted STERA, Inc. to include their product on shroud.com. I asked them to furnish the name of the priest who provided the image and was told he was from Spain and named “Fr. Laisney.”  They claimed he was part of the “restoration” team so I contacted Turin today and was told that they never heard of Fr. Laisney and he had nothing to do with the 2002 restoration. Also, the material on their website and printed literature is inaccurate when it talks about the Shroud. We will not be working with them.","date":"June 1, 2013 at 6:24 pm","url":"https://shroudstory.com/2013/06/01/we-received-a-high-resolution-scan-from-one-of-the-priests/","cat":"news_&_views","title":"We received a high resolution scan from one of the priests . . ."},{"author":"barrie_schwortz","post":"There were two sets of tape samples taken in 1978, one by Frei and the other by Rogers. I believe the above diagram is of Frei’s sampling.  You can find a map of Rogers’ sample sites at this link: http://www.shroud.com/mapping.htm","date":"December 21, 2012 at 6:30 pm","url":"https://shroudstory.com/2012/12/16/who-took-which-sticky-tape-samples-where-and-when-6bd-pictured/","cat":"news_&_views","title":"Who took which sticky tape samples where and when? 6BD Pictured?"},{"author":"barrie_schwortz","post":"Actually, Whanger was referring to the 1931 Enrie photos. No major photography was done in 1973.","date":"December 21, 2012 at 2:05 pm","url":"https://shroudstory.com/2012/12/16/who-took-which-sticky-tape-samples-where-and-when-6bd-pictured/","cat":"news_&_views","title":"Who took which sticky tape samples where and when? 6BD Pictured?"},{"author":"barrie_schwortz","post":"I believe Dr. Alan Whanger made that statement some years ago, although he was not referring to damage done by tape samples, but rather by rolling and unrolling the Shroud. However, he provided no data to support his claim so it was mainly conjecture.  As for the conversation between Frei and Jackson (with Luigi Gonella acting as referee), it was very heated and was specifically about putting tape ANYWHERE on the face of the image. It ended with the decision that NO ONE would take any tape samples from the face, which is considered the most iconic part of the Shroud image.","date":"December 20, 2012 at 2:50 pm","url":"https://shroudstory.com/2012/12/16/who-took-which-sticky-tape-samples-where-and-when-6bd-pictured/","cat":"news_&_views","title":"Who took which sticky tape samples where and when? 6BD Pictured?"},{"author":"barrie_schwortz","post":"It is quite possible that the sample being discussed was taken in 1973 as Max points out, but I have no information on those samples at all.  However, maybe the questions should be addressed to the man who now holds the Frei collection, Dr. Alan Whanger, or to Paul Maloney, who had the Frei collection and studied it extensively for several years before transferring it to Whanger.  They might be able to provide more accurate information than either Danin or Lucotte. As I said in my earlier post, in 1978 I photographed Frei’s sample taking from beginning to end and, at one point, he did reach to put tape on the Shroud face. It was that moment that John Jackson intervened and physically stopped him from doing so and a moment later I made a well known photo of the resulting confrontation. (See http://www.shroud.com/gallery/thumbnails/5-B-5.jpg). I think the idea that the samples in question might have come from Frei’s 1973 examination makes a lot of sense.","date":"December 16, 2012 at 7:15 pm","url":"https://shroudstory.com/2012/12/16/who-took-which-sticky-tape-samples-where-and-when-6bd-pictured/","cat":"news_&_views","title":"Who took which sticky tape samples where and when? 6BD Pictured?"},{"author":"barrie_schwortz","post":"Sorry for the small thumbnail. Here’s a slightly larger version: http://www.shroud.com/gallery/images/5-B-5.jpg","date":"December 16, 2012 at 7:18 pm","url":"https://shroudstory.com/2012/12/16/who-took-which-sticky-tape-samples-where-and-when-6bd-pictured/","cat":"news_&_views","title":"Who took which sticky tape samples where and when? 6BD Pictured?"},{"author":"barrie_schwortz","post":"Thanks to Dan for remembering our dear friend Fr. Kim Dreisbach. You might also wish to read the memorial we published on shroud.com after his passing. Here is the link: http://www.shroud.com/late06.htm#kim","date":"October 1, 2015 at 3:00 pm","url":"https://shroudstory.com/2015/09/30/i-am-the-onliest-one-who-can-go-and-im-scared/","cat":"people","title":"“I am the ‘onliest’ one who can go, and I’m scared.\""}],"opinion":[{"author":"barrie_schwortz","post":"Don’t forget that Jackson and Jumper’s access to scientists was based on who was readily available to them at Los Alamos and Sandia labs, along with other government facilities like the Air Force Weapons Lab, Air Force Academy and the Jet Propulsion Lab. Consequently, textile experts and iconographers were just not part of the mix.  My own involvement came about because I worked as a photographic consultant on a project for Los Alamos with Don Devan (imaging scientist), who ultimately brought me onto the STURP team based on our working together for 7 months. In the end, I am sure every STURP member would agree that experts in those disciplines would have been very useful. Unfortunately, it just didn’t happen that way. Ray Rogers told me personally how disappointed (and angry) he was in McCrone, who betrayed Rogers’ trust with his actions. I personally believe McCrone had his own agenda, based on conversations I had with him before his death. Maybe I’ll include the details of those conversations in the book I hope to write someday.  Happy Thanksgiving!","date":"November 27, 2013 at 6:24 pm","url":"https://shroudstory.com/2013/11/27/a-guest-posting-by-yannick-clment-solid-as-a-brick-wall/","cat":"guest_posting","title":"A Guest Posting by Yannick Clément: Solid as a Brick Wall"},{"author":"barrie_schwortz","post":"Judging the Tilma’s authenticity on what little I know about it would be very similar to many Shroud skeptics who dismiss the Shroud based on their own limited knowledge! Frankly, there has been very little scientific testing done on the Tilma so there is no database of verified information that one can access as there is with the Shroud.  We still don’t know for sure what material the Tilma is made of!  However, as there is with the Shroud, much misinformation floods the internet about it that perpetuates a Tilma “mythology.” Some of that mythological “evidence” will not withstand scientific scrutiny. Of course, I could not go into that kind of detail in the EWTN interview. The Jerusalem meeting I attended this past July (see http://www.shroud.com/latebrak.htm#3rd3) was my first exposure to any information about the Tilma, so I am truly not qualified to have any opinion. As I said to Anonymous, “I will leave the study of the Tilma to others and be happy to read their conclusions.”","date":"November 27, 2013 at 6:49 pm","url":"https://shroudstory.com/2013/11/27/a-guest-posting-by-yannick-clment-solid-as-a-brick-wall/","cat":"guest_posting","title":"A Guest Posting by Yannick Clément: Solid as a Brick Wall"},{"author":"barrie_schwortz","post":"Hi Mike!  This is a different student who attends the St. Louis Priory school.","date":"July 8, 2014 at 2:54 pm","url":"https://shroudstory.com/2014/07/08/new-documentary-in-the-works/","cat":"other_blogs","title":"New Documentary in the Works"},{"author":"barrie_schwortz","post":"It most certainly would. Thanks Ron!","date":"June 6, 2013 at 3:47 pm","url":"https://shroudstory.com/2013/06/04/the-high-price-of-success-at-stera/","cat":"kelly_kearse","title":"The High Price Of Success at STERA"},{"author":"barrie_schwortz","post":"Thank you Angel!","date":"June 7, 2013 at 6:36 pm","url":"https://shroudstory.com/2013/06/04/the-high-price-of-success-at-stera/","cat":"kelly_kearse","title":"The High Price Of Success at STERA"},{"author":"barrie_schwortz","post":"O.K. :Hello, Barrie, sorry that I post here, but I am interested in obtaining those STURP papers listed here: http://www.shroud.com/78papers.htmIs there any fromal procedure, required, some reference or credentials needed?Hi O.K. – Send me an e-mail for details.","date":"November 27, 2013 at 6:54 pm","url":"https://shroudstory.com/2013/11/27/a-guest-posting-by-yannick-clment-solid-as-a-brick-wall/","cat":"guest_posting","title":"A Guest Posting by Yannick Clément: Solid as a Brick Wall"},{"author":"barrie_schwortz","post":"Amen!","date":"June 8, 2013 at 2:53 pm","url":"https://shroudstory.com/2013/06/04/the-high-price-of-success-at-stera/","cat":"kelly_kearse","title":"The High Price Of Success at STERA"}],"researchers":[{"author":"barrie_schwortz","post":"Paterson, his wife and another man, Tom Dolle, were part of STURP’s support group along with the wives of several other STURP team members, and helped pack and unpack things and provided meals and other support while we were examining the cloth over 5 days and nights, nonstop. They were unpaid volunteers and paid their own expenses. They were not in the room with the Shroud (although they helped to prepare the room before the Shroud was brought to us) and were not part of the scientific investigation. That is one of my photos on Lombatti’s blog as Jumper, Dolle and Paterson attached gold foil mylar to cover the removable steel panels of the Shroud examination table. That was BEFORE the Shroud was brought into the room.  They never appear in any of my photos taken during the 5 day examination because they were not there. They were never considered STURP team members (see the actual list at http://www.shroud.com/78team.htm). Neither was Marge Jumper, Mary Stevenson (the wife of Ken Stevenson) or Patti Lynn (the wife of Don Lynn) and several others, but they all helped loading and unloading the equipment, ran errands, helped administratively, etc. Those are the facts!Sadly, Lombatti resorts to guilt by association to launch another attack on STURP. (If you can’t attack the science, attack the scientists)!  This man had nothing to do with STURP’s scientific mission and, as far as I know, we had nothing to do with him before or afterwards, except in a very peripheral way. I sincerely doubt that anyone on the STURP team had any knowledge of this blog information 35 years ago, or he certainly would not have been there. However, to use that to attack the STURP team and their work 35 years later is disappointing and rather sad. To stoop to such a new low makes me believe the skeptics are truly desperate and grasping at straws!  Frankly, I actually expected better of Lombatti.","date":"June 15, 2013 at 12:39 pm","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","title":"An Antonio Lombatti Poop Dump"},{"author":"barrie_schwortz","post":"Yes, I probably will.  And thank you for the kind wishes!","date":"September 6, 2015 at 12:53 pm","url":"https://shroudstory.com/2015/09/06/barrie-schwortz-to-speak-in-indianapolis-on-september-19/","cat":"presentation","title":"Barrie Schwortz to Speak in Indianapolis on September 19"},{"author":"barrie_schwortz","post":"Actually, the statement about my age is correct. I examined the Shroud as part of the STURP team at age 32, but did not confront my own faith until I was forced to do so 18 years later, at the age 50, so I could answer the questions honestly.","date":"April 21, 2012 at 6:08 pm","url":"https://shroudstory.com/2012/04/21/rosetta-correa-interviews-barrie-schwortz/","cat":"news_&_views","title":"Rosetta Correa interviews Barrie Schwortz"},{"author":"barrie_schwortz","post":"Rogers believed that the Maillard reaction was “absolutely part of the equation” but was not, by itself, the answer to the image on the Shroud. He believed something else was at work in conjunction with it and was planning experiments to test this when he died.","date":"September 13, 2012 at 10:00 pm","url":"https://shroudstory.com/2012/09/13/an-email-from-colin-berry/","cat":"other_blogs","title":"An Email from Colin Berry"},{"author":"barrie_schwortz","post":"Thank you for your kind words! I am glad to hear you found the page so useful. The Shroud Centers & Organizations page was built over the past 18 years and has grown continuously as interest in the Shroud has expanded around the world. The only problem with large numbers of links on a web page, is that links are often changed, moved or deleted over time and it is almost impossible for us to always keep every link up to date (there are thousands on shroud.com). So I really appreciate you letting us know about the broken links you found and making suggestions on how to keep them more current. Whenever anyone finds a broken link on http://www.shroud.com, just send us an e-mail (via the Send Us E-mail page at http://www.shroud.com/email.htm) with the broken link copied into the text, along with the specific page upon which the link was found. We’ll take it from there! Thank you again for helping us make the website more complete and accurate. Watch for the next website update on December 14th.","date":"December 7, 2013 at 3:00 pm","url":"https://shroudstory.com/2013/12/07/thanks-to-joe-marino-and-barrie-schwortz/","cat":"news_&_views","title":"Thanks to Joe Marino and Barrie Schwortz"},{"author":"barrie_schwortz","post":"“A Significant Criticism?”  Really?  I had promised myself I would spend no more time answering the unfounded claims of Dan Porter’s favorite skeptic, but once again, I find an obviously unresearched post filled with inaccuracies and ad hominem attacks being given a prominent place on this blog under an equally offensive headline. Under those circumstances, I cannot just sit here with my mouth shut while this skeptic’s claims are promoted as “significant.”Maybe the simplest way to dispute these false claims is to look at the members of the STURP team themselves. Who were they and what was their expertise?Don Lynn of NASA’s Jet Propulsion Laboratory (JPL) was director of imaging on the Voyager, Viking, Mariner and Galileo projects and probably the top imaging expert on our team. Jean Lorre was also an imaging specialist at JPL who continued working on NASA and SETI imaging projects until his untimely death in 2005.Vern Miller was the Chief Scientific photographer for STURP and had spent many years working in the aerospace industry as a scientific photographer before coming to Brooks Institute to teach in 1970. Ernest Brooks was the president and owner of Brooks Institute and an acknowledged professional photographer in his own right.  Mark Evans was a graduate student at Brooks who specialized in microscopy and still works as an ophthalmologic microscopist and research photographer to this day.Don Devan was an imaging specialist at Oceanographic Services, Inc. In fact, his organization hired me as a photographic consultant for a seven month imaging project their company was doing for Los Alamos National Laboratory in 1976 (before STURP). It was Don Devan who eventually enlisted my participation in the Shroud project after we completed the Los Alamos research.Joseph Accetta (Lockheed), Steve Baumgart (Air Force Weapons Laboratory) and Tom Haverty (Rocky Mountain Thermograph) were infrared imaging specialists doing most of their work for various government organizations. Their work on the Shroud was excellent but hampered by the limited sensitivity of the infrared sensors circa 1978.Bill Mottern (Sandia Laboratory), Ron London and Roger Morris (both from Los Alamos National Laboratory) were radiographic experts, a critically important form of imaging that we applied to the Shroud.Frankly, I was probably the LEAST qualified of all the imaging people on the STURP team.As for the nonsensical statement the skeptic made about STURP ignoring the negative aspects of the Shroud image, that property was well known and documented since 1898 when Secondo Pia first made that claim, and which was further corroborated by Giuseppe Enrie when he again photographed the Shroud in 1931. Remember that the primary goal of the STURP team was to characterize the properties of the image on the Shroud. The negative aspects of the Shroud image were just one of the many unique image properties that were taken into account and integrated into all of our imaging experiments and was certainly mentioned in some of our imaging papers.  So I guess we are being criticized for simply not re-stating the obvious! If the skeptic had taken the time to look at the list of STURP team members and their affiliations (http://www.shroud.com/78team.htm), he would have discovered that NEARLY HALF the team members who went to Turin to gather the data in 1978 were involved in some form of imaging! That is a FACT.I have no interest (or intention) of debating anyone on this topic as the facts speaks for themselves. Perhaps a better name for this article would be “An INsignificant Criticism!” Enough said!","date":"July 30, 2014 at 5:32 pm","url":"https://shroudstory.com/2014/07/30/a-significant-criticism-of-sturp/","cat":"other_blogs","title":"A Significant Criticism of STURP"},{"author":"barrie_schwortz","post":"Charles, it is my understanding that cotton was interwoven with the linen because it accepts the dyes more readily than linen, which needs to first be treated with a mordant (made of aluminum hydroxide I believe).","date":"August 7, 2014 at 10:34 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"},{"author":"barrie_schwortz","post":"He can’t. He’s dead.","date":"February 16, 2015 at 7:31 pm","url":"https://shroudstory.com/2015/02/16/walter-mccrone-art-experts-should-not-weigh-in/","cat":"uncategorized","title":"Walter McCrone:  Art Experts Should Not Weigh In"},{"author":"barrie_schwortz","post":"That’s not quite correct Charles. Jim Drusik of the Los Angeles County Museum was a formal member of the STURP team and participated in the planning of our experiments before we left and in the evaluation of the data after we returned. STURP was a scientific research group so instead of calling an art expert, they acquired a database of the spectral characteristics of every paint, pigment and binder used from medieval to modern times and performed careful spectral analyses across the entire Shroud. They found no traces of paint, pigments or binders. It’s called SCIENCE.","date":"February 16, 2015 at 8:15 pm","url":"https://shroudstory.com/2015/02/16/walter-mccrone-art-experts-should-not-weigh-in/","cat":"uncategorized","title":"Walter McCrone:  Art Experts Should Not Weigh In"}],"resources":[{"author":"barrie_schwortz","post":"Great to see an article about Ernie Brooks!  He put the full resources of Brooks Institute behind the STURP photographic efforts and contributed greatly to our success. Also, Mark Evans, who was responsible for STURP’s photomicroscopy experiments, was a graduate student at Brooks Institute at the time.","date":"May 8, 2014 at 6:15 pm","url":"https://shroudstory.com/2014/05/08/ernie-brooks-of-sturp/","cat":"article","title":"Ernie Brooks of STURP"},{"author":"barrie_schwortz","post":"I guess it depends on what you define as true. With the exception of Kelly Kearse, who often posts to this blog and is himself an expert in DNA and blood, there is no one in this group of bloggers as qualified as Adler was to draw those conclusions. He was a brilliant blood chemist, knew exactly what he was doing and he studied the actual blood of the Shroud. He was also one of the other Jewish members of the STURP team, so he had no pro-authenticity agenda and was only interested in analyzing the samples using the tests that were available to him and doing good chemistry. In my opinion, he did.","date":"March 28, 2015 at 9:06 pm","url":"https://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/","cat":"article","title":"Is Bilirubin Still Accepted as an Explanation for the Red Blood?"},{"author":"barrie_schwortz","post":"Good question Hugh, but perhaps it is a moot point. Pellicori was an optical physicist (an expert in optics and lenses) who actually designed and built one of the instruments we used to examine the Shroud in 1978. In my opinion, his personal observation of a single thread or fiber has no more bearing on the chemical analyses done by Adler than the comments on this blog. My money is still on Adler.","date":"March 28, 2015 at 9:32 pm","url":"https://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/","cat":"article","title":"Is Bilirubin Still Accepted as an Explanation for the Red Blood?"},{"author":"barrie_schwortz","post":"The Orphaned Manuscript will be published in our next website update in late April or early May, along with the final two issues of Shroud Spectrum International.","date":"March 29, 2015 at 11:29 am","url":"https://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/","cat":"article","title":"Is Bilirubin Still Accepted as an Explanation for the Red Blood?"},{"author":"barrie_schwortz","post":"Adler had to work with microscopic particles of blood lifted from the Shroud by Rogers’ tape samples. I am sure that was a limitation not encountered by Dr. Carter in his work. Also, we know the samples he tested were at least 700 years old. Adler was extremely cautious about making claims for the blood and even referred to it as “primate” blood rather than human. This was noted again in a recent posting by Kelly Kearse who explained that the more sophisticated tests in use today were not available to Adler in 1978. I think everyone agrees that new testing should be done at some point in the future that could answer these questions more completely.","date":"March 29, 2015 at 11:41 am","url":"https://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/","cat":"article","title":"Is Bilirubin Still Accepted as an Explanation for the Red Blood?"},{"author":"barrie_schwortz","post":"Sorry Hugh. Adler never said that the bilirubin is what made the blood still red. He explained to me that bilirubin was a hemolytic agent that broke down the cell walls of the red blood cells releasing hemoglobin, which is what caused the blood stains to remain red.","date":"March 28, 2015 at 8:33 pm","url":"https://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/","cat":"article","title":"Is Bilirubin Still Accepted as an Explanation for the Red Blood?"},{"author":"barrie_schwortz","post":"I agree David. In fact, I believe Turin agrees as well. See the paper by Bruno Barberis, president of the Turin Center for the Study of the Shroud, which was presented at the Valencia Conference in 2012. It was titled Perspectives for the Future Study of the Shroud. Here’s the link: http://www.shroud.com/pdfs/barberisv.pdf. It would require creating a new group of independent researchers, formulating a comprehensive test plan and submitting it to the authorities for review and approval. That’s exactly what STURP did in 1978.","date":"March 29, 2015 at 12:17 pm","url":"https://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/","cat":"article","title":"Is Bilirubin Still Accepted as an Explanation for the Red Blood?"},{"author":"barrie_schwortz","post":"I mention this story in my lectures and interviews because it was that conversation with Adler that ultimately tipped me towards accepting the Shroud’s authenticity. I already knew the image was not a painting, scorch or photograph but until Adler and I had that conversation, the reddish color of  the blood was a  stumbling point for me (and Vern Miller as well). That conversation took place about seven years before I learned of Rogers’ work with Sapponaria, so I now mention both in my lectures.","date":"March 29, 2015 at 11:50 am","url":"https://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/","cat":"article","title":"Is Bilirubin Still Accepted as an Explanation for the Red Blood?"},{"author":"barrie_schwortz","post":"Alan Adler was a noted blood chemist, a member of STURP and he directly examined the blood on the Shroud and performed microchemical analysis on the samples. He published his work in credible scientific journals.  His conclusions were anything but hunches.","date":"March 28, 2015 at 8:29 pm","url":"https://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/","cat":"article","title":"Is Bilirubin Still Accepted as an Explanation for the Red Blood?"},{"author":"barrie_schwortz","post":"Yes, that is correct. I was raised in an Orthodox Jewish home. However, if I could answer your second question with any authority I could stop doing this and go do something else! I know what the image is NOT. I still do not have any idea of what mechanism can create an image with the same chemical and physical properties as the image on the Shroud. But I’ve only been doing this for 38 years. Maybe next year…","date":"March 28, 2015 at 8:47 pm","url":"https://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/","cat":"article","title":"Is Bilirubin Still Accepted as an Explanation for the Red Blood?"},{"author":"barrie_schwortz","post":"Sadly, Diana Fulbright is extremely ill and has been unable to get us the paper to include on the page. Perhaps Paolo can send it to us?","date":"April 21, 2015 at 3:45 pm","url":"https://shroudstory.com/2015/04/21/retracted-papers/","cat":"article","title":"Retracted Papers"},{"author":"barrie_schwortz","post":"In June 2014 we published several articles relating to the Carpinteri paper. Here’s the link to our article: http://www.shroud.com/late14.htm#quake.  It includes further links to papers by archaeologist Jeff Williams and Shroud researcher John C. Iannone. Williams’ paper was originally published in 2011 in International Geology Review and can be found on Academia.edu at this link: https://www.academia.edu/6108262/Quake_Article.  Iannone’s paper is at: http://www.shroud.com/pdfs/iannoneearthquake.pdf.","date":"April 21, 2015 at 3:53 pm","url":"https://shroudstory.com/2015/04/21/retracted-papers/","cat":"article","title":"Retracted Papers"},{"author":"barrie_schwortz","post":"The sole purpose of the tests performed by STURP was to determine the image formation mechanism of the Shroud. It was NEVER to prove it was “authentic” or even that it wrapped the body of Jesus. Had that been the case, many of the team members would not have participated. Any such comments made by individual team members after the fact do not necessarily represent the consensus of the STURP team.","date":"February 13, 2015 at 3:52 pm","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","title":"Two More Articles About Upcoming CNN Series on Finding Jesus"},{"author":"barrie_schwortz","post":"Actually, there were 3 or 4 Catholics, 3 Jews, 1 Mormon, 1 Evangelical, some Protestants of various denominations in addition to some agnostics (and perhaps even some atheists). Since declaring one’s religious affiliation was never a prerequisite for membership in the STURP team, we don’t have an accurate list. Members were asked to join the team based solely on their scientific or technical skills and what they could contribute to the scientific examination of the Shroud.","date":"April 20, 2014 at 3:36 pm","url":"https://shroudstory.com/2014/04/20/wayne-phillips-hopes-to-create-a-small-shroud-army/","cat":"press_coverage","title":"Wayne Phillips:  Hopes to create a small “Shroud Army”"},{"author":"barrie_schwortz","post":"Here is the link to our August 31, 2013 announcement of the English language edition of the book: http://www.shroud.com/latebrak.htm#booklist3","date":"October 31, 2013 at 4:08 pm","url":"https://shroudstory.com/2013/10/31/new-book-about-christs-relics-from-ignatius-press/","cat":"books","title":"New Book About Christ’s Relics from Ignatius Press"},{"author":"barrie_schwortz","post":"The least common of all the senses!","date":"July 30, 2015 at 3:57 pm","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Catholic Radio Indy"},{"author":"barrie_schwortz","post":"The VP-8 was purchased by William Mottern of Sandia Laboratories from Interpretation Systems to use in the examination of the x-rays they were making at the lab. Bill felt it was another way to extract image data from nearly monochromatic x-rays. He originally saw the VP-8 advertised in a trade journal and bought one. Shortly after the Shroud image was placed into Bill’s VP-8, Jackson and Jumper purchased one for STURP’s use and the man who came to install it was Pete Schumacher, founder of the New Mexico Shroud Museum in Alamogordo.Two of our team members were from the Jet Propulsion Laboratory and were directly involved in the space program. Don Lynn was in charge of imaging on the Voyager, Viking, Mariner and Galileo projects. At some point in time, some journalist out there wrote erroneously that the VP-8 was used in the space program and it seems to have stuck and become part of Shroud “mythology.” JPL had far more sophisticated technology than the VP-8.As for Frei, his work can only be considered anecdotal at best and is not supported by any peer reviewed science. There is a lot more I could say about this, but this post is already longer than I like, so we’ll just leave it there for now.","date":"March 28, 2014 at 7:59 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"author":"barrie_schwortz","post":"I never said that Frei’s work was worthless. I only stated that his claims were not backed up by peer reviewed science or published in any credible journals, making them anecdotal at best. This was not an attack on Frei but simply a statement of fact. It has NOTHING to do with whether or not he was a member of STURP. Sadly, it was Frei’s own actions, both during and after the 1978 examination, that led to doubts about his methods and conclusions. As an example, for many years those of us who lectured on the Shroud used a 35mm slide in our presentations that Frei himself had provided to us, claiming it was a scanning electron microscope image of a pollen he found on the Shroud. It wasn’t until several years later that we found out it was in fact a reference slide and not a pollen from the Shroud at all. It was then that many of us stopped discussing the pollen issue publicly and removed it from our presentations. I believed then as I do now, that there is plenty of other credible empirical evidence for the Shroud’s authenticity within the published scientific literature and we should not have to resort to unsupported anecdotal evidence to make our points. It is easy to accept and defend information that supports our personal beliefs whether it is credible or not, and ALL of us are susceptible to such errors in judgement. Unfortunately, this happens all too frequently in the Shroud world and has the negative side effect of making all Shroud science seem suspect while giving plenty of ammunition to the skeptics out there to attack us. Sorry you were offended O.K. but the truth is the truth (not arrogance). Remember, it was my responsibility to observe and document these events as they occurred.","date":"March 29, 2014 at 5:51 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"author":"barrie_schwortz","post":"Rogers did not own the journal. He was simply one of its founding members but retired from any involvement with it years before he submitted his paper to it for publication. The editors spent 5 months (much longer than normal) reviewing Rogers’ paper and asking for changes and corrections before accepting it for publication.","date":"March 29, 2014 at 6:23 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"author":"barrie_schwortz","post":"My single biggest objection to the 2002 restoration was the fact that NO scientists were involved. It didn’t matter one bit whether they were American, Italian, French or otherwise (and there were plenty of good ones available in Italy). Is no one else concerned that for 12 years a completely untested piece of cloth has been fastened to the back of the Shroud? Let’s not turn this into an issue of nationalism. It is not about that!","date":"March 29, 2014 at 6:51 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"author":"barrie_schwortz","post":"Perhaps the Polish translation of the interviews I gave Gorny in English are incorrect. I never said the image had faded. I said that the lighter cloth behind the Shroud lowered the APPARENT CONTRAST of the image. That is completely different and something that professional photographers know about. Did you see the Shroud in 2010? Have you compared the Durante post-restoration images with those of Vern Miller or myself? The evidence speaks for itself.It sounds like I am going to have to carefully examine the English version of the book to make sure it is accurate before it is released to the public. Thanks for the heads up O.K.","date":"March 29, 2014 at 8:03 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"author":"barrie_schwortz","post":"Correct. I do mention it now when I lecture, but I did not have that information in 1995 when I spoke with Adler.  In the speech I was simply relaying the story as it occurred chronologically. Thanks for the kind words too!","date":"May 4, 2013 at 3:46 pm","url":"https://shroudstory.com/2013/05/03/barrie-schwortz-tedx-via-della-conciliazione-talk/","cat":"science","title":"Barrie Schwortz’ TEDx Via della Conciliazione Talk"}],"textile":[{"author":"barrie_schwortz","post":"Thanks everyone!  I sent the viewer a link to this page so he could read your comments.","date":"July 23, 2013 at 8:21 pm","url":"https://shroudstory.com/2013/07/23/max-anyone-thread-count-for-the-shroud-of-turin/","cat":"science","title":"Max? Anyone? Thread count for the Shroud of Turin"}]}
