{"misc":[{"author":"barry_fleckmann","post":"I can certainly understand that True Believers WANT this Shroud of Turin to be the authentic burial cloth of Christ.  However, I am NOT one of them.  This was proven to be a fake, phony and a fraud, in 1988, by means of carbon dating.  CASE CLOSED!","date":"March 27, 2010 at 10:27 am","url":"https://shroudstory.com/2009/02/21/shroud-of-turin-shows-another-mystery-face/","cat":"news_&_views","title":"Shroud of Turin shows another mystery face"},{"author":"barry_fleckmann","post":"Hey, WHATEVER fits YOUR needs.  WHATEVER floats YOUR boat.  Comedian George Carlin called God (Jesus?), “The Invisible White Man in the Sky.”  Outside of the Shroud of Turin, there is NOTHING that exists to prove that Jesus EVER lived.  The story of Jesus belongs in Aesop’s Fables, and Grimm’s Fairy Tales.  Believing, brings people comfort.  I know that.  More power to ’em!  I’m an Atheist, but I love Christmas!!  The decorations!  Even the Nativity Scene!  It’s a BEAUTIFUL story!  Easter is coming, I’m gonna’ bring baskets of candy to my friends!  Yeah, I’ll help the cash registers turn!!  However, our home planet, Earth, has been here for about eight billion years.  Organized religion?  About two thousand years.  DO THE MATH!!!!!!!!!!!!!!!!!!!!!!!!!!!","date":"March 27, 2010 at 4:31 pm","url":"https://shroudstory.com/2009/02/21/shroud-of-turin-shows-another-mystery-face/","cat":"news_&_views","title":"Shroud of Turin shows another mystery face"},{"author":"barry_fleckmann","post":"Okay, Episcopalian, since YOU are too lazy to do the math, I’ll do it for you.  Draw a straight line across a blackboard, we’re going to make a timeline.If we place the creation of the earth (4.5 billion years, 8 billion years, twenty billion years, WHATEVER!), at the far left side of the timeline, where would we put the creation of organized religions (okay, we’ll leave out Christianity, it’s too recent)?  On the FAR right side of the timeline, THAT’S where.Somewhere in the middle of the timeline, we’re going to put the rise and fall of the dinosaurs, even though organized religion (The Bible, Old Testament) tell us that they were never, here.It’s funny, but bones, fossils and footprints tell a far different story, but Moses and the Burning Bush are our final authority on this subject (he says with tongue pressed firmly in cheek!).So, HOW does organized religion get around this HUGE disparity in time when it comes to Creation?It tells us that the age of the earth is six thousand years, that’s how.You know, Moses, the Burning Bush, God, Adam and Eve, the Serpent, Noah and the rest of Grimm’s Fairy Tales.Yup, I AM a non-thinking, fundamentalist Atheist, and proud to be one, too!!!I can SURE distinguish between history and hokum, though!!","date":"March 28, 2010 at 8:30 am","url":"https://shroudstory.com/2009/02/21/shroud-of-turin-shows-another-mystery-face/","cat":"news_&_views","title":"Shroud of Turin shows another mystery face"}]}
