{"art":[{"author":"chrisfromdallas","post":"Glad you’re back Dan and that it went well. All the Best – Chris","date":"June 12, 2011 at 10:44 am","url":"https://shroudstory.com/2011/06/12/another-renaissance-artist-theory-for-the-shroud-of-turin/","cat":"art","title":"Another Renaissance Artist Theory for the Shroud of Turin"}],"image":[{"author":"chrisfromdallas","post":"I agree with your argument from a logical viewpoint. But Yannick, this isn’t just about logic, its about the emotions of the people who knew and loved Jesus. Was it logical to place flowers (and coins?)  before completion of the burial rite, no; was it practical, certainly not. But when leaving the resting place of a loved one, how many of us wish to express what we’re feeling toward that person?","date":"October 19, 2011 at 10:12 am","url":"https://shroudstory.com/2011/10/19/comment-promoted-of-coins-and-flowers-and-more-on-the-shroud-of-turin/","cat":"image_theory","title":"Comment Promoted: Of Coins and Flowers and More on the Shroud of Turin"},{"author":"chrisfromdallas","post":"Fair enough – but again you are deflecting from the real issue here. One more time Colin, do you or do you not agree that the absence of image fibres underneath the blood stains presents a real problem for the heated template hypothesis?","date":"February 20, 2012 at 10:28 am","url":"https://shroudstory.com/2012/02/19/i-dont-get-it-writes-a-reader-about-colin-berrys-hypothesis/","cat":"image_theory","title":"I don’t get it, writes a reader about Colin Berry’s Hypothesis"},{"author":"chrisfromdallas","post":"Sorry, to clarify from my previous post, this is in the context that surely it would have been much easier for a forger to first imprint the image and then apply the blood. Any other approach would be impractical.","date":"February 20, 2012 at 10:52 am","url":"https://shroudstory.com/2012/02/19/i-dont-get-it-writes-a-reader-about-colin-berrys-hypothesis/","cat":"image_theory","title":"I don’t get it, writes a reader about Colin Berry’s Hypothesis"},{"author":"chrisfromdallas","post":"colinsberry :Why should it be a real problem just because someone decided to do something in one order rather than another? Are you a mind reader – able to read the mind of your distant forbears? I certainly am notColin, of course its a problem and I have to say I’m really surprised that you dismiss this in such an offhanded way. You mentioned Ray Rogers making a brief statement (ref http://www.shroud.com/pdfs/rogers5faqs.pdf)  to the effect that the blood could not have been heated since it “.. still evolves hydroxyproline on mild heating”. In the same reference he goes on to say “.. and the cellulose crystals are largely undistorted. Image and control fibers show identical crystal properties. The image is not a scorch. The cloth was not heated, not even boiled in oil.” This presents an important fact about the composition of the blood and one that directly contradicts the bas relief hypothesis. Rogers goes further:  “The image-formation mechanism did not damage, denature, or char the blood. The blood can be removed with a proteolytic enzyme. The blood produced hydroxyproline at low temperatures in the pyrolysis/ms spectra. It was never heated significantly. Image formation had to be a low-temperature process.” For the bas relief hypothessis to be tenable Ray Rogers had to be wrong.  Was he?","date":"February 20, 2012 at 11:54 pm","url":"https://shroudstory.com/2012/02/19/i-dont-get-it-writes-a-reader-about-colin-berrys-hypothesis/","cat":"image_theory","title":"I don’t get it, writes a reader about Colin Berry’s Hypothesis"},{"author":"chrisfromdallas","post":"The absence of any image beneath the blood stains is a knockout blow for the heated bas relief hypothesis in my opinion. Had the blood been present on the cloth during application of the heated template this would have lead to its thermal degradation, at least to a point where this would be detectable through microscopic and spectroscopic analysis. No such decomposition has been found, apart from the areas damaged by the 1532 fire and a number of other post-image formation incidents. Accepting this, the only possibilities left are that the template was cut to ‘skirt’  any areas where the blood would be later applied. Alternatively, after application of the blood to the cloth, perhaps this was shielded, using some technique, from the heat of the bas relief. For either option though , you have to ask why on earth would a medieval forger do such a thing when he can far more easily imprint the image and then overlay the blood. He gains absolutely nothing by complicating things in this way. Certainly, his intended victims would not know the difference.Coupling this with the anatomically correct antemortem and postmortem blood flows with discolorations and the high bilirubin content due to trauma, you’d have to say it is very unlikely that a forger could have just trickled blood to the appropriate parts of the cloth. Why would he bother go to these lengths since as we know medical knowledge was very limited at the time?","date":"February 20, 2012 at 2:10 am","url":"https://shroudstory.com/2012/02/19/i-dont-get-it-writes-a-reader-about-colin-berrys-hypothesis/","cat":"image_theory","title":"I don’t get it, writes a reader about Colin Berry’s Hypothesis"},{"author":"chrisfromdallas","post":"@sciencebod #7 – You said “Shame too that the house-that-Jackson-built is riddled with woodworm and dry rot in the form of flaws, omissions and contradictions.” That’s always a possibility and that’s why it should be critiqued, though objectively, and preferably using scientific terms. You’ve eluded the questions in my last posting, which is a bit of a disappointment. I’d still like to know on what basis you justify asserting on your website the Shroud image was formed through heat imprinting from a template.","date":"January 27, 2012 at 11:22 am","url":"https://shroudstory.com/2012/01/26/sciencebod-reacts/","cat":"image_theory","title":"Sciencebod reacts"},{"author":"chrisfromdallas","post":"I read the points on sciencebod’s site and was astounded, not by the skepticism, but because of the misinformation conveyed. I’m always willing to listen to the arguments of skeptics, after all it is the truth that is ultimately important no matter where it leads us. And good quality counter arguments are important to keep the science research and views on the Shroud credible. sciencebod has chosen to ignore the works of John Jackson who demonstrated comprehensively that a heated base relief could not have been used to create the Shroud of Turin image. He has also chosen to ignore the forensics examinations carried out by a number of leading medical experts. He’s also ignored the findings of Heller and Adler on the constitution of the blood stains. What about the conclusions of textile expert Mechthild Flury-Lemberg who said the cloth is likely 1st century? The list goes on.sciencebod, if you really mean to critique the science on the Shroud in an objective, open minded and fair manner, you have to do significantly better than this, .. and I’m sure you can. Sadly, from what I’ve seen so far you’re just one of the many who contribute to the spreading of misinformation on the internet.  So what do you really stand for sciencebod?","date":"January 26, 2012 at 3:26 pm","url":"https://shroudstory.com/2012/01/26/sciencebod-reacts/","cat":"image_theory","title":"Sciencebod reacts"},{"author":"chrisfromdallas","post":"sciencebod, you astound me again. And yet you complain about ad hominem attacks on this site. Anyway, that’s not important. What is important is your assertion in points 1 and 2 on your website that the Shroud image was formed through heat imprinting from a shallow bas relief template. John Jackson’s work tried to replicate such a process and to summarise these were the findings:1. The resulting image didn’t yield a consistent high resolution. There were hollow spots round the eyes, bridge of the nose etc. Garlaschelli’s replication effort had the same problem.2. Regardless of the temperature of the bas-relief, thermal discoloration appeared after a few seconds.3. The superificiality of the image found on the Shroud could not be replicated. The scorch extended several layers into the thread, instead of the outermost fibrils.4. All efforts to increase the scorch time (by wetting the cloth for example) resulted in distorted images with reduced contrast.5. Any blood stains would undergo thermal decomposition on contact with the surface of the bas-relief. (Remember, there is no image underneath the blood on the Shroud. You could counter that a forger made a template to ‘skirt’ the bloodstains – but why would he do that? And surely such a process would be detectable under the microscope?) Another problem is that wouldn’t an image produced by heat scorching fluoresce under UV light? The Shroud body image does not fluoresce under UV light but scorches like the burns from the 1532 fire do.sciencebod, I would like to know why you assert that heat imprinting was used given these problems? Really, I am interested. As I said before I want to listen to the opposing view, so long as this is backed up by arguments that are objective, factually correct and scientific.  References to Jacksons work can be found at http://www.shroud.com/78papers.htm","date":"January 27, 2012 at 1:50 am","url":"https://shroudstory.com/2012/01/26/sciencebod-reacts/","cat":"image_theory","title":"Sciencebod reacts"}],"misc":[{"author":"chrisfromdallas","post":"Nicely done Dan. In the most recent comments, it may also be useful to give the first couple of words of the posting. This is used in a lot of blogs and is a nice feature for navigation, especially if there are a lot of comments.","date":"February 18, 2012 at 10:59 am","url":"https://shroudstory.com/2012/02/18/details-just-in-case-you-wanted-to-know/","cat":"off_topic","title":"Details, just in case you wanted to know"}],"opinion":[{"author":"chrisfromdallas","post":"If Barbet is correct, as clearly you believe he is, then what does that mean for the original question posed in this blog? What’s your opinion regarding the stigmata with Padre Pio?","date":"January 11, 2012 at 11:03 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"}]}
