{"art":[{"author":"david_o","post":"Russ…According to The Masada Myth by Nachman Ben-Yehuda of Hebrew University, two women and five children survived the Roman siege of Masada.  Apparently, they hid in a water cistern!","date":"July 23, 2014 at 10:03 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"},{"author":"david_o","post":"The resulting work of Professore Ferri’s is stunningly beautiful!  In my view, an artistic masterpiece!  Does the Holy Shroud Guild make these slides available?  Thanks to Giorgio for finding these gems and alerting them to us.","date":"February 7, 2015 at 1:07 pm","url":"https://shroudstory.com/2015/02/07/wonderful-pictures-of-artist-lorenzo-ferri-and-his-work/","cat":"art","title":"Wonderful Pictures of Artist Lorenzo Ferri and His Work"}],"dating":[{"author":"david_o","post":"” I can’t explain this without a material body.”  After His Resurrection, Jesus appeared to 10 of His disciples (sans Thomas) and said;  “Behold my hands and my feet, that it is I myself: handle me and see; for a spirit hath not flesh and bones as ye see me have.  And when He had thus spoken, He showed them His hands and His feet.” Luke 24:39-40.  Sampath, you will not be able to explain many things about God.  They are far deeper than our small minds can comprehend.  It is clear Jesus was referring to His material body.  It was transformed (metamorpho).  No need to search for something other than what the text plainly tells us.","date":"September 18, 2014 at 10:03 am","url":"https://shroudstory.com/2014/09/16/and-interview-with-lind-and-antonacci/","cat":"carbon_14_dating","title":"An Interview with Lind and Antonacci"}],"events":[{"author":"david_o","post":"To all you Shroudies out there, it would be worth your effort to visit Richard’s museum in Wabash.   The building it is housed in is of a ‘grand’ design and the artifacts on display are as vast in number as they are unique in the world of Sindonology.  With the Honeywell Golf Course next door, a warm weather trip would enable you to get in a quick round while at the same time immersing yourself with Richard’s very extensive Shroud collection.  Do yourself a favor.  You WON’T be disappointed!","date":"January 1, 2015 at 10:01 am","url":"https://shroudstory.com/2015/01/01/the-wabash-museum-of-the-holy-shroud/","cat":"exhibition","title":"The Wabash Museum of the Holy Shroud"}],"history":[{"author":"david_o","post":"John…..(re:)  “I believe the LeCari remembrance is pretty clear on that.”  I believe you meant de Clari as in Robert de Clari, the French knight who chronicled what you are referring to.","date":"June 4, 2015 at 9:59 am","url":"https://shroudstory.com/2015/06/04/picture-for-today-shroud-on-the-steps-of-the-cathedral-by-enrie-1931/","cat":"history","title":"Picture for Today:  Shroud on the Steps of the Cathedral by Enrie, 1931"},{"author":"david_o","post":"John Dominic Crossan is one of the more noted biblical scholars (so-called), who participated in the highly controversial Jesus Seminar discussions of the 80’s and 90’s.  What were some of the Jesus Seminar’s conclusions?  According to the seminar, “Jesus was a mortal man, born of two human parents who DID NOT perform nature miracles, NOR die as a substitute for sinners NOR rise bodily from the dead.  Sightings of a risen Jesus were NOTHING MORE than the visionary experiences of some of his disciples rather than physical encounters” (Jesus Seminar-Wikipedia).  Crossan and those of his kind are nothing more than ‘heretics’ who dismiss the historicity of the Bible and the veracity of Scripture.  Serious Biblical scholars (and Sindonologists), should not waste their time debating historical revisionists who make outlandish, nonsensical claims and are purveyors in sensationalism!","date":"January 7, 2015 at 11:26 am","url":"https://shroudstory.com/2015/01/07/we-also-have-the-shroud-of-turin/","cat":"history","title":"We also have the Shroud of Turin"}],"image":[{"author":"david_o","post":"Colin……Your Revolver reply to Paulette is hilarious.  I’m a big Beatle fan and particularly enjoy John Lennon’s take of this song.  Though I most often don’t share your views on the Shroud, your response here has provided some much needed light-hearted relief to the far-too-often negative responses sadly given in this increasingly acrimonious debate.  Thanks!","date":"September 25, 2014 at 11:06 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"author":"david_o","post":"Those of us in St. Louis for the Shroud conference last October remember the standing ovation Robert A. Rucker received after presenting his paper.  He was immediately rushed by many in the room in order to obtain a copy of it.  I would encourage those of this blog to read it.","date":"July 17, 2015 at 9:25 am","url":"https://shroudstory.com/2015/07/17/another-reaction-to-ray-rogers-paper-on-radiation/","cat":"image_theory","title":"Another Reaction to Ray Rogers’ Paper on Radiation"}],"misc":[{"author":"david_o","post":"aljones 909 wrote:  “Benford is a total kook…..”  I had the privilege of meeting Sue Benford and getting to know her a bit.  It angers me that there are those out there who would use such a disrespectful term (total kook) to describe one with whom they might disagree.  Whatever you may think of her Shroud-related work, she WAS NOT a “total kook”.  Joe Marino (her husband), is too much of a gentleman to tell you what he might feel regarding such a disparaging description and characterization of his wife.  Sue, who was a lady cannot, because she is not here to defend herself.  Therefore I will.  You owe the man an apology!","date":"January 20, 2015 at 10:08 am","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","title":"Jeffrey Skurka on Buffalo Catholic Radio Station"},{"author":"david_o","post":"What a wonderful historic picture!  Unless some of the onlookers are plain clothes cops (which I doubt), there appears to be virtually no security visible.  Today, the Shroud is encased in bullet-proof glass and is guarded around-the-clock 365 days of the year.  How times have changed.  Though it’s not readily discernible because it is covered, does anyone know if the Shroud is being transported in its silver, bejeweled reliquary in this picture?  It appears to have similar dimensions (i.e. rectangular).","date":"January 20, 2015 at 9:44 am","url":"https://shroudstory.com/2015/01/20/picture-tweet-of-the-day/","cat":"news_&_views","title":"Picture Tweet of the Day"},{"author":"david_o","post":"“So far, some elements seem to be clear: the scientific results have let say with certainty that the image was produced through a natural process that involved the body of a human being.”The imaged was produced through a natural process with CERTAINTY?  I beg to differ.  I don’t think so.","date":"August 6, 2014 at 9:20 am","url":"https://shroudstory.com/2014/08/06/scientific-conference-on-the-shroud-of-turin/","cat":"news_&_views","title":"Scientific Conference on the Shroud of Turin"},{"author":"david_o","post":"Barrie…….As usual, we in the Shroud crowd owe you a debt of gratitude for all the time you put in managing shroud.com, as well as the enormous contributions you continually make in the world of sindonology.  A Personal Report on the 2014 St. Louis Conference being just one of them.  Thanks!","date":"December 2, 2014 at 3:04 pm","url":"https://shroudstory.com/2014/12/02/the-neutron-conference/","cat":"news_&_views","title":"The Neutron Conference"}],"researchers":[{"author":"david_o","post":"Russ…….Bravo!  Spot on!  Once again, you carry the ball and do not fumble.  Concise…to the point…highly informative.  The Light in the tomb…….the Shekinah Glory of the Lord!  Keep up the good work!","date":"December 14, 2014 at 3:38 pm","url":"https://shroudstory.com/2014/12/14/russ-breault-the-shroud-of-turin-in-fifteen-minutes/","cat":"uncategorized","title":"Russ Breault: The Shroud of Turin in Fifteen Minutes"}],"resources":[{"author":"david_o","post":"Well said Leon re: Mr. Nickell’s tired argument(s).  The problem is….what he knows is falsehood….perpetuated time and time again because of intellectual dishonesty!  Seekers of truth need to continue moving ahead of disproven ‘naysayers’ whose tired old arguments do little (nothing) to further Shroud study and research.","date":"March 9, 2015 at 10:29 am","url":"https://shroudstory.com/2015/03/09/crocumentaries/","cat":"article","title":"Crocumentaries"},{"author":"david_o","post":"O.K.  You take great leaps in your comments.  Using words like “denounce, worthless, and condemned indiscriminately”  to describe S.T.U.R.P. views of other researchers (Max Frei) amount to nothing more than emotional hooey.  I know of a Jewish man who has investigated the Shroud.  His name is Barrie Schwortz and he has as much authority to speak on the Shroud as anyone in the world.  You may disagree with him or other members of S.T.U.R.P.  However, to proclaim your disgust with arrogant attitudes of former members is worthless diatribe.  Keep your comments civil and respectful…and don’t ascribe your views to reflect those with whom you may disagree.","date":"March 29, 2014 at 9:53 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"author":"david_o","post":"“…..and she brought forth her FIRSTBORN son.  And she wrapped Him in swaddling cloths and laid Him in a manger because there was no room for them at the inn.” (Luke 2:7)  When interpreting Scripture, if the plain text makes common sense, seek no other sense.  The CATHOLIC Bible declares that Jesus was Mary’s FIRSTBORN child.  At the cross, she was not entrusted to another sibling because they were not there with Him in His agony.  John and Mary were.  Therefore Jesus committed them to each other.  Both of whom were like-minded in their love and devotion to Him.","date":"March 12, 2015 at 10:03 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"author":"david_o","post":"The most glaringly, inaccurate treatment of known Shroud wounds was the explanation(?) for the shoulder abrasions due to the carrying of the cross.  Steering completely AWAY from what the Shroud shows us, we are taken on a visual journey of Jesus carrying the complete cross which, by their own admission, would have weighed 300lbs.  It would have been impossible to carry.  Especially someone as brutalized as the Man in this cloth.  We KNOW the Shroud depicts the shoulder wounds to have been made by the patibulum (cross-beam).  This would have been tied upon the Man using ropes.  More surprising was when they contradicted this obvious (intentional?) error, by then inexplicably soliciting John Jackson’s obviously correct interpretation for the shoulder wounds.  How could this blatant Shroud falsehood have been included in the final cut for Finding Jesus?  During those scenes of Him carrying His cross on the Via Dolorosa, I almost expected to see Veronica coming out from among the crowd to wipe the face of Jesus.  Sincere, legitimate, objective efforts must used when giving the public Shroud information.  Every attempt should be made to ensure that misrepresentation (willful?) of what is already known to be fact is eliminated.  The mistreatment of the shoulder wounds was glaring!","date":"March 2, 2015 at 10:57 am","url":"https://shroudstory.com/2015/03/01/open-discussion-about-episode-one-examining-the-shroud-of-turin/","cat":"television","title":"Open Discussion About Finding Jesus, Episode One: Examining the Shroud of Turin"},{"author":"david_o","post":"Russ…….I agree with Mike M.  Thanks for all your effort, time and money in making the St. Louis Shroud Conference available online!","date":"December 4, 2014 at 1:25 pm","url":"https://shroudstory.com/2014/12/03/revised-st-louis-conference-videos/","cat":"other_sites","title":"Revised St. Louis Conference Videos"}]}
