{"resources":[{"author":"david_of_costa_rica","post":"Thanks for the reply: Very intelligent questions. I love discussing the Turin Shroud and I am hoping we can agree to disagree on some points with a spirit of good cheer. I know this will sound like a pile of B.S. but I am baptized in the Holy Spirit.  The same Holy Spirit Paul of Tarus was baptized in.  That is where this info is coming from and confirmed with the Holy Spirit before writing. If not, then I am presuming to speak for him, I am not presuming. I am speaking for Jesus of Nazareth.  (With a spirit of good cheer and humility) #1  I’ll start with the vinegar, human sweat contains acetic acid whether he drank the vinegar or not.  Also it is important to note the amount of acetic acid needed to add to cellulose to make cellulose acetate is a extremely small amount.  Jesus of Nazareth confirmed with me  that He did drink it and his acetic acid level was raised above normal.  Gospel of John confirms he drank it, eye witness testimony, John was there, Mathew, Mark or Luke were not, He was. Either way the sweat contains acetic acid. #2 Jesus was covered in the shroud upon coming down from the cross, so the blood stains are immediate without any myrrh or aloes. They are 1st. Both front and back side. The head cloth was also used when he 1st came down from the cross, to cover his head.  The Cloth in Spain 84cm X 53cm  (Note 53cm is exactly 1 philataric cubit, a 1st century measuring system) The blood did soak into the cloth as liquid as the forensic evidence has it. The mryyh and aloes were not applied until NIcodemus arrived at night and brought about a 100lb weight of myrrh and aloes.  Gospel of John is authentic, eye witness testimony.  Note John writes in descriptive detail of the events of the final days/hours of Jesus. No other Gospel covers the final hours of Jesus the way John writes it. Blood Note:  Type AB blood is on the shroud and head cloth,  extremely rare, less than 5% world population has it.  In most countries less than 1% Same pollen samples on shroud and head cloth. Not coincidence.  In France type AB blood is less than 1% of poplulation.#3 The body was then brought to the tombsite. Mary Magdalene was present, his mother, John, Nicodemus & Joseph of Arimathea. There his body was removed from the shroud and washed and cleaned with the myrrh and aloes and then re-wrapped in the shroud without the head cloth which was “not lying with the linen clothes but wrapped and put it a place off my itself”   See my new video to see this demonstration. The mryyh then covered the dried blood stains on the shroud. #4 Tests on the cloth have confirmed myrrh and aloes present, another report I read says it is not there. Some of the properties found in  myrrrh will be chemically altered when hydrolysis takes place.  Myrrh contains proteins and sugars and steriods and many other chemical properites difficult to isolate and identify and is over 50% cellulose, a carbohydrate. The substance that makes up the image on the shroud is a carbohydrate.How then can one say there is no myrrh on the cloth?  What happens to myrrh after 20 centuries and has been chemically converted into cellulose acetate?  Did they test for those variables?  No, they did not. The image is made up of mryyh..      Futher tests will confirm this writing as accurate. Again, thanks for the response, I have confirmed this with the Holy Spirit to be accurate at the highest level of my present communiction abilities. I could go into even more detail.","date":"May 11, 2012 at 5:42 am","url":"https://shroudstory.com/2012/05/09/a-search-for-shroud-of-turin-on-google-returns-2650-videos/","cat":"video","title":"A Search for Shroud of Turin on YouTube Returns 2,650 Videos"},{"author":"david_of_costa_rica","post":"I like this review. I am the person that made the video/wrote the book.  It does not cost money to be baptized in the Holy Spirit. If a person comes to God with urgency with that desire, and who’s internal motive is  “to do the right thing for the right reason” nothing more is needed.  My book explains exactly how that is done for the serious type individual. It includes scripture from Genesis to Revelation that would take a person 20 years to figure out on their own. I save that person years of hell and frustration.  I think Amazon sells it for $9.99 with no shipping.  My videos help create the urgency needed without purchase of anything. I want to be clear on that. I did a follow up video demonstrating how myrrh will harden after a short time and form a 3-D Mold. That is not a theory, that is a scientific fact. I have proven it in a lab experiment. Anybody can do it.  You can see it for yourself on video at zero cost to you. A very small amount of acetic acid and acetic anhydride & a small amount of a catalyst, such as sulfuric acid mixed with cellulose from wood pulp or plant, will cause a chemical reaction to take place called “hydrolysis” and cellulose acetate resin flakes will be formed in about 20 hours.  Myrrh is cellulose from wood pulp. Aloes are cellulose from plant. That is a fact, not theory The caramel like substance on the outer fibers of the shroud are myrrh that was converted to cellulose acetate. A protective layer over the blood stains. That is why the pure red blood color was preserved. See “How the 3-D Image was Formed on The Turin Shroud” for deeper insight.Another reason the blood is so red is because it is type AB  A very rare blood type, it contains a higher amount of hemoglobin and the blood of Jesus also has bilirubin in it, and had a high amount of oxygen in his blood making it much more red than normal blood. I have given away more books than I have sold, I simply cannot afford to give away a million books. I spent 4 years and about $50,000 to complete the art work and the written material for the book, often 7 days a week, 8 hours a day.  I simply cannot just give that away. I lived in the back of a car and 40 days in a homeless shelter waking up with my sheets covered in blood every morning from fighting off ticks all night to get that book published.  I have paid my dues. What I have written in my book is that genuine diamond in a parking lot of broken glass. My videos make it possible to be baptized in the Holy Spirit without spending one penny.  I have done everything I can think of to save people money.  I recently sold a book at cost and paid for the shipping all the way to Austrailia.   That means I actually lost money but gained in a way that does not show up in a bank account on Earth. I want to say thanks for the review.  I know that is sounds a bit absurd.  Check for yourself the details.  You will find that the details I have outlined forms a oddly shaped puzzle piece that just happens to fit in the empty spot to make a complete picture.  In the end you find yourself staring at the Highest of all Kings on the Earth, The Shroud of Turin, Jesus of Nazareth.","date":"May 10, 2012 at 5:15 pm","url":"https://shroudstory.com/2012/05/09/a-search-for-shroud-of-turin-on-google-returns-2650-videos/","cat":"video","title":"A Search for Shroud of Turin on YouTube Returns 2,650 Videos"},{"author":"david_of_costa_rica","post":"Dear Dan Porter:  I found this information after my lengthly posts, feel free to delete them if they are takng up to much space.   This is what is scientically confirmed to be what makes up the “caramel like substance” on the Shroud of Turin.  A scientific report.1. Glucose  ( A property of Myrrh)2. Fucose  (A property of Myrrh)3. Galactose (A property of Myrrh)4. Arabinose (A property of Myrrh)5. Xvlose (A property of Myrrh)6. Rhanmose  (A property of Myrrh)7. Gluceronic Acid (A property of Myrrh)(Gluceronic acid is also a component of cellulose acetate and billirubin)Myrrh also contains salts and is light reflective.Myrrh leaves a caramel color when applied to cloth.  It does not contain pigments or dyes. It is the natural color of tree resin. It is a mathematical certainty that myrrh makes up the image on the Turin Shroud.No other substance on the Earth has all these properties and will leave a caramel color without use of pigment or dyes.By process of elimination it cannot be anything else. I have been saying this for over 5 months and cannot get a single person to believe it.It has already been scientifically confirmed.  They just did not recognize these properties of being myrrh. This also puts a dagger into the heart and utterly destroys all previous forgery theories and any and ALL books ever written claiming the Turin Shroud a fraud. This also links the Turin Shroud back to the 1ST Century Eye Witness Testimony Account of the Gospel of John.  “And there came also Nicodemus which came to Jesus by night and brought a mixture of myrrh and aloes, about a 100lb weight.  Then they took the body of Jesus and wound it in the linen clothes with the myrrh and aloes. This new fact combined with the heavy weight of all the other circumstancial evidence increases the calculated odds  that the Shroud of Turin is NOT of the defendent, Jesus of Nazareth is one in several billions.  Better than any DNA Evidence Ever presented in any court of law. ONLY LOGICAL CONCLUSION:  Shroud of Turin is the burial cloth of JesusWe Rest Our Case","date":"May 16, 2012 at 3:06 pm","url":"https://shroudstory.com/2012/05/09/a-search-for-shroud-of-turin-on-google-returns-2650-videos/","cat":"video","title":"A Search for Shroud of Turin on YouTube Returns 2,650 Videos"}]}
