{"image":[{"author":"edward_wagner","post":"Hi Colin,              The “original” I’m referring to is the Mark 1 ,the one in Turin being an impression of it ( a “blotting paper”copy of it ) Eddie.","date":"August 19, 2013 at 12:13 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?"},{"author":"edward_wagner","post":"Hi Colin,             Thanks again for your very witty reply ,I’d like to ask you yet another ,possibly my last, question that has puzzled me over many years .Why is it that in an endothermic reaction the temperature of the reactants  drops (as in the salt-ice mixture reaction) if energy is absorbed from the surroundings ?and then in the Thermit reaction the temperature of the reactants increases with energy being given out from the reactants in the exothermic reaction .(I suspect the answer will involve potential energy but I would really like to finally find out once and for all.) Ps. from your answer above I’ve just realized that you believe the TS to be a fake am I right ? Eddie","date":"August 14, 2013 at 1:02 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?"},{"author":"edward_wagner","post":"Hi Colin,           I’m taking up your offer to “pop by any time”,as I was walking to the library to check my e-mails an idea came to mind about the TS.Could the TS be literally an impression of the original? the two cloths being pressed together to produce a mirror image on the new cloth .Thanks again for taking the trouble to answer all of my e-mails.Eddie.","date":"August 18, 2013 at 12:53 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?"},{"author":"edward_wagner","post":"Hi Colin ,            Thanks for the reply ,I must admit I never thought of relativistic mass !I have to pick up my beautiful daughter and beautiful grand-daughter very soon so I can’t write everything that I would like to .Relativistic mass is equal to the rest mass times one over the square root of 1-(the velocity squared over the the velocity of light squared) and hence if velocity is not quantised the relativistic mass would also not be quantised .Ps. very impressed with your Guardian comments/contributions .PPs.can I ask you questions about ancient Egypt?","date":"August 9, 2013 at 3:22 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?"},{"author":"edward_wagner","post":"Hi Colin,             I have a few questions but I’d like to start with this one .Why during the 5000 years of the Ancient Egyptian civilization not one pyramid was depicted in any of their paintings? Thanks again for your early replies .I’m not used to getting rapid replies from anyone .I sent an e-mail to Classic fm to inform them of the correct pronunciation of Polish composers names but never got a reply .All they have to do is pronounce “i” as “ee”and “w” as “v”.Ps. your granddaughter ( I can’t believe it’s a double “d”) asked a very interesting question ,she must be a very clever girl! Eddie.","date":"August 11, 2013 at 12:08 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?"},{"author":"edward_wagner","post":"Hi Colin and Hugh,                             Thanks for all your efforts ,it looks like the mystery of the TS will take a long long time to resolve .I still have the very impressive dignified “face” of the Shroud  on the front of a Times magazine from 1978 !It’s always fascinated me ,making me wonder if I was looking at Jesus Christ himself !Eddie.","date":"August 20, 2013 at 5:21 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?"},{"author":"edward_wagner","post":"Hi Colin,             Thanks for your 2 interesting suggestions,if I may I’d like to ask you a somewhat controversial question about the Turin Shroud .If the TS is genuine does that mean that Jesus left the tomb naked?None of the Gospels have any mention of this startling fact.Eddie","date":"August 13, 2013 at 1:11 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?"},{"author":"edward_wagner","post":"Hi colin,            Thanks again for your usual rapid reply ,you have “hit the nail on the head ” and solved my problem! I can easily see mass being quantised just by considering a glass being filled with water 1 molecule at a time . I’m so glad your answer did not involve Schrodinger’s Operator !The one last problem that I have is in understanding how a body can ” jump” from rest to some velocity  Although it can be seen happening on a simple velocity-time graph of an accelerating body at the origin ! Are these “jumps” different for different accelerations ? Ps. Many congratulations on solving my problem.","date":"August 9, 2013 at 10:23 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?"},{"author":"edward_wagner","post":"Hi Colin ,            Thanks for your reply ,I did’t expect to hear anything so soon ,.In the second part of my message I am trying to get an answer to something that has puzzled me for a long time .How can the velocity of a body jump from nothing to something, .If it can, what’s it doing in between these states ?This question has implications for the Quantum theory .Ps. this question has nothing to do with the Turin Shroud ,I only asked you as I was very impressed with the extent of your scientific knowledge in your blog ..Eddie.","date":"August 7, 2013 at 12:55 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?"},{"author":"edward_wagner","post":"Hi Colin ,             Thanks again for such a rapid reply! I know that to move from rest the body has to have a  resultant force on it producing an acceleration ( a change of velocity per second) my question refers to the minimum change of velocity .That is from zero to the next velocity (ie from nothing to something) Ps. momentum is only conserved if the resultant external force is zero.Eddie","date":"August 7, 2013 at 3:08 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?"},{"author":"edward_wagner","post":"Hi Colin,            You have got to the heart of the matter ! If velocity is not quantized then kinetic energy (half m v squared ) would not be quantized this would contradict Quantum Theory .I’m so glad you have understood my problem .I now know that I chose the right man to ask ! even though you claim only to be a “test-tube man! Eddie .Ps. I’m so surprised that I’m getting such rapid replies !","date":"August 8, 2013 at 11:14 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?"},{"author":"edward_wagner","post":"Could  a life size statue ,heated ,and wrapped with the “shroud” ,have produced the image ?Ps.what is the next velocity after zero of an object that has moved?I’l be very very interested in the answer!","date":"August 6, 2013 at 1:29 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?"},{"author":"edward_wagner","post":"Hi Colin,            If the TS cloth is a cloth from the 13th or 14th century as indicated by the radiocarbon dating then the only way,that I can see ,such a detailed image could be produced is by getting a “blotting paper” copy of it from the original (which would at that time be 1300 years old and hence deteriorating )I have no idea how that could have been done .If on the other hand the radiocarbon dating is unsound because of contamination by carbon 14 from smoke sources such as burning cloth or incense ,then the cloth could be a genuine shroud of a scourged and crucified man.( from the 1st century as indicated by the weave of the cloth)Thanks again for replying I hope I’m not bothering you too much .I have no detailed knowledge of the TS and feel as if I’m wasting your time.Eddie.","date":"August 19, 2013 at 3:36 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?"},{"author":"edward_wagner","post":"Hi Colin,             Thanks for your excellent answer to my question re.endothermic /exothermic reactions and for explaining your belief re. the TS.I’l leave you in peace now! Eddie.","date":"August 14, 2013 at 4:26 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?"},{"author":"edward_wagner","post":"Hi Colin,            I’m taking up your offer to “pop in at any time”,as I was walking to the library to check my e-mails an idea came into my mind concerning the TS .Could the TS be literally an impression of the original? the two cloths being pressed together to form a mirror image of the original on the new cloth.Thanks again for answering all of my e-mails .Eddie.","date":"August 18, 2013 at 1:02 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?"}]}
