{"art":[{"author":"emmett","post":"I read the on-line version of the book then bought a hard copy of the book “Heaven is for Real” by Todd Burpo.  It has really touched me.  I have a computer copy of the picture “Prince of Peace” that I look at as I say a few prayers.  What I am trying to find is a realist picture of Holy Mary” the mother of Jesus.  I was hoping to find one by Akiane that has Mary’s full face as that of Jesus in the “Prince Of Peace”  is there one available?? Thanks –ekmcmahon@att.net","date":"May 26, 2013 at 4:24 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}],"blood":[{"author":"emmett","post":"To me, Jesus is fully divine but as God he could use the human form to aid in contacting the human world.  He started the human existence just as all humans would in being born as a baby, living his human life as we know it and then it was necessary for his human body to die it’s horrible death then he “came back” as the risen Christ.","date":"July 13, 2013 at 9:29 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","title":"Erase the fact from the list. It is not a fact. It never will be."}],"history":[{"author":"emmett","post":"I’m just a little old Catholic and cannot complain about your view, I have given my thoughts before as it totally grabbed my consciousness when I saw the facial view on the Shroud in a “cleaned up” photo of it.","date":"August 4, 2013 at 7:28 pm","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","title":"Bible Archeology: The mystery continues"},{"author":"emmett","post":"I find it hard to accept that Hitler, of all people, would want the Shroud for any good reasons.  Knowing of some of the hateful, Godless atrocities that he and his  – committed before and during the war. Sounds like work of the Devil – Satan himself.","date":"June 14, 2013 at 2:28 pm","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","title":"Will the Alfred Rosenberg Diaries Tell Us Anything?"},{"author":"emmett","post":"Satan knows the bottom line to this. It needs not to be explained.  Be rid of tangible proof of Jesus the Lord Son of God.","date":"June 16, 2013 at 6:54 pm","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","title":"Will the Alfred Rosenberg Diaries Tell Us Anything?"}],"misc":[{"author":"emmett","post":"I am a believer.  When the Shroud came to my attention I researched it on the computer and determined that in my mind that it is the burial shroud of Jesus Christ.  Jus recently when I observed the shroud with the 3-D image of Christ’s Face it kind of rapped me in the head telling me that this is the image of the just risen Christ.  Then a few days later I seen the picture of the Shroud and the Prince of Peace kind of over laying it and to me that is very convincing.","date":"July 1, 2013 at 2:40 pm","url":"https://shroudstory.com/2013/07/01/jref-catholics-answers-and-the-like/","cat":"news_&_views","title":"JREF, Catholics Answers and the like"},{"author":"emmett","post":"Maybe they are just following orders from down below???  I have already stated of my believe  that the Sroud shows the image of Jesus at the instant that his spirit/soul re-entered his physical body.  I love the image on the site that shows a photo of the face on the Shroud and the picture of the Prince of Peace blended together.","date":"July 2, 2013 at 7:38 pm","url":"https://shroudstory.com/2013/07/01/jref-catholics-answers-and-the-like/","cat":"news_&_views","title":"JREF, Catholics Answers and the like"}],"opinion":[{"author":"emmett","post":"I concur.  I too am a Catholic and have been since I was about 7 yrs. old.  I am 72 years old now but do not attend church,  I live in a board/care home and have Neuropathy in both lower legs and feet.  I do not drive and do very little walking.  I had a Priest come and visit me some time back.  I say the Rosary at least once a day and each Sunday someone from the local church comes out to the home and gives me Holy Communion.The first time I saw the photo of the Shroud I was taken aback and looked at it very intently.  It was as though it was telling me that it was the Risen Christ. It has been my belief since then.","date":"May 24, 2013 at 7:39 pm","url":"https://shroudstory.com/2013/05/24/an-atheist-going-to-a-heaven-he-doesnt-believe-in/","cat":"news_&_views","title":"An Atheist Going to a Heaven He Doesn’t Believe In"},{"author":"emmett","post":"I am not the owner of a dead body yet.  I have a soul like all earth people but I have no idea of what transpires in the moments after a person “passes away” and what decisions they can make with what they are suddenly aware of the situation that the soul finds itself facing (right after the death of the body).  What happens there ?????","date":"May 24, 2013 at 4:49 pm","url":"https://shroudstory.com/2013/05/24/an-atheist-going-to-a-heaven-he-doesnt-believe-in/","cat":"news_&_views","title":"An Atheist Going to a Heaven He Doesn’t Believe In"},{"author":"emmett","post":"What do the men of that era look like in a painting from that time frame??  If my memory holds true, they have a look of what is considered today to be “long haired”.  They did not look like they came out of a Barber Shop after receiving – not a short cut but a regular cut.  Of course if they were bald then they were bald.  Men had long hair but not as long as women usually wore theirs.","date":"May 30, 2013 at 4:18 pm","url":"https://shroudstory.com/2013/05/30/how-can-you-argue-with-this/","cat":"other_blogs","title":"How can you argue with this?"}],"resources":[{"author":"emmett","post":"Hi, most important – I have not yet read the book.  I find disturbing from what I just read above is the thought of cloning the body of Jesus.  What made Jesus Christ is his Devine soul  not the human body.  If such a cloning were to succeed, all you would have is a human body but not anything like the real Jesus Christ the son of the almighty God the father.  This cloned body  would not be like the Jesus Christ that we know as the 2nd person of the Holy Trinity.  Then the Neo-Nazi idea of cloning a body using Jesus’ blood remnants and DNA from the supposed body of Adolph Hitler is like trying to blend the Almighty God with the  likes of Satan.  It is truly as absurd as it sounds.  It is a no do.","date":"July 22, 2013 at 2:26 pm","url":"https://shroudstory.com/2013/07/22/dateline-united-states-july-22-2013-another-press-release-for-the-chimera/","cat":"books","title":"Dateline:  United States, July 22, 2013. Another Press Release for The Chimera"},{"author":"emmett","post":"Twelve minutes??   Does that mean I am supposed to watch this   ??  video twice??Some folks have said that I may intuitive – for whatever that is worth-  When I first looked at the photo of the image that showed it’s 3 dimensional image, I was struck with the thought that this a  picture of the living Christ.  I stared at it for several seconds in awe. To me this is Christ at the moment that his divine spirit re-entered his human body and the affect it had on the body.","date":"June 22, 2013 at 3:28 pm","url":"https://shroudstory.com/2013/06/22/video-a-wild-bill-look-under-the-shroud-of-turin/","cat":"news_&_views","title":"Video:  A Wild Bill Look Under the Shroud of Turin"}]}
