{"art":[{"author":"fauna","post":"Hi, MC. I just discovered this blog this morning and came back to it this afternoon. I wondered where you may have “arrived” since writing this post that you wrote. I am  believer but I had an eye-opening experience with “Christians” that broke my heart so badly that I stopped reading my Bible and attending church services. I thought I was mad at God but came to realize that I was mad at myself because I “bought in” to this thought that “Christians” were different from people who don’t know Jesus. The truth is people are people no matter what. I am still having a hard time with some things. I surprised myself when I picked up the copy of “Heaven is For Real”. I, too, was intriqued by this 4 year old’s story. I had read a lot about Akiane (the child painter) years ago and was fasinated to see how the two children’s stories connected. Even though I got a little annoyed at Colton’s dad trying to make points that may or may not be there, it brought hope back to my heart as well. I guess today Colton’s dad’s thoughts actually make me giggle because we so much want to prove stuff and make sense out of things that really don’t make any sense. I am soooo very happy to say that because of comments on this blog –  especially AnnieCee’s, I am going to pick up my Bible again. I am also happy to say that no matter what, I know Jesus lived and died and lives now and that life is eternal and Christ in me IS the hope of glory. I never, ever denied those truths. I hope you have come to faith again.Another very important lesson that I am learning (but don’t yet know what to do with it) is that Jesus did get angry at people who thought they knew stuff that they really had no idea about. I learned that it is not ok to let people carry on “in the Name of Jesus” and presume that they “hear” God. Some people do and some just think they do to satisfy their own selfish desires. I have a feeling that God is so much more than we could ever hope or imagine and that He is reaching out to a world that needs Him so desperately. He wants to supply every need. I don’t know . . . I just hope you are finding He is incredibly real and that He loves you more that you could ever dream. Because of Who He is and because of what He did, we are good and we are loved deeper than the ocean and higher than the stars in the sky. God bless you.","date":"November 29, 2011 at 6:30 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"fauna","post":"Well .. . . I just finished reading the Burpo’s book. I don’t know exactly why I am here right now but I do have a feeling it is God’s doing. I’m not even sure what, exactly, I am wanting or needing to say. I have been close to Jesus in my heart and spirit for a very long time. I am almost 53 years old. I am just so jaded by “Christians” and “church” and the struggles of this world. Becoming like little children without presumptions and prideful thoughts that make folks think they “know” God and have something up on others seems so foreign to many people who call themselves Christians. In fact, I don’t know how some folks think they do really love and know God when they are so far from LOVE. If they could only see how evident it is to a child that they are missing the mark. It makes me want to scream! I just don’t want to be clumped into that sect of people. I have a feeling that some may respond to me that this is the way of the world and the pharisees and hypocrits but somehow (and I don’t know how that is) but somehow, God wants to set the world right on Who He really is and what Love is and that there is a Voice rising up to speak the Truth. The world is just not getting it! God’s love and grace is so profound, so extreme, so magnificent. A child has a humble heart. A child doesn’t think they know it all. Here’s to God bringing us down to that place and to being people who live there, now and forever. Colton talked about the Holy Spirit being real, too, and that His power comes out to us. Lord, that Your people will be humble to ask for it. Peace.","date":"November 29, 2011 at 7:17 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"fauna","post":"AnnieCee,I think that Love and knowing Jesus is kind of like which came first? The chicken or the egg? Making efforts to do  something never brought me closer to God. It was His love that drew me and continues to draw me. Not everyone is going to have a Bible to read but the Word became flesh and so I believe He has a way of making Himself known – even when we are not looking. <3","date":"November 29, 2011 at 6:39 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
