{"art":[{"author":"flagrum3","post":"Nice write up Stephen, when your done fixing up some misinformation on the Wiki 'codex' page, maybe you can fix some on the Wiki 'Shroud' page also. Seems there is alot of misinformation on Wiki and alot of young folk seem to use Wiki as their prime source of info nowadays. Anyways a couple of points to the Pray Manuscript drawing at the top of this page; 1. I tend to believe there is actually a second cloth represented in the bottom image, which extends beyond the Shroud slightly towards the Alpha symbol. I have not come to a conclusion of whether it is depicting the face cloth or 'more likely' the strips which would have been used to bind the Shroud around the body. I also think the face image cloth hanging from the ladies arm is depicting more likely the Sudarium...your thoughts? Secondly; I believe the image which many mistake for the sephulchre is actually the Shroud, with all the red x's as it also depicts the holes of the burn marks and I think the red is to imply blood on the inside of the cloth....Anyways, just a couple of thoughts.Thanks,F3","date":"May 28, 2012 at 2:41 AM","url":"http://theshroudofturin.blogspot.com/2012/05/my-critique-of-pray-codex-wikipedia-1.html","title":"My critique of \"The Pray Codex,\" Wikipedia, 1 May 2011"},{"author":"flagrum3","post":"To Anonymous; Seriously, have you done any reading? The statement you raise has been covered by many many people. It has been brought to conclusion that the Shroud in no way contradicts the John passage, whatsoever, and in some ways along with the Sudarium of Oviedo, the Shroud enlightens us more on the scripture of John 20. I think Stephen has covered this before actually, in some detail. Further reading on your part is defiantely warranted.Thanks,Sorry Stephen for jumping in like this but it irks me when people make irresponsible comments.F3","date":"June 1, 2012 at 6:09 AM","url":"http://theshroudofturin.blogspot.com/2012/05/my-critique-of-pray-codex-wikipedia-1.html","title":"My critique of \"The Pray Codex,\" Wikipedia, 1 May 2011"},{"author":"flagrum3","post":"Stephen I wouldn't have used such a hostile tone in most cases but this Anonymous, seems to be \"trolling\" as he has left the exact same comment word for word on other blogs including Dan's Shroud of Turin blog plus several other places.But with that said, perhaps I shall strive to be more as that passage proposes.Thanks,F3","date":"June 1, 2012 at 6:46 PM","url":"http://theshroudofturin.blogspot.com/2012/05/my-critique-of-pray-codex-wikipedia-1.html","title":"My critique of \"The Pray Codex,\" Wikipedia, 1 May 2011"},{"author":"flagrum3","post":"Matt I agree 100% with your comments. I'd like to add to the decorative pattern issue: If one looks closely, the artist depicted the decorative circles in basically a specific pattern throughout all drawings. This being two small circles followed by one large circle/or diamond, followed by two more small circles. Obviously to anyones eye this does not agree with the poker holes pattern. Making the poker holes and their pattern \"blatantly destinctive\", I would say.F3","date":"May 28, 2012 at 11:36 PM","url":"http://theshroudofturin.blogspot.com/2012/05/my-critique-of-pray-codex-wikipedia-1.html","title":"My critique of \"The Pray Codex,\" Wikipedia, 1 May 2011"}],"blood":[{"author":"flagrum3","post":"Hi Steve,Further to this discussion on the blood typing and it's possible degradation; You may want to check out Dan's Shroud of Turin Blog as...Immunologist Kelly P. Kearse has written a fine post to this very topic.Thanks,F3","date":"February 16, 2012 at 7:00 PM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","title":"Re: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear"}],"forensic":[{"author":"flagrum3","post":"Just to add to the problems of the Shroud radiocarbon dating; One must remember this Shroud has been 'around', meaning it has not sat in a sealed tomb or buried for 2000 or more years. Archaeologists usually deal with items that have been 'secluded', not carried all over, handled, mended or exposed to outside influences/contaminations. Even in the cases of 'secluded' RCD testings there have been anomolies! I have read that up to 50% of tests must be redone because of anomolies. Where does that put the Shroud in the error percentage scale? I'd say it's up there; Like a 95% chance of error from from a 'single' reading, possbly.F3","date":"April 3, 2012 at 5:39 AM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","title":"Four proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)"},{"author":"flagrum3","post":"Hi Steve,May I suggest before you get around to doing a more detailed post on c14 dating. You read all papers by Remi Van Healst on RC Dating. If you haven't already. There is some surprising first hand facts that prove the c14 result was in error....I'm amazed actually with all of his study and findings that they are not mentioned more often in defence of the SHroud. Here is one little bit I learned from his close scrutiny of the 'supposed' peer-review of the '89 Nature paper for the 1988 RCD. It was required that a minimum size of samples be 5g, however close scrutiny showed all samples from all labs used for the testing were well below this threshold, basically nullifying any results on a very basic level.Curious as to your thoughts on these findings.F3","date":"April 4, 2012 at 7:48 PM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","title":"Four proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)"},{"author":"flagrum3","post":"Hi Steve,Sorry I got stuck off topic. Look forward to your c14 blog.F3","date":"April 5, 2012 at 8:19 AM","url":"http://theshroudofturin.blogspot.com/2012/03/four-proofs-that-ad-1260-1390.html","title":"Four proofs that the AD 1260-1390 radiocarbon date for the Shroud has to be wrong!: #2 The Vignon markings (4)"}],"history":[{"author":"flagrum3","post":"I don’t know exactly what your talking about here or what you see, but any close examination of the image clearly shows a gap between front and dorsal head images.A gap of approx 6-8 inches.It’s pretty clear!! Also there is no image in that area as no body side images show anywhere on the cloth.Whatever mechanism casued the image seemed to follow gravitational lines, vertically only.","date":"December 26, 2010 at 6:18 pm","url":"https://shroudstory.com/2010/12/24/the-shroud-of-turin-and-the-new-testament/","cat":"news_&_views","title":"The Shroud of Turin and The New Testament"},{"author":"flagrum3","post":"Stephen. I find here in lies another issue over the discussion on the Shroud; Some people just not using any logic! i.e; The poster who questions the authenticity of the Shroud due to misinterpretation of scripture. John never states the body was wrapped in Othonia (cloths plural), he only states he SAW the othonia (cloths plural) in the tomb. There is a huge difference between the two. When John mentions othonia, it could mean several things; The Shroud itself and bound by strip(s) (As hypothesized by Dr. Jackson) or there could have been more cloths involved lying there. It has been suggested another large cloth was (needed)or used, to actually carry Jesus from the cross to the tomb, and I think this is evident in that if the Shroud was used to carry the lord from the cross, it would be very evident on the Shroud itself, and it is definately not, meaning there could have been a number of other cloths in the tomb amongst the Sudarium and the Shroud...So basically this argument is mute to the discussion of the authenticity of the Shroud.F3","date":"July 12, 2012 at 4:29 AM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","title":"`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'"},{"author":"flagrum3","post":"Stephen. I don't believe I am too far off in my proposals. 1.)Several cloths may have been used and could have been kept with the body in keeping to Jewish burial traditions and not necessarily being attached or placed on the body. (The sudarium is a case in point)...So it is still a logical statement. The minimal number of cloths (jawband) etc; is not an issue, as time was of the essense. A single strip bound around the Shroud could suffice as illustrated clearly by Dr Jacksons hypothesis using the 4 inch side-strip, which is tangible evidence. Remember John separates the Sudarium from the othonia so othonia (cloths plural) could mean several cloths; Including the Shroud, a strip or strips to bind the body and other cloths used for other purposes. The scripture does not in any way go against this (my) proposal.2) I also find it highly unlikely, viewing the Blood evidence found on the Shroud (closely) that the Shroud itself could have been used (dual purpose)i.e; In carrying the lord from the cross. I believe there would be found massive amounts of blood smeared on much of Shroud if being so, which there is not. The blood traces are very exacting, hardly showing any sign of movement. Again it is not against scripture or Jewish burial custom that these 'other' clothes may have been placed on or about the body. It is quite clear that Nichodemus et al. needed to improvise and quickly, using a long strip instead of several small ones to bind the body is not out of the question, and actually quite logical. John most likely had witnessed the burial and seen the exact way the body was left in the tomb when left. This could explain why John 'believed' after 'seeing' the cloths and the Sudarium, because they were all where they were left with only the body missing.F3","date":"July 13, 2012 at 1:48 AM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","title":"`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'"},{"author":"flagrum3","post":"To Matt's last comment on Bela III; This is a very important point, as it does create a strong connection between Hungary and Constantinople. It makes it quite possible that Bela III had seen the Shroud in Constantinople face to face, or even stronger that the monk who drew the PM had also or had accompanied him there...making for a very plausibly connection...this would  or could explain alot of the coincidences found on the PM to the Shroud.Now if I may go off topic also, I'd like to go back to the Sakli fresco painting and my thoughts on it. I am in question to the circles having any relation to the 3 circles of the esophagus or to the poker holes on the Shroud. Reason; there is no logic in it. If the artist was depicting the poker holes; WHy not depict them exactly as are seen? and why 3 holes? Even with the faintest of the poker holes, atleast 4 burns can be seen and why angled? ...this theory also would propose the artist had seen the Shroud 'unfurled' and not folded as the Mandylion/Edessa cloth was described and known to exist. The link to the Constantine 3 holed esophagus in Jerusalem seems too far reaching. If so, then why the need or meaning to the four holes? My thoughts are that the artist may have known that the Edessa cloth/Mandylion was actually a larger sindon (burial cloth) but had not neccesarily seen it as such, as it can be supposed most people would not have been able too, just a few of the higher clerics, nobles etc; but he was aware of it's distinctive folding. Hense the odd circle patterns of 3 on one side, four on the other along with the fold lines which can be viewed on either side of the painting, reminiscent of layers. I may be way off here on my proposition and Mr. Guscin did actually relate to me that the painted circles were common on many paintings, so unlikely they had much or the indepth meaning as I proposed....but for some reason I cannot agree and feel there is.F3","date":"July 14, 2012 at 5:46 AM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","title":"`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'"}],"image":[{"author":"flagrum3","post":"Whilst making my breakfast this morning, to my astonishment as I pulled the second piece of toast out of the toaster, I saw the face of Dan Porter, clear as day!….But seriously, although I agree mostly with the article, I have to admit I see objects on the eyes! Forget the different photo film types, as it appears in the VP-8 renderings very clear.Would be nice if they had a way to enhance the vp-8 images detail to finally clear this up.","date":"November 19, 2010 at 3:22 pm","url":"https://shroudstory.com/2010/11/14/i-dont-see-flowers-and-coins-and-teeth-on-the-shroud-of-turin/","cat":"image_theory","title":"I Don’t See Flowers and Coins and Teeth on the Shroud of Turin"},{"author":"flagrum3","post":"Here in lies one of the biggest problems with the Shroud authenticity debate; People will 'listen' to arguments from people like Nickell's, whom is not a scientist or a chemist or physicist or has any training in any fields which would allow him to make any educated remarks about the Shroud. Yet people keep quoteing his writings. Maybe if they would just check his credentials against those of authors of dozens of peer-reviewed papers, minds might change a bit about the Shroud's authenticity.It's truly dumbfounding.F3","date":"May 11, 2012 at 2:38 PM","url":"http://theshroudofturin.blogspot.com/2012/05/you-state-that-there-is-no-paint-dye-or.html","title":"You state that `there is no paint, dye or pigment on the Shroud that forms its image' but it is claimed that `the Shroud contains red ochre and other paint pigments'"},{"author":"flagrum3","post":"Stephen, thank-you for that last passage and your final comment. It has actually made me feel better about this whole mess and my bewilderment to people's opposition to the Shroud and the Lord's teachings.F3","date":"May 20, 2012 at 12:47 PM","url":"http://theshroudofturin.blogspot.com/2012/05/you-state-that-there-is-no-paint-dye-or.html","title":"You state that `there is no paint, dye or pigment on the Shroud that forms its image' but it is claimed that `the Shroud contains red ochre and other paint pigments'"}],"opinion":[{"author":"flagrum3","post":"AnnieCee :Yes, I follow it. The AB negative type is so extremely rare that there’s a high probability Michelle’s family is related to Mary’s family somehow. Especially since they are also Jewish, and narrowing it down even further: Michelle’s family are Levites as Mary was.And, because Michelle donated bone marrow for her brother, he now has female chromosomes because bone marrow is what MAKES our blood cells. So it’s Michelle’s bone marrow that is now making her brother’s blood for him. That’s why he has female AB blood instead of male AB blood. She’s right, this is a good joke on him.Very interesting, thanks for the explanation.I wonder if Michelle’s brother is starting to show any female traits ;-)F3","date":"July 26, 2011 at 8:17 am","url":"https://shroudstory.com/2011/07/25/tales-of-blood-type-ab-negative/","cat":"other_blogs","title":"Tales of Blood Type AB Negative"}],"researchers":[{"author":"flagrum3","post":"There is one point that de Wesslow makes that I find nonsensicle...Especially from one who claims to be an Art historian...He states that 1st century Jews would not be accustomed too 'visual' stimulations, hense the reasoning for thier interpretation of the Shroud image as being a 'risen' messiah..HogWash! The Romans had been in Palestine for almost a century and were huge on 'images' such as frescos, statues, paintings etc, etc;...A first century jew would then be quite used to images and to suppose they took an image as 'proof' is rediculous. I'd bet at first notice they probably just thought the impression was a secretion of sweat and blood, nothing else (as many others have in the past). Then also to assume hundreds of people were also fooled or dillusional enough to believe an image on a Shroud is the 'raised messiah' is just plain lunacy.F3","date":"April 1, 2012 at 11:55 AM","url":"http://theshroudofturin.blogspot.com/2012/03/my-comments-on-telegraph-article-about.html","title":"My comments on a Telegraph article about Thomas de Wesselow's claim that the Shroud is authentic but Jesus was not resurrected #1"}]}
