{"misc":[{"author":"gabriel_spain","post":"During the 2002 restoration burnt fibres from the medieval fire were removed. They were perfect for a new radiocarbon test and along with the HAL9000 high resolution images, they represent a whole body of information to be (re)analized. The Catholic Church has always been very well connected with the scientific community and most probably has already carried out -secretly- new radiocarbon tests and in-depth analysis on the HAL9000 images.Put yourselves in the place of the Church. If on the one hand, you had all these new information and on the other hand, a group of very good experts who you trust 100%, what would you do? Wouldn`t you put all those evidences in their hands and analyze their conclusions without the pressure of the media? Most probably they already reached a conclusion about the Shroud by 2007 or 2008 and in the light of these conclusions they organized the 2010 exhibition.The Vatican felt that the laboratories that carried out the 1988 radiocarbon tests did not fulfilled their compromises regarding the way that results would be made public. In this sense, it seems quite logical that now it is them who carried out all the tests privately with their own scientists in the first place. It just does not seem plausible that they keep all the HAL9000 images in a DVD hidden somewhere waiting for a image analyst from outside the Church to analyze them.","date":"October 13, 2011 at 9:06 pm","url":"https://shroudstory.com/2011/10/13/more-on-freeing-the-hal-9000-yes-what-is-the-archdiocese-of-turin-afraid-of/","cat":"news_&_views","title":"More on Freeing the HAL 9000: Yes, what is the Archdiocese of Turin afraid of?"},{"author":"gabriel_spain","post":"Please note that nowadays, using current technology a radiocarbon dating of a burnt fibre from the Shroud can be easily done in a few hours and a whole set of preliminary tasks which in the past could take days are not needed any longer. Current devices are much more sophisticated and results are almost straightforward. Hundreds of tests are being currently carried out everyday and a “special test” like this could easily go unnoticed in a busy laboratory, specially if it is located in one of the many high level Catholic Universities. Not to mention the analysis of the HAL9000  images. It is a process that can be easily decentralized and put in the hands of let`s say, ten top experts you trust 100%  in parallel and wait for the results. This is the way current research teams work on science. Physical meetings like the one we saw with the STURP where all scientists are present are not very common nowadays since everyone uses Internet. You don`t need a STURP team anymore and I think that we will never see one again. If you were the Church wouldn`t you like to know what the hell the Shroud really is? First, privately and then you could take your time to tell the world by yourself, whatever the truth is. The other possibilty of having frozen all the analyses and kept all the burnt fibers and rest of material from the restoration along with the  HAL9000 images in a “safe place“ waiting for future analysis carried out by a STURP2 seems to me unbelievable. Perhaps the –in principle, not scheduled- exhibition of 2010 is related to the fact that the Church already has got a veredict about whether it is a fake or not. Though a Catholic myself, I feel doubts on how to interpretate whether the exhibition of 2010 is a positive confirmation on the authenticity of the Shroud or not. The Catholic Church is  2000 years old and  her concept of time is different, but if I had to choose I would say that if they considered that the Shroud was certainly  a fake they would have let the whole subject die. They have done so with many other relics that in the past were venerated all over Europe. Nowadays only a few of them are still given any attention:The Shroud of Turin, the Shroud of Oviedo, the chalice of Valencia and a few more. All of them are relics that can exhibit solid –though perhaps not definitive- historical credentials. For most of the  hundreds or perhaps thousands of relics that in the past were venerated, the Church has let their devotion die little by little. I think that the Catholic Church would have acted the same with the Shroud of Turin if they thought it was a fake and the 2010 exhibition would have never taken place. But this is not more than my doubtful impression.","date":"October 14, 2011 at 9:26 am","url":"https://shroudstory.com/2011/10/13/more-on-freeing-the-hal-9000-yes-what-is-the-archdiocese-of-turin-afraid-of/","cat":"news_&_views","title":"More on Freeing the HAL 9000: Yes, what is the Archdiocese of Turin afraid of?"}]}
