{"dating":[{"author":"ironclad","post":"He’s echoing the views of Wellhausen and company, a closeted group of German antisemites who hated everything Jewish, including their sacred books.  See, I could play the game too.","date":"June 19, 2012 at 2:14 pm","url":"https://shroudstory.com/2012/06/19/who-is-evolving-into-stupid/","cat":"carbon_14_dating","title":"Who is Evolving Into Stupid?"},{"author":"ironclad","post":"This also agrees with the Synoptics which use the singular in describing the main cloth.","date":"June 13, 2012 at 11:25 am","url":"https://shroudstory.com/2012/05/29/new-dawkins-challenge-video/","cat":"carbon_14_dating","title":"New Dawkins Challenge Video"},{"author":"ironclad","post":"Apparently, he is not aware that those antiquated books he is scorning have also been subjected to “years of careful research, analysis, reason, logic and a certain thing called ‘evidence,'” adding to and enhancing our knowledge of the ancient near east.","date":"June 19, 2012 at 2:21 pm","url":"https://shroudstory.com/2012/06/19/who-is-evolving-into-stupid/","cat":"carbon_14_dating","title":"Who is Evolving Into Stupid?"}],"blood":[{"author":"ironclad","post":"anoxie in response to colinsberry: “Ok. Here we are ! Your point was: Adler’s works is highly questionnable.”And here I thought Rogers was the one with dubious scientific credentials or work ethic.  If person A tells me person B is bad, I may hold judgment until I know person B at a deeper level.  But if person A continues on and tells me that person C is also bad and so on, I don’t have to go far in reaching a conclusion on whom I have to set a leery eye on and who is probably having a social skill problem.","date":"June 20, 2012 at 6:22 pm","url":"https://shroudstory.com/2012/06/20/berry-shroud-was-scourged-not-the-man-a-critical-look-at-faccini-and-fanti/","cat":"blood_studies","title":"Berry: Shroud was Scourged, Not the Man. A Critical Look at Faccini and Fanti"}],"researchers":[{"author":"ironclad","post":"With the synoptic gospel accounts as a source, the points of resemblance of the two sheets (codex illustration and actual shroud) are anything but coincidental.","date":"June 13, 2012 at 6:02 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"colinsberry: “ (In other words, one must not assume that the failure to find an image under one bloodstain means that all areas showing “blood” have no underlying image)”If that is the case, then, scientifically, nothing conclusive could be learned about the shroud, as it would demand higher standards of testing, and so more damaging (e.g., removal of stains from more than one site), something the custodians would never allow. At what point do we say this or that is enough? After how many attempts?  I thought uniformity was one of the pillars of science.  Ironically, your stance only lends a hand to the crowd screaming foul play when it comes to the carbon dating, on account of the difference of fabric and weaving, they say.  I could see the nonuniformity principle being applied here, but in the case of the image itself?  To suggest it seems a bit unreasonable for whereas fabric can be stitched and unstitched, images can’t, more so when they are intertwined with bloodsoaked (or whatever other fluid) material, each preserving the fidelity of the other.","date":"June 14, 2012 at 10:01 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"I think the point that menedemus is trying to make, valid in my honest estimation, is that the illustrator was not able to give us a 100% faithful reproduction, because that was not his main focus and usual convention.  So this may explain why all the points of contact are not going to be there.","date":"June 13, 2012 at 6:11 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"Colinsberry: “I too uncritically accepted the claim that the blood stains were under the image,”Now that’s contradicting Mr. David Mo’s statement and raises a red flag.  Did the blood come first or did the image?  I thought science had already answered the question, but now I see there might be controversy.  How could this be? If we can see a faint image just with our plain eyes, cannot we see even more with advanced instruments and techniques?  Forensically, the chemistry of blood should not be a barrier.  Or is it?  Who would have known science could be so limited with something palpable and present, yet grandiose when it comes to biological phenomenon occurring millions of years ago.  An odd contrast.  After all these years I was under the impression that the carbon dating was the one major item steeped in an unsettled, fiery storm.  And yet, were not the STURP scientists able to remove the ‘red covering’ (for lack of a better phrase, since now even the presence of blood is in question) and determine if there was an image under there?","date":"June 14, 2012 at 8:45 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"colinsberry: “ (In other words, one must not assume that the failure to find an image under one bloodstain means that all areas showing “blood” have no underlying image)”If that is the case, then, scientifically, nothing conclusive could be learned about the shroud, as it would demand higher standards of testing, and so more damaging (e.g., removal of stains from more than one site), something the custodians would never allow. At what point do we say this or that is enough? After how many attempts?  I thought uniformity was one of the pillars of science.  Ironically, your stance only lends a hand to the crowd screaming foul play when it comes to the carbon dating, on account of the difference of fabric and weaving, they say.  I could see the nonuniformity principle being applied here, but in the case of the image itself?  To suggest it seems a bit unreasonable for whereas fabric can be stitched and unstitched, images can’t, especially when they are attached to bloodsoaked (or whatever other fluid)","date":"June 14, 2012 at 9:50 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"David: “All sindonists say that body image was done after the bloodstains.”If so, that will be contrary to common sense and sound judgement, since an artist and a forger, both aiming for the same thing, would want to do a good job and strive to minimize the cost of production, you know, start with a clean sheet or canvas first, draw the outlines, fill in the substance, and then add the blood stains.  Adding the bloodstains first would defeat the purpose as it would only complicate the process, something inconsistent with the genius of the forger/artist.  I can only imagine how hard it would be trying to trace and match the blood stains, and their flow patterns, to the areas of injury while creating the image, making sure all the while that they are not offline. The difficulty is made worse by the fact that the image is no ordinary ‘creation’ with its inverse properties and almost invisible contours when at close range.From a psychological standpoint, the presence of the bloodstains as a first event would argue against forgery or a purely artistic endeavor.","date":"June 14, 2012 at 9:05 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"colinsberry:”The possibility for getting the chronology wrong are endless when the “blood” is highly degraded, or not even real blood, and when zilch is known about the chemical nature of the image.”But in what way are these hindrances to finding out if in fact an image is under it all?  The image has survived despite the passage of hundreds of years and it being subjected to all kinds of damaging elements.  I would think that if the staining fluid was the last finishing touch, then it would have offered a protective cover to whatever image that laid under it.","date":"June 14, 2012 at 10:26 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"Nope, the italics are not coming from me.","date":"June 14, 2012 at 4:07 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"…let me see if I could resolve the ‘italic’ problemTesting.  Ok, I also posted a response to David and Colin in another computer, which currently  is awaiting approval from the moderator.","date":"June 14, 2012 at 4:05 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"colinsberry: “Nothing is certain, far less predictable in surface chemistry,”But I thought you conceded that least in one instance there was no image under a particular stain.  Your problem was that you wanted this proven more than once at another section of the shroud, just for confirmation sake,  not that it was untestable or that science cannot find out.  I have a little more faith that science can.  It is not impossible verify the constituents of that fluidy substance and see if it has the same chemical signature of the dehydrated cellulose of the image mixed in, if in fact the image was the first thing that was formed there.","date":"June 14, 2012 at 11:33 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"colinsberry: “First, we don’t know if it’s dehydrated cellulose or hemicellulose – but is more likely to be the latter, something that Rogers did not consider”Mr. colinsberry, how do you know that Rogers did not consider this?  And I thought the science was pretty much clear and well established that we’re  are indeed dealing with dehydrated cellulose.  This is the first time I’m learning that there may be questions still lingering about this.  On what basis are you making such statements?  Rogers and the rest of the STURP scientists were personally involved in the direct inspection and testing of the shroud and subjected their findings to peer-review.  Who is now challenging it and has he or she had the privilege of also inspecting the shroud upfront as has Rogers so as to make these challenges?","date":"June 15, 2012 at 3:51 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"David Mo :Ironclad :From a psychological standpoint, the presence of the bloodstains as a first event would argue against forgery or a purely artistic endeavor.Please, Ironclad. I made a simple and clear question and would like a clear answer without additives.All sindonists say that body image was done after the bloodstains. I think we must accept this opinion, unless new research says otherwise. Do you think so?Yes or not?I stand in unison with the rest of the reasonable observers, and I thought I made my point clear.  The evidence shows that the image came after the blood stains and I proceeded to logically demonstrate how this could be devastating to the position that holds forgery or artistry as the cause.","date":"June 14, 2012 at 2:13 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"David Mo: “Do you agree with Mr.Lavoie? Or have you another way to explain the anomalous blood trails over the hair?”I have one of Lavoie’s books on the subject and tend to agree with him.  I’m at a loss as to how this may disprove the authenticity of the shroud since Lavoie’s position is one for and not against.  This, however, has nothing to do with the original question concerning what event came first: the blood or the image.  If the blood came first, then this greatly increases the odds that the cloth was not a product of artistry for precisely the reasons I have elucidated in my previous postings.","date":"June 20, 2012 at 1:23 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"colinsberry :As I say Ironclad, the chemistry is not straightforward. You refer to ‘the chemical signature of dehydrated cellulose”. First, we don’t know if it’s dehydrated cellulose or hemicellulose – but is more likely to be the latter, something that Rogers did not consider, or at any rate comment on. The changes that carbohydrates undergo on mild pyrolysis are exceedingly subtle, and the eye is in fact far better at picking up surface pyrolysis that any amount of chemical instrumentation. This view seems to decry the level of scientific work that has been done and the experimentally verified conclusions reached.From the “statements of fact” extracted from Rogers’ Frequently Asked Questions @ http://shroud.com/pdfs/rogers5faqs.pdf, which “can be proved from the scientific observations,” the following are pertinent to this discussion:1. The blood can be removed with a proteolytic enzyme.2. The image color can be chemically reduced with diimide, leaving colorless, undamaged linen fibers behind.3. The image color was NOT due to chemical changes but came as a result of dehydration of the cellulose to produce conjugated-double-bond systems.4. The blood still evolved hydroxyproline on mild heating, and the cellulose crystals were largely undistorted.Given these factors, we can deduce that if the image formation process was the first event, the fluid substance, being the successive event and covering the image, could be removed using a proteolytic enzyme thus exposing the image color, which apparently is not affected by this or any other eliminative process, this function being better served by the diimide reagent.Therefore, it is possible to see if there is an image under the blood, and if it is not there following the above procedures, then reason forces us to conclude that the stains are an event occurring prior to the image process.Notwithstanding the committal of fraud to the contrary, Rogers’ scientific reputation and the rest of the scientists that worked directly with the shroud are greatly impugned if the above scientific “facts” are not facts at all.","date":"June 14, 2012 at 3:34 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"colinsberry: “Who’s to say that the proteolytic enzyme do not just digest the blood proteins, but proceed to attack the plant cell proteins too, loosening and lifting off an image that was UNDERNEATH the blood stains.”As demonstrated by the scientistS through their experiments, I state again: the colored coating cannot be dissolved, bleached, or changed by standard chemical agents.  Additionally, according to Heller and Schwalbe, two original STURP scientists who worked directly with the shroud, no image formed under the blood stains, later also confirmed by Carlo Brillante.  If these findings, which were arrived at following sound protocols of science, are in doubt, then nothing could be learned about anything.  I would think that anyone having any misgivings about these or any other such verifiable scientific discoveries would come as a result of having done some objective work of their own instead of subjective “what-ifs,” “could haves,” or “maybes.”","date":"June 20, 2012 at 12:27 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"colinsberry: “On the contrary, Rogers was quite adamant that it was not the cellulose that was dehydrated, but other more reactive carbohydrates……….{…}https://shroudofturin.wordpress.com/2012/06/14/gas-diffusion-and-the-banding-effect/#comment-12558”This is the same document I referenced in my earlier response to you dated June 14 (response # 157).  I should have been more clear, and now reading the document, I stand corrected.  Item # 3 of my response should have read:“ 3. The image color was NOT due to chemical changes, which, if it was, the most likely explanation would have been the dehydration of the cellulose to produce conjugated-double-bond systems.”Rogers, after all, was doing good science!!Notice, that the other three points I made (#s 1, 2 and 4) extracted from that document, still stand as regard the conclusion that we can determine which event came first (i.e, the image or the blood), here again repeated once more:We can deduce that if the image formation process was the first event, the fluid substance, being the successive event and covering the image, could be removed using a proteolytic enzyme thus exposing the image color, which apparently is not affected by this or any other eliminative process, this function being better served by the diimide reagent.Therefore, it is possible to see if there is an image under the blood, and if it is not there following the above procedures, then reason forces us to conclude that the stains are an event occurring prior to the image process.Notwithstanding the committal of fraud to the contrary, Rogers’ scientific reputation and the rest of the scientists that worked directly with the shroud are greatly impugned if the above scientific “facts” are not facts at all.","date":"June 20, 2012 at 7:38 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"colinsberry: “But he was not doing good science, as that sentence you quote in bold shows.”I must remind you that Rogers wasn’t the only scientist working with the shroud.  The FAQ document is a summary of all the findings collected up to that point by all the scientists who were directly involved in administering the various kinds of tests that brought the shroud into the space age.  Are you saying, then, that the scientific reputation of these scientists are impugned?You wrote; “A chemist who knows of the existence of hemicelluloses, and has indeed mentioned them briefly as being more reactive than cellulose, would and should not have written that sentence, referring only to cellulose.”And yet, by your own admission, this contention about not involving the hemicellulose is a moot point since, axiomatically, the color is not due to a chemical reaction within the fibers, which if it was, would have also affected hemicellulose, not just the cellulose.  This explains why further elaborations concerning the fibers were not considered.  This, this also throws asunder the other statement you made in a posting dated June 14 @ 3:12 PM, viz: “we don’t know of it’s dehydrated cellulose or hemicellulose.” The fact of the matter is that we DO know the image was not due to chemical changes of the fibers.  Bringing this up as an argument point in an attempt to reason away the ability that science has of determining which came first (the image or the blood) is a sure way of stopping any meaningful progress, and just muddies the water.","date":"June 20, 2012 at 11:17 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"colinsberry: “On the contrary, Rogers was quite adamant that it was not the cellulose that was dehydrated, but other more reactive carbohydrates.”Mr.colinsberry, would you care to provide a link or source where readers could verify this?  I provided a link with Rogers’ findings and statements, and yet, you are saying that Rogers completely contradicts himself in another juncture.  This is starting to look fishy.  I was hoping you would have provided some back up, considering that the contradiction is a bug deal and would considerably undermine Rogers’ work.","date":"June 20, 2012 at 1:14 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"Adding another scientific fact: the colored coating cannot be dissolved, bleached, or changed by standard chemical agents.  Given these scientifically verified observations, IT IS THEN POSSIBLE to determine if an image exists under the stains, considering that the fluidy substance can be removed with a proteolytic enzyme which itself does not affect the image.","date":"June 20, 2012 at 11:29 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"David Mo: “But if the bloodstains are painted and the body image came later the conclusion suggests itself: it is also manufactured.”If that is the case, then our supposed forger/artist is a madman for no painter in his right mind will start with stains first and then draw out the image.  That is neither cost effective nor productively efficient, and would potentially undermine the work because of the risks involved.  The rarity, quality and expensiveness of the fabric alone would suggest that the alleged artist knew what he was working with, and had he failed with the correct placement of drops here or an outline of the image there, he would have squandered the whole artistic project.  Pure insanity.  We are the fools for having wasted so much time, money and energy  on a piece of trash fabricated by a genius gone zany.","date":"June 20, 2012 at 11:19 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"David Mo :See my comment June 19, 2012 at 1:59 am, please.Hello Mr. Mo.  I am aware of your comment.  I still cannot see how Lavoie’s work, who performed experiments with the blood flow patterns and made a case for the authenticity of the shroud, could be implicated in its denunciation.","date":"June 20, 2012 at 7:27 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"colinsbery: “So what’s your definition of a lab “Ironclad” ? Men in white coats? Distilled water on tap, test-tubes, Bunsen burners…?”I was referring to the actual scientific work done by Rogers and the other STURP members, who had the shroud in front of them, touched it, performed tests at close inspection and used instruments to arrive at the conclusions they have published for the rest of us who did not have the privilege.  As a stickler for precision and evidence, it is hard for me to accept scientific statements, that supposedly contravene these findings, made by people who have never even touched the shroud or performed rudimentary tasks as checking sample items under a microscope.colinsbery: “Whatever gave you the idea that a lab is needed to research the Shroud?”Our discussion does not concern general research, such as history and other similar academic fields that intersect the study of this object.  We’ve been strictly dealing with the scientific facts.  Have we not?  Where did I state that only scientists should be given the key?colinsberry: “I have been reporting experiments on my own Shroud blogs since Jan this year”Wait a minute.  You’ve conducted experiments with actual shroud specimens?  The real thing?  If not, wouldn’t that compromise your results?  From what I gather, there’s nothing in this planet quite like the shroud with its image, cloth and extraneous properties.  If you are going to state that the image was the first event and then the blood stains, because of some experiment with a cloth sheet that doesn’t share the properties of the Turin shroud, any reasonable person would justifiably have reservations about whatever conclusions that experimenter was trying to reach.","date":"June 20, 2012 at 5:49 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"colinsberry: “Phrases like “throws asunder” are not those customarily employed in scientific debate.”It is appropriate if at the other end a person is deprecating the lab work of a group of scientists without any demonstrable lab work of his own as a follow-up, falsifying those experimental findings he rages against.","date":"June 20, 2012 at 3:19 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"If I had forty fake $100 bills and one truly genuine $50 bill, it would only be a matter of time, through the testing fires of transactional exchanges made in commerce, when the forty fakes dissapear and the authentic one wins out.","date":"June 12, 2012 at 10:42 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"I agree Gabriel.  The profusion or proliferation of so many copies would rather substantiate the existence of a singular precursive model, which started the replication process.  And a way to identify that model is to see which one has consistently surfaced in history with much flair and fanfare.","date":"June 12, 2012 at 10:30 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"Max, this is precisely the message I intended with my analogy.  The same thing could be said with another topic engrossed with similar themes, i.e., the Book of Daniel.  Many skeptics not wanting to deal with the supernatural implications the book brought upon the table decided to devise the theory that a forger disguised himself as a prophet and pushed the book as if authentic.  A highly unlikely scenario given the kind of feverish conservatism of the Jewish polity and its leaders.","date":"June 12, 2012 at 11:08 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"Hello David,I’m curious about that observation.  So do you believe the bloodstains were placed after the formation of the image or before it?","date":"June 13, 2012 at 10:26 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"ironclad","post":"“The Peer Review Religion says all is in a peer review paper is Truth.”There’s a catch 22 with that statement when applied to other philosophical ventures, as for example in the area of biological origins, when we see a vast network of Darwinists who use the process, or at least the conceptual trappings of the phrase, as a barrier to entry of novel ideas or theories that may upend the Main Theory.","date":"June 13, 2012 at 10:43 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"}]}
