{"art":[{"author":"james_ginn","post":"If Jesus Christ really existed then why is there so little written about him. A few paragraphs by Josephus. This would be akin to future generations looking up JFK and finding only  a few paragraphs written about him.  I am a born again Christian not because I believe that Jesus Christ existed but because the meaning behind the allegory of the New Testament is a thousand times more powerful than the literal translation.And the original Christians knew the true meaning within the New Testament. How else could they allow themselves to be fed to the lions.  Certainly not because of the cute story we find in the literal translation. They knew and were changed by that deeper meaning.","date":"December 19, 2011 at 11:40 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"james_ginn","post":"Then you also believe that the story of Adam and Eve(another allegory) is real that it really happened that way. If you believe one part of the Bible is factual then you must beleive all of it is factual.And what has believing in a real Jesus Christ have to do with being Christian. There is far more to Christianity than simply worshipping a person whose existence has never been proven. If that is all you hang your Christianity on then you are certainly on shakey ground.","date":"December 28, 2011 at 12:09 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"james_ginn","post":"There is simply no proof that a person named Jesus Christ ever existed. Only by realizing that the word Christ actually means the soul can one make sense of the many mysterious passages in the New Testament. We must read the New Testament with an open mind and not pre conceived mindsets. We must apply reason and that is why Christianity is referred to as the religion of the logos or reason and discourse. If you cannot see the allegory for Christ on the cross and his rising from the dead then just go ahead and keep believing what you want.","date":"December 27, 2011 at 7:28 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"james_ginn","post":"“Think not that I am come to send peace on earth: I came not to send peace, but a sword. For I am come to set a man at variance against his father, and the daughter against her mother, and the daughter in law against her mother in law.” Mathew 10:34When you can explain this verse you will understand what I am talking about. But you dont understand it…  do you ?","date":"December 28, 2011 at 12:15 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"james_ginn","post":"He was the man whom Christianity is based upon. He performed miracles. Yet no one wrote about him. Highly unlikely.And as for that verse yes you are right it has to do with the great battle between those who live in their egos with all their emotions and those who are selfless and dwell more in their spiritual selves.It is amazing when you put these two types of people together one with a big ego and the other more neutral and with little ego. And hence the verse “And you shall be hated of all men for my name’s sake: ..”Yes it boils down to our egos versus the pure innocent neutral soul that we were born with.But I will never believe that Jesus Christ existed. There is simply no proof.","date":"December 28, 2011 at 2:34 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"james_ginn","post":"No  Christianity is not false. The New Testament is an allegory and its true meaning applies to every person ever born into this world. Its true meaning is exclusive of no one.","date":"December 27, 2011 at 7:43 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
