{"history":[{"author":"janvallone","post":"I just discovered this comment and am moved to respond.  If you visit the Shroud or study good photos of the rear image–both of which I have done–you can clearly see that Jesus’ hair–and I do believe the Shroud is that of Jesus–is pulled back into a ponytail.  This is one of the details that enabled me to viscerally understand that Jesus was indeed fully human and that both he and those who loved him–like his mother Mary–suffered great human pain when he was crucified. The Passion became less abstract to me because I too am both human and a mother.  But the fact that Jesus was human does not make him ordinary.  Doctrine teaches that he was both fully human and fully divine. I do not doubt the resurrection or Jesus’ divine nature.  The Shroud moved me to tears and seeing it remains one of the most precious, revelatory moments of my life.  What I mean by “straw” is that while the science and history of the Shroud are fascinating, the science and history of the relic, in the end, really aren’t that important.  If the Shroud were to be definitively discredited, it would not affect my theology one bit.  I borrowed the term “straw” from St. Thomas Aquinas, who said of his multi-volume theological treatise the Summa Theologica, which attempted to rationalize theology:  “The end of my labors has come. All that I have written appears to be as so much straw after the things that have been revealed to me.” When I studied books on the Shroud, I was studying science and history.  When I saw the Shroud, I was experiencing revelation, and revelation, when it comes to God, is really what counts, at least for me.Lastly, I am not a scientist, historian or theologian.  But I did do my research on the Shroud, and “the facts”  I mentioned in the essay came from legitimate sources.  Many sources contradict each other, which is why the Shroud is disputed in the first place.  Because of that, there really isn’t any set of facts about the Shroud that would be free from challenge.  I’m sorry to have made anyone cringe (see below).  I did my best.  In the end the essay was more about the heart than the head.","date":"November 26, 2014 at 1:25 pm","url":"https://shroudstory.com/2014/03/18/an-image-to-hold-onto-until-eternity/","cat":"history","title":"An image to hold onto until eternity."}]}
