{"dating":[{"author":"jason_engwer","post":"Regarding David Sox’s claims about an earlier carbon dating, it should be noted that Harry Gove comments on the subject in his book, Relic, Icon Or Hoax? (Bristol and Philadelphia: Institute of Physics Publishing, 1996), 281. According to Gove, he talked to Sox on the phone a few months after Sox’s alleged discussion with Peter Rinaldi occurred. Gove says that Sox told him that the earlier carbon dating occurred “six or seven years” earlier. If the Tablet article cited by Charles Freeman is claiming that the earlier carbon dating occurred in 1988, then Sox apparently contradicted himself. Does the Tablet article set the earlier carbon dating in 1988? Not that I noticed.I haven’t read much of Sox’s material. Does anybody know if he added any further details to his account anywhere else? The way Gove describes it, based on his phone conversation with Sox, makes the test sound like the 1982 one arranged by John Heller and Alan Adler and conducted in California. If that 1982 test was in view, that would help explain why Rinaldi and others remained so open to the Shroud’s authenticity, since the Heller/Adler 1982 test produced inconsistent results. By contrast, if the secret carbon dating cited by Sox had produced a consistent medieval result, why would Rinaldi and others in the know have remained so open to the Shroud’s authenticity? Sox’s 2010 article is referring to something other than the Heller/Adler test. It’s referring to a test in Italy that apparently produced more consistent results than the Heller/Adler one. The fourth paragraph in the Tablet article could be read as dating the test to 1988, but it seems ambiguous to me. If Sox did refer to a 1981 or 1982 test when speaking to Gove, but then referred to a 1988 test in his 2010 article, he contradicted himself. Even if he didn’t contradict himself, the notion that a 1981 or 1982 test consistently placed the Shroud around the same time as the official 1988 test is suspicious, since Rinaldi and others who would have been aware of that test from 1981 or 1982 didn’t act as if they knew the Shroud was medieval.","date":"April 21, 2015 at 6:20 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"author":"jason_engwer","post":"Max patrick Hamon,I doubt that George Rossman was involved in the 1982 test. If he was involved, it was probably in a secondary role:http://triablogue.blogspot.com/2014/04/the-1982-carbon-dating-of-shroud-of.html","date":"March 10, 2015 at 5:32 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"author":"jason_engwer","post":"The fact that people like O.K. are having to ask these questions in 2014, more than a quarter of a century after the tape of Adler was recorded, is a problem. Why has that portion of the tape not been posted online as an audio file, posted in transcript form online, described in detail online, or published in a book, for example? Why can we get occasional quotes and descriptions from people who have a copy of the tape, but with the full content withheld? What legal concerns would allow some people to have the tape, allow them to play it for some people, and allow them to discuss portions of the tape with some people (or with the general public, as Joe and his wife did in 2002), but wouldn’t allow them to make the fuller contents of the tape more widely known? Why do we keep getting such highly selective snippets of the tape’s contents after the tape has been in existence for more than a quarter of a century?And why did Joe and his wife not expand on their comments after their response to Caltech? They had years to describe and document the evidential nature of the phone records they had, explain how much Joe could corroborate the phone call, document that people had heard Rossman’s name circulating in association with the 1982 test prior to 2002, produce a transcript of the relevant portions of the tape, interact with Caltech’s claims about the dating capabilities their staff had in 1982, etc. Instead, it’s been a dozen years since Joe and his wife’s response to Caltech, and there’s been no follow-up. That’s one of the reasons why their side of the dispute has some significant credibility problems.","date":"April 29, 2014 at 7:13 pm","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"},{"author":"jason_engwer","post":"Joe,We’re in a situation in which reputations are at stake on both sides. If you’re going to frame this situation as one involving “casting aspersions”, then there’s no way to take a position on these matters without casting aspersions in one direction or the other. If it’s wrong in principle to do that to your wife, then it’s wrong in principle to do it to somebody on the other side. But that’s what you’ve been doing.My reference to misleading claims was about the distinction between Jerry Wasserman and George Rossman. In your 2002 article that Caltech responded to and your later reply to Caltech, you say that Adler identified the scientist in question as Rossman. That’s misleading. If Adler gives both the first and the last name of the scientist, and both names differ significantly from George Rossman, then making an unqualified statement that Adler identified Rossman is misleading. Your claim could have been made without any intent to deceive, yet still be misleading. (Elsewhere in my article, when discussing whether people like Heller and Adler lied, I refer to “lying”. I deliberately avoided that sort of terminology in the section we’re discussing. I was intentionally leaving the language ambiguous.) For reasons I explained in the article, it’s probable that Adler was referring to Wasserburg. To lead people to the conclusion that Rossman was identified instead is to mislead. Even if the misleading didn’t involve an intent to deceive, it’s still a form of misleading that Rossman hasn’t been guilty of in any relevant context, as far as I know.When Ray Rogers raised doubts about your wife’s credibility, as described in the Ottawa Citizen article I cited, did you respond to him with the sort of all-caps, “I AM EXTREMELY UPSET” approach you’ve taken here? Rogers’ comments were harsher and more dismissive than mine. I think my comments were more restrained than they needed to be and appropriate for the context.You and your wife significantly mishandled your treatment of the 1982 test, and that mishandling has led a lot of people astray on that issue for more than a decade. But I’m grateful for the many good things you and your wife have done in Shroud research over the years, and I’m sure you’ll do more in the years to come. I hope your future work will include a revisiting of the 1982 test. You have the tape of the 1988 interview with Adler, which gives you a significant advantage that the vast majority of other researchers don’t have. I wish you well. I don’t want to be acrimonious.I’ll expand on some of these things when I get a chance to respond to your email, probably tonight or sometime tomorrow.","date":"April 28, 2014 at 8:50 pm","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"},{"author":"jason_engwer","post":"O.K.,How would we get to the conclusion that Rossman probably, not just possibly, was involved? I’m not aware of any evidence to that effect aside from Sue Benford’s alleged phone call with Rossman, which I doubt occurred as she described. I’ve explained some of the reasons why in my article, and I have other reasons.I suspect that most people over the years who have accepted the Rossman allegation have done so primarily on the basis of Al Adler’s alleged testimony. What if those people had known that Adler names the scientist he’s discussing as Jerry Wasserman?","date":"April 29, 2014 at 6:34 pm","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"}],"image":[{"author":"jason_engwer","post":"Here’s a thread from this past May, in which the same issue was discussed. I still believe that the resurrection offers the best explanation for the Shroud image and other aspects of the Shroud. (Remember, it’s not just a matter of explaining the image. There’s more than an image to explain.) If anybody’s interested, I summarize my reasons for thinking the resurrection is the best explanation in post #14 in that thread. (If the post numbers change because of more posts being added to the thread, then look for a response I wrote to daveb of wellington nz at 6:21 P.M. on May 23.)","date":"July 21, 2013 at 8:47 pm","url":"https://shroudstory.com/2013/07/20/any-good-reasons-for-associating-anything-supernatural-with-the-shroud/","cat":"image_theory","title":"Any good reasons for associating anything supernatural with the shroud?"},{"author":"jason_engwer","post":"I was aware of the Jospice Mattress, but I wasn’t including it as a similar image. Even if we were to include it, the phenomenon would still be tremendously rare. Barrie Schwortz has described the sort of Maillard reaction that would produce something like the Shroud as “astronomically” unlikely as a natural occurrence. See minute 36 of the second hour of the July 21, 2012 program linked here.It could be suggested, as daveb has above, that “a secondary miracle” occurred, but that would still be distinct from what’s normally classified as a naturalistic explanation. An event, such as an apparent answer to prayer, is often considered miraculous because of its timing or some other aspect of its surrounding context, even if the event wouldn’t be considered miraculous independent of that context. If somebody wants to suggest that the Shroud image was produced by a Maillard reaction that was miraculous in that sense or was produced by some other miracle similar to a Maillard reaction, that’s not what would usually be classified as a naturalistic explanation.One of the questions here is whether we should prefer a series of naturalistic and/or secondary miraculous explanations over a single miraculous explanation (the resurrection). The latter is simpler, we have good evidence independent of the Shroud that it occurred, and it seems to have occurred in a way that’s consistent with the Shroud characteristics. The state of the body image on the Shroud seems consistent with the timing of Jesus’ resurrection, the failure of naturalistic explanations of the Shroud is consistent with the supernatural nature of the resurrection, and the uniqueness of the image is consistent with the uniqueness of the resurrection. Even if it would be argued that the resurrection produced a Maillard reaction or something similar, which in turn resulted in the image we see, the resurrection would still be behind those secondary causes as a root cause.Once you add the other characteristics of the Shroud, like the intact condition of the cloth and bloodstains, it becomes even more untenable to maintain that the Shroud is the result of a series of naturalistic and/or secondary miraculous causes. And the characteristics I’m highlighting here, namely the cloth image and the intact nature of the cloth and bloodstains, make sense as characteristics that an intelligent agent would want to produce. They aren’t just odd occurrences that don’t seem to serve any significant purpose. Rather, the Shroud image is highly significant in multiple contexts, such as in serving as evidence for the events surrounding Jesus’ death. And supernaturally removing the individual from the Shroud (as implied by the intact nature of the cloth and bloodstains) makes sense insomuch that a resurrected individual would have to somehow be removed from the cloths binding him, and that manner of removing the body is more effective in preserving the cloth. Less significantly, but still worth noting, removing the body that way is more dignified. Just as Jesus surely was provided with clothing supernaturally after the resurrection, instead of having to leave the tomb naked and having to find clothing somewhere, it makes sense for him to be removed from his burial cloths in a similar manner. The significance of these characteristics of the Shroud (the image and the intact nature of the cloth and bloodstains) serves as further evidence against the conclusion that the characteristics are just the results of a blind, aimless, purposeless naturalistic process, such as a non-miraculous Maillard reaction.","date":"May 23, 2013 at 6:21 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"author":"jason_engwer","post":"Max Patrick Hamon,I don’t know much about the clothing of ancient Jewish gardeners. But when John 20 refers to “the linen wrappings” remaining in the tomb, the more natural reading seems to be to see the passage as referring to all of the wrappings, not just some. And I’ve tended to think of Jesus’ post-resurrection clothing as more extensive than what you seem to be suggesting, perhaps including some sort of head covering. That would help explain why some people didn’t recognize him. That’s not much of an argument, but I think it carries a little weight.We don’t have much to go by here. You could be right.If you are right, then I’d just shift my illustration from the risen Jesus to somebody else. The angels God sometimes sends to earth in the Bible, for example, seem to be supernaturally provided with clothing. When angels visit earth in human form, it’s doubtful that they had to go search for clothing. It would have been provided for them in some supernatural manner, I would think. The same seems likely with the risen saints in Matthew 27:52-53.","date":"May 24, 2013 at 9:55 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"author":"jason_engwer","post":"Yannick,You’ve made some good points that I agree with. Belief in Jesus’ resurrection doesn’t depend on the Shroud. And I didn’t intend to imply that Ray Rogers was thinking of a miracle when he referred to more than a Maillard reaction being involved. I agree that it would be unreasonable to interpret Rogers that way. I don’t think Barrie Schwortz did anything wrong in mentioning Rogers’ comments in the way he did, and I don’t think I misrepresented anything in my post. Just after I quoted Schwortz’s comments, I mentioned how significant the Shroud would be even if it weren’t best explained by Jesus’ resurrection.I disagree with your comments about a God-of-the-gaps appeal, however. Naturalism-of-the-gaps is no substitute for God-of-the-gaps. We’re under no obligation to endlessly suspend judgment until a naturalistic explanation comes along. Why assume that everything has a naturalistic explanation? You refer to what’s appropriate in “a scientific [discourse]”. But judgments about the Shroud, like judgments about many other matters in life, involve more than science. Philosophy, history, and other fields are involved as well. And the nature of science is itself a disputed issue. If there is a God, and he acts in history, why think that science wouldn’t be able to discern some aspects of that activity? Yes, more than science would be involved, but science wouldn’t be excluded. Similarly, science can discern some aspects of the activity of non-supernatural agents, like humans, even though more than science is involved in analyzing human activity.We have good evidence for Jesus’ resurrection and its surrounding context independent of the Shroud. I’m not appealing to ignorance. I’m not appealing to some sort of God-of-the-gaps. Rather, I’m appealing to something, the resurrection, that we have good reason to believe occurred at a time in Jesus’ life that seems to align with the timing of the Shroud image. I’m appealing to an event (the resurrection) that would involve the removal of the body from the Shroud in an unusual way, which aligns well with the unusual intact condition of the cloth and bloodstains. I’m appealing to the supernatural and unique nature of an event (the resurrection), which aligns well with the failure of naturalistic explanations for the Shroud and the Shroud’s apparent uniqueness. In other words, I’m appealing to a series of close alignments between an event we have good evidence for, Jesus’ resurrection, and the Shroud characteristics. That’s not an appeal to a God-of-the-gaps. And it’s preferable to an appeal to multiple naturalistic alternatives, at least one of which has yet to be identified. An appeal to a known resurrection seems preferable to an appeal to a largely unknown naturalism-of-the-gaps. I’m not impressed by the unpaid IOUs of naturalists.You ask how we can be “certain” and “sure” about my conclusions. We don’t need certainty. Probability is enough. And that probability is revisable. If a better naturalistic explanation becomes available in the future, then we can adopt it at that point in time. At the present, however, Jesus’ resurrection is a better explanation.You also ask, “What make you think Jesus is the only crucified person to have left an image on his burial cloth?” I see no reason to think that only crucifixion victims would meet the criteria.Even if we limited our analysis to such individuals, I doubt that no other historical references would have been made to such images if they occurred commonly or even if they occurred more than a tiny percentage of the time. What we have access to today isn’t all that’s relevant. We also have to consider the lack of such cloths mentioned in the historical record. Did people in the ancient world act as though seeing such images on burial cloths was a common thing? How did people in late antiquity and the early medieval era get the notion that such an image would be miraculous if they had been seeing it happen regularly for centuries in non-miraculous contexts?Keep in mind, too, that crucifixions and other such executions continue to occur in the modern world. It’s not just a matter of what ancient or medieval sources tell us about burial cloths or equivalent objects. It seems to me that there have been many opportunities for the Shroud image to be duplicated under such scenarios. It hasn’t happened.And I didn’t just appeal to the image on the cloth. I also appealed to the condition of the cloth and what it suggests about how the body was removed. Even if it were common for images like the Shroud image to form, the image isn’t all that needs to be explained.","date":"May 22, 2013 at 7:09 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"author":"jason_engwer","post":"Yannick wrote:“You got the right to believe this and you also got the right to share it with others, but be certain that no credible scientist that is INDEPENDENT OF MIND on the subject would ever agree with you if he would study all the available data and observations coming from the Shroud.” Those “credible” and “independent of mind” qualifiers are ambiguous and debatable.But what’s the significance of your objection, even if I grant your premises? As I explained in my last reply to you, I’m not limiting myself to scientific conclusions, and I’ve been open about how my Christian beliefs affect what I conclude. All you seem to be saying above is that my conclusions wouldn’t be reached by somebody who’s limiting himself to science and meets your criteria for being “credible” and “independent of mind”. So what? I don’t deny that my conclusions would be different if I applied different standards. And you aren’t giving us any reason to adopt your alternative standards. If a scientist doesn’t believe in Jesus’ resurrection based on the good evidence we have for it that’s independent of the Shroud, then so much the worse for that scientist. He’s wrong. I’m not obligated to follow him in his error.You wrote:“That’s why I said that your opinion on the Shroud is much more a religious one than a scientific one.” Those aren’t the only two categories we should be concerned with. And a religion like Christianity, which bases itself on historical claims and appeals to objective evidence, involves fields of knowledge that are of an evidential nature, such as history. Furthermore, science is likewise associated with other fields of knowledge, such as philosophy and history. Your arguments about science in this thread are philosophical arguments. It’s not as though we can place your arguments in a beaker and test them in a laboratory. (Even if we could, as soon as somebody would report what happened in that experiment, the report would involve historical claims.) None of us rely strictly on science for our conclusions about the Shroud. All of us are bringing philosophical views, historical beliefs, and other non-scientific perspectives to the table.You wrote:“But the thing is this : the fact that STURP came up empty doesn’t mean at all that the image is due to a supernatural event linked with the Resurrection of Christ.” I agree. But I didn’t base my argument on STURP’s failure to find a naturalistic explanation. I didn’t even mention STURP. The long train of failed naturalistic explanations goes well beyond STURP.You wrote:“I will conclude with this great quote from Carl Sagan that fits very well in the case of the Shroud image, absence of evidence (for the moment) is not the same thing as evidence of absence…” See what I said earlier about the evidence for the resurrection theory (not just an absence of evidence for an alternative), as well as what I said about naturalism-of-the-gaps, endlessly suspending judgment, etc.Yannick, I agree with you on a lot of the issues that come up on this blog, probably the large majority. When I’m posting on Shroud topics at my blog, I often point people to your comments here. But I’ve never understood why you’re so adamant in opposing supernatural views of the Shroud, given how good the evidence is for such a view.","date":"May 23, 2013 at 7:00 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"author":"jason_engwer","post":"If Jesus would violate the second commandment by leaving an image on a cloth, then did he violate the commandment when he left footprints on the ground, left fingerprints on objects he touched, cast a reflection of himself on water he walked past, left an image of his appearance in the minds of people who saw him, etc.?Even before the New Testament era, the Jewish people were permitted to include images in the structure of the temple, create a bronze serpent, etc. The second commandment doesn’t forbid all images. Rather, it forbids the creation or use of images for improper veneration. See 2 Kings 18:4 for an illustration of that distinction. As we see in that passage, making and preserving the bronze serpent wasn’t sinful. What was sinful was the improper veneration of the image that eventually developed.","date":"August 5, 2013 at 7:25 pm","url":"https://shroudstory.com/2013/08/05/why-would-jesus-defy-the-2nd-commandment-and-create-a-graven-image-unto-himself/","cat":"news_&_views","title":"Why would Jesus defy the 2nd commandment and create a \"graven image\" unto himself?"},{"author":"jason_engwer","post":"Regarding Isaiah’s Suffering Servant passages, I see no reason to think the Shroud is inconsistent with them. Isaiah 52:14 refers to the human form in general, not just some parts of it. It seems to be referring to a significant disfigurement, a significant departure from what humans normally look like. The Shroud image meets that standard. Having thorns driven into your head, nails driven through your wrists and feet, scourging wounds covering your back, legs, and other parts of your body, a spear thrust through your rib cage, etc. constitute a significant disfigurement.How far are we going to take our interpretation of Isaiah? How disfigured are we supposed to think Jesus was? If Jesus didn’t look like a human at all, then what are we supposed to think he looked like? A blob? A giraffe? How were people able to put clothes on Jesus (Matthew 27:31), how were the Roman soldiers able to tell where to place the nails, why did people continue to speak to him while he was on the cross, how was his mouth discernable (Matthew 27:48), how were the Roman soldiers able to discern that he was dead (John 19:33), how was the precise area of his rib cage that needed to be pierced discernable (John 19:34), etc.? Clearly, the Biblical authors I just cited didn’t take Isaiah in the absurd way that some critics of the Shroud suggest we should. Jesus was significantly disfigured. But his body as a whole and individual parts of it were still recognizable as human. That’s what the Bible reports, and it’s what we see in the Shroud.","date":"August 5, 2013 at 7:45 pm","url":"https://shroudstory.com/2013/08/05/why-would-jesus-defy-the-2nd-commandment-and-create-a-graven-image-unto-himself/","cat":"news_&_views","title":"Why would Jesus defy the 2nd commandment and create a \"graven image\" unto himself?"}],"misc":[{"author":"jason_engwer","post":"Thanks, Dan and Andy. If anybody else knows of any significant resources, please mention them. I’m especially interested in audio files on Shroud-related topics. I drive a lot, and I often use my MP3 player in my car.","date":"May 7, 2013 at 5:48 pm","url":"https://shroudstory.com/2013/05/07/enhance-the-blog/","cat":"news_&_views","title":"Enhance the Blog"},{"author":"jason_engwer","post":"You’ve accomplished a lot here, Dan. I hope you find somebody or a group of people to take over the blog for you. Even if you don’t, the archives should help a lot of people for many years to come, as you’ve already helped so many people, including me. Your work has been significant and appreciated.I also appreciate what the commenters here have offered. I’m indebted to all of you.","date":"December 16, 2015 at 8:27 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"author":"jason_engwer","post":"Hugh, I don’t think that “believers in miracles have nothing to investigate”. The Shroud image has characteristics that can be investigated. And God may have used some natural means to bring about the miracle, as in my rainfall example mentioned above. The natural means could be investigated. Or the means might be partially supernatural and partially natural. Even the supernatural element could be investigated, such as how the supernatural activity in question interacted with the natural world. If we can’t fully explore the supernatural element, it doesn’t follow that there’s nothing to investigate. Furthermore, since belief in a miraculous Shroud image is a probabilistic belief, not a certainty, we’d have to consider the possibility that the belief is wrong. We should examine the alternatives. Just as proponents of the miraculous view of the image would have an interest in seeing their opponents explore naturalistic alternatives (as I mentioned earlier with regard to Nickell and Garlaschelli), those who hold the miraculous view would have an interest in exploring those alternatives themselves. I don’t think those who don’t hold the miraculous view are the only ones who should be investigating naturalistic alternatives. I think both sides should do it.","date":"April 1, 2014 at 8:43 pm","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","title":"The Shroud that Defies Scientific Explanation (Part 2)"},{"author":"jason_engwer","post":"Larry Shapiro claims that those who believe in miracles “have to be prepared to deny that any unknown natural cause might explain the event”. That’s false. The issue is what’s probable, not what “might” be true. And belief in miracles, like other beliefs, is provisional, meaning that we can adjust our belief in the future if changes in the state of the evidence warrant such an adjustment. We don’t endlessly suspend judgment, just because the state of the evidence might change in the future. Why should we think a possible naturalistic explanation in the future always justifies refraining from reaching the conclusion that a supernatural event has occurred? Does Shapiro apply his reasoning consistently? Would he apply his reasoning to SETI, for example? If we received signals from outer space that seemed to indicate communication from intelligent life forms, should we endlessly suspend judgment, endlessly waiting for some explanation of the evidence that would be consistent with the nonexistence of aliens?How does Shapiro even know what the limits of nature supposedly are? He tries to smuggle in naturalism or something similar through the back door when he refers to a miracle as “something vastly improbable”. The probability of an event depends on factors like whether God and other relevant beings exist. Without an argument for something like atheism, why should we think it’s “vastly improbable” that any miracle would occur? If Shapiro’s calculation of the prior probability of an event depends on the assumption of atheism or something similar, then his calculation is only as good as that assumption. And he hasn’t given us any argument for atheism or the like, but instead refers to how he “isn’t interested in arguing over whether there is a God or not”, according to Doug Erickson (the reporter in the story Dan has cited). What Shapiro seems to be doing is assuming atheism or something like it, all the while acting as if he’s arguing from some sort of neutral ground. He’s not.Even if a miracle claim is thought to be highly unlikely upfront, a high prior improbability can be overcome more easily than people often suggest. All of us, skeptics included, accept many conclusions in life that initially seemed highly improbable. See, for example, J.P. Moreland and William Lane Craig, Philosophical Foundations For A Christian Worldview (Downers Grove, Illinois: IVP Academic, 2003), 569-70. And see here for an article by another philosopher, Timothy McGrew, arguing for how the evidence for Jesus’ resurrection would outweigh a high prior improbability, even if we thought the event seemed highly improbable upfront. The article by McGrew (and his wife) doesn’t even take the Shroud of Turin into account. They’re arguing that the resurrection evidence is good enough to overcome an initial high improbability even if we ignore the Shroud. I want to repeat something I said in another thread here recently. I recommend that people consult Craig Keener’s two-volume work Miracles (Grand Rapids, Michigan: Baker Academic, 2011). Keener is a highly-regarded New Testament scholar who recounts many miracles that he and his associates have experienced, as well as a large number of other miracles in modern times. He includes cases with medical documentation (e.g., before-and-after x-rays), multiple eyewitnesses, and corroboration from hostile sources, for example. He also interacts at length with David Hume’s philosophical objections to miracles. (Shapiro, the philosopher Dan’s post is referring to, appeals to Hume.) If anybody is interested, I wrote a series of posts about Keener’s work a couple of years ago. You can find it here. In the series, I cite many of Keener’s findings and give examples of miracle cases he discusses that are accompanied by documentation.","date":"March 31, 2014 at 6:00 am","url":"https://shroudstory.com/2014/03/31/the-shroud-that-defies-scientific-explanation/","cat":"news_&_views","title":"The Shroud that Defies Scientific Explanation?"},{"author":"jason_engwer","post":"Shapiro’s arguments against Christianity are bad. He refers to the gospels, but doesn’t interact with earlier sources, like Paul’s letters and the even earlier resurrection creed Paul refers to in 1 Corinthians 15:3-8. Shapiro claims that we don’t know who wrote the gospels, but he doesn’t interact with the arguments to the contrary. Why doesn’t he interact with, say, Martin Hengel’s arguments that the titles of the gospels (including the authors’ names) should be dated early? Craig Keener has published a commentary on John’s gospel, with an introduction that’s a few hundred pages long, arguing for the traditional attribution to the apostle John. Keener has also recently published a five-thousand-page commentary on Acts, in which he argues at length for the traditional authorship and historicity of Luke’s writings. Shapiro gives us no reason to think that scholars like Keener are wrong and that he’s right.It should be noted that we have widespread corroboration of the authorship of the gospels from ancient non-Christian sources (Marcion, Celsus, Porphyry, Julian the Apostate, etc.). Those today who reject the authorship attributions aren’t just disagreeing with the ancient Christians, but also with the ancient Jewish and pagan opponents of the religion. We find ancient non-Christian sources disputing the authorship of Old Testament books, such as the Pentateuch and Daniel, as well as some of the New Testament in a minority of cases, and the ancient Christians sometimes disputed the authorship claims among themselves (whether Peter wrote 2 Peter, whether John wrote Revelation, etc.). Thus, it can’t be argued that they were just uncritically accepting whatever authorship claims were made or never thought of the possibility that the attributions were wrong. They knew that the attributions could be wrong, and they sometimes disputed them, yet we see widespread acceptance of the traditional authorship attributions of the gospels among both ancient Christians and non-Christians. For some examples of the evidence from these non-Christian sources, see John Cook’s The Interpretation Of The New Testament In Greco-Roman Paganism (Peabody, Massachusetts: Hendrickson Publishers, 2002), e.g., 140, 184, 198, 203, 235, 263, 289, 297, 301, 303-304.Shapiro tells us (according to the reporter summarizing Shapiro) that “the scribes who eventually copied the original documents were sometimes illiterate or had religious agendas and would adapt the documents they copied as they saw fit, he said”. Who cares? Shapiro is repeating the mistake he made in another context I discussed above. The issue here isn’t what “sometimes” happened. Rather, the issue is probability, what usually happened. Even Bart Ehrman, an agnostic and highly anti-Christian New Testament textual scholar, admits that the early Christian scribes were usually honest and copied the documents reliably: “It is probably safe to say that the copying of early Christian texts was by and large a ‘conservative’ process. The scribes – whether non-professional scribes in the early centuries or professional scribes of the Middle Ages – were intent on ‘conserving’ the textual tradition they were passing on. Their ultimate concern was not to modify the tradition, but to preserve it for themselves and for those who would follow them. Most scribes, no doubt, tried to do a faithful job in making sure that the text they reproduced was the same text they inherited.” (Misquoting Jesus [San Francisco, California: HarperSanFrancisco, 2005], 177)Furthermore, when textual issues came up in disputes between the early Christians and their enemies, the general trustworthiness of the transmission of the texts was agreed upon by both sides. We see this in Justin Martyr’s Dialogue With Trypho and Origen’s treatise Against Celsus, for example. The early enemies of Christianity were aware that some people, like the Marcionites, changed the New Testament text. But both the early Christians and their early enemies agreed that such changing of the text was exceptional rather than normative. The process of the textual transmission of the New Testament, like the transmission of other ancient texts, was generally trustworthy.","date":"March 31, 2014 at 6:25 am","url":"https://shroudstory.com/2014/03/31/the-shroud-that-defies-scientific-explanation/","cat":"news_&_views","title":"The Shroud that Defies Scientific Explanation?"},{"author":"jason_engwer","post":"I want to address something I didn’t have time to discuss before leaving for work this morning. Dan asks a good question at the end of his post: “Defies scientific explanation, is that good enough?” The answer depends on what’s meant by “defies scientific explanation”. Since the phrase is so ambiguous, it could be taken in a sense that would be incorrect. For example, should we conclude that the Shroud image is miraculous just because the means of producing such an image hasn’t been scientifically explained yet? No. Something else would be needed, such as the timing of the image formation, in order to make a case for a miracle. When you take into account factors like the nature of the person apparently depicted in the image (Jesus) and the timing of the image formation, the event becomes more significant than it would have been without those other factors. To cite another example, events that we wouldn’t consider miraculous by themselves are often considered miraculous if their timing aligns with prayer in some significant way. Rainfall isn’t miraculous. But if other factors are added, a case can be made that a miracle has occurred. Maybe the rain started just after you prayed for rain, the rainfall accomplishes something that has theological significance, something else significant that you prayed for happened around the same time the rain started, etc.Sometimes it’s objected that classifying the Shroud image as a miracle, or associating it with a miracle, would bring about an end to scientific investigation of the image. I don’t see why that would be the case. People often continue to investigate something they consider miraculous. I wouldn’t want scientific investigation ended. I’d encourage people to keep investigating the image. And the people who aren’t convinced that the image is miraculous would keep on investigating it regardless of what other individuals believe. I doubt there are many people who want an end to the investigation. The more the Joe Nickells and Luigi Garlaschellis of the world fail to duplicate the image, the more my view of the matter is strengthened. Keep it up! And if I’m wrong about the image’s miraculous nature, or if there’s some natural means of duplicating an image that was created by some other means that was miraculous, I want to know that. I don’t want an end of the investigation.","date":"March 31, 2014 at 6:50 pm","url":"https://shroudstory.com/2014/03/31/the-shroud-that-defies-scientific-explanation/","cat":"news_&_views","title":"The Shroud that Defies Scientific Explanation?"},{"author":"jason_engwer","post":"Crossan has identified himself as an atheist in the past. See Paul Copan, ed., Will The Real Jesus Please Stand Up? (Grand Rapids, Michigan: Baker Books, 1998), 49-51. In a debate on Jesus’ resurrection with William Lane Craig, Crossan was asked by Craig whether God existed before humans came into existence. Crossan eventually answered, “Well, I would probably prefer to say no” (51). He seems to view God as some sort of figment of the human imagination. Thus, God didn’t exist before humans did. He can claim to believe in God only by defining God differently than the term is usually defined.I recently heard that Borg has identified himself as an atheist in some manner. I don’t know whether that’s true, and I haven’t come across any confirmation yet.Regardless, both men are radically liberal and wrong on a lot of significant issues.","date":"April 14, 2013 at 4:42 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","title":"Yeah, right!"}],"opinion":[{"author":"jason_engwer","post":"I want to correct something I remembered wrongly. In the study of the death experiences of felons, there was one who had a negative experience. You can read an article about the study here.","date":"July 26, 2013 at 6:48 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"author":"jason_engwer","post":"I apologize, but I need to correct something else. The right link for my series of articles on NDEs is here.","date":"July 26, 2013 at 6:59 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"author":"jason_engwer","post":"jesterof wrote:“Except that these inmate studies were NOT standard NDEs” And I didn’t call them NDEs. But they’re closely related.You refer to “when a person experiences DEATH”. But the definition of death is disputed, and NDEs occur under a wide variety of circumstances. For example, they sometimes occur when death is being anticipated, but prior to the event that’s expected to cause it (e.g. a falling person leaving his body and seeing it fall before it hits the ground). Or they occur during the normal course of surgery, when the body is shut down in some way, but the person is expected to survive. To cite one study mentioned in the book by Greyson, et al. that I referenced above, “Whereas 82.5 percent of persons having the NDE believed they had been near death, medical records confirmed their claims in only 45 percent of cases.” (27-28) And having been “near death” isn’t the same as having died.The study of felons that I cited is noteworthy because of the involvement of felons. They’re a class of people who tend to have low moral character. But the same type of result (the nature of the experience not corresponding with the moral character of the experiencer) has been demonstrated in NDEs as well. Even if we were to set aside the felons study for the sake of argument, the same conclusion would remain. You can be a good person by common human standards, yet have a negative NDE. You can be a bad person by common standards, yet have a positive NDE. It happens frequently. And some of the NDEs are mixed (partly good and partly bad) or neutral in some significant way.","date":"July 26, 2013 at 10:57 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"author":"jason_engwer","post":"jesterof wrote:“Death visions BEFORE actual death are not even close to described NDEs – at least not those in the link to the study you have provided – in terms of actual basic conditions they have to meet.” I cited a book by some of the foremost near-death researchers in the world, which discusses many cases that are inconsistent with your standards. I also linked an article by Nancy Evans Bush, a prominent researcher in the field. In that article, she makes the same sort of comment I’ve made about similarities between deathbed visions and NDEs:“So far as anyone knows, deathbed visions differ from near-death experiences only in the fact that their experiencers don’t come back afterwards. Otherwise, the descriptions are virtually identical.”If you read the book by Greyson, et al. that I cited earlier, you’ll see that NDEs occur under a wide variety of circumstances. And their contents differ widely. For example, tunnels (one of the features you mentioned) are common in NDEs in some parts of the world and among some groups, but not elsewhere. Researchers don’t exclude an experience just because it doesn’t have a tunnel or some of the other features you mentioned. You may disagree with the NDE standards that are commonly accepted in the field, but those are the standards.Remember, the definition of death is itself a disputed issue. For that and other reasons, it makes sense for researchers (and the rest of us) to define NDEs broadly. For example, if a person describes events that occurred far away from his body, events he shouldn’t have known about through his normal bodily senses, then objecting that the person didn’t experience “clinical death” is an insufficient response. In other words, evidence of the paranormal can be present without death having occurred. Even if we limit ourselves to a consideration of the afterlife (not something like the paranormal or religious miracles more broadly), which Dan didn’t do in his original post, there can be implications for the afterlife in NDEs that don’t meet your standard. An NDE can serve as evidence for the existence of the soul, evidence for how a soul would operate outside of a body, etc. without having the criteria you’ve laid out.And it’s not as though we should expect God to decide what to do in people’s lives based on whether a human definition of clinical death has been met. If God knows that the person will ultimately return to normal human life, then he may withhold any experience of the afterlife from that person. In that sense, there aren’t any NDEs that qualify as experiences of the afterlife. Everybody involved comes back. The clinical death criterion that you’re focusing on has some value, but it has to be qualified by factors like what I’ve outlined above. And NDEs that don’t meet the clinical death criterion still have some significance.","date":"July 27, 2013 at 1:49 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"author":"jason_engwer","post":"jesterof,You’re referring to “some” researchers you don’t name. By contrast, I’ve cited one of the standard books in the field, to which some of the leading researchers contributed. Similarly, see the broad definition of NDEs found at the IANDS web site here.I didn’t “equate” deathbed visions and NDEs. I said they’re closely related.You tell us, “Definition of death is not a disputed issue. TIMELINE is.” The timeline is part of the definition.You say that you’re “against lumping together into NDEs group everything, without clear-cut distinctions”. I haven’t suggested that we shouldn’t make clear distinctions. But there’s no reason for you to expect me and other people to single out the one category of NDEs that you’ve singled out and only discuss that category.You tell us what we should do “If one wants to cut off all the possible dismissal from the skeptics”. We don’t need clinical death in order to demonstrate that skeptical explanations are unlikely. I’ve already explained some of the reasons why. Paranormal phenomena can be present without clinical death having occurred. We don’t need clinical death in order to judge that a skeptical scenario is improbable. For example, if a person’s brain is operating at a low level, yet a person had a high level of perception during his NDE, the fact that the person wasn’t clinically dead doesn’t explain why he had such a high level of perception during the NDE. The skeptic still has some explaining to do.You go on to refer to “pure” standards and how CPR “kind of clouds” our judgment. You seem to be setting the bar too high. All we need is a probability. Even if it’s just a slight probability, that’s enough. We’d prefer to have a higher level of probability, but a preference isn’t equivalent to a necessity. If there seems to be a probability that an NDE is paranormal, but a skeptic isn’t convinced by it, then so much the worse for the skeptic. He’s not our measuring stick.I agree that the Pam Reynolds case is significant. For those who don’t know much about NDEs, that case is a good one to start with. A lot of the popular ones are of a much less evidential nature.","date":"July 27, 2013 at 7:20 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"author":"jason_engwer","post":"jesterof wrote:“I named her – it was YOUR link on Ms. Bush.The other one is Pim van Lommel” Even if we assumed that both of those researchers were following the standards you’re suggesting, they’d still be far outnumbered by the other researchers I cited.But nothing in the article by Nancy Evans Bush, which I linked above, suggests that she disagrees with what I said. She was a contributor to the book I cited by Greyson, et al. She served as president of IANDS in the past, the organization whose web site I linked above. And I quoted her comments on the relationship between NDEs and deathbed visions. She cited the felon study and related it to NDEs.And you can’t conclude that because Pim van Lommel conducted a study in a particular way, then he must deny that any experience that occurs under other circumstances is an NDE. Nor can you conclude that he’d deny that other NDEs have any relevance to a discussion like the one that’s occurring in this thread. If you want to cite van Lommel in support of your position, you’ll need more than what you’ve asserted above, and you’ll need to provide documentation for it.Here’s part of what van Lommel and his colleagues say about NDEs in their study results published in 2001:“NDE are reported in many circumstances: cardiac arrest in myocardial infarction (clinical death), shock in postpartum loss of blood or in perioperative complications, septic or anaphylactic shock, electrocution, coma resulting from traumatic brain damage, intracerebral haemorrhage or cerebral infarction, attempted suicide, near-drowning or asphyxia, and apnoea. Such experiences are also reported by patients with serious but not immediately life-threatening diseases, in those with serious depression, or without clear cause in fully conscious people. Similar experiences to near-death ones can occur during the terminal phase of illness, and are called deathbed visions. Identical experiences to NDE, so-called fear-death experiences, are mainly reported after situations in which death seemed unavoidable: serious traffic accidents, mountaineering accidents, or isolation such as with shipwreck.”Notice that they not only disagree with you about the definition of NDEs, but also make comments about deathbed visions similar to my comments and those of Nancy Evans Bush. They applied narrower standards to the study they were conducting, but it doesn’t follow that they held the same view you do of any experience that doesn’t fall within those narrower standards. For example, if a researcher wanted to focus on NDEs among children, and thus only included children in a study he conducted, it wouldn’t’ follow that he thinks an experience involving an adult doesn’t qualify as an NDE.","date":"July 28, 2013 at 5:16 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"author":"jason_engwer","post":"jesterof,Your first post in this thread refers to “the real experiences ( neurosurgeon’s do not fit) – when the person is in clinical death stage”. In later posts, you disputed my definition of NDEs and dismissed the sources I cited in support of it. You cited Evans Bush and van Lommel as examples of “some” researchers who define NDEs differently. Now that I’ve shown that those two researchers seem to have defined NDEs more broadly than you suggested, you’re acting as if you didn’t dispute the point. If you weren’t disputing the point, then you repeatedly miscommunicated your view in previous posts.You then go on to distinguish between what researchers “think” and “the data they present”. Since I’ve cited comments they and their colleagues have written, I’m not just appealing to what they think, in the sense of what thoughts are in their minds. Rather, I’ve been citing the definitions they’ve put forth in published works.","date":"July 29, 2013 at 5:04 am","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"author":"jason_engwer","post":"jesterof,As I said earlier, Dan Porter’s original post in this thread doesn’t limit itself to people who were clinically dead, who went through a tunnel, and met all of the other criteria you’ve been suggesting. You keep expecting me to address a narrower topic than Dan suggested in his original post, a narrower topic I never claimed to be addressing.Your suggestion that the felons in the study cited by Evans Bush might have been falsely imprisoned is a weak objection. The vast majority of the felons had positive deathbed experiences. Are you going to suggest that there’s a 50/50 chance or a probability that all of them were innocent of the crimes they were imprisoned for? If so, why should we believe that? If not, then what are you suggesting? That perhaps most of them were falsely imprisoned? Again, why should we believe that? And if only most were falsely imprisoned, how do you explain the positive experiences among those who weren’t imprisoned falsely?You object that the experiences are pre-death, but I’ve explained why NDEs that occur after clinical death are problematic as well. The experiencers haven’t died in the ultimate sense. If the afterlife is governed by God, he’d know who will return to life on earth and who won’t. He wouldn’t be dependent on a human definition of clinical death. Just as deathbed visions may not represent what happens after death in the ultimate sense of the term, the same may be true of NDEs (and I would argue that it is, indeed, true of NDEs).Your position on the relationship between the character of people who have NDEs and the nature of their experiences is ambiguous to me. I don’t know whether you’re only disputing the felon study I cited or you’re disputing my broader conclusion as well. Do you deny that NDEs sometimes don’t correspond to the character of the experiencer? If so, see pages 124-125 in the book by Greyson, et al. cited above. For example, there’s discussion of “a physically abusive prostitution solicitor (‘pimp’) who had a pleasurable NDE – and was subsequently reformed” and “an NDE that included the distressing element of an encounter with the devil – in a five-year-old boy with no atypical history of antisocial acts”. The authors of the chapter (Janice Holden, Jeffrey Long, B. Jason MacLurg) say that further research into this topic is needed, but conclude that “It appears not to be the case that ‘good’ people have pleasurable NDEs and ‘bad’ people have distressing NDEs.” Nancy Evans Bush has reached the same type of conclusion, as I’ve documented. And she had a negative NDE herself. From what I can tell, she wasn’t an unusually bad person at the time. I would say he same of other people whose negative NDE accounts I’ve read. Then there are the cases where an experiencer has multiple NDEs, both heavenly and hellish, without any corresponding change in character (ibid., 76). Or a person will have an NDE that starts negative, then becomes positive or vice versa (ibid.). For other examples of negative NDEs among children, including young ones, see pages 89 and 246.","date":"July 28, 2013 at 6:21 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"author":"jason_engwer","post":"jesterof,I’ve demonstrated that many NDEs don’t involve clinical death, according to common definitions used by researchers in the field. Therefore, it’s insufficient for you to object to the citation of deathbed visions on the basis that they’re pre-death.You write:“Logically speaking one would assume that people with bad life history would experience hellish NDEs, and good ones – nice ones.” Whether we’d expect such a correspondence depends on the nature of the experiences. For reasons I’ve explained, I consider NDEs roughly analogous to dreams or virtual reality. Under my view, I wouldn’t expect what you’re saying we should logically assume. Just as a good person can have nightmares, a good person can have a negative NDE. Just as a bad person can have a pleasant dream, a bad person can have a pleasant NDE.Maybe this issue is part of what’s motivating your disagreement with me. Do you consider NDEs to be a highly objective experience of the afterlife or some sort of highly objective foretaste of it?","date":"July 29, 2013 at 5:23 am","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"author":"jason_engwer","post":"Yannick wrote:“In other word, for Father Yves Girard, these near death experiences are something like visiting the vestibule of eternity; a place which is still far from God’s Kingdom.” I agree. That’s a good way of putting it.","date":"July 26, 2013 at 6:31 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"author":"jason_engwer","post":"Esquire magazine recently ran a story that’s critical of some of Eben Alexander’s claims about his alleged near-death experience. See here for a summary.","date":"July 26, 2013 at 5:52 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"author":"jason_engwer","post":"jesterof,I agree that the Esquire article isn’t enough of a basis for dismissing NDEs in general. My only intention was to address Eben Alexander’s case in particular.","date":"July 26, 2013 at 6:27 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"author":"jason_engwer","post":"The best resource I’m aware of on near-death experiences (NDEs) is The Handbook Of Near-Death Experiences (Santa Barbara, California: Praeger Publishers, 2009). It’s edited and authored by Bruce Greyson, Janice Holden, and some of the other foremost near-death researchers in the world. It goes into a lot of depth and approaches the subject from many angles.My view is that NDEs are something like supernatural dreams. Other people compare them to virtual reality. What’s important to understand is that there’s both an objective and a subjective factor to them that needs to be explained simultaneously. If anybody is interested, here’s a series of articles I’ve written on the subject over the last few years. Keep in mind that not all NDEs are positive (heavenly). Nancy Evans Bush, probably the leading researcher in the world today on negative (hellish) NDEs, places the portion of reported NDEs that are negative at seventeen percent. Given how reluctant people often are to talk about negative NDEs, the actual percentage is likely significantly higher. In addition to heavenly and hellish NDEs, there are some that have elements of each. An NDE starts out negative in some manner, then becomes positive. Or the reverse happens. Or a negative element interrupts an otherwise positive experience. Sometimes one individual will have multiple NDEs, and there will be a combination of positive and negative experiences. And some could be called neutral in the sense that they don’t involve an arrival at anything like Heaven or Hell.There are shared death experiences (SDEs) as well. Multiple people share an experience.NDEs (and SDEs) widely contradict each other. They don’t just differ in religious content, but also in other ways. For example, they differ in whether there’s a judgment (or life review, etc.) and the nature of the judgment if there is one. A recent study of the deathbed experiences of felons (unrepentant murderers, rapists, etc.) found all of them having positive experiences. By contrast, people who are good by common human standards often have negative NDEs. It’s important to realize that, despite common perceptions to the contrary, the nature of NDEs does not correspond with the character of the people who experience them. If you think everybody or almost everybody goes to Heaven, or that you just need to meet some common standard of goodness to get there, NDEs do not confirm such a view.The best source for information on the afterlife remains the Bible. We can gain some information from NDEs. They are supernatural, and they do serve as evidence of an afterlife. But they’re also highly subjective and inconsistent. Again, I think it’s helpful to look at them as something like a supernatural dream or supernatural virtual reality.","date":"July 26, 2013 at 6:24 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","title":"Near Death Experiences and the Shroud of Turin?"},{"author":"jason_engwer","post":"Yannick,I don’t know just what distinction you’re drawing between a sign and evidence. But I agree with Ron. In the way in which I use the term “evidence” and have seen others commonly use it, I think it’s an appropriate term here. But you may be defining the term differently, and your objection may make sense under a different definition.We have good reason to believe in Jesus’ resurrection on grounds that are independent of the Shroud. Something left an image on the cloth and the body was removed, in the manner referred to by daveb and Ron above. The timing of the image and body removal line up well with the timing of the resurrection reported in the ancient sources. The resurrection is the best explanation we have for the combined data of the image formation, the body removal, and the timing of those events. What’s the alternative? That some highly unusual natural event, which would explain the image formation and/or body removal, happened to occur around the time of the resurrection? That some supernatural event other than the resurrection, which would explain the image formation and/or body removal, happened to occur around the same time? We already have good reason to accept the resurrection, and it explains the Shroud so well. Why look for some more complicated and more speculative alternative?","date":"May 7, 2013 at 6:13 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"author":"jason_engwer","post":"Yannick, I agree that we don’t have “sure scientific proof”. But I don’t think people usually have that concept in mind when they refer to “evidence”. Historians often refer to historical evidence for a conclusion when they have nothing more than a probability in mind.","date":"May 7, 2013 at 5:54 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"author":"jason_engwer","post":"Dan,Have you considered including a more extensive topical index on your blog? Maybe have a section on your side bar that links to posts on a wider range of topics that frequently come up (like the objection based on the length of Jesus’ hair). That would make it easier for people to find things on the blog, and it would save you and others time when those topics come up again in the future.Also, have you ever put together a collection of audio and/or video files on the Shroud? Or do you know of anybody else who has? If nobody’s done it yet, it would be a good idea to have a large collection of audio files on Shroud-related topics, for example, in one location.Maybe you’ve already done these things, and I don’t know about it. If you haven’t, I don’t want to burden you with it. I’m just making suggestions, if you’d have the time and interest to do these things at some point. Regardless, I appreciate the work you’re already putting into the blog. It’s a valuable resource.","date":"May 6, 2013 at 7:12 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"author":"jason_engwer","post":"jesterof wrote:“people had so many different hairstyles, and since society was so separated depending on the social ladder there is no reason not believe long hair together with a shorter one was totally possible.” I agree. Some of the scholars I wrote to on this subject made similar points. There probably would have been a wide variety of hairstyles, influenced by factors like where people were on the social ladder of their day.Still, although the principle you’re appealing to makes sense in the abstract, it’s helpful to have some concrete examples of long hair being accepted in ancient Jewish contexts. That’s what I wanted to provide in my article.","date":"May 7, 2013 at 5:51 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"author":"jason_engwer","post":"The ancient Christians and their Jewish opponents were in agreement that the tomb was empty, as we see in Matthew’s gospel, Justin Martyr, and other ancient sources. The dispute was over how the tomb became empty, not whether it was empty. The idea of a non-physical resurrection is highly inconsistent with the evidence we have. Paul and the other early Christians held the traditional Jewish belief in a physical resurrection.For a lengthy refutation of the notion that Paul and other ancient Christians believed in a non-physical resurrection, see Michael Licona’s The Resurrection Of Jesus (Downers Grove, Illinois: InterVarsity Press, 2010), which is based on his doctoral dissertation on the subject. For example, he writes the following about 1 Corinthians 15:44“Moreover, it is worth observing that had Paul desired to communicate this sort of contrast [between the physical and the non-physical], he had better words at his disposal, one of which he had employed just a few chapters earlier [in 1 Corinthians 9:11] while using a seed analogy similar to that of 1 Corinthians 15….if he had desired to communicate that our resurrection body would not be physical but rather immaterial in nature, why use the former term in a sense not employed earlier in his letter or for that matter anywhere else in the Pauline corpus, the New Testament or by any known author from the eighth century B.C. through the third century A.D., while ignoring a clearer term used just a few chapters earlier in a similar seed analogy?…I located 846 occurrences of the former [the term ‘natural’ in 1 Corinthians 15:44] from the eighth-century B.C. through the third-century A.D. and could not locate a single occurrence of the term that meant ‘physical’ or ‘material.’ This discovery in itself eliminates any interpretation of 1 Corinthians 15:44 that has Paul asserting physical corpses are buried while resurrection bodies will be immaterial (a la Wedderburn, RSV/NRSV et al.).” (414-415, 618)","date":"May 7, 2013 at 6:22 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"author":"jason_engwer","post":"daveb,Long hair on men is widely accepted among Evangelicals. (I’m an Evangelical myself.) Depictions of Jesus in Evangelical contexts frequently portray him with long hair. It’s common in artwork, movies, etc. I think only a small minority of people in Evangelical circles object to the long hair on the Shroud. But that minority is disproportionately vocal and has a significant tradition behind it.I’m familiar with the argument from long hair on modern Jewish men. While that argument has some significance, it doesn’t carry much weight. We’re two millennia removed from Jesus. Traditions often change over time, including on matters more important than hairstyle. We should be focused on the evidence we have for hairstyles closer to and before the time of Jesus. (I’m including the pre-Christian era because opponents of long hair often suggest that ancient Jews or ancient cultures in general, not just right around the time of Jesus, were opposed to long hair on men.) It’s not enough for advocates of the Shroud to just do something like point to long hair among modern Jewish men or cite scholars claiming that ancient Jewish men had long hair, without any accompanying evidence. We ought to do more than that. In my experience, though, those who are defending the Shroud seldom do more.I agree that 1 Corinthians 11:14 is important in this context. I address the passage (by linking to some other articles on it) in my post I cited earlier.The apostle Paul spent a lot of time in Israel and was highly knowledgeable about Jewish life. We have good evidence that he saw the risen Jesus, performed many authenticating miracles as an apostle, and was supported in his authority claims by the other apostles and mainstream early Christianity in general. Paul is a highly credible historical witness, one whom Christians are obligated to obey. We shouldn’t be dismissive of Paul or 1 Corinthians 11. And neither Paul’s work in general nor 1 Corinthians 11 in particular is inconsistent with the Shroud.","date":"May 7, 2013 at 5:40 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"author":"jason_engwer","post":"Matthias,Every gospel has the tomb empty. Three of the four have Jesus being physically touched and so forth. The only reason why Mark doesn’t is because his gospel ends at Mark 16:8, where the resurrection appearances have been promised, but haven’t been narrated.As 1 Corinthians 15:1-11 indicates, Paul was in agreement with the other early Christian leaders with regard to the resurrection. Later in the same passage, he refers to Jesus’ resurrection as the firstfruits of the future resurrection of believers, which is more than just a resuscitation. Furthermore, 1 Timothy 5:18 most likely is citing Luke’s gospel as scripture. Thus, Paul is indirectly affirming Luke’s highly physical portrayal of the resurrection. (I believe that Paul wrote 1 Timothy, but even if one were to reject that view, the document still represents the early beliefs of people who were close to Paul and thought highly of him. There’s a good chance that their view would be the same as Paul’s. Surely we wouldn’t assume that they contradicted Paul as our default position.) The earliest Pauline churches, as reflected in the early patristic literature, also accept a highly physical view of Jesus’ resurrection like that found in the gospels. This sort of evidence, and much more could be cited, suggests that Paul and the gospel writers held the same view of Jesus’ resurrection.","date":"May 7, 2013 at 6:35 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"author":"jason_engwer","post":"daveb wrote:“Firstly I am not being dismissive of 1 Cor 11:4-16. But I see it in the context of what was to be considered the proper conformity of dress and appearance of a Corinthian Christian in the 1st century, as addressed by a missionary well familiar with Greek and Roman culture. It might be seen as unnecessarily socially provocative not to conform in this way. To then argue that therefore Christ was necessarily short-haired and beardless is grasping a straw and to read a message into scripture that is not there.”  I agree.You write:“You may look in vain for images of 1st century Jews to discover their hair style, as you would be aware that they were averse to any kind of images. However in his 1978 ‘The Turin Shroud’, Wilson cites two authorities quite independently of the Shroud, H Gressman and Daniel-Rops. Gressman’s work is in German; Daniel-Rops work is ‘Daily Life in Palestine at the Time of Christ’ (Londom Weidenfeld 1962).” I was aware of both sources, and I got a copy of one of Daniel-Rops’ books last year, when I was researching my article. I didn’t find any extra-Biblical documentation in his book, and I was already familiar with the Biblical data. I’ve come across a lot of sources of that nature. They make a claim about ancient hairstyles, but they don’t offer much support, if any, for their claim. The testimony of scholars has some value, but it would be better if their claims were accompanied by evidence.I haven’t checked Gressman. I don’t know much German.There are some images depicting Jews in and around the first century, largely images produced by Gentiles. I mention some of them in my article. We also have comments on Jewish hairstyles in some ancient literature. Scholars could cite such sources when discussing this subject, but they often don’t. Maybe Gressman does. If Daniel-Rops does so, it must be somewhere other than where I read him. The scholars I emailed didn’t have much to offer, and they often commented on how little evidence there is to go by.","date":"May 7, 2013 at 6:20 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"author":"jason_engwer","post":"Regarding the issue of Jesus with long hair, I wrote an article on the subject here. I emailed several scholars on the subject, and they didn’t provide much that was helpful, so I pulled together some resources I found in my own research.If we want Christians (and others) to stop objecting to the Shroud on the basis of the length of the hair that’s depicted, then we ought to respond to that objection in detail and with direct and persuasive counterarguments. (It’s not enough to just quote a scholar, or more than one of them, saying that Jesus could have had long hair. Many people will want to know what evidence leads a scholar to that conclusion.) If we’re just dismissive of the objection, without addressing it in sufficient detail, then we’re not going to persuade people we might otherwise have persuaded, and we might alienate them even further. Some fundamentalists, atheists, and other people who often object to the Shroud could be persuaded if they’re offered evidence and argumentation. The fact that somebody currently holds a particular position, such as atheism, doesn’t tell you how close he is to transitioning to some other position or what would bring about that transition. But even if an atheist is unreasonable, why focus on him? Other people are looking on. In an online forum like this one, you don’t know who’s reading your posts. A good general approach to take is to follow the example set by the apostles in Acts: “explaining and giving evidence…welcoming all who come” (Acts 17:3, 28:30). The Holy Spirit converts people to Christianity supernaturally, but he often does so through evidence and argumentation. God, after all, is the one who gave us our minds. It’s not as though he’s opposed to the sort of intellectual activity that we see in Acts and so many other places in the Bible. To the contrary, anti-intellectualism is a sin. Dan mentioned Thomas de Wesselow. Of course, Barrie Schwortz is another non-Christian who accepts the Shroud. Another non-Christian who comes to mind is Michael Prescott. He operates a popular paranormal blog, and he thinks the Shroud is authentic, even though he’s not a Christian.The Shroud is evidence of Jesus’ existence, and I think it’s evidence of his resurrection. But those aren’t the only issues involved. The Shroud also has implications for the accuracy of the gospels, for example (Jesus’ age, that he had something like a crown of thorns placed on his head, that he was crucified with nails, that he was pierced through his side, etc.). If an atheist were to accept the Shroud, yet deny that it implies Jesus’ resurrection, he’d still have to address what the Shroud implies about the accuracy of early Christian sources on other subjects.","date":"May 6, 2013 at 6:53 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"author":"jason_engwer","post":"I don’t know what you mean by “confused discussion”, daveb, but here’s the thread if anybody wants to read it.","date":"May 30, 2013 at 7:03 pm","url":"https://shroudstory.com/2013/05/30/how-can-you-argue-with-this/","cat":"other_blogs","title":"How can you argue with this?"}],"researchers":[{"author":"jason_engwer","post":"Hugh Farey is on the wrong side of the authenticity debate, but he handled his side of the program better than Alan Whanger handled his. Whanger tried to cover too much ground, brought up a lot of dubious arguments (e.g., the appeal to alleged images of coins, crowns of thorns, etc.), and often wasn’t responsive enough to the questions he was being asked. I was glad, though, that Whanger brought up the dating tests done by Giulio Fanti and his colleagues. But he brought it up too late for it get much discussion. Any mention of the 1988 test should be accompanied by mention of things like the 1982 and Fanti tests and Ray Rogers’ vanillin argument. And Hugh should have mentioned how closely the 1988 test coincides with the Shroud’s first explicit appearance in the historical record, which I don’t think he did. I wish all of that had been laid out, followed by a discussion of how to best make sense of the totality of those dating methods. The 1988 test gets too much isolated attention. It’s superior to the other dating efforts in some important ways, but the other ones have some significance, especially cumulatively.One of the problems with programs like this one is that they tend to spend too much time reinventing the wheel. Instead of giving so much attention to introductory issues and matters of such common knowledge, most of the time should be spent breaking new ground or discussing issues that tend to receive much less attention than others. There was some of that during the program (mostly because of Hugh’s efforts), but not enough. More of the program should have been spent discussing Fanti’s tests, Charles Freeman’s arguments, and other issues of a newer and less common nature.","date":"April 3, 2015 at 10:44 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"}],"resources":[{"author":"jason_engwer","post":"Here’s a somewhat lengthy discussion of whether it makes sense to dismiss the Shroud as demonic. Most of the discussion is in the comments section of the thread, so you may want to read beyond the initial post.We have a lot of evidence for the acceptability of long hair among ancient Jews. I’ve provided some examples here, if anybody is interested.Regarding whether the Shroud is consistent with Isaiah 52:14, see my August 5 posts in the thread here.","date":"October 15, 2015 at 5:17 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"author":"jason_engwer","post":"Joe’s citation of Gove’s book, regarding Flury-Lemberg, is found on page 155. Here are some of William Meacham’s comments regarding how much Flury-Lemberg knew about the Shroud at the time of the 1986 workshop:“I recall feeling at the time that this was unthinkable – someone who knew nothing about radiocarbon dating and little about the Shroud, and who apparently had not seen the cloth or read the reports on its study, would be nominated to pick a spot and take a sample. Ultimately the responsibility for bringing Flury-Lemberg into the Shroud arena lies with [Teddy] Hall.” (The Rape Of The Turin Shroud [Lulu, 2005], 71-2)And here’s Meacham’s description of Flury-Lemberg’s comments and the responses at the 1986 workshop:“Flury-Lemberg maintained that it did not matter where one took the sample from, since the Shroud was all a homogeneous cloth. Adler begged to disagree, citing the very different chemistries apparent in the scorched areas, the water stain margins, the image areas and the edges. I argued, as I had in correspondence with Gonella, that the edges were anomalous and might have been treated in some way. After more in this vein, Chagas put an end to the discussion by proclaiming that the Shroud was not an archaeological site, sampling should be straightforward and a single sample divided into six or seven pieces would be sufficient. Adler and I shook our heads in dismay. Although we did not know it, the seeds of the imminent disaster that was to befall the Shroud had been planted.” (74-5)","date":"September 9, 2015 at 6:32 pm","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"author":"jason_engwer","post":"Jerry Coyne ought to interact with something like Craig Keener’s two-volume work Miracles (Grand Rapids, Michigan: Baker Academic, 2011). Keener is a highly-regarded New Testament scholar who recounts many miracles that he and his associates have experienced, as well as a large number of other miracles in modern times. He includes cases with medical documentation (e.g., before-and-after x-rays), multiple eyewitnesses, and corroboration from hostile sources, for example. He also interacts at length with David Hume’s philosophical objections to miracles. He cites a lot of polling data from around the world showing that hundreds of millions of people claim to have experienced at least one miracle firsthand. If anybody is interested, I wrote a series of posts about Keener’s work a couple of years ago. You can find it here. In the series, I cite many of Keener’s findings and give examples of miracle cases he discusses that are accompanied by documentation.Coyne could also interact with the work done by modern paranormal researchers. Say, Stephen Braude’s documentation of some modern paranormal cases. His book The Gold Leaf Lady (Chicago, Illinois: The University of Chicago Press, 2007) is a good introduction to modern paranormal research. Here’s a video of a lecture Braude delivered a few years ago, in which he discusses the evidence for some modern paranormal cases. It should be noted that though the video is labeled as a discussion of the Ted Serios case, Braude discusses more than that one case. What Braude writes about the dishonesty of some (not all) skeptics is largely applicable to some (not all) skeptics of the Shroud as well:“Nevertheless, with his usual bluster, [James] Randi accepted a $10,000 challenge (a considerable sum in those days) to duplicate the Serios phenomena and make good on his claim. Of course, confidence is easy to feign, and Randi does it routinely in his role as magician. He also cleverly takes advantage of the occasional high-profile case he successfully exposes as fraudulent, by publicizing those successes and creating the impression that he’s a generally reliable guide when it comes to the paranormal. So Randi’s dismissal of the Serios case was all it took for those already disposed to believe that Serios was a fake, and it was probably enough even for those sympathetic to parapsychology but unaware of Randi’s dishonesty….What the TV audience never learned was that when the show was over and Randi was pressed to make good on his wager, he simply weaseled out of it. To keep that side of the story under wraps, Randi prohibited publication of his correspondence on the matter. That was undoubtedly a shrewd move, because the letters show clearly how Randi backed down from his empty challenge. However, Randi’s original letters now reside in the library at the University of Maryland Baltimore County, and researchers, finally, can easily confirm this for themselves. When Serios’s principal investigator, Jule Eisenbud, died, I was assigned the task of going through his papers. I collected all the material relevant to the Serios case and deposited it in the Special Collections section of the UMBC library. (This includes correspondence, the original photos and film, and signed affidavits from witnesses.)…But there’s no documentary evidence of Randi having even attempted to duplicate the Serios phenomena under anything like the conditions in which Serios succeeded, much less evidence of his having actually pulled it off….In fact, the history of parapsychology chronicles some remarkable examples of dishonest testimony and other reprehensible behavior on the part of skeptics….Skepticism is just as glib and dishonest now as it was in 1882 when the British SPR was founded. In fact, despite sensible and careful dismantling of the traditional skeptical objections, the same tired arguments surface again and again. And those arguments all too easily mislead those who haven’t yet heard the other side of the story or examined the evidence for themselves.” (The Gold Leaf Lady [Chicago, Illinois: The University of Chicago Press, 2007], 22, 34, 126)","date":"March 28, 2014 at 6:03 pm","url":"https://shroudstory.com/2014/03/28/thanks-for-mentioning-the-shroud-of-turin-again/","cat":"article","title":"Thanks for mentioning the Shroud of Turin again"},{"author":"jason_engwer","post":"I agree with John Green, David O., and daveb of wellington nz. The evidence suggests that Mary wasn’t a perpetual virgin. I’ll get to the New Testament evidence below, but I first want to note that most of the earliest extrabiblical sources to address the subject are opposed to the concept that Mary was a perpetual virgin: Josephus, Hegesippus, Irenaeus, Tertullian, Hippolytus, and Victorinus, for example. See the following for a discussion of the earliest sources:http://triablogue.blogspot.com/2007/03/perpetual-virginity-of-mary.htmlThe New Testament uses multiple phrases that are most naturally interpreted as inconsistent with perpetual virginity. The authors used those terms even though terms more consistent with perpetual virginity were available to them and were used elsewhere, sometimes even by the same author. Consider Luke, for example. How do you explain a document like Luke’s gospel, which repeatedly uses the term “relative”, even distinguishing between “brothers” and “relatives” (21:16), yet uses “brothers” to refer to Jesus’ siblings? Did Luke believe in the perpetual virginity of Mary, yet repeatedly chose to use terminology that would suggest the opposite while refraining from using terminology he does use elsewhere, terminology that wouldn’t be so misleading? Luke was willing to qualify his description of Joseph as “supposedly” the father of Jesus (3:23), even though the earlier references to the virgin birth made it obvious that Joseph wasn’t Jesus’ father biologically. Yet, Luke never adds such qualifiers regarding Jesus’ siblings. Again, did Luke believe in the perpetual virginity of Mary, yet repeatedly used terminology that suggested the opposite and repeatedly refrained from adding clarification that he did add when discussing a similar subject? Luke uses the term “firstborn” when discussing Jesus (2:7), even though he could have used “only born”, as he does of people other than Jesus elsewhere (7:12, 9:38).","date":"March 12, 2015 at 5:08 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"author":"jason_engwer","post":"By the way, in case Dan and others here aren’t aware of it, Antonio Lombatti has written a review of CNN’s Shroud program:http://bibleinterp.com/opeds/2015/03/lom398011.shtmlIf anybody’s interested, I’ve written a reply to him:http://triablogue.blogspot.com/2015/03/antonio-lombattis-claims-about-shroud.html","date":"March 12, 2015 at 5:11 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"author":"jason_engwer","post":"Since it’s mentioned above, I want to address John 19:26-7. Most likely, the reason why Jesus entrusts Mary to John in that passage is because Jesus’ siblings were still unbelievers at the time (e.g., John 7:5). Jesus’ brothers would become believers shortly afterward, but becoming a believer isn’t the same as being mature in the faith. Jesus repeatedly emphasized the point that spiritual relationships are more important than biological ones, though the latter do have some significance. He’s addressing that issue again in John 19. For those who hold the position that the brothers of Jesus were cousins or relatives of some other sort, it still needs to be explained why Jesus chose John over those relatives. In other words, it’s not as though opponents of Mary’s perpetual virginity are the only ones who need to explain John 19:26-7. The best explanation for the passage is that Jesus was giving priority to spiritual ties over blood relations, as he does repeatedly elsewhere. Thus, the passage does nothing to advance the case for perpetual virginity.","date":"March 12, 2015 at 5:25 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"author":"jason_engwer","post":"rick,In a 1:20 P.M. post yesterday, you criticized the alleged dangers of “interpreting the Bible personally”. Yet, you’re giving us your personal interpretation of Fatima, your personal interpretation of Genesis 3:15, etc. There’s nothing wrong with personal interpretation. It’s unavoidable. How would you objectively determine that Roman Catholicism has the authority it claims to have, judge how to understand Roman Catholic documents, etc. without engaging in personal interpretation? Since there’s nothing wrong with personal interpretation, and it’s impossible to avoid engaging in it, you shouldn’t have criticized it.With regard to the sinlessness of Mary, the Bible itself records some examples of Mary’s sins, and church fathers and Popes for hundreds of years denied that she was sinless:http://triablogue.blogspot.com/2006/09/some-early-sources-on-sinlessness-of.htmlhttp://triablogue.blogspot.com/2006/09/some-later-sources-on-sinlessness-of.htmlYou refer to Mary as a New Eve. There’s a sense in which she is a sort of second Eve. But the concept is vague enough to be interpreted in a lot of ways. Mary’s alleged sinlessness, for example, doesn’t logically follow from viewing her as a New Eve. For instance, Tertullian refers to Mary as a New Eve and a sinner within the same document (see sections 7 and 17 in his treatise On The Flesh Of Christ). As Hans von Campenhausen noted:“To how small a degree Mary as a holy person forms the centre of interest can be realized from the fact that the comparison with Eve must by no means be concentrated on her alone. ‘Generally speaking, every woman who plays a part in the salvation of God’s people can be understood exegetically as a type of the new Eve’. Even in Hippolytus, for example, the women who go to the grave on Easter morning are similarly contrasted with Eve – a kind of view that lasts into the fifth century – and Origen compares the two ‘holy women’, Elizabeth and Mary, with Eve. Ambrose parallelizes Eve and Sarah, and emphasizes that there were many Marys before the one Mary brought the great fulfilment….Again and again it is a question here of the ‘woman’ or ‘the women’ as such, who thus receive their due. Nothing like that would have been possible if the Eve-Mary typology had had only a ‘Mariological’ meaning from the outset.” (The Virgin Birth In The Theology Of The Ancient Church [Eugene, Oregon: Wipf & Stock, 2011], 45-6)Regarding Fatima, one problem with appealing to Marian apparitions is that they’re internally inconsistent. On the one hand, the latest apparitions supposedly support the latest Roman Catholic teachings on Mary. On the other hand, the same apparitions assume or assert a traditional, high Catholic view of scripture. Yet, scripture contradicts Catholic Marian doctrines, like her alleged sinlessness.Another problem with Marian apparitions is that they’re outweighed by other evidence. Much as Moses outperformed the magicians of Pharaoh and Jesus outperforms the miracles of Satan and the Antichrist in the book of Revelation, the Marian apparitions can be outweighed by other miracles. The network of miracles surrounding Jesus as an individual and the Bible as a collection of literature is far more significant than the miracles surrounding Marian apparitions. If a Marian apparition contradicts Jesus and the Bible, then so much the worse for the apparition.If anybody’s interested, here’s a place where I’ve made a case for the historicity of Christian miracles and how to judge between competing miracle claims:http://triablogue.blogspot.com/2012/11/a-christian-case-for-miracles_2.html","date":"March 13, 2015 at 11:44 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"author":"jason_engwer","post":"rick,Your claims about Jesus, the Holy Spirit, and the church depend on your personal interpretation. Why do you believe that Jesus existed as a historical figure, that he was the Messiah, that he founded a church, etc.? Those are all historical judgments that you’re making, using your own fallible personal interpretation. In order to arrive at the (false) conclusion that there’s a church with the attributes you’re assigning to the Roman Catholic denomination, you have to engage in a series of personal interpretations. Every time you interpret a Roman Catholic document, you’re relying on personal interpretation.","date":"March 13, 2015 at 8:05 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"}]}
