{"image":[{"author":"jgiordano","post":"+1 to Colin, I don’t understand the lack of new testing either – unless it is because, as Roy Rodgers stated in that documentary just before he died, the TS is now saturated in insecticide that was sprayed into its storage box.  If there is no way to reliably separate out all that extra C from that or from centuries of candle smoke, then maybe testing the charred bits of TS that were removed during that big ‘cleaning’in 2002.  Those bits from the big burn holes would also be subject to extra C from burning candles and CO2 flowing through it when exposed to the faithful. That would be from the time it was made (AD30+ or medieval ) to the time of the big fire.  After that I don’t think those pieces would be affected much by anything, so it would serve as a good indicator.  If it came out as 1290-1360, then all the labs really did a good job.  If it came out 1st century ….. But I have a feeling it might come out with something else, in between probably.  I’m saying that, having heard of a mummy that was 1000 years older than the linen wrappings – even though it doesn’t look like it was rewrapped since the blood and other decay fluids had penetrated it.  Anyways testing it is better than not testing it, and no one is going to miss a few threads from here and there (the 2002 cleaning did more damage…).  And labs should refuse to do the testing unless the proper protocols are followed.Aside to Colin – do your images fluores (?) in UV?  If they do, do you see that as the end of the road for your experiments, or do you have a plan for more experiments to deal with that.","date":"December 13, 2015 at 9:38 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"author":"jgiordano","post":"That’s it thymol.  But please save the attitude, and stick to the facts.  If you think the thymol would be easy to remove and new c14 tests can be done reliably, just state so and let us know why, adding to the body of knowledge. Rodgers, in the documentary revealing the re-weaving hypothesis and the dyed fibres, seemed to think the thymol kills any chance for new tests, other than on the removed charred pieces.","date":"December 14, 2015 at 9:02 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"author":"jgiordano","post":"Exactly Dcn Andy, I was thinking the same thing -McCrone looked through a microscope, that’s it – and that is supposed to carry more weight than blood experts running actual chemical tests, who say it is blood.  If gesso and paint or iron powder made the image, why can’t we see any gesso in the imaged fibres or those adjacent? Why do close ups of the fibres show very fine coloring of the fibres as by dehydration (or is it proven, so I can leave out the word “as”?).  And I thought only ‘climate scientists ‘ were hacks…","date":"December 13, 2015 at 2:43 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"}]}
