{"blood":[{"author":"jmarino240","post":"I wrote: “Just so the record is clear: when I referred to Shroud researchers who are more interested in making a name for themselves than finding out the truth about the Shroud, I was not including Wilson.”Yannick wrote: “Of course. He’s an intouchable in the Shroud world…Yannick, I find your comment offensive. By impugning my statement and not even allowing me the freedom to just express an honest opinion, you are apparently showing that you feel that everyone should simply agree with you. You are not going to win many converts with your M.O.Yannick wrote: . . . “If my comment offended you, I’m sorry but I just can’t shut up about that. It’s very frustrating to see that, amongst Shroud researchers, there truly seem to be a kind of immunity that prevent any of them to criticize the bad antics of a “colleague”.Yannick, you didn’t need to put “if my comment offended you…”  There is no “if.”  I told you directly it did offend me.  In another posting you compared Wilson to Dan Brown.  I will give you an analogy for your “if my comment offended you.”  That’s the sort of wording that politicians and celebrities use when they do something offensive and the heat is so great they have to say something.  They rarely just outright apologize because they can’t be wrong.  Their thoughts & behaviors are the gold standard and everyone else has to conform to them.","date":"August 25, 2013 at 8:16 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"author":"jmarino240","post":"I wrote:  “Just so the record is clear: when I referred to Shroud researchers who are more interested in making a name for themselves than finding out the truth about the Shroud, I was not including Wilson.”Yannick wrote:  “Of course. He’s an intouchable in the Shroud world…Yannick, I find your comment offensive.  By impugning my statement and not even allowing me the freedom to just express an honest opinion, you are apparently showing that you feel that everyone should simply agree with you.  You are not going to win many converts with your M.O.","date":"August 25, 2013 at 7:09 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"author":"jmarino240","post":"Yannick wrote:  “I don’t feel I need to go down on my knees for having told what I consider the truth. Of course, you can think something else than me. The main point is this: your reaction concerning the fact that “and by the way, I was not meaning Wilson” was very telling of the kind of politically correctness that goes on and on and on Inside the pro-Shroud world…Expressing what you consider to be the truth is fine, but I resent you taking a statement of mine, which was simply a clarification, and thus chastise me because I didn’t join with you to criticize Wilson.What you consider to be the truth = your opinion.  Other people have opinions, too.  If you find someone willing to debate with you, fine.  But don’t just try hitting everyone over the head with your opinion, especially when it wasn’t asked for.I assume you will post something in response but I am done.","date":"August 25, 2013 at 9:01 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"}],"dating":[{"author":"jmarino240","post":"Mario,   You have some excellent points.","date":"November 29, 2014 at 6:08 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"author":"jmarino240","post":"Last sentence:  “datring” should be “dating.”","date":"November 30, 2014 at 9:06 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"author":"jmarino240","post":"There’s one other point worth making regarding the psychological aspect of clinging to a belief.  Rogers was clearly convinced at first that he would be able to disprove the reweave theory.  He was then clearly embarrassed that he had to agree with 2 people whom he considered to be in the “lunatic fringe.”  I dare say that not all scientists would have shown the integrity that Rogers showed in changing his position.","date":"March 9, 2015 at 6:48 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"author":"jmarino240","post":"Regarding Giorgio’s question about McCrone’s statements and Yannick’s question regarding who now owns the Nitowski samples, I’ve been forwarding other comments to Paul and will let him address both areas.","date":"May 25, 2013 at 7:25 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"author":"jmarino240","post":"Giorgio wrote, “Joe can you and Paul give me your hypothesis what Dr. McCrone is stating with these remarks?…”Paul responded:  “I would not be able to present the following as an hypothsis–rather, it would be more like a “personal guesstimate”.  STURP learned early on that McCrone was heading toward a finding that the image was caused by iron oxide.  This was disturbing to them.  I called and talked with Dr. Robert L. Feller [paint chemistry and art conservation at the Carnegie Mellon University in Pittsburgh, PA] and he knew McCrone’s penchant for the light microscope (as opposed to other technological approaches like spectrometry and sophisticated chemical analysis).  He told me that McCrone liked to identify things by using his eyes.  Indeed, McCrone once said something similar to me when he hoped that his work (such as with the particle atlas) would “save” the light microscope.  And, in fact, McCrone was famous for his ability to see things under the eye of the scope and proffer a professional opinion about it.  But Feller believed that McCrone was old-fashioned (that is not his word–that was simply how he felt about it) in his use of the microscope.  Feller suggested that the microscope would be well served by supplementing it with other, high tech, approaches.  In other words, McCrone was giving his “opinion” about things of which he had long experience.  But McCrone had never heard of the compilation of work on the True Copies by Don Luigi Fossati in his earliest work so he developed the first thing that came to his mind, born of that long experience and the logic that emanated from it.  But McCrone was not the only one to puzzle over the color of “blood” on the Shroud.  Adler, himself puzzled over it and with experimentation told me that he could duplicate the “redness” of the blood by assuming that the Man of the Shroud was a victim of blood trauma where the billirubin was some 500 times concentrated.  Dr. Gilbert Lavoie told me that he and Adler were working on this possibility and that Lavoie had, in his refrigerator, a sample of tramatized blood taken from a man who had suffered from a chain gang beating.  To my knowledge, little further was done on this because Adler passed away from a severe brain hemmorage–a tragic loss to us all.  One might ask Dr. Lavoie for input on this matter.But, to another question put to me by the late lawyer, Benjamin Wiech–why does the blood color appear to keep changing?–I responded that it will depend on the lighting that illumines it.  The “true” color is not seen unless the full spectrum of light shines on it.  (Sunlight is the best resource for this–but, of course, we do not wish UV rays to damage the Shroud and so that is usually filtered out).  We must also remember that McCrone was limited in another way:  He was not a direct on-site participant scientist who could examine the fibers of the Shroud under the Wild M-400 microscope in it textile context in the way that Sam Pellicori and Mark Evans could.  He could only see the fibers removed from the Shroud as a “remainder” after the fact on the sticky tapes that STURP (i.e. Ray Rogers) had removed from the cloth with the “torque applicator”.  And these samples were truly from the surface because Ray and Joan Janey (later Mrs. Ray Rogers) designed the instrument to do exactly that–to remove only surface material.  McCrone had no way to use a tungsten probe and part the crowns of the threads to examine them from side to side to draw conclusions while in Turin.  He also did not have the value of discussing various ideas with other participants on-site in Turin to help formulate a modulated hypothesis.  Indeed, McCrone apparently did not even avail himself of some excellent technicians in his own employ at the McCrone Research Institute in Chicago–and unfortunately I have momentarily misplaced my copy of the book Barrie Schwortz edited for Ray Rogers so I cannot now remember the name of the technician (Anderson?????) who suggested to McCrone that his own Ramen Spectroscopy showed a blood signal–not iron oxide.  Thus, it may have been a very personal thing–an inability to change his mind about his own initial belief that it was iron oxide because to do so would mean he could not “save face.”  And, after all, the inorganic pigment–iron oxide–did not change color.  But blood does not usually stay red–for it will turn brown then black with time.I know of many scientists who found themselves in this professional predicament.  Forgive the following excursus as an example: The late Glenn Seaborg (for which the element “seaborgium” is named), tells the story that he became convinced that the periodic table should be changed and re-formated.  So he went to his doctoral advisor at the University of Chicago and suggested the idea.  But his advisor, committed to the old way it was formated, said, “Well, I wouldn’t go public with that if I were you. It will ruin your reputation.”  The old professor could not change from his commitment to the older view of the periodic table.  But look in any modern book of chemistry and examine the periodic table–that is the way Glenn Seaborg had proposed it and now it is the accepted view.I cannot say that this was McCrone’s problem.  And it will probably never be known with certainty since McCrone is no longer able to discuss the matter.  I do know, from my own talks with him, that McCrone did seriously believe that what he saw on the Shroud tapes was largely iron oxide as the image pigment.  I often agreed with him on the finding of iron oxide–but I told him that the True Copy issue was a major clouding of the answer and since, as I noted above that McCrone did not have the advantage of seeing the Shroud personally with his own eyeballs, he drew his conclusions and stated them publically based for the most part on light microscopy.  He wanted to make a convert of Fr. Rinaldi and hoped that I, too, would eventually “see the light.”Science is often a personal thing.  After all, we are all humans and it takes the voices and views of many and the accumulated data of scientific observation to get to the final objective truth.”  Regards,Paul","date":"May 25, 2013 at 9:11 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"author":"jmarino240","post":"Yannick wrote:  “Can you confirm to me that both McCrone and Nitowski have only analyzed samples that were taken by STURP and not by Max Frei or Riggi?”McCrone analyzed samples of Frei’s but I don’t know if he incorporated them at all into the map that Paul attached.  McCrone & Nitowski would not have been given access to any Riggi samples.  I forwarded to Paul a 2nd time your suggestions about his research and also asked him to comment on the Frei samples vis-a-vis McCrone.","date":"May 25, 2013 at 9:19 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"author":"jmarino240","post":"Paul Maloney wrote:Dear Yannick and Giorgio,About the use of spectroscopy and chemical analysis, I could not agree with you more!  But I am not a physicist or an analytical chemist (I am an archaeologist) and I do not have access to the sophisticated equipment–often found only in well-funded laboratories–needed to conduct such work.  Moreover, I know from personal experience with the microscope that I have already spent more than a thousand hours just doing the photomicrography on the Max Frei tapes.  The further work that would be needed by a physicist (using various types of spectroscopy) or an analytical chemist would involve the need for further extensive in-depth funding and specialists in various forms of spectroscopy and other arenas to do what really needs to be done.  But someone has to start somewhere.  By compiling this photo-visualization of the particles, fibers, and botanical traces on the Shroud, it provides other specialists with an “outline” whereby professionals can enter the picture and begin to flesh out the story of the Shroud in better and more illuminating detail than I ever could.  Moreover, by stating that I am not using spectral analysis or chemical probing, I give a “heads up” to these other specialists to come to the fore and do what they do best.  Additionally, if I tried to employ such equipment as a non-professional, I would quite certainly engender the kind of criticism you hope I’ll be able to avoid.  But, I am happy to work as an advisor with these scientists if they wish.  I should, however, state that I no longer have direct access to the Max Frei Tapes–only to the some 7000 Kodak transparencies I made between Jan. 1986 and July 1993.  The tapes are now curated by Dr. and Mrs. Alan D. Whanger, Prof. Emeritus at Duke University, in Durham, North Carolina.  Naturally, I would wish to conduct much of this work in a non-destructive fashion.  Chemical analysis would, by its very nature, be destructive.  Even doing proper palinology (as Max Frei did on the 1973 tapes) required him to cut tiny incisions in the form of a “T” in the tape to remove each pollen grain he selected and re-mount it separately on a microscope slide.  He did this many times.  But it does do “damage” to the tapes.  And if the pollen grains were coated with some sort of coating, as Giovanni Riggi di Numana told me many of his own pollen grains were coated, then an acid would be needed to remove that coating before proper pollen analysis could be done.  And it would be important in that case to discover the composition of the coating BEFORE that coating was removed because it could contain a very important clue as to the original (tomb?) environ from which it had come.  So many technicians and consultants would have to come together to plan carefully how to use the wealth of material on the Max Frei Tapes.With all best wishes,Paul","date":"May 25, 2013 at 9:28 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"author":"jmarino240","post":"Yannick wrote:  “Now, I’ll wait patiently for your answers to my 2 other questions.”  I did reply to the other questions in the next 2 sentences:  “We referred to only one sample with madder rose based on the Nitowski map as opposed to 2 samples that Maloney and McCrone referred to on McCrone’s map” was in response to question 1 and “It’s not proven that gum arabic was on 1FH–we just said it was plausible based on the Quad-mosaic data and Rogers’ findings” was in response to question 3.  It seemed to flow better to start with question 2 and when I originally responded I didn’t specify the other 2 questions.","date":"May 25, 2013 at 6:54 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"author":"jmarino240","post":"I’ve been somewhat out of commission for a few days dealing with a sick dog.  I was preparing a posting consisting of various responses made at the “Shreds of Evidence” posting of 23 September, which overlaps somewhat with this one.  I was almost done when I somehow managed to lose all of the text of the posting.  I’m not in the mood to try and reconstruct tonight.  I’m going to be out of town this weekend.  I might try to start to reconstruct tomorrow night and finish early next week.","date":"October 3, 2013 at 9:39 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"author":"jmarino240","post":"Daveb wrote “So who did the invisible weave? Pricess Clothilde of Savoy around 1868; Or as commissioned by Margaret of Austria, Duchess of Savoy at some time during 1508-1530, as asserted by Marino & Benford?”From:  http://www.shroud.com/pdfs/benfordmarino.pdfThe most famous tapestry-worker of this period was Pieter van Aelst, who producednumerous tapestries for more than thirty years.Max wrote, “Absent the fact that such repairs in this particular area was anything but neutral as it was the very area the most handled with naked hands.”From Robert Buden, President of Tapestries &Treasures. Tapestries & Treasures ( http://www.tapestries4less.com), which produces, imports,exports, and distributes high-quality, historical tapestries to clients throughout the world,including 16th Century pieces in article found at:  http://www.shroud.com/pdfs/histsupt.pdf:Did weavers of the 16th Century possess the skill to ‘invisibly repair’ textiles?Most definitely. Would the restoration of a Holy Relic like the Shroud of Turin beassigned to a novice or the finest craftsmen in the land? I think the latter. Was budget aconcern for the Church or its noble owner at the time? Most likely not.","date":"October 7, 2013 at 10:16 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"author":"jmarino240","post":"Louis wrote “Would you know the names of the institutes, both in the US and the UK?”  Here is a quote from my Fidelity article of Feb 1989:“In April, Harbottle (personal communication, 1988) commented: ‘The experiment is to be performed by the same scientists who not three months earlier clearly and effectively objected to its terms.  But Oxford is heavily supported by the British S.E.R.C. (Science Research Engineering Council) and Tucson equally so by N.S.F. (National Science Foundation); one will be very surprised if shroud dating is not prominently mentioned in heir next round of grant applications.'”","date":"April 22, 2015 at 9:33 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"author":"jmarino240","post":"For some reason, in my previous email, the quote from Freeman, which was to follow “Freeman wrote,” did not appear.  His quote was:Those of us who stick to the presumption of the 1988 dating standing do so a) because in relation to the three possible alternatives, a swapping over of samples by the Cardinal and Tite, some form of contamination ( many different contaminants, soot, sweat, carbon monoxide suggested) or an invisible rewoven patch selected as the sample, critics of the testing disagree so violently among themselves – e.g see Antonacci’s critique of Raymond Rogers’ 2005 paper- that the independent observer cannot be convinced that a single clear refutation of the 1988 testing has been proposed by the critics b) There is not a hint in any of these critiques that resolution of the problems proposed would lead to a radio-carbon 14 dating in the first century.","date":"August 18, 2012 at 5:01 pm","url":"https://shroudstory.com/2012/04/29/carbon-dating-the-shroud-of-turin-again/","cat":"carbon_14_dating","title":"Carbon Dating the Shroud of Turin Again?"},{"author":"jmarino240","post":"There were a couple of sentences I found most interesting in this  paper:   “In any case, the most important aspect of this work, from the point of   view of physicists working in the field of AMS dating, is the methodological  one  concerning sampling strategy.  First, sampling should always be done in   agreement with and under the guidance of scholars and people involved in  the  historical or archaeological problem.  In addition, whenever possible,   collecting several samples from the object to be dated (as we did in the case  of  the two frocks) is definitely the right approach in order to reduce the   possibilities of ambiguities.”","date":"January 25, 2014 at 6:49 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"jmarino240","post":"Charles,   The Chemistry Today article ends:   The exact ratio of patch versus original threads is not determinable  by photographic analysis alone; however, a well-supported estimate,  based upon weave-pattern changes, has been posited (2) reflecting  approximately 60 percent of the C-14 sample consisting of 16th Century  threads while approximately 40 percent were 1st Century in origin. The  radiocarbon date was calculated using the percentage of observed 16th  Century (representative date used AD 1500) versus 1st Century  (representative date used AD 75) weave types appearing in the Oxford sub  sample. The radiocarbon calculations were derived using the following  mathematical calculations and in consideration of the above hypothesis. The  question asked was what percent cal AD 1500 + percent cal AD 75  radiocarbon would be required to derive an average age of cal AD 1210  (~Oxford results)? Using standard Measured Conventional Before Present  equivalents, the formulas for calculation become 0.9003 = (x) (0.9558) +  (1-x) (0.7851). Solving for X (where X ~ percent cal AD 1500 carbon  present) X = 0.6749 ~ 67 percent.   Dr. Thibault Heimburger posted recently that he would responding soon to   Hugh’s BSTS article on the invisible reweave theory, so I’m looking forward  to  his post.   Glad you liked Sue’s theory regarding the pyramid.  She was a  remarkable  woman.  I lost her almost 5 years ago and still miss her  terribly.","date":"January 25, 2014 at 4:03 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"jmarino240","post":"Dyes apparently work better with cotton than with flax.","date":"January 23, 2014 at 10:22 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"jmarino240","post":"Charles,   2 good sources to check and/or recheck are:   http://www.youtube.com/watch?v=YWyiZtagxX8 at  about the 26:00 mark and also  http://www.shroud.com/pdfs/benfordmarino2008.pdf.   Many thanks for all your insightful observations.","date":"January 24, 2014 at 7:26 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"author":"jmarino240","post":"It was a hybrid:  Wasserman!  But “Jerry” was also mentioned, suggesting Wasserburg.  But Rossman answered in the affirmative when Sue asked him on the phone if he had been involved.  This is emblematic of the extreme confusion in this whole thing.  I don’t believe this will get sorted out to anyone’s satisfaction.","date":"April 29, 2014 at 8:15 am","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"},{"author":"jmarino240","post":"See http://www.shroud.com/late02.htm.   Another point of confusion is the fact that Wasserburg also studied moon rocks.","date":"April 29, 2014 at 8:23 am","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"},{"author":"jmarino240","post":"I should also point out that at the time Sue talked to Rossman, we were unaware of Wasserburg’s existence.","date":"April 29, 2014 at 8:26 am","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"},{"author":"jmarino240","post":"In this case, instead of saying yes to specific proposed possibility, I should say that given the extreme confusion, anything is possible.","date":"April 28, 2014 at 10:02 am","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"},{"author":"jmarino240","post":"Dear Giorgio,   I agree that the cultural aspect is huge but the phrase “ordained priests   who had ownership of the Shroud” leaves a very bad taste in my mouth.  In   my view, the Shroud belongs to the world, not to just the Church and  certainly  just not to ordained priests.  STURP was invited by Church authorities to   try and find out the truth about the Shroud and there were some  significant  cultural “hindrances.”  If the original plan of letting STURP II have 2   weeks for a multi-disciplinary program with the Shroud, it is likely that it   would have cemented the idea that the cloth is probably the burial cloth  of  Jesus (one can probably never get to 100% certainty).  If that had   happened, who knows how many people might have been brought to Catholicism or   Christianity?","date":"September 7, 2015 at 10:32 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"author":"jmarino240","post":"Dear Giorgio,   Thanks for the clarification.  But I believe there was in 1978 some  sense  of ownership by the Church in the other interpretation of  the word.  Lest I  sound like a broken record, if the Vatican is in the  business of trying to  save souls and is interested to find out the truth of the  Shroud as they  proclaimed in 1978, they would allow more than just public  expositions.","date":"September 7, 2015 at 11:04 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"author":"jmarino240","post":"Although Sebastian Valfre was known to have worked on the Shroud in the 17th century, other repairs could certainly have been made earlier.  Giulio Fanti believes a reweave could have been done in the 13th century.  Sue and I suggested around 1530 for the major reweave.","date":"September 11, 2015 at 5:36 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"author":"jmarino240","post":"The authors cite 2 follow up papers of ours but not the original one presented in Orvieto, Italy in August 2000.  A shortened version of that paper appears on shroud.com.  The quality of the illustrations on the online version is not as good as in the original, which were published in the official printed Orvieto proceedings, of which i have a copy.  I’m not sure if they’re still available.  The Proceedings have excellent reproductions from our paper of a very high resolution picture of the C-14 corner taken from “Shroud Guide” by Gino Moretto, secretary of the Shroud Museum in Turin, and a radiograph of that area by Dr. Larry Schwalbe of STURP.   So it is not true to say our theory was based on low resolution photographs.","date":"September 6, 2015 at 12:47 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"author":"jmarino240","post":"Louis, I’m unaware about your reference to “‘Shroudie’ presence at the Hampshire convention.”  Please elaborate.  Thanks.","date":"September 6, 2015 at 4:46 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"author":"jmarino240","post":"Okay, I was aware of that–just didn’t realize it was called that.","date":"September 6, 2015 at 5:31 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"author":"jmarino240","post":"Here are some thoughts as I come in hot and sweaty after cutting my lawn.  The Church made some mistakes in the 1988 dating.  Cardinal Ratzinger approved STURP II’s 1984 plan, which would have given them 2 weeks for a multidisciplinary program.  Politics were allowed to rule.  Chagas was unduly influenced by Gove.  I can’t remember if it was in the “La notte della Sindone” documentary or a written source, but someone characterized Chagas words to the effect as being “in Gove’s back pocket.”  If the original plan had been implemented, we would not be in the situation we are now.  The Church said in 1978 they were only interested in the truth.  They have allowed 4 full-fledged exhibitions since 1978.  They are looking for ways to promote ecumenism.  Since the Shroud is not even an article of faith, it’s a good opportunity to facilitate some bonds between different faiths.  The 1978 scientists spent much of their own time and money studying the Shroud.  How much more could 21st century scientists, who probably would also invest much of their own time and money, tell us about the cloth.  I would like to see the Church do more to back up their 1978 claim that they’re only interested in the truth and do more than just exhibit it periodically.","date":"September 6, 2015 at 7:08 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"author":"jmarino240","post":"My reference to Cardinal Ratzinger was in reference to the 1988 time frame   so I don’t know how his 1978 assignment enters into this.   I can understand some concern about the sect’s approach but I don’t think a   lecture to such a group by Shroudies holds–or should hold–that much   weight with Rome.  If Rome was overly concerned about people using the  Shroud  as proof they are right in their Christian faith, it would be   counter-productive to have allowed all of the public expositions.  I think  it is  irrelevant to ask what if the Shroud didn’t exist.  It exists and we  have to deal  with it.  I agree, though, that even a veritable authentic  Shroud wouldn’t  answer all the questions.  But I still think the Church  should try to right  the wrongs from the 1988 testing.  That could eliminate  some of the  existing problems.","date":"September 6, 2015 at 9:06 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"author":"jmarino240","post":"I find your comments insulting.  When I reposted the 2nd time, I actually was going to insert “Apologies if this gets posted twice, I tried posting it before and it didn’t see it.”  Then I removed those 2 sentences, figuring that the first one wasn’t going to go through, even though I didn’t know why,  I didn’t even realize I had filled out the boxes wrong on the 1st one.  You’re incredible.  I’ll say it again–I made no intentional effort to adopt a new pseudonym.","date":"December 9, 2015 at 9:52 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"author":"jmarino240","post":"This will be my last comment on this.  What’s insulting is that you keep insisting I was attempting to post a new anonymous pseudonym when I’m telling you I did not.  Why on earth would I do that in a string when i had already posted under my own name?  I may have gotten things confused but I’m not trying to pull the wool over anyone’s eyes. Your comment about me saying you should look to miraculist explanations is not accurate portrayal of the exchange.  Regarding the lack of a question and answer session, I’ve told you several times it was simply a matter of having too many presentations to have time for Q & A.  We made provisions for a post-conference online forum for people to ask questions to the speakers, through which much more could be accomplished than a 10 or 15 minute question and answer session.  You may tell things the way you see them, but that doesn’t make them right.","date":"December 9, 2015 at 10:27 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"author":"jmarino240","post":"Pam Moon has asked me to post the following:  “‘Thank you Dan for presenting the work so beautifully and drawing people’s attention to it.  And thank you to those who have read the paper.  I realise I have omitted one important thank you, which is to Donna Campbell.  When I showed her Barrie’s Arizona images she said that the Shroud fibres looked “too orange.”  It was that thought that allowed me to understand some of the problems of colour in Figure 1 (page 3) after Joe sent the image. The question why the Shroud was dyed is an interesting one.  But it is the speculative end of the paper: at present I am waiting for bloggers and Shroud experts to find the hard science that refutes the dye theory; if such science exists.  Thanks again to all who have taken the trouble to read the paper.’","date":"December 9, 2015 at 10:55 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"author":"jmarino240","post":"I should also point out that the late Ray Rogers had a preconception that I and my late wife were part of the “lunatic fringe.”  He thought he was going to disprove our theory in 5 minutes.  In fact, he was embarrassed that he ended up agreeing with us.  He changed his mind because that’s where the data led him.  That’s the scientific method at work.","date":"December 9, 2015 at 6:30 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"author":"jmarino240","post":"Matthew, I agree.","date":"December 13, 2015 at 8:24 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"author":"jmarino240","post":"Pam Moon has asked me to post the following:  “”The paper has been revised and is resubmitted: http://shroudofturinexhibition.com/Shroud_of_Turin_exhibition/Dye_and_radiocarbon_date_files/Dye%208th%20Dec%20spectroscopy.pdf.I would like to thank blog contributors for their helpful advice. I apologise for writing that there had once been a patch – thank you Hugh.  I had omitted one of the key aspects of Ray Rogers’ work – spectroscopy.  That is now included in the review of his findings.”","date":"December 13, 2015 at 8:22 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"author":"jmarino240","post":"Pam Moon has asked me to post this:  “Hi HughThank you for your questions.  Regarding the Holland cloth the possibility you suggested that the Holland fibres came from under the Raes sample where there was no dye makes sense.  It would be easy, as the Raes sample was cut, to add fibres of Holland cloth. Dissolving in water: the section (page 6) was included to answer your previous question.  I found it  in Rogers’ emails circulated by Barrie and Joe.   The gum dissolves in water but once the ‘water evaporates, a colorless, easily seen film of gum is deposited around the fibre.’  Perhaps it is something to do with the tenacious, adhesive qualities of gums. Gum arabic is a major component of chewing gum.  It dissolves in water but when the water is gone it sticks. So the need for con HCl.I found the following quote from wikipedia which seems to confirm that:‘Gum arabic is used as a binder for water colour because it dissolves easily in water.  Pigment of any color is suspended within the acacia gum in varying amounts, resulting in watercolor paint. Water acts as a vehicle or a diluent to thin the watercolor paint and helps to transfer the paint to a surface such as paper. When all moisture evaporates, the acacia gum binds the pigment to the paper surface.’Thanks also for the question about the difference between dye in linen and cotton.  Rogers is right that cotton is much easier to dye than linen: ‘the flax fibre is harder than cotton, and dyestuffs do not penetrate so readily into it.’ (Handbook of Textile Fibres J Gordon Cook pg 9).  So some of the linen fibres are clean and have resisted dye whilst the cotton is overloaded on the surface.  The depth of the dye through the fibre is referred to by Rogers.  In the image top 6 cotton fibres are shown coloured on the outside and nearly colourless on the inside;  Raes 14 is similar (see bullet point 18).  Writing this I realise for the first time that Rogers wrote the following in bullet point 18: ‘The outside of the (Raes 14) thread showed the deepest encrustation of any of the samples, except one end of Raes 1 (the spliced thread).’  So the colour change in Raes 1 is definitely dye.However, I will ask Teresinha about the questions when she has time to see me.  I suggested gum tragacanth because she had never used gum arabic for fabric.  She said she was happy to experiment with gum arabic and she will answer these questions much better than me.”","date":"December 13, 2015 at 3:13 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"author":"jmarino240","post":"Here is Bill Meacham’s reply to Hugh’s question (#9):There are hundreds or even thousands of examples, but usually these aberrant dates are attributed to something, either “contamination” or “old wood” or “an intrusive sample” etc. . Almost always there is no proof of such, the only evidence being that the date doesn’t agree with the context so it must be due to something. But the “reasons” proposed are merely guesswork to justify dismissing the aberrant date.I quote lots of examples in the pre-ShroudC14date article:http://www.shroud.com/meacham.htmHere’s one quote from that article regarding Late Minoan 1B chronology:“Betancourt et a1(1978:202) also discuss several dates that are too early or too late in the expected historical chronology, and conclude:‘One or two dates should never be used by themselves to establish a site’s chronology. So many dates have proven to be useless because of contamination and other causes that one can only establish a radiocarbon chronology with some degree of confidence if several dates from the same site fall into a consistent pattern that agrees with the stratigraphic sequence.’ ”Regarding Hugh Farey’s comment, the archaeologist or geologist is more interested in getting results that agree with the other data, so they will collect and submit more samples. The lab folks run their procedure and invariably attribute the “aberrant” date to some issue in the field.","date":"February 2, 2014 at 10:57 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"author":"jmarino240","post":"“If the 1988 Shroud dating had come out 1st century, the skeptics would have objected to the methodology (and probably still would be objecting).”Colin wrote “But on what grounds?”The 1988 dating did not follow the 2 points mentioned in the article about the St. Francis articles:  “First, sampling should always be done in agreement with and under the guidance of scholars and people involved in the historical or archaeological problem. In addition, whenever possible, collecting several samples from the object to be dated (as we did in the case of the two frocks) is definitely the right approach in order to reduce the possibilities of ambiguities.”Although a planning meeting in Turin was held in 1986 that could have, if it had been followed, fulfilled the 1st point.  But when it came time to actually take the sample, all of that was thrown out the window.  And because only one sample was taken, there are, in fact ambiguities.Skeptics could object on the same grounds that pro-authenticity researchers have:  the whole dating exercise was not rigorous science.","date":"February 2, 2014 at 1:57 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"author":"jmarino240","post":"For those who aren’t aware, Harry Gove had sent a letter to Sir David Wilson of the British Museum, describing the Shroud C-14 dating as “a somewhat shoddy enterprise.”  This is quoted on page 95 of Meacham’s book “The Rape of the Shroud.”  There Meacham describes his own letter to the British Museum, which he had copied to Gonella and STURP, along with a copy of the complete letter that Gove had sent to the British Museum.","date":"February 3, 2014 at 7:35 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"author":"jmarino240","post":"I think at a minimum, many people feel that because the exercise was so chaotic (down to getting versions of the sizes and weights of the samples, which should be basic and straightforward), why should the results be trusted?  If a physician is sued for malpractice and loses, he/she may have a good track record otherwise, but the focus is going to be on where he/she currently messed up.  And the best track in the world doesn’t negate the consequences of the malpractice.","date":"February 3, 2014 at 9:34 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"author":"jmarino240","post":"I would say that STURP’s “conclusions established in favour of the authenticity of the shroud” was more in the sense that they didn’t find any concrete evidence that it was a medieval forgery.  Barrie Schwortz has said he expected to find evidence of brush strokes in the 1st 30 minutes they were there and Ray Rogers said that if you gave him 15 minutes he would have it (the Shroud’s possible authenticity) shot full of holes (hence his reputation as a “gun-slinger”).  If, in fact, the Shroud was a forgery, one would expect that STURP would have found something major to indicate that but they didn’t.  And all of this once again points towards the idea that the C-14 dating, which is often wrong and dispensed with when trying to determine the date of an object, was wrong for some reason in the case of the Shroud.","date":"February 4, 2014 at 9:56 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"author":"jmarino240","post":"I confined my comment to STURP because that was the only full-scale  study.   The 1969-1973 Turin Commission study (published in 1976) was very  limited  in scope.  It had some who believed the Shroud was a forgery and  others  who believed it could have come from the 1st century.   Flury-Lemberg believes she’s found something that she believes at least   comes close to placing the Shroud in a 1st century context:   Flury-Lemberg  had originally been approached back in the early 1980s to  try to date the Shroud  by analyzing the structure of the cloth. She refused,  “because,” she says, “it  is impossible to get a serious result dating a  textile by textile analysis  alone.” In 1988, the keepers of the Shroud  permitted radiocarbon dating of the  relic — with unanticipated results. The tests  indicated that the cloth had been  made sometime between 1260 and 1390  A.D., and thus was a medieval forgery rather  than the actual burial shroud of  Christ. And yet, when Flury-Lemberg finally did  agree to head the  restoration and conservation of the linen in the summer of  2002, the Shroud had a far  different story to tell her. She first noticed that  the entire cloth was  crafted with a weave known as a three-to-one herringbone  pattern. “This kind  of weave was special in antiquity because it denoted an  extraordinary  quality,” she says. (Less fine linens of the first century would  have had a  one-to-one herringbone pattern). That same pattern is present on a  12th  century illustration that depicts Christ’s funeral cloth, which, she says,  is  “extremely significant, because it shows that the painter was familiar with   Christ’s Shroud and that he recognized the indubitably exceptional nature of  the  weave of the cloth.” Flury-Lemberg also discovered a peculiar stitching  pattern  in the seam of one long side of the Shroud, where a three-inch wide  strip of the  same original fabric was sewn onto a larger segment. The  stitching pattern,  which she says was the work of a professional, is  surprisingly similar to the  hem of a cloth found in the tombs of the Jewish fortress  of Masada. The Masada  cloth dates to between 40 B.C. and 73 A.D. The  evidence, says Flury-Lemberg, is  clear: “The linen cloth of the Shroud of Turin  does not display any weaving or  sewing techniques which would speak against  its origin as a high quality product  of the textile workers of the first  century.” This can be found at:   http://www.pbs.org/wnet/secrets/previous_seasons/case_shroudchrist/interview.html","date":"February 4, 2014 at 9:24 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"author":"jmarino240","post":"The quotation no doubt comes from her book “Sindone 2002” (Editrice ODPF,   Torino, 2003).","date":"February 5, 2014 at 1:50 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"author":"jmarino240","post":"I have emailed archaeologist Bill Meacham for a  specific example.","date":"February 2, 2014 at 9:30 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"author":"jmarino240","post":"2 other details to my previous posting.  The page # that the quote appears on in the Marinelli/Petrosillo book is 141.  “CPS” stands for Collagemento Pro Sindone,” which used to be print and is now totally online at http://www.shroud.it.","date":"October 12, 2013 at 12:31 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","title":"Low Level Fraud? and more"},{"author":"jmarino240","post":"There are still a lot of people who believe the 1988 tests prove the Shroud to be a fake.  Perhaps most of those people won’t change their minds because they’re happy for the Shroud not to be real.  But some people might change their minds if they’re informed of all the pertinent facts.  If nothing else but for the sake of those people, I think it’s worth discussing why the dating was unreliable.Gian Marco Rinaldi has posted some information from the Italian documentary “Night of the Shroud.”  Below is some information I put together that also includes data from that documentary:We all know that Michael Tite, the overseer from the British Museum for the 1988 dating, took over for Teddy Hall when he retired and after some anonymous businessmen donated 1 million pounds to Oxford for ostensibly having proven the Shroud a fake.  If nothing else, it just looks shady.I’ve discovered some other relationships that also appear to be alarming along with many indications of political maneuvering.  The Italian Documentary “The Night of the Shroud” made the following observations:*On January 4, 1984, Teddy Hall wrote a letter to a member of the Academy, Prof. Porter to encourage the Vatican to allow C-14 testing.  A copy of the letter was sent to the President of the Academy, Carlos Chagas and also to the Vatican.  But the copy to the Vatican only contained the 1st page, which criticized STURP, but without saying why.*Chagas later wrote Cardinal Ballestrero that everything was going fine but then turned around and wrote the Vatican saying there were problems with Ballestrero.*In 1985, Harry Gove produced at the Trondheim C-14 conference a suggested protocol for the Shroud C-14 dating.  Chagas let only another Academy member, NASA scientist Victor Canuto, to review the protocol.*One person in the documentary said that Gove had Chagas in his pocket.*In July 1985, after STURP submitted their test proposal, Chagas again had Canuto review it.  Chagas reported as his own Canuto’s report, which criticized STURP’s proposal to do a C-14 in conjunction with 25 other tests.*On July 13, 1985 Cardinal Ratzinger approved for a 2nd time STURP’s 26 test proposal.*On July 22, 1985, Harry Gove met with Victor Canuto.*During the Turin workshop meeting in September 1986, Chagas asked Canuto to come up with a summary of proposals.  According to William Meacham, the text did not reflect what everyone had agreed upon.  Luigi Gonella, Cardinal Ballestrero’s advisor, requested corrections be made but that wasn’t done.  The text was not signed by anyone but was presented by Chagas as the agreement with Church authorities.*Cardinal Ballestrero wrote a letter to the Vatican Secretariat of State regarding the strange behavior of Chagas.*On May 21, 1987, the Secretariat of State said that there would be 3 labs, 3 samples and 1 sample site.*On October 10, 1987, Cardinal Ballestrero made an official announcement regarding the number of labs and samples.*Gove, upset at not being 1 of the 3 labs, contacted the Papal Nuncio, American Senators and the Ambassador to the Vatican, but to no avail.*The 3 chosen labs all wrote letters to the authorities that were the exact wording of the letter that Gove had sent to the Nuncio, Senators & Vatican Ambassador.  The letter from the Zurich lab was postmarked in Rochester, where Gove lived.*The Secretariat of State informed Cardinal Ballestrero that only the C-14 test should be done.*Only Cardinal Ballestrero and Michael Tite put the samples in the containers for the labs.  (Although there was something like 22 hours of videotape, the putting of the samples into the containers was the only part of the procedures that wasn’t filmed.)*About 2 weeks after the dating, Chagas was removed as President of the Academy.  (I learned from another source that the announcement was made by a Msgr Renato Dardozzo, who will come up again shortly.)*The late Professor Jerome LeJeune, a member of the Academy, publicly stated that further analysis of the C-14 results needed to be made.This next part does not come from the Italian documentary.  I discovered that Msgr. Renato Dardozzo was the Chancellor of the Academy (i.e, Chagas’ right-hand man).  According to June 3, 2009 article in “The Guardian” (UK) (http://www.guardian.co.uk/commentisfree/belief/2009/jun/03/vatican-central-bank) Dardozzo smuggled out more than 4,000 documents pertaining to the scandal-racked Vatican Bank.  The article says, “It is interesting to note that Dardozzi’s motive for turning whistleblower was not unalloyed disapproval of the IOR’s unethical conduct.  His decision to smuggle his secret archive out of the Vatican was motivated, at least in part, by anger at the Institute’s refusal to pay him a commission on the sale of a valuable real estate property near Florence.  The unusual monsignor wanted to leave the money to his adoptive daughter, who health condition required expensive treatment.”So, we have a financially-needy monsignor, who was the right-hand man to Chagas, alleged to be in Harry Gove’s pocket.  If there was a million dollar pound donation available for the Oxford lab for ostensibly having proven the Shroud to be a fake, were there additional “donations” to pass around to key authorities to make sure that certain actions would take place for the C-14 dating of the Shroud?  While there’s no hard proof, it once again looks suspicious.I know an ex-NASA scientist who knows Victor Canuto.  The scientist asked Canuto for the story about the C-14 dating–but Canuto wouldn’t tell him a thing.With all of the above circumstances, the last thing that should be done is to blindly accept the results of the 1988 dating.","date":"May 9, 2013 at 9:45 pm","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?"},{"author":"jmarino240","post":"I agree with Hugh and Thibault that this is a very fine paper.  I look forward to additional writings by O.K. on this as well as from Thibault.  I think it’s certainly possible that the other corner was rewoven as well.  Two good sources pertaining to the question are “Some Details About the STURP Quad Mosaic Images” at http://www.shroud.com/pdfs/quad.pdf and “Digital image processing techniques demonstrating the anomalous nature of the radiocarbon dating sample area of the Shroud of Turin” at http://www.academicjournals.org/article/article1380798975_Morgan.pdf.  One of the topics to be discussed at the St. Louis Shroud conference is Future Testing of the Shroud by Prof. Bruno Barberis.  If testing is allowed, the whole question of reweaving and possible locations definitely need to be looked at more closely.","date":"June 1, 2014 at 2:13 pm","url":"https://shroudstory.com/2014/05/31/were-both-ventral-and-dorsal-corners-of-the-shroud-rewoven/","cat":"carbon_14_dating","title":"Were both ventral and dorsal corners of the Shroud rewoven?"}],"dna":[{"author":"jmarino240","post":"test","date":"December 9, 2015 at 9:22 am","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"}],"events":[{"author":"jmarino240","post":"It is true that most Shroud conferences have papers or presentations by   those who believe in the Shroud’s authenticity and that most papers are simply   read out.  There was a conference in Elizabethtown, Pennsylvania in 1986   that had 5 speakers that were pro-authenticity and 2 that were skeptics  (Walter  McCrone & Joe Nickell).  At the Columbus, Ohio conference in 2008,   organized by myself and my late wife, a paper was presented by a Spanish doctor   who believed the Shroud image shows that the man in the Shroud was not   dead.  No other skeptic submitted a paper.   When I produced a print Shroud newsletter and then later a Shroud email   bulletin, I used to get a lot of grief from people for publishing views of   various skeptics as well as theories outside the mainstream.  I personally   welcome and I welcome as spokesman for the committee putting together the St.   Louis conference any submissions for papers with opposing views of   authenticity.  You have my word that those papers would not be  discriminated  against because it opposes authenticity.  We would also  welcome a debate and/or  roundtable. In 2008, we had an open discussion  about the C-14 that included  all of the attendees, not just those who had  presented papers.  We also  had question and answer sessions that did not  require, like a certain  conference in 2005, that the questions be written down  beforehand so that they  could be screened.   Charles and Colin, we would very much like to see you in St. Louis.","date":"October 30, 2013 at 5:44 pm","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"author":"jmarino240","post":"As I recall, the point at which Msgr. Ghiberti walked out is when Barrie   showed a DVD of some of the Ray Rogers interview he had made and had showed  the  quote from Turin’s own scientific advisor to Cardinal Poletto, Piero  Savarino,  who wrote, “extraneous substances found on the samples and the  presence of  extraneous thread (left over from ‘invisible mending’ routinely  carried on in  the past on parts of the cloth in poor repair).”","date":"November 12, 2013 at 7:37 am","url":"https://shroudstory.com/2013/11/12/of-enchiladas-listerine-and-dont-mess-with-texas/","cat":"event","title":"Of Enchiladas, Listerine and Don’t Mess with Texas"},{"author":"jmarino240","post":"I think this should be author/journalist “Robert” or  “Rob” Wilcox, who I  believe attended the 1973 exhibition.","date":"January 29, 2015 at 5:42 am","url":"https://shroudstory.com/2015/01/29/picture-for-today-1973-exhibition-of-the-shroud/","cat":"uncategorized","title":"Picture for Today: 1973 Exhibition of the Shroud"},{"author":"jmarino240","post":"We had hoped to have question & answer sessions but so many papers were submitted and accepted that there is no room for the Q & A.  There are plans, however, for people to make comments regarding the papers on the conference site.","date":"June 2, 2014 at 9:35 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"author":"jmarino240","post":"Just a clarification about the roundtable I mentioned in the posting from 9:30 p.m.:  it’s actually going to be an open discussion.  Roundtable tends to imply just a few experts sitting around a table, but it will be a discussion in which conference attendees can participate.","date":"June 2, 2014 at 11:07 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"author":"jmarino240","post":"A conference paper’s merit can always be debated; even reviewers disagree, which is why there is more than just one for each paper.  Regarding the Evaristo passages, more documentation is certainly needed.  I’ve inquired to Evaristo to see if anything more solid can be put forth.","date":"June 1, 2014 at 1:26 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"author":"jmarino240","post":"O.K. I understand your concern but putting on a conference is not a perfect democratic process.  If the organizers waited until everyone was satisfied with all the aspects, a conference would never happen.  Some people like the one you mention already have their minds made up and nothing, even approval of the reviewers, is likely to change their mind.  The organizers simply can’t let opinions like the person you cite affect the running of the conference.  We know there will be criticisms and we just accept that.  It’s also important to remember that one of the purposes of a conference is to stimulate new ideas, not necessarily just to make conclusions.","date":"June 1, 2014 at 1:50 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"author":"jmarino240","post":"Since 2 of the committee members had websites and since a conference needs   sponsorship, it only seemed natural to have them co-sponsor.  Internally,   we haven’t put a lot of focus on that.  We’re just people who are   interested in the Shroud and interested in spreading information about it.   Ours is  a U.S. style conference and not similar to the higher-end   professionally-sponsored conference that many European conferences are.   who attended the  1991 St. Louis conference and the 2008 Columbus conference  seemed to enjoy  those and I’m confident that the 2014 St. Louis conference will  also be a  great experience.   Several STURP members, including Barrie Schwortz and John Jackson are   planning to attend.  We’re also hoping that Ken Stevenson, Tom D’Muhala,  and  John “Dee” German will come.  Bob Villarreal of the Los Alamos National   Laboratories will likely present.  Various other scientists have expressed   preliminary interest in coming.   There’s already too much politics in sindonology.  I wish it wasn’t  being  added to a conference barely off the ground.  We’re hoping to add  some new  blood to sindonology.  We would like to just share Shroud  information, see  old friends, meet new ones and feel that this conference  is a good way to  do that.  The sponsorship is an important issue, but  it should not be  overblown.","date":"October 26, 2013 at 11:24 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","title":"Some thoughts on the St. Louis conference announcement"},{"author":"jmarino240","post":"The St. Louis conference is actually after the Bari conference, not  before  and it’s almost 5 weeks difference, not 3.  Although it’s  unfortunate that  they’re close together, I think most Americans at least would  prefer to  attend a conference in the USA instead of Italy.   I’m not sure why there’s an impression that there is a focus on the   co-sponsors.  We simply announced who the co-sponsors are and links  were listed  as part of the basic information.   I’m also not sure why it’s felt there may be an agenda.  Although the   title points to the science/faith intersection of the Shroud, that’s always a   given, and it was announced that topics for papers are open to any major  aspect  of sindonology.   I was involved in planning both the 1991 St. Louis conference and the 2008   Columbus conference.  One of the reasons the Columbus conference was held   was that I was upset at the way the 2005 Dallas conference was held and also   because of some restrictions that were going to be in place for another   conference that was never actually held.  The Columbus conference had a   paper by a Spanish doctor who held that the Shroud image shows that the man in   the Shroud was not dead.   Although I am only one of 6 committee members for the 2014 St. Louis   conference, I intend to push for complete openness and fairness in terms of   papers that will be presented.  I can tell you that in our many conference   calls, other committee members expressed their willingness to have papers by   Shroud critics to be presented.   It’s unfortunate that this sort of cloud is being cast over the St. Louis   conference.","date":"October 26, 2013 at 10:28 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","title":"Some thoughts on the St. Louis conference announcement"},{"author":"jmarino240","post":"Paulette wrote:  “Who wouldn’t click on those URLs if interested in the conference and not be horrified. There is a big disconnect between Marino’s vision for a conference and what was announced by Schwartz.”I actually wrote the piece that was published by Schwortz.  Please focus on the vision as I expressed it in my comments and not your interpretation of the basic announcement.","date":"October 26, 2013 at 12:33 pm","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","title":"Some thoughts on the St. Louis conference announcement"},{"author":"jmarino240","post":"Dan wrote, “Will a video in support of Mark’s hypothesis or his petition to the pope be prepared and include filmed clips from the conference. I wouldn’t want to part of that under any circumstance. You need a good conference website with links maybe in a contact page. And paper selection needs to be carefully explained.Mark is actually working on a Press Release right now to propose new testing, which includes a short video.  There is no video planned in the scenario you painted.  More information will be added to the conference site as we get off the ground.Going back to Paulette’s comment about who wouldn’t be horrified regarding the links, there are other factors to consider besides who the official sponsors of the conference are.  If certain people don’t attend just because of those, we’ll just have to live with that.","date":"October 26, 2013 at 1:36 pm","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","title":"Some thoughts on the St. Louis conference announcement"},{"author":"jmarino240","post":"Russ Breault will be recording the talks and they will be eventually be on   his shrouduniversity.com site.  There will a dedicated site for the texts   of the papers.  Regarding “nut job” papers, just remember that,   historically, some accepted mainstream science was originally considered  ridiculous.","date":"July 6, 2014 at 7:51 am","url":"https://shroudstory.com/2014/07/06/put-st-louis-on-the-map/","cat":"st_louis_2014","title":"Put St. Louis on the Map"},{"author":"jmarino240","post":"Sal,   My main goal is to share the videos with the public.   Russ wrote to me:  “Don’t know about YouTube yet.  My plan will  be to  upload everything to Vimeo and then link to them from  ShroudUniversity.com.  I  will have to hire a student to assist me but the  goal will be to have  everything live on the site by the end of the year.”","date":"July 6, 2014 at 5:11 pm","url":"https://shroudstory.com/2014/07/06/put-st-louis-on-the-map/","cat":"st_louis_2014","title":"Put St. Louis on the Map"},{"author":"jmarino240","post":"This is what I heard from Richard: ERIC WOULD NOT ALLOW THE TALK TO BE TAPED.  THE TALK WAS GEARED TO A GROUP OF STUDENTS.  THERE WERE ABOUT 50 OR SO THERE.  THE TALK WAS CASUAL AND RELAXED, ERIC WAS IN GOOD FORM WITH SOME COMICAL REMARKS AS HE SHOWED IMAGES OF THE 78 STURP STUDY.  ERIC WAS VERY SPECIFIC IN STATING DURING HIS TALK AND FOLLOWING HIS TALK THAT HE WOULD NOT BE IN ANY FURTHER SHROUD RESEARCH.  HIS ONLY CONCESSION WAS THE CHANGE IN HIS THINKING AFTER READING RAY’S PAPER [and the book Wrapped Up in the Shroud:  Chronicle of a Passion]. HE REMINISCED WITH FONDNESS MANY OF THE STURP PEOPLE WITH A BIG SMILE ON HIS FACE.  HE WAS SPECIFIC ABOUT THE IMPORTANT WORK OF AL ADLER AND BARRIE SCHWORTZ. Joe","date":"January 31, 2013 at 12:20 pm","url":"https://shroudstory.com/2013/01/31/the-eric-jumper-lecture-at-notre-dame-how-did-it-go-anyone/","cat":"event","title":"The Eric Jumper Lecture at Notre Dame:  How did it go? Anyone?"}],"history":[{"author":"jmarino240","post":"Correction on date of death:  the date in the main text of Mrs. Donnelly’s letter says 1988, but the date at the top of the letter is from 1998, so the latter is the correct death year.","date":"September 21, 2015 at 8:49 pm","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","title":"Another Overwhelming Evidence Argument?"},{"author":"jmarino240","post":"One more excerpt from Donnelly that brings out an important point about the Shroud’s origin:“…the Turin Shroud should be interpreted a 14th C. miracle-duplication of the actual True Sindon, 33AD.  This conclusion was based on various sources quoted, STURP science, and the 1988 readiocarbon tests.  It was also a belief by acceptance, of course, of the C-14 tests as accurate, and the evidence for the Shroud as a 1st C. textile being inaccurate, as given by sindonologists.”","date":"September 21, 2015 at 9:30 pm","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","title":"Another Overwhelming Evidence Argument?"}],"image":[{"author":"jmarino240","post":"Kenneth Johnson has picked up another skeptic’s annoying habit of putting certain words in quotes when they shouldn’t be, like “The ‘scientists’ who refuted his work had no qualifications to perform the analyses on which they claimed to rely” and “One ‘scientist’ seriously theorized that holy radiation from the resurrection might have transferred the image of Jesus to the cloth.”  STURP had chemists, blood experts and experts in many other disciplines, including from some of the most prestigious scientific institutions in the U.S.  It’s highly improbable that McCrone’s judgments would be more accurate than the combined efforts of about 40 other highly scientists (without quotes).  If McCrone is extrapolated to the story of the blind man and the elephant, he would say that his perspective is the only one worth considering.","date":"December 13, 2015 at 9:05 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"author":"jmarino240","post":"Kenneth Johnson also says, “You might better ask how red ochre and vermillion particles get on a real burial cloth.”  Johnson is apparently unaware that many artists were allowed to touch their painted copies to the Shroud to sanctify them.  My guess is that Johnson has done very little reading about the Shroud.","date":"December 13, 2015 at 9:26 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"author":"jmarino240","post":"I am rereading David Sox’s 1988 book “The Shroud Unmasked” (which incidentally was published and ready to go when the official announcement was made, despite the fact that the labs were supposed to have maintained confidentiality).  In his introduction he says, “There were times when I thought I would never live to see the day the Turin Shroud faced its obvious test.  The road to carbon dating has been long, contentious and convoluted.  There are those who will not appreciate mine and others’ effort to have this test.  That’s their problem.  When you open Pandora’s box, you have to be prepared for whatever comes out.  I have always wondered why many so fascinated with the Shroud mystery were afraid to see the end of the story.”  Sox is right about the dating having been contentious and convoluted, and it’s for that very reason that many people feel that the 1988 results are not the end of the story.","date":"December 13, 2015 at 4:36 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"author":"jmarino240","post":"Regarding the C-14 controversy, I recommend the documentary “Night of the Shroud,” which includes interesting revelations from Gonella’s correspondence files.  It’s available at amazon.com for $13.38 but it won’t play on most DVDs sold in the U.S.  I think it will play on most computers.  The link is:  http://www.amazon.com/Shroud-Sindone-NON-USA-FORMAT-Import/dp/B00B67CFMC .  The description is:  SYNOPSIS: THE NEW INVESTIGATION-documentary THE NIGHT OF THE SHROUD produced by RAI and directed by Francesca Saracino, seeks to clarify, with new and unpublished documents, the mountain of doubt about the dating of the Shroud by the carbon 14. It was already known to the carelessness with which they were performed in the late 80s, but radiocarbon testing of this investigation brings to light, with the help of unpublished papers and interesting interviews in world premiere a voluntary controlled, almost fraudulent, in errors and approximations, To enrich the film, the presence of Rosalinda Celentano ( The Passion of the Christ) who read questions in search of answers. Lost among the columns of a medieval church, the actress stimulates the curiosity of the viewer less experienced, refresh his memory on one of the most fascinating topics of Christianity.","date":"December 13, 2015 at 6:19 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"author":"jmarino240","post":"Dan’s blog from June 8, 2012 had the following:  “New York Film Academy graduate Francesca Saracino’s film, The Night of the Shroud, recently won Best Documentary, Best Director, and Best Visual Effects at the Los Angeles Movie Awards. The controversial documentary investigates the authenticity of the Shroud of Turin, a centuries-old linen cloth that bears the image of a crucified man, believed by some to be the cloth in which Jesus was buried. The investigation is hosted by Italian actress Rosalinda Celentano, known for her role as Satan in Mel Gibson’s The Passion of the Christ. It uncovers previously unseen research papers, audio files, videos, and correspondence from researchers, cardinals, and Pope Benedict XVI.","date":"December 13, 2015 at 8:15 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"author":"jmarino240","post":"I agree that reverse engineering is a scientific methodology.  But  Colin  does not seem to want to venture outside of the Shroud-as-medieval  road.  If  his one-way road is wrong, he is at a dead end.","date":"March 31, 2015 at 9:29 pm","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"},{"author":"jmarino240","post":"This is a blog about the Shroud.  If you want to delve into those  other  scientific questions, I’m sure you can find other blogs to express your   opinions.   I never said that general opinion decides a scientific issue.  I was   merely saying that several factors indicate that there is a large number of   people who don’t buy that the Shroud is a fake.  Experiments and papers  should  and will continue to address various aspects of the Shroud.  And  there will  continue to be disagreement about whether the Shroud is authentic or  not.","date":"April 1, 2015 at 6:15 am","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"},{"author":"jmarino240","post":"Giulio had sent power point slides but the flash drive that I put it on   failed.","date":"December 4, 2014 at 5:34 am","url":"https://shroudstory.com/2014/12/04/paper-chase-the-second-face-defended/","cat":"paper_chase","title":"Paper Chase:  The Second Face Defended"}],"misc":[{"author":"jmarino240","post":"Now that I mentioned “Goodnight,” I can’t get the song out of my head (or “out of me head” as the lads might have said), I actually can’t get to sleep.  So here’s another thought I had from the thread:  another way of thinking about “the theoretical or even practical possibility of a repair patch having been inadvertently selected for testing” is that it wasn’t inadvertent at all.  They ostensibly picked that corner for the sample because material from that corner had previously been taken and thus they wouldn’t have to cut from a pristine area.  And since that corner had previously had samples removed (and was a corner always handled during exhibitions), it was an area that warranted repairs.","date":"November 9, 2013 at 4:10 am","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"author":"jmarino240","post":"Here is a transcription of the letter from Prof. Raes to Fr. Dreisbach in the link posted by Giorgio on 27 Feb at 10:22 p.m.:Dear Fr. Dreisbach,            Conc. The Turin ShroudA few days ago Mr. Remi Van Haelst transmitted to me a copy of your letter of October 30 containing a copy of your letter to Mr. Riggi.  Mr Van Haelst asked me to answer directly to you.I will try to clarify as good as possible the situation after (?) the Symposium of Paris.  It is true that in my report of the 1973 I mentioned that I found traces of cotton fibres only in the main body of the Shroud.  I must however add that even for the main body I did not find traces of cotton in all microscopical preparations.  On the other hand, I had only a very small part of the strip added to the main body and I could only make a few microscopical preparations of the fibres of the strip.  We must therefore be very careful with our conclusions.In his contribution of Paris, Prof. Vial suggested that the cotton fibres mentioned in my report could be superficial fibres present on the surface of the Shroud and not belonging to the yarns of the Shroud.  After the Paris meeting I was writing to Prof. Vial telling him that I could not agree with him and that in my opinion the cotton fibres were not superficial fibres.  I proposed to Prof Vial a test allowing to be absolutely sure about the location of the cotton fibres.  I wonder however if it should be possible in practice to perform such a test.  Till [sic] now I did not have any reply of Prof. Vial.  The presence of traces of cotton were confirmed by the sample tested by Oxford for the C-14 datation test.  Prof. Hall found some foreign fibres in his sample identified by a laboratory of Darbyshire as being cotton fibres.  As told in my contribution in Paris we may regret that this laboratory was not able to identify the variety of the cotton fibres by testing the number of reversals as told in my research of 1973.I have tried to answer as good as possible the different questions put to Mr. Van Haelst and Riggi.  If there are any other points that you should like to clarify don’t hesitate to call upon me.                                                                                            Sincerely yours,                                                                                            [signed]                                                                                            G. Raes","date":"February 28, 2015 at 11:59 am","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"author":"jmarino240","post":"Sue Benford had 10 peer-reviewed scientific articles published between 1999   and 2001.  She also co-authored 2 in 2008.  Scientific  kookiness  sometimes eventually becomes mainstream.","date":"January 19, 2015 at 6:10 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","title":"Jeffrey Skurka on Buffalo Catholic Radio Station"},{"author":"jmarino240","post":"Apology  accepted.  In discussions like these, I like to bring up the quote  by the  German philosopher Arthur Schopenhauer (1788-1860):  “All truth  passes  through three stages.  First, it is ridiculed.  Second, it is   violently opposed.  Third, it is accepted as being  self-evident.”  Pseudo-science  is a matter of perspective.  Some Shroud skeptics label the  STURP  scientists, many of whom worked in the U.S.’ space and nuclear  programs, as  pseudo-scientists ostensibly because they wouldn’t declare the  Shroud to be a  fake and/or entertained the idea that it might have wrapped the  historical  Jesus.  Here  are a few more of my favorite quotes regarding thought and reality in   science:  “Old  ideas are not right simply because they are old and new ideas are not  wrong  simply because the are new.”  -Astrophysicist  Tommy Gold  “My  own suspicion is that the universe is not only queerer than we  suppose, but  queerer than we can suppose.”   -J.B.S.  Haldane.  “I  shall not commit the fashionable stupidity of regarding everything I  cannot  explain as a fraud.”  C.G.  Jung  “Nature  never deceives us; It is always us who deceive ourselves.  -Jean  Jacque Rousseau  “All  progress resulted from people who took unpopular  positions.”  -Adlai  Stevenson  “All  great truths begin as blasphemies.”  -George  Bernard Shaw  “…after  a few more flashes in the pan, we shall hear very little more of  Edison or his  electric lamp.  Every claim he makes has been tested and  proved  impracticable.  -New  York Times, January 16, 1880  “X-rays  will prove to be a hoax”  -Lord  Kelvin (1824-1907), English physicist and mathematician, who  performed  mathematical analysis of electricity and magnetism and invented the   absolute-temperature scale.  “Heavier-than-air  flying machines are impossible.”  -Lord  Kelvin, President, Royal Society, 1895  “Anyone  who looks for a source of power in the transformation of the atom  is talking  moonshine.”  -Lord  Rutherford (1871-1937), physicist who developed the theory of atomic   structure  “There  is no likelihood that man can ever tap the power of the atom”  -Robert  Millikan, Nobel Prize physicist, 1923  “It  is entirely possible that behind the perception of our senses, worlds  are hidden  of which we are unaware.”  -Albert  Einstein  When  asked in a Discover Channel documentary about the possibility of the  validity of  the phenomenon called “remote viewing,” a scientist responded,  “I wouldn’t  believe it even if it was true.”  (Now there’s an open-minded   scientist!)","date":"January 20, 2015 at 6:58 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","title":"Jeffrey Skurka on Buffalo Catholic Radio Station"},{"author":"jmarino240","post":"Sue was a co-author with Apollo astronaut Edgar Mitchell on a paper pertaining to Quantum Mechanics at the Fifth International Conference on Computing Anticipatory Systems(CASYS’01), Liège, Belgium,  August 13-18, 2001.  I wouldn’t classify Mitchell as an amateur scientist  and I don’t think he lightly chooses his co-authors. Regarding Spontaneous Human Combustion, Sue believed it was basically a rare medical condition (she was a nurse).  She was actually filmed for a documentary saying that but she ended up on the cutting room floor because that was too dull of an explanation for a TV program that likes to push  mystery. You obviously have your mind made up about Sue so I will end here.","date":"January 19, 2015 at 8:41 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","title":"Jeffrey Skurka on Buffalo Catholic Radio Station"},{"author":"jmarino240","post":"I’ll inquire to Jeffrey regarding any documentation he might have.","date":"January 19, 2015 at 6:02 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","title":"Jeffrey Skurka on Buffalo Catholic Radio Station"},{"author":"jmarino240","post":"It’s nice to get some good news like this.","date":"August 23, 2014 at 7:24 am","url":"https://shroudstory.com/2014/08/23/new-mexico-shroud-museum-to-reopen/","cat":"news_&_views","title":"New Mexico Shroud Museum to Reopen"},{"author":"jmarino240","post":"I wanted to mention 2 things before the postings are stopped:  1)  Just a reminder that the St. Louis conference site (http://www.stlouisshroudconference.com/) will be taken down on or around January 19th.  The papers and videos of the presentations are at shroud.com so those will not be lost.  What will go away is the forum that was set up for readers to interact with the conference speakers.  2)  I’ve recently started what will likely be a 3 part article regarding the background of the 1988 C-14 test.  I’m hoping to have part 1 done by January 21 so that Barrie can link to it in his 20th anniversary update.","date":"December 18, 2015 at 7:18 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"}],"opinion":[{"author":"jmarino240","post":"One sentence in the blog posting caught my eye:  “I was personally   astonished, having had some contact with members of the 1978 Shroud of Turin   Research Project members, Dr. John Jumper and photographer Barrie  Schworz.”     What about Dr. Eric Jackson?  (BTW, he also misspelled Barrie’s last  name.)","date":"March 21, 2013 at 6:05 am","url":"https://shroudstory.com/2013/03/21/more-from-the-tours-of-the-nine-replicas/","cat":"other_blogs","title":"More from the tours of the nine replicas"}],"researchers":[{"author":"jmarino240","post":"What documentation do you have that Rogers “was clearly piqued when the   radiochemical dating was announced?”  I’ve always heard that he completely   accepted the results.  He didn’t get back into the Shroud scene until 2000,   12 years after the dating.","date":"February 4, 2014 at 7:02 am","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","title":"Colin Berry on Rogers’ Thermochimica Acta Paper"},{"author":"jmarino240","post":"You changed from “was clearly piqued when the radiochemical dating was   announced” to “…I do think that Roger’s reactions on hearing the radiocarbon   date would be one of pique.”  You went from stating a fact to stating a   speculation.  And Rogers was biased?  Nothing you quoted proves  your initial  statement of fact nor does it prove your subsequent  speculation.  He’s just  stating a possible conclusion based on the  evidence.  You used the phrase  “strikes me as evidence of systematic bias  in his thinking about the Shroud’ s age,” which again is just speculation on your  part.   You never even met the man.  You’re making assumptions about him with  only  your beliefs to back them up.  Rogers was a man of integrity.   When Sue  and I made our hypothesis about the invisible reweave, Rogers  considered us  part of the “lunatic fringe.”  How hard do you think it was  for him to come  out publicly to say he believed we were right?  Very few  scientists would  have done that.  It’s too bad he’s still not here to  defend himself about  the statements being made about him..   At this point, I think I’ve spent quite enough time on this exchange.","date":"February 4, 2014 at 8:00 pm","url":"https://shroudstory.com/2014/01/31/colin-berry-on-rogers-thermochimica-acta-paper/","cat":"news_&_views","title":"Colin Berry on Rogers’ Thermochimica Acta Paper"},{"author":"jmarino240","post":"Just noticed they did have hot links to the press release and also the conference site.","date":"September 3, 2014 at 9:53 pm","url":"https://shroudstory.com/2014/09/03/you-might-think-st-louis-was-all-about-gary-habermas/","cat":"press_coverage","title":"You might think St. Louis was all about Gary Habermas"},{"author":"jmarino240","post":"Stop me if you’ve heard this one–wait–it’s the Internet so you can’t stop   me.  I’ve told this before but it’s worth telling again, if nothing else   for anyone recently new to the blog.  For the 2005 conference in Dallas,   Barrie was interviewed by a local reporter.  McCrone’s name came up in the   conversation.  Barrie made it clear that McCrone was deceased (about 3  years  at that point), but when the story came out the reporter mentioned him  with  the phrase, “…McCrone, who did not attend the conference…”  I  think it  would have made some headlines if he had.","date":"February 16, 2015 at 10:27 pm","url":"https://shroudstory.com/2015/02/16/walter-mccrone-art-experts-should-not-weigh-in/","cat":"uncategorized","title":"Walter McCrone:  Art Experts Should Not Weigh In"},{"author":"jmarino240","post":"Giorgio,  I knew you knew. Did you really sell copies of McCrone’s books at the conference?  Can you tell us how many you sold?","date":"February 17, 2015 at 8:28 am","url":"https://shroudstory.com/2015/02/16/walter-mccrone-art-experts-should-not-weigh-in/","cat":"uncategorized","title":"Walter McCrone:  Art Experts Should Not Weigh In"},{"author":"jmarino240","post":"I might as well retell my other McCrone story that is memorable.  He gave a presentation at the 1986 Elizabethtown, PA conference.  In the question and answer session, I asked him how his putative forger was able to incorporate details that weren’t even discovered for several more hundred years.  His answer:  “I’m not going to answer that.  He just did it.”  He just expected people to take his opinion on faith alone.","date":"February 17, 2015 at 9:44 am","url":"https://shroudstory.com/2015/02/16/walter-mccrone-art-experts-should-not-weigh-in/","cat":"uncategorized","title":"Walter McCrone:  Art Experts Should Not Weigh In"}],"resources":[{"author":"jmarino240","post":"Nickell wrote, “Written by Frank Viviano, the article ‘Why Shroud of Turin’s Secrets Continue to Elude Science’ (2015) is so misleading, so replete with falsehoods, so lacking in basic facts about the notorious ‘shroud’ that it is an affront to the proud name of National Geographic.”Nickell is always fond of putting certain words in quotes for his particular emphasis, but why does the word “shroud” have to be in quotation marks because whether it is the burial cloth of Jesus or not, it really is a “shroud.”","date":"April 25, 2015 at 8:24 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"author":"jmarino240","post":"The book indicates that a sample was taken for Oxford to sample but it   doesn’t list any results so Oxford evidently has not completed the  testing.","date":"February 28, 2015 at 2:58 pm","url":"https://shroudstory.com/2015/02/28/hints-about-shroud-of-turin-episode-in-cnn-series/","cat":"press_coverage","title":"Hints About Shroud of Turin Episode in CNN Series"},{"author":"jmarino240","post":"The quote by Gibson was clearly headed in that direction–they just didn’t   complete the thought.  If they’re entertaining the idea that the Shroud   could be authentic, there must be some explanation why the C-14 dating was   wrong–but they didn’t offer ANY concrete explanation.","date":"March 2, 2015 at 6:31 am","url":"https://shroudstory.com/2015/02/28/hints-about-shroud-of-turin-episode-in-cnn-series/","cat":"press_coverage","title":"Hints About Shroud of Turin Episode in CNN Series"},{"author":"jmarino240","post":"The book does not mention at all C-14 dating of the Sudarium.","date":"March 2, 2015 at 9:40 am","url":"https://shroudstory.com/2015/02/28/hints-about-shroud-of-turin-episode-in-cnn-series/","cat":"press_coverage","title":"Hints About Shroud of Turin Episode in CNN Series"},{"author":"jmarino240","post":"I tried to reproduce Colin’s quote in my posting but it didn’t show.  It’s Colin’s posting from May 9, 2:35, posting # 3 in the thread.","date":"May 9, 2013 at 9:20 pm","url":"https://shroudstory.com/2013/05/08/joe-nickells-new-book-the-science-of-miracles/","cat":"books","title":"Joe Nickell’s New Book: The Science of Miracles"},{"author":"jmarino240","post":"O.K. had mentioned a passage on pg. 191 concerning the blood.  Here it  is:   Numerous red blood cells were discovered on the cloth, attached to the   fabric’s fibers.  Besides this, traces of urea–a constituent element of   perspiration–were found among the many groups of red blood cells.   According to  Lucotte, this points to a rare condition, known as hematidrosis, in  which  one sweats blood. The source of this condition is an extreme level of   stress, which causes the organism to go into histaminic shock.  The  American  anatomic pathologist Dr. Frederick Zugibe, who is familiar with this   phenomenon, claims that it is brought on most often in the face of unavoidable   death.  This is another indicator that the tunic’s owner could have been  Christ.   Indeed, St. Luke (who was also a doctor) wrote in his Gospel that  while  Jesus prayed in the Garden of Gethsemane, he sweat blood.","date":"November 7, 2013 at 6:28 pm","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"author":"jmarino240","post":"Yes, the captions on pg. 193 read:  “Red blood cell on the Tunic of   Argenteuil, magnified 8000 times.  Image taken using a scanning electron   microscope” and “Group of three blood cells found on a urea crystal, magnified   10,000 times”","date":"November 7, 2013 at 7:10 pm","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"author":"jmarino240","post":"Each section has the correct map.  Alexandria is still  misplaced.","date":"November 7, 2013 at 9:18 pm","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"author":"jmarino240","post":"It’s just gotten worse.  I meant to post #98 to the “And then, too, we have two comments from Daveb of Wellington” posting” and posted it here instead.","date":"October 3, 2013 at 9:32 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"jmarino240","post":"David Mo wrote, “Mr. Tite was keeper of the British Museum Research Laboratory. He was perfectly qualified to hold any academic position. His task in Radiocarbon dating of Turin Shroud was just supervision. He did not take any disposition without Holy See’s approval (Card. Ballestrero and advisors). The letter he sends to Card. Ballestrero about the true meaning of the dating (no proof or fake) is an exquisite sample of neutrality. His alleged lack of objectivity is just a presumption without any solid basis.”Harry Gove, never confused for being pro-Shroud, wrote a letter to David Wilson of the British Museum as the dating process was unfolding saying that it was “a shoddy enterprise” (cited in Meacham’s Rape of the Shroud.)","date":"October 7, 2013 at 10:22 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"jmarino240","post":"The dog is on the mend so I’m now to catch up from that and also a weekend trip to Indiana.  This is the 2nd time I’ve tried to post this tonight.  For some reason, the 1st try apparently failedPakeha wrote, “could you explain why Flury-Lemburg’s evaluation of the possibility of reweaving is untenable?” and “Are you saying Flury Lemburg was incompetant to find cotton fibres in the area?And seriously, do you understand the amount of extraneous fibre need to have skewed the dating.Are you claiming Fleury-Lemburg wouldn’t notice there was over 50% cotton in that area?Or is she part of the conspiracy?Flury-Lemburg may be a textile expert and although she says an invisible reweave is impossible, 6 independent sources as cited in posting #37 show there was cotton in the C-14 sample area.  Let’s not forget that Professor Piero Savarino, co-authored a booklet on the Shroud before he was appointed advisor to Cardinal Poletto of Turin. In the 1998 booklet, he stated that the 1988 C-14 testing might have been erroneous due to “extraneous thread left over from ‘invisible mending’ routinely carried out in the past on parts of the cloth in poor repair.” Savarino went on to emphasize: “…if the sample taken had been the subject of ‘invisible mending’ the carbon-dating results would not be reliable. What is more, the site from which the samples actually were taken does not preclude this hypothesis”David Mo wrote, “Who is M. Bourcier de Carbon?”All I know is that he was a French statistician who presented a paper at a 1993 Shroud conference in Rome.  Do any other readers have any details to contribute?Pakeha wrote:  “Sorry to have taken so long in providing links to arguments against the Heller/Adler conclusions.They’re written by hugh farey and I found them to be most interesting.http://forums.randi.org/showthread.php?p=9387545&highlight=Adler+blood#post9387545http://forums.randi.org/showpost.php?p=9394626&postcount=8900http://forums.randi.org/showthread.php?p=9386857&highlight=Adler+blood#post9386857http://forums.randi.org/showpost.php?p=9386813&postcount=8803”Those are all from the Committee for Skeptical Inquiry group, formerly known by CSICOP, which has always been anti-Shroud.  It’s not surprising they contest it.  And it’s not something from a peer-reviewed scientific journal.","date":"October 7, 2013 at 10:26 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"jmarino240","post":"I copied and pasted my posting, which I wrote offline.  It looks like several things you had that I was trying to quote were somehow left out.  When I get time, I will repost those sections.","date":"September 27, 2013 at 6:06 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"jmarino240","post":"Below is the correction of 2 of David’s original quotes and my responses that somehow had turned out wrong when I copied and pasted material.David wrote:<<Mr. Marino’s position about alleged complot in radiocarbon dating, specifically rejected by more serious sindonoligsts as Ian Wilson, Raymond Rogers or John Jackson, don’t surprise me, for I have read fom Mr. Marino some paragraphs as this one:  “The age of the Shroud given by the labs was 663 +/-25 years, which includes 666.”I had forgotten I had written that. The theme of the paper was parallels between biblical history and Shroud history. If I were writing that article today, I would definitely leave that out.David wrote:<<Mr. Tite was keeper of the British Museum Research Laboratory. He was perfectly qualified to hold any academic position. His task in Radiocarbon dating of Turin Shroud was just supervision. He did not take any disposition without Holy See’s approval (Card. Ballestrero and advisors). The letter he sends to Card. Ballestrero about the true meaning of the dating (no proof or fake) is an exquisite sample of neutrality. His alleged lack of objectivity is just a presumption without any solid basis. To blame someone without any proof is a very nasty thing.From: http://www.shroud.com/pdfs/marinelliv.pdfHall wants to ensure the survival of his chair after his retirement and hopes a Sundaynewspaper will pay a large sum for the rights to the story of the Shroud dating. He receivesone hundred thousand pounds from ITV, the independent television, BBC’s rival, and amillion pounds from 45 businessmen and “rich friends”. The chair is to be filled by Tite.Gonella emphasizes: “Since the beginning, this story of dating the Shroud has been vitiated bypublicistic aspects, to which 14C laboratories showed to be even too much sensitive”.The Cardinal’s consultant, exasperated, expresses a heavy judgment: “The custodians of thecathedral of Turin behaved more seriously, kept silent about the sampling of seven centimetersof the sheet, than a group of scientists, who took the liberty of violating the secret and ofannouncing to scandal-seeking tabloids that the Shroud is a medieval fake. In my opinionthere is an anti-Catholic conspiracy of specific milieus”. Which milieus? In a laterinterview, Cardinal Ballestrero will be asked this question: “In this whole affair could theFreemasonry have had a hand? And external pressures?” Cardinal Ballestrero answered: “Ithink it’s indisputable!”Addendum:  In my original email I stated,\"In the June 1989 issue of Catholic Counter Reformation in the XXth century, No. 220, pg. 25, it states, “Quoting the Daily Telegraph for Holy Saturday, 25 March, Brother Bruno revealed that forty five business-men and 'rich friends' (sic) gave Professor Hall, who will reach retiring age next year, 1 million (pounds) for his services and notably for having ‘determined last year that the shroud of Turin was a medieval fake.’ The money was handed over on Good Friday, 24 March.”After I posted that someone sent me an original copy of the Daily Telegraph article.  It turns out the writer and/or editor of the quote from Catholic Counter Reformation in the XXth century twisted some quotes from the Daily Telegraph to be able to come up with the statement they did.  Here is the pertinent passage from the Telegraph article:\"The Oxford archaeological detective who determined last year that the Shroud of Turin was a medieval fake, has raised 1 million pounds to ensure his department remains in existence when he retires next year.  The money had been donated by 45 businessmen and 'rich friends' to create a new Chair of Archaeological Sciences at Oxford, said Prof Edward Hall, 64.\"Clearly CCR connects the 2 parts in a way not conveyed by the original article.  That's a good lesson to check the original source instead of relying on a secondary citation.  I will remember that in the future.  But I still maintain that the timing and circumstances of the donation and the taking over of Hall's position by Tite is extremely suspicious.Now on to David's most recent post:David wrote:<<I think you must revise the entire article you wrote in 1996 because it is full of similar things to that I quoted.I have no plans at the moment to rewrite a 17 year old article.  If Shroud authors rewrote old articles that others thought should be redone, nothing new would ever get written.David wrote:<<You don’t provide us any proof or relevant indication of any conspiracy.I'm not trying to prove anything.  I expressed some questions/suspicions in a blog posting.  I didn't expect everyone to agree with me.  It's not an article for publication or a conference presentation.David wrote:<<A leak of information is not a conspiracy to fake.Agreed, but if the labs are untrustworthy in not keeping the pledge not to divulge, they open themselves up to other suspicions.David wrote:<< Fray Bonnet-Eymard is the basis for Marinelli’s speculations. He is the leader of Counter-Catholic Reformation, a religious-political fundamentalist movement.That's simply not true and Marinelli's statements are more than speculations.  In the passage from the Marinelli article that I had quoted, here are footnotes, and not one of is from Bro. Bruno's group:114 N. SCHOON, Analysing the strands of time, in The Independent, April 25, 1988, p. 17.115 G. SERVADIO, La Sindone ammalia gli inglesi, in La Stampa, August 8, 1988, p. 15.116 A. BERRY, Turin Shroud professor raises £1m for Oxford post, in The Daily Telegraph, March 25, 1989, p. 7.117 L. GONELLA, E ora il mistero si infittisce, in Avvenire, October 14, 1988, p. 6.118 R. PATRUNO, “Un complotto anticattolico contro la sacra Sindone”, in La Repubblica, September 29, 1988,p. 18.119 P. G. CAVIGLIA, La Santa Sindone. Un enigma appassionante, in Il Messaggero del S. Bambino Gesù diPraga 7 (1997), pp. 18-23, on p. 20.Marinelli's article was 30 pages, had 256 footnotes and 50 sources in her references.  She did her homework.Someone else posted today asking why the learned late Fr. Werner Bulst, S.J. was not mentioned.  He believed there was a conspiracy related to the C-14 dating.  And let's not forget the Italian documentary \"Night of the Shroud,\" which addresses the behind the scenes intrigue related to the Shroud.  The documentary even recently won Best Documentary, Best Director, and Best Visual Effects at the Los Angeles Movie Awards.Clearly there is evidence that various people believe and have believed that the 1988 C-14 dating was an extremely questionable affair","date":"September 27, 2013 at 9:57 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"jmarino240","post":"I sent my posting from last night in a Word Doc to Dan last night and it appears he has now made some corrections.  It’s still not 100% perfect:  in my original version, the end of David’s quote ended with “>>” and then there was a line space before my reply.  That didn’t happen in the latter 4 instances.  But I’m not going to repost.since it’s still fairly clear where his comment ended and mine begins.","date":"September 28, 2013 at 10:49 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"jmarino240","post":"I just glanced at the posting and once again my copy and paste did not transfer correctly.  There must be something in the website that’s causing this.  Don’t think I have enough energy tonight to fix.  Will try tomorrow.","date":"September 27, 2013 at 10:00 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"jmarino240","post":"ChrisB wrote:  <>Excellent point.  I still believe the C-14 samples were a reweave because of the strong scientific evidence.  I do also believe there were concurrently suspicious things going on behind the scenes related to the dating.  If certain factions were actually intent on falsifying the dates of the samples, I simply don’t know how they had intended to accomplish this.  I don’t buy into the sample-switching hypothesis put forth by some.  Since the conspiratorial aspect is plagued by unanswered questions and speculations, I put stock in the reweave theory because of the scientific evidence but will continue to probe the Machiavellian backdrop to the dating because that’s still important.  After all, if additional testing is ever done on the Shroud, we want to make sure previous mistakes are not repeated.","date":"September 28, 2013 at 11:06 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"jmarino240","post":"pakeha wrote:  “Flury-Lemburg wasn’t of that opinion re the reweaving question. Could you explain why she’s wrong, please?”Please see the end portion of my reply to David in #37.","date":"September 29, 2013 at 5:36 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"jmarino240","post":"The problem of having the image appear on the Shroud the way it does   despite the normal outcome of imprints being wrapped around a 3 dimensional   object has been addressed by certain scientists, some of whom believe the   image-formation is in the realm of unknown science.  Obviously, the   image-formation process is one of the main questions about the Shroud and one  that will  engender many hypotheses.","date":"September 29, 2013 at 5:43 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"jmarino240","post":"Still having problems with the copying/pasting.  In my last posting (#41), please refer to ChrisB’s original posting #36.","date":"September 28, 2013 at 11:08 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"jmarino240","post":"O.K. says in #54 that Marinelli’s paper is a reprint of her 1990 book.  First of all, her book is over 250 pages and covers other aspects of the Shroud besides C-14.  Her paper is only 35 pages.  Secondly, in her article, she has many footnotes and references to materials published after 1990.","date":"September 29, 2013 at 4:39 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"author":"jmarino240","post":"I can’t speak for Marinelli–I’ve posted a response from her in one   posting–but I don’t disagree that she should have mentioned Kouznetsov’s   credibility issues as part of the background and data.","date":"September 29, 2013 at 5:47 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"}]}
