{"art":[{"author":"john_long","post":"Thanks Hugh – I appreciate your comments and don’t think Dan was being rude. I continue to enjoy his blog each day. The question of the Shroud’s earlier history is a gigantic puzzle, with all of us trying to fit the peices together in the most convincing whole.  I do understand your  “arrival of the uncovered body without the necessity of the sudden discovery of the Shroud” judgement, but when that uncovered body continues to morph into something like the V&A depiction, I can’t help but feel  a recent aquisition of the Shroud had something to do with it. Thanks again – John Long","date":"February 19, 2015 at 2:41 pm","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","title":"Lamentation Art"},{"author":"john_long","post":"Hello Dan,As the author of all four articles “The SOT’s Earlier History …” I am solely responsible for all the main text and picture explanations – not ABR editors or organization leadership. ABR does not have a major interest in the Shroud, being more concerned with archaeology. As an ordinary member of the ABR fellowship I knew many of their readers had at least a passing interest in the SOT; the ABR leadership is open-minded and I am grateful that they provided a means for me to address the Shroud’s pre-15th century history. With many other shroudies around the world I still find Wilson’s basic thesis (tweaked in a couple of areas) the best explanation for its earlier whereabouts. I’ve read Markwardt’s interesting thesis but have not yet studied all its parts in enough detail.Hugh believes that my picture explanation of Schiller’s illustration #595 is unintentionally misleading. “Unintentionally” is certainly correct. I can clearly remember my aim – I wanted to demonstrate the remarkable resemblances  between the Shroud and art like the Victoria & Albert Museum threnos (crossed hands, missing thumbs, semi-nude, diagonal lines and cloth’s long length – shown later in my article), but didn’t want to suggest that all these 11th -12th cen. lamentation depictions had as many similarities, hence choosing #595 to introduce the point. What I should have done was to have picked one of the earlier (pre-944) examples Hugh mentions and then said “within a hundred years … Byzantine art often transitions away from these earlier “burial preparation” representations to ones having striking similarities to SOT images.” But does that illustration (#595) suggest an influence from the SOT? Wilson still thinks so noting on p.182 of his 2010 book that the mummy wrappings from before the 11th cen. gradually gave way to semi-nudes on a prominent, large cloth. He references Weitzmann’s “The Origin of the Threnos” – and as I review that paper Weitzmann does seem frequently to note mummy-type depictions  before the 11th cen.; he uses Schiller’s #595 (his fig. 10, Constance, Rosgarten Museum) as “An innovation of great consequence … is the nakedness of Christ.” To borrow a phrase from Dan Scavone: Why do these often depicted mummy/cloth strip burials before the 11th cen. suddenly have to make room for ones that look more and more like the Shroud images? I have not seen the Shroud Guild’s Facebook page, but I’m amazed at any assertion that I’m making “false quotations” to spread “bad arguments.”  (I’ve probably misunderstood Dan). Of course Schiller did not pose “Why?” – I did.  Nowhere did I credit the picture text to Schiller.  As I view the way pictures and their accompanying text are presented in books and articles, I don’t see why any experienced reader would be confused. (If a scholar like Schiller had discussed the SOT’s possible influence it would be well known in Shroud literature, and inept for any writer to falsify it).  And are the changes (comparing Christ burial art before to that after 944)  really a “bad” argument? I’ll let the readership comb through the art historical books and make up their own minds as to how valid Wilson’s insight was.Thanks for giving me a chance to reply. – John Long","date":"February 17, 2015 at 1:12 pm","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","title":"Lamentation Art"}],"history":[{"author":"john_long","post":"Thank you Dan for taking note of The Shroud of Turin’s Earlier History. It is, of course, not meant to be a major work a la Crispino, Scavone, Wilson, etc. but rather a brief look at the Shroud’s earlier history for interested lay people. I’ve been checking your site for only the last year or so; I’m sure you must have dealt with these issues before. The Associates for Biblical Research are interested in a wide range of topics, and especially in biblical archaeology; they are doing first hand, primary work at what they believe is the O.T. city (actually small frontier fortress for the city-state of Jerusalem) of Ai. Your readers are welcomed to review the many articles found on-line at http://www.biblearchaeology.org/I see Yannick draws a line for “solid evidence” down the middle of the 12th cen., and believes that Wilson and Scavone are not among the “credible, honest, and professional historians” for trying to make some sense out of all the earlier “soft” evidence. Is Yannick sure in his judgement? The Part 1 article dealt with the following factual evidence: the choice of a “true likeness” Jesus face in a pivotal area for the development of Christian art (Edessa and environs) just at the time the Edessa Image was gaining regional fame, an acheiropoietos (not man made) image on a sindon (linen), tetradiplon folding, faint and moist-like, and understandable confusion due to the icon’s seclusion – all with obvious connections to the Shroud and fairly noticed by Wilson and then Scavone. But this was just Part 1; will Yannick be more charitable after Part 2?","date":"March 18, 2013 at 4:34 pm","url":"https://shroudstory.com/2013/03/15/abr-the-shroud-of-turins-earlier-history-part-one-to-edessa/","cat":"history","title":"ABR: The Shroud of Turin’s Earlier History: Part One: To Edessa"},{"author":"john_long","post":"These four articles, “The Earlier History of the Shroud of Turin”, were written primarily for the Associates for Biblical Research readership.  ABR takes the Biblical documents seriously, even to the point of conducting primary archaeology in Israel.  Just as ABR has found much evidence consistent with Biblical Jericho, Ai, etc., I wanted to demonstrate that there are many historical reasons for seriously considering an early date for the Shroud.  I’m sure Yannick Clement is familiar with the evidences linking the Shroud with the Edessa Icon, both: on linen, not painted, much longer than a simple face cloth, faint and sweaty image, the most prominent picture in an area (Syria) playing an important role in the development of Christ-iconography, and while still in Edessa believed by some to be a full body image mysteriously connected to Christ’s Passion; after its arrival in Constantinople blood drops are noticed.  These and other evidences can be spun to other interpretations, but Scavone’s assessment is not pretension but sound judgement: “If one accepts the premise that there are subtle clues – not of any shroud, but precisely of the Shroud of Turin – in the literature surrounding the Edessa image, then the evidence in its favor seems to make good sense and approaches the level of proof.”  (Part 3 perhaps this week, Part 4 maybe by summer).","date":"March 26, 2013 at 1:25 pm","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City"},{"author":"john_long","post":"Louis is probably aware that most serious Christians, scholars and lay alike, have maintained a high opinion of the Biblical documents in the past and have not changed their minds or renounced their faith.  True, there is more skepticism in recent generations (especially since the Enlightenment), but skepticism does not hold a monopoly on a careful consideration of the facts. Readers may want to review a sampling of conservative scholarship in Giving the Sense (2003; eds. Howard & Grisanti), a series of essays which addresses such issues as the Documentary Hypothesis (JEDP) and other OT questions. I notice that the volume can be had at a reasonable price on both e-bay and amazon.","date":"September 9, 2013 at 9:40 pm","url":"https://shroudstory.com/2013/09/09/articles-on-the-shrouds-history/","cat":"history","title":"Articles on the Shroud’s History"},{"author":"john_long","post":"I think that for many of us who take their Biblical Christianity seriously it is amazing how far secular rationalism has claimed a copyright to proper, objective thinking.  When I became a Christian in college (late 1960’s) I had to gradually work out the important questions of Biblical inerrancy, scientific origins, God’s role in human history, etc. I learned that there were plausible arguments to be made on each side. I eventually adopted many of the views Dan criticizes ABR for, but I did so because there were good, objective reasons for doing so (I could be wrong, but my quest was sincere). I suspect that most secularists have not carefully considered some of the better, serious work like found on the ABR website. I also realized how incongruent it was that God could make the universe and rise from the dead, but not keep his narrative accurate. But the final and most important step was to watch how my life changed for the better, and the many answers to prayer that the God who is There made happen. Could this God really have made so many mistakes in his historical narrative? I do respect other points of view, but there is still a good argument to be made for the traditional views ABR advocates.ABR strongly endorses an objective (factual based) view of its interests (archaeology, science, history, Biblical interpretation, etc.). Although the Shroud is not one of their major interests, when one of their members (me) had a serious case to be made concerning its authenticity, they printed it. My four articles are an attempt to explain to the ABR fellowship that the Shroud has a history reaching to antiquity and deserves their consideration. I appreciate that Dan has seen fit to post a link.","date":"September 9, 2013 at 12:49 pm","url":"https://shroudstory.com/2013/09/09/articles-on-the-shrouds-history/","cat":"history","title":"Articles on the Shroud’s History"},{"author":"john_long","post":"As one fellow Christian to another, I have some thoughts to share with Mr. McKinney. Carbon dating is only one of many categories of evidence that can be used to date the Shroud. Scripture, physics and chemistry, and medical analysis are perhaps the most important, with others like historical text, art analysis, textile analysis, debris (pollen, soil, etc) analysis, nonbody imagery and miscellaneous features also contributing. Those researches, and especially physics and chemistry, have made the Shroud the most intensively studied artifact in history with the results published by professionals in the professional literature. If interested Christians cannot reach a firm decision on the Shroud, how can they do so on similar controversies? I doubt Mr. McKinney would agree that just because archaeologists don’t agree if there was an Exodus or Conquest or historians that the Resurrection actually took place, he would conclude “Who are we to believe when the experts cannot agree among themselves?” Mr. McKinney would rightly point to all the positive evidence, some of it developed since modern secular scholarship reached their negative conclusions in the middle 20th cen., as the best insight on these and related matters. He might also point to such Christian organizations as The Associates for Biblical Research as excellent sources for reliable, up to date information and analysis. I do not know what sources upon which Mr. McKinney is relying for his Shroud information, but I can strongly recommend Verdict on the Shroud (dated, but one of the best Christian introductions to the subject), Report on the Shroud (also dated but an excellent source for the basic science), and Resurrection of the Shroud (written by a knowledgeable, hard-headed attorney and packed with up to date facts) – all available and at very affordable prices at Amazon. These and other resources should help Mr. McKinney join an increasing number of interested persons who conclude that although numerous Shroud mysteries do remain (the 1988 C14 dating, the nature and production of the image, question of nonbody imagery, etc.) The Mystery has been solved.","date":"August 1, 2013 at 2:31 pm","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","title":"Bible Archeology: The mystery continues"}]}
