{"events":[{"author":"leon_ward","post":"All this talk about urea, nitrogens, polar molecules, glutamine, etc. – so what’s the point? To the lay person, what does it means?","date":"March 27, 2015 at 7:52 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"}],"misc":[{"author":"leon_ward","post":"Barrie Schwortz nailed it when he said “because the research is biased by huge ideological implications”. Many of the  scientists, those who believe they are smarter than everyone else because they have an affinity for physics, chemistry, biology, are blinded by their own lack of objectivity when it comes to certain subjects such as God, spirituality and faith. They will continue to kick the can down the road with missives like “it’s a fake and we must do more testing” when confronted with challenges to recreate it themselves or to definitively explain how it got there.I can say I am objective on the subject of the Shroud, and when the results of the carbon-dating were published in 1988, I was disappointed, but able to accept it likely dated back to the Middle Ages.However, years later’ I ran into some of Ray Rogers studies and his opinions based on further, independent analysis (Let’s not forget, Rogers was one who believed the Shroud was a Medieval creation as he was heavily involved with the carbon-dating testing).After reading what Rogers had to say, as well as people like Barrie Schwortz, plus the discovery of pollen from plants that grow only in and around Jerusalem, plus the precision of the image, I have objectively determined it’s the burial cloth of Jesus.To me the image does not prove or disprove that there is a God, nor does it prove the resurrection of Jesus, but the evidence is overwhelming that it is Jesus’ burial cloth.And, no, the first the Shroud was mentioned is not the 14th or 15th century. The cloth was mentioned way back to at least the 5th century – “the Cloth of Edessa”.The face is the exact face on the Byzantine painting known as “Christos Pantocratur”. Ray Rogers determined this when he placed the face on the Shroud over 5th century painting and found the two figures are perfect matches except the eyes are closed on the face on the Shroud and it also shows evidence of bruising and injury.","date":"May 15, 2015 at 10:15 am","url":"https://shroudstory.com/2015/05/15/an-american-jew-in-favor-of-authenticity/","cat":"other_sites","title":"An American Jew in Favor of Authenticity"}],"image":[{"author":"leon_ward","post":"Well Mr. Berry! When are you going to create an image using the procedures you claim were used by the “forger”? We’re all waiting with baited breath. I just can’t wait to see your artwork with the same clarity and detail as that of the image on the Shroud.Now stop hypothesizing and go ahead and get it done.","date":"May 9, 2015 at 9:03 am","url":"https://shroudstory.com/2015/05/09/colin-berry-has-it-all-figured-out-sort-of-maybe/","cat":"image_theory","title":"Colin Berry Has It All Figured Out, Sort Of, Maybe"}],"opinion":[{"author":"leon_ward","post":"Mr. Berry: please tell us. How do you suppose the Medieval forger had the presence of mind to secure pollen from plants that only grow in and around Jerusalem?","date":"July 13, 2015 at 7:44 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","title":"Beg Your Pardon (Comment Promoted)"},{"author":"leon_ward","post":"Now don’t forget to hurry on down to Jerusalem and Edessa to gather pollen which is only found in those areas, and place the pollen around the head of the image.","date":"April 18, 2015 at 8:07 am","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"}],"resources":[{"author":"leon_ward","post":"Well, Mr. Nickell, then tell us!- How did the image get on the Shroud? I realize that armies of scientists with all the tools of the nuclear age available to them have not been able to determine how the image got there after years of study, but YOU, sir, seem to know and insist on not telling the rest of the world.Oh, I know, I know. It HAS to be a forgery. Just keep saying “it has to be a forgery” in spite of evidence to the contrary and that takes care of everything.Now since it has to be a forgery, could you please tell us how the Medieval forger had the presence of mind to make sure pollen from plants that only grow in or around Jerusalem to take his forgery to Jerusalem in the 14th century in order to expose it to the environment there so the cloth could gather enough pollen that it shows up centuries later? And how do you think the forger traveled to and from Israel? Did he take Air France, Al Italia, or maybe even El Al?Now stop toying with us. Tell us everything you know.","date":"March 9, 2015 at 7:42 am","url":"https://shroudstory.com/2015/03/09/crocumentaries/","cat":"article","title":"Crocumentaries"},{"author":"leon_ward","post":"Come on, now, Joe. Here you go again. You insist on holding back. How was the image formed? Now, tell us. Don’t keep us i the dark any longer. Put an end to this bickering. Tell us, Joe.And while you’re at it, please let us know how the Medieval forger traveled to  and from the Holy Lands to secure pollen from plants which only grow in and around Jerusalem.Pretty crafty forger, wouldn’t you say? He actually had the presence of mind to foresee that 600 years later we would have the science capable of detecting the find pollen residue on the Shroud, thereby leading to endless discussion of his ingenious forgery.Now come on, Joe. Enough of this! Stop hiding! Tell us once and for all.","date":"April 25, 2015 at 7:04 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"author":"leon_ward","post":"Absolutely incredible that the CNN program did not mention the follow:-Raymond Rogers, an atheist,  and his independent research – now deceased, Rogers was one of the scientists involved in the carbon-dating tests of which the results were published in 1988 saying the Shroud dates back tom the 14th century. At the behest of someone who contacted Rogers and asked him to take another look: Here’s what he found:   -The sample provided for the carbon-dating test was taken from a patch sewn into the cloth in the 14th century following a fire which damaged it.  -A cloth purported to be the Shroud was kept in Jerusalem, Edessa and finally in Constantinople from the time of the death of Christ until it was taken  from Constantinople by Crusaders.  -Christos Pantokratur – a Byzantine painting that goes back to the 5th century. Rogers overlaid the head on the Shroud onto this painting and clearly demonstrates that it’s the same person – exact forehead, nose, chin, hair-line, size, etc. Rogers concludes that the early Christians were familiar wit the Shroud,  although not many had access to it due to the fear that enemies of Christianity would destroy it, and that the face on the Shroud was used as a model for early Christian artists. Just take a look at some of the ancient art depicting Christ. It’s the same face as on the Shroud. I saw it for myself in a church in Greece that goes back 1,500 years.Rogers concluded that the Shroud is the burial cloth of Christ.Another item missed – an Israel scientist found pollen on the Shroud from plants growing only in Jerusalem which pollinate only in the Spring. Christ was crucified in the Spring. There is also pollen from plants found only in Edessa and Constantinople. How, in God’s name, would a forger from 14th century Europe even think about getting pollen from Jerusalem? It’s invisible to the naked eye!There is also residue on the Shroud where the knees made contact containing dust and particles from dirt and stone found only in  Jerusalem.On a final note, getting back to Rogers, he does not know how the image got on the Shroud (and neither does anyone else), but he did add that it would have had to appear within the first 4 or 5 days of death, because at the time liquids would begin to ooze from the body creating an unrecognizable mess, not a clear, concise, detailed image that we have.","date":"March 2, 2015 at 1:11 pm","url":"https://shroudstory.com/2015/03/02/daily-beast-review-of-cnns-shroud-of-turin-episode/","cat":"press_coverage","title":"Daily Beast Review of CNN’s Shroud of Turin Episode"},{"author":"leon_ward","post":"Absolutely incredible that the CNN program did not mention the following:-Raymond Rogers, an atheist,  and his independent research. Now deceased, Rogers was one of the scientists involved in the carbon-dating tests of which the results were published in 1988 saying the Shroud dates back tom the 14th century. Rogers did his own research at the behest of someone who contacted him and asked him to take another look: Here’s what he found:   -The sample provided for the carbon-dating test was taken from a patch sewn into the cloth in the 14th century following a fire which damaged it.  -A cloth purported to be the Shroud was kept in Jerusalem, Edessa and finally in Constantinople from the time of the death of Christ until it was taken  from Constantinople by Crusaders.  -Christos Pantokratur – a Byzantine painting that goes back to the 5th century. Rogers overlaid the head on the Shroud onto this painting and clearly demonstrates that it’s the same person – exact forehead, nose, chin, hair-line, size, etc. Rogers concludes that the early Christians were familiar with the Shroud,  although not many had access to it due to the fear that enemies of Christianity would destroy it, and that the face on the Shroud was used as a model for early Christian artists. Just take a look at some of the ancient art depicting Christ. It’s the same face as on the Shroud. I saw it for myself in a church in Greece that goes back 1,500 years.Rogers concluded that the Shroud is the burial cloth of Christ.Another item missed – an Israel scientist found pollen on the Shroud from plants growing only in Jerusalem which pollinate only in the Spring. Christ was crucified in the Spring. There is also pollen from plants found only in Edessa and Constantinople. How, in God’s name, would a forger from 14th century Europe even think about getting pollen from Jerusalem? It’s invisible to the naked eye!There is also residue on the Shroud where the knees made contact containing dust and particles from dirt and stone found only in  Jerusalem.On a final note, getting back to Rogers, he does not know how the image got on the Shroud (and neither does anyone else), but he did add that it would have had to appear within the first 4 or 5 days of death, because by that  time liquids would begin to ooze from the body creating an unrecognizable mess, not a clear, concise, detailed image that we have.","date":"March 2, 2015 at 1:25 pm","url":"https://shroudstory.com/2015/02/28/hints-about-shroud-of-turin-episode-in-cnn-series/","cat":"press_coverage","title":"Hints About Shroud of Turin Episode in CNN Series"},{"author":"leon_ward","post":"I attended Breault’s presentation in Skokie, IL on March 7. Great job! He covered all the bases. It was very credible.No presentation on the Shroud is complete without a discussion of the evidence debunking the results of the carbon dating tests done in 1988. No less than Ray Rogers, a scientist and leader of one of the teams doing the carbon dating, showed later how the results of the tests were flawed, and,therefore, meaningless, since the tests were done on a patch sewn into the cloth in 1532.","date":"March 9, 2015 at 7:50 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"author":"leon_ward","post":"Thanks, Emmett. I attended one of Russ Breault’s presentations recently. It lasted about 80-90 minutes. He spent about 5 minutes talking about his faith in Jesus and “the message behind the Shroud”. He spent the rest of the time making a compelling case for the authenticity of the Shroud, much of it based on science, science which the skeptics don’t have the courage to even consider, let alone accept. What really gets me is all this stuff the 1988 carbon-dating tests. FOLKS, LISTEN UP. THE CARBON-DATING TESTS IN 1988 HAVE BEEN DEBUNKED BY NO LESS THAN RAY ROGERS, ONE OF THE SCIENTISTS INVOLVED IN THE TESTS. HE WENT BACK, DID HIS OWN HONEST AND EXTENSIVE RESEARCH AND DUMPED ALL OVER THOSE TESTS.","date":"March 10, 2015 at 7:49 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"author":"leon_ward","post":"David:  You and I evidently interpret things differently.","date":"March 10, 2015 at 10:07 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"author":"leon_ward","post":"OK, Mr. skepticisti!","date":"March 10, 2015 at 8:14 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"author":"leon_ward","post":"Please stop mentioning the results of the carbon-dating done in 1988 saying the Shroud is a Medieval forgery unless you are honest enough to mention Raymond Rogers’ (a member of the carbon-dating team) independent research wherein he said, without much doubt, that the results of the carbon-dating are significantly flawed.The problem with the CNN program and most studying the Shroud is that they have their minds made up before venturing into the fray.Also, take a look at Barrie Schwortz’ comments about the authenticity of the Shroud.","date":"March 4, 2015 at 4:45 pm","url":"https://shroudstory.com/2015/03/04/inside-the-popes-bedroom-and-more/","cat":"books","title":"Inside the pope’s bedroom and more"},{"author":"leon_ward","post":"Daveb: Breault is very emphatic about his beliefs that the Shroud is the authentic burial cloth of Christ. Yes, he talks about the message in the Shroud, but he doesn’t back off from the skeptics and doubters including the scientists, and that’s because he has the facts and the science to back himself up. He is not running from a debate. He is participating in it as well as demonstrating his belief in the message of Christ.I am with him on this. I tend to be skeptical myself, but when the evidence in favor of one argument over another hits me square in the face overwhelmingly, then I have no choice (if I’m a reasonable person). I owe it to myself to admit what I might not like to admit.Breault passionately believes the Shroud is authentic, and I do as well. I could care less whom I might offend.","date":"March 9, 2015 at 5:33 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"author":"leon_ward","post":"I didn’t like it and sent an email to CNN expressing my disappointment.To me the program was slanted to make a reasonable person believe that in 1988 science “proved” the Shroud to be a forgery….They did not mention Ray Rogers and his efforts later in which it was shown that the sample used for the carbon-dating tests likely came from a patch sewn into the Shroud in 1532.They did not mention that there is pollen on the Shroud from plants which grow only in and around Jerusalem.And then they conclude with some clown telling us that photography existed in the 14th century without explaining why photography remained dormant until the latter part of the 19th century and, also, why no one else in those intervening 500+ years made a photograph.","date":"March 15, 2015 at 8:07 am","url":"https://shroudstory.com/2015/03/15/did-anyone-like-it/","cat":"television","title":"Did Anyone Like It?"},{"author":"leon_ward","post":"Why do people duck ALL the information that is available about the Shroud? The skeptics seem to lack the objectivity (and courage) to consider things their preordained prejudices won’t allow them to consider.Again, the carbon-dating tests have been debunked by no less than Raymond Rogers, a scientist, atheist and leader of one of the three teams which had done the testing. His conclusion is that the Shroud is the burial cloth of Christ.Then there’s Barrie Schwortz, an American Jew who has studied the Shroud for 35 years. View his presentation on the Internet wherein he talks about how he had abandoned God when he was very young and how he has reached out to God after coming to the coinclusion that the Shroud is authentic.","date":"March 5, 2015 at 8:26 am","url":"https://shroudstory.com/2015/03/05/keeping-an-audience-in-suspense/","cat":"television","title":"Keeping an audience in suspense"}]}
