{"art":[{"author":"leslie_trotter","post":"Here is an interesting story I am going toshare with everyone.  I was on my way toConnecticut to visit friends, when I stoppedoff in an airport bookstore to search for abook to read on my flight. I was interested inreading a book called “Heaven Is For real”about a little boy who had a near deathexperience and went to Heaven and met Jesus.I could not find this book, either the airportbookstore was out or they never had it instock. I ended up not getting anything toread and nap on the way to Connecticutinstead. After my visit to ConnecticutI was a bit upset because I had a bigfight with one of my good friends.I got a flight out of Hartford, CTand had to change planes in Baltimore, MD.I had to wait at least an hour an a halfto change planes in Baltimore, so as I satthere bored and a little down about theargument I had with my friend. I felt asense of relief that I was in a strangecity and knew no one. I was one who neverliked being alone but at this point mymind was at ease, until this woman I’dguess about 60 years old made a beelineover to me.  She told me that God spoke toher heart for her to come over and speak tome. She showed me a before photo of howmuch she used to weigh and I can tell she hadlost a lot of weight because her photo lookedas thought she must have weighed about 400lbsand standing before me I’d guess she weighedabout 150lbs. She looked good and she introducedme to this product called Nuvia3… it was a weightlose supplement/drink. She told me that you drinkone before each meal. She went on to tell me a littlemore info on it and gave me her business cardbecause she sells it. She also pulled out a book,the book that I was looking for called “Heaven Is forReal” She wanted to know if I ever heard of it.I told her I searched for it to read as I traveled.However, I could not find it.  she told me thatI could have it and she also gave me a sample ofthe nuvia3 drink. I was grateful to her and Ireached into my purse and pulled out mypublished book called “In Due Season: We Will Hear God’s Voice” I gaveher a copy and she was thrilled and asked meto autograph it for her. She as well as I knewthat God led her over to me. She called me the nextday and told me she read the book and loved it and that it was ablessing to her, she also told several other peopleabout my book. Not Many know about my book. However, whensomeone does read it they are moved. These Stories like mineand Colton Burpo’s are gifts from God to the world.","date":"October 9, 2011 at 1:27 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
