{"art":[{"author":"lu","post":"Quando eu tinha 18 anos. Eu engravidei de um namorado, e minha mae disse: “voce so continuara morando comigo, se abortar essa crianca!”.Tentei de tudo para que isso nao acontecesse, mas era impossivel, pois minha familia me maltratava. chegando a inclusive me agredir fisicamente por causa da gravidez. Minha mae entao me levou a uma mulher que fazia abortos. e ela ja havia me preparado para o procedimento, quando eu me levantei da cama e disse que nao faria.Chegando em casa, fui agredida fisicamente e verbalmente novamente. Eu pensava que quanto mais tempo eu permanecesse gravida, mais facil seria para que ela desistisse da ideia, ja que eu correria risco de vida, se abortasse com mais meses de gravidez. No entanto nada a fazia mudar de ideia.  Para minha surpresa, ja tinha 4 meses de gravidez, quando ela voltou a me levar a um medico que fazia aborto. Esse medico nos falou, que nao praticava abortos com mais de 4 meses de gestacao, e que nesse caso eu precisaria de uma micro cesariana. e isso so poderia ser feito nas cidades maiores.Minha mae levou-me entao para uma grande cidade. Foram horas e horas de viagem.Meu coracao estava conturbado. Eu nao queria de maneira alguma fazer o aborto, mas estava fraca, muito fraca. Nao tinha ninguem para me ajudar. Sequer o pai da crianca, que havia sido transferido para outra cidade a trabalho, e nao tinha mais contato com ele.Minha irma , junto a minha mae, praticavam atrocidades comigo, com a intencao que eu abortasse. Me batiam, me xingavam, e me proibiam de comer.Eu nao tinha saida, e nem forcas. Chegando na capital, nos hospedamos, e minha mae foi a clinica que nos enviaram, conversar sobre o procedimento. La ela pagou a metade do servico, e a outra metade seria paga no dia seguinte, dia em que faria o aborto.A clinica era muito longe de onde nos hospedamos, por isso teriamos que acordar muito cedo. Pela madrugada. e as 7 da manha ja teriamos que estar la. Naquela noite entao, eu nao dormi. Deitada em minha cama, apenas chorava, com o espirito muito conturbado. Eu chorava e chorava, e quando fechei meus olhos para enxugar as lagrimas e os abri novamente, vi um homem em pe perto de minha cama. Era um homem alto, que vestia branco, na cintura um grande cinturao preto, e a sua voz tinha extrema autoridade.Em nenhum momento ele me “pediu”. Ele mandava. e jamais esquecerei-me de suas palavras. Ao levantar os meus olhos, ele levantou o seu braco  esquerdo, apontou o dedo em minha direcao e ordenou: ” VOCE NAO VAI FAZER ISSO!ESSA CRIANCA NAO TE PERTENCE! PERTENCE A MIM!  FUI EU QUEM ENVIEI ESSA CRIANCA NA TERRA! E EU PRECISO DELA AQUI!”. Junto a essa visao, me veio tambem uma forca excomunal. Um poder de decisao que ate entao eu nao tinha.Junto a visao, senti um poder de ir e vir, ciente que Deus estava comigo.Entao, era por volta de 5 da manha. Quando logo ja iriamos partir em direcao a clinica. quando me levantei dizendo com firmeza na voz: ” Mae, levante-se, nos vamos voltar para casa!”.Minha mae, reagiu. xingou, contestou, mas eu estava firme.Eu sabia que nada iria fazer eu mudar de ideia. e ela percebeu isso.Reclamando muito, ela me seguia, porque decidamente eu estava voltando para casa e nada me faria mudar de ideia. O Espirito Santo tomou conta de mim naquela decisao de maneira tao grande, que uma muralha nao impediria que eu voltasse atras. Voltamos para nossa cidade, e la fui tocada de casa. Passei a dormir dos 4 aos 9 meses de gravidez, na casa de ferramentas do quintal. NO chao, mas eu sabia que Deus estava comigo. Nao podia entrar dentro da casa para comer. e se o fizesse era espancada. Tenho uma cicatriz grande em minha testa, porque com fome, aos 7 meses de gravidez, entrei na casa para pedir comida. Minha irma quebrou um prato de vidro em meu rosto, a mando de minha mae.Precisei de 13 pontos para fechar o ferimento.Na volta do hospital, voltei para casa de ferramentas.Me alimentava das plantas que tinha por la. ate mato comi.Passava a noite acordada, com medo da escuridao. dos ratos, das aranhas e largatixas.Tinha apenas um lencol para me deitar. Nao havia travesseiros, ou um colchao sequer…mas eu sabia que Deus estava comigo. Ele havia me dito isso pessoalmente.Quando senti as dores de parto. nao havia ninguem para me ajudar.No hospital nao recebi nenhuma visita de minha familia, e quando recebi alta nao havia ninguem me esperando.Recebi alta as 7 da manha, e 11 horas da noite, ninguem havia ido me buscar. Ja nao tinha leito para mim. O leito em que eu estava foi ocupado por outra mae. e eu aguardei por longas horas, com meu filho no colo, sentada num banco no corredor do hospital.11 horas da noite, um vizinho foi me buscar. Ao chegar a casa de minha mae, verifiquei que todos haviam viajado. a casa estava trancada. a energia desligada, e nao haviam trancado a agua, mas eu so tinha ali para ficar.Consegui abrir a porta, e la eu fiquei no escuro, e com fome…muita fome… Meu filho foi crescendo e crescendo. Consegui, com o tempo e depois de muito choro, conquistar minha independencia.Meu filho hoje, tem 25 anos de idade. E e a pessoa com a alma mais pura que conheco. Um excelente filho, honesto, estudioso e trabalhador. alem de que e o meu maior e melhor amigo terreno. Minha mae, que ja tem 80 anos, a muitos anos mora conosco, em minha casa. E justamente esse filho, quem cuida dela, quem compra seus remedios, suas bengalas. e  faz todos os seus gostos.","date":"February 20, 2012 at 3:53 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"lu","post":"Oh, I forgot. this is portuguese. I can read inglish, but i don’t right very well.sorry","date":"February 20, 2012 at 3:55 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
