{"image":[{"author":"martin_lack","post":"Wow, you guys are swift to judgement!  I agree that Donald’s ideas are a bit crazy and, after repeated appeals from me, he says he is now watching the programme.Although I am grateful for the free publicity, I would like to hope that, before leaping to conclusions about me, people will actually read the History page of my blog and follow the link to my old Falsifiable Theology page on Blogger.  However, if you can’t be bothered to do that (because you prefer to leap to conclusions about people) then, for the record, I am no religious nutcase:  My position is one of a reformed sceptic.","date":"December 4, 2011 at 8:37 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor"},{"author":"martin_lack","post":"No need to apologise to me.  My complaints were a little tongue-in-cheek anyway.  I was merely seeking to defend Donald in order to give him time to apologise for being so silly (which he has now done) :-)","date":"December 4, 2011 at 4:49 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor"},{"author":"martin_lack","post":"You do not need to apologise to me, or take pity on me, but, thanks all the same.","date":"December 4, 2011 at 4:47 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor"},{"author":"martin_lack","post":"In all that ranting and raving, Donald, you have merely demonstrated that you are equally capable of slinging insults and talking out of your bottom.  Scientists have studied the shroud in extra-ordinary detail for decades now and, the most incredible thing is that they can tell you what the image is not, but they cannot tell you what it actually is…  I therefore think the shroud – unlike any number of little pieces of wood claimed to be from the Cross and secreted away in Roman Catholic churches all over Europe – is a truly remarkable artifact; and I am more than happy to be respectful of anyone who considers it to be the “smoking gun” of the Resurrection because the one thing it clearly is not is a medieval fake or a painting by Leonardo da Vinci.","date":"December 5, 2011 at 6:35 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor"},{"author":"martin_lack","post":"I thought you said you are an Engineer?  What hair colour is that (or are you “a baldy“)? :-)","date":"December 5, 2011 at 7:36 am","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor"}]}
