{"art":[{"author":"matt","post":"I was interested to come across this depiction of Christ’s entombment in a stained glass window at Chartres Cathedral. Note the shroud-like image, right hand crossed over left. Not nude because it would have been offensive. Note the red burial platform / slab.http://www.sacred-destinations.com/france/chartres-cathedral-stained-glass-photos/slides/w03_8377c-entombment","date":"June 10, 2012 at 8:49 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"ColinThere is a wide variety of representations of Jesus’s entombment. The majority of representations that show a sarcophagus show one WITHOUT a lid. And then there are the representations that simply show Jesus laid on a slab of stone. There is no biblical case for a sarcophagus, only references to him being entombed in a sepulchre.It is well documented that a red stone slab made from porphyry was transported from Ephesus to Constantinople in the 12th century. The stone was highly venerated as that which Jesus’s body was laid upon.Given this, and given the likelihood that the shroud was in Constantinople, I differ from others and interpret the lower object with red crosses as being representative  of the red stone. The object above it is then undoubtedly (refer: 4 holes in L shaped patter mirroring the shroud – sorry Colin minimal chance this is just a random decorative element  – two red streaks likely representing blood – herringbone weave type pattern – crosses under the head napkin and beyond it on the shroud near the angel’s foot representing where Christ’s body and image was imprinted into these objects)Colin, you can continue to rationalise this matter, but the cumulative evidence strongly suggests that the images are a representation of the shroud, therefore rubbbishing the carbon tests.","date":"June 10, 2012 at 8:27 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"“A telling-tale couple of bloodstains”Exactly, as I have pointed out. I am yet to hear any sort of convincing rebuttal as to what these red streaks may be. Probably because there isn’t a convincing rebuttal.Oh let’s see, just a random decorative element like the singular, asymmetrical L shaped 4 holes!!!!!!!","date":"June 10, 2012 at 8:37 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"and the work dates from circa 1150 AD","date":"June 10, 2012 at 8:51 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"“Since when have platforms or slabs been so highly ornate?”Again you are really missing the point – do you not understand what “symbolism” means?the bottom object represents the red stone of unction, the crosses are not a literal depiction, rather symbolic depicting the fact that Christ was laid on that slab.Notwithsatnding this, there ARE depictions of an ornate stone of unction, such as that you will see in the stained glass window at Chartres (dated 1150AD), which I posted a link to above","date":"June 11, 2012 at 4:26 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"historical art depictions of Jesus’s entombment often show a “sarcophagus” without a lid. In fact, what is considered to be a “sarcophagus” may not actually be a sarcophagus. It could actually be the walls of the stone of unction. Search under images in Google and you will see the stone of unction now in Jerusalem. The stone actually has walls, which project slightly above the level of the stone. Obviously some art of the entombment has shallow walls and some deep walls. The various depictions might represent a mix of objects, ie. stone of unction or sarcophagus","date":"June 11, 2012 at 4:47 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"Colin.I’m still waiting for an explanation from you as to the meaning of the two red streaks. You had earlier said you didn’t have time to offer an explanation. That seems very convenient for you. After all, you seem to spend plenty of time here countering other arguments. Until I hear an explanation, I will assume you don’t have a better one than that the streaks represent the blood of Christ on the shroud","date":"June 11, 2012 at 4:29 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"I stongly diagree that it is an irrelevance. It is highly relevant to study of the shroud, because its likely integrity discredits the carbon dating that so many skeptics rely on.The fact remains that there are a number of compelling facts that strongly point to the likelihood that the images depict the shroud:– the rarity of nude depictions of Christ, which in itself is not necessarily so compelling but when combined with:– the herringbone weave like pattern– The presence of one motif on the shroud, which happens to comprise 4 holes in an L Shape, the likelihood that the artist chose this as a decorative feature is very small given the motif’s lack of symmetry– a cloth sitting on the shroud, likely representing the head napkin– the shroud in its central portion having crosses on it, likely representing the shroud image of Christ– the red streaks representing the blood on the shroud (again the likelihood that the artist just decided to whack on two red streaks for no reason is small)","date":"June 11, 2012 at 5:41 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"yes they seem to Max. It’s totally fanciful. They compare the 4 holes to the circles forming decorative mofifs in other images, seemingly oblivious to the fact that the use of circles in other images is always in repeated patterns which are symmetrical","date":"June 11, 2012 at 5:54 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"There are in fact 2 streaks of blood beneath the angel’s feet. And the face of jesus sits behind Mary’s right arm, rising up from the shroud, connecting to it through the alpha letter. The 4 holes are definitely the poker holes of the shroud, the L shaped alignment is assymetrical – if the circles were meant to be decorative then they would have been arranged symmetrically","date":"June 3, 2012 at 7:34 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"ColinMan, you really, obsessively over-rationalise!!!! Nothing wrong with rational thought, but….You just can’t be that rational with a piece of art that holds as much symbolic representation as literal representation, it is such a one-dimensional world view. Having said that there is plenty of rational reasoning to lead one to the conclusion that the image does represent the shroud. Yes, circles are frequently used as decorative elements in the images, but they are always in symmetrical, repeated patterns. Looking at it rationally, it simply makes no sense to me that the artist would have departed from the norm to paint a “L shaped” “pattern” which has no decorative value whatsoever! Surely, if it was meant to be decorative it would have been in a symmetrical shape, such as a cross, etc. I really find your letter rationalising rather absurd. Also you have questioned why the artist would represent the poker holes at the expense of other features. I can’t answer that, only the artist knows, and remember this is a symbolic artwork not a literal representation, but anyone who looks at the shroud can see how strong a feature the poker holes are, and who knows maybe in the past they were interpreted in some spiritual manner. A latter representation of the shroud (I think from the 15th century) explicitly copied the poker holes.Also – and this is just my interpretation – the head of Jesus behind Mary’s right arm, I believe, is meant to represent the face of Christ on the Shroud, the alpha letter connects the head of Christ to the shroud. Another subjective interpretation, the head has a remarkably composed and serene feel, like the shroud.Also, there are red lines on the object – now they could be interpreted in different ways, of course, but I interpret them as representing the streaks of blood on the shroud, perhaps the two main streaks on the arms. Otherwise, what might they be? I am open to any alternative “rational” explanations, but at this stage I personally can’t think of any. If they indeed represent blood, why would there be streaks of blood on a tomb lid?Or did the artist just happen to randomly draw two red lines for some artistic effect (I think not)","date":"June 4, 2012 at 7:21 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"respectfully, that is rubbish. There is plenty of symbolic , non-literal material on the shroud. How about the alpha letter floating above the shroud, connnecting to the head figure of Christ? How about the crosses over the mid portion of the shroud, representing Christ’s contact with the shroud and the head cloth? How about the fact that Christ’s body, being taken from the cross, and then laid out on the shroud, is free of blood marks (this is clearly symbolic,or at least based on social / spiritual mores). Where I agree with you is that the artist is not a particularly skilled one. That doesn’t matter. In fact that explains things like the fact he painted crosses over the shroud, near the angel’s feet, to represent Christ’s image on the shroud.You haven’t addressed my points on the crosses, nor on the two red streaks. I think these are very valid, previously unmentioned points. I don’t think they are easy to dismiss, but I’d like to see you try….","date":"June 4, 2012 at 6:44 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"also there are cross motifs near the angel’s feet and the two red streaks, which carry through under the head cloth, and depart from the herringbone pattern on the balance of the shroud. Again, my interpretation is that the crosses symbolically represent Christ’s image on the shroud. They also cross under the head cloth, again representing Christ’s physical contact with that object","date":"June 4, 2012 at 7:39 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"Ron – exactly. I agree that his explanation of the resurreciotn is dubious, but when it comes to his art historian credentials they are strong. Until another highly qualified art historian provides an alternative viewpoint, that is all we’ve got","date":"June 11, 2012 at 5:43 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"I note Colin has still not addressed my points re: the crosses in the middle portion of the shroud, which I have stated symbolically denote the image of Christ on the Shroud, nor the two red streaks near this area (which I interpret as blood streaks).Presumably he thinks these are just random artistic emphasisBaloney!!!!","date":"June 5, 2012 at 11:29 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"Well, you floated around my interpretations very nimbly, Colin.At least you are admitting the limitations of science.Yes, we will never truly know what the artist intended, but why can’t we try? That’s what artistic interpretation is, whether it is interpretation of film, painting, music etc. I’m really curious as to why you keep ignoring my comment about the two red streaks on the shroud next to the cross motifs, I can only assume one of two reasons:1. For some reason you think my interpretation is ludicrous and not worthy of comment – if so I’d like to know why it’s ludicrous and what the two red streaks, otherwise not seen in the art, might mean2. It is a compelling point and you are ignoring it because it is an inconvenient observation for your perspectiveAt this point I believe the presence of two red streaks (representing blood), next to the crosses on the herringbone weave shroud (the crosses symbolically representing the image of Jesus on the Shroud), next to the L shaped holes are COLLECTIVELY compelling reasons pointing to the image being a representation of the shroud, and therefore discrediting the carbon dating.","date":"June 6, 2012 at 3:56 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"Colin said:A zig zag pattern (“herring bone weave”) and four tiny circles (“L-shaped poker holes”) are simply not sufficient grounds for rejecting the most likely interpretation – a sarcophagus lid – and substituting something radically different.You can add to the two grounds of the herringbone weave, and the L shaped holes, the two red streaks likely representing blood (why would there be blood on a lid?), and the cross motifs on the central part of the shroud, as well as the image of Jesus’ serene face behind Mary’s right arm, connected to the shroud via the “floating” intermediary “alpha” letter","date":"June 6, 2012 at 4:02 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"Question – does anyone know if the words in the manuscript relate in any meaningful and direct way with the images?","date":"June 6, 2012 at 4:08 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"ColinA big “so what” re: the google search. They are hardly authoritative expert views, just opinions. Just as my view is an opinion. You can take or leave those opinions – as I do leave them  – and people can take or leave my opinion – as you leave mine.I remain convinced in my opinion. I’ve heard the counter – such as your suggestion that the L shaped circles are just a random decorative element – and I disagree with them  (I think it is totally illogical that an artist would draw an asymmetrical one- off motif when his use of circles in all other motifs in the images are symmetrical and repeated, not to mention the red blood streaks, the cross motifs etc)BTW, I was previously doubting on the Pray Manuscript representing the Shroud. I disagreed with Stephen  Jones on several of his interpretations and continue to do so. However there are several KEY features which convince me the images in the manuscript do represent the shroud. The concentraiton of these 4-5 factors around the feet of the angel through the alpha letter to Christ’s head convince me. Had there just been one or two factors then I might not have been convinced (and  I was NOT convinced until I saw the red streaks, the cross motifs in the centre of the object, and Christ’s head)","date":"June 6, 2012 at 8:31 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"ColinI am afraid you are as blinded and biased as the Shroud extremists ( I note here that I am still agnostic on the shroud’s authenticity, although steer towards the pro-authenticity view).I’ve said repeatedly that the use of the circles on the “shroud” has a number of key differences from use of circles in other images. Namely, it is a once used motif, unlike the other applications where they are repeated motifs characteristic of a decorative pattern AND it is assymetrical unlike the use of circles in the other applications.You appear to gloss over these FACTSYou continue to apply a highly rigid scientific approach to artistic interpretation, which is totally inappropriate. Fine if you are studying cells under a microscope, not fine if you are trying to unravel meaning in a medieval work of art.Yes my interpretation of the red streaks is that they are blood. What’s wrong with that? What else could they be? Until I hear a more convincing explanation I will maintain that view","date":"June 6, 2012 at 7:43 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"ColinYou said:“I personally doubt they represent blood, but shan’t go into reasons right now”Why not? Why do you doubt they represent blood? Convince me!mmm, let’s see, the artists just decided to randomly paint two red lines, next to a pattern of crosses  located centrally on an object otherwise having a herringbone-like pattern, next to a cloth that looks like Jesus’s head napkin sitting on the object (refer John, Jesus’ cloths (Shroud) and head cloth were left behind) , which is next to 4 circles in a L shaped pattern, which bears no resemblance to the symmetrical repeated circle motifs in other images","date":"June 6, 2012 at 7:59 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"yawn, I’m leaving it there. Your world view is seriously distorted with a bizarre obsession with scientific extremism. There’s no point in any further debate!","date":"June 7, 2012 at 2:36 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"ColinIf you go to Stephen’s wesbite he now has an extract from the book “The Sign”. The author makes the same observation as me (independently) that the circles make no sense from a decorative perspective. Note the artist is an art historian EXPERT.","date":"June 6, 2012 at 9:37 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"sorry I rushed the email, it should read “note the author is an art historian EXPERT”","date":"June 6, 2012 at 9:39 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"author":"matt","post":"Good try Colin, but not good enough. What you perceive as the Shroud (and others like myself perceive as the face cloth) has a clearly defined thicker edge that finishes well to the right of the two red streaks (blood stains) and the crosses.But good to see you now acknowledge the red streaks represent blood, which are not on the face cloth (your “Shroud”) but are clearly on the herringbone weave- like shroud.Makes no sense whatsoever that a sarcophagus lid would have streaks of blood on it.Just as it makes no sense to me (unlike you) as to why an artist would happen to randomly paint 4 small circles in an assymetrical L shape mirroring the prominent poker holes on the real shroud (remembering that in reality the image is faint and the poker holes are a prominent feature, possibly one of mystery back in time)I am going to test your claim“I suspect that most folk looking at my picture with the non-essential detail blanked out will accept my interpretation.” on my 15 year old, 150 IQ son tonight, doing my very best not to influence his opinion (he is sufficiently confident and outspoken that he will state his view rigorously regardless of any influence)  MattPhD (History)","date":"June 14, 2012 at 3:24 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"matt","post":"The author of the book “The Sign” is a reputable art historian and he claims that the codex was influenced by the Shroud. Until you, or Colin or any other skeptic can present an art historian of equal or better standing than him arguing based on comprehensive analysis that the codex is unlikely to have been influenced by the Shroud, then you are on the losing side of the argument in terms of art history.","date":"June 18, 2012 at 7:17 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"matt","post":"Just another thought upon perusing the image again, I’m sure people have touched on this before…In the upper image of the nude Christ, neither of his hands have thumbs. This is logical for his right hand, given the perspective, but not so logical for the left hand. It would have been logical for the thumb to be displayed for the left hand, given the perspective. The fact that it isn’t provides further strength to the case that the image is based on the real shroud.","date":"June 14, 2012 at 3:42 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"matt","post":"ColinNow you are simply being nasty and childish.If you go to Stephen’s site, you will see I have admitted I was wrong. Unlike some people, I am genuinely interested in exploring interpretations and different points of view. I found something, I put forward a theory, I searched further and tested – and found my theory wrong. I’m man enough to admit it.I note that you proudly state that you picked that it was St Alexius tending to a sick girl – well the last laugh is on you because upon my further research I found the legend that clarifies that the “little girl” is actually St Alexius, and it is the Pope visiting him. So before you go pointing your finger and going “ha ha you were wrong” maybe you need to consider your own human fallibility as well.And now I’ve heard it all about the 4 L shaped holes. Testing the  ink? Please, that’s just really desperate!!!!! The fact is the cumulative evidence is overwhelming in support of the codex image being influenced by the Shroud. Please explain the blood as represented by the red streaks, when no shroud in an entombment scene in art showed blood, within hundreds of years of this image (I’ve seen the odd image dating much later that shows blood on a shroud, probably because as Christianity evolved Christ’s humanity and suffering came to be emphasised more) .","date":"June 20, 2012 at 8:52 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"matt","post":"ColinTo be fair you didn’t say MIGHT, you said “probably” (10.32) and also indicated a fairly strong belief in the notion of red streaks as blood at comment at 12.51.You said:“But when I came to take a close look at the red zig zags, I noticed they were wavy in profile.“What’s more, they matched a similar wavy profile, i.e. with rounded crests, on the adjacent black pattern. But elsewhere the black pattern was strictly stepped, with sharp right angles”Simply not true. The black lines are only SLIGHTLY off the right angle next to the red streaks, and if you go further over to the right in the vicinity of the L shaped circles you will see further evidence of black lines that are slightly curved / off the right angle","date":"June 21, 2012 at 4:38 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"matt","post":"“I do not understand why anyone would want to copy it without making it very clear, from the size of the cloth and the double image, what they were wanting to show their audience.I have seen no good reason why this has to be a secret or symbolic picture of the Shroud.”Unlike Church Frescoes or paintings, the image is not intended for “public consumption”. The manuscript was likely used as a resource by monks / clerics. Therefore there was no driver to explicitly show an image of the shroud. This may also explain why Jesus is shown nude, without the usual skimpy cloth around his waist and pubic area – there was no need to protect Jesus’s modesty in a highly public setting.Given Hungary’s close connections with Constantinople at the time, it is likely that the Shroud and its characteristics were quite well known amongst holy men in Hungary, therefore there would be little need to represent it literally. But as anyone who has viewed the Shroud with the naked eye will testify to, two of the most apparent features to the naked eye are the red streaks of blood on each of the arms, and the two sets of 4 poker holes in an L shape. These were simple enough to illustrate fairly literally by the rather unsilled artist working on a miniature work as we see in the codex illustration. By contrast, imagine the difficulty for the unskilled artist working in a miniature medium trying to represent a light, ghostly image of Jesus – difficult. This is why the artist has taken the “shortcut” of representing the body image in a more symobolic manner by way of the cross motifs in the middle of the shroud, just adjacent to the angel’s foot.             It should be kept in mind that the main purpose of the illustrations is unrelated to the shroud. The illustrations merely illustrate the story of Jesus’s death, descent from the cross, burial and resurrection. The knowledge of the Shroud and its characteristics has merely informed the art. Probably just as the presence of the venerated red stone “stone of unction” at the time in Constantinople has informed the red colouring of the burial stone at the bottom of the image. If the stone in Constantinople had been yellow, then we probaly would see yellow crosses on the burial stone at the bottom of the picture. The knowledge of the sacred relics has merely informed the art – it’s as simple as that. There is not an agenda to mysteriously and symbolically reveal the Shroud.       This is simply my interpretation, any how.","date":"June 21, 2012 at 4:12 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"matt","post":"Further to my point at 3:24 am, if the crosses were only connected to what Colin calls the shroud (and I call the face cloth) then the crosses should have gone further to the right across the raised cloth. They don’t and the image clearly depicts a face cloth lying over the shroud, with the crosses underneath and to the left of the face coth representing Christ’s image on the shroud UNDERNEATH the face cloth","date":"June 14, 2012 at 3:48 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"matt","post":"ColinIf it is an ingenious invention created by human hands, why with all the modern knowledge and technology we now possess no one has been able to convincingly explain how the image was created, and REPLICATE the image with ALL its unique characteristics? If you, or someone else, can convincingly explain and replicate the image with all its characteristics, then I might be open to changing my view on the shroudUntil then…","date":"June 21, 2012 at 4:18 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"matt","post":"ColinI fail to see why it isn’t a fair test, given today’s technology and knowledge?the flourescence is a key one…if you could prove that then I’d be one step closer to contemplating that the shroud MIGHT be a human invention (despite what you might think I’m actually pretty much agnostic on the shroud’s creation – albeit leaning slightly more towards a divine explanation)","date":"June 21, 2012 at 5:07 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"matt","post":"ColinSurely can’t be too hard to find a skeptical practising scientist to test that, or for you to access the necessary equipment?","date":"June 21, 2012 at 5:10 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"matt","post":"I agree with much but not everything Stephen says. Personally I think the feminine figure on the right is holding part of the larger shroud with her left hand, but I think the other elements that he has coloured in green are simply parts of the clothing that the characters are wearing","date":"June 21, 2012 at 5:00 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"matt","post":"actually the hand position of the character on the left indicates he might be holding part of a larger shroud too","date":"June 21, 2012 at 5:03 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"matt","post":"ColinIt is pefectly clear where the face cloth ends, in my opinion – it is just a little to the right of the red streaks, with some double thickness, dimpled type lines. There are clearly crosses between this edge of the face cloth and the red streaks. The crosses clearly depict Christ’s image on the shroud, which the face cloth sits on top of.Well, that’s my strong opinion, anyway.you are perfectly entitled to your view!","date":"June 14, 2012 at 4:33 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"matt","post":"ok, results in. My son traced the outline of the cloth and it agreed with my opinion independently.But….to be fair my wife independently came to your conclusion Colin","date":"June 14, 2012 at 5:40 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"matt","post":"I’ve asked 5 people today to trace the outline of the face cloth, and all have come to the same conclusion I did. They clearly see the edge of the cloth as I have, and consider the cloth is transparent, hence why you can see a couple of the crosses through the cloth.","date":"June 15, 2012 at 3:15 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"matt","post":"ha ha ha. Just thought I’d add in my PhD since you did for yourself the other day, just to make it clear that contrary to what “some” people may think, it is not just nutty simpletons who believe the manuscript images were based on the shroud. BTW, in my Catholic prayer group 3 out of 8 members are current doctoral students in SCIENCE. So  much for science and Christianity being incompatible! “Who says there is blood on the sarcophagus lid? I certainly don’t. My interpretation is that it is just peeping through on the wavy end of the shroud having tracked down the inside surface that is out of view”Now that is a good one!!!!","date":"June 14, 2012 at 4:27 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"matt","post":"good point Yannick. It is the collective evidence that is compelling, rather than one or two discrete factors","date":"June 14, 2012 at 4:21 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"matt","post":"I think it is significant that Colin has finally admitted that the two red streaks represent blood on the shroud. I am happy to be corrected but as far as I can recall there are no images of this period that show the shroud in an entombment scene, with blood stains / marks. This uniqueness presents a further argument for the pray manuscript images having been influenced by the shroud.","date":"June 14, 2012 at 8:56 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"matt","post":"ColinHow about you ask a few people for their opinion? Without bias. Just say “look, do you see that cloth looking object sitting on the object with the pyramid like pattern? Can you trace with your finger what you think the outline of the cloth is”I have nothin to “admit”. The cumulative evidence points strongly in favour of the view that the images in the manuscript has been influenced by the shroud.I’m not going to repeat each item of evidence again, it’s been done to death.And again you make the “fundamentalist scientist” error of trying to interpret everything literally, in terms of questioning why the head napkin should be transparent.In your world view, we need to rationalise the great symphonies, the great art, the geat poetry. There is no room for artisitc licence, symnolism, metaphor. What a sad, souless, artless and one dimensional world view.","date":"June 15, 2012 at 6:02 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"matt","post":"I’ve just come to this comment of Colin’s and again have to disagree and feel the need to explain this: “There are no compelling biblical grounds for the illustrator needing to include a napkin in his picture, but every reason to show a burial shroud, which is what that heap of discarded cloth represents”Why are there “no compelling biblical grounds” Colin? The linen cloths and the head napkin are both mentioned in John. Neither are mentioned in Mark, which nonetheless provides a strong basis for the picture. The artist has created a scene that is a composite of the story of different gospels. Both gospels of John and Mark were the most highly revered gospels at that time. Creating a composite picture is in fact highly logical when one thinks that the Christian worldview is a composite of accounts that are in spirit the same, but have differences here and there.","date":"June 20, 2012 at 6:25 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"matt","post":"ColinI never claimed the image was a great piece of art. In fact I have stated that it is a relatively poor illlustration. But it is still ART, in that it is a representation of something, with symbolic and metaphorical context.Anyway, any further debate is futile because our positions are deeply entrenched and not at all reconcilable. But thanks for the chat, I’ve learnt something and in fact become more convinced of my position.","date":"June 15, 2012 at 8:34 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"matt","post":"I went to the University today which has a large selection of books on art history, including byzantine art.I couldn’t find this epitaphios, but I found a similar one ( similar pose, marks over the body, weaved shroud) that was dated in a reputable source at 1200AD.Where did you find the image Colin?Would be great if we can find some answers on this!","date":"July 22, 2012 at 3:44 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)"},{"author":"matt","post":"DanThat date is interesting. The epitaphios from 1200 (Venice) is very similar style, including markings and blood all across the body, and the herringbone weave. Either G. schiller is wrong (I think unlikely) or the info you have posted is wrong. Of course they might be 100-200 years apart, but that seems unlikely given their striking similaritiesI’ll try and get into the uni and so a colour photocopy and scan of the 1200 AD Venice one.","date":"July 23, 2012 at 6:41 pm","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)"},{"author":"matt","post":"DanDid you not have any luck tracking down a better resolution image, also can you please provide the source for this image???Personally, I find so much of the science still inconclusive or questionable , I think the better clues lie in art history / history.I’m going to try and get the image from 1200 AD","date":"August 3, 2012 at 8:01 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)"},{"author":"matt","post":"Good comment Yannick. It seems unlikely that epitaphios artists would have just coincidentaly decided to use a herringbone weave pattern. I think it is highly likely that they did so having viewed the Shroud, or at least heard of the Shroud’s herringbone weave. The only other realistic possibility I can think of is that maybe linen cloths at the time the epitaphios were created in the 1200s / 1300s had herringbone weave? Can anyone confirm or deny this?As I said above, I viewed an epitaphios dated circa 1200 AD in G. Schiller’s authoritative Iconography of Art volume. That had the herringbone weave, so if one accepts the argument that the use of the herringbone weave pattern on shrouds shown in epitaphios was influenced by the Shroud of Turin, then that provides further evidence for the Shorud of Turin’s existence before 1200AD.","date":"July 22, 2012 at 11:02 pm","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)"},{"author":"matt","post":"Yes the 1200 AD Venice epitaphios is the one I viewed in G. Schiller’s authoritative volume.Max – I fail to see any zigzag weave pattern in the Hetoimassia:","date":"July 23, 2012 at 6:45 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)"},{"author":"matt","post":"For me, there are many interesting things in this image, some of which are more compelling than others. But the two most compelling factors remain:1. The position of the nude Jesus in the artwork, strikingly similar to the image of Christ on the shroud2. The herringbone bone weave-like pattern at the bottom of the image, with the 4 poker holes in the L shape.Any notion that these holes are some kind of pattern or motif without any connection to the poker holes on the shroud is illogical. A decorative pattern comprising the circles would surely have been in a symmetrical pattern, rather than the asymmetrical pattern of the 4 L shaped poker hole alignment.","date":"May 28, 2012 at 8:39 PM","url":"http://theshroudofturin.blogspot.com/2012/05/my-critique-of-pray-codex-wikipedia-1.html","title":"My critique of \"The Pray Codex,\" Wikipedia, 1 May 2011"},{"author":"matt","post":"And what of the letter of the alphabet-type figure above the supposed shroud? Is it a hungarian letter? What might it mean?Also, is that an image of the shroud's peaceful, closed eyes head behind the right arm of the apostle?","date":"May 12, 2012 at 10:57 AM","url":"http://theshroudofturin.blogspot.com/2010/01/shroud-of-turin-z-pray-manuscript.html","title":"The Pray Manuscript (or Codex)"},{"author":"matt","post":"StephenI fail to see how the shroud can be interpreted to be twice the length of the man - please explain. The only thing I can think of is that you are interpreting what I think is the  tomb (with the red crosses) as part of the shroud. Likewise, I can't understand the reference to the L shaped pattern of holes on \"the front and the back\". Clearly there is the L shaped pattern of 4 holes on the object which the angel is standing on, but I interpret the circular objects on the object below it with the red crosses (which I think is the tomb) as decorative.   Also, if the painting is a copy of the shroud why is Jesus's body in the top part of the painting free of wounds and blood stains? Also, does Jesus in the painting have a beard? At best I can pick out whiskers!","date":"May 12, 2012 at 8:34 PM","url":"http://theshroudofturin.blogspot.com/2010/01/shroud-of-turin-z-pray-manuscript.html","title":"The Pray Manuscript (or Codex)"}],"blood":[{"author":"matt","post":"I’m a very open minded person (I think it is highly likely based on the collective evidence that the Shroud is authentic, but I am certainly not 100% convinced), and as I said Colin talks sense sometimes when he is not talking nonsense (he’s better sticking to science, rather than getting into quite frankly absurd historical and artistic arguments). I think he has some interesting thoughts on his scorch theory, and I for one wouldn’t dismiss his theory that the Shroud image is a LIGHT scorch, hence why it is non-fluorescent. I would like to see this theory tested further, to me it is the only plausible argument for non-authenticity.His thoughts on the crease marks adjacent to the head image being potential evidence for a scorching method are also quite interesting, in my view.If someone disproved his theory I’d say I’m 100% convinced of authenticity (I have no time for bas-relief rubbing theories)","date":"July 30, 2012 at 7:04 am","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But."},{"author":"matt","post":"Hi YannickRe: Number 1. I’m still not satisfied!!! What could possibly block the image formation through the top of the head?Could Jesus’s crown of thorns have prevented image formation, for example if the Crown of thorns was tall enough to prevent contact between the top of the head and the cloth? But even if that was possible, it would be unlikely that Jesus would have been wrapped in the shroud without removal of the crown of thorns?","date":"August 2, 2012 at 4:02 am","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But."},{"author":"matt","post":"Further to my last comment I see from searching the internet that some theorise that the crown of thorns was more like a cap. If that is the case, the cap of thorns would have prevented contact between the top of the head and the shroud, perhaps explaining the lack of image.However, if this is correct it may be problematic for resurrection induced radioactive image creation. Surely if the image was created by supernatural energy generated during the resurrection, that would have been emitted from the top of the head and the energy would have left an image of the top of the head and cap of thorns?Therefore, if we are to argue the case that the shroud really wrapped Jesus, perhaps image formation through some biological process resulting from contact between body and shroud is more likely?I find it hard to accept the vertical projection theory","date":"August 2, 2012 at 4:14 am","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But."},{"author":"matt","post":"Yannick – but my point is that Colin’s theory is that a light scorch, as opposed to a heavy scorch may NOT cause a flourescence. Do you have any evidence to disprove that LIGHT scorches also do not cause flourescence","date":"July 30, 2012 at 6:46 pm","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But."},{"author":"matt","post":"YannickThanks for your responses.There are a couple of other things that still trouble me about the Shroud:1. Why is there no image on the top of the head. Surely the top of the head would have created an image, whether the rest of the image was created by radiation, amines or whatever? The lack of image on the top of the head provides some support for Berry’s bas relief scorch theory2. How about the creasemarks just below the chin / above the head? I think Berry makes quite a good argument that these creasemarks appear the product of a scorch ( they remind a bit of what happens when you iron a crease into a shirt)","date":"July 31, 2012 at 11:26 pm","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But."},{"author":"matt","post":"Great piece Yannick.I have one question  you or others might be able to answer. I have often heard it said that there is no image under the bloodstains. Can someone please explain how this is known? would it not be impossible to tell without scraping away the bloodstains? Or has this been determined through some kind of scanning technology?This has been troubling me for a while so an explanation would be appreciated!!!!","date":"July 29, 2012 at 4:06 am","url":"https://shroudstory.com/2012/07/28/yannick-delights-with-another-great-paper/","cat":"blood_studies","title":"Yannick Delights with Another Great Paper"},{"author":"matt","post":"YannickCould not the presence of blood have chemically affected the image eg. the blood was added on to the image, and the blood worked chemically in some way to erode the image?I am not a scientist, but just offering up what seems a possible alternative consideration as a layman","date":"July 30, 2012 at 3:17 am","url":"https://shroudstory.com/2012/07/28/yannick-delights-with-another-great-paper/","cat":"blood_studies","title":"Yannick Delights with Another Great Paper"}],"dating":[{"author":"matt","post":"That is a very good quote and true. – religious people love to jump too conclusions no matter what to protect their beliefs systems.Ramsey just points out the obvious.  No system yet it appears to debunk the radio carbon testing, even Jackson’s carbon hypothesis.  I’m sure Ramsey wants to know the truth and if that means that the dating was wrong I’m sure they would admit it – he’s a scientist – they want to know the truth and gain knowledge. Obviously he admits it could be flawed but nothing has suggested this till date.","date":"December 21, 2011 at 3:35 pm","url":"https://shroudstory.com/2011/12/21/chivers-in-the-telegraph-get-over-it-the-turin-shroud-is-fake/","cat":"carbon_14_dating","title":"Chivers in the Telegraph: Get over it. The Turin Shroud is fake."},{"author":"matt","post":"There is no worse thing than an intelligent(-sounding) religious zealot so far up his own ass he gives the priests he seeks for guidance, when they’re not busy molesting children, a run for his money. Makes of discerning beings with a speck of brain from clothed monkeys for a tougher, and far more vexing, exercise. Drop the thesaurus and pick up an encyclopaedia.","date":"April 19, 2015 at 12:05 pm","url":"https://shroudstory.com/2014/12/03/jerry-coyne-pope-francis-endorses-the-fake-shroud-of-turin/","cat":"carbon_14_dating","title":"Jerry Coyne:  Pope Francis endorses the fake Shroud of Turin"}],"history":[{"author":"matt","post":"And the artist of the Pray Manuscript very cleverly reconciles these gospel differences in Plate III.  As per John, he shows both the face cloth and the linen body cloth (Shroud).The face cloth or sudarium is the small bundled object, to the right of the angel's foot and the cross motifs. Freeman acknowledges this to be the sudarium. It is the right size to be the face cloth, and further support for it being this rather than the Shroud is provided by the symbolic connection depicted by the letter (alpha?) floating between the cross and Jesus's head behind the right arm of Mary.Then the Shroud is the object beneath the face cloth, with the 4 poker holes, streaks of blood, and cross motifs symbolising the image of Jesus on the Shroud.","date":"July 12, 2012 at 4:45 PM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","title":"`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'"},{"author":"matt","post":"Sorry slightly off topic but since there is a picture of the Pray Manuscript there is a tenuous link....I've been doing some research on Bela III, who was the King of Hungary from 1172 to 1196 (ie. during the creation of the Pray Manuscript)Interesting to read of his very strong connections with Constantinople (he was educated there, and married a Byzantium woman). He was in fact lined up to be Emperor, but this was changed when the Emperor finally had a son. Bela III fostered relations with Constantinople and \"invited religous orders and scholars from abroad to settle in the country\" (From \"The Church and Bela III of Hungary (1172 - 1196): the Role of Archbishop Likacs of Esztergom\")This provides further backing for the claim that the images in the Pray Manuscript were influenced by a viewing of the Shroud in Constantinople. In fact, could the images have been drawn by one of the foreign scholars, perhaps from Constantinople? The fact that the Pray Manuscript is the first written Hungarian document supports the notion of a foreign creator or protagonist.   I found Bela's history interesting, as I didn't know of the very strong Constantinople connection.","date":"July 12, 2012 at 7:12 PM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","title":"`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'"},{"author":"matt","post":"Flagrum3Yes, I have now realised how very strong the connection between Hungary and Constantinople was. Before, I thought there might have been a weak connection, but it was very strong and this provides further backing for the notion that the Pray Manuscript artist had seen the Shroud in Constantinople.Re the Sakli....I'm open minded about the circles, I am yet to be convinced that they represent the poker holes on the frontal image of the Shroud, but they might!The number 7 is prominent in the Bible, and it might also be that the 7 circles are there as a numerological reference to God / the Bible. But it could also be a play on the poker holes of the Shroud.From what I've observed of Byzantine art, circles are often used, but when they surround Jesus's head they are usually 4 circles in the pattern of a cross. I haven't seen this 3 circles on one side, and 4 circles on the other side, pattern before.So I am just theorising but maybe in Byzantine times people interpreted the 7 poker holes on the frontal image in light of the numerological significance of the number \"7\"","date":"July 14, 2012 at 1:34 PM","url":"http://theshroudofturin.blogspot.com/2012/07/according-to-john-chapter-20-jesus-was.html","title":"`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'"},{"author":"matt","post":"An interesting theory, but I still find Wilson’s more convincing.Why would the author of the Acts have referred to ceremonial cloth by the number of folds? Especially when there is no other reference to ceremonial cloths being “tetradiplon”? When they could simply describe it as being a “Ceremonial cloth” or something similar?I think it is more convincing to argue that the reference to “tetradiplon” was cryptic reference by the author to the Shroud which he knew was doubled 3 times = 8 portions (4×2 hence “tetradiplon”), hence presenting as the Image of Edessa – a landscape portrait of Christ’s face","date":"October 11, 2012 at 7:21 am","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","title":"Charles Freeman:  Tetradiplon – the Mystery Solved?"},{"author":"matt","post":"Did no one ever find out more info on this epitaphios?I think it is a very interesting one. Not only the Shroud-like weave, but also the hand positions, and the blood / flagrum markings all over the body","date":"July 21, 2012 at 8:59 am","url":"https://shroudstory.com/2011/03/28/herringbone-weave-within-stavronikita-epitaphios/","cat":"history","title":"Herringbone Weave within Stavronikita Epitaphios"},{"author":"matt","post":"Interesting to see in this epitaphios the wound on the top hand only near the wrist, as per the Shroud, also the lower hand (left hand) seems much longer than the top hand, also as per the Shroud","date":"July 21, 2012 at 9:10 am","url":"https://shroudstory.com/2011/03/28/herringbone-weave-within-stavronikita-epitaphios/","cat":"history","title":"Herringbone Weave within Stavronikita Epitaphios"},{"author":"matt","post":"Here are my replies (in stages)FACT 1 / FACT 2Throughout most of history Jesus has been shown in art as risen and glorious after his death. Before his death, after the descent from the cross, he is also usually shown with minimal wounds. Certainly most art will usually show him – at worst – with wounds in the palms, and feet, the side wound, and sometimes blood on the head. It is very rare for more widespread body wounds, including flagrum marks, to be shown.Actually, I disagree with Yannick’s comment that Christ’s body-wide wounds began to be shown in the early 1200s after the crusades. Actually, the only time in history where Jesus’s widespread body wounds were depicted clearly in graphic detail was a period in the mid to late 1400s in German art.The fact that earlier art eg. Byzantine art – didn’t show wounds on Jesus’s body does not prove that the Shroud did not exist in this earlier period. Simply, in theological terms, Christ was God, and his humanity including physical suffering was minimised. Remember, the Bible mentions the flogging Jesus received, his body wide scourging. Anyone who read the Bible from ancient times knew that Jesus’s body would have been severely wounded. Yet he was not represented this way in art.The FACT that Jesus’s comprehensive body-wide wounds have not usually been shown in the history of art – apart from a period around the mid to late 1400s in German art – is a very strong point supporting the Shroud’s authenticity.Indeed, from an art history perspective if any time in history made sense for the Shroud’s creation it would be in the mid to late 1400s. But we know that the latest that the Shroud could have been created by a GENIUS would have been the mid 1300s.The fact that depictions of the Mandylion show Jesus with open eyes is almost irrelevant. These depictions were not copies, they were art. In addition, an alternative explanation is that actually the image on the Shroud is very faint when viewed in the flesh ie. without our modern day photographic enhancements. It wouldn’t necessarily have been clear that Jesus’s eyes were closed to people viewing the Shroud in ancient times","date":"July 7, 2012 at 5:00 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"author":"matt","post":"Re: the German art in the mid to late 1400s showing Jesus’s body wide wounds, refer this information that I posted on Stephen Jones’s website:Examples from the late 1400’s of art that shows body-wide cuts, marks and blood can be found at these websites:http://www.bridgemanart.com/asset/229986/German-School-15th-century/Ms-351455-fol.148v-The-Entombment-from-%27The-Life?lang=en-UShttp://en.wikipedia.org/wiki/Matthias_Gr%C3%BCnewaldhttp://en.wikipedia.org/wiki/AndachtsbilderAll are German art, so there must have been a movement in Germany around the late 1400s to early 1500s to show Jesus’s body in a much more tortured and injured manner.From Wikipedia:“In the Late Middle Ages, increasingly intense and realistic representations of suffering were shown,[22] reflecting the development of highly emotional andachtsbilder subjects and devotional trends such as German mysticism; some, like the Throne of Mercy, Man of Sorrows and Pietà, related to the Crucifixion”(From: http://en.wikipedia.org/wiki/Crucifixion_in_the_arts#Through_history)","date":"July 7, 2012 at 5:04 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"author":"matt","post":"if you see the 1516 copy of  the Shroud you will see that the copyist showed Jesus with open eyes supporting my earlier point:http://www.shroudofturin4journalists.com/Details/copy1.htm","date":"July 7, 2012 at 5:06 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"author":"matt","post":"I would recommend anyone who lives in a city with a good university to track down this book:“Iconography of Christian Art” by G. SchillerThe book, in two volumes, has hundreds of plates showing Jesus’s depiction in art through history up to about the 1500s / 1600s, in chronological order. It very clearly demonstrates that Jesus was almost never shown with body wide wounds including scourging other than the period in the 1400s in German art","date":"July 7, 2012 at 5:15 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"author":"matt","post":"Yannick says there is a lack of evidence indicating the Mandylion was in Edessa before the mid 500sActually, the story of St Alexius shows that he was in Edessa in the early 400s, and he saw an icon that spoke to him.Whilst not conclusive, I consider this is the Mandylion / shroud:http://www.courseportfolio.org/peer/potfolioFiles/anonF/shopkow-l-2003-1/alexis.htm Refer to paragraph 18 which mentions that the saint went to Edessa “to see an icon that he had heard tell of”, and later on the icon calls for the Saint’s servant to call for St Alexius“Linda Cooper `The Old French Life of Saint Alexis and the Shroud of Turin’, Modern Philology [a journal devoted to research in medieval and modern literature], University of Chicago Press, August 1966, pp.1-17. The eleventh century Old French Life of Saint Alexis, generally recognized as the first masterpiece of French literature, contains the passage: Then he [Alexis] went off to the city of Edessa Because of an image he had heard tell of, Which the angels made at God’s commandment… As Linda Cooper shows in this highly scholarly paper, the `image’ referred to is none other than the Image of Edessa, and when the various versions of St. Alexis’s life are studied, it makes a great deal of sense that this was one and the same as the Shroud. She cites, for instance, the Bollandist Vita Alexius which calls it `sine humano opere imago Domini nostri Jesu Christi in sindone’ , i.e. `an image of our Lord Jesus Christ made without human work on a sindone’; also the Latin Cod. Monac. Aug. S.Ulr. 111 … `[he came] to the city of Edessa, in which there was preserved a blood-stained image of the Lord not made by hands’. Both passages clearly refute arguments that the Image of Edessa was incompatible with the cloth we know today as the Turin Shroud.” (BSTS Newsletter, No. 16, May 1987, p.14).St. Alexius (or Alexis) lived in Edessa between 412 and 435:“Saint Alexius or Alexis of Rome or Alexis von Edessa was an Eastern saint whose veneration was later transplanted to Rome, a process facilitated by the fact that, according to the earlier Syriac legend that a “Man of God” of Edessa, Mesopotamia who during the episcopate of Bishop Rabbula (412-435) lived by begging and shared the alms he received with other poor people was, after his death there, found to be a native of Rome.” (“Alexius of Rome,” Wikipedia, n 24 March 2012).","date":"July 7, 2012 at 5:38 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"author":"matt","post":"YannickYou said:“The first 2 known epitaphios artworks are dated around 705 and were located in a chapel build by pope John VII in the Vatican. These artworks show a depiction of the body of Christ being deposit in his Shroud and there are many details that agreed with the Shroud and his body image. Among which there is the fact that we don’t see the thumbs, while we can see 4 long fingers on each hands. Also, the hands are crossed over the pubis, just like we see on the Shroud.”I have never heard of this. Can you provide further information, including links to images if possible?Matt","date":"July 7, 2012 at 7:45 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"author":"matt","post":"I don’t have time to reply in detail to Yannick’s piece, but thank you Yannick for an excellent piece, it’s a great resource","date":"July 7, 2012 at 5:40 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"author":"matt","post":"this is a good posting. I’ve said it before and will say it again – the Vignon marking argument is a joke.That doesn’t mean the Shroud is inauthentic. Although I am agnostic on its authenticity, I think the arguments FOR tend to outweigh the arguments AGAINST","date":"October 17, 2012 at 5:54 am","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","title":"Quote for Today: Diana Fulbright on Wishful Thinking."},{"author":"matt","post":"“The expression tetradiplon in the Acts of Thaddeus is used at a moment when Jesus is alive and well, before his Passion, and he used this cloth to wash only his face. So the context has nothing to do with a burial cloth of more than 4 meters long. That’s the reality of the litterary context”That is only one interpretation.Another interpretation could be that the author of the Acts of Thaddeus, having seen the Image of Edessa which was actually the Shroud folded to only display the face of Jesus, wrote this legend to explain the faint image of Jesus’ face one sees on the Shroud (and one saw on the Image of Edessa). Given the faint image of the face, a legendary explanation that it was created by a wet or sweaty face makes a good deal of sense.“So the context has nothing to do with a burial cloth of more than 4 meters long.”Well it does if the “burial cloth” being the shroud had been hidden away / disguised by it being folded to only reveal the image of Jesus’s face, in order to get around the fact that theologically speaking it would have been offensive at the time to show Jesus’s naked and heavily tortured body. The author may have been privy to see the whole shroud as a tetradiplon, or have heard that this was the case.","date":"September 17, 2012 at 8:03 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"author":"matt","post":"exactly, similar to my hypothesis outlined above and not even addressed by Yannick or Charles. My one difference is that I hypothesized that the author of Thaddeus knew the “towel” described in the legend was the shroud folded into eight sections, hence the use of the somewhat “mysterious” and “cryptic” word “tetradiplon”. His method allowed his to conceal the shroud’s existence but cryptically also pointed to its existenceA perfectly credible hypothesis, in my view","date":"September 21, 2012 at 8:05 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"author":"matt","post":"Yannick (and Mr Freeman)With all due respect, I think you are missing something very important here.There is in fact no problem with the fact that the legendary account refers to both the tetradiplon and the burial clothes – let me repeat, no problem.Let’s go back to first principles. Please put your prejudices aside, and assume for the moment that the Image of Edessa WAS in fact the Shroud, folded in a manner that only displays the image of the face.Assuming that, then it makes perfect sense that the legend would seek to explain the creation of that image in the way that it does.And furthermore, if we continue with the assumption that the Image of Edessa WAS the Shroud folded, we should also note that the balance of the shroud image beyond the face was hidden for a reason/s, which may have included the inappropriateness of showing Jesus’s naked, tortured body.Then, if the public / vast majority was not aware of the shroud that lay folded beneath the facial image, then in terms of conventional wisdom the Image of Edessa was not the shroud, and was not the burial clothes of Jesus – therefore we logically conclude that there is no logical tension in the legend from the perspective of a hypothesis suggesting the Image of Edessa WAS the Shroud.","date":"September 19, 2012 at 4:20 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"author":"matt","post":"Thanks Yannick. I acknowledge your point of view, and acknowledge it MIGHT be right. But I don’t think you can dismiss my own / others explanations or views on this matter which I think are equally as likely (the fact is I think it would be hard to definitely prove either way on the current evidence) . Your piece from July 2012 refers to a record that demonstrates that a Mandylion and burial shroud existed in Constantinople amongst a number of relics in the 11th century. Your piece clearly states that the records show that the mandylion was a painting.Although there is some ambiguity, the historical records suggest that the Image of Edessa was a faint, ghostly image, hence the legend that explained the formation of the image asbeing generated by Jesus pressing his wet face into the cloth.I think a solid argument does exist to suggest that the Mandylion may have been a painting of the Image of Edessa, and if this is the case then there is no tension in the legend as I argue above.","date":"September 20, 2012 at 12:41 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"author":"matt","post":"good point :)","date":"September 20, 2012 at 12:43 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"author":"matt","post":"DavebAlthough on balance I consider the Shroud is most likely the authentic burial Shroud of Jesus  whom I consider Lord, I must say I remain totally unconvinced by the Vignon marking argument.","date":"September 20, 2012 at 6:04 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"author":"matt","post":"actually I’ll go further and call the Vignon markings a joke that actually undermines the reasonable credibility of the pro-authenticity case::","date":"September 20, 2012 at 6:17 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"author":"matt","post":"DavebI think the Vignon markings deserve parody, and as I say they do the pro-authenticity argument a  disservice.I don’t know where to start, but I’ll try.Firstly, it needs to be acknowledged that Byzantines of course only viewed the faint facial image on the Shroud, not the negative photographic image.I can’t for the life of me see how Byzantine artists might have made out features such as the so-called enlarged left nostril on the Shroud – I can see no such thing, nor for the that matter anything resembling an enlarged left nostril in Byzantine artwork. The so-called flecks of hair on the forehead at the hair parting?  – sure there is a slightly darker marking in this area, but its highly “imaginative” to read these as flecks of hair. Raised eyebrow? Again, just don’t see it. Forked beard and moustache? So what? Such facial hair features were commonI could go on and on.Whilst I am with you on the authenticity of the Shroud, in my opinion the Vignon markings are a joke.This is just my view, for what its worth.","date":"September 20, 2012 at 8:07 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"author":"matt","post":"Yannick, regarding your point 1. Please refer my comment #53 which you haven’t addressed. Although I also question Wilson’s credibility at times, I think you re being unfair with respect to this issue, as per my comment.","date":"September 20, 2012 at 6:59 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"author":"matt","post":"still no comment Yannick? If not why? I’m getting tired of the dogmatic lack of flexibility and open mindedness on both sides of the debate","date":"September 21, 2012 at 5:57 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"author":"matt","post":"I agree. And I agree with the quote that it really is the burial cloth of Jesus, or an ingenious invention. Yannick’s 1 and 2 are theoretically possible but in my view highly unlikely.","date":"October 20, 2012 at 3:58 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","title":"The Central Dilemma of the Shroud?"}],"image":[{"author":"matt","post":"You’re welcome. I’m a skeptic and like such discussions. I’ve looked into a lot weird religiously based claims that don’t get a lot of skeptical treatment or scrutiny. The Shroud is one of them. When I first heard about the Shroud a few years ago I was surprised at the lack of skeptical sources on the internet or in books, responding to the obvious pseudoscientific “findings” and methods of that crowd. Anyways keep up the good work. I’ll be checking in from time to time.","date":"March 18, 2017 at 7:25 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/01/04/testing-my-flour-imprint-hypothesis-might-those-be-solid-gluten-flecks-one-sees-on-the-shroud-scope-body-image/","cat":"medieval_hoax","title":"Might those be flecks of congealed wheat gluten one sees on the Turin Shroud? Evidence for unique one-off white flour imprinting?"},{"author":"matt","post":"Ah yes, the maillard reactions that Rogers proposed (the only thing he did right). I think your explanation is brilliant. As regards to the proshroudies. They’ve been caught with there pants down (figuratively) too many times. STURP reminds me of the pseudoscience done by creation “scientists”. I think the reason it hasn’t been explained is because no one wants to explain it because it serves a religious purpose and mystery gets publicity.My question is when I read Dan Porter, he says he believes it’s authentic but then says he doesn’t believe it’s a miracle and can be explained naturally.What do you make of that because at times it seems like he’s talking out both sides of his mouth. Like it seems many times that people in that camp will try to play both sides of the table like that.","date":"March 18, 2017 at 6:42 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/01/04/testing-my-flour-imprint-hypothesis-might-those-be-solid-gluten-flecks-one-sees-on-the-shroud-scope-body-image/","cat":"medieval_hoax","title":"Might those be flecks of congealed wheat gluten one sees on the Turin Shroud? Evidence for unique one-off white flour imprinting?"},{"author":"matt","post":"Well if there is no image, where is the hair coming from unless the front image isn’t as superficial as they’re saying. It’s hard for me to believe a lot of the pro-shroudies given the spurious nature of a lot of their claims. I saw your comment on Dan Porters site about the graphite background and the picture of the red painting on linen. Could this be a light phenomena? assuming the images are as superficial as they say. In any case, I’m convinced that the shroud is a fake. I think the image of the hair may come from the outlines of the painted blood and perhaps some oil substance staining through which adds to the paredolia. In the big picture I think this is the last thing Christianity has seeing that they’ve lost when it comes to creationism, geocentrism and Adam and Eve. Seeing that all these things have been debunked. I think the shroud will follow. What say you?","date":"March 18, 2017 at 4:14 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/01/04/testing-my-flour-imprint-hypothesis-might-those-be-solid-gluten-flecks-one-sees-on-the-shroud-scope-body-image/","cat":"medieval_hoax","title":"Might those be flecks of congealed wheat gluten one sees on the Turin Shroud? Evidence for unique one-off white flour imprinting?"},{"author":"matt","post":"Good day Colin, I’ve been reading your blog and you’ve revealed things to me I never knew about the shroud given all the hype thats out there. Just wanted your opinion on something. What do you make of the “second face” on the reverse side claim. I’ve heard even some pro-shroud people deny it. Do you have a post about it? Thanks.","date":"March 18, 2017 at 1:20 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/01/04/testing-my-flour-imprint-hypothesis-might-those-be-solid-gluten-flecks-one-sees-on-the-shroud-scope-body-image/","cat":"medieval_hoax","title":"Might those be flecks of congealed wheat gluten one sees on the Turin Shroud? Evidence for unique one-off white flour imprinting?"},{"author":"matt","post":"Do you know what? Sometimes, just sometimes, Colin Berry talks sense.Then he comes up with some ridiculous theories and thoughts that destroy any credibility he might have claimed.His latest nonsense concerns the 1516 Lire copy. He presents an argument along the following lines. The Lire copy shows minimal blood stains, only discrete ones on the palms of both hands and the side wound. He presents an argument that essentially the blood stains were added to the shroud over time, and the Lire copy showing discrete wounds consistent with the Bible was an early stage in the progressive re-interpretation of the shroud to incrementally show more blood wounds. He even throws up his bizarre Lirey Badge theory again, arguing because we can’t see blood wounds on what amounts to a tiny metal crafted badge that there was no blood on the shroud in the 1300s. This is nonsense, because the scale is too small to reasonably show bloods wound, although it does show the blood across the bottom of the back of Jesus, which Berry inventively (I’ll always give him points for creating novel theories, even if they are nonsense) calls a chain. Mr Berry needs to get himself to a decent university library and educate himself in art history.There are at least two examples of epitaphios from 1200, and the 1300s respectively, that show Jesus with body wide wounds and flagrum marks (I might add very consistent with the positioning of marks on the Shroud, one of these even shows a wound on the wrist on the top hand, and none on the other), being laid out on a herringbone weave shroud. These provide very compelling evidence that the Shroud was in existence AT LEAST as early as 1200 (personally I believe the shroud goes back to the time of Christ, but for now let’s just deal with the middle ages)    In my opinion, an explanation for the differences in the Lirey copy from the shroud that is FAR more likely is that the Lirey copy’s differences are due to the artist wanting to show the hand wounds in accordance with conventional artistic depiction. Similarly representations of Jesus through the 1500s / 1600s  were typically non-gory, hence the very limited and discrete depictions of key (in the sense of the Gospel accounts) bloody wounds. As I have stated here before, there is a limited period in German art from about the late 1300s to the late 1400s that shows Christ’s body heavily wounded, and one or two other curious examples, such as the epitaphios I mention above. Otherwise minimal and discrete wounds are the norm","date":"July 29, 2012 at 4:55 am","url":"https://shroudstory.com/2012/07/28/is-the-non-fluorescent-body-image-on-the-shroud-of-turin-a-valid-indicator/","cat":"image_theory","title":"Is the non-fluorescent body image on the Shroud of Turin a valid indicator?"},{"author":"matt","post":"Indeed other copies demonstrate “reinterpretation” of the shroud to suit their audience. For example, most copies show Jesus wearing a loin cloth, to protect His modesty. Obviously, His image on the shroud does not include a loin cloth","date":"July 29, 2012 at 5:19 am","url":"https://shroudstory.com/2012/07/28/is-the-non-fluorescent-body-image-on-the-shroud-of-turin-a-valid-indicator/","cat":"image_theory","title":"Is the non-fluorescent body image on the Shroud of Turin a valid indicator?"},{"author":"matt","post":"Thanks, it just seems suspicious the evidence for painted stains and painted stains where there is hair. If these “blood” stains were painted first it wouldn’t take that much effort to align the bas relief. As for Adler and Heller, I’m skeptical of the results any STURP member given some of their pseudoscientific methods and claims. Shroudies are just saying that the blood-first is slam dunk evidence that it is the real thing. As for the fluorescence your post “Most definitely no”, was very good. I was just reading what Hugh said “The implications are that, yes, scorches always fluoresce, but only at high power. There is thus no reason why the ‘image’ of the Shroud is not a scorch!”. I guess used a different wavelength of UV.","date":"April 2, 2017 at 11:37 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/03/my-immediate-response-to-a-comment-on-did-the-bloodstains-really-precede-image-formation-on-the-shroud-of-turin/","cat":"abrasion","title":"My immediate response to a comment on “Did the bloodstains really precede image formation on the Shroud of Turin?”"},{"author":"matt","post":"So did the “blood” come first? Or image. The stains aren’t realistic and look painted.Also just another question, I read your post about scorches and fluorescence. So the reason the 1500s burn fluoresced red (and the image didn’t) was because they didn’t use a strong enough UV light? The same one as yours which didn’t make fluorescent images? Just a little confused.","date":"April 2, 2017 at 10:31 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/03/my-immediate-response-to-a-comment-on-did-the-bloodstains-really-precede-image-formation-on-the-shroud-of-turin/","cat":"abrasion","title":"My immediate response to a comment on “Did the bloodstains really precede image formation on the Shroud of Turin?”"},{"author":"matt","post":"I’d love to, but my time is limited, I’m a busy guy. Not only that I’m still learning the science (or lack thereof) behind the Shroud. Needless to say you are definitely more equipped to post about the subject. I do write on my spare time about a load of topics, mainly refuting young-earth creationism and miracle claims from the Catholic Church. I haven’t posted any of it on any forum since my writings are just for me to organize my thoughts. There’s a lot of b.s out there for sure and many instances of these religious zealots lying through their teeth to stir the fears and the “feelies” of the faithful. However, I will keep your offer in mind if I write anything that would possibly be of value for this blog.But I’m not kidding, would the people who own the Shroud allow you to take samples if you asked?Also, I just viewed your post “Modeling the Shroud of Turin with White Flour, Olive oil and a real face” and saw the pictures of the hands https://shroudofturinwithoutallthehype.files.wordpress.com/2016/01/scan-300-dpi-oil-v-flour-only-control-magnified-then-screen-grab.png?w=640I was amazed by the detail and shroud like images (I was surprised Thibault was impressed too). However, my question is, were these images as superficial as the actual shroud image and/or your experiments on the “To all those who persist in claiming the Shroud image is far too superficial…”Thanks for the feedback, and I will keep your offer in mind.","date":"April 3, 2017 at 3:45 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/03/19/comment-promoted-what-are-we-to-make-of-the-second-face-on-the-reverse-side-of-the-turin-shroud/","cat":"turin_shroud","title":"Comment promoted: what are we to make of the second face on the reverse side of the Turin Shroud?"},{"author":"matt","post":"They’re all pseudoscientists, in every sense of the word. And they want to keep it a mystery and exaggerate their claims and pretend the radiocarbon date was wrong and pretend there’s blood on it, and pretend it’s a photographic negative, and pretend some more.. It seems they want to keep it a mystery and get the feelies and keep the circus going. Btw, you’re a scientist, have you ever thought about getting your hands on the Shroud of Turin and do your own examinations? Or do they only allow believers.","date":"April 3, 2017 at 2:47 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/03/19/comment-promoted-what-are-we-to-make-of-the-second-face-on-the-reverse-side-of-the-turin-shroud/","cat":"turin_shroud","title":"Comment promoted: what are we to make of the second face on the reverse side of the Turin Shroud?"},{"author":"matt","post":"Hey, thanks for dedicating a post to my comment. I didn’t know it was worth that much. Looking forward to reading,“Turin Shroud: so how come STURP managed to get it so COMPLETELY wrong?”.","date":"April 3, 2017 at 1:29 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/03/19/comment-promoted-what-are-we-to-make-of-the-second-face-on-the-reverse-side-of-the-turin-shroud/","cat":"turin_shroud","title":"Comment promoted: what are we to make of the second face on the reverse side of the Turin Shroud?"},{"author":"matt","post":"Btw, whats the vertical line that looks like a fold running down the length of the Shroud on the one side. I looked at shroud scope and it looked like its part of the original cloth, is that a fold or something? Someone was trying to prove to me along time ago that that was the (already debunked) “invisible reweaving area”. Could you fill me in on that?","date":"April 8, 2017 at 5:33 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/03/19/comment-promoted-what-are-we-to-make-of-the-second-face-on-the-reverse-side-of-the-turin-shroud/","cat":"turin_shroud","title":"Comment promoted: what are we to make of the second face on the reverse side of the Turin Shroud?"},{"author":"matt","post":"I was interested in 8 and 23 (I would call it a failure, instead of ill judged) the whole vanillin “dating” has every flaw that creationists level against radiometric dating and I’m willing to bet a lot of these shroudies are creationists (maybe not all). 19 and 2 especially 2 because its a laughable argument like looking at a whale and calling it a monkey. There IS “blood” on the hair. 29 as well. In summary 8, 23, 19, 2 and 20 where the ones that stuck out the most.","date":"April 6, 2017 at 10:32 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/03/19/comment-promoted-what-are-we-to-make-of-the-second-face-on-the-reverse-side-of-the-turin-shroud/","cat":"turin_shroud","title":"Comment promoted: what are we to make of the second face on the reverse side of the Turin Shroud?"},{"author":"matt","post":"Sounds like a plan, I look forward to reading.","date":"April 6, 2017 at 9:33 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/03/19/comment-promoted-what-are-we-to-make-of-the-second-face-on-the-reverse-side-of-the-turin-shroud/","cat":"turin_shroud","title":"Comment promoted: what are we to make of the second face on the reverse side of the Turin Shroud?"}],"opinion":[{"author":"matt","post":"yes and he conveniently ignores this in his response to point 2 above. In the past I’ve heard him state something along the lines of “I wish I had the lamp equipment to test a lower intensity scorch”. Well as a much self hyped prominent scientist, you would think he would be able to access one if he really wanted to, or at least get an ex colleague or someone to do it for him. It seems very convenient that he hasn’t.Until he does, I for one will continue to be totally unconvinced by his “scorch theory”, not just for the lack of flourescence, but for a multitude of other reasons too.","date":"July 1, 2012 at 4:40 am","url":"https://shroudstory.com/2012/06/30/rude-comment-of-the-day/","cat":"other_blogs","title":"Rude Comment of the Day"}],"researchers":[{"author":"matt","post":"Superb critique Stephen.Speaking of Dan's blog, I have been debating the Pray Manuscript with Colin Berry. A significant development was that after much prompting I got him to admit that the two red streaks on the shroud were in fact blood. This is a significant victory, because as I pointed out to him it is unknown for art of that period and even up to at least the 14th-15th centuries, for images to show blood on the shroud in entombment scenes. This is further evidence that the manuscript is based on a viewing of the shroud.He's still saying that the 4 circles in a one-off, assymmetrical L shaped pattern are just a random decorative motif though, which just defies logic as far as I am concerned!","date":"June 16, 2012 at 12:42 PM","url":"http://theshroudofturin.blogspot.com/2012/06/turin-shroud-is-fake-and-its-one-of-40.html","title":"`The Turin Shroud is a fake ... and it's one of 40': Antonio Lombatti"},{"author":"matt","post":"StephenI should clarify that when I am referring to two red streaks on the shroud, I am referring to the shroud as shown on the Pray Manuscript image. Sorry for not articulating that clearly.Colin didn't admit to real blood on the real shroud, rather he admitted the two red streaks  on the object in the Pray Manuscript image which he thinks is the sarcophagus lid and we think is the shroud, represent blood.I think this is significant. As I say,in the history of the art of Jesus's entombment there is very little evidence of blood on Jesus's discarded cloths / shroud. Almost always the cloths / shroud are unblemished. I think that the Pray Manuscript artist shows two red streaks representing a bloodied shroud is therefore very significant.My interpretation is that the two red streaks represent the two long streaks of blood on the arms of Jesus in the real shroud. In my view this is all stacking up very nicely, as the two long streaks of blood on the arms in the real shroud, and the L shaped poker holes, are two of the most prominent features.","date":"June 16, 2012 at 4:32 PM","url":"http://theshroudofturin.blogspot.com/2012/06/turin-shroud-is-fake-and-its-one-of-40.html","title":"`The Turin Shroud is a fake ... and it's one of 40': Antonio Lombatti"},{"author":"matt","post":">I cannot see those \"two red streaks\" on plate III of my copy of Berkowitz.I'm talking abut the two parallel red streaks on the image at the bottom of Plate 3, near the angel's foot, on the herringbone weave patterned object. The red streaks are next to cross motifs which I believe symbolise the image of Jesus on the real shroud.So, to sum up, what I interpret in the lower image of plate 3:- There is the herringbone weave patterned shroud (whether it is the shroud by itself or the shroud on top of a sarcophagus lid is fairly inconsequential)- On this representation of the shroud are crosses in its central area, to the right of the angel's foot. These crosses represent the image of Jesus on the Shroud- Immediately to the left of the crosses, just under the angel's foot, are two red streaks, which represent the blood marks on the shroud, possibly the two most prominent streaks of blood on Jesus's arms. The streaks are shown as the artist is moving progressively to showing Jesus's wounds and pain, from the small blood marks on the head in the upper image of Plate 3, to the more prominent red streaks in the lower image, to the blatant wounds on Jesus in Plate 4- Then to the right of the crosses and slightly overlapping them is the head cloth of Jesus, which is connected to the image of Jesus's head on Mary's sleeve. Colin Berry thinks this is the shroud.Note the original Greek of the Bible uses a word equivalent to \"entwined\" for the head cloth, rather than the commonly used word \"Folded\" in English translations. To my eye at least the head cloth looks entwined- Then to the right of this are the 4 circles which we interpret as the poker holes. Their placement is consistent with their placement on the real shroud just to the side of Jesus's image","date":"June 17, 2012 at 7:25 AM","url":"http://theshroudofturin.blogspot.com/2012/06/turin-shroud-is-fake-and-its-one-of-40.html","title":"`The Turin Shroud is a fake ... and it's one of 40': Antonio Lombatti"},{"author":"matt","post":"Stephen I got an interesting book on the Christian World in the Middle Ages, I found an image from the 11th century, a fresco from the church of San Clemente, Rome. It depicts scenes from the life of St Alexius, who lived in the fifth century, and interestingly was based in Edessa.In this image, St Alexius is praying over a sick girl, but look at the object by his right side. It looks suspiciously like a representation of the Shroud of Turin, although it is a bit hard to decipher the detail. At the very least, it is Jesus's full length image on \"something\". http://www.flickr.com/photos/hen-magonza/4641534107/Thoughts???Matt","date":"June 17, 2012 at 3:54 PM","url":"http://theshroudofturin.blogspot.com/2012/06/turin-shroud-is-fake-and-its-one-of-40.html","title":"`The Turin Shroud is a fake ... and it's one of 40': Antonio Lombatti"},{"author":"matt","post":"StephenFreeman's comment that interest in the Shroud has only been intense in the last 50 years is patently untrue.The large number of copies of the Shroud from the 1500s is witness to the interest that has always existed in it.It is certainly true that interest in the Shroud is MORE intense and  widespread today, thanks to technology, as well as the benefit of photography.","date":"July 5, 2012 at 3:52 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","title":"My critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\""},{"author":"matt","post":"StephenThe atheist Freeman notes the following under an image on an early page of his piece:\"Above, this wonderful icon from c. 1500, now in the Museum of Byzantine icons in Venice, shows clearly how the discarded burial cloths were seen in the eastern tradition, based doubtless on the gospel accounts. There is a separate sudarium and the wrappings from which Christ had extricated himself. The cloths found in the Jerusalem tomb in 2009 correlate with this tradition, an interesting example which points to the historical reliability of John’s gospel.\"Note the references to the separate sudarium and the  wrappings, and the reference to the 2009 tomb findings supporting this. This supports the notion that the Pray Codex lower image Plate III shows the sudarium on top of the Shroud. As we know some anti-authenticists claim the Shroud is the small cloth object on top of a sarcophagus lid.It's also interesting looking at this image and seeing the tomb / sarcophagus without a lid adjacent to it. Again, contrary to what some anti-authenticists say, it is actually far more common in art to see the empty tomb without an adjacent lid than an empty with an adjacent lid.Also of interest to me is Freeman's acknowledgement of the historic reliability of John's gospel - quite an admission from an atheist!!!!      I'm working my way through his paper and will offer more views.","date":"July 9, 2012 at 11:08 AM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","title":"My critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\""},{"author":"matt","post":"Freeman says:\"An even more bizarre explanation comes when Wilson tackles Byzantine art. Seventy years ago a Frenchman, Paul Vignon, noted that the bearded face on the Turin Shroud has some of the characteristics of Byzantine art. All kinds of measuring was done and some enthusiasts found as many as sixty resemblances. This is all interesting but Wilson goes on to make the absurd suggestion that this was because Byzantine art was born from the Image of Edessa, also known to Wilson as the Turin Shroud! Wilson makes some vague points about a new period in art at this time and finds a reference to two wandering Georgian monks with contacts with Edessa in the 530s who may have painted images. His key argument is the appearance in iconography of Christ with a beard happens just at this time. Yet, even if Wilson claims, against Belting who prefers a date fifty years later, that the Image of Edessa was known from the 540s, Byzantine art was well under way by then. So we have the earliest bearded Christ in the catacomb of Commodilla in Rome in about 390 and then a fine central image of a bearded Christ in the church of San Pudenziana of c. 405 (below). Even a brief glance at a standard history of early Christian art would have shown Wilson the emergence of these fully fronted bearded portraits in the fifth century.\"Actually, as I have stated before, the story of St Alexius has him travelling to Edessa in 405AD to venerate an icon, that eventually \"talks to him\" and influences his spiritual path.Whilst the evidence is not categorical, I consider it very likely that the icon is the Image of Edessa, which takes us back to 400AD at least. So it is likely that the Image of Edessa DID  influence the bearded depictions of Jesus that began to arise in the late 300s / early 400s","date":"July 9, 2012 at 5:26 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","title":"My critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\""},{"author":"matt","post":"Freeman says:\"If Wilson’s thesis that this linen cloth was the Mandylion was not already in enough trouble, he still has a major issue to tackle, the history of the Shroud from AD 30 to the second half of the sixth century when the Edessa Image aka to Wilson the Turin Shroud is first recorded in Edessa. It is a long period, much more challenging than filling in a mere 150 years.\"I have suggested above that the story of St Alexius strongly suggests that the Image of Edessa was in Edessa at least as early as 400 AD. Freeman overlooks the fact that Christianaity was persecuted in its first few hundred years of existence, and as result Christian relics would hardly be widely publicised!!! Once Emperor Constantine stepped in to cut that nonsense out in the early 300s, we then have less than 100 years of a lack of documentation. I would suggest that is a relatively insignificant gap. Or even if the St Alexius story is not accepted, about 200 years which again isn't really problematic.It should also be remembered that the iconoclasm from the early 700s likely saw many images and / or records of the Mandylion / Image o Edessa / Shroud of Turin destroyed","date":"July 9, 2012 at 5:36 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","title":"My critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\""},{"author":"matt","post":"I turn to Freeman's criticism of the Pray Manuscript: \"These scenes are supposed to show that the illustrator knew of the Turin Shroud. However, let us start with what would be obvious to anyone who had seen the Shroud, the size of the cloth and the two images. So to turn to the Pray Codex, it shows Christ being laid onto a shroud, which, in traditional Jewish style, as recorded in John’s gospel, reaches only to his shoulders. There does seem to be some sort of fold under the buttocks but hardly enough to make up the size of the Turin Shroud. Surely anyone knowing the Turin Shroud would have shown it with the top half of the Shroud above his head ready to be folded back over the body and fixed at the feet. Then the Turin Shroud shows a bearded Christ, this illustration does not, unless it is a very light beard.\"As Stephen has shown, actually the Shroud in the Pray Manuscript is much bigger than it first appears, as the figures in the background are holding an area of the shroud much greater than that which lies under Jesus's body.Also the illustration of Jesus does  show him with a light beard.The beard on the Shroud image is not particularly heavy either, and many illustrations of Jesus in art history have him with a relatively light beard.","date":"July 9, 2012 at 7:15 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","title":"My critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\""},{"author":"matt","post":"My last point:Freeman says:\"When one looks at the lower image of the Codex, the discarded burial cloths are there but if the illustrator had seen the Shroud he would have surely shown the image of Christ on them. As it is they are jumbled up and hardly seem anything like the size of the Turin Shroud.\"Comment: Why didn't the illustrator show the image of Christ on the Shroud? I don't know! But I can only hypothesize. Most significantly, the size of the Pray Manuscript is very small and it would have been very hard for the artist to meaningfully depict Jesus's image at this scale.There is also the question of HOW he would depict what is a very faint image. I believe the Shroud image of Jesus is symbolically represented by the cross motifs near the angel's foot, and this is an easy way to get around both the scale issue as well as the faint image issue.   Freeman goes on:   \"The most important point of all is that a blown-up image shows that the sudarium is depicted as a separate piece of cloth and so the source seems, once again, to be the account in John’s gospel where the sudarium is reported as lying separately. This cannot be the Turin Shroud! The usual practice of taking the gospel accounts as an inspiration seems to have been followed here.\"Comment: I'm glad Freeman acknowledges the small bundled up cloth is far too small to be the Shroud. Indeed it is! He rightly identifies it as the Sudarium, which is supported by the alpha letter connecting the sudarium to Jesus's head behind Mary's right arm. So at least Freeman is one step more advanced than our friend \"Science bod\" who thinks this small piece of cloth is in fact the shroud (no matter what you think of the artist's abilities, he does tend to get scale and perspective quite accurate in the illustration, and this cloth is far too small relative to the human figures adjacent to be the shroud. You are on the right track Mr Freeman!!!).    And finally Freeman again:\"No one who had seen the Turin Shroud and been impressed with it would have illustrated the discarded burial cloths of Jesus as is actually done on the Pray Codex, with, in the conventional gospel representation from John, of the sudarium being shown separately as it clear from a blow-up pof this part of the manuscript. There is not a single hint that there is anything to do with the Turin Shroud here!\"Comment:Wrong! Freeman the historian should know as much as anyone that ancient art used much symbolism. He acknowledges the small bundled cloths are the sudarium (good!) but fails to see the Shroud beneath it. He dismisses the random asymmetrical 4 holes in an L shaped pattern but does not offer an alternative explanation. He thinks it is a sarcophagus lid but ignores the two red streaks which subtly represent the blood of Christ on the Shroud. If it is a sarcophagus lid then what are the two red stripes? And is it mere coincidence that the red stripes and the 4 holes are located adjacent to the cross like motifs, echoing the blood images on the Shroud image and the holes just to its side? BUT Freeman has actually done our case a great service. He recognises the small bundle of cloths as the sudarium, but then wonders why there isn't a shroud, since the sudarium is consistent with John (but missing the shroud of John). Well, Mr Freeman, the image is more consistent with John than you imagined, because both the head cloth AND the shroud is there in the image (the former on top of the latter). To be fair to Mr Feeeman, the shroud is encoded in the artwork rather subtly and symbolically.","date":"July 9, 2012 at 7:44 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","title":"My critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\""},{"author":"matt","post":"StephenFurther to my previous points about the real suffering of Jesus not being graphically shown until the 1400s, I've borrowed a book called \"Jesus Christ\" by J.R. Porter. Porter is Professor Emeritus of Theology at the University of Exeter.A chapter on the history of Jesus's representation in art is written by art historian / lexicographer Jennifer Speake. On page 216 she states:\"In the post-Romanesque West a concentration on the physical torment of the Passion aimed to elicit powerful emotions of horror and sympathy in the onlooker. FROM THE FIFTEENTH CENTURY ONWARD, a growing observation and understanding of anatomy in the West brought to the NEAR-naked body of Jesus on the Cross a disturbing realism completely absent from the stylized torsos and musculature in Eastern icons.\"So this from an art historian backs up my own non-art historian observations that the kind of graphic, body-wide torturous suffering we see on the Shroud was not observed until well into the 1400s (some from the 1420s / 1430s, most from after 1450) in art, and further that all art (I think there might be one known exception) showed Jesus's moedesty protected by a loin-cloth at least.Anti-authenticists need to explain the following:- Why would an \"artist\" create the shroud in a manner that departs so radically from the conventional artistic depictions of Jesus at the time? (ie. prior to 1357 AD). We know in modern art that there have been radical innovators who have departed from the norm, but in ancient times artistic evolution was far more gradual.- In particular, if an \"Artist\" did it as a way to benefit from the relic trade, then it doesn't make sense to show Jesus's brutal inflictions when most people at this time would have found such a depiction offensive      - Furthermore, even into the 1400s and 1500s Jesus was almost universally shown with a loin cloth as a minimum protecting his modesty. Again it makes no sense that an artist looking to profiteer from the relic trade would create the shroud without the loin cloth, with buttock images on full display- Similarly, an artistic creation would surely aimed to unambiguously show Jesus with wounds in both hands, let alone one wrist. The Shroud image alludes to a wound on both hands by virtue of the streams of blood on both forearms, however it is hard to imagine that a artist looking to profiteer from the relic trade would be so subtleSupporting these points is that ALL the copies of the Shroud do one or more (usually all) of the following:- Show Jesus with a loin cloth- Show Jesus with both hands pierced- Do not show the body-wide flagrum marks","date":"July 11, 2012 at 9:14 AM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","title":"My critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\""},{"author":"matt","post":"Christian Art HistorianThanks, I hadn't come across that pieta statue. I have also seen a date of 1360, so not sure how reliable the dating is. Can you provide reliable source of its dating?What I can say is that most of the pieta showing Jesus's extreme suffering date from 1390 or later: Refer:http://en.wikipedia.org/wiki/Piet%C3%A0And in terms of painting, such grotesque depictions of Jesus certainly didn't become commonplace until well into the 1400s.","date":"July 11, 2012 at 7:49 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","title":"My critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\""},{"author":"matt","post":"The “No” in the beginning was supposed to be a “Now”","date":"April 20, 2017 at 3:47 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","title":"STURP: Space-age Technology Unleashing Religious Propaganda!"},{"author":"matt","post":"Hey, nice post. I got another one for ya. So I found Ian Wilson’s claim that King Abgar was reportedly in possession of a cloth that shows Jesus’ ” whole body”. People are saying the Edessa image is the Shroud of Turin. I heard Joe Nickell address this but he kinda brushed off by referring to forgers confession and carbon dating (which is an accurate date). I was hoping for a more savage debunking of that claim. As far as I can see the Image of Edessa was only a face image. Then I go read Dan Porter and he’s saying thats absolute proof the Shroud was in Constantinople in the 8th century and Edessa in 5th century. Like usual, skeptical shroud material is always in short supply. Any thoughts on this one?","date":"April 20, 2017 at 2:56 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","title":"STURP: Space-age Technology Unleashing Religious Propaganda!"},{"author":"matt","post":"Apparently this is the sermon Ian Wilson cites,Introduction# 1 A sermon by Gregory the Archdeacon and Referendarius of the great church at Constantinople, about how incredible things are not subject to the laws of praise, and about how three patriarchs have declared that there is an image of Christ which was brought from Edessa 919 years afterwards by the zeal of a pious emperor, in the year 6452 (944AD). Lord bless us. . . .. . . .But Jesus, undergoing the passion of his own free will, believing that human nature fears death – indeed death comes upon the very nature that was made to live – taking this linen cloth he wiped the sweat that was falling down his face like drops of blood in his agony. And miraculously, just as he made everything from nothing in his divine strength, he imprinted the reflection of his form on the linen. . . .# 21 He will do this straight away for us if we so desire, if we look upon the reflection and the immense beauty it is depicted with. For this is not the art of painting, which provides a door for the mind to consider the original and depicts images. This reflection was imprinted from a living original. Painting establishes a complete form with various beautiful colours, representing the cheeks with a blooming red, the encircling of the lips with red, it paints the beard with flowery gold, the eyebrow with shining black, the whole eye in beautiful colours, the ears and nose in a different way, overshadowing the flanks of the imprint with a compound of qualities and showing the chin with hair.#22 This reflection, however – let everyone be inspired with the explanation – has been imprinted only by the sweat from the face of the originator of life, falling like drops of blood, and by the finger of God. For these are the beauties that have made up the true imprint of Christ, since after the drops fell, it was embellished by drops from his own side. Both are highly instructive – blood and water there, here sweat and image. Oh equality of happenings, since both have their origin in the same person. The source of living water can be seen and it gives us water, showing us that the origin of the image made by sweat is in fact of the same nature as the origin of that which makes the liquid flow from the side .….I then went to DanPorters FAQ and I found a mix of bullshit and believable info. I thought his arguments for a bad C14 dating to be unconvincing and with his bilirubin mantra and the claim that the image is above the blood stains along with the dubious claim that Ray Rogers had discovered an invisible reweaving (lol). It just seems from someone, like me who is still learning, that Dan has it all figured out. Speaking from experience, I’ve found that people who I initially thought debunked me weren’t all that “figured out” as I thought. Is he bullshitting me? Forgive me for going on, its just I never heard of that Image of edessa and the sermon before and like I mentioned before, theres a lack of skeptical material on the net for this stuff.","date":"April 20, 2017 at 5:55 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","title":"STURP: Space-age Technology Unleashing Religious Propaganda!"},{"author":"matt","post":"No, as for the King Agbar stuff having a full body image of Jesus. Even if it is, how do they know it’s the same one. Also it’s a little sketchy that some hidden document in the Vatican library etc says blah blah blah. I laughed when I heard Porter say the c14 was “a bust” because he wouldn’t have said that if it was dated to 1st century. He just assumes Ray Rogers was right based on his vanillin “dating” with those samples they illegally gave him. Funny how these repairers didn’t reweave the burn marks but just this small area that happened to be picked for dating.Lastly, why didn’t they just do another carbon date on a place where they can all agree was original to the shroud? Repeat experiments are done all the time.Anyways thanks for your input. It just baffles me that in the age of reason, you have to dig so deep in order to find skepticism material on this stuff.","date":"April 20, 2017 at 3:20 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","title":"STURP: Space-age Technology Unleashing Religious Propaganda!"},{"author":"matt","post":"Also about the “snap crackle and pop”, I’m curious to why he says, “There is no need to appeal to miracles to explain the images. And claims that the Shroud is somehow evidence of a miracle, even specifically the Resurrection, is problematic.” although I agree given the many problems with the shroud, it just seems like he’s talking out of both sides.","date":"April 20, 2017 at 3:26 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/04/07/sturp-space-age-technology-unleashing-religious-propaganda/","cat":"turin_shroud","title":"STURP: Space-age Technology Unleashing Religious Propaganda!"},{"author":"matt","post":"I am a Catholic and don’t believe in a physical bodily resurrection. I believe in the resurrection of the “Spiritual body”","date":"August 11, 2012 at 6:57 am","url":"https://shroudstory.com/2012/08/11/yannick-clments-summa-theologica/","cat":"news_&_views","title":"Yannick Clément’s Summa Theologica"}]}
