{"art":[{"author":"matt_kowalski","post":"It wouldn’t surprise me.What is more surprising is the BBC’s 2008 documentary on the Shroud that makes a strong case for it’s existence back to the first century.","date":"April 11, 2015 at 1:25 pm","url":"https://shroudstory.com/2015/04/09/art-scholars-on-scientific-evidence/","cat":"art","title":"Art Scholars on Scientific Evidence"}],"dating":[{"author":"matt_kowalski","post":"This debate may be over over precise measurements where no precision exists.  The false color photographs are not intended to be interpreted chemically. They are subjective evidence for the non-uniformity of the shroud materials, supported by the findings or cotton in the test area.  The shape or size of a patch is not at issue. Combined with the historical evidence that dates the shroud to before 1260, and valid concerns about dating ancient textiles (e.g. British museum mummies), the point is that the C14 date is now questionable.  More evidence could be found by microscopic study of the sample area, a non-destructive test.  The coincidence of the 14th century date could just as easily be considered a case of selection bias: the labs got the date they were hoping for, so they ignored the obvious gradient in their results.  Any bachelor’s level engineering student could tell us that a gradient means the data is incomplete, and needed information lies outside the test boundaries.","date":"March 8, 2015 at 9:56 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"}],"events":[{"author":"matt_kowalski","post":"Watching Barrie on EWTN right now.  I’ve been meaning to comment on something I learned in engineering school decades ago (Northwestern).   When test results give a gradient, such as the C-14 dates of the four sample pieces, any engineer worth his salt would agree the test is incomplete.  The C-14 dates smoothly rise with linear location, i.e, C-14 content is a function of vertical location.  More tests need to be done beyond the boundary where the sequence ends, or the results are invalid. Because if C-14 is a linear function, the samples are not randomly chosen. (We all know why they were chosen there anyway.)","date":"November 6, 2013 at 9:34 pm","url":"https://shroudstory.com/2013/11/06/barrie-on-ewtn-liveand-again-in-repeats/","cat":"event","title":"Barrie on EWTN, Live–and again in repeats"}],"image":[{"author":"matt_kowalski","post":"Ordinary photographs may have some 3d information, but it is distorted by the directionality of the light source.  The relatively undistorted 3d information found on the shroud can be duplicated by photographing a white statue immersed in colored water, but the fact remains that the shroud image is different from most photographs.  One might describe it it as resembling a perfectly “light balanced” photo. Or perhaps similar to an expertly drawn NEGATIVE charcoal sketch in which the artist masterfully faded the boundaries of the figure.  I understand why Colin Berry wants to pursue contact theories, but everything he has suggested so far was tried and abandoned long ago by other researchers.","date":"August 10, 2015 at 5:22 pm","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","title":"It is really, really time to rethink what we think about 3D"}],"misc":[{"author":"matt_kowalski","post":"Wasn’t there a prize of something like $20,000 for somebody to produce a duplicate of the shroud with certain authentic properties?  offered a few years ago I recall. Randi should have claimed it by now, eh?","date":"May 12, 2015 at 11:30 pm","url":"https://shroudstory.com/2015/05/09/james-randi-visits-the-shroud-of-turin/","cat":"other_sites","title":"James Randi Visits the Shroud of Turin"},{"author":"matt_kowalski","post":"The photo hypothesis deserves credit for stirring up interest in the unique image properties.  But besides the problems Prof Porter mentions, there is also the fact that the shroud image is not made up of various shades as a monochrome photo. It is shaded like a pencil or charcoal drawing, made entirely of a uniform dark color dispersed on a light background. And yet it has detail similar to a photo, which would take an amazing artist to pull off.  A second problem is the lack of light directionality in the shroud image. This is easy to see by comparing it to the well-known “photo shroud” made by Prof. Allen.  The photo image shows overexposure on the feet and shadows cast by other physical body parts.","date":"April 6, 2015 at 10:07 pm","url":"https://shroudstory.com/2015/04/06/one-that-comes-to-mind-is-a-favorite-photographer-around-here/","cat":"uncategorized","title":"One that comes to mind is a favorite photographer around here"},{"author":"matt_kowalski","post":"Yes you have misunderstood me, but only to the degree that I don’t have the technical language to describe precisely.  The difference in the shroud’s shading and Allen’s photo is easier to understand by comparing the images, both macro and microscopic.  I would refer readers to the analysis of experts rather than try to explain it here.  I completely agree with your historical critique of the photo hypothesis. But there are important distinctions to be made about the images also.","date":"April 9, 2015 at 8:19 pm","url":"https://shroudstory.com/2015/04/06/one-that-comes-to-mind-is-a-favorite-photographer-around-here/","cat":"uncategorized","title":"One that comes to mind is a favorite photographer around here"},{"author":"matt_kowalski","post":"Some of what I wanted to day is best explained by Barrie Shwartz over at the shroud.com site.  http://www.shroud.com/pdfs/orvieto.pdf","date":"April 9, 2015 at 8:33 pm","url":"https://shroudstory.com/2015/04/06/one-that-comes-to-mind-is-a-favorite-photographer-around-here/","cat":"uncategorized","title":"One that comes to mind is a favorite photographer around here"}],"resources":[{"author":"matt_kowalski","post":"About 25 years I saw a big coffee-table style book  in a store about the most influential people in history. can’t remember the author or exact title. They had Mohammad number 1 and Isaac Newton as 2. Jesus was 3.  They gave a reason for this, but it was obvious anyway that “the fix was in”. I was still young enough at the time to be learning about anti-Christian bias in certain cultural circles.","date":"December 21, 2013 at 12:00 pm","url":"https://shroudstory.com/2013/12/19/how-the-shroud-becomes-part-of-the-conversation/","cat":"books","title":"How the Shroud Becomes Part of the Conversation"},{"author":"matt_kowalski","post":"Joe Nickell has been repeating his schtick about a rubbing from a bas-relief for at least 20 years now. You would think in 20 years he should be able to make an image just like the shroud himself, if it is so simple.  Isn’t there even a monetary prize offered by someone?","date":"March 19, 2015 at 10:09 pm","url":"https://shroudstory.com/2015/03/09/crocumentaries/","cat":"article","title":"Crocumentaries"}],"researchers":[{"author":"matt_kowalski","post":"As I read Freeman’s essay I respected him for at least trying to be scientific.  But it did seem he was arguing from his desired conclusion.  I’d like to see examples of how woodcut printing on cloth was done.  Are there any examples of ink that left a chemical change on a cloth resembling the shroud?  Colin Berry shows integrity in this case, even if his style is more snarky than is needed.","date":"February 23, 2015 at 11:58 am","url":"https://shroudstory.com/2015/02/23/catching-a-wonderful-response-to-charles-freeman/","cat":"uncategorized","title":"Catching a Wonderful Response to Charles Freeman"}],"sudarium":[{"author":"matt_kowalski","post":"I wonder if the sudarium has ever been tested for pollen, as Max Frei tested the shroud?  If one excepts Frei’s pollen claims, that creates a problem for the carbon dating.  We know the shroud’s location since 1355 and it never was in the Holy Land.","date":"April 6, 2015 at 10:11 pm","url":"https://shroudstory.com/2015/04/06/new-paper-on-the-sudarium-of-oviedo/","cat":"sudarium","title":"New Paper on the Sudarium of Oviedo"}]}
