{"researchers":[{"author":"mayap","post":"I was very happy to see a paper by a Ph.D. on this topic! It is amusing that the topic of historical rigor is being questioned here when the author of the article is an historian! Anyone familiar with academia understands the difference between how scientists assess physical evidence and how historians reconstruct history. Historians deal with levels of possibilities and probabilities and rarely have access to evidence that is “beyond reproach,” especially in relation to ancient historical figures like Jesus. That is why different historians will interpret the same data differently – no matter how “rigorous” they are. I think the point of Dr. Joseph’s paper is that the physical evidence of the Shroud, in conjunction with the problems of the 1988 test and new research findings, makes the case for a first-century date much stronger.","date":"August 29, 2012 at 6:49 pm","url":"https://shroudstory.com/2012/08/26/barrie-schwortz-announces-latest-changes-to-the-shroud-of-turin-website-stera-inc/","cat":"news_&_views","title":"Barrie Schwortz Announces Latest Changes to the Shroud of Turin Website (STERA, Inc.)"},{"author":"mayap","post":"Yannick Clément :I agree mostly with what you say.  Of course, history is different than a hard science like physic or chemistry.  But I think there is often a common base among credible historians about some accepted historical facts and it is on that base that the hypothesis should be built.  Also, it is important to note that other scientific fields can be called in to back up some historical hypothesis.  In the case of the Shroud, it’s risky (scientifically speaking) for an historian to call it to back up the historical Jesus case because it’s scientifically impossible to get a 100% sure match between the identity of the man of the Shroud and Jesus of Nazareth.  There will always be some door left open for the possibility that the man could have been the unwilling victim of a forger who wanted to produced a false relic of Christ while using a real body to do so (first possible scenario that you can find in my recent paper) and also for the possibility that the man of the Shroud could be a real crucifixion victim of the Romans other than Jesus but who suffered the same tortures than him (second possible scenario that you can find in my recent paper).If I was an historian, I would avoid relying on the Shroud to back up the case of the historical Jesus.  Of course, it could be mention in an article on the subject but it should not be consider as some kind of proof that can back up the case.  Potential proof, yes.  Unquestionable proof, no.Ok, let’s be clear here – historians and scholars do not “need” the Shroud to prove the historical existence of Jesus. The point is that there are many things about the Shroud that have yet to be adequately explained or accounted for – like the image itself, how the blood was applied, etc – and these features are consistent with our understanding of Jesus’ crucifixion. But again – historians do not need the Shroud to prove the existence of the “historical Jesus.” It may end up being more the case that we need the “historical Jesus” to explain the existence of the Shroud!","date":"August 30, 2012 at 2:46 pm","url":"https://shroudstory.com/2012/08/26/barrie-schwortz-announces-latest-changes-to-the-shroud-of-turin-website-stera-inc/","cat":"news_&_views","title":"Barrie Schwortz Announces Latest Changes to the Shroud of Turin Website (STERA, Inc.)"}]}
