{"art":[{"author":"menedemus","post":"The crucial point, in support of David Mo’s clear summary of the issues, is that it had been normal practice since the sixth century at least , to bury a body with its hands crossed over the genitalia. This was true for both men and women. So if you are Benedictine monk  in an enclosed order making an illustration of the burial of Christ, you would simply copy the method of burial you have seen around you. (There are lots of examples from cemeteries so we are absolutely secure on this.) You did NOT need to copy it from the Turin shroud because you would have seen actual examples of bodies being wrapped up just like this.They are giving Jesus a typical Christian burial, using examples, of course, from the gospels for the figures who are doing the anointing.And we must get away from the idea, that seems to be accepted without anybody thinking about it, that the Turin Shroud would have been  thought to be something special. Goodness knows in Constantinople, you have far ,far better relics around- a big fragment of the Cross was the top Constantinople relic, taken out and about in the streets in a grand procession every year,  and second to that was the holy icon of the Virgin Mary painted by Luke which,when taken out on the walls, had saved the city from being captured. Then there is the robe of the Virgin Mary that one of the emperors would put on to give him protection when he went out of the city to negotiate with Byzantium’s enemies.Then there is the Mandylion which is of the living face of Christ so it cannot be the same as a large piece of cloth with the figure of a dead naked Christ (sorry, Mr. Wilson).  There are lots of documents about these and all we have is ONE mention by Robert de Clari of an image on a cloth in the Blachernae Chapel which might or might not be the Turin Shroud.If someone decided to paint a relic from Constantinople ,it would be very strange for them to choose the shroud when there were so many more more famous ones to choose from.They say that there were 3,600 separate relics in Constantinople and the Turin Shroud would be nowhere near the top!  If it had been we would have had MORE documents about it and they surely would have said that it was a double image, not just an image.","date":"June 18, 2012 at 1:48 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"menedemus","post":"Thomas de Wesselow was once a reputable art historian. His credibility has been shattered by the ‘The Sign’ as you will see a) by the range of reviews it has got b) by the embarrassed silence on the part of the art history establishment since it came  out. In his pages on the Pray Codex he does little more than repeat some speculative ideas by others- he nowhere adds any significant reason for seeing the Shroud in the Codex.It is sad that Professor Lombatti’s detailed analysis of all these issues  and his full rebuttal, point by point of Ian Wilson’s history,has not yet been translated into English. But Lombatti is already being condemned by all and sundry on the basis of a newspaper report of an article he is due to publish in one of the most prestigious medieval journals around. But, hey, what does a Professorship in these issues count for if you are from Italy- probably as a sophisticated a place to study medieval history as anywhere- if there are all these US/UK experts who already know the truth about relic cults, Byzantine art, medieval depictions of the entombment, medieval Greek and Latin, etc. etc, areas which normally take years of full time study to master, certainly if you are going to be awarded a professorship.","date":"June 18, 2012 at 9:32 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"menedemus","post":"Until you can show a large shroud with a double image on it on the Pray Codex ,you are not going to persuade anyone outside the Shroud community that this is a representation of the Shroud of Turin. Readers of this blog may be convinced that they can ‘see’ it , but don’t expect to convince anyone else especially as no one defending the Codex on this blog has shown that they have any expertise in the history of art and there are lots of questions as to why a relatively obscure ( compared to the other more  prestigious relics held in Constantinople) relic should be illustrated by anyone in the first place. Burial shrouds were never first rank relics at any point in the Middle Ages and  no one here  has come up with an original academic article making the case for the Codex showing the Shroud.It is the same with Professor Lombatti’s article- it is a pity that it was released through a newspaper because comments on it  should be avoided on it until the original, which will be published in a prestigious academic journal, is available  and one hopes then that it is subject to any criticism it deserves from people who have the same academic credibility and experience as Professor Lombatti. One can study the Shroud for years on end but if one does not have a basic background in medieval art or history, then you are hardly likely to say anything of importance. There is still no clear DOCUMENTARY evidence that an academic historian would accept for the existence of the Shroud before 1350. I leave ti to the scientists to argue if there is any SCIENTIFIC evidence in the Shroud existing earlier that the medieval period","date":"June 18, 2012 at 4:40 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"menedemus","post":"Of course, I agree with you about Wilson and I am sure that gradually people are realising that his views are accepted by no one other than himself. But it will take time because he has sold so many copies and not enough people have read the arguments against his views.BUT Yannick, you can find earlier artworks, starting from the 4th century in any history of Byzantine art which show how the idea of a fully frontal figure,first the emperors (many scholars place the fully frontal image of Constantine on the Arch of Constantine in Rome (AD 315) as the first), then Christ in the same pose evolved. You can also look at the coffin lids of Egypt where the living faces of the deceased are placed on the wood of the lid  (and these go back  even earlier) and again scholars see these as  the inspiration for the faces on icons. These are real images in wood or marble and they can be easily copied and you can trace a tradition in art directly from them.  The Turin Shroud, on the other hand shows a man who is dead and has marks of suffering so this does not look like a model which has been copied. What date do you think the copying began?I repeat ‘There is no no known case in art history so far as I know where a relic has started off a new school of art!!’  I think you must make your case a lot stronger before it becomes believable.","date":"June 19, 2012 at 9:05 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"menedemus","post":"Hear, hear, David. I cannot understand how Wilson has got away with his bizarre idea that Byzantine art began in the middle of the sixth century for so long. (Of course, most people know that and just don’t take him seriously as a historian or art historian , but it still goes on being repeated. )  Does anyone seriously think that they found the Turin Shroud , were so excited by whatever they could see on it, that they started a whole new genre of painting., with the dead face of the Shroud being transformed into the living face of the Byzantine icons of Christ.David is making the point, that perhaps no one dares to say,  that the Turin Shroud is more likely to be a copy of a Byzantine icon than the other way round.There is no no known case in art history so far as I know where a relic has started off a new school of art!!I think Hans Belting( and he really is an expert) argues that the Shroud is actually a medieval copy of an older Byzantine image which explains why it has so many Byzantine characteristics.I want to keep an open mind on the Shroud- after all so long as Christ was a historical person who was crucified ( and i strongly believe he was), he would have been buried in a Shroud. I am just against making up stories that , like the Byzantine art began in the mid-sixth century one, that are plain nonsense and can easily be refuted. People can believe what they like, it is when such stories get out on websites and repeated in such a way that readers think that they are accepted by mainstream historians  that they need to be refuted. David has done good work here in keeping everyone’s feet on the ground!","date":"June 19, 2012 at 5:13 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"menedemus","post":"Well, Yannick, I remain to be convinced but I admire the depth with which you do your research. I think the mechanism by which the transmission from cloth to icon would have taken place would be quite difficult to establish.Of course, everyone working in this period has such a lack of sources!","date":"June 19, 2012 at 11:47 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"menedemus","post":"I’ve missed something . Can someone please give me the comment number here that explains how you know that the red zig-zag lines , which I assumed were part of the decoration on the tomb lid  in the space between the separate sudarium and the Shroud held by the angel, actually show blood.Have you also the latest on whether the blood on the Shroud is AB ( this used to be argued but I haven’t seen it recently) and is there anyone who can follow that by making comments as to whether, if the blood on the Shroud is authentic, how the blood relates genetically to the blood of Jesus’ ‘parents’?","date":"June 20, 2012 at 11:11 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"menedemus","post":"Thank you both for the information. It is a pity that the art work on the Codex is often so indistinct that it is hard to be certain what its inspiration was. Cautious as I am by nature, I am,= not convinced that the Shroud is there, partly because I do not understand why anyone would want to copy it without making it very clear, from the size of the cloth and the double image, what they were wanting to show their audience.I have seen no good reason why this has to be a secret or symbolic picture of the Shroud.","date":"June 20, 2012 at 1:54 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"menedemus","post":"ArtScience. Thanks for this information and your thoughtful analysis. Please may I say that when there are so many strange postings on this subject and quite a lot of name-calling, that it is good to find someone who is trying to actually work through the issues! The question remains, and has been raised by others during these discussions – is why  the Shroud has to be concealed in this way. If, and there is not enough evidence to be sure of this ( I am being cautious again) , Robert de Clari is describing the Turin Shroud in the Chapel at Blachernae in 1203, it shows that there were no inhibitions about  unrolling it so that the full image could be seen. This was the common practice of course, people wanted to see the relic fully exposed. We do have an illustration of the Crown of Thorns in Paris being shown to the crowds from a tower. So why not show the Shroud more clearly?On Stephen Jones’ blog, there was some statement about the authorities in Constantinople not authorising the Shroud to be shown in full but  no Catholic ( and it is assumed that the illustrator of the Pray Codex was a Benedictine monk) would have taken any notice of any such decree from the schismatic Greek Orthodox Church. Look at what happened just a few years later in 1204- the Crusaders just grabbed what relics they could from the Greeks and took them back to Europe. Many said that it was God’s will that they should do so!Yes, mysteries are fun – so long as one keeps one’s feet on the ground -it is a pity that the surviving sources are so few.Do not worry about Max Patrick Heron We have been trying to get him to explain himself more clearly -at present he is adding nothing to any argument but seems to live in some kind of cryptical world of one-liners followed by typo corrections. There is nothing here that can persuade anyone of anything and perhaps if we keep on making the point he will even realise this himself.N.B. Menedemus is a character in one of Erasmus’ work on relics who was a loyal Catholic but sceptical of the relic cults  he saw around him in the 1520s. Not to be confused with an obscure Greek philosopher of the same name!","date":"June 21, 2012 at 4:11 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"menedemus","post":"We will have to wait to see what Lombatti is actually arguing in his article when it comes out but I wonder whether (perhaps a mistranslation from the Italian), the word ‘copy’ is the right one to use. It may be that there were a large number ( forty perhaps) of cloths claiming to be the original burial shroud. This is ,of course,typical of medieval relic cults in general and not a large number when you remember how many pieces of the Cross, thorns from the Crown of Thorns, the six or seven heads of John the Baptist,etc.were around. Europe , especially if you include the Byzantine empire, was a large place, communications were very poor and individual communities would develop their own cults ,often unaware that three or four hundred miles away, another shrine would be claiming to have exactly the same relic as they had. Even if you knew of your rivals ,you would still develop a legend to show why yours was the real one!  So are we really talking about COPIES here or simply alternative versions of shrouds  each claiming to be the authentic one.I don’t know the original source for ‘the forty’ but i am certainly not surprised to hear of forty different places each claiming to have the original shroud. It fits well with what we know of medieval relic cults in general.","date":"June 21, 2012 at 10:11 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"menedemus","post":"Thanks, ArtScience and David Mo. Yes, this is a basic issue that you have pinpointed, David. We have lots of  different versions of the same relics ( not just shrouds,of course),  but we simply do not have clear enough descriptions to be able to trace the fate of each and, in the case of the many shrouds.etc which of them might or might not relate to what we now know as the Turin Shroud. Recognising this is an important step forward because all too often even the most obscure reference to an image on a piece of cloth is assumed by enthusiasts to be a reference to the Turin Shroud. This is not good history. I share David’s scepticism over the Pray Codex. While the writer of the latest posting on this blog (just posted, 22nd June)) is convinced by the evidence, i am of the the school that you really do need a lot more evidence before making the kind of assertion. As the key feature of the Turin Shroud is the double image, I start from the assumption that unless this is clearly shown in an illustration or directly referred to then I am not buying. As seems to have been established in other discussions here , the  idea only came from Ian Wilson and no one was ever able to produce a peer-reviewed research paper by an art historian which has backed the idea. (Not too late, if anyone knows of one!- de Wesselow adds nothing of importance in The Sign)What has been surprising is the number of enthusiastic supporters of the ‘Pray Codex shows the Shroud school’ who do not seem to have even the most elementary knowledge of medieval art. David and others have done a great job in opening up the subject and showing that you really do need to know quite a lot about illustrations of this period before you start making the kind of dogmatic statements some people here and on a neighbouring blog have been making.I am on the fringes of this world but know of academics who have spent years of their lives studying these issues -yet here we find all kinds of pseudo-experts telling exactly what we SHOULD be seeing in what is a rather low-quallity illustration of a well-known gospel scene, made by a Catholic Benedictine monk of a possible relic held by schismatic Greek orthodox Christians. Just too far-fetched to stick with me.There are two points I will conclude with. Not necessarily relevant but may be taken up.1) Whether the Turin Shroud is 650 or 2000 years old, it is an important artefact, a rare piece of cloth and a rare piece of art because of the difficulties in defining how it might have been made. If it had been a work of art of say 1300 ,the age of Giotto, imagine how it would have been treated for further examination/ conservation. There would have been a long period of examination in controlled conditions before anyone even thought of doing any work on the surface. I don’t need to repeat the sorry story of how the Turin Shroud has been treated  -virtually every basic procedure for dealing with an item of this age and vulnerability has been ignored.  I am sure people thought they were doing the right thing but far too many people who had absolutely no training in the most basic of conservation techniques were let loose on the Shroud, and even allowed to take off substances from it. The chances of every really finding out how it has been made are certainly diminished as a result. The substances detached  from the Shroud are floating around the world, it is not even clear who controls them (at the very least they should all be returned to one conservation laboratory, probably in Italy so that a team of textile experts can work on them in one place).  I have even read of one enthusiast who has managed to get hold of part of the Shroud which he treats as a relic. It is a shocking story of how not to treat medieval ( or earlier) art.2) The Protestant reformers had a point ( although I deplore the way they destroyed relics).All too often a relic became more important than Christ and the scriptures. Some pro-Shroud supporters come across as more attached to the piece of cloth than to the man who may, or may not, have been laid in it. Not healthy, and probably idolatry ( see Ten Commandments) rather than Christianity.","date":"June 22, 2012 at 6:30 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"menedemus","post":"Davor. I notice that on your link Andrea Lombatti has given the reference to his own article on this issue. It is much more comprehensive than Averil Cameron (who, as one of the finest Byzantine scholars in the world, has better things to be spending her time on) and deals with all the points, refuting Ian Wilson and his supporters in particular. I think you overestimate the amount of support Wilson has – do any of these ‘scholars’ hold an academic position in Byzantine/medieval history or literature? I think you will find not. Lombatti’s article needs to be in English. I hope it will be translated soon.  Anyone relying on the 944 sermon by Gregarius ( a typical welcoming of a relic to a new home sermon) needs to quote from the early part of the sermon where Gregarius makes it clear that not only is he looking at a cloth with just a face on it  (of Christ, of course) but that this cloth was given by Jesus, after he had wiped his face with it ,in the garden of Gethsemene  to the apostle Thomas who then handed it to Thaddeus who then, of course, keeps it and brings it to Edessa. So, as far as Gregarious is concerned, the cloth by-passed the tomb altogether. This is the clinching point. The sweat of Jesus is thick ‘like blood’ – i.e. it is not actually blood  and the point Gregarius is making about the wound in the side, although rather theologically obscure is that the water of the sweat is similar to the prestigious water that flowed, on a later occasion at the Crucifixion, from Jesus’ side alongside blood. It is for that reason that  the Image is to be honoured.In fact, the first part of Gregarius’ sermon is one of the best pieces of evidence we have that the Image of Edessa/Mandylion that Gregarius was welcoming to Constantinople was not a burial shroud. Here is the relevant passage. Gregarius is telling his congregation  the story of the Image of Edessa by narrating the events by which it came to Edessa. Thaddeus has arrived with the Image in Edessa and the story goes on:‘And Thaddaios answered [to king Abgar], “When Ananias [ the messenger of Abgar], who you entrusted the letters to, said in hope that apart from your health, you also wished to look upon the likeness of his [Christ’s] face as it was seen, Jesus told him to come quickly to you with the letter, in which he promised to send you one of his disciples after his ascension, and I [Thaddeus] am that disciple. But Jesus, undergoing the passion of his own free will, believing that human nature fears death – indeed death comes upon the very nature that was made to live – taking this linen cloth [i.e. the Image of Edessa that Thaddeus is holding] he wiped the sweat that was falling down his face like drops of blood [note ‘like drops of blood’, not actual blood!]  in his agony. And miraculously, just as he made everything from nothing in his divine strength, he imprinted the reflection of his form on the linen.When he came down the mountain after praying, he gave it [ the cloth] to Thomas, one of my fellow disciples, as I was not there. He [Christ] told him to give it to me [Thaddeus], so that after the ascension I could bring it to you.’And anyone who still thinks that Gregarius is talking about a burial shroud needs some serious help. There is, of course, as you will find when you read Lombatti’s article, a mass of other evidence making it clear that the Image of Edessa is not a burial shroud.There is also an article by Charles Freeman- found online ‘Charles Freeman Shroud of Turin’- that shows how tetradiplon refers to the method by which the Image of Edessa was folded for storage in such a way that the face of Christ was not folded.","date":"June 22, 2012 at 9:15 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"author":"menedemus","post":"Are you saying that the Santa Pudenziana Mosaic is showing the Turin Shroud? So where was the Turin Shroud in 400 AD ? In Rome? Please explain what your argument is for those who don’t live in the cryptic world of yours but just look at art works as they are.","date":"June 15, 2012 at 1:15 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"}],"history":[{"author":"menedemus","post":"Domenico- well, you need to read the article to get his full argument- it is not hard to find.Freeman suggests that the only way to fold the Image of Edessa without concealing or folding over the face of Christ is to have each of the four sides  of the Edessa image folded back under itself to make a smaller cloth for storing which would leave the face intact at the centre, in other words ‘four double foldings’. He says  that a cloth of 4 by 4 would be reduced to one of 2 by 2 with the face still exposed  at the centre. So the Image of Edessa could be stored in a box and then viewed when the box was opened without having to unpack it.So you wouldn’t need Wilson’s elaborate theory about folding up the Turin Shroud. I haven’t seen anyone comment on Freeman’s argument so far but as Davor clearly has done a lot of work on tetradiplon his comments would be especially valuable, here or on his blog. It may be that when you get back to the original documents where the word tetradiplon is used,that they don’t support Freeman’s argument but,on the surface, it seems to have more going for it than Wilson’s.","date":"June 25, 2012 at 3:40 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"author":"menedemus","post":"And see the article by Charles Freeman ‘The Shroud of Turin and the Image of Edessa, :A Misguided Journey’ which also deals with some of these issues.e.g the tetradiplon idea and the strange story of Arculf in Jerusalem- easy to pick up online.","date":"June 24, 2012 at 5:46 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"author":"menedemus","post":"Well done, Davor, for cutting through  the fantasy world that has pervaded this part of Shroud studies for too long. It is astonishing what some people have read into non-existent documents and in some cases, statements have been made that  border on the fraudulent in that a careful reading of the documents  show the OPPOSITE of what is claimed. (There are too many cases where whole part of documents that contradict a case have simply been ignored, so one wonders whether there is deliberate deception in some cases. No names!)  Gregarius’  944 sermon, for instance, makes it quite clear, in the opening parts, that the image of Edessa which he was welcoming to Constantinople,  was, according to the legend that Gregarius believed, given by Christ to the apostle  Thomas while he (Christ) was still alive and then passed on from Thomas to Thaddeus (and then to Abgar). Gregarius makes it absolutely clear that the Image by-passed the tomb altogether and yet that sermon is often quoted as it if referred to a burial shroud aka the Turin Shroud. Keep up the scholarship!Jesus Christ existed, he was undoubtedly crucified and buried. So once a burial shroud existed. Did it survive is the question. I have said elsewhere in these posts that some Shroud enthusiasts seem to venerate the Turin Shroud more than the man who may or may not have been wrapped in it.","date":"June 23, 2012 at 12:05 pm","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"author":"menedemus","post":"Max, Can you please be constructive for once! You pile on these endless comments but as no one knows what your own take on the Shroud they are completely meaningless to all of us. You are quite clearly the world’s greatest expert on a number of arcane subjects but this matters nothing if you cannot communicate clearly. Calm down, clear some space, give a full version of what your own version of the Shroud’s history is. Cut out the abuse of everyone who has not yet reached your level of expertise -it adds nothing to what is potentially an important discussion of Wilson’s work.I am sure your definitive version  can be posted up somewhere for those interested enough to read it. Thanks.","date":"June 26, 2012 at 8:06 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"author":"menedemus","post":"Max says “I am definitely not trying to write a research paper. here. Just passing/bombarding comments in snatches while working….”And, as a result, wasting everyone’s time. Is there any way of making it clear to you that no one knows what you are talking about for most of the time and so your comments have no value whatsoever. Please think for yourself: “What am I hoping to achieve by entering all these comments’. Somewhere, there does need to be a proper debate on Wilson’s history and Davor’s articles , to which the links are provided , are a good place to start.","date":"June 27, 2012 at 3:54 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"author":"menedemus","post":"We have no clear way of knowing whether the Blachernae Shroud mentioned by Robert de Clari in 1203/4 is the Shroud of Turin. It is a single reference and not precise enough to make the connection for sure (e.g. one would expect some reference to the double image). The fact that there is no other mention of this shroud by sources within Constantinople itself ( a city which provided quite a lot of lists of relics) suggests it was not considered among the more prestigious relics of the city.However, we know the Blachernae relic collection was first built up in the fifth century and we know that under the auspices of the imperial family, many relics came direct to the chapel from Jerusalem which  was still  directly under Byzantine control. The link between the two cities was considered very important after the empress Helena transferred two nails from the Cross to Constantine himself as the time of the city’s foundation in 330.So ,and this is pure speculation, the Blachernae Shroud may have come direct from Jerusalem in the fifth century and remained in the Blachernae Chapel ever since then. It was just not considered important enough alongside the very prestigious relics Constantinople had, for it to be mentioned in a relics list before an outsider, de Clari, saw  it. I just put forward the idea as one which as likely as others suggested here and certainly much more likely than the highly convoluted theories of Ian Wilson!  There s no question that that this could be the Mandylion moved without any documentary evidence to the Blachernae Chapel between 1201 and 1203. These translationes were major public events and it would have been recorded- after  all the Mandylion, unlike the Blachernae Shroud, was a top class relic.","date":"July 1, 2012 at 5:08 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"author":"menedemus","post":"Davor, Thank you for your response. I suspect that we are not that far apart and you deal with the motivations of those arguing for the authenticity of the Shroud very well. As you say, most contributors have no background in the enormously complex world of Byzantine texts, where legend and history mingle and there are immense linguistic problems as well. I m not a scholar here but have immense respect for the scholarship there is.  I wonder sometimes if some of the contributors to Shroud blogs know ANYTHING about the years of patient study of Byzantine art and language the experts have undertaken. Yet some Shroud enthusiasts are prepared to make the most authoritative statements about the meaning of difficult texts e.g. the Twin Pearls or the iconography of the Pray Codex. The debates here often gave the impression that the Pray Codex was the only entombment scene some convinced commentators had ever seen!‘Deceitful ‘ may be too strong but I think that if a contributor quotes from a document in support of their case for the authenticity of the Shroud or whatever when the full document they quote from actually says something very different, this kind of selective quoting does border on the deceitful. But I will name no names. And remember, and here I am NOT talking specifically about Shroud studies, some pseudo-historians have made a lot of money by jumping on bandwagons in the knowledge that their readers won’t check out the original documents. Try the world of the Pyramidiots!I wonder if you recognise my pseudonym from Erasmus’s A Pilgrimage for Religion’s Sake. In this dialogue, Menedemus appears as a Catholic sceptic about the relic cults of his day but quite a gentle one I like to think.","date":"June 24, 2012 at 6:07 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"author":"menedemus","post":"Mario.  ‘Can easily [sic!!] be answered’. Well, there are seven questions here in the first para and only documentary evidence for one- the transfer of the Image of Edessa. The rest are highly dubious speculations and most seem to be very unlikely. Wilson’s argument is a very precarious pile of cards,only one of which needs to be removed for the whole lot of fall down. This is not history as it should be done.Mario : ‘It is likely that many confused the Shroud and the copies of it shown as the “Mandylion”.’ I am not surprised!!","date":"June 29, 2012 at 3:03 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"author":"menedemus","post":"The nature of the replies to Davor makes his own point for him. The fact that some amazing space and nuclear programme scientists worked on the Shroud means absolutely nothing because ancient textiles was not a field in which they were trained to work.I am happy to be corrected by Davor but having worked on the sidelines of similar issues it seems to me that if you want to carry out a research programme on an ancient textile or a fourteenth century painting or whatever.1) You have to have proper laboratory conditions set up for an examination so that the artefact can be moved there and there can be no further deterioration or contamination from other substances.2) You have a full examination of the object before you do anything, especially if you want to remove pigment or other substances.3) You assemble a team of experts covering a variety of disciplines- it is important someone is in charge who can judge on the quality of each member of the team and make sure that the problems you have identified on your preliminary examination can be dealt with.4) You don’t expect to work under pressure of time.5) Samples are removed with extreme care and only when essential and are only allowed to leave the laboratory if another specialist laboratory has equipment that you don’t have.6) Intervention is minimal- of course, a great problem with the conservation of pictures .One day the story will be told of how it was possible for a self-selected group of nuclear physicists to get access to the Shroud in 1978, not to have had any preliminary physical examination of it before they began research on it, were able to examine it in a draughty hall with nuns on hand to cut off the backing cloth, to improvise the examination within a very short time span of 120 hours, to remove samples and take them out of the system, to have a completely disorganised method of distributing the samples around once they had been taken back to the States ( Who actually owned and was responsible for these possible substances from the body of Christ?). It also seems that there was a preconceived idea of what would be found.When the samples were sent off to Walter McCrone’s laboratory,  Ian Wilson in his latest, 2010, edition of the Shroud , notes on p.92, how the apparently brilliant McClone (who had  worked on Yale’s Vinland Map) was selected for the analysis of the samples and goes on ‘The expectation ( not least on my part) was therefore that by some equally brilliant feat he might be able to show the Shroud to be authentic’. Further comment unnecessary! Of course, as is well known, McCrone came up with a mid-fourteenth century date to the horror of the team.  Then Wilson tells, us, p.92 , ‘With the benefit of hindsight, the STURP [this was the self-selected US work team on the Shroud]were probably far too undemanding  in their sample requirements. Their ‘light touch’ sticky tapes did little more than kiss the Shroud’s surface’.  Well, that is one relief -who knows what irreversible damage might have been done with ‘real’ sticky tape?.So far as one can see there are still samples from this 1978 raiding expedition around and they can still be handed around but only  it seems, after the McCrone episode to people who will back the Shroud  is authentic point of view . Needless to say the samples are pretty worthless from the scientific point of view by now and there does not seem to be a single hint from any of the samples that we have a first century artefact. Davor has explained the immense difficulties in linking a historical narrative which takes the Shroud back to the first century. As he says, surely correctly, it is not impossible that the Shroud is authentic, simply that Wilson et. al. have not yet come up with any usable  evidence to suggest that it might be.It would have been better simply to have a traditional ‘Veneration of the Shroud’ guild and have kept the science out of it altogether. It is pretty worthless and the latest idea to offer a £15,000 prize for explaining how the Shroud ‘s image was made makes no sense  unless the Shroud is allowed to be properly examined under laboratory conditions and the samples taken from it that are still floating around returned to the examining laboratory. Perhaps the £15,000 can be diverted towards paying for this! The answer may well come back that in the present state of knowledge  we don’t know how the image was made but with further scientific advance it might well be in the future. In the meantime ,don’t fret. Keep to your traditional faith in Christ as a human/divine being and stop worrying so much about any physical objects that might have survived from his lifetime.","date":"July 1, 2012 at 12:33 pm","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"author":"menedemus","post":"DaveB. The single description we have from Robert of Clari of the Shroud on the Blachernae Chapel is not precise or accurate enough to day that it is the Turin Shroud, rather than one of the many other burial cloths of the period.  (There  was even another in Constantinople itself- the cloths in the Pharos Chapel!) The most we can say is that ‘ there is a possibility that this was the Shroud but we would need to know more’- a reference to a double image would be a help, of course.The real problem is that we have no references to this Shroud from Constantinople sources itself when we do have a lot of documentation about many other prestigious relics of the city. The implication is that this was not considered by the hierarchy of Constantinople itself a very important relic. IT could possibly be that that it is the Shroud of Turin but was simply not given much importance. The elevation of the Shroud of Turin  as a major relic is a twentieth/ twenty-first century phenomenon,of course. Burial shrouds ranked pretty low down in the hierarchy of relics of the Passion in the medieval period.","date":"July 1, 2012 at 4:40 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"author":"menedemus","post":"Surely the important point is that any serious study of the texts describing or failing to describe the variety of cloths with or without images, purporting to be the living face of Christ or not, can only be done by someone with a in-depth knowledge of the Greek original texts. What surprises me about Wilson is that although he has been apparently working in the field since 1978, e.g. 34 years, there is not a hint in any of his works that he has bothered to learn Greek in all this time. i may be wrong but if he does know Byzantine Greek he conceals his learning carefully.As the Byzantine scholars who have bothered to work on the Shroud texts have also shown there are also spectacular misinterpretations or distortions of the original texts by members of the Shroud community.The response seems to be to rubbish the academics, partly ,of course, because few from the Shroud community have the academic skills to challenge them. So sadly the debates which might be productive end in angry stalemate .","date":"June 30, 2012 at 5:32 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"author":"menedemus","post":"Ron: ‘The balance of evidence from all reputable studies points this Shroud in the early period of the first mellenium, not Medieval.’ I,for one ,would  love to know where to find this evidence, please give me some clues.‘ The early period of the first mellenium [sic] ‘doesn’t get us very far, of course, because the only date that counts is  AD 30 give or take a year or two .","date":"July 1, 2012 at 12:41 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"author":"menedemus","post":"Ron. ‘Wilson on the other hand, doesn’t need to understand Byzantine Greek as he uses Byzantine scholars to do this work, …’Well ,so long as no one takes him seriously as an original scholar and he does not distort or misrepresent what the scholars actually say that is fine. But  I have yet to hear of any Byzantine scholar who endorses his view that the Shroud of Turin is the same as the Image of Edessa. The problem is that be seems to go far beyond the cautious findings of Byzantine scholarship and develops theories largely on his own initiative.Ron : “One does not have to be an historian or a scholar to understand simple things like why the Shroud of Christ ‘IMAGE’ was not mentioned in scriptures or by early church fathers, atleast not openly mentioned.” I beg to differ, Ron. These seem to be to be very complex scholarly issues- the world of early images, as no doubt you will know from your close reading of the work of Hans Belting- is a  very difficult area.I don’t think the ‘antiShroud community’ as you persist in calling them, insist that the Carbon14 dating is carved in stone. Most of them are independent scholars and have the natural caution of scholars. A typical position might be be that a medieval dating (perhaps some decades earlier than 1250 if there was genuine contamination that affected the date)  is the most likely possibility but needs further work on it.  As  I understand Christopher Ramsey from Oxford  ,et, al, it is that there is enough debate to justify a re-resting but Ramsey still, as I understand  it, thinks a medieval date will be the result again. The issue rather is that no one has come up with any evidence that a renewed Carbon -14 dating is likely to come up with a first century dating.Until they do, a preferred date somewhere in the Middle Ages is likely to have most of the scholarly consensus, not because these scholars are rabid atheists but because they are scholars working on the balance of probabilities from the evidence they have.","date":"July 1, 2012 at 4:25 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"author":"menedemus","post":"Ron, well I just did a very brief search on the exposure of linen and cotton in one scientific report and the summary ran as follows:‘Flax and cotton, for example, are very susceptible to attack by bacteria under humid conditions and seldom survive in archaeological environments. All textiles are deteriorated by light, insects, microorganisms, and air pollution which, alone or together, cause considerable loss of tensile strength and pliability. The oxygen in the atmosphere affects all organic substances to varying degrees. Prolonged exposure to normal atmospheric conditions will cause textiles to weaken and disintegrate. The speed of the deterioration varies according to environment and the nature of the fibres’I think we would have more examples of ancient linen , outside the very special conditions of Egypt, if it was quite as enduring as you suggest. The Shroud if authentic would be  a real rarity, certainly no similar example is known from the thousand tombs excavated in and around Jerusalem from this date.","date":"July 2, 2012 at 4:54 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"author":"menedemus","post":"Ron: ‘So I find that report [see the statement from the Laboratory in no.22 above] suspiciously ignorant of known facts.’Probably easier, Ron, for you to take up the issue direct with them-they have more experience in these matters than I have. And please don’t argue that because they primarily deal with shipwrecks they are not qualified to comment on flax/linen. it won’t wash. If the Shroud of Turin is authentic, it is the only surviving linen cloth of that size and date from outside very specifically arid conditions such as Egypt or Peru and it is of a weave of which no other first century examples are known.Here are the details of the Laboratory that made the report:‘The Conservation Research Laboratory (CRL), directed by Dr. Donny L. Hamilton, is one of the oldest continuously operated conservation laboratories that deals primarily with archaeological material from shipwrecks and other underwater sites.  Operating under the Center for Maritime Archaeology and Conservation, CRL plays an important role in the Nautical Archaeology Program at Texas A&M University (TAMU), and works closely with all of the excavation projects of the TAMU-affiliated Institute of Nautical Archaeology.  In fact, students are a big part of the work done at CRL.  It is a great place to gain practical experience in conservation science.CRL deals with archaeological projects year-round and consists of two laboratories: one is used primarily to teach conservation classes to students at TAMU; it is also equipped to conduct conservation of small inorganic and organic artifacts.  The second laboratory has recently been enlarged to accommodate bigger projects.  In 1995, we established the Archaeological Preservation Research Laboratory, which is devoted to developing new conservation technologies.All kinds of artifacts are treated at CRL, from those made of iron, copper, brass, or pewter to those of wood, leather, glass, or ceramic.’","date":"July 3, 2012 at 5:54 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"author":"menedemus","post":"The problem remains that you have to get it to AD 30 give or take a year or two in an age when crucifixion was all too common. Those less convinced about the authenticity can propose any other date since then. No one seems to talk much about the problems of conservation.Is this because very few people working on these blogs know anything about ancient textiles? (This was one of the major criticisms of the STURP team and why  the Shroud should only have been ever examined in a conservation laboratory.) If you do talk to someone who works with textiles  that is pretty well the first thing they raise because once a cloth gets damp or subject to molestation by insects ,etc. it is gone. The Shroud of Turin would be absolutely unique as a survival – it would have beaten all the odds many times over. You don’t get surviving  pieces of cloth this size ( outside the very special case of Egypt) until the Fatimid workshops/looms of the tenth /eleventh centuries.Any discussion of where the Shroud might have been and when must tackle this as a major issue- a couple of years in the wrong place and the damage is done.For textile experts, especially those who work in museums, it would be the strongest piece of evidence against the authenticity of the Shroud-  the chances of being kept intact over so many centuries are virtually minimal. Don’t ignore the problem.","date":"July 2, 2012 at 7:22 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"author":"menedemus","post":"Relics woven of linen in the Middle Ages have been reasonably well preserved because they were treated with respect within churches,etc. Before then they are very rare, usually only in fragments that have got caught in very specific dry places (or occasionally waterlogged). It is up to you to provide examples from before 1000 AD if survival is so good  -give me the link please to any one museum, such as the V and A, which has a linen collection from before 1000 AD (other than Egypt, Peru,where the dry preserved it).Even better if you can provide anything the size of the Turin Shroud- the nearest equivalents are the Fatimid workshop textiles of the eleventh century which are similar in size to the Turin Shroud- and even then we only have two good examples. I try not to let these discussions become personal but I have worked in similar areas myself for many years and do not need to be treated as if i was some sort of ignoramus. I assume from the way that you speak with such assurance that you are a specialist in these areas but I won’t be convinced until you can actually provide some evidence of your expertise.","date":"July 3, 2012 at 7:40 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."}],"image":[{"author":"menedemus","post":"Isn’t Dawkins a biologist – i can’t see why he might be interested- why not try a top physics/chemical lab.which would need to be given unrestricted access to the Shroud ,of course.Can you arrange this- you can hardly expect a lab to accept the challenge if you can’t, as researchers  would have to work through a number of hypotheses testing them on the actual substances on the Shroud? No scientist could work from a list (what SCiENTIFIC validity has that list got?)as each one item would need to be checked and rechecked with the actual substances from the Shroud. But why should anyone outside the Shroud world be interested? The letter/challenge seems to assume that the fact that the image on the Shroud is not understood makes it somehow unique. Yet there are hundreds of other scientific issues that we still don’t understand e.g. why some people get cancer and others dont’ . There are  several other cases of ancient objects only being understood through advances in scientific understanding in the last few years and we must assume such advances will continue. All we can say as that AS YET we don’t understand how the image was made.The only interesting outcome so far as the Shroud is concerned would be if someone could PROVE it was a supernatural event – why not put your £20,000 there? If it cannot be proved a supernatural event, then are you left with nothing else than it is a natural event caused by a process as yet unknown, alongside, of course, many hundreds of other similar scientific mysteries we have not yet got to the bottom of.","date":"June 29, 2012 at 10:12 am","url":"https://shroudstory.com/2012/06/29/three-months-today-the-dawkins-challenge/","cat":"image_theory","title":"Three Months Today: The Dawkins Challenge"},{"author":"menedemus","post":"Steve. I  disagree- there was once a burial shroud wrapping the body of the historical Jesus. Belief in Christ has nothing to do with that as the Protestant reformers noted five centuries ago. if the biblical evidence is correct, there is also presumably the stone which blocked the tomb, the Crown of Thorns, the Cross, the Lance, bread left over from the last Supper, etc, etc,.So what? Please explain.True Christians are not going to be interested in that lot, non-Christians hardly either. I think you believe that there is a community out there which cares about these physical objects. Faith is about something very different. Some people seem to think the Shroud is more important than Jesus himself!If you really want to present a challenge, you have got to get a proper scientific TEAM working on the Shroud and it must include an expert on linen and the way it reacts with various substances and it must work in laboratory conditions. You can hardly expect a serious scientist taking up the challenge working from someone’s else’s’ list of attributes as you provide here. They would need to be retested and  in many cases more sophisticated procedures would modify the findings on the list anyway.","date":"June 30, 2012 at 5:47 am","url":"https://shroudstory.com/2012/06/29/three-months-today-the-dawkins-challenge/","cat":"image_theory","title":"Three Months Today: The Dawkins Challenge"},{"author":"menedemus","post":"Steve. I just happen to think that there are many scientific issues which are directly concerned with the well-being of humanity which deserve the  £20,000 more than the Turin Shroud. Can you not find an issue that ‘encapsulates the frailties and pitfalls of empirical enquiry’ more than the Shroud does- it seems an odd choice to select it in this way.Jesus Christ existed, he was crucified, he was buried in a burial shroud having been subject to horrific tortures before this. These physical objects, Cross, whips, Crown of thorns, shrouds, the stone blocking up the tomb, once existed but for many, in the Protestant tradition at least, they have nothing to do with the Christian faith. Some may still exist -one cannot rule it out-  however unlikely it is that a piece of cloth has survived two thousand years- let’s keep the question of the authenticity of the Shroud open, the Crown of Thorns might yet be found and the stone that blocked the tomb is probably still around in Jerusalem. Unless one can PROVE a supernatural explanation for the Shroud, which  may add to the faith of some for whom belief in Jesus and his Resurrection  did not exist before, I am not sure what the point of this exercise is.I wish someone could explain why the issue of not knowing how the Shroud was created is such a big one. It is only very recently with advances in X_ray technology that we have begun to understand how the first century BC Antekythera mechanism worked (see Wikipedia). The ingenuity of the mechanism has amazed experts who could not believe that the Greeks were so advanced. The Horses of St. Mark’s in Venice were thought to be undatable but finally analysis on the gilding ( largely undertaken in the British Museum) cracked the problem and dates them to the second /third century AD. There are apparently ( I have only read about this in a review) big advances in understanding fourteenth century painting techniques. This sort of progress is going on all the time. The pro- Shroud community write as if science stays still and so the means by which the image was created will remain forever unknown. This is unlikely if the Shroud is allowed to be properly examined and the latest techniques of analysis applied to it.Dawkins can be challenged for his views on religious belief on many different levels. If you want specifically to challenge him on the authenticity of the Shroud, you have got to arrange proper conditions for a scientific examination of the Shroud by a team specialising in ancient textiles. The ‘list ‘is nowhere to start as any scientist would want to check it through, retest some of the results and probably think up a lot more tests to do to test the hypotheses about the making of the image which a team of bright experts would undoubtedly dream up. and if, at this stage in our scientific understanding , we do or do not understand how the image on the Shroud was created, what then?   Do tell me.","date":"July 3, 2012 at 5:21 am","url":"https://shroudstory.com/2012/06/29/three-months-today-the-dawkins-challenge/","cat":"image_theory","title":"Three Months Today: The Dawkins Challenge"},{"author":"menedemus","post":"Steve ,1) For me ,the question of how the Shroud image was created is not a important one. The fact we do not yet know simply places the Shroud among many thousands of other similar historical enigmas- I don’t see it as standing out as something different.2)The question of how it was made tells us nothing about its authenticity. Science continually progresses ,as the ‘discovery ‘ of the Higgs Boson shows. We may yet discover a method by which the Shroud was made that dates it to medieval times, or we may find one that dates it to the first century AD. A lot of commentators ,not myself, appear to believe that if the image is as yet inexplicable, then somehow that is more likely to make it authentically the burial cloth of Christ.  I don’t follow that argument unless you are arguing that the image can only be explained as a supernatural phenomenon in which case it is, by definition, beyond the normal laws of science .3) The examination of the Shroud has in scientific terms been a mess. There seems to be no overall coordination by anyone expert in the analysis of ancient cloths, samples are floating about all over the place,there is no proper consensus about what has and has not been found on the cloth. It may be too late to repair the damage but  there is no structure in place for a proper scientific examination which would include a radio-14 retesting as well as retesting ,using more sophisticated techniques that are now available, much of the work done twenty or thirty years ago. We urgently need confirmation,for instance, if the blood group is AB as, if it is, it makes it almost certain that the image is medieval.","date":"July 5, 2012 at 5:07 am","url":"https://shroudstory.com/2012/06/29/three-months-today-the-dawkins-challenge/","cat":"image_theory","title":"Three Months Today: The Dawkins Challenge"}],"researchers":[{"author":"menedemus","post":"I think they are clearly separated – you can see the gap on the tomb lid between the two pieces of cloth and the illustrator is depicting the sudarium as separate . The illustrator is taking his cue, as so many others did, from John’s gospel account where the sudarium is described as being apart from the other wrappings. The gospel text would be known to everyone, the Turin Shroud only to a very few indeed. If in doubt with these manuscripts, the gospel accounts should be seen as the main source as actual depictions of relics are very rare. (How many depictions of actual relics can you find in medieval art- some shrines certainly, but very seldom any actual relics- that is why the Pray Codex is unlikely to show the Turin Shroud -it would be completely out of keeping with the mainstream of medieval religious art.)","date":"June 13, 2012 at 7:51 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"menedemus","post":"P.S. To my previous comment.You have to remember that the vast majority of those producing sacred texts were enclosed monks. They would not be able to get out and about to see any relics other than those in their own monastery unless they had special permission from their abbot. So they would rely for their inspiration  on what sources there were INSIDE the monastery which would include the gospels, of course, and other recognised texts. So we would assume that the illustrator of the Pray Codex would be using gospel texts and that this would explain why the sudarium is shown separately. He may also have known about burial customs such as placing the hands across the genitalia as was common practice in burials of his time. It is very unlikely that he  would have reproduced a relic.Why would he?","date":"June 13, 2012 at 9:09 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"menedemus","post":"Max would have more credibility if a) he did not waste so much space having to correct his typing errors.b) he could provide a coherent explanation of why he is right and other people’s views are rubbish.  If he could do this just once in a way that people could understand and accept, even if they did not agree with him, then he would not have to spend all his time on his computer adding cryptic comments every five minutes.","date":"June 13, 2012 at 9:39 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"menedemus","post":"No, so that having made, I hope, my point clearly, I can retire to devote my time to MY professional work without interruption.","date":"June 13, 2012 at 9:55 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"menedemus","post":"Corneliotel’s summary is useful .Thank you. It would be good to have access to the full article if it is on line.It seems( please correct me Corneliotel if I am wrong)  that E.Poulle accepts that the Mandylion/ the Image of Edessa  and the Shroud of Turin are NOT  the same relic, but two distinct relics, one ,of course, of the face of the living Christ, and one the double image of the dead Christ. This is ,of course, what has long been argued here by Yannick and it makes good sense – they are so different that they cannot be the same,  contrary to what Ian Wilson argues. It seems that Poulle accepts that texts such as the Gregarius text of 944 do show that the Image was just of a face and it was a later misinterpretation to suggest that this sermon talked of a body on the cloth. Is that correct?But E.Poulle does accept that the Turin  Shroud was in Constantinople. Does he argue that it is the separate burial cloth reported by Robert de Clari in the Blachernae Chapel in 1203? I would be interested if  Poulle tells us where he thinks this Shroud came from originally – how did it arrive in the Blachaernae Chapel?The Poulle article does seem to be very important in giving a scholarly overview and I hope we can be able to read it in full. Thank you Max and Corneliotel for telling us about it.","date":"June 15, 2012 at 5:08 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"menedemus","post":"Thanks, David Mo . Yes the article by Nicolotti is pretty devastating to the Ian Wilson case- it is a pity there is as yet no English translation as Nicolotti goes through Wilson’s arguments one by one and shows why they are unsustainable. I wonder if anyone in the Shroud community will ever wake up to the dead -ends that Wilson leads them into.I am still waiting to hear from Max where he thinks the Shroud of Turin was in 400 AD if it was used for the model for the Santa Pudenziana  mosaic. I am not an art historian but Max’s world seems completely removed from any art history that I have ever dealt with. Who are all these people able to understand the cryptic clues in these paintings?So please Max. ANSWER IN ONE SENTENCE: WHERE DO THINK THE TURIN SHROUD WAS IN 400 AD?","date":"June 16, 2012 at 7:38 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"menedemus","post":"Max. I am not criticising you – I am asking you a question. You are making an important claim- that the Turin Shroud can be seen in a mosaic dating to 400 AD in Rome. So the mosaicists must have seen the Shroud and so it must have been exposed somewhere. So I masking you where you think it was exposed,  If you cannot give an answer no one will take you and your many posts seriously and it is much better that you concentrate on your professional works for clients and do not bother this blog.","date":"June 16, 2012 at 8:38 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"menedemus","post":"Again no answer to a simple question.Can anyone else reading this understand what Max is talking about? Can you not ask yourself Max what is the point spending so much time writing on this blog when no one can understand what you are talking about?","date":"June 16, 2012 at 8:56 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"menedemus","post":"One of the main arguments against Rogers’ is surely this, that he did not have the opportunity to examine the Shroud in as much detail as Mechthild Flury-Lemberg did in 2002 which is why most scholars, and even Ian Wilson, accept that on the Carbon-14 dating and the possible reweaving, his views are not to be trusted. The fullest refutations come from Mark Antonacci and can be found online. There is also the very detailed photographic evidence that failed to show any reweaving.The StURP researchers only saw the Shroud for a very few hours, in very rushed conditions, not even in a laboratory and it is not at all clear how the samples they took back to the USA were conserved and protected from contamination over the years that followed. We know ,of course, that they have been passed around, starting with McCrone, and then to others. I assume that many scientists would say that they have become worthless with time because of this- once the original context is lost, as when samples are totally removed from the environment which they came from, scientific work on samples becomes very difficult. We have to be absolutely sure that there was no chance of deterioration or contamination when the samples were distributed around the STURP community. How do they monitor this? In addition, and this is Ian Wilson’s view, not one of the STURP scientists had ever dealt with ancient textiles before they visited Turin in 1978. Imagine doing work on the pigments of a famous medieval painting when one had never done a course on art conservation. Certainly Rogers, if Antonacci is right, had no relevant background to work in this field.(N.B. As you can see I am relying on what other people have written about these issues and I am happy to be corrected if I have misrepresented anyone.)","date":"June 21, 2012 at 4:44 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"}]}
