{"archaeology":[{"author":"nabber","post":"I love speculative history, especially the part where it has absolutely nothing to back it up….","date":"October 14, 2015 at 2:13 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"}],"art":[{"author":"nabber","post":"IMO, Max’s comment is meaningless re: the placement.  The Epsilon shape is clear, and is too specific a match to be anything else but an attempt at being as accurate as possible, to resemble the Shroud.","date":"July 10, 2015 at 4:36 pm","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","title":"Dirk Bouts’ The Entombment"},{"author":"nabber","post":"Dan:  Yeah, Yeah, Yeah…..","date":"December 11, 2014 at 3:09 pm","url":"https://shroudstory.com/2014/12/11/because-maybe-you-wanted-to-know-but-probably-didnt/","cat":"art","title":"Because maybe you wanted to know but probably didn’t"},{"author":"nabber","post":"Freeman’s Oculi:  None of your examples pertain.  The first example had 3 circles in a row; the second had 4 circles in a square; the third example had numerous holes but none in the shape of 4 in an “L” (nor any “L”), and the last had numerous holes in a large circle. And none of those had anything to do with a tomb.Constantine and the tomb:  again, 3 holes; in fact 3 LARGE holes. Again, 4 holes in an L-shape is so unique in HPM that it defies normal probability, and yes, they are in the middle of a herringbone weave.  The artist didn’t need a magnification of the cloth to see enough detail to make a rough imitation of the weave.","date":"June 23, 2014 at 4:39 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"I find it incredible that skeptics can deny that the 4 holes in an L-shape is not a conclusive proof.  The probability that this is a definite link is staggeringly high.  A skeptic is required to show other artwork of the Middle Ages with such a pattern was common, or at least beyond one coincidence.   Also, to deny that the artist’s design was to simulate the herringbone weave is an insult to the intelligence of the vast majority of Shroud aficionados.  Repeating over and over that “it is not a herringbone pattern” is not an effective counter.","date":"June 23, 2014 at 1:00 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"O.K.: I will confirm your point.  Not only have you pointed out the bench in green lines, but the “third” line that you did not highlight in green is actually the dividing line between the bench with plain background, and the Shroud with wavy (herringbone) background.","date":"July 1, 2014 at 1:35 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"Ditto the Mont San Angelo, same 3 holes, and as a side comment, these are 3 huge holes a la Constantine and not small “poker” holes (4) as in HPM.","date":"June 30, 2014 at 3:41 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"Louis: “The burial cloth only got passing mention in the gospel and that was because the risen Christ was more important.”Disagree, partly.  The fact that made some Disciples believe in the Resurrection, before they met the Risen Christ, was specifically the Empty Shroud, not the Empty Tomb.  The “Empty Tomb” was really just a generic description of the scene (IMHO).  I would not say the Shroud got  “passing mention” — it was mentioned in all 4 Gospels, with details of it provided.  That said, the Shroud was then kept secret because Jews were not supposed to make or keep images, nor were they supposed to have bloody items associated with death.","date":"July 1, 2014 at 1:27 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"David: “And I remember [sic] you that there is not any L shape in the Pray Codex.”Incredible.  Absolutely incredible.  For O.K.: this is the kind of skeptic that gives skeptics a bad name.  You should disregard this guy completely.","date":"July 2, 2014 at 8:59 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"David: “And I remind you that there is not any L shape in the Pray Codex. There is a pair of L+P. It is a significant difference. Now you get it or not yet?”That, my friend, is ridiculous.  This whole matter must be challenging your World View to the max, for you to put up such a silly objection.","date":"July 2, 2014 at 10:22 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"daveb: “The fallacious assumption is that the image was visible soon after the resurrection. Even assuming authenticity it is still not known how long the image took to form.”I would like to add to that, dave.  Even if the image was formed immediately, it may simply have not been seen because it was on the inside of the Shroud.  The Apostle who collected the Shroud (Peter?) went over to the Shroud (the image not visible, being on the INSIDE of it), rolled it up, and probably soon put it in a box, leather pouch, etc.   How can you determine when somebody unrolled it and looked at the inside of the Shroud, to see an image?  You can’t.  To add to that, the “insiders” (the new Christians), were almost all Jews and would have been reluctant to handle a bloody object related to death, and reluctant to handle something related to the Divine.  If anybody saw the Shroud at all, it was probably when Peter (or the next Custodian) opened the box and said, “See?”.  Then closed it right back up.  IMHO.","date":"July 3, 2014 at 8:50 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"Tomb lid?  If it’s a tomb lid, why is the tomb (to the right) not shown empty?  Shouldn’t the area with the red crosses instead be black and show an empty tomb?  It isn’t .  Therefore, No tomb lid.","date":"March 3, 2015 at 2:49 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"Charles, you forgot “The rest of us see paint where there is none.”","date":"March 4, 2015 at 12:24 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"CF: “The basic point has always been that the Shroud shows extensive bloodstains and scourge marks. Anyone who had seen it would have shown something of these on the body of Christ”“I don’t think it’s any surprise that Jesus’ body and the sheet lack the wounds of the nails, of the scourging and of the spear. It’s clear the artist reported, in a stylized way, the details that had impressed him; nor can we expect that he, while portraying the risen Christ, would continue portraying Him with thumbs bent.” (E. Marinelli)","date":"March 3, 2015 at 2:58 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"No, Skeppie, your argument makes no sense, and if you had given it much thought, you would realize this:  If the area with the red crosses is the “wall of the sarcophagus” as seen from the side, then your fanciful “tomb lid” would be hanging magically on the side of the sarcophagus with no support.  The right side of your “tomb lid” would then be off the ground and have no support.  WHETHER ONE THINKS IT IS THE SHROUD OR A TOMB LID, NEITHER CAN BE ON THE SIDE OF A SARCOPHAGUS, SUSPENDED BY NOTHING.  THEREFORE IT IS A CLOSED SARCOPHAGUS, MEANING THE TOP OF THE SARCOPHAGUS HAS RED CROSSES.  THEREFORE THE OBJECT TO THE LEFT IS THE SHROUD.  Q.E.D.","date":"March 3, 2015 at 3:13 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"Wrong again, skeppie…I’ve looked at all your scenes, and in each and every case the tomb lids are propped up by either the ground and a column, or the ground and an angel, or the like.  Every time.  And, “strangely”, every one of your tomb lids depicted has no design. (yeah, a look of granite or marble doesn’t count, don’t bother….).  Evidently in the Pray Illustration, a “tomb lid” with a design = a shroud.  Talk about lacking….","date":"March 3, 2015 at 3:50 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"Well, no, skeppie.  The other tomb lids in your linked scenes ARE INDEED propped up on either end by either ground or angel or column or top of the sarcophagus, but your imagined  Pray “tomb lid” is propped up by nothing, and even saying that one end is on the ground would be a kindness.  Evidently your “side of the sarcophagus” is able to be a “magnet” for your “tomb lid,” and hold it fast.  And oh BTW, your tomb lids have no designs, unlike the Pray shroud, which clearly has a herringbone design…..","date":"March 3, 2015 at 4:22 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"Actually you could try all day and prop up the other end of a heavy tomb lid on the side of a  sarcophagus, but I know from Physics that it wouldn’t stay there.  Evidently you have not tried this experiment, and lack some basic science knowledge.  And further, NONE of your linked pictures of tomb lids have designs.  Thus, the Pray herringbone shroud of 1192, among other clues you cannot absorb, shows that the Pray Codex Illustrator had either seen or been told first-hand about the Shroud of Constantinople,a delegation having visited there in 1150.  All in all, the connection puts the lie to the carbon dating of 1260-1390.","date":"March 3, 2015 at 5:03 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"It’s OK, homes, you’ve been schooled more than once here today, esp. well so by daveb below.  None of your examples of tomb lids had designs, so if you don’t want to appear to be continuing to lie about it, you’d better proffer up some more lids, some that have designs.  And as daveb states, “The sides of the rectangle are not straight as one would expect a tomb lid to be, nor are they symmetrical about their centre-line. It would be the only tomb-lid ever drawn with four poker holes drilled in it in the shape of an L.”  BTW, you still haven’t answered how your “tomb lid” right side is suspended magically in the air, up against the “side of the sarcophagus”.  Nice try, though.  All the available facts say:  The Shroud.  Live with it.  I’m sure there are some nice skeptic sites somewhere where you could survive quite nicely.","date":"March 3, 2015 at 10:09 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"“There’s at least one case of a purely geometrical design.”  So then, two cases?Link?Representation of granite or marble texture is far, far different than herringbone design, and you know it.  Since the comparison with medieval illustrations leaves almost no supporting evidence that this is a “tomb lid”, it leaves no doubt this is a shroud.  So Sorry for you.","date":"March 4, 2015 at 8:28 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"Idiotic.  Representation of granite would be an attempt to show how a natural object looks.  OTOH, showing the herringbone design of the shroud is an attempt to show how man makes a design out of the creative mind–that is in fact why we call it a design, and not a “natural feature.”   Therefore, granite is not a design.We know from the comparison with medieval illustrations that the Pray Codex is very, very unlikely to  show a tomb lid.  Such tomb lids have no design other than natural granite or marble — and yet the Pray Codex shroud clearly shows a design from the human mind.Only your misled mind could think that a shroud could not change shape.  Do you think that the crumpled Shroud that St.Peter found in the tomb was the same shape as the way the Shroud is stored today?  You’re right, though, your case is surely closed.","date":"March 4, 2015 at 12:44 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"““designs” being completely irrelevant to the issue” :  That’s funny, Skeppy.  the Pray shroud has a design, you know, like cloths do.  Your tomb lids don’t — geometrical designs? Ha.  Post the picture here and let’s let everyone decide.  If there were one, though, it would be a sample set of one, because the rest of your cited tomb lids have nothing of the sort.  And as O.K. pointed out, your “tomb lid” does not have a matching scheme to the sarcophagus. Meanwhile, explain how your magical “tomb lid” in the P.C. sticks to the side of a vertical side of a sarcophagus.  Overall, I can’t believe you’ve ever taken and/or passed a Logic course.","date":"March 5, 2015 at 3:02 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"Wow….What a scathing response.  Awesome. ","date":"March 4, 2015 at 12:47 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"To David G:  although you say “The case for authenticity does not rely on the Codex”, I would just respond that the accumulation of clues from the Pray Codex Shroud/Jesus illustration imply an older date (1150 to 1192) for the Shroud of Constantinople than does the flawed carbon dating, at the very least delivering a technical-knock-out (TKO) for any 14th century hypothesis; this, in turn, opens the door for a host of other clues such as the vanillin residue, among others.","date":"March 4, 2015 at 1:28 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"OK, O.K……..; ^ }","date":"March 5, 2015 at 3:18 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"“Sounds” American to me.  It was peculiar to me that he should try to call texture “a design”, though.","date":"March 5, 2015 at 6:16 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"Skeppy: as Yogi said, “It ain’t over ’til it’s over”.Most of your claims are far, far from proven.Your Admiral Akbar reference finally betrayed you as a 20-something/30-something frustrated atheist, who acts like a teenager.","date":"March 6, 2015 at 1:44 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"Do tell….","date":"March 6, 2015 at 3:02 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"[deleted]","date":"March 6, 2015 at 7:38 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"A skeptic is a person who questions all beliefs but his own….","date":"March 10, 2015 at 8:46 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"…and you would be wrong, JG.  Believers in Shroud authenticity do not question the essential truths to be found in Jesus’ Life, Crucifixion, and Resurrection — regardless of the existence of an authentic or nonauthentic Shroud.  Something which you and your ilk cannot aspire to.","date":"March 11, 2015 at 8:02 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"I like the Downing “Face”, but I still prefer the 1935 Ariel Agemian “Face”….","date":"May 6, 2015 at 7:51 am","url":"https://shroudstory.com/2015/05/05/ray-downing-writes/","cat":"art","title":"Ray Downing Writes"},{"author":"nabber","post":"…and, authenticists certainly question-and-ponder all the points made on this blog.","date":"March 11, 2015 at 8:05 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"Thanks to Hugh.  I’ll just comment on the one, the lintel over the south portal of west facade of Saint Gilles at Arles: 3 holes in the side of the tomb, not 4, no “L”,  and certainly not in the Shroud, which is shown hanging out of the tomb.  Seems like the 3 holes would have come from the Constantine 3-holed tomb.","date":"June 30, 2014 at 3:37 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"nabber","post":"The DELIBERATELY stilted language is a dead give-away that this David Mo is playing games:  “This is why the aspiration to deduce imitative effects only on the basis of isolated features is doomed to failure.”  Seriously?  I would bet dollars-to-donuts that sentence is a cut-and-paste.","date":"July 10, 2014 at 9:01 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"}],"blood":[{"author":"nabber","post":"Hugh:  “Belief in the resurrection is irrelevant to the Shroud.”  Let me fix that for you:  “I, Hugh, believe that Belief in the resurrection is irrelevant to the Shroud, but I could be wrong.”","date":"May 29, 2015 at 7:16 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"author":"nabber","post":"1 Corinthians 15:  “And that he was buried, and that he rose again the third day, according to the scriptures: [5] And that he was seen by Cephas; and after that by the eleven. [6] Then he was seen by more than five hundred brethren at once: of whom many remain until this present… [7] After that, he was seen by James, then by all the apostles. .  [12] Now if Christ be preached, that he arose again from the dead, how do some among you say, that there is no resurrection of the dead? [13] But if there be no resurrection of the dead, then Christ is not risen again. [14] And if Christ be not risen again, then is our preaching vain, and your faith is also vain.","date":"May 29, 2015 at 7:12 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"author":"nabber","post":"I felt that Colin’s inserted picture of Kim Kardashian (a few weeks back) was too red, but perhaps he used MS Office Picture Manager…..","date":"May 27, 2015 at 7:22 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"author":"nabber","post":"Statement #1:  “…assume that “The Man of the Shroud” was not dead, but was merely unconscious; that is, that he did not die as a result of his ordeal; ….the only blood stains on the Shroud are pre-mortem blood stains.”Question #1:  Why exactly would they drape with a shroud, a man near death that they were trying to keep alive?  Counter-intuitive and very counter-productive.Statement #2:  “a new study has concluded that oils were on the Shroud … contrary to what was concluded by STURP.  And those oils were burned off in 1532, at the fire, which is why STURP found no oil residue.”Question #2:  ALL OF THE OILS were burned off in the Fire of 1832?  Impossible, or maybe just extremely unlikely.Statement #3:  “a couple of the scientists were wearing crucifixes.”Question #3:  How could a couple of scientists wearing crucifixes have swayed a group of 33 independent scientists/technicians?  There were atheists and agnostics in the mix.Just for starters….","date":"August 24, 2015 at 7:25 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"author":"nabber","post":"Berry said:  “the TS body image was (as I have proposed here a number of times) skilfully engineered as a ‘Veil of Veronica’ -like sweat imprint.”Again, what sources are you quoting who ever observed the Veil of Veronica as a “sweat imprint”?  The only person who has seen (close up) what the Vatican says is the Veronica was Jesuit art historian Joseph Wilpert who saw only “a square piece of light coloured material, somewhat faded through age, which bear two faint rust-brown stains, connected one to the other”.  (Nothing about looking like a sweat-imprint).Further, all of the probable copies and all of the suspected copies of the Veronica from the Middle Ages (from all over Europe) attempted to portray a full-color face, not a sweat imprint.  You can see them on-line.  No one attempted to portray, in their copy, a “sweat imprint.”  Therefore, NO ONE would have attempted to “engineer” a TS body image as a “sweat imprint”.  Is there a burial shroud anywhere in Europe that  would  have inspired a hoaxer to try such a scheme, and have other people (who had also not seen such a thing) believe it?","date":"December 8, 2014 at 12:03 pm","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","title":"Yannick Clément on Paul Maloney’s St. Louis paper"},{"author":"nabber","post":"CB:1.You have cited no other sweat prints during medieval times–do so or abandon your Veronica and TS as sweat prints theories.   2. You have cited no one who ever described the Veronica as a sweat print (except you).  3.  You have described a magical concept in which medieval artists (and oh by the way, ALL of them) turned a sweat print into a painting rather than what really happened, simply turned a painting into a copy of a painting.","date":"December 9, 2014 at 12:51 pm","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","title":"Yannick Clément on Paul Maloney’s St. Louis paper"},{"author":"nabber","post":"p.s., Colin, you’re not helping your case but responding like a pompous ***","date":"December 9, 2014 at 12:54 pm","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","title":"Yannick Clément on Paul Maloney’s St. Louis paper"},{"author":"nabber","post":"I was looking for articles about the discoveries of Thomas Loy.  Let me search again and get back to you.  It was first mentioned by Kelly Kearse, who had seen it in Ian Wilson’s writings.","date":"December 9, 2014 at 2:55 pm","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","title":"Yannick Clément on Paul Maloney’s St. Louis paper"},{"author":"nabber","post":"Loy et al. (1990) reported on material found at rock-art site DMP6 from Laurie Creek, Northern Territory, Australia. The material was described as a brown-red “pigment” that had naturally exfoliated from a rock shelter. The material was dissolved in water and applied to an Ames Hemastix test strip and gave a positive reaction for the presence of blood. The solution was then subjected to a dot-blot test using SP-A and produced a positive identification for IgG. The substance was then examined with a sandwich ELISA test. The first antibody was supposed to bind primate serum albumin in the residue; the second antibody was monoclonal for human serum albumin. The test was positive for human blood. The AMS radiocarbon date on the material was 20,300 yrs +3100yrs  -2300yrs B.P.Loy (who died in 2005) found lots of Red-Blood-Cells on lots of artifacts — the problem we are talking about, though, is whether the observed color was red, or brown/black, of any of the discovered Red Blood Cells.  I couldn’t find any more of the “observed red”.Source:  A Consumer’s Guide to Archaeological Science, 2011","date":"December 9, 2014 at 4:19 pm","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","title":"Yannick Clément on Paul Maloney’s St. Louis paper"}],"dating":[{"author":"nabber","post":"Let’s see, so that would be 70% of “no idea”, which I’m pretty certain equals to ZERO.   I respect Mr. Porter and Mr. Schwortz immensely (“both have surely studied the matter in considerable detail”  — and you know this is true to what degree?) , I don’t know that they have performed direct counter-studies to Prof. Danin’s investigations, but I have heard a lot of tossing out of simple comments about “Pareidolia”.  That’s not an effective counter.  And, BTW, you have done it again, “even committed authenticists find…hard to swallow”, which is obviously an attempt to generalize.  OF COURSE SOME authenticists find it hard to swallow.  Far more, I believe, have signed on to it.  Red Herring Alert:  There is some conflict with Danin and Frei, and why wouldn’t there be some, but that cannot possibly affect whether there are images on the photos.","date":"December 2, 2014 at 1:07 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"author":"nabber","post":"Hugh says: “which is disputed by the a very large proportion of shroud scholars”.  Could you cease tossing out these general statements in a flippant attempt to discount legitimate studies?  NUMBER ONE:  What is the size of group, “the Shroud scholars”? 100? 200?.   NUMBER TWO:  What does the term “VERY LARGE proportion” mean, and how did you come up with that amount?  30% ?  60% ?.   NUMBER THREE: What does “disputed” mean?  “disagree with, but have performed no studies to the contrary”   or “disagree with because they are anti-authenticists”?","date":"November 30, 2014 at 5:00 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"author":"nabber","post":"CF: “The flax with which the Shroud was woven was spun in a place where cotton was also being spun -(we know that this happened).”No, you don’t know this happened at the place where the Shroud was woven.  Source, please, Mr. F.","date":"March 11, 2015 at 8:10 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"author":"nabber","post":"Where’s your logic, Hugh.  This blog represents hundreds of scholars?  It probably represents anti-authenticists unfairly, if anything.  Straw man much?  “Hundreds of flowers” an easy target.  How about “a lot of flowers”.  And yes, the Farey Red Herring still lives despite denials.  Danin’s views of flowers don’t depend on exact matching of locations with pollen, in fact just the existence of both in ANY location is significant enough.  Where are the opposition studies? They are almost all Pareidolia type comments.  Your article referenced above is so heavily tilted by what you DON’T ADMIT, as to be useless.","date":"December 3, 2014 at 9:05 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"author":"nabber","post":"“It takes considerable imagination to see the shroud in the pray codex.” -PHPLIt takes considerable imagination to see PHPL comments as anything but cynical and jumping-on-a-(very small) bandwagon.  You’re considerably outnumbered by keen observers.","date":"January 23, 2015 at 4:23 pm","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","title":"BSTS Article by Hugh Farey"},{"author":"nabber","post":"“To a non-authenticist, of course, there is no surprise at all to find that the shroud radiocarbon dates to exactly the time when its history begins.”  Except the evidence is clear:  there is plenty pointing to an earlier existence than the date of 1356.  The nay-saying on this blog by anti-authenticists against the Pray Codex is downright embarrassing.  Oh yes, ” the 4 L-shaped holes on the Codex shroud actually hearken back to architectural practices on many ancient buildings….”  Indeed, rank poppycock.  Just one example of bad scholarship.","date":"January 22, 2015 at 8:26 am","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","title":"BSTS Article by Hugh Farey"},{"author":"nabber","post":"Hugh, you are trying to couch it in the terms you prefer, but that is a false reading.  JP2 said, “The Holy Shroud is the most splendid relic of the Passion and Resurrection”, and that   is hardly a “personal opinion” in the ears of any fair-minded, religious person.  It speaks to spiritual matters, and the Pope is the head of all spiritual matters for RCs, speaking ex-cathedra or not.  The best that anyone could say about the 2 statements is that the Pope was conflicted, but he indeed spoke on matters of faith both times.  I think he would have been right at home participating on this blog….","date":"April 30, 2015 at 10:54 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"author":"nabber","post":"“NOT” ……","date":"July 22, 2014 at 10:41 am","url":"https://shroudstory.com/2014/07/22/another-segment-of-stephen-jones-conspiracy-theory/","cat":"conspiracy_theory","title":"Another Segment of Stephen Jones’ Conspiracy Theory"},{"author":"nabber","post":"HF:  “Part of the point of the paper is that a dye was rubbed onto the ‘mended’ Shroud in order to match the colours. Well it was a pretty poor shot, wasn’t it, since the dye is, according to both Rogers and Pam, so conspicuously different from the cloth it was supposed to emulate.”A little specious on that argument.  There’s an even chance that when the dye was applied, that it in fact DID match the cloth.  The colors could very well have progressed unevenly in their fading.","date":"December 10, 2015 at 11:38 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"author":"nabber","post":"HF, thanks for your “expert” comments on dyes:  ” Linen may be more difficult to dye than cotton, but that’s a relative term. Furthermore, ‘encrustations’ are not evidence of dye.”“Defects Caused by Deposits and Encrustations on Fiber” by Karl Mahall.(Springer Link)Abstract:“Oils, greases and waxes which are not removed before dyeing can cause reserving and, as with sizing residues, lead to dyeing unlevelness.  Precipitated dye or UNDISSOLVED DYE PARTICLES cause dye stains. Inappropriate finishes lead to the FORMATION OF CHALKY MARKS when the fabric is scratched.”Lime deposits are mentioned as types of encrustations.","date":"December 10, 2015 at 11:56 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"author":"nabber","post":"“As I wrote above, two drawings depicting the same subject can obviously share a few similarities, but this doesn’t mean that there is any connection between these two drawings as such.” –PHPLTo repeat yourself as if no one had said anything doesn’t mean your statements will stand up.  The similarity of the four holes (in an “L” shape) between the two has created a probability of one copying the other that approaches, very closely, certainty.  The problem of some other details not being copied (especially after 4 decades) has nothing logically to do with that first probability.  You don’t know my qualifications, by the way, and evidently you are purposedly ignoring those of John Klotz.","date":"March 20, 2015 at 3:47 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","title":"John Klotz Delivers the Knockout"},{"author":"nabber","post":"An astounding lack of logic.  If you were drawing a white horse with four brown, round, and connected spots, the resemblance would certainly indicate you had seen that horse drawn before.  The probabilities that it would be a coincidence are staggeringly small, as to be meaningless.","date":"March 20, 2015 at 7:35 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","title":"John Klotz Delivers the Knockout"},{"author":"nabber","post":"Should have said, “Know nothing”….","date":"December 19, 2014 at 3:38 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","title":"Just Published:  What Went Wrong with the Radiocarbon Date?"},{"author":"nabber","post":"Now you’ve done it, anoxie.  You’ve attracted Piero to this thread — watch out for interminably long responses of scientific fol-de-rol……","date":"April 23, 2015 at 7:30 am","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","title":"Look at what happened between 1988 and 2015"},{"author":"nabber","post":"Admittedly an artist would have to have had an very precise brush; however, I can see places where the iris border is portrayed over at least 3 threads.  Do-able.","date":"March 11, 2015 at 8:15 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"}],"dna":[{"author":"nabber","post":"Max said:  “in Greek the cursive ‘t’ can easily be mistaken for a cursive ‘i’ and iairos turn into iatros, “physician”.”There is far more to Luke’s physician status than an argument over a word translation.  The choice of medical language proves that Luke was a physician.  There are clear indications of his medical profession throughout his writings.  In Hobart’s “The Medical Language of St. Luke”, he points out numerous words and phrases identical with those employed by classic medical writers such as Hippocrates and Galen.   The argument is cumulative.  When doubtful cases and expressions common to the Septuagint are set aside, a large number remain that are unassailable. It is as good as certain from the subject-matter, and more especially from the style, and for everyone who can appreciate proof, that Luke’s work was by a man practiced in the scientific language of Greek medicine–in short, a Greek physician.","date":"December 9, 2015 at 4:06 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"author":"nabber","post":"daveb’s first para:  “it has been asserted this epistle [Colossians] is pseudonymous”?  By whom? How authoritative?  “It was a common enough practice”?  And that proves what? The four Captivity Epistles were written by Paul during his first imprisonment in Rome — Colossians, Ephesians, Philemon and Philippians, sometime between A.D. 61 and 63.  When Paul appealed to Caesar, Luke accompanied him from Caesarea, and was with him during the stormy voyage from Crete to Malta. They went on to Rome, where, during the two years that Paul was kept in prison, Luke was frequently at his side. He was present when the Epistles to the Colossians, Ephesians and Philemon were written, and is mentioned in the salutations given in two of them: “Luke the most dear physician, salute you” (Colossians 4:14); “There salute you . . . Mark, Aristarchus, Demas, and Luke my fellow laborers” (Philem., 24). second para:  “only late-2nd century traditions claim that Paul was the guarantor of Luke’s Gospel”? Paul himself quotes Luke twice in his Epistles.  Paul quotes Luke 10:7 in his letter to Timothy (1 Timothy 5:18).  Paul actually calls this 1 Timothy quotation a “Scripture”, “graphe” , meaning the written word, not an oral saying.Paul also used wording in describing the Lord’s Supper in 1 Corinthians 11:24-25 that is unmistakably from Luke 22:19, plus, the words are not found in any other gospel.  So Paul must have had access to a copy of Luke when he wrote 1 Corinthians, about AD 55.  Proof well before the “late 2nd century”…  third para:  “References are often made to Luke’s medical language, but there is no evidence of such language beyond that to which any educated Greek might have been exposed.” Wow — big assumption.  Are you “up” on the status of the educated Greek of the first century?Further, there is a striking resemblance between the prologue of the Gospel and a preface written by Dioscorides, a medical writer who studied at Tarsus in the first century. The words with which Hippocrates begins his treatise “On Ancient Medicine” should be noted in this connection.  It is believed that Luke met Paul at Tarsus.Also third para:  “Of more import is the fact that in the writings of Luke specifically Pauline ideas are significantly missing”.  For starters, of the characteristic words and phrases which mark the three Synoptic Gospels, a little more than half are common to Matthew and Paul, less than half common to Mark and Paul, but two-thirds common to Luke and Paul.Ideas:Justification by faith: Luke:  It is easier for a camel to go through the eye of a needle than for a rich man to enter the Kingdom of God. They asked, “Who then can be saved?”  Jesus replied, “What is impossible with man is possible with God.”  “Truly I tell you, no one who has left home or wife or parents or children for the sake of the kingdom of God [true faith] will fail to receive many times as much in this age, and in the age to come, eternal life.” (Luke 18:25).Paul:  “Therefore having been justified by faith, we have peace with God through our Lord Jesus Christ,” (Rom. 5:1). The Sacrifice:  The death of Jesus was associated with the Passover sacrifice in the context of the Lord’s Supper.  This conclusion can be drawn from I Corinthians 5:7.  If this is so, then for the Gospel, a connection is established between the significance of the Passover and the Last Supper (Luke 22:7-20).","date":"December 10, 2015 at 2:22 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"}],"events":[{"author":"nabber","post":"Colin said:  “Wrong. The STURP summary does not use the word ‘scorch’ at all.”  Then he says, “[STURP] points out that such changes can be the result of thermal OR chemical treatments, which in most people’s books would be described as “scorches.”     So you destroy your own argument by quibbling about the specific word “scorch”.  Shame on you.Colin said, “The STURP summary makes no mention whatsoever of cloth-body distance. The reference in the STURP summary to the capture and encoding of 3D information has possible explanations that do NOT obligatorily require any postulates re ‘cloth-body’ distance.”     But the Report says, “Computer image enhancementand analysis by a device known as a VP-8 image analyser show that the image has unique three-dimensionalinformation encoded in it … the image of the face with the highresolution has been amply demonstrated by photography.”  The nose is darkest because it is closest to the linen, the eye sockets are lightest becasue they are furthest away, i.e., cloth to body distance made the 3-D effect. Colin said, “The energy of the uv CAN be dissipated safely in other forms, notably as thermal energy.”Kohler at Ohio State, whose work was sponsored by the National Institutes of Health and was performed at Ohio State’s Center for Chemical and Biophysical Dynamics, which is funded by the National Science Foundation, stated,“Eventually, the energy does turn into heat, but the important point is that the energy is retained within the molecule for much longer times,” he added. “This can cause all kinds of photochemical havoc.”Colin said, “I may indeed be wrong.”  Yep.","date":"September 18, 2014 at 4:15 pm","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf"},{"author":"nabber","post":"I think Berry quibbles about the word “scorch”, especially after all his endless and fruitless theories about bas-relief, etc., etc., etc.  I think we all know what each other means by scorch, by now.Hugh says:  “Nabber finds a quotation which parallels Colin’s statement about UV , but seems to think it means the opposite. Kohler’s mention of ‘photochemical havoc’ refers specifically to the damage caused by UV radiation to human cells”.Hugh, your personal knowledge of the effects of UV radiation leads you to imply that photochemical reactions only affect human cells, and not the cells of linen fabric?  Hugh says, “Kohler, like Colin, is well aware that most materials are unaffected by UV radiation.”  I didn’t realize that you personally knew what Kohler is “well aware of.”  And that statement is poppycock, anyway.  All fabrics are affected by UV radiation, as well as many other materials.It’s also pedantic of you and him to insist that the STURP summary said nothing about cloth-to-body distances, when STURP members (Jackson, et.al.) have put out reams of articles on the subject ever since the STURP report.","date":"September 22, 2014 at 2:43 pm","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf"},{"author":"nabber","post":"By the same token, you should not let Piero get away with his lengthy cut-and-paste entries.  He should just let a link stand for his unusually obtuse entries.","date":"July 15, 2015 at 2:01 pm","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","title":"Does it Matter if the Shroud is a Fake?"},{"author":"nabber","post":"Thanks for the announcement…duh…","date":"May 15, 2015 at 2:03 am","url":"https://shroudstory.com/2015/05/10/picture-for-today-getting-ready-for-the-shroud-exhibition-in-1931/","cat":"exhibition","title":"Picture for Today:  Getting Ready for the Shroud Exhibition in 1931"},{"author":"nabber","post":"“A local expert on the Shroud of Turin, the piece of linen believed by some to be the burial cloth of Jesus,”  (editorial BS)A local expert on the Shroud of Turin, the piece of linen believed by millions to be the burial cloth of Jesus,  There, fixed it….","date":"September 18, 2014 at 4:19 pm","url":"https://shroudstory.com/2014/09/18/five-things-the-shroud-of-turin-made-number-three/","cat":"conference","title":"Five Things:  The Shroud of Turin Made Number Three"},{"author":"nabber","post":"Louis: “I believe that the Shroud is authentic, however I don’t think anyone can be dogmatic when it comes to this. Not even the Church is.”  I’m a little tired of this argument, Louis, which is problematic when you consider the statements of the last 7 popes, who head the Church (and they are quite clear and straightforward):Pope Pius XI (1922-1939):  “… certainly not the work of any human hand.”Pope Pius XII (1939-1958):  “The linen in which Joseph of Arimathea enveloped the sacred remains of our Lord Jesus Christ.”Pope John XXIII (1958-63):  “This can only be the Lord’s own doing.”Pope Paul VI (1963-78):  “…The image from the Holy Shroud reveals to us the human and divine personality of Christ.”Pope John Paul II (1978-2005): “The Holy Shroud is the most splendid relic of the Passion and Resurrection.”Pope Benedict XVI (2005-2013):  “…should be seen as a photographic document of the darkest mystery of faith — that of Christ’s crucifixion and resurrection.”Pope Francis I (2013- ):  “By means of the Holy Shroud, the unique and supreme Word of God comes to us”","date":"March 30, 2015 at 4:42 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"author":"nabber","post":"Don’t stop Piero, he’s on a roll…..","date":"March 27, 2015 at 10:18 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"author":"nabber","post":"My understanding is that, of the 9 aragonite-type samples from Israel offered up for examination, only the Jerusalem sample aragonite had a close match with that found on the Shroud.  Until you state some more details about French aragonite, I don’t see the relevance.  It would seem to be of the same relevance of the 8 Israel samples that did not match the Shroud very closely.","date":"March 31, 2015 at 2:52 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"author":"nabber","post":"“Don’t make me stop this car…..”","date":"October 2, 2014 at 8:42 am","url":"https://shroudstory.com/2014/10/02/impatience/","cat":"st_louis_2014","title":"Impatience"},{"author":"nabber","post":"Thank you, dave b","date":"April 1, 2015 at 9:42 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"author":"nabber","post":"By such comments, CB has embarrassed himself, his allies, and members of this blog.  Of course, he has no idea that he has done so — and has no capacity for embarrassment, anyway.","date":"October 16, 2014 at 10:39 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"author":"nabber","post":"Hey MPH:  You apppear amazingly unaware of the details of the NT.  Mary Magdalene clearly did not recognize Jesus because she was looking for His body, not looking for Him, which is why she did not recognize the gardener.  And Jesus in that form did not yet have a glorified body, as he told MM not to touch Him because He had not yet ascended to the Father.","date":"October 16, 2014 at 8:56 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"author":"nabber","post":"Tonto is from the Spanish, “stupid”, or “simple”…..","date":"March 15, 2015 at 4:12 pm","url":"https://shroudstory.com/2015/03/15/the-lone-ranger-in-phoenix-later-this-month/","cat":"presentation","title":"The Lone Ranger in Phoenix Later This Month"},{"author":"nabber","post":"Factoid alert:  No need to get gold from the sea — there is plenty in mines in Colorado; it’s just not economical to get it out of there, any more.  So they told me in Cripple Creek.","date":"September 13, 2014 at 10:12 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"}],"history":[{"author":"nabber","post":"Mario states:  “the dissertation refers to documents that never mention that Othon received a shroud or owned any shroud.”   Absence of Evidence does not mean Evidence of Absence.Otto could have hid the Shroud based on a fear that either the Pope or the King of France would force him to turn it over.  As an analogy,  Bishop Athanasius wrote in the 300s that the “Icon of our Lord” (the Shroud) was secreted away to Syria (Antioch) upon the attack of the Romans on Jerusalem.  From 70 A.D. until 540 A.D (date of the destruction of Antioch by Chosroes), the Shroud was not displayed in Antioch, due to the fear of the Arian Christians (and later the Monophysites) that the Churches in Constantinople and Rome would either take it away from them or destroy it.  Absence of Evidence is not Evidence of Absence.","date":"May 29, 2015 at 8:12 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","title":"Challenging the Othon de la Roche Story"},{"author":"nabber","post":"Wait, MikeM…. you’re asking Freeman to actually READ the evidence?  You cad…The guy is an embarrassment….even CB reprimands him….","date":"November 2, 2014 at 10:13 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"author":"nabber","post":"With all due respect, “don’t hurry back” ….","date":"October 24, 2014 at 8:55 am","url":"https://shroudstory.com/2014/10/23/the-guardian-notes-the-history-today-article-by-charles-freeman/","cat":"history","title":"The Guardian Notes the History Today Article by Charles Freeman"},{"author":"nabber","post":"Just goes to show:  one person’s hoity-toity is another’s blazing truth….","date":"December 4, 2014 at 8:55 am","url":"https://shroudstory.com/2014/12/03/the-shroud-of-turin-is-not-the-image-of-edessa/","cat":"history","title":"The Shroud of Turin is not the Image of Edessa?"}],"image":[{"author":"nabber","post":"Mario said, ” we know the VP8 has nothing to do with NASA”  That is INCORRECT.  The VP-8 Image Analyzer was used to interpret NASA LANDSAT-1 Earth Resources Satellite Program images, for an example, see ntrs.nasa.gov, Technical Report #19760010448.","date":"December 9, 2014 at 12:34 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"author":"nabber","post":"Yes, Hugh, NASA did most certainly use the VP-8 image analyzer, by paying subcontractors on a host of LANDSAT projects, including in Serbia, Canada, and Thailand, to name a few.  You have missed the point by dismissing it as a “vegetation analyzer”; actually, the ability to process hundreds of different grayscale tonalities allowed it to enhance LANDSAT visual to near-IR band images in order to provide an improved, “super” look at a vastly-increased number of high-contrast areas and low-contrast areas, both of rock and vegetation, alone or together.  This is indeed analogous to what was done with the Shroud with the VP-8, allowing an intensity-to-distance capability.","date":"December 9, 2014 at 10:17 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"author":"nabber","post":"NASA financed the Natural Resources Management Corporation to do this work with the VP-8.  The information was not only “filed” with NASA Scientific and Technical Papers, it was also presented at a NASA Conference in 1976.  You know, Hugh,  just in case you were trying to distance the NASA – VP-8 connection.  Too, too obvious.","date":"December 9, 2014 at 4:30 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"author":"nabber","post":"C.B. said, “Passive sensing cannot give any encoded information.”  On the other hand, I don’t believe anyone has made a final official declaration that the TS image occurred by passive sensing….Hugh:  obviously you don’t understand how Government works — in the U.K. and the U.S., “paying for someone to do something for you is the same as doing it yourself” is exactly how it works.  If they’re paying, The Government owns all processes and results from your work, therefore it is Their work.  As far as contrasting image densities producing topographical images, that is exactly what was produced with the “3-D” TS Image.  And if they didn’t think that they were going to come up with something significant when they ran the TS info through the VP-8, why did they even start?  According to your reasoning, they would not even have bothered to look — therefore, something is wrong with your reasoning.  Unless of course you are calling Schumacher, Jackson, Jumper, et. al., “hoaxers.”","date":"December 10, 2014 at 9:02 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"author":"nabber","post":"C.B.:  “photographs of the TS image … taken with a camera with no active scanner but merely passive reception of reflected light, cannot possibly pick up encoded 3D information, even if it was there in the TS image.”  CANNOT POSSIBLY — so you say, yet others say something seemingly impossible is associated with the TS. “[And] Yet the image on the Shroud of Turin yields a very accurate dimensional relief of a human form. One MUST conclude from this that the image density on the cloth is directly proportionate to the distance it was from the body it covered.” (Schwortz)C.B: “That’s why it works on photographs of scorch imprints too, as good as if not better than the TS image.”  No, I don’t agree that they look as good, plus the scorches proffered up thusfar do not sit on the top 1/500th of an inch of the fibrils.","date":"December 10, 2014 at 10:13 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"author":"nabber","post":"The Veil of Veronica legend OF COURSE started out as a woman wiping the SWEAT and blood off of the face of Jesus.  But as I said, any Medieval person would have been thinking that the act of wiping sweat and blood off of anyone’s face would produce nothing but a huge smudge, and using the SUDARIUM word making no difference.That is why the Veronica was thought to be a miraculous production of Jesus’ face, in color, and not a “sweat imprint”.  That is why all the Medieval artists painted their copies of it in color.  That is why the Medieval hoaxers were not able to get anyone to buy into the concept of a “sweat imprint” — NO ONE HAD SEEN ONE, and Colin Berry can’t cite an instance of anyone in Medieval times having seen a painting of a sweat imprint, or even having seen a real burial cloth with a sweat imprint.  So naturally, any Medieval bishop, cleric, or common-man would not be able to buy into the thought of a TS as a “sweat imprint”.  If anything, they would have gone for a nice color body/blood imprint.  Whether Pre- or Post-Crucifixion imprint, the people would not have been “marketed” into a “sweat imprint”.  They’d never heard of one or seen one! (except for the  big smudge, that is!)","date":"December 9, 2014 at 4:57 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"author":"nabber","post":"And why, exactly, would the hoaxer care about how superficial the scorch was, to go through serial imprinting of wads of llinen?  A heavy scorch would not fool anyone, but a light scorch would?  Through what thought process would the hoaxer be trying to lead the Bishop, Cleric, Common-Man?  At what point would the hoaxer have known he was finished?  Maybe he did some polling?","date":"December 10, 2014 at 2:43 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"author":"nabber","post":"You tried to mask it, but it stands as an ad-hominem attack.  Sorry for you.","date":"September 15, 2014 at 9:26 am","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level"},{"author":"nabber","post":"“From a scientific standpoint, the gesso-vermillion hypothesis is simply too flaky.”Awesome.","date":"December 11, 2014 at 6:40 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"author":"nabber","post":"Well said, Louis:  “It would be like asking what sort of power emanated from him when the woman with the haemorrhage (Mark 5:25-34) was cured instantaneously.”I’ll throw in that it also would be like asking what sort of power emanated from him during the Transfiguration…..","date":"July 16, 2015 at 1:44 pm","url":"https://shroudstory.com/2015/07/16/a-reason-to-doubt-the-image-was-formed-by-radiation/","cat":"image_theory","title":"A Reason to Doubt the Image Was Formed By Radiation"},{"author":"nabber","post":"Always use the instant “sniff test” on this website:   Hmmmm….   Rogers or Berry, Rogers or Berry, “geez, no contest”.  Nuff said.  (For the weak of mind:  It’s “Rogers” every time).","date":"July 20, 2015 at 4:08 pm","url":"https://shroudstory.com/2015/07/20/in-the-weeds-vanillin-and-the-age-of-the-shroud/","cat":"science","title":"In the Weeds:  Vanillin and the Age of the Shroud"},{"author":"nabber","post":"Sorry, but I find it incredibly illuminating that you should advertise yourself as “high on the Google lists”.  It’s sad that you have to aggrandize yourself this way.  But at least it lets everyone here know about your true motivation.  BTW, “pompous a$$” gets 210,000 hits…","date":"February 21, 2015 at 4:00 pm","url":"https://shroudstory.com/2015/02/21/colin-berry-stop-calling-the-faint-image-a-faint-image/","cat":"image_theory","title":"Colin Berry:  Stop Calling the Faint Image a Faint Image"},{"author":"nabber","post":"Charles , you are pointing out about yourself here on this blog as being “high on the Google lists”.   You are obviously crowing about your ability to attract attention.  We have a name for that in this modern age, and the first word is “attention _____”…..","date":"February 23, 2015 at 10:49 am","url":"https://shroudstory.com/2015/02/21/colin-berry-stop-calling-the-faint-image-a-faint-image/","cat":"image_theory","title":"Colin Berry:  Stop Calling the Faint Image a Faint Image"},{"author":"nabber","post":"Dan, please explain to me, on “2) Colin’s supposition that the shroud is meant to be thought of not as a burial cloth in the tomb but as a stretcher of sorts to transport the body to the tomb.”Would not such a shroud, used as a stretcher, contain smeared blood all over the place?  There is not such an effect on the SoT, true?","date":"August 6, 2015 at 7:34 am","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"author":"nabber","post":"Hugh says:  “If I were compelled to say what a Resurrection miracle might ‘probably’ be, I would look towards those other examples of people raised from the dead by Jesus, namely Lazarus, Jairus’ daughter and the son of the widow of Nain. No suggestion of transferring bodies into other dimensions there, upwards or downwards.”Excellent point.  Thank you.  This is a case of where Logic and Precedence combine to actually become Science, IMHO.  No machines, calculators, test tubes, but still Science.","date":"August 10, 2015 at 8:21 am","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"author":"nabber","post":"As you so blithely try to pass off…incorrectly.Lazarus is the only resurrected person that Jesus personally refers to as “dead.”  Jesus said the daughter of Jairus was “sleeping”, but this could have been a use of “sleeping” as a synonym for death.From John:  When Jesus arrives in Bethany, he finds that Lazarus is dead and has already been in his tomb for four days.  Martha laments that Jesus did not arrive soon enough to heal her brother and Jesus replies with the well-known statement, “I am the resurrection, and the life: he that believeth in me, though he were dead, yet shall he live: And whosoever liveth and believeth in me shall never die”.From Luke:  “Soon afterward, Jesus went to a town called Nain, and his disciples and a large crowd went along with him.  As he approached the town gate, a dead person was being carried out—the only son of his mother, and she was a widow.  When the Lord saw her, his heart went out to her and he said, “Don’t cry.”Then he went up and touched the bier they were carrying him on, and the bearers stood still. He said, “Young man, I say to you, get up!”  The dead man sat up and began to talk, and Jesus gave him back to his mother.”Wrong again, DG","date":"August 10, 2015 at 2:03 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"author":"nabber","post":"Totally accept.","date":"August 11, 2015 at 8:02 am","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"author":"nabber","post":"Dave, don’t hold back, tell us how you really feel …; ^ }(and thanks!)","date":"June 1, 2015 at 4:36 pm","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?"},{"author":"nabber","post":"Charles Freeman hangs out on every skeptic blog message board known to man.  Bottom line:  Freeman’s world view is severely threatened by an authentic and unexplainable Shroud.  He is not adding anything of value to the discussion on this board.   And the only thing I agree with Colin  on….","date":"June 1, 2015 at 9:07 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?"},{"author":"nabber","post":"“People were not usually buried in shrouds.”At Qazone, Jordan, near the Dead Sea, numerous graves were discovered dating to the 2nd Century AD;   42 pieces of shrouds were taken from 50 graves, including one intact shroud.“Secondly, even if they were, we may simply not have any other shrouds with images because of the passage of time.”That doesn’t make sense.  In my readings on archaeology and shrouds, it is stated often that archaeologists have found hundreds of shrouds over the centuries.   Only one, from Egypt, had a partial outline, but it was caused by embalming fluids.  The Shroud remains the only one with an image.","date":"November 16, 2015 at 8:59 am","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","title":"Nevertheless, the images are real enough!"},{"author":"nabber","post":"Would not the thumbs have been fastened together somehow, under the palms, out of sight?  How else could the hands have stayed in that position?  It seems that otherwise, with the elbows not on the body and off to the side, the weight of the upper arms would cause the hands to continuously slide backward off of the pubis area.","date":"April 28, 2015 at 8:25 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","title":"Might tactile chemography prove to be the super-model?"},{"author":"nabber","post":"Unbelievable you would proffer that up and it’s very revealing what you don’t say.  If you know of such a painting that sits on the top one-five-hundredth of an inch of the linen, show us where to find it!  You cannot!  If you don’t like that measurement, pick your own, as long as it is somewhere close to that.","date":"September 25, 2014 at 4:53 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"author":"nabber","post":"Hugh sez:  “As he was not present at Turin, he must have got it from another source, possibly Eric Jumper or Sam Pellicori. THE STORY HAS BEEN AT LEAST SLIGHTLY EMBROIDERED.”  Non-sequitur.  Judgmental.  Absolutist.  Unsubstantiated.","date":"October 31, 2014 at 11:36 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","title":"Those Dark Specks in the Mark Evan’s Photographs"},{"author":"nabber","post":"Hugh sez:  “The suggestion that the aragonite found on the shroud can be identified exclusively as that found in Jerusalem is wholly unsubstantiated.”  Tearing down strawmen, are you?  Who maintains that the evidence shows or has-to-show exclusive identification? What, no one has ever gone to prison based on circumstantial evidence?  It’s the preponderance of evidence we’re looking for here, not exclusivity.  1 out of 9 aragonite samples from Israel match the Shroud aragonite, and it is the sample from Jerusalem.  You are the editor of a journal that looks at evidence, and your standard is exclusivity?","date":"October 31, 2014 at 11:32 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","title":"Those Dark Specks in the Mark Evan’s Photographs"},{"author":"nabber","post":"The Aragonite found in 1978 from spectroscopic “hits” were found also in the nose area — close enough to the eyelid, so what are you fussing about.  I thought I had read that the 9  Aragonite samples from parts of Israel (from Dr. Nitowski) had a match with the Shroud Aragonite only in the case of the 1  sample from Jerusalem, and I thought the Dr. Levi-Setti examination (from Fermi Institute) had resulted in an unusually close match between the two above.  Exclusive match, maybe not, but the fact that the other 8 Nitowski samples did not match, has to account for a pretty positive indicator.  And, as Dr. Kohlbeck stated, skeptics have to account for Aragonite being on the Shroud at all, and then, on such indicative places, feet, knee, nose.","date":"October 31, 2014 at 8:44 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","title":"Those Dark Specks in the Mark Evan’s Photographs"},{"author":"nabber","post":"PHPL: “Some here pretend that the forensic experts who examined it unanimously say that the shroud is authentic. That’s not true. Some pathologists like Lee or Baden disagree with this.”You have to do better than that — Baden and Lee did not examine the Shroud, only looked at photographs of the Shroud — not the same thing at all.  We don’t even know which version/quality of photos of the Shroud they examined. You can say it — “if a commission of forensic experts examine the shroud, most will say that it’s a fake”, but that’s your opinion and an unsupported one at that.  The longer you post to this blog, the weaker your comments become.  Pity.","date":"April 1, 2015 at 9:33 am","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"}],"misc":[{"author":"nabber","post":"“the reality of reincarnation, a notion popular in Jesus’ day, accepted by Him and by some early Church fathers, comes into focus. ”Pure poppycock….Prove it.","date":"October 6, 2014 at 10:53 am","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","title":"A Different Perspective on the Shroud"},{"author":"nabber","post":"“Elias and other were dead so some believed that they came back as Jesus.”  Not a big fan of the OT, huh, John?Elias = Elijah, who did not die, but was “taken up”.  And, p.s., they were not talking about reincarnation, but the return of a prophet(s).","date":"October 6, 2014 at 1:04 pm","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","title":"A Different Perspective on the Shroud"},{"author":"nabber","post":"John Green quotes: ” He asked his disciples, saying, Whom do men say that I the Son of man am?”I agree with DaveB.  Jesus, aware of “undoctrinal” talk about who he might be, was setting up a straw man in order to knock such arguments down (and later, the evangelists wrote it).  And He did.There may have been illiterates who believed in reincarnation, but no one steeped in the teachings of the mainline rabbis….","date":"October 9, 2014 at 1:16 pm","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","title":"A Different Perspective on the Shroud"},{"author":"nabber","post":"Sampath,  where have you been? Pope Francis I: “By means of the Holy Shroud, the Unique and Supreme Word of God comes to us.”Just how clear would you like him to be?As they say, “you could Google it.”","date":"June 21, 2015 at 6:08 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","title":"A Memorable Photograph Worth a Thousand Words"},{"author":"nabber","post":"But Pope Francis was not talking about OTHER sculptures, paintings, icons, relics, nor has he said anything similar about them.  HF is a either thick, or purposely dissembling.  Let’s rearrange the Pope’s statement for those unable to diagram sentences:  “The Unique and Supreme Word of God comes to us by means of The Holy Shroud.”  He was as clear as he could be, except to those who desperately need to change the meaning of what the said…..","date":"June 22, 2015 at 7:47 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","title":"A Memorable Photograph Worth a Thousand Words"},{"author":"nabber","post":"Evidently it does mean that.  It’s too bad that an American has to explain English to a Brit.  The UNIQUE and Supreme Word of God comes to us by _______ (fill in the blank).  Theologically, the answer could only be “Jesus” or “the Bible”, or as Pope Francis opines, “the Holy Shroud.”   Any other answer here would be some secular nonsense.  Now you are repeating nonsense again, re:  his predecessor Popes have failed to express an opinion?  Unbelievable.Pope Pius XI “… certainly not the work of any human hand.”Pope Pius XII “The linen in which Joseph of Arimathea enveloped the sacred remains of our Lord Jesus Christ.”Pope John XXIII “This can only be the Lord’s own doing.”Pope Paul VI “…The image from the Holy Shroud reveals to us the human and divine personality of Christ.”Pope John Paul II “The Holy Shroud is the most splendid relic of the Passion and Resurrection.”Pope Benedict XVI “…should be seen as a photographic document of the darkest mystery of faith — that of Christ’s crucifixion and resurrection.”As we say in America, read ’em and weep….","date":"June 22, 2015 at 3:54 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","title":"A Memorable Photograph Worth a Thousand Words"},{"author":"nabber","post":"You may want to try your hand at interpreting English, David.  Pope Paul VI “…The image from the Holy Shroud reveals to us the human and divine personality of Christ.”Clearly, Paul VI is saying here, the Holy Shroud reveals to us the human and divine personality of Christ and that  theologically, then, nothing other than the Shroud and the New Testament reveal to us the human and divine personality of Christ. So being on an equal footing with the New Testament [according to Paul VI], the Shroud is Truth.  If a 14th century relic or other relic could have revealed such a thing, you would have had a declaration of such by another Pope.  You do not have such.Pope John Paul II “The Holy Shroud is the most splendid relic of the Passion and Resurrection.”  If you knew what the term “relic” meant to JP II, David, then you would understand what he meant by this statement.  Pity.  He also stated it as “THE most splendid relic” and not just “A relic”.Pope Benedict XVI “…should be seen as a photographic document of the darkest mystery of faith — that of Christ’s crucifixion and resurrection.”“A Photo of Christ’s Crucifixion and Resurrection.”  Couldn’t be any more clear, and you’re saying that it is not is the height of disingenuousness.","date":"June 23, 2015 at 7:57 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","title":"A Memorable Photograph Worth a Thousand Words"},{"author":"nabber","post":"In this case, I am the judge.  “..this relic is the authentic burial cloth of Christ”  is equal to “this is the most splendid relic of the Passion and Resurrection”, and if you can’t see it, you are in serious denial.  But then again, what would you care about what the Popes say?  They are nothing to you, or so the evidence shows.","date":"June 23, 2015 at 9:36 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","title":"A Memorable Photograph Worth a Thousand Words"},{"author":"nabber","post":"Got it, Dan.  But it’s seems peculiar that a member of the skeptic crowd really cares about what the Popes say, up until the point they think they can use the words….","date":"June 23, 2015 at 2:30 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","title":"A Memorable Photograph Worth a Thousand Words"},{"author":"nabber","post":"We’re so sure of what we know, aren’t we?  ” like the necessity that tells us, for example, that only a female who has been impregnated by the sperm of a male of the same species can give birth to offspring. That necessity reigns supreme, without exception, in nature.”  Mr. Linker, a female shark not too long ago underwent parthenogenesis, and had never been in the same tank as a male shark — marking the highest-order form of life to ever have this happen.  There’s one exception for you.  Has occurred often in various types of reptiles and fish.","date":"December 22, 2014 at 8:47 am","url":"https://shroudstory.com/2014/12/22/a-miracle-debate/","cat":"news_&_views","title":"A Miracle Debate"},{"author":"nabber","post":"Louis, where have you been?  Pope Francis I:  “By means of the Holy Shroud, the Unique and Supreme Word of God comes to us.”Just how clear would you like him to be?As they say, “you could Google it.”","date":"June 21, 2015 at 6:07 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","title":"A Memorable Photograph Worth a Thousand Words"},{"author":"nabber","post":"You’re kidding, Charles.  Gonella’s penultimate sin was to go along with not videoing the placement of the samples into the metal cylinders.  This was reportedly the only part of the process that was not video’d. If Ballestro was manipulated, as he said, then it was Tite plus Gonella in that back room against Ballestro.","date":"September 13, 2014 at 10:07 am","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","title":"A Reason to NOT DO More Scientific Testing on the Shroud"},{"author":"nabber","post":"Immediately, one can see a different mustache, duh….","date":"May 13, 2015 at 4:03 am","url":"https://shroudstory.com/2015/05/12/a-touch-of-the-ludicrous-for-a-tuesday-morning/","cat":"humor","title":"A Touch of the Ludicrous for a Tuesday Morning"},{"author":"nabber","post":"Mustache definitely not full, unlike Shroud image.","date":"May 14, 2015 at 5:40 am","url":"https://shroudstory.com/2015/05/12/a-touch-of-the-ludicrous-for-a-tuesday-morning/","cat":"humor","title":"A Touch of the Ludicrous for a Tuesday Morning"},{"author":"nabber","post":"You are truly confused…","date":"May 15, 2015 at 2:01 am","url":"https://shroudstory.com/2015/05/12/a-touch-of-the-ludicrous-for-a-tuesday-morning/","cat":"humor","title":"A Touch of the Ludicrous for a Tuesday Morning"},{"author":"nabber","post":"Louis, I had previously assumed you understood what sarcasm is….That was hilarious, although here in the Southern U.S., much of this goes as truth about “those Papists”.","date":"February 18, 2015 at 9:44 am","url":"https://shroudstory.com/2015/02/18/ash-wednesday-2015/","cat":"uncategorized","title":"Ash Wednesday 2015"},{"author":"nabber","post":"We can only hope that CB is so offended that he won’t return…..","date":"July 31, 2015 at 8:31 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","title":"Cherry Jam, the Metaphor"},{"author":"nabber","post":"Not a Christian.","date":"August 7, 2014 at 9:14 am","url":"https://shroudstory.com/2014/08/07/christian-piatt-jesus-told-me-that-the-shroud-of-turin-was-his-photograph/","cat":"news_&_views","title":"Christian Piatt: Jesus told me that the Shroud of Turin was his photograph."},{"author":"nabber","post":"Daveb:  Paul’s letters set down at an earlier time than the gospels?  Very much not a consensus view:Luke was a traveling companion of Paul, and is mentioned in three of Paul’s letters as “Luke the beloved physician.”  Luke joined Paul on his second missionary journey in Troas. During Paul’s third journey, Luke joined him in Philippi (Acts 20:6) and went with him to Jerusalem (Acts 20:16).Paul quotes Luke as Scripture:When Paul wrote to Timothy (1 Timothy 5:18) he quoted a passage from Luke as Scripture:  “FOR THE SCRIPTURE SAYS, ‘You shall not muzzle an ox while it treads the grain,’ and, ‘the laborer is worthy of his wages’.”The first verse quoted is from Deuteronomy 25:4. However, the second is a quotation of Jesus recorded by Luke: “The laborer is worthy of his wages” (Luke 10:7).  THIS SAYING IS NOT FOUND IN THE OLD TESTAMENT.  Paul uses the exact same Greek words that Luke used. Consequently, Paul must have known of Luke’s Gospel at this time and considered it Scripture.","date":"November 19, 2015 at 8:27 am","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"nabber","post":"The word “vanished” is the Greek “ginomai” which has a number of similar meanings but the best appears to be “became”, as in “became out of their sight”.Vanished =  DematerializedWhat that dematerialization would do to cloth, aye — there’s the rub.","date":"November 17, 2015 at 5:10 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"nabber","post":"Daveb:  C’mon Dave: “There seems to be no specific evidence that Paul was familiar with Christ’s earthly mission or had even encountered him.”Most theologians would say the Paul encountered Christ on the road to Damascus; in fact, most would say it was a physical encounter (light, sound).","date":"November 19, 2015 at 8:36 am","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"nabber","post":"Here ya go, Dan, your dematerialization:“They had a lengthy discussion, including inviting Jesus to their house, preparing a meal, and after the blessing, when he broke the bread, “their eyes were opened and they recognized him; and he vanished from their sight.”  (Luke 24:30-31)(the road to Emmaus)","date":"November 17, 2015 at 9:15 am","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"nabber","post":"Also, w.r.t. Verse 26 not offering any support to the idea that Jesus passed through anything:  “‘A week later his disciples were again in the house, and Thomas was with them. Although the doors were shut, Jesus came and stood among them and said, ‘Peace be with you.’ “:You are missing the logic of the author including specific words.  If there wasn’t something miraculous going on, the author would simply have said, “A week later his disciples were again in the house, and Thomas was with them.  Jesus came and stood among them and said, ‘Peace be with you’ “.But that’s not the way the passage was written:  the author included the words, “Although the doors were shut.”   Words have meaning and words have purpose.  The author clearly intended to convey that something very special happened.","date":"November 17, 2015 at 10:09 am","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"nabber","post":"For the proper way to prepare a Critical Summary of Silliness, you should contact the Ministry of Silly Walks…","date":"November 17, 2015 at 5:17 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"author":"nabber","post":"Note that this Angelico “shroud” is shown at the foot of the Cross. It has been theorized by many that there was a sheet of some kind used at the Cross to lay His body down on, and used as well to transport Him to the tomb  — which of course could not have been The Shroud used in the Tomb.  This other sheet would have been greatly smeared by blood in the process, and could not have been the same sheet as The Shroud.  Therefore, Angelico did not have to have been trying to portray The Shroud.","date":"April 15, 2015 at 7:50 am","url":"https://shroudstory.com/2015/04/15/fra-giovanni-angelicos-lamentation-to-be-displayed-with-the-shroud/","cat":"2010","title":"Fra Giovanni Angelico’s ‘Lamentation’ to be Displayed with the Shroud"},{"author":"nabber","post":"As I said, Charles, there is no way the Shroud was at the foot of the Cross.","date":"April 16, 2015 at 8:51 am","url":"https://shroudstory.com/2015/04/15/fra-giovanni-angelicos-lamentation-to-be-displayed-with-the-shroud/","cat":"2010","title":"Fra Giovanni Angelico’s ‘Lamentation’ to be Displayed with the Shroud"},{"author":"nabber","post":"Hugh, a past artist showing the Cross (or not), they probably were not engaged at all in any discussion over the existence of one/multiple shrouds, as we are today.  I’m  just making the point that a “carrying stretcher” -type shroud would have been quite smeared with blood and therefore could not have been the Shroud of the Tomb.  It seems to me that we in retrospect should not be wondering about why this particular representation has so little similarity to the SoT.","date":"April 17, 2015 at 7:49 am","url":"https://shroudstory.com/2015/04/15/fra-giovanni-angelicos-lamentation-to-be-displayed-with-the-shroud/","cat":"2010","title":"Fra Giovanni Angelico’s ‘Lamentation’ to be Displayed with the Shroud"},{"author":"nabber","post":"2 Corinthians, Chapter 12, verses 8-9:(Paul’s Thorn and God’s Grace)…8Concerning this I implored the Lord three times that it might leave me. 9And He said to me, “My grace is sufficient for you, for power is perfected in weakness.”Paul, telling us the words of Jesus…..","date":"June 4, 2015 at 12:56 pm","url":"https://shroudstory.com/2015/06/03/homeless-from-rome-visit-shroud-of-turin/","cat":"2015","title":"Homeless From Rome Visit Shroud of Turin"},{"author":"nabber","post":"Sampath, the entire New Testament is inspired by God.  If Matthew says that Jesus said something, the words of the Son of God, we take it as truth.  If Paul says that Jesus said something, the words of the Son of God, we take that as truth also.  There is no priority. This is mainstream Catholic and Protestant theology.","date":"June 5, 2015 at 7:23 am","url":"https://shroudstory.com/2015/06/03/homeless-from-rome-visit-shroud-of-turin/","cat":"2015","title":"Homeless From Rome Visit Shroud of Turin"},{"author":"nabber","post":"Dr. Soons acknowledged my email to him back in April on this matter, and I assumed he would then take that picture down as an example of superficiality of the image.  He never did.  I’m a little embarrassed for him.","date":"November 27, 2015 at 3:13 pm","url":"https://shroudstory.com/2015/11/27/i-hope-this-helps/","cat":"reader_inquiry","title":"I Hope This Helps"},{"author":"nabber","post":"I get your analogy using Oswald.  But for the sake of accuracy, let’s be clear:  the operation of that bolt rifle in the agreed-upon amount of seconds when JFK was in vew has been tested many times.  It was clearly easily repeated in a number of tests.  Facts are facts.","date":"November 24, 2014 at 11:14 am","url":"https://shroudstory.com/2014/11/24/ignoring-the-weight-of-the-evidence/","cat":"news_&_views","title":"Ignoring the Weight of the Evidence"},{"author":"nabber","post":"Conspire, yes.  Fact:  Oswald visited (or attempted to visit) the Soviet Embassy in Mexico City.  Because he passed out “Fair Play for Cuba” leaflets in New Orleans, there is just no way to completely know who his contacts were, for that.","date":"November 24, 2014 at 12:08 pm","url":"https://shroudstory.com/2014/11/24/ignoring-the-weight-of-the-evidence/","cat":"news_&_views","title":"Ignoring the Weight of the Evidence"},{"author":"nabber","post":"Dan,NEVER use “never”, “ever”, or “never ever” in a (philosophical) argument…","date":"September 15, 2014 at 9:42 am","url":"https://shroudstory.com/2014/09/13/mystery-is-never-ever-proof-of-anything/","cat":"science_and_religion","title":"Mystery is never ever proof of anything"},{"author":"nabber","post":"David, you are to believe whatever floats your boat. The point is that the RC Church does not believe in the priesthood of Protestant priests, and so most certainly DOES NOT recognize the consecration of Protestant Eucharist(s).  The Protestant religions don’t even believe in transubstantiation anyway (officially).Once they are Roman Catholic priests, there is no longer any issue.  But they still have to have a RC Bishop “lay hands” upon them.","date":"June 30, 2015 at 3:12 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"author":"nabber","post":"Dan,  don’t ever forget that the Catholic Church does not recognize the apostolic succession of priests of the Anglican and/or Episcopal churches.  Therefore, even if you believe in transubstantiation (and I, a non-Catholic, happen to), the RC Church does not believe it is legitimate even in a properly-conducted Anglican Mass.  So they really have no problem being in the same church area or preaching there while the Protestant charade (sorry, but accurate) goes on, in the name of ecumenism.  Their minds are made up and there is no change possible; especially about women priests.  (Pope JP-II spoke ex-cathedra on this subject).And, there is this:http://catholicexchange.com/ten-facts-most-catholics-don%e2%80%99t-know-but-should#7:  There is No Salvation Outside the Catholic Church:This dogma was declared at the Fourth Lateran Council and is a source of confusion for Catholics and non-Catholics alike.  It does not mean that non-Catholics cannot achieve salvation.“Individuals who are unaware that the Catholic Church is the one, true Church may still achieve salvation through the merits of the Church, despite their lack of knowledge.”","date":"June 30, 2015 at 2:21 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"author":"nabber","post":"daveb, I remain hopeful for Unification.  I went to RC school for 8-9-10-11 grades, did very well in the Catechism (as an Episcopalian) and still have a fondness for the RC Church.  I do find them to be very inclusive.  The list of 10 things that Catholics ought to know that they “believe”, is, however, in concrete.","date":"June 30, 2015 at 5:08 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"author":"nabber","post":"So, Jim, you are a lifelong and devout Catholic.  How do you so quickly cast aside JP-II’s ex cathedra statement on women priests?  You are some kind of Catholic, but my good friend Juan Carlos would label you a “cafeteria Catholic.”  “God loves all of us ….and welcomes all those with good hearts into His eternal kingdom regardless of their religious affiliation or even if they have any religious belief at all. ”Sounds good–and goes over very well down at the corner Unitarian Church (the guys who believe, you know, that Jesus was a good teacher.)  Your quote is not what the RC Church teaches.  But I guess as a RC, you get to make up your own rules.  It’s a Brave New World.","date":"July 1, 2015 at 2:07 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"author":"nabber","post":"Let’s make it clear what JP-2 was saying:  he was witnessing to an infallible dogma by the ordinary and universal Magisterium of the Roman Catholic Church.   So, while Jim Carney is correct about the 2 official Papal ex cathedra statements,  a Papal Statement attesting to an infallible Magisterium, is, in effect, infallible.And Jim needs to read:http://catholicexchange.com/ten-facts-most-catholics-don’t-know-but-shouldAnd Jim can spare me all the “peace and love” between cafeteria-Catholics and the rest.And I’m not RC.","date":"July 3, 2015 at 10:54 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"author":"nabber","post":"AONU said, ” The image on the shroud isn’t made obvious in the text, particularly John’s Gospel”.  True enough, but there are parts of the background to the New Testament and its authors, that were left behind by other sources such as the early Church Fathers.  Spain’s Mozarabic Rite Easter Week Liturgy is documented back to the late 500s AD – “Peter ran with John to the tomb and saw the recent marks of the dead and risen Man on the linen.”  — St. Isidore, the Bishop of Seville, Spain, is considered the author; he visited Constantinople in 582.","date":"July 4, 2015 at 9:35 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"author":"nabber","post":"I think you may have misunderstood what was going on with your Protestant friend.  His refusal to receive Catholic communion, out of acting on his own will, was invalid.  The RC priest is forbidden to give communion to Protestants.","date":"July 3, 2015 at 10:57 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"author":"nabber","post":"You seem to be under the impression that RC priests forbid things because they are enforcing some vague doctrine.  That couldn’t be further from the truth.  They are enforcing the Magisterium that makes up what the Church is and what it stands for.  Individuals by themselves cannot receive the Inspired word, regardless.  If you are not willing to enforce it in your own life, then “you may be a cafeteria Catholic.”","date":"July 4, 2015 at 9:27 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"author":"nabber","post":"Multiverses:  the last gasp of atheist/agnostic scientists to avoid the God of the Big Bang.The universal acknowledgement of the Big Bang in the 20th Century was the biggest blow to Atheism (a religion, ironically) in History.  Some of the atheist leaders immediately set to work on multiverses.  Multiverses, string theory, 17 dimensions:  absolutely no physical proof.  Nice mental exercise.  Even allowing for multiverses, they are still stuck with the Ultimate Cause.  There is no approaching those scientists who cannot allow for both Natural and Supernatural levels of existence (I suggest reading Paul Davies).  An endless argument ensues….","date":"June 30, 2015 at 7:50 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"author":"nabber","post":"Always with the negative waves, Moriarity….","date":"July 28, 2015 at 7:04 am","url":"https://shroudstory.com/2015/07/28/posting-for-a-slow-news-day/","cat":"uncategorized","title":"Posting For a Slow News Day"},{"author":"nabber","post":"Yikes, Kelly.  Dr. Soons is using this photo on the shroud3d website to supposedly illustrate the superciality of the IMAGE, not of BLOOD (which of course can soak all the way through the entire cloth).  It appears I will need another, different photo to show how the image lies on the very top of the fibrils…..Thank you.","date":"April 8, 2015 at 8:48 am","url":"https://shroudstory.com/2015/04/07/seeking-help-to-identify-an-image-called-superficiality/","cat":"reader_inquiry","title":"Seeking Help To Identify an Image Called Superficiality"},{"author":"nabber","post":"I received an acknowledgement finally from Dr. Soons, on 16 April.","date":"April 16, 2015 at 12:14 pm","url":"https://shroudstory.com/2015/04/07/seeking-help-to-identify-an-image-called-superficiality/","cat":"reader_inquiry","title":"Seeking Help To Identify an Image Called Superficiality"},{"author":"nabber","post":"Thank you so much, Dr. Heimburger.","date":"April 10, 2015 at 9:37 am","url":"https://shroudstory.com/2015/04/07/seeking-help-to-identify-an-image-called-superficiality/","cat":"reader_inquiry","title":"Seeking Help To Identify an Image Called Superficiality"},{"author":"nabber","post":"Thank you so much, Kelly.","date":"April 7, 2015 at 7:25 am","url":"https://shroudstory.com/2015/04/07/seeking-help-to-identify-an-image-called-superficiality/","cat":"reader_inquiry","title":"Seeking Help To Identify an Image Called Superficiality"},{"author":"nabber","post":"Some have told me that the dark spots could be from the blood areas of the Shroud.  Dr. Soons seems to be saying on his shroud3d website that these spots are where the image is, hence, “Superficiality”.  Does anyone have the answer?  If the photo is originally from Baima Ballone, and thinking about his work, then perhaps it is blood?","date":"April 7, 2015 at 8:08 am","url":"https://shroudstory.com/2015/04/07/seeking-help-to-identify-an-image-called-superficiality/","cat":"reader_inquiry","title":"Seeking Help To Identify an Image Called Superficiality"},{"author":"nabber","post":"Nice hatchet job by someone who is surely having his world-view challenged…..","date":"April 22, 2015 at 7:43 am","url":"https://shroudstory.com/2015/04/22/short-shrift-article-at-huffpo-uk/","cat":"2015","title":"Short Shrift Article at HuffPo-UK"},{"author":"nabber","post":"“Recent Popes have been careful to avoid pronouncing on the issue … opting to highlight its more symbolic resonance.”  Uhhhhh….NO.  That’s an out-and-out lie.  There is little to nothing of the symbolic in these words:Pope Pius XI (1922-1939):  “… certainly not the work of any human hand.”Pope Pius XII (1939-1958):  “The linen in which Joseph of Arimathea enveloped the sacred remains of our Lord Jesus Christ.”Pope John XXIII (1958-63):  “This can only be the Lord’s own doing.”Pope Paul VI (1963-78):  “…The image from the Holy Shroud reveals to us the human and divine personality of Christ.”Pope John Paul II (1978-2005): “The Holy Shroud is the most splendid relic of the Passion and Resurrection.”Pope Benedict XVI (2005-2013):  “… a photographic document of the darkest mystery of faith — that of Christ’s Crucifixion and Resurrection.”Pope Francis I (2013- ):  “By means of the Holy Shroud, the unique and supreme Word of God comes to us”","date":"April 22, 2015 at 7:49 am","url":"https://shroudstory.com/2015/04/22/short-shrift-article-at-huffpo-uk/","cat":"2015","title":"Short Shrift Article at HuffPo-UK"},{"author":"nabber","post":"Oh dear, You’re right, CB, the message is not getting through — to you.  How exactly does a hoaxer come to think up a simulation of a sweat imprint, if there has never been one seen on a shroud?  Can you cite an instance of even one, medieval or non-medieval?  If no one has seen one, how does a hoaxer think he will raise up a certainty in the the medieval mind that that it is a sweat imprint?","date":"November 25, 2014 at 1:42 pm","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"author":"nabber","post":"Archaeologists have found, it is said, “thousands” of shrouds over the many decades.  Let’s say it was only “hundreds.”  What percentage of those bodies were sweaty?  How manyof those left a sweat imprint?  One sweaty imprint is an Impossibility.","date":"November 25, 2014 at 11:06 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"author":"nabber","post":"It was not a sweat imprint, and here’s why:As the Wiki says, “there is no doubt that there was an image displayed in Rome in the thirteenth, fourteenth and fifteenth centuries which was known as the Veil of Veronica. The history is, however, PROBLEMATIC.” Nowhere can you reliably document that the image was a sweat-print.  The only inspection: in 1907 in St. Peter’s  when Jesuit art historian Joseph Wilpert  inspected the image, he saw only a piece of light-colored material, faded, with two faint rust-brown stains.  On the contrary, all the medieval paintings of the Veronica intended to show an actual colored portrait of Christ’s face (miraculously imprinted, they thought) and were not  portrayals of a sweat-print, leading any honest analyst to conclude that the Veronica was originally a PAINTING.  Even the common medieval “rube” would have known that a face-print is not created from someone rubbing the sweat and blood off of a man’s face–only a messy blob.  Therefore, anyone, cleric, artist, common-man, would have supposed the Veronica was a miraculous image and not a sweat imprint.","date":"November 26, 2014 at 9:47 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"author":"nabber","post":"Dan, the days won’t be the same without you and your “baby.”  Thank you, thank you, thank you.  I’ll even miss Hugh and Colin.  May God bless your future endeavors.  Don’t be a stranger…","date":"December 19, 2015 at 11:36 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"author":"nabber","post":"David:  “It is a test, for some, of our own faith – to see what is it exactly we do believe in: Jesus or an icon.”  False choice/analogy by you.  There is clearly another outcome:  we believe in Jesus AND in the icon/relic.  “OR” is a false choice.  But thanks for the poke in the eye made in the guise of reasonable-ness.","date":"June 18, 2015 at 11:34 am","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","title":"The Masters of Comedy in Piedmont"},{"author":"nabber","post":"Actually, a better and more accurate quote by John Paul II was, “The Holy Shroud is the most splendid relic of the Passion and Resurrection.”","date":"April 18, 2015 at 7:37 am","url":"https://shroudstory.com/2015/04/18/the-shroud-of-turin-in-the-wall-street-journal/","cat":"2015","title":"The Shroud of Turin in the Wall Street Journal"},{"author":"nabber","post":"Have you seen Roman first-century depictions of Israelites, such as Josephus?  Have you seen Agemian’s portrait of Jesus from the Shroud of Turin?  What the heck do you think 1st Century Israelites looked like?","date":"April 19, 2015 at 4:30 pm","url":"https://shroudstory.com/2015/04/18/the-shroud-of-turin-in-the-wall-street-journal/","cat":"2015","title":"The Shroud of Turin in the Wall Street Journal"},{"author":"nabber","post":"JP2 did say that the “Church” (i.e., Vatican so-called scientists) has no specific competence to pronounce.  But JP2’s comment re: “The Holy Shroud is the most splendid relic of the Passion and Resurrection” stands as an Absolute on the matter.  He can pronounce the Truth as he sees it, while a bunch of Vatican bureaucrats are indeed incapable.  The Cardinal’s Scientific Advisor in the matter of the C-14 testing did such a “great job” of advising on the science, didn’t he?  Ha.","date":"April 19, 2015 at 4:27 pm","url":"https://shroudstory.com/2015/04/18/the-shroud-of-turin-in-the-wall-street-journal/","cat":"2015","title":"The Shroud of Turin in the Wall Street Journal"},{"author":"nabber","post":"Angel, I’d like to know your basis for saying Christ’s complexion was “more than likely olive”. I haven’t seen  depictions of First Century Jews that would back that up.  Attempts to equate today’s Middle-Easterners with First Century Jews is misguided at best.It doesn’t appear to me that Roman depictions of Flavius Josephus (a.k.a. Joseph ben Matityahu in Hebrew) could be  considered olive-complected.  Thomas Heaphy’s book, (1880), The Likeness of Christ, shows early drawings / paintings from the catacombs of Rome, dated First or Second Century which show Christ and the Apostles with normal whitish faces, and certainly not olive.","date":"April 20, 2015 at 2:56 pm","url":"https://shroudstory.com/2015/04/18/the-shroud-of-turin-in-the-wall-street-journal/","cat":"2015","title":"The Shroud of Turin in the Wall Street Journal"},{"author":"nabber","post":"Do you see me in the future?  May 18th?","date":"May 4, 2015 at 7:36 am","url":"https://shroudstory.com/2015/05/04/tweeted-picture-for-today-are-we-there-yet-almost/","cat":"2015","title":"Tweeted Picture for Today:  Are We There Yet? Almost!"},{"author":"nabber","post":"http://www.drroyspencer.com/research-articles/Better read this first about “global warming”.Then we all can talk…..","date":"June 30, 2015 at 11:01 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"author":"nabber","post":"Wow, you are so open-minded.  And quoting a super-liberal website.  Nice.  I happen to know Roy Spencer,  and know that the piece “debunking” Spencer is itself bunk.","date":"June 30, 2015 at 11:32 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"author":"nabber","post":"Truth in advertising:  the figure of 97% consensus has been thoroughly debunked, and yet there it is on the NASA website.  NASA has been compromised by liberal fascism.49 former NASA scientists and astronauts sent a letter to NASA Administrator Charles Bolden in 2012 admonishing the agency for its role in advocating a high degree of certainty that man-made CO2 is a major cause of climate change while neglecting empirical evidence that calls the theory into question.The group, which includes seven Apollo astronauts and two former directors of NASA’s Johnson Space Center in Houston, are dismayed over the failure of NASA, and specifically the Goddard Institute For Space Studies (GISS), to make an objective assessment of all available scientific data on climate change. They charge that NASA is relying too heavily on complex climate models that have proven scientifically inadequate in predicting climate only one or two decades in advance.Select excerpts from the letter: •“The unbridled advocacy of CO2 being the major cause of climate change is unbecoming of NASA’s history of making an objective assessment of all available scientific data prior to making decisions or public statements.” •“We believe the claims by NASA and GISS, that man-made carbon dioxide is having a catastrophic impact on global climate change are not substantiated.” •“We request that NASA refrain from including unproven and unsupported remarks in its future releases and websites on this subject.”","date":"June 30, 2015 at 12:20 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"author":"nabber","post":"p.s., anoxie:  It is unwise of you to latch onto a weblink using the term “denier” for Dr Roy Spencer and his colleagues.  They are honest skeptics.  “Denier” was coined by the super-liberal columnist Ellen Goodman, specifically to liken them to the term “Holocaust Denier”, which she readily admitted.  Subsequently adopted by the whole Global Warming crowd.  This propaganda technique is so typical of liberal fascism.  In response, Dr Spencer coined or perhaps popularized the term “Green Nazis”, which is ironic in the extreme.  The type of ad hominem attack on Dr Spencer is not what we expect of scientists responding to skeptics who have data that they disagree with.","date":"June 30, 2015 at 12:33 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"author":"nabber","post":"Try to follow along.  The letter is just one example to show how NASA has drifted away from Science.OTOH, it is easy in the extreme to debunk the 97% horse-puckey…","date":"June 30, 2015 at 12:52 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"author":"nabber","post":"Oh, I don’t know anoxie, why don’t you read the following, and then you decide:  http://wattsupwiththat.com/2014/12/19/97-articles-refuting-the-97-consensus-on-global-warming/And, there’s not a person on this blog who can’t see the humor in this little piece of NASA front-page data:Global temperature Up +1.4 degrees F since 1880.Right.  Data coming from what?  And if it were accurate, coming from human activity?  Data?…and I haven’t considered your being serious even once….","date":"June 30, 2015 at 1:15 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"author":"nabber","post":"Fracking dangerous?  Data?  http://www.spiked-online.com/newsite/article/ten_big_fat_lies_about_fracking/13944I like consumerism.  Good luck without your T.P., David….","date":"June 30, 2015 at 1:27 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"author":"nabber","post":"Again, you don’t get it.  There is no way to know whether global temperatures are rising now, because natural year-to-year variability in global temperature is so large, with warming and cooling occurring all the time.  The magnitude of recent warming is somewhat uncertain due to problems in making long-term temperature measurements WITH THERMOMETERS without those MEASUREMENTS BEING CORRUPTED by a variety of non-climate effects. There is no way to know if temperatures are continuing to rise now. If we look at a more recent period of time,  since the record warm year of 1998, one could say that it has cooled in the last 17 years. We still don’t know  whether warming is happening now or will happen in the future.In the longer term, hundreds to thousands of years, there is considerable indirect, proxy evidence (not from thermometers) of both warming and cooling. Since humankind can’t be responsible for these early events, it is evidence that Nature can cause warming and cooling. If that is the case, it then opens up the possibility that some or most of the warming in the last 50 years has been natural, too.","date":"June 30, 2015 at 3:05 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"author":"nabber","post":"David:  we need to stop having so many children, or else we will run out of global resources.  Malthus proved it, right?  Maybe a good policy like they have in China would help.  BTW, about 15% of recycling in the U.S. comes from residential areas, 85% from corporations.  Our residential effort is trivial.  Meanwhile we are throwing into the garbage the new Eco-light bulbs full of mercury — wow, that made sense…..","date":"June 30, 2015 at 1:33 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"author":"nabber","post":"No, the easiest position in the world is to be a sycophantic liberal blindly following bad science.","date":"June 30, 2015 at 1:35 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"author":"nabber","post":"Gee, whiz, Dave, I wish my big brother was here to help me beat up on you…..p.s.  You using the term “you of all people” — you don’t know me nor do you know “squat all” about me.  And you wouldn’t know “Irony” if it ran over you.","date":"June 30, 2015 at 2:32 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"author":"nabber","post":"That was indeed a nice turn of a phrase.","date":"June 30, 2015 at 3:17 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"author":"nabber","post":"Not exactly true, Andy, about an official position. Who cares that some Vatican bureaucrats have not stated a position, when the Popes have in fact been clear:Pope Pius XI (1922-1939):  “… certainly not the work of any human hand.”Pope Pius XII (1939-1958):  “The linen in which Joseph of Arimathea enveloped the sacred remains of our Lord Jesus Christ.”Pope John XXIII (1958-63):  “This can only be the Lord’s own doing.”Pope Paul VI (1963-78):  “…The image from the Holy Shroud reveals to us the human and divine personality of Christ.”Pope John Paul II (1978-2005): “The Holy Shroud is the most splendid relic of the Passion and Resurrection.”Pope Benedict XVI (2005-2013):  “… a photographic document of the darkest mystery of faith — that of Christ’s Crucifixion and Resurrection.”Pope Francis I (2013- ):  “By means of the Holy Shroud, the unique and supreme Word of God comes to us”","date":"April 22, 2015 at 7:53 am","url":"https://shroudstory.com/2015/04/22/ye-shall-know-them-by-their-photographs/","cat":"2015","title":"Ye shall know them by their photographs"},{"author":"nabber","post":"I think the Popes say what they mean.  “The Vatican” says all kinds of things, some of which it retracts a few weeks later….","date":"April 23, 2015 at 7:36 am","url":"https://shroudstory.com/2015/04/22/ye-shall-know-them-by-their-photographs/","cat":"2015","title":"Ye shall know them by their photographs"}],"opinion":[{"author":"nabber","post":"Reading the verbatim words of the sermon is not “reading into” the sermon….","date":"December 10, 2015 at 11:08 am","url":"https://shroudstory.com/2015/12/10/allusions/","cat":"guest_posting","title":"Allusions"},{"author":"nabber","post":"Hatfield:  “after all, Jesus refused to use spectacular signs to authenticate himself.”Does this guy really read the New Testament?  Or is he just unbelievably selective in doing so?John 14:11. Believe me when I say that I am in the Father and the Father is in me; or at least believe on the evidence of the miracles themselves.  Acts 1:3 — “after His suffering, He presented Himself to them and gave many convincing proofs that  He was alive.”Spectacular signs?  How about raising people from the dead?","date":"October 24, 2015 at 10:14 am","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","title":"And now you have something to do this weekend"},{"author":"nabber","post":"David:That is the worst logic I have seen and I cannot believe you wrote that in public.The “divinely-inspired Scriptures” are de facto not human constructs, because they were directed by the guiding hand of the Holy Spirit.  If you don’t understand this, you have a limited understanding of Christianity.One does not have the unique and supreme Jesus Christ come to him from a human construct. I believe that the importance of the Shroud (if authentic) comes from the Blood, not the image.  Was Christ’s blood sacrifice for the sins of the world just a spiritual act?  Or was it both a spiritual and physical act?  [Yes]. In other words, it was necessary that His blood had also to be physically spilled.  Because His sacrifice extends from the Cross infinitely in both directions, Past and Future, the Blood on the Shroud has special significance.  He is still with us, bodily — as he said in Matthew, and also from the evidence of the Ascension.  Perhaps the Blood on the Shroud is a reminder of that.","date":"August 12, 2015 at 11:09 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"author":"nabber","post":"We’re not talking of the physically-produced Bible(s), and that is a red herring.   But we do take our faith from the Gospels (and letters), and analogous to ink on parchment, the Shroud is a sort of Photograph on linen, and if authentic, represents a Fifth Gospel (IMHO).  Again, the Blood is the Key.","date":"August 12, 2015 at 11:37 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"author":"nabber","post":"OK, Louis, you’re going to get hit with it again, because you are not considering the quotations of the Popes:Pope Pius XI (1922-1939):  “… certainly not the work of any human hand.”Pope Pius XII (1939-1958):  “The linen in which Joseph of Arimathea enveloped the sacred remains of our Lord Jesus Christ.”Pope John XXIII (1958-63):  “This can only be the Lord’s own doing.”Pope Paul VI (1963-78):  “…The image from the Holy Shroud reveals to us the human and divine personality of Christ.”Pope John Paul II (1978-2005): “The Holy Shroud is the most splendid relic of the Passion and Resurrection.”Pope Benedict XVI (2005-2013):  “…should be seen as a photographic document of the darkest mystery of faith — that of Christ’s crucifixion and resurrection.”Pope Francis I (2013- ):  “By means of the Holy Shroud, the unique and supreme Word of God comes to us.”The Popes could not say those things above and not believe in authenticity.","date":"August 12, 2015 at 11:13 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"author":"nabber","post":"Since I was there in May, Hugh, let me say that you really have no idea, in your “imagining”.","date":"August 12, 2015 at 8:02 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"author":"nabber","post":"Pope Francis:  “By means of the Holy Shroud, the unique and supreme Word of God comes to us.”This statement really could not be any clearer.","date":"August 12, 2015 at 8:00 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"author":"nabber","post":"Let me translate for the theologically confused:  “the unique and supreme Jesus Christ comes to us.”   (Jesus Christ = Word of God).","date":"August 12, 2015 at 8:04 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"author":"nabber","post":"Be sure to aim for a 12-foot image with about the same body and facial details as the Shroud.  Otherwise, small approximate representations avail nothing…..","date":"April 18, 2015 at 7:31 am","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"author":"nabber","post":"Hugh, reference yr comment on “intact” blood stains.  I admit that the meaning of  “intact” may be in the eye of the beholder; however,  consider the Shroud blood clots in the area off of the left elbow and the blood clot on the wrist:  most people who have pulled band-aids off of “scabs” probably remember that the pattern left on the fabric and that left on the skin show a number of internal “holes” that is formed completely randomly.   Even with the passage of time, you do not see that on those two Shroud blood clots.","date":"June 10, 2015 at 9:04 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"author":"nabber","post":"Yannick, as to the “manual extraction”, what about the blood clots?    Dr. Pierre Barbet, Chief Surgeon at St. Joseph Hospital in Paris, stated in his book, A Doctor at Calvary (1956):  “The undisturbed aspect of the blood clots cannot be explained scientifically.”A blood clot must be moist to transfer to linen.  On Friday evening, if the linen had been lifted off of the body, moist clots would have smeared the linen. By early Saturday, any blood clots would have dried up and been attached firmly to both skin and cloth.   At that point, lifting the linen off of the body would have broken up many, if not all, of the dry blood clots.However, blood clots on the Shroud show up perfectly intact, not smeared or broken.The Gospels record that the Body was gone by Sunday morning, and that undisturbed linens were left behind.  Therefore, the BLOOD EVIDENCE shows that NO ONE lifted the Shroud off of the Body.","date":"June 8, 2015 at 10:58 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"author":"nabber","post":"Do the historical doubters ignore the Talmudic sources (2) also?  Why would the Jews proliferate the idea that a mythical figure was a real historical figure?  Why would the Apostles and the key disciples accept martyrdom for an idea supposedly emanating from a mythical figure?  Are there any parallels to that?","date":"October 6, 2014 at 11:21 am","url":"https://shroudstory.com/2014/10/06/jerry-coyne-once-again/","cat":"other_blogs","title":"Jerry Coyne Once Again"},{"author":"nabber","post":"This is not a new objection, but I’ll raise it again:  How many 14 by 4 ft pieces of linen (let’s assume they’re fairly valuable, and time-consuming to make) would you have to ruin before you “scorched” it just right (the image being a whole body-length, front and back)?  50?  ???","date":"September 24, 2014 at 4:18 pm","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","title":"Samuel Johnson Meets His Match"},{"author":"nabber","post":"The Pope says, “God -whom we know as Allah…” ?  Insanity.  The “Allah” of the Koran is nothing like God.  If Allah exists, it is some other entity.","date":"August 20, 2015 at 7:57 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","title":"The End if Near"},{"author":"nabber","post":"That is pure horse-puckey.  “Most scholars concur”?  “Most ‘scholars’ named David Goulet”.  Prove it.  And, that’s NOT to what the Pope refers, anyway.  Stay with the subject.","date":"August 21, 2015 at 7:34 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","title":"The End if Near"},{"author":"nabber","post":"Charles: ” Wilson’s theory only works if you have three doublings and this cannot fit with any plausible definition of tetradiplon.”How disingenuous.  Charles’ main role is as a “grenade thrower” on this blog, because his world-view is threatened at its core by the idea of an authentic Shroud.  Here’s “plausible” mister:  Looking at the full-length of the Shroud “back in the day”, one would see enough evidence of folds to realize that the Shroud as folded for display in Edessa would have appeared as eight rectangles.  Rectangles 1 and 2, with a fold between them, can easily be thought of as a “doublet”, and so on down with Rectangles 3 and 4, 5 and 6, 7 and 8.  Four doublets.  To hang on to “Tetradiplon” as the “act of physically making four folds in half” is disingenuous — Tetradiplon would have been used to describe an appearance, not an act.","date":"September 10, 2014 at 11:02 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"author":"nabber","post":"No, in this case, “we cannot desist”.  To paraphrase Daveb, a grenade-thrower is a grenade-thrower is a grenade-thrower.  Or, as the kids say, “it is what it is”.Hugh, on the other hand, just plants land-mines…..","date":"September 10, 2014 at 11:34 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"author":"nabber","post":"Hugh, you are a frequent contributor to the message board of the James Randi Educational Foundation (JREF), who abhors the Shroud and who is the world’s leading skeptic on everything (congratulations, BTW, on your finding of a messiah), and also of the message board of GodandScience.org, where you represent well the Darwinists.  There is no way that you have a smidgin of neutrality about you on the subject of the Shroud. In this case, guilt-by-association actually works quite well. There is plenty wrong with your evidence, and there are many on this board who have pointed out the problems, no need for me to start now.","date":"September 10, 2014 at 3:03 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"author":"nabber","post":"That’s one of the most convoluted flows of logic seen on this blog.  You didn’t come close to answering why Tetradiplon wouldn’t logically represent the state of the Shroud in Edessa (and maybe before); further, why the mythic face-cloth-that-Jesus-wiped-his-face-on is ever discussed seriously here, I don’t get it.  Objections to “tetradiplon” and “oh-that-pattern on the Codex does not represent herringbone”  are laughable on their face and does not represent serious skepticism.  Perhaps doubting of coins and flowers is somewhat serious skepticism.Naturally “Jesus’ Shroud” doesn’t threaten your world view, just the Shroud of a Divine Messiah (think: undisturbed blood clots).  I’m pretty sure from your books, that wouldn’t fit in your world view.  Like Hugh, you’re not really “anti-Shroud”, you’re anti-supernatural, anti-Divine.  Not neutral, ever; in fact your agenda demands that you check it before commenting here.","date":"September 10, 2014 at 1:55 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"author":"nabber","post":"Footnote 11 (quoting Charles) in the wiki is asinine.  When you start maintaining that Jesus’ disciples would be fooled by Temple Priests outside the Tomb posing as angels, you have lost all credibility.  I think the disciples knew Temple Priests, don’t you?","date":"September 10, 2014 at 2:28 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"author":"nabber","post":"I think this review of Holy Bones, Holy Dust says it all:  “I would not, however, recommend this book to my university students of medieval history because it is full of too many conclusions lightly arrived at and ill-defended, provocative teasers with little substance to back them up… Freeman’s claim that Gothic architecture was a child of the relic business needs a lot more proof than he is willing to furnish.” “Provocative teasers”  :  has this reviewer been reading this blog?Perhaps Charles’ Amazon book ranking of #323,413 was way too high.  A retired military friend of mine, not a writer, who wrote a book (really a pamphlet) on how to transition into military retirement, had a higher Amazon book ranking than that….","date":"September 10, 2014 at 2:40 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"author":"nabber","post":"David, nothing about these discussions challenges my worldview.  I am quite serene about the Resurrection, the “proof” for which consists mainly in the sacrifice of the Apostles of their fortunes and their lives to spread the Word, something they (nor anyone) never would have done for a lie.   And of course, faith is key, so the eventual truth about the Shroud, one way or the other, has no effect on my worldview.  The same cannot be said of the skeptics, who, although they deny it every time, live in dread fear that the Shroud will be proven true and in addition, the Resurrection.  This does challenge their worldview, which is why so many of them spend so much time here.","date":"September 11, 2014 at 5:07 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"author":"nabber","post":"why do you even bother?","date":"July 12, 2015 at 1:34 pm","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","title":"The Meaning of Solid"}],"researchers":[{"author":"nabber","post":"He’s deluded.  Only a fuss-budget would quibble about tetradiplon.  If one could see 8 sections, which one could, any common man would say tetradiplon — what would you expect him to say upon seeing 8 sections — tri-diplon?  At U.S. military academies, there is an Honor Code.  “Quibbling” is still considered as breaking the Honor Code, i.e., lying.","date":"May 7, 2015 at 8:12 am","url":"https://shroudstory.com/2015/05/07/charles-freeman-on-tetradiplon-and-the-video-on-shroud-com/","cat":"comments_promoted","title":"Charles Freeman on Tetradiplon and the Video on shroud.com"},{"author":"nabber","post":"Stephen, Excellent post.  There is certainly more that could be pointed out about Freeman's deceptiveness, and I hope you will do so at some point.","date":"October 29, 2014 at 4:03 AM","url":"http://theshroudofturin.blogspot.com/2014/10/my-critique-of-charles-freemans-claim.html","title":"My critique of Charles Freeman's claim that the Turin Shroud was made for a medieval Easter ritual"},{"author":"nabber","post":"Nice “Zinger”, anoxie, that should leave Colin speechless….","date":"August 28, 2014 at 11:11 am","url":"https://shroudstory.com/2014/08/28/a-response-to-a-comment-by-colin-berry/","cat":"uncategorized","title":"A Response to a Comment by Colin Berry"},{"author":"nabber","post":"It seems to me that the mouth-is-open-so-teeth-can-be-seen theory goes directly against themouth-is-held-closed-by-a-jawband theory.","date":"September 3, 2014 at 2:07 pm","url":"https://shroudstory.com/2014/09/03/you-might-think-st-louis-was-all-about-gary-habermas/","cat":"press_coverage","title":"You might think St. Louis was all about Gary Habermas"},{"author":"nabber","post":"You’re right.  I  held my jaw in the locked position and  was still able to make a toothy grin (of sorts), but ir requires that the muscles of the cheek and chin area both retract a little (rigor mortis?)","date":"September 3, 2014 at 3:03 pm","url":"https://shroudstory.com/2014/09/03/you-might-think-st-louis-was-all-about-gary-habermas/","cat":"press_coverage","title":"You might think St. Louis was all about Gary Habermas"},{"author":"nabber","post":"Ya gotta love that anoxie….nicely done…","date":"September 3, 2014 at 2:01 pm","url":"https://shroudstory.com/2014/09/03/you-might-think-st-louis-was-all-about-gary-habermas/","cat":"press_coverage","title":"You might think St. Louis was all about Gary Habermas"},{"author":"nabber","post":"Of course, you are talking about the same sort of folks who dismiss the “Four Holes in an L-shape” pattern on the Pray Codex illustration of 1192 AD as either a coincidence or that it represents some sort of architecture pattern…..  That is the one they really would die for, in defense of their skepticism, because they go to embarrassingly extreme lengths to fantasize an answer.  1192 being outside of the possible range of their “precious” C-14 dating, don’t you know…..","date":"October 23, 2015 at 1:22 pm","url":"https://shroudstory.com/2015/10/22/available-critical-summary-version-3-0/","cat":"critical_summary","title":"Available: Critical Summary Version 3.0"},{"author":"nabber","post":"“which clearly isn’t there”….according to Hugh’s prejudice.  Said as a fact, when it CLEARLY is an opinion that varies among different contributors to this site.  He must be a lot of fun in the classroom….","date":"October 23, 2015 at 1:14 pm","url":"https://shroudstory.com/2015/10/22/available-critical-summary-version-3-0/","cat":"critical_summary","title":"Available: Critical Summary Version 3.0"},{"author":"nabber","post":"Then inexactly call them fantasies.  Either way….","date":"October 23, 2015 at 2:54 pm","url":"https://shroudstory.com/2015/10/22/available-critical-summary-version-3-0/","cat":"critical_summary","title":"Available: Critical Summary Version 3.0"},{"author":"nabber","post":"I have just put the two negatives side-by-side, the Enrie photo from Shroud Scope, and the Pia negative from the Musée de l’Élysée, Lausanne  – there is a clear match of the Enrie markings found below the throat, with the Pia negative in the same location.  It SIMPLY IS PRESENT in the Pia photo, and any fair-minded person with normal eyesight can see it.  But, there is none so blind as he who will not see….Dan: please post the photos side-by-side….","date":"October 23, 2015 at 9:43 am","url":"https://shroudstory.com/2015/10/22/available-critical-summary-version-3-0/","cat":"critical_summary","title":"Available: Critical Summary Version 3.0"},{"author":"nabber","post":"Not really confident about how to post a picture here, but you can go this website and see the 2 negatives side by side…..http://www.pbase.com/nabber/image/161658524","date":"October 23, 2015 at 10:41 am","url":"https://shroudstory.com/2015/10/22/available-critical-summary-version-3-0/","cat":"critical_summary","title":"Available: Critical Summary Version 3.0"},{"author":"nabber","post":"David, I wouldn’t say trick of the lighting, I would say that you can’t dismiss lighting conditions, as Hugh did.Lighting:  On the Pia photo, the large crease (running across the beard) has a prominent “gleam” on the left end which the Enrie photo doesn’t have.  Also, when both are magnified further, that Pia “large crease” meanders and curves its way across the neck, while the Enrie “large crease” is much more straight, which might mean the Shroud was hanging differently during the 1898 and 1931 sessions.  Hugh also plays fast and loose with his blue lines and orange lines.  I see it differently:Pia before and after (orange arrows): http://www.pbase.com/nabber/image/161660093Enrie before and after (blue arrows):http://www.pbase.com/nabber/image/161660095The real question is, what did the coin-minters see on the Shroud positive image and how dark was it then?Obviously they were not allowed to see the whole object, because if they had detected it was a burial shroud, they would have known that Jesus would have been naked.  Just what the two lines on a naked body really were has been the subject of several papers.","date":"October 23, 2015 at 1:07 pm","url":"https://shroudstory.com/2015/10/22/available-critical-summary-version-3-0/","cat":"critical_summary","title":"Available: Critical Summary Version 3.0"},{"author":"nabber","post":"I cite the 945 AD coin, not the 692 AD coin:1.  The Constantine VII 945 AD coin had two unmistakeable signs of the Shroud:  the distinctive “Lock of Hair” (hair as seen by several artists), an exact match to the “3” blood-mark on the forehead of the Shroud man; and the swollen cheek.  Two other things add less convincing matching:  the similar beard and the hair parted in the middle.2. Constantine VII almost certainly had seen the Shroud image as full-length.3.  Constantine VII knew the Shroud body image was naked.4.  Therefore, Constantine VII knew the “wrinkles” below the neck on the Image were not part of a tunic.5.  Constantine VII commissioned the image of Christ as clothed, and merely added the wrinkles below the neck as a typical tunic feature, as used before on other images in other times.6.  The “3” mark plus the swollen cheek taken together are a sure lock that the Shroud was the model and therefore the Shroud existed well before the Middle Ages.7.  The wrinkles are probably a distraction in this whole argument.","date":"November 3, 2015 at 9:40 am","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)"},{"author":"nabber","post":"Piero, “the Epsilon seems to be mislocated” — on a coin of this size (or any size), the ability of the “artist” to precisely locate something like the Epsilon would have been difficult indeed.","date":"November 5, 2015 at 12:48 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)"},{"author":"nabber","post":"Here’s an enlargement of a different gold solidus of Constantine VII:http://www.pbase.com/nabber/image/161767140It’s amazing that the die-maker was able to portray such small features on the coin.  One can see that the “hairs” and the swollen-cheek and the eye are all similar in size, and that all were able to be captured by the die-maker.","date":"November 3, 2015 at 3:39 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)"},{"author":"nabber","post":"And you’re one of those that deny the 4 L-shaped holes, herringbone weave, and blood mark on the forehead from the Pray Manuscript.  You folks really undermine the anti-authenticist case.  (and watch your manners….)","date":"November 5, 2015 at 12:42 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)"},{"author":"nabber","post":"Stephen, there is so much political BS going on at Google that I suspect they are subtly (or not so subtly) doing this because of your first two blogs' subjects...","date":"July 10, 2014 at 9:35 PM","url":"http://theshroudofturin.blogspot.com/2014/07/stephen-e-jones-home-page-wont-harm.html","title":"Stephen E. Jones' home page WON'T harm your computer!"},{"author":"nabber","post":"Freeman = Oscar “Humbug” Diggs…..","date":"June 13, 2015 at 6:13 am","url":"https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/","cat":"video","title":"Thomas De Wesselow On Why the Image is Unlikely by an Artist"},{"author":"nabber","post":"“IGNORE those anonymous art historians behind the curtain!”","date":"June 13, 2015 at 6:15 am","url":"https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/","cat":"video","title":"Thomas De Wesselow On Why the Image is Unlikely by an Artist"},{"author":"nabber","post":"We would say in America,  “Charles Freeman can’t even carry DeWesselow’s jockstrap….”","date":"June 12, 2015 at 3:26 pm","url":"https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/","cat":"video","title":"Thomas De Wesselow On Why the Image is Unlikely by an Artist"}],"resources":[{"author":"nabber","post":"There is no end to the variety of whips/flagra that Roman soldiers could have created for punishment.  The lack of such objects that have survived to the present day testifies to their casual construction (in most cases), as well as to their disgusting nature after much use (objects to be thrown away).  What’s really the point of the non-authenticists, anyway — the scourge marks have been shown to be non-paint and in some examinations, blood.  There is little doubt that any medieval hoaxer working on a real human body would have used whip marks, not flagrum marks, not having any knowledge to the contrary.","date":"May 27, 2015 at 7:40 am","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","title":"A Treasure of Reading Material"},{"author":"nabber","post":"Freeman said: “all forensic scientists I have consulted have taken, that the blood stains are too red to be real blood. Heller or Adler’s hypothesis of stress and bright red blood has never been replicated or taken seriously by anyone other than Barrie Schwortz,”And what of Ray Rogers’ Los Alamos colleague Diane Soran’s experiment with Saponaria-washed cloth, where 25-year-old samples stil showed red blood, while the control samples were black?  And what of Molecular Biologist/Archaeologist Thomas Loy noting that he has seen red blood marks on artifacts that are thousands of years old?All forensic scientists you consulted say blood stains are too red?  Nice job of picking your consultants! How many consultants?  Did they know jack-all about archaeology?","date":"November 6, 2014 at 10:11 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"author":"nabber","post":"Pope Francis:  “By means of the Holy Shroud, the unique and supreme Word of God comes to us.”","date":"May 7, 2015 at 8:14 am","url":"https://shroudstory.com/2015/05/07/at-the-heart-of-the-shroud-exposition-is-a-great-mystery/","cat":"article","title":"At the Heart of the Shroud Exposition is a Great Mystery"},{"author":"nabber","post":"Nice job of simply repeating yourself ad nauseam.  Unfortunately for you, all of your arguments have been refuted…","date":"July 13, 2015 at 9:15 am","url":"https://shroudstory.com/2015/07/12/barrie-schwortz-colin-berry-and-some-good-reporting-in-fort-wayne/","cat":"article","title":"Barrie Schwortz, Colin Berry and Some Good Reporting in Fort Wayne"},{"author":"nabber","post":"“…its authenticity. The Catholic Church takes no official position on that….  Ever since radiocarbon dating in 1989 proclaimed the linen to be roughly 700 years old, the Church has avoided claiming that it is anything more than an icon…”This is absolutely untrue, as I have quoted the last 7 Popes in threads here before: Pope Pius XI:  “… certainly not the work of any human hand.”Pope Pius XII:  “The linen in which Joseph of Arimathea enveloped the sacred remains of our Lord Jesus Christ.”Pope John XXIII:  “This can only be the Lord’s own doing.”Pope Paul VI:  “…The image from the Holy Shroud reveals to us the human and divine personality of Christ.”Pope John Paul II: “The Holy Shroud is the most splendid relic of the Passion and Resurrection.”Pope Benedict XVI:  “…should be seen as a photographic document of the darkest mystery of faith — that of Christ’s crucifixion and resurrection.”Pope Francis I:  “By means of the Holy Shroud, the unique and supreme Word of God comes to us.”The RC Church is an absolute monarchy, in no uncertain terms.  The Popes speak for the Church on matters of Faith.  The Popes have spoken on the Shroud. Let the skeptics at BBC chew on that for a while….","date":"June 19, 2015 at 7:41 am","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","title":"BBC News Magazine:  The Perplexing Image"},{"author":"nabber","post":"HF:  “the Pope certainly does not speak for the Catholic Church except in very rare circumstances”.  This is absolutely, positively WRONG.  Your statement only refers to the Pope speaking “ex cathedra” on matters of Church dogma, which are rare.“The Church’s magisterium is exercised in cases not having the solemnity of “ex cathedra” statements by Popes, in written documents such as Papal catechisms, encyclicals and pastoral letters, or orally, as in homilies. These statements are part of the ordinary magisterium of the Church.”“the response called for from Catholics, to this ordinary magisterium, is that of the Religious Submission of Will and Intellect. This kind of response cannot be simply exterior or disciplinary, but must be understood within the logic of faith and under the impulse of obedience to the faith.”HF: “[the Popes’ words that] …the Shroud to be a very important artefact with significant relevance to the revelations of Christ, but that is not the same thing as pronouncing on its authenticity.”If the Popes’ words were “carefully worded” and “not the same thing” then how do you square the words of the last 3 Popes with that?Pope John Paul II: “The Holy Shroud is the Most Splendid Relic of the Passion and Resurrection.”Pope Benedict XVI:  “…should be seen as a Photographic Document of the Darkest Mystery of Faith — that of Christ’s Crucifixion and Resurrection.”Pope Francis I: “By means of the Holy Shroud, the Unique and Supreme Word of God comes to us.” Very, very definitive except to the most blind and deaf of skeptics…..","date":"June 20, 2015 at 9:00 am","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","title":"BBC News Magazine:  The Perplexing Image"},{"author":"nabber","post":"You are quite wrong.  Read my statement about the ordinary magisterium above.","date":"June 20, 2015 at 9:01 am","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","title":"BBC News Magazine:  The Perplexing Image"},{"author":"nabber","post":"Max, quit correcting your typos; it’s annoying and makes you look OCD….","date":"July 10, 2015 at 4:38 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","title":"Christian Faith Eroded to the Very Core?"},{"author":"nabber","post":"Just the fact that the Shroud was described as a painting disqualifies that whole discussion.  Already in the Sixth Century learned men could tell it was not a painting, as it was described more than once as not made by human hands.","date":"May 4, 2015 at 7:40 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"author":"nabber","post":"Let’s go by the only written record we have, shall we?:  John 19:32-35 – “So the soldiers came and broke the legs of the two men on the crosses beside Jesus. 33 But when the soldiers came close to Jesus, they saw that he was already dead. So they did not break his legs.34 But one of the soldiers stuck his spear into Jesus’ side. Immediately blood and water came out. 35 The one who saw this happen has told about it. He told about it so that you also can believe. The things he says are true. He knows that he tells the truth.Quintilian, Roman historian, wrote in the 1st Century AD: “A victim’s relatives were permitted to take down the body and bury it, if the victim was first pierced  by the executioners.”","date":"May 29, 2015 at 7:03 am","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"author":"nabber","post":"“I’m sorry you were misled”, you mean…..past tense…..I thought you were a teacher.  ;^}","date":"April 8, 2015 at 8:56 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","title":"Easter Ink"},{"author":"nabber","post":"Exactly how can fumes of any kind leave behind a detailed image?  Do you have an example of such?","date":"April 8, 2015 at 8:57 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","title":"Easter Ink"},{"author":"nabber","post":"I urge everyone to read Stephen Jones’ expose’ of the deceptive nature of Freeman’s comments on a host of Shroud topics, extending over many years.  Proofs abound.","date":"October 28, 2014 at 1:54 pm","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"author":"nabber","post":"The number of gross misrepresentations and outright lies in one article is staggering…","date":"February 11, 2015 at 9:15 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"author":"nabber","post":"Colin, regarding your Kim picture:  you have a lot of time on your hands, re: computer use, so I warn you to be careful about what you do with it.   The pic doesn’t belong on a website like this, IMHO.  Dan:  your judgment failed you this time.","date":"February 12, 2015 at 8:34 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"author":"nabber","post":"Pi$$ – poor analogy, Mr. P.Weak.","date":"February 12, 2015 at 11:57 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"author":"nabber","post":"Merely silly. Terminally cute.","date":"February 12, 2015 at 3:39 pm","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"author":"nabber","post":"I sense panic….  Always satisfying…..","date":"September 13, 2014 at 9:59 am","url":"https://shroudstory.com/2014/09/12/surprising-paper-out-of-bari-plant-dna-studies-on-the-shroud-of-turin/","cat":"article","title":"Surprising Paper out of Bari: Plant DNA Studies on the Shroud of Turin"},{"author":"nabber","post":"daveb:  Why would Jesus have given his mother Mary over to the care of John, if there indeed had been siblings to take her in?  Not many people would believe that all the siblings had died by that time; possible but not likely.  James survived, if he was indeed a brother.  What was Meier’s assumption?","date":"September 30, 2015 at 9:26 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","title":"The Shroud of Canterbury"},{"author":"nabber","post":"“Normally the limit was two metres although away from Palestine an Egyptian ground loom could do more but the examples are a lot earlier.”What the heck difference does it make that the Egyptian looms were a lot earlier?  [Let me answer this for you — “None”].  Any loom invented before 1st Century, according to all the rules of logic, could clearly exist in 1st Century Israel.   So you invite comment, but prefer to disallow obvious examples.  You are disingenuous to the extreme….","date":"February 13, 2015 at 4:12 pm","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","title":"Two More Articles About Upcoming CNN Series on Finding Jesus"},{"author":"nabber","post":"thanks for the great rundown on dates….","date":"June 30, 2015 at 11:21 am","url":"https://shroudstory.com/2015/06/25/who-is-he/","cat":"article","title":"Who Is He?"},{"author":"nabber","post":"“There were a number of doomsday preachers like him in the Judaean desert, belonging to small, isolated, baptismal sects, and he was the prominent one…”Name one or two for us, why don’t you?  “Brian” doesn’t count…..","date":"February 13, 2015 at 4:01 pm","url":"https://shroudstory.com/2015/02/13/more-information-on-the-book-finding-jesus/","cat":"books","title":"More Information on the Book ‘Finding Jesus’"},{"author":"nabber","post":"For Louis and O.K.  —  From Josephus I get that Banus was an ascetic who lived in the desert.  Period.  Louis said “there were a number of doomsday preachers like John in the Judean desert belonging to baptismal sects.”  NO, that is not what comes out of Josephus.  Please, give good examples instead of what seems to be great exaggerations.","date":"February 16, 2015 at 12:27 pm","url":"https://shroudstory.com/2015/02/13/more-information-on-the-book-finding-jesus/","cat":"books","title":"More Information on the Book ‘Finding Jesus’"},{"author":"nabber","post":"Louis, for goodness sake, you cannot post on this blog and throw in details that seemingly make John just “one of the gang”, and somehow expect qualifiers like “probably” to cut it.   1.  No, there were not “a number” of people like John; “probably” doesn’t count when you’re making statements like that.   2. No, there weren’t lots of “doomsday preachers”, there is nothing stating that Banus was a doomsday preacher, and just being an Essence doesn’t make him one.  3.  No, you have no record of other “baptismal sects” besides John and Jesus (His disciples doing so in His Name), which clearly the Gospel of John states.  There is no record of Banus being a baptizer, which again, his being an Essene doesn’t make him one.  Now I hope you get “what the problem is.”  Don’t generalize, don’t exaggerate.","date":"February 16, 2015 at 3:28 pm","url":"https://shroudstory.com/2015/02/13/more-information-on-the-book-finding-jesus/","cat":"books","title":"More Information on the Book ‘Finding Jesus’"},{"author":"nabber","post":"“if the shroud is authentic why do the gospels not attest to the miraculous Image?”An obvious reason is that the disciples were looking at the shroud’s outside surface, not the inside where the image resided.","date":"May 23, 2014 at 8:52 am","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"author":"nabber","post":"Hugh, “bishops, who paused just long enough for their engraving to be taken” ?Seriously?  How long do you think an engraving would take?  I’ll tell you: “a good long time.” !","date":"May 25, 2014 at 11:00 am","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"author":"nabber","post":"Dan, as I pointed out in a thread discussion a while back, NASA did pay for the use of the VP8 in a government contract in which the VP8 was used to help analyze LANDSAT satellite photography.  So, it is easy to imagine the common parlance in the industry at the time referring to the machine as “the NASA VP8”.  Ref:  ntrs.nasa.gov, Technical Report #19760010448.  NASA certainly owned the work that resulted from the use of the VP8.","date":"August 20, 2015 at 8:12 am","url":"https://shroudstory.com/2015/08/20/new-book-on-the-shroud-of-turin-2/","cat":"books","title":"New Book on the Shroud of Turin"},{"author":"nabber","post":"Lombatti’s comments about the ~42 shrouds in Europe fail to reveal that the other shrouds in Europe either have documentation that they were copies of the true Shroud, or else it was obvious from looking at them that they ARE copies of the true Shroud.  If there are some that weren’t, please let me know, I’m not an expert on the entirety of Shroud copies.  But wholesale production of fake Shrouds is basically a fallacy.","date":"March 15, 2015 at 11:39 am","url":"https://shroudstory.com/2015/03/15/did-anyone-like-it/","cat":"television","title":"Did Anyone Like It?"},{"author":"nabber","post":"Atheism is a religion itself — one that takes far more belief than Christianity…..","date":"April 7, 2015 at 7:21 am","url":"https://shroudstory.com/2015/04/07/this-unbelievable-claim/","cat":"video","title":"This Unbelievable Claim"},{"author":"nabber","post":"Hugh, I would be remiss if I didn’t remind you that “No one expects the Inquisition!”  (a little levity seems to be required right now….)","date":"August 26, 2015 at 4:54 pm","url":"https://shroudstory.com/2015/08/26/youtube-of-barrie-schwortz-at-ahmadiyya-annual-convention/","cat":"video","title":"YouTube of Barrie Schwortz at Ahmadiyya Annual Convention"}],"textile":[{"author":"nabber","post":"“This is why the Pray Codex scenario is not believed by anyone outside Shroudie circles.”  Untrue, but more to the point, unprovable by Freeman.Fallacy in Logic in several categories, esp. Rash Generalization.  The herringbone weave and the 4 L-shaped holes together are statistically a lock, from the standpoint of any fair-minded person, and the Freeman/Farey objections are incredibly stubborn at best and disingenuously cynical at worst…","date":"October 30, 2015 at 8:52 am","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"}]}
