{"art":[{"author":"nick","post":"Have you ever asked a child a question you knew the answer to? I have.","date":"March 30, 2013 at 2:37 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}],"dating":[{"author":"nick","post":"I don’t understand why Christians are so quick to back off of the idea that the Shroud could be evidence for the Resurrection — it was my own studies on the Shroud that led me from athiesm/agnosticism to join the Orthodox Church. While we shouldn’t point at the image and just say “God did it”, there are other clues we know that when fit into the context of what happened on Easter Morning makes the Resurrection a very powerful explanation for all the events. No putrefaction or signs of decay? Blood clots that have perfect outlines that would have been ruptured if torn away from the Shroud? That coupled with what the apostles saw?I apologize if I come off as rude, but when people say that the Shroud can’t prove anything it simply strikes me as strange seeing, as I said, as it was what made me come to believe. epistomological belief and faith are two things.","date":"July 7, 2011 at 5:35 pm","url":"https://shroudstory.com/2011/07/05/crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"carbon_14_dating","title":"Crazy Talk: Are Atheists biased or just uninformed?"},{"author":"nick","post":"Yannick,It’s more of a cumulative argument kind of thing — what is the best worldview that explains both the mutation in Second Temple Judaic thought that gave birth to Christianity and all the data we have on the Shroud? To me, the Christian worldview simply put it all together without any leaks while my metaphysical naturalistic outlook seemed to collapse on my face. So it’s not as much as relying off of one or two ‘hints’ but the big picture.I suppose ‘prove’ is not the right word as one cannot show it to be the absolute case. Rather, the right idea would be ‘best possible explanation’.As for my faith, obviously if the Shroud was shown to be false I’d do a double take, but I would not jump ship and go back to atheism/agnosticism. I’ve experienced and seen things that make no sense in a naturalistic worldview. I can’t say for sure (and I don’t think I will ever have to), but I’d probably remain a Christian. The Shroud was the straw that broke the camels back for me; apologetic works of the likes of N.T. Wright and others had already put me on shaky ground.As for using it to convert or not, there’s nothing against it in the Orthodox Church so I guess we’ll have to disagree. I know that I’ve gotten my friends to at least reconsider their worldviews and are giving the time to look into the Shroud. Plus, at the end of the day, if the Shroud really is Christ’s and can at least provide possible evidence (not proof) for the Resurrection, then why shouldn’t we use it? Are we not called to evangelize all nations? Would this not finally be the ‘scientific evidence’ Dawkins et. al have been asking for (on their faulty epistomological assumptions)?Perhaps, though, I’m just a case of zeal without knowledge. It’s just that the Shroud did so much for me and I want to thus share it with others. Lord, have mercy.God Bless,– Nick","date":"July 21, 2011 at 1:56 am","url":"https://shroudstory.com/2011/07/05/crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"carbon_14_dating","title":"Crazy Talk: Are Atheists biased or just uninformed?"}],"history":[{"author":"nick","post":"Dan,Thanks a ton for making mention of this as it took me many months of work (and yes, that’s a picture of me — Scribd auto linked it from my facebook).Russ,I understand your position, and at no point can we prove any what we’re saying. The Shroud bares a lot of importance to me because it was putting it in the context of apologetic writings (albeit in a far more underdeveloped form than in the lecture) that made me leave my atheism/agnosticism and to, after roughly half a year, be baptized and chrismated into the Eastern Orthodox Church. Hence I felt I had a duty to at least compile my thought together and put it out there for people to examine. But again, I understand the reservation of others — we need to proceed to research it non-dogmatically if we’re going to learn more about it.","date":"February 26, 2012 at 3:43 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture"},{"author":"nick","post":"Robert,You’re assuming the conclusion before the evidence is even in, pure and simple. That isn’t free-thinking at all.Max,Would you mind clarifying/elaborating on what you mean? I understand how ‘miraculist’ and ‘fraudulist’ biases may get in the way, but what is the ‘naturalistic/ritualistic’ approach?","date":"March 2, 2012 at 1:28 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture"}],"misc":[{"author":"nick","post":"Has anyone read Nickell’s book where he claims to recreate the image (albeit not with as much technical detail)?","date":"August 28, 2011 at 11:37 pm","url":"https://shroudstory.com/2011/08/28/comment-on-freethought-should-be-accurate-and-factual/","cat":"news_&_views","title":"Comment on Freethought Should Be Accurate and Factual"}],"opinion":[{"author":"nick","post":"I largely agree with daveb on this one: science-denying, self-righteous fundamentalism has done horrors for all of Christendom (it was a large reason I was an atheist for so long). No sensible person is going to deny the age of the earth or evolution. As with priests, I also agree since I’m Eastern Orthodox and our priests can be married. I know many Roman Catholics who want to see this happen, and I guarantee you there would be a great increase of men who would respond to such a vocation.","date":"June 28, 2012 at 9:26 am","url":"https://shroudstory.com/2012/06/28/almost-a-third-of-adults-under-30-doubt-existence-of-god/","cat":"news_&_views","title":"Almost a Third of Adults Under 30 Doubt Existence of God"},{"author":"nick","post":"Just saw this was posted on here, and needless to say I was flattered to see it. Many thanks to Mr. Porter.Yannick,You’re absolutely right that the Shroud could never be proven to be the Shroud of Christ; as we probably all know Science doesn’t actually ‘prove’ anything but is an epistomology of measurement and recording. It disproves other explanations, but it never proves a certain one. My only issue is when I see this:“If we could prove our faith, then faith would not be faith no more !”I don’t get this. Belief that Christ rose doesn’t necessarily mean I have faith in Christ. Paul said that all are without excuse in believing that there is a God, but he talks about faith — the trust and love in God — separately. I largely agree with your post and will admit that perhaps I wanted too much out of it. I still don’t think it’s wrong to present it to others though at the very least as a possible justification for belief. I.e., Dawkins can’t go telling me irrational if I show him the Shroud as what led me to belief. If still, I know that I could never use it as proof — it would simply be a piece of a much larger puzzle. One last thing. You said:“And, what’s the best about the Shroud, it forces some to reconsider what they really believe. That’s a very good thing.”I completely agree.","date":"July 29, 2011 at 6:00 pm","url":"https://shroudstory.com/2011/07/21/more-on-crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"news_&_views","title":"More on Crazy Talk: Are Atheists biased or just uninformed?"},{"author":"nick","post":"Yannick,One last thing. Could you provide me a link or a source to where you got these conclusions:“…the body left the cloth without any visible and tangible signs of this disappearance (specially regarding the state of the blood stains). Till this day, science isn’t able to fully explain why the blood stains are in so good condition for a gravecloth who once envelop a corpse (we are pretty sure of this now) for a short time and after this time (less than 48 hours), this corpse left the cloth and didn’t corrupt there”I ask this because Robert Wilcox’s book makes it seem like Vignon was able to reproduce the blood clot images even though he did this by a tearing mechanism.God bless,– Nick","date":"July 29, 2011 at 6:19 pm","url":"https://shroudstory.com/2011/07/21/more-on-crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"news_&_views","title":"More on Crazy Talk: Are Atheists biased or just uninformed?"},{"author":"nick","post":"Hey Dan,Left a thank you on my blog today. It really is an honor to have been mentioned by you!Hope all is well,– Nick","date":"October 5, 2011 at 9:28 pm","url":"https://shroudstory.com/2011/10/03/discussion-of-the-anatomy-of-the-man-of-the-shroud-of-turin/","cat":"other_blogs","title":"Discussion of the Anatomy of the Man of the Shroud of Turin"}],"researchers":[{"author":"nick","post":"Just want to thank you again, Dan, for making a reference to the blog!","date":"January 26, 2012 at 11:58 pm","url":"https://shroudstory.com/2012/01/25/correcting-joe-nickell/","cat":"other_blogs","title":"Correcting Joe Nickell"}],"resources":[{"author":"nick","post":"Yup. That’s pretty much how I felt after I read Fanti’s Corona Discharge article (even though I don’t hold to the theory any more).","date":"May 5, 2012 at 3:08 am","url":"https://shroudstory.com/2012/05/04/cognitive-dissonance-for-skeptics-more-from-david-b-marshall/","cat":"books","title":"Cognitive Dissonance for Skeptics: More from David B. Marshall"},{"author":"nick","post":"The real irony, of course, in denying freewill is then atheist’s lose all grounds of saying they’ve been more ‘rational’ than theists in choosing their worldview — they’re atheists via determinism while theists are theists via determinism.Whelp.","date":"January 1, 2012 at 7:31 pm","url":"https://shroudstory.com/2012/01/01/eat-drink-and-be-merry-for-there-is-no-reason-to-do-so/","cat":"books","title":"Eat, drink and be merry for there is no reason to do so"},{"author":"nick","post":"The disregard for philosophy is what made me skeptical of new atheism when I was still an atheist. Hackneyed logic at its best, I suppose.","date":"April 30, 2012 at 8:26 pm","url":"https://shroudstory.com/2012/04/30/krauss-i-dont-really-give-a-damn-what-nothing-means-to-philosophers-i-care-about-the-nothing-of-reality/","cat":"books","title":"Krauss:  I don’t really give a damn what \"nothing\" means to philosophers; I care about the \"nothing\" of reality.\""}]}
