{"art":[{"author":"paul","post":"I am not looking for scientific truth only logic. Read the book called THE PHYSICS OF CHRISTIANTY and you might come to the conclusion we will never replicate it as I have.","date":"June 15, 2014 at 8:47 pm","url":"https://shroudstory.com/2014/06/15/its-art-not-science/","cat":"art","title":"It’s Art, Not Science"},{"author":"paul","post":"the pope lied when he said Islam is a peaceful religion or he is ignorant","date":"April 9, 2015 at 9:23 pm","url":"https://shroudstory.com/2015/04/09/art-scholars-on-scientific-evidence/","cat":"art","title":"Art Scholars on Scientific Evidence"},{"author":"paul","post":"I guess we will just have to wait until our technology advances to the level of the 13 th century to make a  fake shroud as well as the shroud of  Turin. Does anybody else think the preceding sentence is as ridiculous  as I think it is,","date":"June 15, 2014 at 6:52 pm","url":"https://shroudstory.com/2014/06/15/its-art-not-science/","cat":"art","title":"It’s Art, Not Science"},{"author":"paul","post":"in a civil trial all that is needed is a majority vote for a verdict","date":"February 14, 2015 at 6:13 pm","url":"https://shroudstory.com/2015/02/14/a-hung-jury-on-the-pray-manuscript/","cat":"news_&_views","title":"A Hung Jury on the Pray Manuscript"},{"author":"paul","post":"I just sent a drawing as bad as the one that is being discussed that consists of in separate frames. 1 frame a body of a bearded man lying naked with hands crossed no thumbs showing. 2 frame a crossed hatched image. 3 frame circles in the same L shaped pattern. 4 frame a empty tomb. all on a larger picture  being pulled on a trailer by 1965 Mustang car. Would you assume I saw the original Shroud or heard about it.","date":"June 29, 2014 at 8:07 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"paul","post":"just my thoughts. The shroud is obviously the last material object that was in contact with Jesus’s body at the instant of resurrection. The image is a result of a supernatural event that will never be duplicated again. Man will never duplicate the image and never explain the mechanism of its making; just as science can not say what happen the instant before the big bang. I sincerely believe 1000 years from now the same questions will still be asked with no answers.","date":"August 8, 2013 at 11:46 pm","url":"https://shroudstory.com/2013/08/08/why-dont-i-see-the-swollen-nose-in-any-of-the-art/","cat":"art","title":"Why don’t I see the swollen nose in any of the art?"},{"author":"paul","post":"I think so too. Would Sherlock Holmes think so?","date":"June 29, 2014 at 8:36 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"}],"blood":[{"author":"paul","post":"off topic maybe .the mechanics of a crucifixation. relying on a statics class from a long time ago here are some  thoughts on the forces in play on the body of crucified man.To put maximum pain on the body the arms need to be nailed straight out with no slack at all and where the nails have no give towards the end of the hand. this will become apparent. I am sure the Romans were aware of this since they were experts in pain. assume the body weighs 160 lbs a fbd (free body diagram) of the forces on the nail in the wrist at an angle 15 degrees of the crossbeam and the arm when the body slouches would be 80 lbs straight down and a force pulling by the arm of 309 lbs which equals 80 lbs divided by the sine of 15 degrees or .2588. so each arm is feeling a pull of 309 lbs, also assuming a 72 inch arm span each arm would be stretched 1.22 inches which equals 1minus the cosine of15 degrees times 36 inches assuming no stretch in the shoulders but all in the arms. note as the body slouches more, the force pulling on the arms decreases but the stretching has to increase. This may explain why some people have commented that the arms seem too long; for normal arms are not long enough to cover the genitals which I seemed to have read somewhere","date":"August 26, 2012 at 9:25 pm","url":"https://shroudstory.com/2012/08/26/standing-ovations-all-around/","cat":"blood_studies","title":"Standing Ovations All Around"}],"dating":[{"author":"paul","post":"what seems absurd is that somebody created an object 700 years ago that nobody can recreate today by any means.","date":"March 26, 2015 at 6:28 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"author":"paul","post":"just throw one on the barbi as the aussies say and make one","date":"March 26, 2015 at 8:30 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"author":"paul","post":"i think the challenge should be to duplicate the shroud since a 14th century man with one billionth of the technology we have now made this it should be a piece of cake. ha ha","date":"March 31, 2012 at 3:06 pm","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins"},{"author":"paul","post":"to answer your question I had eight biopsy samples taken and it was positive in three.places.","date":"March 5, 2015 at 9:38 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"author":"paul","post":"Just make a duplicate shroud. End of  proposition fake or not. I would say scientific knowledge has increased a billion times since the 13 hundreds and you can have  5 years to do it. I mean you would only to do what a single person did in 1300 . Just a bet; it ain’t going to happen","date":"February 28, 2012 at 11:18 pm","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","title":"Paper Chase: To know a veil by Philip Ball"},{"author":"paul","post":"it can be made however you want and then wait 100 years and see what image resuts. all it has to do is be the same in all the characterists as the shroud nothing more nothing less and we thought einstien was smart. that middle ages man did something that the smartest and most talented people with all the technology can not do.","date":"March 1, 2012 at 12:15 am","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","title":"Paper Chase: To know a veil by Philip Ball"},{"author":"paul","post":"if the shroud is man made then just make it again. i dont think there were scientists around in the 1300s so just cough up a shroud it should  not take over a month to do.","date":"April 27, 2012 at 7:28 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","title":"When History Trumps Science"},{"author":"paul","post":"my point is it is not man made since no man today can not or has not produced the shroud and the argument that a 13th century man has done what a modern man can not do is ludicrous on its face. is there any other ancient man made object that can not be made today? if so i would like to know what it is.","date":"April 28, 2012 at 6:55 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","title":"When History Trumps Science"},{"author":"paul","post":"then i can have a some of gold that was made from lead by an ancient alchemist but you can not discredit this statement because some process was used that can’t be reproduced today but is a secret still waiting to be discovered but somehow was used in ancient times.","date":"April 29, 2012 at 12:44 am","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","title":"When History Trumps Science"},{"author":"paul","post":"i believe if you had a sample of that armour and did a metal analysis of it the metal it could be reproroduced to an exact chemistry and then made to an exact replica as far as size shape and weight. what we might not know is how they made it at the contemperary time. i do know that any metal can be analyzed to get its exact components","date":"April 29, 2012 at 11:07 am","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","title":"When History Trumps Science"},{"author":"paul","post":"i would love to read about the metallury on this metal showing that this can not be done today; as far as the pyramids get a good crane and jackhammer and a pyramid will go up. please note i am saying modern man can not reproduce the shroud by any means modern with lasers etc. or ancient methods","date":"April 29, 2012 at 5:50 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","title":"When History Trumps Science"},{"author":"paul","post":"i would say the opening might not be large enough to let a photon of light pass through","date":"April 29, 2012 at 8:05 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","title":"When History Trumps Science"},{"author":"paul","post":"all possible methods can never be tested so theoretically the answer will never be proven scentifically but we do send people to death row on dna evidence which is maybe one  hundred billion odds of being wrong nothing is 100% absolute for it to be a fact .we must live in the real world","date":"April 29, 2012 at 8:01 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","title":"When History Trumps Science"},{"author":"paul","post":"Exactly like the the pro global warming scientists do ( not  )","date":"December 9, 2015 at 12:09 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"}],"events":[{"author":"paul","post":"assume the shroud is the burial cloth of Jesus then it is the object that was in physical contact with the body of Jesus at the instant of ressurrection. The question then becomes would this intimate physical object be affected by this unique event; taking into account  the unique image on the shroud I would say it is a witness to the ressurection.","date":"February 27, 2013 at 10:41 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral"},{"author":"paul","post":"Yannick Clément :Quote: “One of the reasons I have for believing is that there is no explanation for how the image got on the Holy Shroud.”My answer:  Ray Rogers and some other true scientists have proposed some interesting explanations over the years that can well be very close to the truth regarding the image on the Shroud and these explanations (Maillard reaction, Volckringer pattern, etc.) are completely resting on natural mechanisms.  Of course, since these hypotheses are very complex and hard to reproduce in a lab, we still got no confirmation yet that one of these can really be apply to the Shroud, but nevertheless,  in the present state of our knowledge, no one can really discard them, except THOSE WHO DESPERATELY WANT TO USE THE SHROUD TO PHYSICALLY PROVE THE RESURRECTION (i.e. to back-up their religiously biased ideology)…Question: What would happen to your faith in the Resurrection if a 100% natural hypothesis for image formation would be proven right in the future???Personally, I can say that since my faith has grown and is getting a little bit stronger and stronger over the years, my need to rely on the Shroud as some kind of insurance have constantly decrease.  I think that if this continue that way (I sure hope so!), then I won’t need the Shroud for my faith no more before the end of my time on Earth.  I hope that one day, this relic will only be an helpful tool for me in my meditation about the Passion and death of Christ and nothing else…  In sum, the more I advance in my life and in my faith, the more I tend to focus on the Shroud man instead of focusing on his burial cloth.  Sure I still love to exchange on that passionate subject, but the more my faith is growing strong, the more the Shroud is becoming secondary.  I hope it is the same for all of you!As Christians, we should not “venerate” or focusing too much on Jesus burial Shroud but much more on the God-man who came on Earth to show us the real face of love and mercy of the Father!  A face of course that we can see on the Shroud (with the eyes of faith).forget how the image was made  the question is how did the body get out of the shroud without the cloth being unwrapped","date":"March 10, 2013 at 9:38 pm","url":"https://shroudstory.com/2013/03/08/pope-benedict-says-shroud-of-turin-authentic-burial-robe-of-jesus-it-doesnt-matter-what-science-says-about-its-authenticity/","cat":"event","title":"Pope Benedict says Shroud of Turin authentic burial robe of Jesus & it doesn’t matter what science says about its authenticity"}],"history":[{"author":"paul","post":"to get an idea of stress on the thighs put a ladder vertical (not leaning at all ) , then get on it and turn facing away from the ladder. The pain in the thighs becomes unbearable after a while because you can not straighten your legs. try it I have.","date":"February 9, 2014 at 1:56 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"author":"paul","post":"rb. we can build a pyramid today or stonehedge but we cannot make the shroud and 100 years from now their will only be one shroud in existence. it is not comparabe to any man made object.","date":"February 26, 2012 at 10:47 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture"},{"author":"paul","post":"in a sense everybody will have a resurrection when we die, we just leave our bodies behind and we will leave our bodies behind with no regret. If you research NDE this is a common theme.","date":"August 3, 2014 at 10:25 am","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"author":"paul","post":"my post concerns people who report on their NDEs","date":"August 3, 2014 at 2:42 pm","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"author":"paul","post":"we haven’t what matter is made of","date":"August 3, 2014 at 9:19 pm","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"author":"paul","post":"jesterof :ask them :-)read The Acts. I have read the acts and that is my point. His apperance proved His ressurection and gave them the strength to do what he told them. As they had proof why is it inconcievable that He would not leave material proof of His resurection for our strength.","date":"June 16, 2013 at 1:52 pm","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","title":"Will the Alfred Rosenberg Diaries Tell Us Anything?"},{"author":"paul","post":"what benefit did the apostles get from seeing the risen Christ?","date":"June 15, 2013 at 4:51 pm","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","title":"Will the Alfred Rosenberg Diaries Tell Us Anything?"},{"author":"paul","post":"if Christ appeared to the apostles to show them he actually rose from the dead why would He not leave and protect the existence of an object that shows his ressurection for the benefit future people.","date":"June 14, 2013 at 7:30 pm","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","title":"Will the Alfred Rosenberg Diaries Tell Us Anything?"},{"author":"paul","post":"jesterof :Why would He do that?If His whole teachings are based on trust and belief.And He knew, “For those who believe, no explanation is necessary. For those who do not believe, no explanation will suffice.”I  remeber reading somewhere seek and you shall find but I do not remember any limits placed on where to seek","date":"June 17, 2013 at 9:06 pm","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","title":"Will the Alfred Rosenberg Diaries Tell Us Anything?"},{"author":"paul","post":"of the hundreds of accounts I have read no one has ever regretted leaving there bodies behind","date":"August 3, 2014 at 11:51 am","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"}],"image":[{"author":"paul","post":"here is a comment i made before that might answere some questions .the mechanics of a crucifixation. relying on a statics class from a long time ago here are some thoughts on the forces in play on the body of crucified man.To put maximum pain on the body the arms need to be nailed straight out with no slack at all and where the nails have no give towards the end of the hand. . I am sure the Romans were aware of this since they were experts in pain. assume the body weighs 160 lbs a fbd (free body diagram) of the forces on the nail in the wrist at an angle 15 degrees with the crossbeam and the arms caused when  the body slouches would be 80 lbs straight down and a force pulled by the arm of 309 lbs which equals 80 lbs divided by the sine of 15 degrees or .2588. so each arm is feeling a pull of 309 lbs, also assuming a 72 inch arm span each arm would be stretched 1.22 inches which equals 1minus the cosine of15 degrees times 36 inches assuming no stretch in the shoulders but all in the arms. note as the body slouches more, the force pulling on the arms decreases but the stretching has to increase. This may explain why some people have commented that the arms seem too long; for normal arms are not long enough to cover the genitals which I seemed to have read somewhere","date":"September 5, 2012 at 8:46 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","title":"A different approach to what some see as problems with the image on the Shroud of Turin"},{"author":"paul","post":"think of a gymnest doing an iron cross on the still rings as he slowly lowers his body to a hanging straight down position,  the rings will come from an extended position to shoulder width at the hanging postion. On a cross with the arms nailed where there is no GIVE of the arms against the nails the arms have to stretch to have any slouching of the body. the amount of lenghtening of the arms is in direct proportion to the degree of slouching of the body. Remember the shortest distance between 2 points is a straight line (between the 2 nails) any degree of slouching will cause the distance to increase. since the nails can not move the arms must get longer no if ands and buts.","date":"September 6, 2012 at 10:42 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","title":"A different approach to what some see as problems with the image on the Shroud of Turin"},{"author":"paul","post":"All I can say is must have been truckloads of linen cloths available in the 13th century.","date":"August 7, 2015 at 8:38 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"author":"paul","post":"man has not been able to create life; so evolution is used as an answer of starting life over a very long period of time that no scientist can replicate becase of the long time procees.. the shroud is said to be a fake that was created over a short period of time by a middle ages man with little scientifiic knowledge; but no scientist  has fully replicated it in over the past 100 years which is longer than the productive lifespan of any human being. What am I missing","date":"February 26, 2012 at 11:44 am","url":"https://shroudstory.com/2012/02/25/bertrand-russell-comes-to-mind/","cat":"image_theory","title":"Bertrand Russell comes to mind"},{"author":"paul","post":"I am saying with all the ways that have been tried to replicate the shroud that have not suceeded has required a lot of material so apparanly it would have been required by the original forger. Then my next question is why would the forger been satisfied with such a terrible representation of a human body?","date":"August 9, 2015 at 9:02 am","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"author":"paul","post":"Louis that is why I believe the shroud is not the work of a forger","date":"August 9, 2015 at 7:09 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"author":"paul","post":"a mess","date":"September 18, 2012 at 9:24 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","title":"Latest on David Rolfe’s Site on Maillard Reaction"},{"author":"paul","post":"Does the shroud look like a human body as on the order of Michelangelo’s  David ?","date":"August 9, 2015 at 5:54 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"author":"paul","post":"I would believe that a space alien made the shroud before believing that a positive painting decayed into a negative image.","date":"January 16, 2015 at 1:07 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"author":"paul","post":"the only way that you would have a similar image as on the shroud is if the pig rose from the dead","date":"May 17, 2013 at 5:55 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"author":"paul","post":"is there a possibilty that something was made “naturally “that can not be made now or has not been made by any known human in the history of mankind","date":"February 2, 2013 at 11:02 pm","url":"https://shroudstory.com/2013/01/31/how-could-a-medieval-mind-create-an-image-such-as-the-one-on-the-shroud/","cat":"uncategorized","title":"How could a medieval mind create an image such as the one on the shroud?"},{"author":"paul","post":"we could duplicate any cathedral today with our technology. we can not duplicate the shroud enough said.","date":"January 31, 2013 at 10:42 pm","url":"https://shroudstory.com/2013/01/31/how-could-a-medieval-mind-create-an-image-such-as-the-one-on-the-shroud/","cat":"uncategorized","title":"How could a medieval mind create an image such as the one on the shroud?"},{"author":"paul","post":"there is no image on the shroud and there was not one until it was photographed. No person would have made the shroud in the 13 th. century and expected it to be accepted as from the death of Christ. It would be like Leonardo painting the Mona Lisa in the same manner and presenting it and expecting payment from whomever commissioned it. To me this shows that the shroud had a continuous verifiable history from the time of Christ that was accepted by everyone who had possession of it starting from the beginning. Just my opinion.","date":"March 22, 2014 at 5:32 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","title":"So then, why is there an image?"},{"author":"paul","post":"why not take a rat and scourge it then kill it and wrap it in linen and see what image you get in three days. you could give the rat a pain killer to ease your concerns. I will lay a million to one odds that you would use up all the rats in new york city and get nothing but a mess on the cloth.","date":"February 1, 2013 at 8:13 pm","url":"https://shroudstory.com/2013/01/31/how-could-a-medieval-mind-create-an-image-such-as-the-one-on-the-shroud/","cat":"uncategorized","title":"How could a medieval mind create an image such as the one on the shroud?"},{"author":"paul","post":"the church is in the faith business which needs a place and structure that presents and converts and reinforces that faith on a ongoing basis. That is why the church is not interested  in proving genuineness of the shroud.","date":"June 22, 2014 at 11:37 am","url":"https://shroudstory.com/2014/06/22/until-man-can-explain-how-the-image-got-on-the-shroud-using-his-own-technology-he-really-wont-believe-it-wasnt-his-technology/","cat":"news_&_views","title":"Until man can explain how the image got on the Shroud using his own technology, he really won’t believe it wasn’t his technology."},{"author":"paul","post":"well to be specific and blunt it is a crappy image of a human being in its natural state . all the images that were on engravings and paintings look nothing like the shroud only their unreal idea of the shroud. it is like at a  blue print, and a very bad one, and saying its a finished picture of a building.","date":"March 22, 2014 at 9:48 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","title":"So then, why is there an image?"},{"author":"paul","post":"Just to throw something out,not that I understand the technical aspects of this post but at one point in my life I took a severe whack on the forehead by a cement side walk and had egg shaped bump that was a good one inch high.Could this cause the discontinuity next to the blood stain on the forehead?","date":"October 3, 2015 at 9:19 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"}],"misc":[{"author":"paul","post":"here is a very good website on NDE http://www.nderf.org/","date":"July 27, 2013 at 8:57 am","url":"https://shroudstory.com/2013/07/23/a-point-now-where-science-and-religion-are-in-fact-treading-on-the-same-ground/","cat":"news_&_views","title":"A point now where science and religion are in fact treading on the same ground"},{"author":"paul","post":"if an object can not be reproduced in over a 500 year period was it ever made","date":"July 24, 2012 at 12:42 am","url":"https://shroudstory.com/2012/07/23/argumentum-ad-ignorantiam-mea-natibus/","cat":"news_&_views","title":"Argumentum ad Ignorantiam, mea natibus"},{"author":"paul","post":"to get another perspective read about near death experiences","date":"July 24, 2013 at 9:30 pm","url":"https://shroudstory.com/2013/07/23/a-point-now-where-science-and-religion-are-in-fact-treading-on-the-same-ground/","cat":"news_&_views","title":"A point now where science and religion are in fact treading on the same ground"},{"author":"paul","post":"Thank you for that Ayaz it is really funny. Assuming that you are not from the Indian tourist board the only other conclusion is serious delusion.","date":"April 2, 2010 at 3:40 pm","url":"https://shroudstory.com/2008/08/20/dates-for-2010-exhibition-of-the-shroud-of-turin/","cat":"2010","title":"Dates for 2010 Exhibition of the Shroud of Turin"},{"author":"paul","post":"I have a question for anybody who can answer. How were bodies taken down from the cross?  Did Roman nails grip with such  force that a tool such as a crowbar was needed to pry the nails out? Did they have such tools ? It seems to me that using such a tool would mangle the flesh of the hands and feet to an extent that it would be visible to the eye. Does any thing on the shroud show this? If not why not?","date":"December 5, 2013 at 11:10 pm","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes"},{"author":"paul","post":"reproduce it now using anything; might have to wait another 2000 years","date":"December 10, 2013 at 10:44 pm","url":"https://shroudstory.com/2013/12/10/maybe-vermeer-made-the-shroud-of-turin/","cat":"humor","title":"Maybe Vermeer Made the Shroud of Turin"},{"author":"paul","post":"the sex crimes scandel and hush money pay off shows that the primary goal of any bureaucracy is self preservation above all else. This applies to any organization religious or otherwise. religion is manmade christianity is not.","date":"March 5, 2013 at 12:25 am","url":"https://shroudstory.com/2013/03/03/lisa-miller-on-american-catholics/","cat":"news_&_views","title":"Lisa Miller on American Catholics"},{"author":"paul","post":"question why was the stone rolled back from the tomb of Jesus. answer the physical body of Jesus was resurrected in its physical form and for the body to leaves the tomb the  stone needed to be moved. Maybe there was no great burst of energy or  radiation or any visible event that could be detected at the instant of resurrection but just the movement of the body coming back to life.","date":"September 15, 2013 at 11:40 pm","url":"https://shroudstory.com/2013/09/15/more-scientific-research-on-the-shroud-of-turin-why/","cat":"uncategorized","title":"More scientific research on the Shroud of Turin? Why?"},{"author":"paul","post":"you don’t need 50 IQ points to see what is depicted on the shroud and 500 IQ points will not explain nor duplicate the shroud","date":"December 15, 2012 at 10:18 pm","url":"https://shroudstory.com/2012/12/13/livescience-goofs-again/","cat":"uncategorized","title":"LiveScience Goofs Again"},{"author":"paul","post":"just remember the primary objective of any bureaucracy and I mean all of them is self preservation. They are composed of  humans.","date":"June 30, 2015 at 7:53 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"author":"paul","post":"I believe the 2nd law of thermodynamics proves that the shroud has always been a negative  image. The law states entropy in a system always goes from order (low entropy) to disorder (higher entropy). If our eyes had the to see in the negative then at the time the shroud was made it would have been a realistic image of a human body either 700 or 2000 years ago.The image would be at least clear or probably clearer than it is now as the entropy of the image would have been lower than now thus the order higher. As time passes and as entropy increases the disorder of the image would increase and the image would become less clear to our negative capable eyes. We need to understand that the shroud actually is a negative image with all information intrinsic in itself (low entropy) at the time of formation(order) of the image. As time passes the image entropy will increase thus disorder increases causing a loss of information and a less clear negative image. Entropy can never decrease over time. Consider racked balls on a pool table; they are at low entropy(ordered) then they are hit by cue ball and scattered entropy increases (disordered) They then will not ever roll back to their racked positions at the end of their motion back to original entropy (ordered state). It is not a matter of probabilities it is impossible. In the case of a painting it is also impossible because looking at a painting with our negative capable eyes we will see a very blurry not realistic human form (high entropy)disorder. Over time as paint flakes off our negative capable eyes will see a human form coming into shape becoming more realistic( entropy decreasing)order increasing.This is a violation of the 2nd law of thermodynamics.As a matter of fact the final entropy of the image that our negative capable eyes would  see has a lower entropy than the original image our negative capable eyes would see.","date":"November 27, 2014 at 11:13 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"author":"paul","post":"If you pay the tax you don’t die if you are a Christian or Jew according to the Koran","date":"November 16, 2015 at 4:32 pm","url":"https://shroudstory.com/2015/11/14/paris/","cat":"news_&_views","title":"Paris"},{"author":"paul","post":"correction If our eyes had the ability to see        in the third line","date":"November 27, 2014 at 11:16 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"author":"paul","post":"Horrible Documentary that revealed nothing at all about Jesus during the 40 days in question that was not already known from the Gospel accounts. Completely pointless show, that continued to be pointless for 2 hours. Utter waste of time.","date":"April 21, 2011 at 11:10 am","url":"https://shroudstory.com/2011/04/21/twitter-traffic-about-the-lost-40-days/","cat":"news_&_views","title":"Twitter Traffic About the Lost 40 Days"},{"author":"paul","post":"modern man can not duplicate the  1 percent (?) negative image that we can see. the real positive hidden image was only revealed when photographed. This is a miracle in itself.","date":"April 1, 2014 at 8:37 am","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","title":"The Shroud that Defies Scientific Explanation (Part 2)"},{"author":"paul","post":"I watched this last night. It was horrible and pointless. Nothing was said about what Jesus did during those 40 days that was not already known from the gospel accounts.","date":"April 21, 2011 at 11:05 am","url":"https://shroudstory.com/2011/04/21/jesus-the-lost-40-days-at-amazon/","cat":"news_&_views","title":"Jesus – The Lost 40 Days at Amazon"}],"key_evidence":[{"author":"paul","post":"life on earth whose beginning is a mystery and is explained as happening  over millions of years but  cannot be replicated today, The shroud was made over a period of three days but still can not be cannot be duplicated today. Which one is more a miracle? I will take the shroud.","date":"January 4, 2014 at 10:07 pm","url":"https://shroudstory.com/2014/01/04/what-one-single-characteristic-about-the-shroud/","cat":"uncategorized","title":"What one single characteristic about the shroud  . . . ?"}],"opinion":[{"author":"paul","post":"the idea of a simple cell is a self contradiction.","date":"January 1, 2015 at 1:06 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"author":"paul","post":"30 million legal abortions proves that people can and do live very easily with evil; or is it not a evil. Somehow I do not think the problem of evil is the existence or non existence of God but the actions of mankind.","date":"January 6, 2015 at 9:16 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"author":"paul","post":"free will that is not free is not free will","date":"January 4, 2015 at 10:12 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"author":"paul","post":"as a mechanical engineer I see a tremendous gap between a theory of how to reproduce the shroud and actually doing it. I once read that somebody had the answer to the u boat attack in ww2 which was raise the temperature of the ocean to the boiling point and they would have to surface and then destroy them. Some one said it was  impossible to do that  but  he said I have the theory correct it is up to somebody else to do the operational details.","date":"December 22, 2013 at 12:28 pm","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"author":"paul","post":"knowledge is a process. Is ultimate knowledge attainable? The  ultimate make up of matter is still not known.","date":"October 31, 2014 at 9:19 pm","url":"https://shroudstory.com/2014/10/31/how-knowledge-is-created-the-shroud-of-turin/","cat":"other_blogs","title":"How Knowledge is Created:  The Shroud of Turin"},{"author":"paul","post":"if I were an artist and came up with a cloth that looked as bad as the shroud does (positive image) I would have thrown it in the garbage can.","date":"April 18, 2015 at 9:55 pm","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"author":"paul","post":"we can reproduce all the items except the shroud","date":"July 27, 2012 at 8:34 pm","url":"https://shroudstory.com/2012/07/27/insane-ancient-achievements-or-modern-insanity/","cat":"other_blogs","title":"Insane Ancient Achievements or Modern Insanity?"},{"author":"paul","post":"the actual position of any sub atomic particle is always in doubt","date":"December 1, 2013 at 11:42 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","title":"It may not suit the scientific mind-set"},{"author":"paul","post":"why did Jesus appear to the apostles after the Resurrection; was to give them knowledge or faith or both","date":"October 11, 2014 at 10:33 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"}],"researchers":[{"author":"paul","post":"to  all the art historians has any picture ever been made before photography that  was done in a  wholly negatve mode. if not what does that signify?","date":"June 12, 2012 at 10:47 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"author":"paul","post":"just replcate the image period use all the modern tools available. A body needs not be involved as long as the final product replicates the shroud and all it’s attributes. a negative etc. etc. can not be done","date":"April 18, 2012 at 8:36 pm","url":"https://shroudstory.com/2012/04/18/an-email-from-david-rolfe-to-the-shroud-science-group/","cat":"news_&_views","title":"An Email from David Rolfe to the Shroud Science Group"},{"author":"paul","post":"is the  space alien field still open","date":"February 23, 2015 at 9:01 pm","url":"https://shroudstory.com/2015/02/23/catching-a-wonderful-response-to-charles-freeman/","cat":"uncategorized","title":"Catching a Wonderful Response to Charles Freeman"},{"author":"paul","post":"I believe that the possibility that the shroud was made by human hands is the same as the possibility that the appearances of the risen Christ as reported in the Gospels was  caused by  mass delusions of the apostles.","date":"October 7, 2013 at 10:14 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","title":"What did Stephen Jones just say?"},{"author":"paul","post":"I expect anyone that says it is a forgery to show a replication of the shroud produced by someone until that happens their judgement is fallacious and has no basis.","date":"March 24, 2012 at 7:45 pm","url":"https://shroudstory.com/2012/03/24/someone-who-is-not-a-fan-of-russ-breault-and-the-shroud-of-turin/","cat":"news_&_views","title":"Someone who is not a fan of Russ Breault and the Shroud of Turin"}],"resources":[{"author":"paul","post":"My question is why would a forger make such a unreal looking Christ?","date":"August 16, 2015 at 1:24 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"author":"paul","post":"if you took a photograph of the  rubbing  would the negative of the photograph look like the original coin but do the rubbing without any coin","date":"November 9, 2014 at 11:12 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"author":"paul","post":"so if a took a photo of the faded photo than that negative would look like the unfaded  original photo","date":"November 9, 2014 at 11:16 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"author":"paul","post":"can anybody post negative pictures of any painting that clearer than the original painting","date":"November 9, 2014 at 3:11 pm","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"author":"paul","post":"what are the odds that a13th century person made a completely NEGATIVE image of back and front human crucified body that is photographic quality before photography was invented versus a relic surviving from the first century that shows a crucified man very blurry but when run through newly discovered technology 1900 years latter yields a image that was not apparent to human senses. I am no expert in statistics but would guess it’s billions to one.I would say this would make the 13 century fabricated object more spectacular than one surviving from the first century made by natural? means.","date":"November 9, 2014 at 10:00 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"author":"paul","post":"negative image is not a problem only if you don”t have to reproduce it","date":"November 9, 2014 at 10:42 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"author":"paul","post":"if you took a photograph of the  rubbing  would the negative of the photograph look like the original coin but do the rubbing with any coin","date":"November 9, 2014 at 11:09 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"author":"paul","post":"I was reading an article about how life was formed from the elements on earth that came from stars but no scientist can explain how the spark of life originated from these elements. This reminded me of the shroud in that we can list all the elements of the shroud but can not explain how the elements came together to explain its existence.","date":"September 12, 2015 at 9:41 pm","url":"https://shroudstory.com/2015/09/12/new-angle-on-the-supernatural/","cat":"article","title":"New Angle on the Supernatural?"},{"author":"paul","post":"models are not all encompassing such as global warming models that have failed to predict the no change in global temp. for the last 18 years even though carbon dioxide has been increasing each year.","date":"November 23, 2014 at 5:04 pm","url":"https://shroudstory.com/2014/11/17/quote-for-today-historical-criteria-do-not-fall-from-the-sky/","cat":"article","title":"Quote for Today:  Historical criteria do not fall from the sky"},{"author":"paul","post":"This is the first book I read on the shroud in in 1982.","date":"September 2, 2015 at 6:21 pm","url":"https://shroudstory.com/2015/09/02/ian-wilsons-1978-book-for-a-penny/","cat":"books","title":"Ian Wilson’s 1978 Book for a Penny"},{"author":"paul","post":"the shroud is only significant if it shows the resurrection; image plus body was not unwrapped and only in the shroud for less than 3 days","date":"December 25, 2012 at 3:32 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"author":"paul","post":"educate yourself  about the teachings of Islam. one  which is that lying to spread Islam is appropriate.","date":"April 21, 2015 at 8:44 pm","url":"https://shroudstory.com/2015/04/21/the-imams-who-came-to-see-the-shroud/","cat":"press_coverage","title":"The Imams Who Came to See the Shroud"},{"author":"paul","post":"i know of no one that says the body was unwrapped or started decomposing as shown by blood stain non smears so how did the body come out of the shroud before decomposition and not be unwrapped","date":"December 18, 2012 at 9:51 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"author":"paul","post":"i womder if they would sit in a empty room and wait for food to appear from nothing of course i realize they are thinking on a much higher level than me","date":"April 30, 2012 at 8:42 pm","url":"https://shroudstory.com/2012/04/30/krauss-i-dont-really-give-a-damn-what-nothing-means-to-philosophers-i-care-about-the-nothing-of-reality/","cat":"books","title":"Krauss:  I don’t really give a damn what \"nothing\" means to philosophers; I care about the \"nothing\" of reality.\""},{"author":"paul","post":"does not anybody in the whole wide world want to be famous? all he would have to do is duplicate the shroud and he would also be a hero to all the atheists.","date":"January 30, 2014 at 11:10 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"author":"paul","post":"lets see;1 the odds of making a duplicate of the shroud i would guess a billion to one since no one has done it yet since the shroud has become known to the public. now consider the cloth wrapped a bloody body but it was taken out before decomposition but not physically disturbed. i would say impossible but put the odds at a billion to one . the combine odds that one piece of cloth went thru these 2 events are 1 billion times 1 billion or1x10to the 19 power which  i think is more than the number of atoms making up  the earth.","date":"December 20, 2012 at 12:05 am","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"author":"paul","post":"This would be pretty much why the blow by:“Jesus answered and said to them, “Destroy this temple, and in three days I will raise it up.”  20 The Jews therefore said, “It took forty-six years to build this temple, and will You raise it up in three days?”  21 But He was speaking of the temple of His body,” (John 2:19-21).“And He said to them, “Why are you troubled, and why do doubts arise in your hearts?  39 “See My hands and My feet, that it is I Myself; touch Me and see, for a spirit does not have flesh and bones as you see that I have.” (Luke 24:38-39).“When therefore it was evening, on that day, the first day of the week, and when the doors were shut where the disciples were, for fear of the Jews, Jesus came and stood in their midst, and said to them, “Peace be with you.”  20 And when He had said this, He showed them both His hands and His side.  The disciples therefore rejoiced when they saw the Lord,” (John 20:19-20).","date":"April 22, 2011 at 2:59 pm","url":"https://shroudstory.com/2011/04/20/what-really-happened-during-lost-40-days/","cat":"books","title":"What really happened during ‘Lost 40 Days’?"},{"author":"paul","post":"Why are you people so excited about this horrible show? A computer generated Jesus doesn’t amount to much, but the rest of the show was even more worthless. It didn’t even have clever speculation.","date":"April 22, 2011 at 10:08 am","url":"https://shroudstory.com/2011/04/22/jesus-the-lost-40-days-is-now-available-on-itunes/","cat":"news_&_views","title":"History Channel’s Jesus: the Lost 40 Days & The Real Face of Jesus Available on iTunes"},{"author":"paul","post":"Why would anyone complain? Oh yeah, it’s a horrible documentary!","date":"April 22, 2011 at 2:52 pm","url":"https://shroudstory.com/2011/04/22/jesus-the-lost-40-days-in-now-on-youtube-for-how-long/","cat":"video","title":"Jesus, the Lost 40 Days in now on YouTube (for how long?)"},{"author":"paul","post":"This program was written by John Marks, a self proclaimed atheist. There is nothing in any of the documents that the program claims to use which shed light on the 40 days in question. John, along with a college friend produced a obscure movie a few years ago called “Purple State of Mind”, in which John claims you cannot see the real world until you put the Bible down, and stop having your world view seen through it’s pages. In the film, John is shown going to a protestant church in NY, first time ever in his life, for he’s more likely to be found on a Sunday morning at the “church” of Vincent’s BBQ. John, claims he’s happy to go to hell, for there will sure be BBQ!The film is sure to be a mind bender bolstering agnostics. We shall see.","date":"April 18, 2011 at 1:56 pm","url":"https://shroudstory.com/2011/04/06/updated-jesus-the-lost-40-days-the-history-channel-april-20/","cat":"news_&_views","title":"Updated: “Jesus, the Lost 40 Days” the History Channel April 20"}]}
