{"art":[{"author":"randy_schreiner","post":"Wondering if Russ Breault could respond – one of his slides from his Shroud Encounter very clearly shows this herringbone pattern.   I was surprised when I saw it that it very clearly is similar to the Pray Codex.","date":"June 21, 2014 at 9:29 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"author":"randy_schreiner","post":"I recommend viewing of Mark Evans photomicrographs on Shroudscope, especially look at the one at the eye – it clearly shows a similar stepped pattern to that of the Pray MS.","date":"June 23, 2014 at 8:47 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"}],"dating":[{"author":"randy_schreiner","post":"I’m curious whether the opposite corner (on the same side of the Shroud) has ever been examined to see if it is consistent with the radiocarbon corner using SPM analysis.   One would think that any unusual handling and possible mending that would create added material to skew the C14 date would also exist at that corner.","date":"February 3, 2014 at 11:55 am","url":"https://shroudstory.com/2014/01/22/comment-promoted-are-the-quad-mosaics-meaningless/","cat":"carbon_14_dating","title":"Comment Promoted: Are the Quad Mosaics Meaningless?"},{"author":"randy_schreiner","post":"You know this is not as far fetched as it sounds.   When I was in college back in 1978, there was a computer program stored on punch cards that assigned dorm rooms based on random priority numbers assigned to each student.   I inserted a line of code that assigned a high random number to my student id, increasing the odds that I would get the dorm room that I wanted.   I found out before the program was to be executed that I already had a high priority number, so I removed the punch card before the program ran.","date":"May 18, 2015 at 9:33 pm","url":"https://shroudstory.com/2015/05/18/i-tried-to-ignore-the-carbon-dating-computer-hacking-conspiracy-theory/","cat":"conspiracy_theory","title":"I Tried to Ignore the Carbon Dating Computer Hacking Conspiracy Theory"}],"misc":[{"author":"randy_schreiner","post":"Dan, you did an amazing job with this blog and we were blessed with your commitment.   I know many of us will suffer withdrawal…","date":"December 15, 2015 at 4:10 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"}]}
