{"art":[{"author":"senior110","post":"You sounded like a very thorough person. I, too, had similar reservations about Colton’s descriptions. As for your comment about everyone coming together, I subscribe to the idea that there are many paths to God and Jesus is just one way. That is, God sent different prophets for different circumstances in order to lead people of time to Him. Please consider the suggestion and don’t feel offended. God bless.","date":"October 14, 2012 at 2:51 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"senior110","post":"Hi AnnieCee. I tried to get to your website, but encountered problems. Please try it yourself. God bless.","date":"October 14, 2012 at 3:03 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"senior110","post":"I share your fear of death. My fear originated about 55 years ago when I realized that I would die some day. I have found life so beautiful and awe some that not feeling it would be the ultimate dread. No, I do not come from a priviledged background, in fact I would consider our family as a poor working class, but over the years we worked hard and had our share of trials and tribulations. Today, I consider ourselves blessed with healthy and independent children and their families.  My struggle against my fear has led me to reading many books, medications, and counselling and ultimately to baptism into the Catholic faith. Being retired for the last 9 years, I have a lot of time thinking about God, death, etc.  My conclusion is that if there is no God, then life is meaningless. God has 100% of my heart and about 80% of my mind. I desparately seek closure on this fear, so I can fully appreciate life and let it go gracefully. I pray very often these days that God would send  some “agent” or event that would put my mind to rest. This is the reason that read posts such as these – to find new ways of reaching God or better still, have God reaching me. I would appreciate any suggestion that would remove my residual doubt. God bless everyone.","date":"October 14, 2012 at 3:40 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"senior110","post":"I saw your picture and Akriane’s. Yes, there is a lot  of resemblence. Did you paint it? and when? God  bless.","date":"October 31, 2012 at 2:06 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"senior110","post":"For those with a scientific bent, please read “Signature in the Cell” ( a rather lengthy book, but worth the time). God bless.","date":"October 31, 2012 at 1:48 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"senior110","post":"Have a I got book for you. Try reading “Signature in the Cell”. Hope to see your reaction on this blog some day. God bless.","date":"October 31, 2012 at 1:55 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"senior110","post":"Hi AnnieCee.  You are a very special person as I find you giving support to a lot of these testimonials. God bless you and everyone on this blog. AnnieCee, I tried to get into your website, but encountered technical problems. Can you fix it? thanks.","date":"October 15, 2012 at 3:02 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"senior110","post":"Sorry to hear about your illness, and I will pray for you. God bless.","date":"October 27, 2012 at 2:49 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"senior110","post":"I am happy that you are a Seminarian. God has chosen you especially for this very wonderful and arduous job. May God be always with you and may you spread of the Word to many.","date":"October 27, 2012 at 2:53 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"senior110","post":"Thanks for your story… I feel that you are an “enlightened” Christian which what  I am trying to be. I am developing a reading list for this winter, and your book will be one of them, if it’s in our library.  God bless.","date":"October 27, 2012 at 3:00 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"senior110","post":"Amazing writing. Thanks for your testimony as I fear death very much and I too love this earth and its beauty. There have been moments that I wish that I weren’t here, but they were very few. God bless everyone.","date":"October 24, 2012 at 2:12 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"senior110","post":"I’ve read most of the 500 or so posts and am impressed by the sincerity, support, encounters, experiences, and  testimonals. I am on a journey to an enlightened faith, so please do not judge me harshly. I have two questions: 1) what happened to those souls who never had the opportunity to accept Jesus Christ; 2) In  luke 21: 32: Jesus said that he will return before all the people of that time will have died. If I offended God or you, forgive me.","date":"October 21, 2012 at 2:51 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"senior110","post":"Thanks Ray for your thoughtful answer. Give me time to digest it. God bless Dianne, Michele and you for responding. Much appreciated. May I suggest everyone watch the videos by Streisand on Lord’s Prayer and One God on Youtube. Hope you’ll enjoy it as much as I did. I listen to them almost every night.","date":"October 26, 2012 at 1:56 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"senior110","post":"Thanks Dianne and Michele for your informative replies and kindness.  How about my second question? Did I misunderstand that?","date":"October 22, 2012 at 3:08 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"senior110","post":"Thanks Michele for a new perspective. Let me consider it. God bless.","date":"October 23, 2012 at 1:08 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"senior110","post":"Hi Dianne: I have read your reply a few times, but it has gone above me. Sorry. Perhaps I am not as conversant with the Bible as you or as I should be. Thank you for your kind explanation.","date":"October 24, 2012 at 2:20 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"senior110","post":"My condolences to the passing of your beloved son. In my life time I have seen six cases where  young good people died in the prime of their lives.Three of them left young families behind. The often-asked question is: why do bad things happened to good people? It is one of the great troubling puzzles for me and likely to many others. Skeptics would say that there is no God or is it true that the good die young? If so, why?","date":"November 6, 2012 at 3:26 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}],"blood":[{"author":"senior110","post":"Indeed this is interesting, BUT I HAVE SOMETHING MORE URGENT. PLEASE WATCH “THE LOST TOMB OF JESUS”.  This video has far far implications for Christianity.","date":"November 26, 2012 at 3:22 am","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","title":"MUST READ:  Cloning the man on the Shroud of Turin"},{"author":"senior110","post":"I am the person who cried “wolf” after seeing “The lost tomb of Jesus” and am very glad that the “evidence” of the documentary is being challenged here. I think it’s important that this discussion/explanation be made available widely so other “innocent” Christians wouldn’t be subjected to unnecessary painful test of their faith. Yannick, you expressed very well how I approach my faith and  even though I was baptised into the Catholic faith some 25 years ago, I still question some basic tenets of our faith and continue to read other religious materials. For example, I have read a few of Neale Walsch’s books : “Conversations with God”, “Communion with God” and “Home with God”. I would appreciate some comments on Walsch’s work. I would my faith to be an elightened one therefore I don’t accept everything in the bible as true. Clearly some are allegories and metaphors, but I do accept the general thesis of the bible.Could someone tackle the following questions:1) It is thru Christ that we have redemption. What happened to those souls who predated Christ?2) In Luke 21:29, “remember that all these things will take place before the people now living have all died”. I think Christ was referring to certain events (things) will happen before His second coming, BUT before all the people who were living at that time have died. That is, Christ was supposed come back before that generation had passed away. Is this the right interpretation?3) The Old Testament portrayed God like an ordinary being – full of vengeance, and hate etc. These can’t be the attributes of a loving and merciful God. How to reconcile the descriptions of God between the Old and New Testaments.Thanks to Yannick, Kelly, Daveb and others.","date":"November 28, 2012 at 3:51 am","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","title":"MUST READ:  Cloning the man on the Shroud of Turin"},{"author":"senior110","post":"Thanks to you, Kelly, and Daveb. I have never read such in-depth biblical and relevant scientific knowledge on the Shroud as in this site. Daveb, my view of God is more along the line of Neale Walsch, but not as extreme in some cases. Neale purportedly recorded the dialogues between God and him in a somewhat trance state. The first 3 books of Conversations with God were “mere” records of these dialogues. Book1 explains the reason for God creating the world in the first place, and  the souls come into being because they seek certain sensations or feelings. Therefore there are no villians or victims because all are willing participants. Far-feteched as it may seem, Hilter came to the world to have his “fantasy” fulfilled and the same for the holocaust victims. All are playing their roles. In Neale’s God’s world, there is no good or evil as everything is relative in this world. (I agree with that to a degree and this really echoes a famous writer who said that “nothing is good or evil but only thinking makes so.. may have misquoted this.)Eventually we all reunite with God and will come back to this world many times to have different experiences.  I am not doing justice to Neale’s work as I am writing strictly from memory of material I read over 10 years ago. I highly recommend Neale’s Book1 to theists and atheists because of its intellectual merits alone.God bless everyone and thanks again. I am going view video again with a fresh eye.","date":"November 29, 2012 at 2:14 am","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","title":"MUST READ:  Cloning the man on the Shroud of Turin"}],"dating":[{"author":"senior110","post":"I think I read the first book published (1976?)  on the shroud. With my limited understanding of science ( I majored in physics, math, and chemistry), I can’t image any human being is capable of producing an image that has the characteristics of the shroud – not then nor now.","date":"November 15, 2012 at 5:57 am","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility"}],"misc":[{"author":"senior110","post":"Enjoy reading this blog, but unfortunately, I don’t have the training/knbowledge nor the HP to fully appreciate this and wish I were 20 years younger with an additional 50 IQ points. May I respectively recommend you peruse some of Sheldrake’s writings. I thought “Conversations with God” was a stretch, Sheldrake’s goes beyond that: he even questions the scientific method as currently practiced.  Would appreciate some feedback.","date":"December 14, 2012 at 3:37 am","url":"https://shroudstory.com/2012/12/13/livescience-goofs-again/","cat":"uncategorized","title":"LiveScience Goofs Again"}],"resources":[{"author":"senior110","post":"I read about Padro Pio some 25 years ago. Besides his stigmatas, he was known to appear in two places in the same time and other supernatural feats. Do you believe them?","date":"December 20, 2012 at 4:40 am","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"author":"senior110","post":"Thx for a very detailed and scientific explanation. When I read the first book on this subject some 30+ years ago there was certainly lot less description than what you described.Also it’s nice to hear from a person who had hands-on experience on the subject. I still confounded by the shallow irradiated image on the shroud, for the moment, I am not concerned whether or not there was a resurrection.   Admittedly I don’t completely understand what you have described, but I don’t think that you, too, have provided an adequate explanaton of the image.","date":"November 24, 2012 at 3:25 am","url":"https://shroudstory.com/2012/11/23/blinding-ignorance-does-mislead-us/","cat":"books","title":"Blinding ignorance does mislead us"}]}
