{"dating":[{"author":"tersio_gorrasi","post":"Supernatural phenomena, of course, cannot still be proved by scientific methods. However, we can think in a ‘scientific fashion’ about many yet unexplained phenomena. As the Shroud and the Sudarium could be both of them in contact with Someone in Whom something extraordinary happened, if we suppose that time flew backwards in the atomic structure of these cloths, they will appear with less C14 atoms than expected!","date":"November 3, 2011 at 5:37 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"author":"tersio_gorrasi","post":"Yes, my hypothesis is that many unexplained phenomena we know from religious characters are related with some changes in the space-time, that is, time flowing either backwards or forwards but limited in a certain region of the space, as if the time dimension were curved inside of itself. See for example, 2 Kings 20:9, Joshua 10:13  and Ezekiel 37:1-14. Otherwise, how can we explain Christ’s resurrection if time don’t flew backwards for His body until the time when was He arrested?","date":"November 1, 2011 at 8:36 am","url":"https://shroudstory.com/2011/10/31/giulio-fanti-on-the-carbon-dating-of-certain-relics/","cat":"carbon_14_dating","title":"Giulio Fanti on the Carbon Dating of Certain Relics"},{"author":"tersio_gorrasi","post":"Instead of spend precious time with the eternal debate wether  the Shroud is authentic or not, we should suppose that it is in fact, and to attempt understand what happened in the process of Christ´s Resurrection. Also, this could offer clues about the other eternal debate creationism x darwinism. Explaining: In the Resurrection, Christ’s body disappeared and was rebuilt again, as suggested by the Shroud. This way, all the living creatures could arise by assembly of its component parts (God made Adam from existing matter,as quoted in Genesis), for example","date":"July 6, 2011 at 8:46 am","url":"https://shroudstory.com/2011/07/05/crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"carbon_14_dating","title":"Crazy Talk: Are Atheists biased or just uninformed?"}],"history":[{"author":"tersio_gorrasi","post":"I think the image as caused by time related events in the cloth going back as Christ’s body went to another dimension, in a process like the teleport of the StarTrek movies.This could be the reason by which both the Shroud and the Sudarium of Ov iedo seem to be younger than they are","date":"August 10, 2012 at 7:10 am","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","title":"Imagine the image as part of the resurrection and not the result of the resurrection"},{"author":"tersio_gorrasi","post":"This also implies in total disintegration of Jesus’body converted it into pure energy, being rebuilt outside of the cloth, as the current theory of teletransportation states","date":"September 9, 2010 at 11:13 am","url":"https://shroudstory.com/2010/09/07/is-the-shroud-a-radiation-photo-of-the-resurrection-some-think-so/","cat":"news_&_views","title":"Is the Shroud a ‘radiation photo’ of the resurrection? Some think so."}],"image":[{"author":"tersio_gorrasi","post":"I stopped to receive these comments!","date":"March 12, 2012 at 10:09 am","url":"https://shroudstory.com/2012/03/04/john-jackson-on-colin-berrys-highly-misleading-comments/","cat":"image_theory","title":"John Jackson on Colin Berry’s “highly misleading” comments"}],"opinion":[{"author":"tersio_gorrasi","post":"It’s just the Man of the Shroud, I believe, Who has all the answers about the mysteries of the Universe we need.There is no effect without a cause. If the Universe began by itself, only following the physical laws, then one would ask” From where such laws came out?”‘Law’ means ‘order’and the chance only accounts for disorder, not order.This is so that scientists today attempt to “recriate” the Big-Bang in the CERN by means of order (the action of human minds) and not by chance!","date":"September 9, 2010 at 8:18 am","url":"https://shroudstory.com/2010/09/02/stephen-hawking-says-gods-not-needed-so/","cat":"news_&_views","title":"Stephen Hawking says God’s not needed. So?"},{"author":"tersio_gorrasi","post":"It’s impossible an effect without its cause.One would ask: From where the physical laws, including gravity, came from? The physical laws means order, and order means not causality, not chance.Could the bright brain of this scientist at least be affected by his neurologic disease?","date":"September 28, 2010 at 8:04 am","url":"https://shroudstory.com/2010/09/24/stephen-hawking-says-gods-not-needed-continued/","cat":"news_&_views","title":"Stephen Hawking says God’s not needed. (Continued)"},{"author":"tersio_gorrasi","post":"This hypothesis is untenable by all that we know about te Shroud. Even the minimal contact of the resurrected body with the cloth would produce distortions on the image, which don’t agree with we observe on it. Those image features are compatiible too, with the cloth being rectified both up and below of the body, rather than involving it","date":"June 12, 2015 at 2:19 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"author":"tersio_gorrasi","post":"Well, unicorns could be easily produced through genetic manipulation over a dozen or less years. Therefore, its existence is theoretically possible!","date":"January 19, 2012 at 10:14 am","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","title":"The State of Skepticism: Ridicule works. Right?"}],"researchers":[{"author":"tersio_gorrasi","post":"Dear MrI’m an entusiast on the Shroud of Turin, among many others. It’s a very simple approach about the secular controversy on this amazing cloth: a forger never will fake something which he does not know, or something which his contemporary people do not know, because this would be absolutely nonsense. It’s the same thing as one who fakes a thirty dollars bill! Well, neither the New Testament nor the apochriphal gospels mention a single line about the existence of a cloth with both the images frontal and dorsal of Jesus’ body. One would suppose the Veronica’s veil, which displays only Jesus’face and is know by Christian tradition, would be faked instead. If the Shroud were a fake, this would be the greatest paradox of all time, because an astonishing masterpiece which defies even the 21th Century scientists, would be made in order to convince the audience on the authenticity of something unknown by them!RegardsTersio Gorrasi, MSc","date":"April 1, 2011 at 10:21 am","url":"https://shroudstory.com/2011/04/01/an-improvement-on-garlaschellis-method/","cat":"news_&_views","title":"An Improvement on Garlaschelli’s Method"}],"resources":[{"author":"tersio_gorrasi","post":"Why not to buy the relic and submit it to radiocarbon dating? I don’t have enough money for this","date":"August 14, 2011 at 7:59 am","url":"https://shroudstory.com/2011/08/14/mark-oxley-on-the-piece-of-the-shroud-of-turin-on-ebay/","cat":"books","title":"Mark Oxley on the Piece of the Shroud of Turin on eBay"},{"author":"tersio_gorrasi","post":"This statement is completely absurd and should not be led in consideration. It only repeats Muslim beliefs about Jesus. Even a normal and healthy man would die as soon as the brutal flagellation was done, due to the massive loss of blood and fluids. We have still the physical effort of walking toward the Golgota, the great difficulty of breathing on the cross, and the ultimate spear in the chest, which perforated the cardiac wall via percicardium. Could someone survive at all?","date":"January 9, 2012 at 5:45 am","url":"https://shroudstory.com/2012/01/09/new-kindles-from-helmut-felzmann/","cat":"books","title":"New Kindles from Helmut Felzmann"},{"author":"tersio_gorrasi","post":"Once again, Mr Helmut insists on the absurd idea of that Jesus did not die in the cross, mentioning an article of the forensic physician Dr Lorente, that not even has date. Such an article, besides to ignore the spear in the chest, that surely did not come from a pulsatile heart (the blood flowed slowly, rather than in spurts), it not concern about how could an alive person to produce such an image on the cloth that wrapped, him, without any distortion (this coul be easily verified with experiments in voluntary persons). This only reinforces my hypothesis of the time running backwards for all physical events in the space limited within the Shroud. I have had suggested to John Jackson (whick ignored me) an interesting experiment, supposing the Man of the Shroud floating in the vertical position, and the Shroud rectified both ahead and back to Him. The distances of the Shroud rectified this way and the different regions of the body would be measured and such distances compared with the approximate time when the wounds were produced, considering as t0 the time when Jesus was arrested. If my hypothesis is valid, there will be a direct  proportion between time and distance","date":"January 16, 2012 at 7:47 am","url":"https://shroudstory.com/2012/01/09/new-kindles-from-helmut-felzmann/","cat":"books","title":"New Kindles from Helmut Felzmann"},{"author":"tersio_gorrasi","post":"It´s Interesting as nobody still thought about changes in time flow as a possible cause in the process of the image formation on the Shroud. Many features could be explained this way. I think about a time flow running backwards over a limited region of the space inside the tomb. Yes, this could be concerned as either science fiction or pseudo-science in the present state of the art, but it cannot be ruled out if we want to solve this fascinating mistery. This way, the rate of radiocarbon dating would slow because many C14 atoms returned to they initial state and some features of the Man in the image would look as if He was alive again! One could be surprised as a very old cloth is so well preserved as well (see the tilma of Guadalupe and the Sudarium of Oviedo as other examples)","date":"January 13, 2012 at 7:20 am","url":"https://shroudstory.com/2012/01/09/new-kindles-from-helmut-felzmann/","cat":"books","title":"New Kindles from Helmut Felzmann"},{"author":"tersio_gorrasi","post":"dear Mr HelmutMy hypothesis is not my phantasy. It’s based on what we can detect in the Shroud and in the Bible itself. See for example Ezekiel 37:4-10, Isaiah 38:8, 2 Kings 20:9-10 and Joshua 10:13. We understand as miracle something extraordinary which has not scientific explanation up today, but perhaps in a future time this explanation would come from new physical laws. This cannot be ruled out!","date":"January 13, 2012 at 7:00 pm","url":"https://shroudstory.com/2012/01/09/new-kindles-from-helmut-felzmann/","cat":"books","title":"New Kindles from Helmut Felzmann"},{"author":"tersio_gorrasi","post":"Very good article. I think that those two forgetful angels found in the sepulcher could have a very important role  in the process of the Resurrection. According my viewpoint, they could have placed Jesus’ body in the vertical position (suggested by His hair) changing the gravity and the time-space due to their presence in the tomb scenario","date":"July 27, 2011 at 8:26 am","url":"https://shroudstory.com/2011/07/25/paper-chase-the-shroud-of-turin-from-the-viewpoint-of-the-physical-sciences/","cat":"news_&_views","title":"Paper Chase: The Shroud of Turin From the Viewpoint of the Physical Sciences"}]}
