{"art":[{"author":"tobacconist","post":"Because if your heart is already hard, then the testimony of a child will not move you.  One of the recurring themes of that book is that God loves His children, and especially the non-adult variety.  Burpo speculated on why, and settled on the fearless honesty.  He noted that tact and guile are sort of brothers – one merciful, the other deceitful – and they come to accompany us at one point as we grow up.A four year old has neither.Another speculation made by Burpo is that the testimony of a four year old cuts through the academic analysis we’ve made of modern Christianity.“Jesus had to die so that we could be with His Father.”That was the boy’s summary of Christianity as he learned it in the three minutes he died and was in the presence of Christ.I believe it’s the position of Christ that he could come down and allow the hard of heart to put their hands in his wounds and still they would not believe.To have a pair of children testify to the exact likeness of Christ isn’t going to move anyone who cannot be moved.  All it can do is comfort those who soldier on under the false apprehension that they are alone.We’ve always had the Holy Spirit, who’s probably the Rodney Dangerfield of the Trinity.  That the Spirit is there for us when we believe we cannot take another step in the faith is part of a promise He made to us – This is the exact place that the Holy Spirit found Todd Burpo as his son lay dying on a surgical table.That He chose to allow that to manifest itself in children makes utter sense to me.I believe that God, His Son, and the Holy Spirit is fully aware of the difficulty of what they have asked of us – to remain like a child, with all of a child’s naive credulity, while at the same time remain vigilant of those that would come proclaiming falsely that they are God.A child, however, knows its parents.The Burpo child said that the angels in Heaven carry swords, for the purpose of defending Heaven from demons.  We walk in the world, where Satan is the prince of the air, unarmed, but for the Holy Spirit and the Will of God.If you are moved by this child, and believe for yourself that what the child claims is scripturally consistent, then consider that the Word of God, in your case, has fallen on good soil.The book was on the nightstand of my cousin’s cabin, where we met for a family reunion this last weekend.  I picked it up and finished it four hours or so later.  Just because Satan rules earth for now doesn’t mean that God has His hands tied behind his back.God loves us, and wants us to love Him back.  If God were a metaphysical certainty, our fealty to Him would be out of fear, not love.  God is no rapist.  There is no love without faith.","date":"August 16, 2011 at 2:58 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
