{"art":[{"author":"wendi_b","post":"I have to say that the minute I laid eyes on ‘The First’ painting, the immediate thought that came to mind was “Adam and Eve”.  Then I noticed that the painting was called ‘The First’ and I thought “Yes, the first couple!”  Just shows how each of us see things from different perspectives.  I have to admit though that some of the paintings bother me and I really pray that Akiane’s gift will not be tainted by the world, but that she will use it solely to glorify God.","date":"September 3, 2011 at 9:18 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"author":"wendi_b","post":"Ever since I saw the ‘Matthew’ movie with Bruce Marciano playing the role of Jesus and read Bruce’s book ‘In the Footsteps of Jesus’ (highly, highly recommended) I have believed that God knit Bruce together in his mother’s womb to resemble Jesus as closely as possible.  I believe that, if you watch ‘Matthew’, you get a very accurate idea of Jesus’ personality and what He looked like.  Every scene in that movie was prayed over by the directors before it was shot and watching the movie and reading the book gives one the most beautiful insight into who Jesus was then and is today.  The first thing that struck me when I saw Akiane’s painting of Jesus was how much it looked like Bruce in ‘Matthew’.   I also see a strong resemblance to the Shroud of Turin, although there are differences.  I loved Colton’s story and believe it is accurate.  It doesn’t bother me that there are differences and variations between people’s accounts of heaven.  As human beings on earth we are all unique and also imperfect vessels and probably do not ‘filter’ everything the same way or perfectly.  What is important is that Jesus is REAL and we need to put our faith in Him if we ever want to get to heaven to find out for ourselves what it is really like.  As to why Jesus may be revealing Himself to us in this way, maybe it is because time is running out and He is using more and more methods of drawing people to Him.  If the sharing of experiences and pictures like this bring people to Him, WONDERFUL!  No, we must not then hang on to these books and pictures and base our faith on them.  They are just tools to bring us to the Truth which is in the Bible and we must mature and move on to greater and greater Truth and we read His Word.  It struck me while reading ‘Heaven is for Real’ that so much of what Colton shared was already in the Bible for us to know, but we require hearing it from a small child to make us take it in and believe it.  At any rate, thank you Colton for sharing your story and all the others who have shared on this site.  Thank you Akiane for your painting – don’t be drawn away from Jesus and His Truth or allow the world to dilute the truth you have already had revealed to you.  God bless you both and your families and continue to use your ‘works’ to draw people to Him.To God be the Glory!","date":"September 2, 2011 at 3:36 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]}
