[{"id":"comment-9831","author":"tamara_beryl_latham","post":"It’s all in the stars people! Seek and ye shall find! One doesn’t have to be a rocket scientist; one just has to have a pair of good eyes. Fact: Pia Secondo took a photo of the face on the Shroud and then he developed the photo. The image on his negative is the face we see of Jesus today (Shroud image). I duplicated this process with the Sudarium of Oviedo (the head napkin that covered the head of Jesus in the tomb). I downloaded the Sudarium photo and then printed it out. I then took a photo with my digital camera and printed out that image. And unbelievably, there it was. The Oviedo cloth contained the same face as that on the Shroud of Turin. The Shroud scientists have also confirmed the blood spots on both the Shroud and the Sudarium line up exactly, and both have AB blood type. These scientists concluded both head napkin and shroud covered the same man. I then downloaded the “Hand of God” image taken by the NASA Chandra telescope. This pulsar is 17,000 light years away (equivalent to 1700 years ago). After downloading the Chandra image, I placed all three side by side. Amazingly all three photos are of the same man. No doubt about it! With that in mind, the image of Jesus has appeared on two different cloths and once in the stars. The Chandra image even contains a crown of red stars. Check it out on Google images (Hand of God, Chandra telescope). God has shown you His image and His wounds on both the Sudarium and the Shroud and He has shown you His exact image in the stars (1700 years ago) How much more proof does one need? And how does Dawkins explain the DNA double helix and all the genetic coding of humans, plants and animals? Only God could accomplish such engineering. Does Dawkins believe the entire DNA chain just materialized in some primordial soup? Amino acids maybe, but not DNA. The probability of that happening is trillions to one. There are many who align themselves with Dawkins’ views, but I am of the opinion, like the old cliche, “A one eyed man is King in the land of the blind” Best, Tamara Beryl Latham.","date":"2012-04-01","mins":"12:07 am","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins"}]
