[{"id":"comment-3108","author":"tamara_beryl_latham","post":"The oldest physical description of Jesus by Pilate and various others, who lived at the time of Jesus, confirm the image detailed on the Shroud of Turin. See the link. Physical Description of Jesus Physical Descriptions of Jesus The Oldest Views and Literary Data on the External … Pilate to Tiberius Caesar describing the physical appearance of Jesus. … http://www.thenazareneway.com/likeness of our saviour.htm – Cached – Similar Further, the image taken by the Chandra Telescope from 1700 years ago, titled “Hand of God” is also very similar to the Shroud image of Jesus. Note the crown of red stars on the head. If one were to place the Chandra image next to the head on the Shroud image it would be clear the images are the same. Check out the Chandra image under google images “Hand of God.” Best, Tamara.","date":"2011-05-10","mins":"3:08 pm","url":"https://shroudstory.com/2011/01/17/british-first-showing-of-the-new-david-rolfe-shroud-of-turin-film/","cat":"news_&_views","title":"British First Showing of the new David Rolfe Shroud of Turin film"},{"author":"tamara_beryl_latham","post":"More importantly, if all the testing is discounted, we are left with a most important fact.The Sudarium has been in Oviedo, Spain since the 7th century. I believe since 631 AD. This is fact.When the Sudarium and The Shroud of Turin face are aligned, the blood spots exactly line up. The Sudarium and the Shroud of Turin both have the rare blood type AB.This alone should be cause for alarm, with respect to the C14 dating of the shroud. The C14 should have, at least, dated the shroud to the 7th century.Best,Tamara Beryl Latham.","date":"2008-07-21","mins":"6:07 AM","url":"http://theshroudofturin.blogspot.com/2008/02/shroud-of-turin-may-not-be-fake-after.html","title":"\nShroud of Turin may not be a fake after all!\n"},{"id":"comment-9800","author":"tamara_beryl_latham","post":"It doesn’t take a rocket scientist. The proof that the Shroud of Turin is Jesus is in the stars! If you download the “Hand of God” image taken by the NASA Chandra telescope, which is 17,000 light years away (1700 years old), you will see this image is the same facial image as that on the Shroud of Turin. Then, download the picture of the head napkin of Christ that has been in Oviedo, Spain since the 700s. Once you download this picture, take a picture of the downloaded picture with your camera. The same image as that of the Shroud of Turin appears. Both the Shroud image, the Chandra image and the Oviedo image are the same face. This IS the face of Jesus. The Chandra image even details the crown of thorns in red. See links. Chandra :: Photo Album :: PSR B1509 58 :: 3 April 09 Blog: A Young Pulsar Shows its Hand … ray nebula that spans 150 light years. At the center of this image made by NASA’s Chandra X ray … think that B1509 is about 1700 years … http://www.chandra.harvard.edu/photo/2009/b1509“God’s Hand” captured; shape spanning 150 light years “God’s Hand” captured; shape spanning 150 light years: A photo of Pulsar B1509 taken by NASA’s Chandra X ray … is a picture … 1,700 years old and is located 17,000 light years … english.peopledaily.com.cn/90001/90783/91322/6638238.html The Hand of God: Scientists reveal amazing X ray image of a … … now we have the first image of the hand of God. … nebula that spans 150 light years. At the center of this image made by NASA’s Chandra X … that B1509 is about 1700 years … http://www.sikhnet.com/news/hand god scientists…image supernova deep space In conclusion, the image in the stars, the burial cloth (Shroud) and the head napkin (Sudarium of Oviedo) all contain the same face. The Shroud is authentic as shown by the face in the stars from 1700 years ago. Best, Tamara Beryl Latham.","date":"2012-03-30","mins":"3:37 pm","url":"https://shroudstory.com/2012/03/27/sky-news-interview-with-thomas-de-wesselow/","cat":"books","title":"Sky News Interview with Thomas De Wesselow"},{"id":"comment-9824","author":"tamara_beryl_latham","post":"Ron, another thing that I found equally amazing is when Secondo Pia took a photo of the face on the linen shroud and then developed it, the negative displayed the face of Jesus. And this is the face we see today with the photo image taken by Barrie Schwortz. I did the same experiment. Download an image of the Sudarium of Oviedo and print it out, and then take a picture of the printed image with your camera. The face that appears is the exact image as that facial image on the Shroud. And I mean exact, with the long nose, small lips, eyes, beard, etc. So, in conclusion the face appears on the Oviedo cloth, dated 700s. The same face appears on the Sudarium (Carbon dating was off) and the same face appears in the sky somewhere around 300 AD (CE). What one should wonder is what happened around 300 AD that Jesus found it so necessary to appear in the sky? I haven’t researched this extensively, but I did find in 303 AD, according to Michael Baigent in “The Jesus Papers,” that it was the beginning of the Christians being persecuted by Diocletian, Emperor of Rome, and there was massive destruction and deaths. With that in mind, I wondered if the Chandra image could be dated to 303 AD? I suppose NASA could do the calculations. What needs to be shown is all three images side by side. There is no doubt all three are of the same man. Best, Tamara Beryl Latham.","date":"2012-03-31","mins":"11:32 am","url":"https://shroudstory.com/2012/03/27/sky-news-interview-with-thomas-de-wesselow/","cat":"books","title":"Sky News Interview with Thomas De Wesselow"}]
