[{"id":"comment-111675","author":"ryan","post":"Mike, since you are Orthodox, I know of two leading Orthodox theologians who are ‘hopeful universalists’: Russian Orthodox Bishop Hilarion Alfeyev and Bishop Kallistos Ware. You should read Alfeyev’s speech at the 2008 World Congress on Divine Mercy. You can google ‘The Congress Catches Fire’. Ware wrote a short paper called ‘Dare We Hope for the Salvation of All’? A very balanced piece. Interestingly, in Ware’s piece, he mentions that during Vespers, on the Sunday of Pentecost, the Orthodox Church says a prayer for those in hell. Why pray for them if there’s absolutely no chance of Christ’s redemption affecting their fate?.","date":"2014-05-05","mins":"7:05 am","url":"https://shroudstory.com/2014/05/04/everyone-goes-to-heaven/","cat":"news_&_views","title":"Everyone Goes to Heaven?"},{"id":"comment-111095","author":"ryan","post":"Mike, even if you don’t accept the teaching authority of the church fathers, their opinion on the matter is relevant in the sense that they, the Eastern church fathers in particular, were experts in the Greek language. Greek was their mother tongue, and as you well know, Greek was the original language of the New Testament. Based on their writings and the writings of some current Christian universalists, the english word ‘eternal’, in certain contexts, does not necessarily mean endless. Instead, it (in the original Greek) can mean a long, but finite period of time. It’s a long, complex grammatical debate, of which I am not an expert, but I’ve read that ‘Terms for Eternity: Aionios and Aidios in Classical and Christian Texts’ is a good resource on the topic. Also, when it comes to ‘proof texts’, one can read certain bible verses which seem to clearly support eternal damnation, others which seem to clearly support annihilationism, and others (particularly in the Gospel of John and several of Paul’s epistles) which seem to clearly support universal salvation, through Christ. Obviously, they can’t all be right, so Christian universalists often attempt to view these specific verses through the lens of the whole biblical narrative, from Genesis to Revelation. Finally, if you are an evangelical, I’ve heard ‘The Evangelical Universalist: Second Edition’ is a thought provoking resource on the topic..","date":"2014-05-04","mins":"6:17 pm","url":"https://shroudstory.com/2014/05/04/everyone-goes-to-heaven/","cat":"news_&_views","title":"Everyone Goes to Heaven?"},{"id":"comment-112027","author":"ryan","post":"Mike, Here are some universalistic scriptures from the New Testament: John 3:17, John 12:32, Matthew 5:26, Romans 5:15,18 20; Colossians 1:19,20; 1 Corinthians 15:22,28; 1 Timothy 4:10, 1 John 2:2, Revelation 1:18 (the thought being that He holds the keys, hell is not locked from the inside).","date":"2014-05-05","mins":"3:07 pm","url":"https://shroudstory.com/2014/05/04/everyone-goes-to-heaven/","cat":"news_&_views","title":"Everyone Goes to Heaven?"},{"id":"comment-110898","author":"ryan","post":"Based on what I’ve read, early church fathers such as Clement of Alexandria, Origen, Gregory of Nyssa, Macrina the Blessed, and Isaac of Syria to name a few, endorsed Christian universalism, i.e. All mankind will eventually go to heaven. Gregory of Nyssa, a revered saint in both the Roman Catholic and Orthodox churches, even believed that Satan himself would one day be healed, redeemed, and restored through the mercy and power of Christ. In addition, Basil the Great, Augustine, and Jerome, all of whom supported what we now call the traditional view (eternal damnation for the impenitent), wrote that during their day (4th & 5th centuries), ‘the mass of men’, ‘many’, and ‘very many’ in the Christian community endorsed the Christian universalist view. Christian universalism, along with eternal damnation and annihilationsim (God simply destroys the impenitent & wicked) were the three main eschatological views during the first 500 years of Christianity. With the influence of Augustine and the Origenist controversies in the 550s AD, Christian Univeralism would become a tiny minority position over the next 1500 years. For clarification purposes, Christian universalism is not to be confused with religious pluralism (many paths to God) or Unitarian universalism. Christian/Trinitarian Universalism accepts the following: the Holy Trinity as the one true God, the divine inspiration of scripture, the virgin birth of Christ, the miracles of Christ, the Deity of Christ, the sacrificial death of Christ, the bodily resurrection of Christ, the reality of Hell (albeit of finite duration), and the concept of eternal life as a gift of God’s grace through the merits of Christ. When it comes to the reality of Hell, more specifically, Christian Univeralism posits that Hell is very real, but is meant to cleanse, humble, purge, and reform the sinner. In this view, it has been said, God is seen as a Cosmic Physician, not a Cosmic Sadist. Finally, as the article stated, Julian of Norwich seemed to be a Christian Universalist. On a side note, Ann Bronte and Abraham Lincoln were Christian Universalists. Even today, ‘hopeful universalism’ is tolerated in the Roman Catholic, Eastern Orthodox, and some evangelical sects, though ‘dogmatic universalism’ is not. A fascinating topic. I wonder if this view, much like the status of the Shroud, would be more effective in potentially opening the hearts and minds of skeptics? After all, this view seemed to be most prevalent when Christianity was taking on and besting the premier Roman and Greek philosophers in ancient times..","date":"2014-05-04","mins":"1:45 pm","url":"https://shroudstory.com/2014/05/04/everyone-goes-to-heaven/","cat":"news_&_views","title":"Everyone Goes to Heaven?"},{"id":"comment-150727","author":"ryan","post":"Perhaps miracles can be divided into supernatural and hypernatural categories? http://www.reasons.org/articles/hypernaturalism integrating the bible and science to explain god s miracles.","date":"2014-09-13","mins":"11:03 am","url":"https://shroudstory.com/2014/09/13/mystery-is-never-ever-proof-of-anything/","cat":"science_and_religion","title":"Mystery is never ever proof of anything"}]
