[{"id":"comment-94929","author":"alexander_walker","post":"This may be of interest: “As the Internet evolved, one of the major challenges was how to propagate the changes to the software, particularly the host software. DARPA supported UC Berkeley to investigate modifications to the Unix operating system, including incorporating TCP/IP developed at BBN. Although Berkeley later rewrote the BBN code to more efficiently fit into the Unix system and kernel, the incorporation of TCP/IP into the Unix BSD system releases proved to be a critical element in dispersion of the protocols to the research community. Much of the CS research community began to use Unix BSD for their day to day computing environment. Looking back, the strategy of incorporating Internet protocols into a supported operating system for the research community was one of the key elements in the successful widespread adoption of the Internet. One of the more interesting challenges was the transition of the ARPANET host protocol from NCP to TCP/IP as of January 1, 1983. This was a “flag day” style transition, requiring all hosts to convert simultaneously or be left having to communicate via rather ad hoc mechanisms. This transition was carefully planned within the community over several years before it actually took place and went surprisingly smoothly (but resulted in a distribution of buttons saying “I survived the TCP/IP transition”). TCP/IP was adopted as a defense standard three years earlier in 1980. This enabled defense to begin sharing in the DARPA Internet technology base and led directly to the eventual partitioning of the military and non military communities. By 1983, ARPANET was being used by a significant number of defense R&D and operational organizations. The transition of ARPANET from NCP to TCP/IP permitted it to be split into a MILNET supporting operational requirements and an ARPANET supporting research needs. Thus, by 1985, Internet was already well established as a technology supporting a broad community of researchers and developers, and was beginning to be used by other communities for daily computer communications. Electronic mail was being used broadly across several communities, often with different systems, but interconnection between different mail systems was demonstrating the utility of broad based electronic communications between people. […] With the exception of BITNET and USENET, these early networks (including ARPANET) were purpose built – i.e., they were intended for, and largely restricted to, closed communities of scholars; there was hence little pressure for the individual networks to be compatible and, indeed, they largely were not. In addition, alternate technologies were being pursued in the commercial sector, including XNS from Xerox, DEC Net, and IBM’s SNA.8 It remained for the British JANET (1984) and U.S. NSFNET (1985) programs to explicitly announce their intent to serve the entire higher education community, regardless of discipline. Indeed, a condition for a U.S. University to receive NSF funding for an Internet connection was that “… the connection must be made available to ALL qualified users on campus.”.","date":"2014-03-30","mins":"12:41 pm","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","title":"Stephen Jones’ Revised Hacking Theory Part I is Available"},{"id":"comment-95998","author":"alexander_walker","post":"Forgive me for asking, but when, again, were David Roemer’s “postulations” given exegesis?.","date":"2014-04-02","mins":"10:19 pm","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","title":"The Computer Hacker Hypothesis is Short on Factual Material"}]
