[{"id":"comment-136179","author":"colin_berry","post":"Display of the disinterred head of St.John the Baptist? From wiki: First and Second Finding of the Head of St. John the Baptist (February 24). According to church tradition, after the execution of John the Baptist, his disciples buried his body at Sebaste, but Herodias took his severed head and buried it in a dung heap. Later, Saint Joanna, who was married to Herod’s steward,[4] secretly took his head and buried it on the Mount of Olives, where it remained hidden for centuries. The First Finding occurred in the fourth century. The property on the Mount of Olives where the head was buried eventually passed into the possession of a government official who became a monk with the name of Innocent. He built a church and a monastic cell there. When he started to dig the foundation, the vessel with the head of John the Baptist was uncovered, but fearful that the relic might be abused by unbelievers, he hid it again in the same place it had been found. Upon his death, the church fell into ruin and was destroyed. The Second Finding occurred in the year 452. During the days of Constantine the Great, two monks on a pilgrimage to Jerusalem reportedly saw visions of John the Baptist, who revealed to them the location of his head. They uncovered the relic, placed it in a sack and proceeded home. Along the way, they encountered an unnamed potter and gave him the bag to carry, not telling him what it was. John the Baptist appeared to him and ordered him to flee from the careless and lazy monks, with what he held in his hands. He did so and took the head home with him. Before his death, he placed it in a container and gave it to his sister. After some time, a hieromonk by the name of Eustathius, an Arian, came into possession of it, using it to attract followers to his teaching. He buried the head in a cave, near Emesa. Eventually, a monastery was built at that place. In the year 452, St. John the Baptist appeared to Archimandrite Marcellus of this monastery and indicated where his head was hidden in a water jar buried in the earth. The relic was brought into the city of Emesa and was later transferred to Constantinople. Third Finding of the Head of St. John the Baptist (May 25). The head was transferred to Comana of Cappadocia during a period of Muslim raids (about 820), and it was hidden in the ground during a period of iconoclastic persecution. When the veneration of icons was restored in 850, Patriarch Ignatius of Constantinople (847 857) saw in a vision the place where the head of St. John had been hidden. The patriarch communicated this to the emperor Michael III, who sent a delegation to Comana, where the head was found. Afterwards, the head was again transferred to Constantinople, and here on May 25, it was placed in a church at the court. Just a thought….","date":"2014-07-08","mins":"6:19 am","url":"https://shroudstory.com/2014/07/08/a-long-cloth-mandylion/","cat":"art","title":"A Long Cloth Mandylion?"},{"id":"comment-136229","author":"colin_berry","post":"Yes, David, it was the extrusion of the fabric from out of the bottom front of the frame that made me think the figure’s head was 3 D, maybe to preserve sensibilities re St.John’s manner of execution. But having scanned a few images under a variety of search tags, I’m now inclined to agree with both (!) OK and Charles – it’s possibly a fusion or hybrid of the Image of Edessa and the Veil of Veronica. See my correction posted a few minutes ago..","date":"2014-07-08","mins":"8:49 am","url":"https://shroudstory.com/2014/07/08/a-long-cloth-mandylion/","cat":"art","title":"A Long Cloth Mandylion?"},{"id":"comment-136300","author":"colin_berry","post":"Yes, Henrik, but see the caption that accompanies that picture (Google translation from the Italian): “In this miniature f. 75 is depicted Christ, who reports to King Abgar by sending His own face imprinted on a cloth.” It should surely have been an unblemished, unbloodied image at the stage (or so it would seem to us out of area dilettantes)..","date":"2014-07-08","mins":"1:38 pm","url":"https://shroudstory.com/2014/07/08/a-long-cloth-mandylion/","cat":"art","title":"A Long Cloth Mandylion?"},{"id":"comment-136226","author":"colin_berry","post":"PS: On second thoughts, those two fellas with distinctive shields on the right would seem to be hostiles (Persians?). So this time, wiki supports the Image of Edessa interpretation: “The first record of the existence of a physical image in the ancient city of Edessa (now Urfa ) was in Evagrius Scholasticus writing about 593, who reports a portrait of Christ, of divine origin (θεότευκτος), which effected the miraculous aid in the defence of Edessa against the Persians in 544.” That would not prevent the Edessa image having been assumed in this artwork to have been one and the same as the still in vivo Veil of Veronica (as distinct from the Shroud). The image would certainly seem to be that of someone still living, though apparently lacking some Veil features we see elsewhere (crown thorns etc). Confusing, innit? Forget what I said about it being John the Baptist. Influenced partly by Charles’s comment, my money’s on it being an Image of Edessa/Veil of Veronica hybrid..","date":"2014-07-08","mins":"8:42 am","url":"https://shroudstory.com/2014/07/08/a-long-cloth-mandylion/","cat":"art","title":"A Long Cloth Mandylion?"},{"id":"comment-12091","author":"colin_berry","post":"Onan the Barbarian : Your Google search is obviously biased by the choice of the search words. If you search for “lid”, no wonder the first matches say it’s a lid!!! Agreed. But there were enough references to “lid” from different independent sources to be confident that it was a mainstream interpretation. The Google search was intended merely to combat the tunnel vision displayed by those who fix on one particular small drawing – showing a feature that might just be a burial shroud,rather than a sarcophagus lid. Even Stephen Jones on his “not up for debate site” is now saying that it IS a lid, but intended by the artist to be symbolic of the Shroud. (I have the greatest admiration for bloggers who are able to mind read the intentions of medieval illustrators, given the paucity of clues, and the bewildering lack of internal consistency, like pristine hands in one picture, and nail wounds in the next (centre palm in at least one hand, which is hardly calculated to say “This artist wants you to know he has seen the Shroud”)..","date":"2012-06-08","mins":"9:28 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12118","author":"colin_berry","post":"Sorry David – have only just spotted this superbly documented comment. I shall go through your links later this evening – it’s so refreshing to have a wide angle view in all matters pertaining to the Shroud….","date":"2012-06-09","mins":"2:08 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12119","author":"colin_berry","post":"PS: Yup, quite a few tombs and tomb lids there, David, to say nothing of discarded burial shrouds. There is a problem, however, with your links to the enluminures site – you seem to have copied the site rather than the image location….","date":"2012-06-09","mins":"3:23 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12128","author":"colin_berry","post":"Time perhaps for Mr.Jones and others to give the Pray Codex a decent burial too? Or is “I challenge you to prove me wrong” now the name of the game? If so, it’s a game in which I for one have no wish to join in … There’s still loads more real research that can be done on the Shroud, as I discovered yesterday in discussing HD images with M.Latendresse and having been made aware of his magnificent Shroudscope that had previously evaded any number of my internet searches. The Shroudscope could belatedly do for Shroudology what the magnifying glass did for forensics, helping to distinguish between macroscopic impression and microscopic reality..","date":"2012-06-10","mins":"2:10 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12129","author":"colin_berry","post":"PS: Try right clicking on an image, then click “Image location” rather than “Link Location” and you should then have a specific link to the image that can be pasted elsewhere. It works – I’ve just tested it, e.g. With this one, chosen at random:.","date":"2012-06-10","mins":"2:25 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12131","author":"colin_berry","post":"PPS: another crop of pictures in the same genre, notably from the Eastern Orthodox Church, can be obtained by entering # holy myrrhbearers # into one’s image search. They invariably show the three Marys, an angel, a sarcophagus with discarded shroud. Sometimes the lid is shown, sometimes not, but when shown it usually has some kind of pattern to suggest it’s a piece of monumental masonry, even in simple line drawings. Example: http://stnina.org/sites/stnina.org/files/images/icon myhrrbearers htm.img assist custom 300×392.jpg Ring any bells?.","date":"2012-06-10","mins":"4:10 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12141","author":"colin_berry","post":"People see what they want to see. It’s a given of human nature. That’s why science had to be invented – but scientists too can have bad days when they see only what they want to see… That’s why scientists can appear arrogant when scrutinising the ideas or reasoning of other scientists – or in dismissing over assertive and/or dogmatic non scientists for that matter. Scrutineer scientists also come in for scrutiny – so it’s not a one way street… Being accused of arrogance comes with the territory if/when one is a scientist… A scientist who has never been accused of arrogance is probably too retiring for his own good. Science is a never ending contest between rival ideas. What matters is taking the right road, and arriving at the correct answer. Politeness is OK, provided it does not give licence to the obscurantists or obsessional agenda pushers to hold up or derail progress… I think I’ve said all I want or need to say on the Pray Codex. As far as I’m concerned, that collection of derivative, artistically third rate medieval cartoons is a total diversion from the real business of establishing HOW and WHERE the Shroud came into existence..","date":"2012-06-10","mins":"9:23 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12147","author":"colin_berry","post":"Ron: the restriction of the sample area for carbon dating to one corner was unfortunate – but would you really want to see the Shroud disfigured by multiple sampling sites? I have for some months have been mulling over the claims that the sample came from an unrepresentative corner that had been “invisibly repaired” through devilishly clever techniques, including end to end splicing of individual fibres. My considered opinion re those claims – from the late Ray Rogers in particular – someone whose many ideas but minimalist experimental verification I find increasingly difficult to accept at face value – can be expressed in a single word: poppycock. Correction two words: utter poppycock..","date":"2012-06-10","mins":"10:50 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12160","author":"colin_berry","post":"None another than Ian Wilson has claimed the “credit” for that, Ly Fe, having been inspired he says by a reproduction of the Pray Codex that he came across in Ilona Bercovits’ “Illuminated Manuscripts in Hungary”(1969). You have to hand it to the man – he knows his readers – and their thirsting for any bold new interpretation that just happens to gel neatly with preconceptions… Link to Ian Wilson.","date":"2012-06-10","mins":"5:14 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12170","author":"colin_berry","post":"Platform? Slab? Since when have platforms or slabs been so highly ornate? It’s a sarcophagus, needless to say, a standard feature of medieval depictions of the entombment, some of which show the lid, some (like this stained glass window) do not. If you were working in the medium of stained glass, would you bother to include the lid? If so, how, where, at what angle, and at what risk of cluttering up the scene, or getting the perspective wrong etc etc.? So much easier to leave it out, and assume that most folk will recognize a sarcophagus when they see one, and a scene in which Christ is being reverentially lowered into it. Yup, I know that a sarcophagus does not feature in the Gospel account, but that’s not the point. It DOES feature in most medieval depictions of the Entombment, with enough instances of a separate lid in the picture to remove any confusion between a burial chamber and a bare slab. One cannot hope to interpret anything in isolation – whether it be a natural history specimen or an artefact like a work of art, governed by convention or fashion. It has to be looked at in its relevant context.Just because it might look like a slab in one picture does not make it a slab, especially when it leaves an enshrouded corpse exposed to view, bulked up with 100lbs of myrrh and aloes..","date":"2012-06-11","mins":"1:29 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12161","author":"colin_berry","post":"PS: though I see Wilson says that he himself failed to spot those famous ‘poker holes’ (yeah, right) – which he says were pointed out to him by textile conservationist Mechthild Flury Lemberg.","date":"2012-06-10","mins":"5:26 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12172","author":"colin_berry","post":"Well, it’s a lot to do with our western meeja and book publishers, innit? They will always prefer a ‘man bites dog’ story to that of a ‘dog bites man’. Either that or report something of mind numbing boredom providing it comes from an exotic foreign sounding name. Example: yesterday’s article in our UK Daily Wail, sorry Mail, with “eminent church historian Antonio Lombatti” expounding a set of somewhat pedestrian ideas on the provenance of the Shrouds that tell one essentially zilch. (Yes, you read that correctly – “Shrouds”. ) http://www.dailymail.co.uk/news/article 2157217/The Turin Shroud fake Eminent historian claims 40 similar cloths originated 1 300 years AFTER crucifixion.html.","date":"2012-06-11","mins":"2:50 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12181","author":"colin_berry","post":"I seem to recall saying that there was no obligation on me to “explain” every stroke of the pen or brush that an artist applies to a picture, especially when it’s an unknown third rate cartoonist like the Pray illustrator. As I say, the Codex is an irrelevance, and a rather silly and time wasting one at that. You do know, I take it, that the Shroud Codex connection was made by Ian Wilson and a textile restorer, and is no more or less valid than any connection (read ‘hunch’ that helps sell books) that you or I might make. I am busy right now with some Shroud Scope close ups. T Now they offer REAL insights into the Shroud and how it was (or was not) produced. Did you know, for example, that there is no obvious evidence for a wound under the “bloodstain” on the wrist? I make no apology Matt for “countering other arguments” or even “spending plenty of time here”. You seem to forget that I run my own websites, some (not all) devoted entirely to the Shroud. In fact I discovered just this morning that huge chunks of my views have been quoted verbatim on a religion discussion board, see link below, so somebody appreciates my time and efforts, even if you don’t. Http://www.imdb.com/board/bd0000108/thread/200070993?p=20&d=200287514#200287514.","date":"2012-06-11","mins":"4:58 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12192","author":"colin_berry","post":"I hope I’m not expected to respond to the most recent comments from Max and Ron – since I have no intention of doing so. I for one have desire to get further involved in their subjective ideas on symbolism between two arbitrarily chosen artefacts, or with the pros and cons of the radiocarbon sampling that have been endlessly debated previously. I’m more inclined to the Star Trek school of science (“real science” in my book) – going boldly where no man etc etc…..","date":"2012-06-11","mins":"5:55 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12259","author":"colin_berry","post":"“Colin why do you shirk my point about the radiocarbon dating?” Because your point was not directly relevant to the post we are discussing. You would not be the first person to attempt to divert or derail discussion by changing the subject, retreating to what you consider more secure positions. If Dan were to post on the subject of the radiocarbon dating, then you would find I have quite a lot to say, most of it at the expense of those who would have us believe that all those assembled scientists and others mistook a repair patch for the real thing. But now I too am straying off the point. The post is about whether the Pray Codex has anything useful to say about the authenticity or otherwise of the Shroud. I have made my views crystal clear on that subject, pointing out that most if not all Pray enthusiasts have mistaken a sarcophagus lid for the Shroud itself. One does not need to be an art historian to know that those lids appear frequently in Entombment pictures from the medieval era. Uncritically interpreting a lid as a Shroud, probably because an “artist” of his era omitted to give it 3 D thickness, does not say a great deal for the mental acumen of some here who would have us believe they are experts on everything medieval. As for questioning my honesty and charging me with “twisting the evidence”, you have just extracted your last comment from me Ron (under considerable duress). I am not a glutton for punishment: so any further comments you address to me here or elsewhere will henceforth be ignored unless or until you see fit to reconsider your words and provide me with an apology. Colin Berry M Sc Ph D (retired scientist, currently owner of 4 blogs on science related issues)..","date":"2012-06-12","mins":"7:59 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12193","author":"colin_berry","post":"Typo: “… no desire etc… Apols..","date":"2012-06-11","mins":"5:57 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12231","author":"colin_berry","post":"Max Patrick Hamon : To Colin Berry the Mummy cooker/toaster: Don’t be jealous. Mentioning YOUR (ONLY DERISIVE) GENIUS, I do enjoy it. ; ).","date":"2012-06-11","mins":"2:54 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12228","author":"colin_berry","post":"Have you seen Dan’s current post, Max (“Abe Lincoln assassinated”) ? I bet you didn’t know I have spent the last 12 years and 5 months doing a cryptosymbological analysis of the scene of the crime, Max, i.e.the exact original site of Abe Lincoln’s assassination at Ford’s Theatre Washington DC. Using some state of the art digital re processing techniques, together with slow, medium paced and breathtakingly fast Fourier transforms on Google Earth images, I have been able to show the presence of at least two now considerably eroded grassy knolls in the immediate neighbourhood of the theatre. But a word of caution: they are easily mistaken by the non cognoscenti for the sites of a supermarket and gas filling station respectively. Don’t you think it amazing that there is an exact match between 4 pollen grains on the murder weapon, forming a distinctive, nay iconic L shape, and the uniquely hard wearing ryegrasses on those knolls, designed to resistant trampling by small children, lunch time sunbathers, lovers and assassins alike? This is simply too much of coincidence, don’t you think, to be anything other than absolute unchallengeable proof that Booth was attempting to anticipate Lee Harvey Oswald by an exact century (with rounding error)? How much longer must I wait for MY genius to be recognized on this site, secondary to yours of course (the latter being self evident with every comment you post ; ) ?.","date":"2012-06-11","mins":"1:53 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11856","author":"colin_berry","post":"The text that accompanies my close up fails to appear on that link Ron. Never mind. What should be clear to all is that while there are indeed 5 holes among the red crosses, they are NOT in an L shaped pattern. They instead form an approximate rectangle with a tail, so are totally IRRELEVANT where “L shaped” poker holes are concerned. I also think you display a total lack of objectivity in imagining that a region of the manuscript covered with red crosses represents part of a Shroud that is elsewhere said to show a herring bone weave, and you do not earn kudos by telling others to get glasses to see things that ARE NOT THERE. You are no scientist, Ron, and I suspect you never will be, based on present performance. Maybe if you were a scientist, you would begin to understand the irritation that I and my scientifically qualified compatriots feel about non scientifically qualified documentary makers who try to tell us how to do our jobs, who hijack scientific congresses in an attempt to extricate so called consensus views, who use their privileged access to the Shroud to adorn their blog with an HD close up that had hitherto been kept hidden from bona fide researchers like myself, with possibly more still to come, and who, last but not least, blocks access to the comments on his site to anyone whom he perceives as off message – his message. Oh, and to deploy the term “heliorectal syndrome” is not the same as crudely labelling with the A word, not if you know your Greek and Latin. It is a reference to sunshine, and a subtle indication whence it can originate in some people who have too high an opinion of themselves – like prescriptionist documentary makers who attempt to elicit scientific sound bites that chime with their own opinions instead of reporting objectively on what real scientists are actually thinking and doing….","date":"2012-06-03","mins":"5:06 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11850","author":"colin_berry","post":"How much sillier can this Codex thing get? I’ve left you a short message on my own site, Ron.","date":"2012-06-03","mins":"1:19 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11861","author":"colin_berry","post":"“Those holes have absolutely no artistic value whatsoever…” Of course they do not, Yannick, and for one very simple reason. The scenes depicted were not the work of an artist, but of a Codex (“book”) illustrator – with a severe restriction on parchment space. The little circles can be seen on all four illustrations, in one instance on the halo – so WERE intended purely as a decorative feature and a rather amateurish one at that. The probability that 4 holes drawn at random will form an L pattern is higher than for any other letter of the alphabet as I have previously pointed out. The probability that the illustrator of the Pray manuscript, probably a monk, had seen the Shroud, and had decided to incorporate latterly acquired poker holes for “authenticity” is essentially zilch…Had that been his intention, he would not have been so liberal with those little circles elsewhere in the other 3 diagrams. (Not surprisingly, those other three rarely get a ,mention, given they are largely useless as anti sceptic artillery – e.g. Like the one (Picture IV,post Resurrection) showing a nail wound in the palm that would have been in the wrist if the illustrator had really been determined to incorporate Shroud detail for “authenticity”. For real copper bottomed authenticity, he could have produced a Picture V, showing a vacated Shroud with an imprint of both frontal and dorsal sides of a scourged and bloodied man, but did not do so. Why not? Because he had never laid eyes on the Shroud, and was producing illustrations that fitted with Biblical accounts, and ones moreover that did not puzzle or shock the reader of that Codex, with hands protecting modesty (rendering all the concern about “nudity” somewhat pointless and irrelevant). So modern man, Homo interneticus especially, is left focusing on those tiny decorative circles, reading into them things that would probably have had that illustrator looking blankly with incomprehension. Or causing him to ROFL… I shall now take a long holiday from this site. Life’s too short to waste on endless wrangles about minutiae that in all probability have no bearing whatsoever on the provenance of the Shroud. The best thing that could and should happen right now would be for David Rolfe to place all those squirrelled away HD images of his into the public domain … like tomorrow, not next week or next year….","date":"2012-06-03","mins":"6:07 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11864","author":"colin_berry","post":"“CB Letters L, V, W, M etc: This has to best tongue in cheek spoof on pseudo science that Colin’s ever managed to come up with. An undergrad in stat math could drive a bull dozer through it!” Seeing as how you know so much about what an “undergrad in stat math” would do to my reasoning, then why not attempt a critique yourself, daveb? Or is probability theory and statistics (which I taught for some years) not your forte? Casual sniping is so much easier than well informed comment, n’est ce pas?.","date":"2012-06-03","mins":"6:34 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11880","author":"colin_berry","post":"Onan the Barbarian : There’s no apparent reason why the artist would be trying to build any letter of the alphabet with those circles. That’s why your argument that L is more probable than other letters is flawed. If you’ve ever played Tetris you’ll know that there are exactly seven ways to place four circles on adjacent points of a grid, which become five if you consider mirroring patterns as identical. So if you ask, if the artist was placing circles at random, what is the probability that he would build an L shaped pattern, I’d answer: 1/5. Not so low that it couldn’t happen by chance, but not insignificant either. Also, you claim that the same L shaped pattern is represented on other illustrations of the Pray Codex. If the artist was just drawing circles at random, chances are he’d have used different patterns. If instead he always consistently used the same pattern, that must mean it had some significance. You have totally misunderstood and misrepresented what I said (I certainly did not say that ‘the same L shaped pattern was elsewhere’ – quite the contrary in fact. I simply said there was an abundance of those little circles elsewhere, disputing one erroneous statement that 5 points made an L pattern on the lower panel with the red crosses). I’m clearly wasting my time on this site, given the sniping and failure to comprehend plain English. I may do my own posting on the Pray Codex at some point in the future – but it’s not high on my list of priorities. This entire Pray shebang is frankly a piece of non scientific trivia from start to finish..","date":"2012-06-04","mins":"4:30 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11869","author":"colin_berry","post":"I am serious Dave – very serious. That’s why I use my real name. You on the other hand use a pseudonym which allows you to take potshots at me and others with impunity If you are so well educated and experienced as you claim to be, then you would know that recognizing letters of the alphabet in an array of points that one has to mentally join up is not amenable to textbook analysis, and has to be approached empirically from first principles, analysing the characteristics of each letter one at a time, since there is no logic or pattern in the 26 letters. That is precisely what I did – I organised the alphabet into sets, according to the minimum number of points needed to define each letter, arriving at the conclusion that L was the most probable letter that would be “seen” in an array of 4 points. This is not maths, or statistics or even probability theory – just a systematic approach applying common sense. A lot of science is just that – which is why this Ph D scientist despairs when he sees folk – those parading their science degree included – over analysing the Pray Codex, seeing things that are not there. Research, any kind of research, scientific or otherwise, requires the ability to suss out new previously undetected patterns and relationships, while remaining strictly objective about one’s own and other’s ideas. You daveb are demonstrating no research skills right now. You are simply sniping at my ideas while displaying intellectual laziness, unwilling or more probably unable to specify the flaw in my detailed step by step reasoning. All you do is demonstrate that of the two of us, it is I who is the bona fide researcher, prepared to set out his stall – and you a mere internet sniper possibly with feelings of insecurity and inadequacy, but safe to snipe behind a protective pseudonym. I am presently developing new theories on Stonehenge and Silbury Hill. I shall now devote myself entirely to that project.There is nothing happening here that need detain me a moment longer. Colin Berry aka sciencebod PS: Kindly put those HD images – all of them – into the public domain, David Rolfe. Do so soon please. I for one am running out of patience with someone who attempts to orchestrate the science while in fact hindering further progress with a selfish and squirrel like propensity to hoard a valuable and much needed.resource..","date":"2012-06-04","mins":"1:52 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11971","author":"colin_berry","post":"I’m flattered that you should think my opinion matters regarding your having seen symbolic significance in particular details. My opinion is probably no better (and hopefully no worse) than anyone else’s. That leaves the way clear for you to make whatever interpretations you wish – but without the illustrator on hand to interrogate posthumously, those interpretations of yours fall outside the bounds of scientific enquiry. They might fall within the bounds of art history enquiry though – where I freely admit to having no knowledge or expertise – but only if you can show there are/were innumerable precedents for crosses etc being used in the way you propose). I’m still debating in my mind how best to respond (diplomatically) to Stephen Jones on his own blog, who has just responded to me by saying: “But it is the Shroud depicted symbolically as a medieval tomb lid. Just another example of the artist’s “artistic license” needed to fit all the information he wanted to convey in a small 235 x 150 mm space”… Wonderful thing, those magic putty hypotheses, ones that can be infinitely moulded or remoulded to accommodate any and all objections…. Still, I suppose one should be grateful that Jones does at least recognise that the panel with the zig zag pattern and tiny circles IS the lid of a medieval tomb, and that any link with the Shroud is purely and simply perceived symbolism on the part of the illustrator (or more likely the beholder)..","date":"2012-06-06","mins":"12:13 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11905","author":"colin_berry","post":"“You just can’t be that rational with a piece of art that holds as much symbolic representation as literal representation,” That is where you and so many others are totally mistaken. We are not discussing “pieces of art”. The four scenes were merely line drawings (and rather crudely executed ones at that) to illustrate text in a Codex (“book”). There are simply no a priori grounds whatsoever for thinking that an illustrator, confined to small pages, probably quarto size, as distinct from a spacious canvas, would have attempted any kind of symbolic representation. If the commissioners of the Codex had wanted to make a link with the Shroud – assuming the latter to have been contemporaneous – they could have said so in writing, instead of relying on readers to spot one particular L shaped set of just 4 holes lost in a jumble of zig zag patterns. Get real….","date":"2012-06-04","mins":"2:11 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11965","author":"colin_berry","post":"Try googling the image files for # entombent Christ #. An open casket, coffin or sarcophagus (call it what you want) features prominently. Some even show the lid (though I could understand an artist feeling that the latter was not obligatory and risked cluttering up the picture). We can all speculate till the cows come home on possible symbolic meanings for red crosses (I’ve seen “bloodstains” suggested) but in all probability the artist merely wanted a pattern that distinguished the lid of the burial receptacle from its vacated interior while carrying a visual cue for prior Crucifixion… A zig zag pattern (“herring bone weave”) and four tiny circles (“L shaped poker holes”) are simply not sufficient grounds for rejecting the most likely interpretation – a sarcophagus lid – and substituting something radically different. In the absence of greater effort on the part of an illustrator to convey that he intended us to see a Shroud, why buy into other tendentious suggestions? The illustrator could have shown two L patterns back to back instead instead of just one, or blood stains, or a much longer shroud, or dare one say a twin image – frontal and dorsal. It is entirely wrong in my opinion that pure conjecture – and almost certain misidentifcation – should be constantly promoted as though it were sound scholarship. It’s not – it’s no more scholarship than those anecdotal UFO sightings – most of them coming from Ufologists….","date":"2012-06-05","mins":"6:16 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11983","author":"colin_berry","post":"Your guess re the red streaks is as good as mine, Matt, probably better. Yes, I am indeed aware of the limitations of science, which is why I generally decline to comment on isolated features unless or until I can make a connection with something else that helps back up any conclusions. Those 4 pictures are replete with all kinds of puzzling or bizarre detail, some of which may be deeply symbolic, or merely decorative or imaginative elements. But as I have said before, there is a startling lack of internal consistency. So while you may be correct in interpreting the two red streaks as blood, you then have to explain why there is not a single trace of blood shown in the figure above in which Christ, recently crucified but almost entirely pristine, is being anointed – not even nail wounds which appear later in Picture IV of the series. Why be so coy in one picture and not another? There is no rhyme or reason, and I for one am not desperate to get inside the mind of a medieval monk of limited artistic ability under the eagle eyed watch of a Father Superior, the latter with a censor’s blue pencil concealed in his habit no doubt… If you really were to paint yourself into a corner on this one, Matt, there is a possible escape route. You could say that the two pictures comprising the tomb scene represented an upstairs and downstairs so to speak, and that while the “artist” did not want blood sullying the upstairs picture, he exercised a little artistic license in allowing some to drip down onto the ambiguous tomb lid cum shroud (that description being a belated Stephen Jones master stroke of fancy footwork that had to be coaxed out of him) responding to an artist’s gravitational force field. Oops, that’s the scientist in me starting to assert itself. I must leave you now to do your own artistic interpretation without further input from me that some uncharitable souls (of which there are a number on this site) might consider dubious or even subversive… Subversive? Moi?.","date":"2012-06-06","mins":"4:47 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11986","author":"colin_berry","post":"Postscript: one has only to google # pray codex “lid” # (making sure that the L word is inside quotation marks to narrow the search) and one gets six returns on the first page alone that pointedly state that it is a tomb LID, not the Shroud as some would have us believe. So why are certain “old hands” of Shroudology still posting detailed analyses of the Shroud, “as seen in the Pray Codex,” with its alleged “herring bone weave” or “L shaped poker holes” making no mention whatsoever of the alternative interpretation that it is simply a patterned lid, a fairly obvious conclusion that even this ageing science bod was able to figure out all by himself, and which he now discovers through googling has all the time been the mainstream view? But one could be forgiven for not knowing that from trawling the comments on certain sites with “Shroud” and “Turin” in their titles that shall remain nameless … So why are certain Shroudologists proselytising their partisan interpretation, and disingenuously omitting to mention that their view is totally at odds with mainstream opinion, indeed omitting to mention the L word at all, except for those so called “L shaped poker holes”? Could it be that the Codex is seen as one of the few remaining weapons in their dwindling armoury – a gold plated peashooter in effect – with which to undermine trust in the accuracy or validity of the radiocarbon dating? Yes, I know about the question mark over the representativeness of the sample from the one corner – the one that allegedly was the subject for some painstaking invisible re weaving, needing end to end splicing of individual fibres no less (pull the other one) – but if that is the real objection, valid or otherwise – then let’s discuss that and not muddy the waters with those spurious comparisons with a single Codex of obscure origin that emphatically does NOT show ANY part of the Shroud in CLOSE UP….","date":"2012-06-06","mins":"7:02 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11806","author":"colin_berry","post":"All four of the illustrations in the Pray Codex have those little circles, open or filled, serving a decorative purpose on clothing, or even the halo in the first (Crucifixion) scene. So you have to ask whether any significance can be attached to the groupings of 4 little circles in the tomb scene (largely obscured by the zig zag pattern on the alleged “shroud” that some, but by no means all interpret as a herringbone weave). It’s a simple matter to show that if you place four little circles (“points”) at random on a sheet of parchment or paper, then the most probable pattern where the letters of the alphabet are concerned is an L. Why? Any letter with a curve can straightaway be eliminated – 4 points are simply not sufficient to define a curve in 11 letters of the alphabet, i.e : B,C,D,G,J,O,P,Q R,S,U. That leaves just 15 straight sided letters. But 9 of those ( A, E, F, H, I (with bars to distinguish from the number 1), K,M,W and X need 5 or more points. That leaves just 6 that might be feasible, i.e. L,N,T, V, Y and Z. N and Z are highly improbable – needing four defining points at the corners of a rectangle with its 4 right angles. Y and T are also rather improbable, requiring the lowest point to be precisely positioned relative to the other three (with T especially improbable since the top 3 points need to be in a straight line). That leaves just L and V. But one cannot make a symmetrical V with 4 points (3 as distinct from 4 being needed). That means there is one letter that is uniquely most probable if one places four points at random on paper – the letter L The L shaped arrangement one sees in the Pray tomb illustration above is almost certainly nothing whatsoever to do with the Shroud and L shaped poker holes, and EVERYTHING to do with the simple laws of randomness and probability. There are several other criticisms that could be levelled at the Jones analysis, but I for one shan’t waste any further time in listing them here. Anyone who uses the fourth (post Resurrection) illustration in the Pray series as evidence for a wound in the wrist, when the diagram shows scarcely any palm on that hand, and who shamelessly omits to mention the other more realistically drawn hand showing the wound DEFINITELY centred on the palm, can hardly be considered a serious and objective reporter of the facts, can they? One cannot go selecting facts that support one’s case, ignoring the ones that do not, and still expect to be regarded as a scientist (no matter what degree or diploma qualifications routinely appear after one’s name)..","date":"2012-06-02","mins":"12:28 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11992","author":"colin_berry","post":"I did not say they were authoritative views, Matt. I simply pointed out that 6 returns on page 1 alone made it probable that “lid”, not Shroud, was probably the mainstream view. Google and other search engines are mere filters – I do not need reminding of that, and feel somewhat belittled by your suggestion that I do. But hey ho, that’s web forums for you. Here is a link to the first of the 4 Codex illustrations with further links at the bottom to the other three. Anyone can quickly confirm, if they have not done so already, that those tiny circles are a decorative element in all 4 drawings, and in a variety of situations – angel’s wings. Halos, hems and other edgings on garments, tomb lid, tomb chamber, throne, waist bands etc – enough to preclude any idea that the ones in the tomb scene – a pattern of four on the lid and 5 on the tomb chamber itself, bear any special significance. That’s unless one is actively seeking significance, attempting to mould the observations to suit a model (instead of vice versa) and doing so in a highly selective manner that can be summarised in the term “biased approach”. When bias, especially systematic, i.e. Non accidental bias intrudes, science goes straight out of the window, In fact, you have shown bias in your comment above, Matt, by referring uncritically to “red blood streaks”. They are simply red streaks. To assume they represent blood without compelling grounds for doing so is to betray bias. I personally doubt they represent blood, but shan’t go into reasons right now, You have allowed your prior assumptions to colour your thinking Matt. Prior assumptions are anathema where science is concerned. One must continue to look askance at any and all assumptions. Better still, dispense with assumptions altogether. Switch to using “working hypotheses”, and make those hypotheses work for their living by constantly doing stress tests on them to evaluate their predictive utility. Hypotheses without predictive utility should be dumped ASAP..","date":"2012-06-06","mins":"9:21 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12026","author":"colin_berry","post":"Let’s suppose those zig zag red streaks that match the pattern on the tomb LID were meant to represent blood, Matt? So what? Are you saying that blood, or a representation thereof, is unique to the Shroud? If so, why is the nail wound (red) on at least one of the hands shown centre palm in Picture IV of the series? We could go on like this all day, with you listing each point of weak correspondence between Shroud and Codex, and then challenging me to prove the two are not causally linked. Sorry, but the onus is on you to prove a connection, not on me to prove there is no connection. That remains true no matter how many so called correspondences that you or Stephen assembles. Why? Because your exercise is worthless in statistical terms. In comparing works of “art” with the Shroud, you have a sample size of 1. If you had chosen a sampling frame of say 100 works of art, fitting some arbitrary criterion, and then taken samples within that frame at random, you might find that many showed several correspondences with the Shroud. You could have drawn a distribution curve, that may or may not have had a bell shape, and reported the mean number of correspondences, and the SD about the mean, and then calculated the probability that the number between the Codex and Shroud was, or was not, within the limits of sampling error with p > or < 0.05 as the conventional significance test. Even with this more statistically more rigorous design you would have to convince sceptics that you were being objective in what you scored as a \"correspondence\". Some, myself included, would not allow you to count a red streak as \"blood\" and therefore a \"correspondence\", nor a black cross, and nor importantly a \"herring bone weave pattern\" unless you could prove conclusively that what others see as a tomb lid was definitely a woven burial shroud. I suggest we leave it there, since without the crucial supporting information on what the Pray illustrator did or did not wish to convey, this discussion is leading us nowhere… Have you thought of getting the text translated? Or searching for and comparing with other Hungarian codices of the era? Nope, didn't think so…. What's the Latin, or early Hungarian/Ugrian for \"tunnel vision\"?.","date":"2012-06-07","mins":"2:24 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12050","author":"colin_berry","post":"If I read you correctly, Max, you are saying that the Shroud has a weave pattern with flat top pyramids rather than, or in addition to, the oft stated “herringbone twill” with pointed “Vs”.? Is that really what you are saying? Perhaps you could provide us with a link to back up that remarkable claim (which seems to have evaded the search engines, and is not apparent in two close up images of the Shroud I have hastily consulted, including the samples taken for radiocarbon dating, see links below). It would indeed be a remarkable coup for the authenticists if the Shroud really did have those flat top pyramids, as per Pray Codex, and that they were not simply the product of someone’s fertile imagination…. Link to radiocarbon samples Link to high definition close up.","date":"2012-06-07","mins":"12:31 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11830","author":"colin_berry","post":"Sorry Ron, you’ve lost me. What do you mean by “five hole depiction”? Where is there a five hole depiction on the supposed Shroud, or anywhere else in the Codex for that matter? Oh, and you still have not said why a medieval artist who had seen burn holes in the Shroud would have incorporated them into an illustration of the tomb scene. If the Shroud had been moth eaten from centuries of storage, would he have dutifully incorporated every moth hole as well, merely to signal that he had seen a Shroud that few others knew about (at that time), stored hundreds of miles away? I’m not pushing any theory, btw, but engaged in the scientific process of pouring cold water on others’ tendentious, fanciful, self serving and ill supported theories. Anything to do with alleged correspondence between Shroud and Codex stretches credulity beyond the elastic limit… There is nothing to suggest that someone with limited artistic skills, called upon to provide illustrations to accompany a Codex crammed with early Hungarian text (that few contemporaries would see, far less be able to read) would have gone in for a precious kind of symbolism or Dan Brown like insertion of clues. (” I’m feeling a bit feisty and adventurous today. I’ll mischievously add an L shaped pattern of holes, not because I think they were originally on the Shroud in the tomb, but merely to signal to posterity that this nameless uncredited illustrator, engaged in an otherwise thankless task, has on his travels laid eyes on a Shroud, the existence of which the rest of Christendom, for the most part, is still ignorant”) Please Ron (and some others here) – get real… Any resemblance between the Codex and the Shroud is purely coincidental. Compare an orange with an apple and you can see points of correspondence – but that does not mean they came from the same orchard, or even the same country….","date":"2012-06-03","mins":"2:26 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12028","author":"colin_berry","post":"Matt : yawn, I’m leaving it there. Your world view is seriously distorted with a bizarre obsession with scientific extremism. There’s no point in any further debate! “Scientific extremism”? More like statistical precision – or, in your case, Matt – lack thereof ….","date":"2012-06-07","mins":"2:54 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12053","author":"colin_berry","post":"How odd. That one appeared, while the substantive comment that preceded it did not. In fact, this is what showed on my screen when I hit the send button: June 7, 2012 at 12:31 pm | #89 Reply | Quote Your comment is awaiting moderation. If I read you correctly, Max, you are saying that the Shroud has a weave pattern with flat top pyramids rather than, or in addition to, the oft stated “herringbone twill” with pointed “Vs”.? Is that really what you are saying? Perhaps you could provide us with a link to back up that remarkable claim (which seems to have evaded the search engines, and is not apparent in two close up images of the Shroud I have hastily consulted, including the samples taken for radiocarbon dating, see links below). It would indeed be a remarkable coup for the authenticists if the Shroud really did have those flat top pyramids, as per Pray Codex, and that they were not simply the product of someone’s fertile imagination…. Link to radiocarbon samples Link to high definition close up.","date":"2012-06-07","mins":"12:42 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12065","author":"colin_berry","post":"Is there any chance, Max, you could email them to me separately? scien*ebod2011@dbmail.com (replace the asterisk with the letter c, let’s not make life too easy for the spammers) Thanks.","date":"2012-06-07","mins":"1:48 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12051","author":"colin_berry","post":"PS: Seeing as how I’m back to having my comments vetted, I shall now take another long holiday from this site – so any response that Max might make to my question will neither be responded to or even acknowledged..","date":"2012-06-07","mins":"12:38 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12073","author":"colin_berry","post":"Max Patrick Hamon : At macroscale, the front side Turin Shroud weave does appear as a “square topped step pyramid twill”. Sorry to repeat myself, but could you please provide a link to support that statement (which I for one have never previously encountered in the literature, and suspect that you have neither)..","date":"2012-06-07","mins":"4:09 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12392","author":"colin_berry","post":"There’s a simple answer to the reader’s comment, Dan. What folk have been interpreting as the biblical ‘face cloth’ spread out and completely covering a sarcophagus lid (they had to be helped with correctly identifying the latter) is nothing of the sort. It is in fact the Shroud spread over (but not completely covering) the sarcophagus lid. It is the lid that has the little decorative circles aka ” L shaped holes”‘ (sheer coincidence re the Shroud). One of the distinctive, some might say symbolic features of the REAL shroud (small s) in the Codex are the two wavy lines at the end of the shroud, probably representing bloodstains as others have suggested. Here’s an enlarged piccy from my own blog posted just a few minutes ago that shows the Shroud on the sarcophagus lid, with everything but the Shroud blanked out. I have always believed the Pray Codex to be a complete diversion and irrelevance where the Shroud of Turin is concerned. It was through being brusquely challenged yesterday to explain the two wavy red lines, together with totally uncalled for slurs on my integrity and character, that made me give up precious minutes of my life to take a second long hard look at that not terribly well executed miniature in an otherwise obscure monastic manuscript. There are no poker holes on the Shroud as depicted in the Pray Codex, but there are little decorative circles on the sarcophagus lid, and the latter does have a pattern that could be mistaken for a herringbone weave, given the eye of faith…..","date":"2012-06-13","mins":"10:32 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12778","author":"colin_berry","post":"OK Matt, I’ll let you have the last word. You know my view on the Codex – i.e. That seeing it as a Dan Brown style teaser is wishful thinking on the part of you Shroudie Spotters and a tedious distraction from more important issues – like how was the image created, regardless of whether that happened in the 1st or 12th century AD. My beef is with pseudo science being used to counter or attack real science. I’d be blogging on the Shroud, as I do on Stonehenge, if it had no Christian content whatsoever. Maybe someone needs to tell that evangelist pal of yours on the other site – especially as he flaunts his B Sc degree and Dip Ed while being free and easy with his demonising labels….","date":"2012-06-20","mins":"9:13 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12406","author":"colin_berry","post":"My version offers an explanation for the two wavy red lines (blood) and for the small black crosses (merely a decorative feature to distinguish between shroud and sarcophagus lid). I suspect that most folk looking at my picture with the non essential detail blanked out will accept my interpretation. Why? Because it offers a common sense explanation for why the image is the way it is, given that the artist was having to cram a lot of detail into a very small area..The empty Shroud is shown partially covering the sarcophagus lid, but the decorative circles (wrongly identified as “poker holes”) and the zigzag pattern were on the lid alone, not the Shroud. End of story. RIP Pray Codex (it’s had its moment of fame, and should now be allowed to slip back into the same formulaic, derivative art obscurity from which it originated)..","date":"2012-06-13","mins":"12:51 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12798","author":"colin_berry","post":"Snap.","date":"2012-06-20","mins":"2:14 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12795","author":"colin_berry","post":"For my part menedemus, I was challenged by someone, Matt I think, to explain the red zig zag marks on the Codex. He or whoever considered that they represented blood on what he interpreted as the Shroud, except that the latter was what I and others thought was the lid of a sarcophagus propped up at an angle to reveal an empty chamber.. Rightly or wrongly, I refused to be drawn on those red zig zags,, at least initially, saying there was no onus on me to account for every detail in the Codex. But when I came to take a close look at the red zig zags, I noticed they were wavy in profile. What’s more, they matched a similar wavy profile, i.e. With rounded crests, on the adjacent black pattern. But elsewhere the black pattern was strictly stepped, with sharp right angles, That’s when I (for one) thought that the combination of wavy red lines and adjacent wavy black lines was separate from the stepped black elsewhere, with strict right angles, and perhaps represented the furled wavy end of the Shroud. Yup, the wavy black was the end of the Shroud, extending from that complicated heap of linen, and PERHAPS, just perhaps, the red wavy line represented a fringe of blood on the end of the Shroud. For my trouble, I have been accused of conceding, nay caving in. On the claim that the red represents blood. I merely said that the red MIGHT represent blood, as part of a new interpretation, showing the Shroud as draped over a substantial length of sarcophagus lid, making it longer than a mere head cloth/napkin. That’s the thanks one gets for partially (at any rate) concurring with others’ views here. But then we all know that for some who inhabit this site, it’s the agenda that matters, not the details… We retired science bods – with no axe to grind – are interested purely in the details. It’s others who push their agendas, and don’t wish to be bothered with inconvenient detail….","date":"2012-06-20","mins":"1:22 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12843","author":"colin_berry","post":"Sorry, Matt, but what you propose is hardly a fair test. John Jackson produced some very passable replica images of the Shroud from bas relief templates that were “negative”, i.e. Light/dark reversed, and even had encoded 3 D information, but he then proceeded to play down that work on what might be described as minor technical flaws (e.g. Flat spots on some of the 3 D imaging that could well have been resolved with more tweaking on the z axis or the smoothing control. One can even produced a luminous ‘ghost like’ negative with partial 3 D off a quick charcoal sketch, or from scorch marks as I have repeatedly shown in a series of postings on my own site. But I don’t press the issue here, knowing that if I do the bar will just be raised higher and higher. I personally would accept a list of strictly scientific criteria, including the tricky, as yet unresolved one re the lack of fluorescence under uv, but aesthetic considerations have no place in that list. (Re the fluorescence: I wish I had a uv lamp, since I strongly suspect that thermal imprinting at low temperatures, sufficient to dehydrate PCW hemicelluloses but not celluloses, may well produce a highly superfiicial sepia image that would be non fluorescent. I challenge the still working scientists to do that experiment, and see if I am not right)..","date":"2012-06-21","mins":"4:44 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12805","author":"colin_berry","post":"“Are you planning to destroy the Turin Shroud once and for all?” Even if science destroyed its credibility as 1st century AD, it would still survive as a monument to human ingenuity….","date":"2012-06-20","mins":"3:04 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12397","author":"colin_berry","post":"Methinks most people in the street would look at you blankly, Yannick, and mumble an excuse for hurrying on their way….","date":"2012-06-13","mins":"11:26 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12495","author":"colin_berry","post":"Matt : I’ve asked 5 people today to trace the outline of the face cloth, and all have come to the same conclusion I did. They clearly see the edge of the cloth as I have, and consider the cloth is transparent, hence why you can see a couple of the crosses through the cloth. Why should cloth be transparent, Matt? Have you looked at any linen recently? And if the cloth were transparent, how come it’s only a few inconsequential crosses that show through? Admit it. There are no compelling biblical grounds for the illustrator needing to include a napkin in his picture, but every reason to show a burial shroud, which is what that heap of discarded cloth represents, with those inexpert black crosses to distinguish between shroud and patterned sarcophagus lid..","date":"2012-06-15","mins":"3:27 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12427","author":"colin_berry","post":"Good day to you Matt. Here’s a quick (and partial reply) since I have things to do. While you do not make it clear precisely where you think your face cloth ends and the sarcophagus starts, I think you have a problem with those black crosses. Three of them are shown to the right of where I suspect your “clearly defined thicker edge” is located. My long stretch of shroud accommodates ALL the black crosses, and has none anywhere except the burial shroud. Who says there is blood on the sarcophagus lid? I certainly don’t. My interpretation is that it is just peeping through on the wavy end of the shroud having tracked down the inside surface that is out of view – the illustrator having added it there as a sort of nuanced gesture (“gentle hint”) not wishing to turn stomachs. I look forward to hearing your son’s opinion. IQ of 150? Has he decided what HIS doctoral dissertation is to be on yet?.","date":"2012-06-14","mins":"3:43 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12515","author":"colin_berry","post":"Matt: I have stated my opinion, based not just on pictures 3 A and 3 B, in the Pray Codex, but all 4 of them (noting previously details like the mid palm nail wound in Picture 4 that do not square with the illustrator having had sight of the Shroud). I could also point out the total absence of blood or wounds of any sort in Picture 3 A, which again is hardly consistent with an illustrator wanting to send coded messages. I also realized that the “sheet” with the zig zag pattern was in fact a lid (from which the “artist” had somewhat inconsiderately omitted to show the third dimension, i.e. Thickness). That happened as a result of looking at more artistic renderings of the Entombment scene in medieval art generally, many of which show the lid separate from the sarcophagus, as per Codex, sometimes propped up at an angle, as per Codex. So let me say this. My position is not “entrenched” as you put it, even if yours is. In fact I have been careful to insert the word “preliminary” into the title of my one and so far only posting on the Pray Codex. If you or someone else can come up with more persuasive evidence that the illustrator was trying to incorporate details specific to the Shroud, and which don’t have more mundane explanations, like decorative features that you and others fancifully interpret as poker holes or herringbone weave, then you will find me more than ready to reconsider and even recant. (It doesn’t bother me unduly whether the Shroud of Turin is exactly the age range suggested by radiocarbon dating. It could be 500 years older, and I would still be intrigued to know how it was produced). I still maintain that the answer to the provenance and ‘symbolism’ of the Shroud is to be found on the Lirey Pilgrim’s badge, aka Lirey Medallion, aka Cluny medal. Seek (with your favourite search engine) and ye shall find. Just look for a particular Word Press blog that is not this one, and which shows thermal imprints off bas relief templates on its banner…..","date":"2012-06-15","mins":"9:27 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12767","author":"colin_berry","post":"It’s not the composite nature of the picture that is the problem, Matt. The problem is ione of getting inside the mind of a Codex illustrator who is confronted with the following three consecutive verses from John: “And he (Peter) stooping down, saw the linen clothes lying; yet went he not in. Then cometh Simon Peter following him, and went into the sepulchre, and seeth the linen clothes lie. And the napkin that was about his head, not lying with the linen clothes, but wrapped together in a place by itself.” Now I make no pretence at being able to read the mind and intentions of that monk or whoever. But if his version of the Bible was similar to my own, King James, 1925, then he might indeed think there was “no compelling reason” to show the napkin. Were he to do so with strict adherence to the text, he’d have to create a separate place for it in his already overcrowded picture – a miniature don’t forget – and that would risk creating a needless distraction from what surely must be the chief item of interest – namely the vacated Shroud. I maintain, as do some others on this board, that the latter, with or without a napkin too, is shown draped on the patterned lid of a sarcophagus. The latter has been wrongly identified with the Shroud, and we all know why (because of the 4 holes that can be seen as “L shaped”). Why would a medieval illustrator invite ridicule by including 4 “burn holes” on a putative Shroud in a tomb scene, inviting the tart comment – “OK, so you have seen the Shroud on your travels, but why choose to flag it up with the one detail that was NOT on any shroud purchased by Joseph of Arimathea.? Some might think that he would have hinted at a double image, or a nail wound on the wrist, or a CLEAR epsilon shaped mark on the forehead – not an indistinct blotch etc etc – anything but those anachronistic “poker holes” easily overlooked among all the patterning (stepped pyramids, not herringbone weave). And if the latter, then two back to back sets of poker holes. He might also have considered placing his 4 little circles on something that was unequivocally the Shroud, not the raised lid of a sarcophagus, propped up at an angle, as it appears in so many other depictions of the Entombment in larger less cluttered, better executed less ambiguous paintings of the era.. He’d also have eschewed overkill with those little circles by using them sparingly, if at all, elsewhere. But who’s to say the little circles were not his way of testing that his quill was properly loaded with ink? Don’t forget – there was no scrap paper in those days, just expensive parchment. But as I say, I cannot read the illustrator’s intentions. Others here, you included, appear to be able to do so. But then I’m just a retired science bod. You are that magnificent denizen of certain internet websites, this one and Stephen E Jones’s included, known as a Shroudie Spotter, with an ability to see the Shroud, even in pictures of St.Alexius healing that young girl … Yup, you mistook the image of the girl at death’s door, before healing, with the Shroud of Turin, and it was a tedious and boring old science bod who had to point out your tunnel vision. But I bet that did not stop you ticking another box in that “I Spy the Shroud in Unlikely Places” book of yours… ; ).","date":"2012-06-20","mins":"7:14 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12628","author":"colin_berry","post":"Good day to you David If you wish to see hot from the presses the latest example of Shroudie tunnel vision, of seeing what you want to see, then spare a minute to have a look at the current post on Stephen E Jones’s site, and look at comment no.9 from Matt (yes, our very own Matt, who uses that site among other things to totally distort or misrepresent what I say here). Here’s what he wrote. Take a look at the St.Alexius fresco, and see if you agree with me that he has overlooked the obvious fact (with so many figures duplicated) that it is a before and after scene, and that what he interprets as the Shroud of Turin is in fact the sick girl at death’s door – shown on the right again as being “on the mend”. Matt’s comment Stephen I got an interesting book on the Christian World in the Middle Ages, I found an image from the 11th century, a fresco from the church of San Clemente, Rome. It depicts scenes from the life of St Alexius, who lived in the fifth century, and interestingly was based in Edessa. In this image, St Alexius is praying over a sick girl, but look at the object by his right side. It looks suspiciously like a representation of the Shroud of Turin, although it is a bit hard to decipher the detail. At the very least, it is Jesus’s full length image on “something”. Thoughts??? Matt June 17, 2012 3:54 PM.","date":"2012-06-17","mins":"5:41 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12510","author":"colin_berry","post":"Certainly I am coming at it from a different perspective than you and others, Matt, but to portray it in the terms you do as a clash between art and science is laughable (and if the truth be told, a wee bit pathetic). The Pray Codex is NOT a work of art, nor was it intended as such. It is a small line illustration in a Codex (i.e. Early book). The “artist” had no real life tableau in front of him – he had to draw what was in his imagination, and it’s clear that perspective was something that he (and probably most of his contemporaries) had still to master. That is why it can take the modern viewer a little time just to discern that it is a medieval style and probably anachronistic sarcophagus with its raised lid that dominates the picture (a fact that seems to have eluded quite a few here too it seems if you go back through earlier posts and comments). That’s why you cannot just stick the Codex under someone’s nose and ask “Tell me what you see”. The answer is likely to be as untutored as the ones we have seen here earlier. You have to present your straw poll sample with rival interpretations, maybe with some background biblical notes, and then ask: “Which is the better interpretation of what you see, viewed within its historical and religious context?”. I too will stop here, rather than repeat what I have already said. I have made my position clear on my own strawshedder blog, and see that it is already listed near the top of page 2 returns of a Google search of # pray codex#. You see, unlike some here, I have to think long and hard before expressing an opinion, knowing that my future credibility as a blogger, to say nothing of search engine rankings, could be undermined by indulging in over hasty or fanciful judgements..","date":"2012-06-15","mins":"6:34 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12399","author":"colin_berry","post":"Correction to my first para, written in haste (when is Word Press going to give us a preview facility?) “There’s a simple answer to the reader’s comment, Dan. What folk have been interpreting as the biblical ‘face cloth’ Shroud of Turin, complete with L shaped poker holes, spread out and completely covering a sarcophagus lid – they had to be helped with correctly identifying the latter is in fact nothing of the sort..","date":"2012-06-13","mins":"11:41 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12635","author":"colin_berry","post":"I’m hugely grateful to you for your Shroud Scope, Mario. But I have to take issue with anyone who spots 4 small circles on a densely patterned sarcophagus lid (“zig zags”) and wants to make a connection with the so called poker holes on the Shroud. It’s not that they can definitely be excluded as a symbolic representation of the poker holes. It’s simply that there is insufficient corroborating evidence or “context” to be certain that those holes are not mere coincidence, or served some other function in the illustrator’s mind that we can only guess it. (Who’s to say that a monk doing the initial line outlines for a miniature with a quill pen and ink did not use little circles to ensure there was enough ink in the quill to start on the next bit without needing a second dip, recalling that scrap paper for testing did not exist at that time?). The kind of evidence that would have impressed this sceptic would have either been a hint of some kind of image on the burial shroud, preferably twin – frontal and rear – or – if using the poker holes (an irrational and anachronistic choice of feature when you think about it, but never mind) – to have shown TWO L shaped distribution of “holes” back to back, like bookends, reflecting the pattern and symmetry on the Shroud of Turin. Btw, there is what looks for all the world like a line of stitching on the dorsal side of your 2002 Durante image, just above waist level. I suspect that it’s an artefact of scanning, based on the fact that the vertical “stitches” appear to be continuous with the weave of the linen, i.e. A kind of kink that puts two sections of weave out of register. Would I be right in thinking that the line of “stitches” is due to some kind of hiccup in the scanning or subsequent splicing of images, and is not ito be mistaken or some kind of major repair work with needle and thread, a botched attempt at “invisible “reweaving”?.","date":"2012-06-17","mins":"11:38 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12639","author":"colin_berry","post":"Hello again Mario I have just put up a quick post so you know what I am referring too. My picture also appears to show a loose thread, but it’s that line of “stitching”(?) that interests me most. Http://shroudofturinwithoutallthehype.wordpress.com/2012/06/17/shroud scope 6 is that transverse stitching across the dorsal view or just an artefact of imaginmg 6 2/.","date":"2012-06-17","mins":"2:17 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12633","author":"colin_berry","post":"Dan : I did not put you back on moderation, Colin. Two links in one comment triggers moderation. As usual, you jump to conclusions in your blog, Colin. Thank you for that information Dan (I trust the reported house move is going well, btw). I wonder how many folk here knew that two or more links triggered moderation – I certainly did not. Anyway, I shall now remove references to “pre moderation” from my posting – but the rest regarding Shroudie tunnel vision, as displayed by Matt on Stephen E Jones’s site, remains. Opportunities to make a telling point cannot be allowed to slip through one’s fingers, especially when it serves as a riposte to appalling site one that persistently attempts to demonise and even to deny the right of reply to sceptics such as myself. Yes, it is you and that propagandist siteof yours I refer to here, Stephen E Jones, one that makes a mockery of that science degree that you are at such pains to flaunt. But you won’t know I am writing this since you have said on more than one occasion that you do not read the comments on Dan’s site (“empty vessels” etc). Link to my own site B (which I reserve for ephemera and the more controversial stuff): http://strawshredder.wordpress.com/2012/06/17/stop press heres the latest example of shroudie tunnel vision/.","date":"2012-06-17","mins":"7:52 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12645","author":"colin_berry","post":"Thanks Mario. I’m inclined to agree (and would not have bothered you with it, but for the fact that I could find nothing about that interruption in the weave pattern elsewhere)..","date":"2012-06-17","mins":"3:31 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12642","author":"colin_berry","post":"PS: I am using Firefox as browser, and MS Office Picture Manager to improve contrast..","date":"2012-06-17","mins":"3:04 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-49090","author":"colin_berry","post":"May we see the ears please? I think I’ve seen that face somewhere else..","date":"2013-10-29","mins":"6:46 am","url":"https://shroudstory.com/2013/10/29/bouguereaus-mary/","cat":"art","title":"Bouguereau’s Mary"},{"id":"comment-141063","author":"colin_berry","post":"Same old, same old… (sneer, sneer, sneer)….","date":"2014-07-29","mins":"10:09 am","url":"https://shroudstory.com/2014/07/29/beyond-luwu-and-lotto/","cat":"art","title":"Beyond LUWU and LOTTO"},{"id":"comment-145053","author":"colin_berry","post":"Let’s hope it can be tweaked to spot and delete Mickey Mouse science at source..","date":"2014-08-20","mins":"5:25 pm","url":"https://shroudstory.com/2014/08/20/face-matching-methods-questioned/","cat":"art","title":"Face Matching Methods Questioned"},{"id":"comment-145022","author":"colin_berry","post":"The special knack of the cartoonist to conjure up an instantly recognizable face with a few strokes of a pencil is highly intriguing. I suspect it taps into something fairly profound as to the manner in which the human visual cortex operates, far behind the eyes, connected only by the optic nerves, like telecommunication cables. It’s known already that we acquire and store visual templates in early life that play an initial filtration and storing role. Francis Crick of DNA double helix fame switched to this aspect of brain function late in his career and wrote a fascinating book on the subject. My view, no doubt fanciful, is that we don’t store images like multi pixel photographs – that would place too great a demand on our neurons and synapses – despite our having billions of them. What we do is scan an image, received through the eye, projected first onto the retina as a real inverted image, then transmitted to the cortex, to become an entirely ‘virtual’ image (human computer code – but non binary!). The latter has then to be quickly captured and stored as a neuronal ‘snapshot’ on the basis of its peculiarities, i.e. Solely those aspects that make it DIFFERENT from our stored archive of standard types. We match to a template, but then store the little bits that don’t fit. The genius of the cartoonist is to focus mainly on those tiny give aways, the ones that make a face instantly recognizable, and then exaggerate them slightly, making an immediate impact on our visual apparatus, thereby hitting all the right notes, if you’ll pardon the musical analogy. It’s perhaps not surprising that computer algorithms for image recognition cannot cope with cartoons. The human brain does not operate on binary code..","date":"2014-08-20","mins":"3:48 pm","url":"https://shroudstory.com/2014/08/20/face-matching-methods-questioned/","cat":"art","title":"Face Matching Methods Questioned"},{"id":"comment-129903","author":"colin_berry","post":"My suggestion (which is all it is) that the image on the TS is that of a Templar (J de Molay or perhaps G. De Charney) is not based on science. It’s based on a close examination of the Lirey Pilgrim’s badge (that vital artefact having incidentally having evoked zero attention and interest on this site prior to 2012). Both the badge, and the later Lier copy of the TS, present a picture of utter simplicity as regards the early TS. When folk challenge one to reproduce the TS in all its detail, which TS are they referring too – the Mark1 TS, as portrayed on the Lirey badge, or the progressively more complex TS we see later, notably with more and more blood embellishments, the latter the only evidence for death by crucifixion, there being no visible wounds as such on the TS basal image. I’ll try and put these ideas together into a post in the coming days, but at present am preoccupied by the terrible turn of events in Iraq, and especially the provocative words and past misdeeds of that mentally unbalanced warmonger Tony Blair. He’s as good as admitted that his real aim was regime change in 2003, something he omitted to tell us at the time in his dodgy dossiers. If only there were such a thing as impeachment procedures in the UK….","date":"2014-06-16","mins":"12:10 am","url":"https://shroudstory.com/2014/06/15/its-art-not-science/","cat":"art","title":"It’s Art, Not Science"},{"id":"comment-129922","author":"colin_berry","post":"It’s a big topic,Thomas, too big to discuss here as a comment. Try googling Lirey badge AND Machy Mould. There’s no shortage of detail on the Badge, e.g. The herringbone weave, but while there’s a lot relating to the De Charny/Vergy heraldry and instruments of torture, there’s remarkably little given to the figure itself, and little or no attempt to depict him as a victim of crucifixion, far less Jesus. One has to ask why. There’s a number of other spy clues that need to be taken into consideration – the peculiar twisted structure (that Ian Wilson was too quick in my view to identify as a “blood belt” from a lance wound), the diamond trellis on the reverse side, and ESPECIALLY the detail on the Machy mould, notably the addition of that small inset face, presumably Jesus, and the word SUAIRE. So while there’s less detail than one might wish regarding the TS man himself, the Badge and Mould together are packed with detail, much of it enigmatic and crying out for meaningful interpretation. I believe the 2 badges (assuming the Mould was employed, as can be reasonably assumed from the traces of lead) were vital aids in the re branding of a Mark 1 Shroud that merely depicted a double image of a naked man, pure and simple, but you’ll have to read my several postings to get the full picture. Suffice it to say that the Mark 1 TS may have been described and promoted initially as a sweat imprint on a burial shroud – a whole body version if you like of the extant Veil of Veronica that was attracting hordes of pilgrims. It may or may not have been a sweat imprint, and may or may not have been 1st century. One thing’s for certain: the chemistry of acid action (real or improvised “sweat”) on linen, probably heat assisted, may not be too dissimilar from that of thermal action e.g. Template scorching) if the end result were to superficial sepia tinted partially dehydrated carbohydrates in both instances. One has to ask not only what the Lirey Badge/Mould are telling us, but also what they are NOT telling us (and why not, given the wealth of peripheral and enigmatic detail)..","date":"2014-06-16","mins":"1:53 am","url":"https://shroudstory.com/2014/06/15/its-art-not-science/","cat":"art","title":"It’s Art, Not Science"},{"id":"comment-49093","author":"colin_berry","post":"I’m glad you picked up on that David. Tolkien’s ‘Lord of the Rings’ has always been recognized as intensely religious, and it did not take long to locate a reference to that point in general, and even to Arwen in particular: From: Faith and Fantasy: Tolkien the Catholic, The Lord of the Rings, and Peter Jackson’s Film Trilogy “J. R. R. Tolkien once described his epic masterpiece The Lord of the Rings as “a fundamentally religious and Catholic work.” Yet nowhere in its pages is there any mention of religion, let alone of the Catholic Church, Christ, or even God. Tolkien’s hobbits have no religious practices or cult; of prayer, sacrifice, or corporate worship there is no sign.” but later: Another religiously significant addition is the elf princess Arwen’s intercessory prayer for “grace” to be given to Frodo. In Fellowship, seeking to save Frodo from the forces of Mordor, Arwen prays, like Moses or St. Paul expressing their willingness to be accursed for the sake of God’s people, that any “grace” given to her should instead pass to Frodo to save his life. Http://www.decentfilms.com/articles/faithandfantasy.","date":"2013-10-29","mins":"7:34 am","url":"https://shroudstory.com/2013/10/29/bouguereaus-mary/","cat":"art","title":"Bouguereau’s Mary"},{"id":"comment-198186","author":"colin_berry","post":"Colin is continuing to do open ended experimentation. He has just stumbled on an entirely unpredicted effect with his new cheiropoietic hand/flour/water model (Stage 1 imprinting), one that is arguably replete with possible implications re image fuzziness. It’s to do with instant adhesion, dare one suggest ‘medieval superglue’. It’s to do with instant fleecing up of linen. Details later..","date":"2015-05-03","mins":"12:22 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-129944","author":"colin_berry","post":"John Klotz: have only had time to skim your long and heartfelt comment. I’ll take another look after attending to an errand. For the moment, I’d simply use the opportunity to suggest that “shroudology” can sometimes require an appreciation of art, sometimes science, and preferably both in harmony (admittedly a counsel of perfection). But why not view it primarily as detective work, requiring a keen eye for clues and fine detail AND the ability to use those often slender leads to construct a reasonable scenario. The latter may or may not convince a court of law (catering for you legal eagles) or be potentially testable (catering for us less assertive science bods)? Seen in those terms almost anyone can function as a shroudologist, provided that their feet remain planted at all times on terra firma..","date":"2014-06-16","mins":"5:06 am","url":"https://shroudstory.com/2014/06/15/its-art-not-science/","cat":"art","title":"It’s Art, Not Science"},{"id":"comment-11795","author":"colin_berry","post":"Brilliant, David. A masterly demolition if I might say of a fatuous comparison – one that would have us believe that an apple is really modelled on an orange ….","date":"2012-06-02","mins":"5:12 am","url":"https://shroudstory.com/2012/05/27/jones-on-the-hungarian-pray-manuscript-codex-as-discussed-in-wikipedia/","cat":"art","title":"Jones on the Hungarian Pray Manuscript Codex as discussed in Wikipedia"},{"id":"comment-145158","author":"colin_berry","post":"Might that be because of the elephant in the room, namely that the TS is a negative image (with scarcely any attention or even interest in shroudology as to reasons why)? In the absence of a Secondo Pia in medieval times or earlier, it’s hard to see how the TS image could have hugely influenced art (except for providing a beard and moustache)? They say the eyes are the window to the soul, but the eyes of the TS image are generally and conveniently agreed to be shut! There are other reasons why a beard and moustache (and longish hair) could have come to be adopted as standard that do not depend on prior sight of the TS. They disguise to some extent the individuality of clean shaven features, making easier the task of representing Jesus in art, and perhaps also as a sop to those who considered any image to be blasphemous. The facial hair serves therefore as a partial cover up..","date":"2014-08-21","mins":"3:38 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145250","author":"colin_berry","post":"There’s now’t “subjective” about declaring negatives to be non photogenic.Negatives do not show the world as we see it. How can light/dark reversal be said to be attractive? Back in the days when we used to put our holiday snaps into the chemists for processing, I can’t ever recall anyone saying “Don’t bother to print out. I’m happy to view the negatives”. Why is there so much indifference to the TS image being a negative, when there is no known physics, other than direct contact imprinting, that can produce an image across air gaps without external hardware (converging lens, camera obscura, photosensitive film etc)? Radiation physics certainly cannot, whatever the agenda driven folk with their high energy uv lasers and/or error riddled theory might say in their press releases or tv documentaries (to say nothing of hit and run missives to this site)..","date":"2014-08-21","mins":"12:39 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145505","author":"colin_berry","post":"“None of them have shown that a contact ONLY mechanism could explain all of the TS image.” That’s because the modelling assumed a corpse (or human volunteer in lab experiments) and a loosely draped cloth. In other words the model assumed authenticity, and is simply trying to account for apparent discrepancies. Thus we have the absurdity of the ‘collapsing cloth’ theory that even Rogers felt obliged to dismiss as unscientific. To be scientific means to be entirely objective, considering all possibly models without preconceptions as to age or provenance. In a medieval scenario, that means viewing the image as produced by contact only, i.e. In accordance with feasible physics and chemistry, and contact moreover, i.e. A source of thermal or chemical energy capable of leaving a contact imprint. But one is then no longer constrained to modelling with a loosely draped cloth. One can consider the problem of imprinting into the valleys and hollows of a 3 D template that would normally be inaccessible to a loosely draped cloth that missed them through bridging extremities. That’s where some methodology I described previously comes into its own, i.e. With manual moulding of linen to 3 D relief, increasing the area that is imprinted. As for contact or contact only, I consider that a semantic irrelevance, believing as I do that there is no known physics that will imprint across air gaps. If you or anyone thinks there is, Thibault, then please specify the nature of the process. Is it convection or radiation? If radiation, is it electromagnetic or not? if electromagnetic, which part of the spectrum? For my part, I regard the TS image as the product of a contact only mechanism, so make no apology whatsoever for occasionally omitting the word “only”. Non contact imaging is frankly pseudo science in my opinion..","date":"2014-08-22","mins":"4:45 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145242","author":"colin_berry","post":"I don’t dispute any of that, David G, but there’s no escaping from the somewhat scary quality of the ‘as is’ TS image, which is the only one that artists of any period would have seen prior to Secondo Pia. Put (shroud of turin) into Google image files, and the vast majority of returns are Secondo Pia type reversals, ones that most folk respond to immediately as ‘the real Jesus’. Then look quickly at the few ‘as is” images on offer, and there’s that off putting dare one say grotesque quality, seemingly with eyes gouged out. So I fail to see how the TS could have produced the appearance we now describe as ‘Christ like’ (gentle Jesus meek and mild, as per hymn). At best, it would have said there’s a beard, moustache and longish hair. Anything else would have been blanked out in the artistic eye and mind. But here’s a thought to conjure with. Suppose it had been artists, maybe under pressure from the early Church, who decided that Jesus had to be shown with facial hair, to avoid revealing too much of a “real” likeness, that being largely, indeed entirely conjectural. But that has knock on effects. When you add a beard and moustache to an initially clean shaven male face, you tend to make it bottom heavy. The facial hair tends to dominate, and not everyone warms to the sight of facial ‘fungus’ anyway.. Artists may then have been tempted to compensate, first by elongating the face and nose, making them thinner, to de emphasize the bulking effect of facial hair, while also omitting ears that might tend to detract from the haunting new sallowness via their Toby Jug like effect. Larger more doleful eyes too would have helped in balancing out the image. What you end up with is an arguably less realistic, more stylized, more arresting iconic face, one that some have described as displaying a ‘gothic’ influence. The evolved image, now ticking all the correct sensibility boxes, religious and artistic, may then have served as a model – first for codex illustrations and oil paintings, then for 3 D crucifixes and life sized bronzes etc.and finally as template for that unattractive 14th century negative imprint that we now call the TS, rather than things being the other way round. As I’ve said before, my money’s on the TS having initially been a Templar created artifact, possibly to represent Jesus, or perhaps ‘Jesus like’ for reasons one can only speculate. It was then skilfully re invented by the knightly De Charny and/or his wife as a Veronica like sweat imprint on the ‘real’ burial shroud, designed to attract pilgrims to their newly founded church. The rest as they say is history (and supporting 20th century science of uneven quality, much of it, dare one say, clearly agenda driven)..","date":"2014-08-21","mins":"11:19 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145507","author":"colin_berry","post":"I’ve already expressed my strong reservations David H re the validity of comparing two images of entirely different character – one a positive painting, the other a negative imprint. Mutual complementation stacks the odds in favour of getting a match. You say you have done separate comparisons using tone reversed images, and still get a match, Sceptical soul that I am, I thought I’d check that out. Here’s a link to a composite image comparing the full house of 4 negatives and positives, tacked on the end of this morning’s posting on my sciencebuzz site. I leave folk here to judge whether the fresco was modelled on the TS (or the TS on the fresco?) based on these static pictures (which were screen grabbed off your video and inverted using Image J)..","date":"2014-08-22","mins":"5:30 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145167","author":"colin_berry","post":"To David Hines: whilst having no wish to rain specifically on your parade, I feel an urge to assert my party pooper credentials yet once again. You are not matching like with like when you do your overlays. The fresco is a positive image, and if you look at it closely, it is the tiny amounts of shade that give the face a little individuality, the rest being essentially featureless white space. Now look at the TS image, or any negative image for that matter, and you will see that the parts of the face that one would normally see in life or positive photographs as that all important shade are not there, having been converted by tone inversion to white space. So is it any surprise that it is easier to achieve “congruence” between a positive and a negative image, each complementing and thus making good the deficiencies of the other, than between two positive or two negative images? Sorry, but the technique is biased in favour of achieving a match (or at any rate, an impression of one, probably spurious) via that mutual complementation effect..","date":"2014-08-21","mins":"4:12 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145572","author":"colin_berry","post":"Don’t misunderstand me, David H. It’s not your artistic or technical skills I question. It’s the entire validity of the exercise in attempting to merge one image with another of entirely different character – positive and negative – where one makes good the gaps in the other through combining (apparent) shade v non shade. What’s more, having slept on the composite image posted earlier, focusing especially on the two positives, I’ve come to the conclusion that the most basic aspect of physiognomy – the overall shape of the face – a reflection of underlying bone structure – is entirely different for TS v fresco image (or rather derivative at second hand fresco). The TS face is iconic in an artistic sense by virtue of its peculiar and distinctive linearity, nay ‘rectangularity’, which some have described as essentially gothic (though I’m largely ignorant re art history). The fresco image is not iconic, except maybe for the depiction of those sad doe like eyes, which while arguably gothic as well (“Man of Sorrows”) is an exercise in artistic licence, inasmuch as the eyes of the man on the TS are either closed (or possibly non imaged). The fresco face is more typically triangular, tapering from a broad forehead down to a narrow chin. Now I’m aware that some consider the linearity of the TS face to be a result of banding in the yarn, due in turn to bleaching differences, with alleged additive effects of image and background colour (that I don’t pretend to understand). But even if that were the case, implying that the TS image is not a true “likeness” and in need of image supplementation – which some have experimented with – one is left with the small embarrassment of a work of art failing to match the iconic one on which you claim it is based, in respect of its most crucial feature, namely that vertical linearity and severe symmetrical cut off at both sides. Nice try David H. Maybe a slim Havana cheroot, but no fat cigar. Not from this sceptic at any rate – one who views the TS as an ingenious medieval artefact (serving only to “remind us of the Passion” as a recent Pope cautiously put it)..","date":"2014-08-23","mins":"1:31 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145187","author":"colin_berry","post":"Google translation: You are wrong! The congruence between the 2 positives are even MORE AWESOME The coincidence of the shadows on both sides of the face (and many others) are really AMAZING. Er, how can you say that, Carlos, given that the TS image is non directional, i.e. Without off centre “illumination”, whereas the fresco image shows shadowing consistent with a source of illumination on the subject’s right? If the TS image is non directional, then so the “positive”, despite tone reversal. And you are still not comparing like with like in attempting to match or merge one positive with another, not when one has directional light, and the other lacks any kind of directionality. It’s chalk and cheese, as we say in English… Adios (for now) mi amigo..","date":"2014-08-21","mins":"5:49 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145968","author":"colin_berry","post":"Thank you David of Costa Rica for the free coaching. In fact I spent some 12 years researching starch and cell wall polymers as part of a UK government funded programme to assess experimentally the alleged health benefits of dietary fibre and resistant starch, so none of what you write is unfamiliar to me. The results of that – largely positive – are in the form of a few concisely written papers on the American Journal of Clinical Nutrition, the Journal of Cereal Science, the Report of the BNF Task Force on Complex Polysaccharides (to which I contributed Chapter 10 entitled “The Glycaemic Index”). I’m not telling you this to win brownie points or to inhibit your enthusiastic writing style, but to flag up the difficulty that is presented when bombarded with information – like where to begin, and where to stop. I was tempted to make the same point earlier on this thread to another commentator – no prizes for guessing who. I don’t pretend for one moment that science has all the answers, but its chief advantage is that it focuses on one thing at a time, and confines itself to addressing those questions that are testable in principle. If others wish to pursue ideas that are difficult to test, e.g. Those involving entirely hypothetical impurity coatings or mysterious radiation that can imprint images on linen across air gaps then fine, but the onus is on them to test their tendentious/contentious ideas, and no obligation exists on others to do the testing for them. Have you ever wondered why Messrs. Fanti, Di Lazzaro, Jackson etc etc are not beavering away as we speak, accumulating and publishing more and more experimental data in support of their corona discharge, laser beam or other radiation models? Go figure, as they say. I maintain now, as I have done since looking briefly at a radiation model in December 2012 (charcoal sensitized thermo stencilling) that contact imprinting, thermal or thermochemical, is the only game in town, not just through being able to accommodate most of the distinctive features of the TS image (negativity, superficiality, lack of external pigment, 3 D properties etc) but to do so utilizing the laws, facts and principles of chemistry, physics and botany. In passing, if you are so convinced of your ideas re the power of the Holy Spirit to intervene directly in folk’s personal lives, then why did that book of yours (“Convinced”) need to run to 245 pages? Could it not have been expressed more concisely, maybe with some divine assistance? http://www.amazon.com/Convinced steps clothed healing Spirit ebook/dp/B0071 BFHXG Do you really believe you have a “hot line” allowing you to act as go between, as the publisher’s (author”s?) blurb would seem to suggest? Thinks: who was it who said ” I won’t insult your intelligence by suggesting you really believe what you just said?.","date":"2014-08-25","mins":"2:41 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145869","author":"colin_berry","post":"Far better that you can’t see something that should be there (like my mischievous cut and paste of Dan’s comment box) Thibault, than claim to see things that aren’t there… (Yes, I did meanfantasie (fantasy), not the more innocuous fantaisie (fancy), thinking of the surreal claims made in your first two pdfs)..","date":"2014-08-24","mins":"4:42 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145995","author":"colin_berry","post":"TH writes: “Everybody agrees that most parts of the body imprints are contact imprints (probably 80% of the frontal image). The true question is: is the TS image a contact ONLY imprint? “ I don’t as yet know how to use Image J to quantify image density (but may try doing so soon). But there is a way of amplifying image density in a manner highly suited to the TS image on Shroud Scope, which is to apply the 3 D tool which simply reads image density as elevation on an imaginary z axis. In other words, it amplifies into a viewer friendly third dimension. This is what you see when you do that: It would seem to me that Thibault’s figure of 80% would apply more to the dorsal than the frontal side. Imprinting of the frontal side is nearly complete, except for a few awkward locations that are easily explicable in a contact model, e.g. In and around crossed hands etc where linen would tend to bridge at the boundaries separating higher and lower planes. It is the dorsal surface where there are major areas that have failed to imprint (not just poorly imprinted note – an important distinction). As I’ve said before, there is a simple way of accounting for the differences between frontal and dorsal imprinting that is not only explicable but largely anticipated in a contact only imprinting model. It arises from a single stage imprinting where a 3 D template is first pressed dorsal side down onto the lower half of the linen, underneath which is a soft yielding underlay, and the top half then turned over to cover the frontal surface, with a soft yielding overlay. The double layer of the latter is then being patted in and around the major contours. The two configurations are LUWU and LOTTO respectively (Linen Underneath With Underlay; Linen On Top Then Overlay). The first of those is more prone to bridging, with incomplete imprinting, whereas the latter gives a superior imprint, thanks to manual moulding of fabric to frontal relief..","date":"2014-08-25","mins":"6:12 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145864","author":"colin_berry","post":"Anyone is free to use images from my blogs. Thibault. No need to seek permission. Here’s another image you should try to incorporate into that pdf (Or maybe Dan Porter can provide you with a ‘letters column’, as suggested previously)..","date":"2014-08-24","mins":"4:16 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-146000","author":"colin_berry","post":"Thanks OK. Do you mind my asking which of Image J’s vast range of tools you used to get that handy ‘heat map’? (My advice to the gent above would be to down a second glass of tipple, hopefully achieving a more symmetrical result)..","date":"2014-08-25","mins":"6:34 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-146050","author":"colin_berry","post":"Here’s that same image in your Thermal LUT mode, OK. The chief point of interest to me is the higher proportion of yellow in the dorsal image. That says the image density is greater for dorsal than frontal image. Has anyone else spotted that before? It would seem to fit neatly with the LUWU v LOTTO model. LUWU imprinting relies on the template being pushed forcibly down into the underlay, with no possibility of precision moulding of cloth to contours. It depends solely on brute pressure with much bridging of fabric and loss of contact, e.g. Backs of thighs and knees. LOTTO on the other hand involves much lighter pressure between fingers and template exerted through two layers of cloth.It permits precision imprinting, with fewer non contact dead zones. Thanks for the tip, OK. Do you have anymore up your sleeve for spotting subtle differences between one image and another?.","date":"2014-08-25","mins":"10:53 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-146003","author":"colin_berry","post":"“Thermal” LUT you say? I find myself warming to the sound of that (but can’t imagine why). Thanks. Just the job..","date":"2014-08-25","mins":"6:47 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-131958","author":"colin_berry","post":"“Thanks Mike the skeptics seem to be conveniently ignoring the red lines presumably they think they are decorative or random – which I think is absurd” Not true, Thomas. You have misjudged at least one sceptic, someone who is not given to “ignoring” evidence. See my posting from 2 years ago: http://strawshredder.wordpress.com/2012/06/13/preliminary opinion on that pray codex that is supposed to show the shroud of turin/.","date":"2014-06-21","mins":"1:19 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-130156","author":"colin_berry","post":"Well said that man. Here’s a comment I placed on my own seditious site early last year that may answer your whodunnit question, Charles, or rather whoseddit. Colinsberry says: March 6, 2013 at 3:12 pm David Rolfe advised me to check out the recent TV documentary he did for the BBC, narrated by Rageh Omaar. It was ostensibly to see John Jackson doing his darnedest to whittle down, sorry up, the age of the Shroud, and making Oxford’s Prof Chris Ramsay feel obliged to check out Jackson’s wacky CO hypothesis (negative results, needless to say, which was entirely predictable from recalling undergraduate physics and chemistry). But in passing, we saw Ms.Mechthild Flury Lemberg, the textile restorer, telling us that some inconspicuous little circles among the “herring bone weave” in one of the 4 Pray Codex illustrations were a “perfect match” for the L shaped poker holes on the Shroud (they weren’t!). Shame it was neither shroud nor fabric of any description hosting those hugely diagnostic pen drawn circles (looking more unmistakeably hole like than any other tiny pen drawn circles I have ever seen previously in my entire life ; ) but, sad to relate, merely the lid of a sarcophagus, which was patterned certainly, though not with a herring bone weave. Towering oaks of mis and dis information from little acorns of mistaken sightings grow..","date":"2014-06-17","mins":"3:07 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-8307","author":"colin_berry","post":"Now that’s what I call an iconic garden … (whatever will they think of next?). Shame one has to be skimming the neighbourhood in a hot air balloon to appreciate it, trying not to dislodge roof tiles in the process (about which I could tell you a story or two ; ).","date":"2012-02-15","mins":"1:37 pm","url":"https://shroudstory.com/2012/02/15/more-on-the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","title":"More on the Shroud of Turin: a pale shadow of its former glory?"},{"id":"comment-129788","author":"colin_berry","post":"“Incorrect, on the badge it’s either the body image or the background weave. Never both at the same time.” Nope. It’s the two in juxtaposition, like a man against a herringbone weave background. That’s because it’s the TS that is being represented, as distinct from a reconstruction of the Biblical narrative. No L shaped poker holes were thought necessary to help the observer make the correct identification (contrary to Ian Wilson’s claimed sighting of poker holes). The double image, crossed hands, HB weave were considered sufficient, as indeed some of us think they were)..","date":"2014-06-15","mins":"12:34 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-129802","author":"colin_berry","post":"To Mike M (12:51pm) First para: sorry, non comprendo. Second para. Nope, am not posing as an art historian, perish the thought, merely an observer of artefacts of questionable artistic skill and value, focusing purely on those details the artisan has chosen to feature, those he hasn’t. (Remember: the mould for the cast lead/tin Lirey badge had first to be scratched onto soft stone – not everyone’s idea of high minded art nouveau) The three independent lines of visual content (double image, crossed hands, HB weave) are all highly individualistic, or would be if unaware of context. They should be sufficient I suspect in most medieval French minds to say “Mais oui, c’est le, ‘ow you say it, “in thing, must see” Shroud of Lirey”? Adding poker holes, an accidental. Latterly acquired, disfiguring, blemish, risked being the 14th century equivalent of inviting unhelpful comment from Relics U Like pilgrimage Trip Advisor..","date":"2014-06-15","mins":"1:35 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-129812","author":"colin_berry","post":"Sorry, Mike M. You’ve still lost me. Forget the HPM. Look at the TS – either Shroud Scope at top magnification, which I have, or, presumably Shroud 2.0 (which I don’t, but for which promotional copies are available on the internet). Of course you can see herringbone weave and image coloration in the same field of view. Why should they be impossible to view simultaneously, given that the image thickness is said to be 200 600nm, which encompasses the range of wavelengths of ordinary visible white light between ultraviolet and near infrared – much smaller than thread or weave dimensions? If resolution is sufficient to see the weave, you can see the image and vice versa. It ain’t rocket science. Why bother to make a distinction between the weave and the superficial image that resides on its surface? Kindly explain what point is being served..","date":"2014-06-15","mins":"2:45 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-129935","author":"colin_berry","post":"To Mike M: apologies – I failed to grasp the point you were making. Yes, the Lirey artist produced a medallion that, on its own, might have been interpreted as bearing the image of a real person laid out on linen. But that’s artistic licence, surely? He simply aimed for greater impact by representing the Shroud’s 2 D image as a bas relief, the casting technique making that technically feasible. It was arguably a way of flagging up to the badge’s owner and later viewers that the TS image was not to be seen as a mere painting, but, correctly or otherwise, as an imprint created and left behind by a real person. Plus ça change….","date":"2014-06-16","mins":"4:22 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-130650","author":"colin_berry","post":"“(icono )steganography takes (icono )cryptography a step farther by hiding an encrypted message/image so that no one suspects it exists.” Trumped: max phiconosteganography takes (icono )steganography yet another step further by hiding an encrypted message/image so well that no one but max ph suspects it exists..","date":"2014-06-18","mins":"5:31 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-206007","author":"colin_berry","post":"Thank you for looking in on my site last night Dan. Sorry I did not recognize you under the new mysterious monicker. Thanks also for this appreciative posting, even if its sentiments and mine are not universally admired in this neck of the woods..","date":"2015-07-17","mins":"4:28 am","url":"https://shroudstory.com/2015/07/16/nicely-summarized-colin/","cat":"art","title":"Nicely Summarized, Colin"},{"id":"comment-11962","author":"colin_berry","post":"Any attempt to relate features on the Shroud with that of the Codex is rendered virtually null and void by the glaring lack of internal consistency where the Codex is concerned. To cite just two examples: we are solemnly informed that the panel with the zig zags is the Shroud (despite showing a discarded shroud deposited on its surface) while the strip like Shroud in the upper picture that is draped around one or more of the figures shows no zig zag pattern (why not – if the Shroud is supposed to be the centrepiece of the picture?) I’ll tell you why not – because the panel with the zig zags and tiny circles is NOT the Shroud. The panel is the patterned lid of a sarcophagus – and to point this out is not to take a topic off track, but to declare it off track in the first place through someone in the past having made a false connection based on some optimistic guesswork, to say nothing of agenda pushing. Then there is the lack of internal consistency regarding the hands. In the tomb scene there are no wounds visible; in the later post Resurrection (Enthronement?) scene both hands show wounds, with one at least showing the wound in the centreof the palm (which did not prevent Stephen Jones claiming the other to be in the wrist – despite that hand being drawn with scarcely no palm worth speaking of). When is this obsession with the Pray Codex going to end? The Codex (“book” in modern parlance) was simply text accompanied by some small and somewhat amateurish line drawings – almost cartoons – in an obscure Hungarian volume that was probably intended only for the eyes of a few clerics and/or pious well to do folk – many of whom were probably able to read and not needing vague and inconsistent symbols in cramped pictures to tell them things that are not in the scriptures – like a burial shroud, referred to briefly in the Gospels merely as “fine linen” or “clean linen cloth” or “linen clothes” that somehow acquired an imprint of its brief occupant with no mention whatsoever of a unconventional up and over configuration… all this to remain a well kept secret for the next thirteen and a half centuries. One couldn’t make it up ….","date":"2012-06-05","mins":"5:42 pm","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-33545","author":"colin_berry","post":"Best to avoid the s word on this site, Carol. It is not considered PC (pyrolytically correct). I sure if you ask nicely, the regulars here will provide you with a list of acceptable alternatives. ; ).","date":"2013-05-12","mins":"4:29 am","url":"https://shroudstory.com/2013/03/01/observations-consistent-with-a-medieval-artist/","cat":"art","title":"Observations Consistent with a Medieval Artist?"},{"id":"comment-11953","author":"colin_berry","post":"“The scene depicted in the Pray Codex correspond exactly with the image on the Shroud”. Exactly, dear Yannick, with nothing materially different (except for there being no blood trails on the forearms, hair or elsewhere, no scourge marks, no swollen cheek, no wrist wound, no obvious moustache and scarcely any beard, no epsilon on forehead – unless one considers a vague blotch to represent some other less distinctive Greek letter … but as you say, exactly the same in all other respects). As I have just informed Stephen Jones (whether he publishes or not it another matter), the mistaken identity between the tomb scene in the Pray Codex and the Turin Shroud must surely qualify as Shroudology’s Greatest Howler Of All Time….","date":"2012-06-05","mins":"4:14 pm","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-11966","author":"colin_berry","post":"Maybe not carlos – though I hardly think that a handful of crudely executed line drawings – almost cartoon like constitutes art. But as a retired scientist, I am well acquainted with the promotion by true believers of tendentious hypotheses founded on little more than wishful thinking and carefully selected data, ones that studiously ignore any and all contradictory evidence. Science finds itself in eternal conflict with the human propensity to make up a good story….","date":"2012-06-05","mins":"6:34 pm","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-11925","author":"colin_berry","post":"Afterthought (to my previous comment re sarcophagi and their lids) : if you put “entombment of Christ” into a search engine, and peruse the image files, you will find numerous instances of a sarcophagus being featured as the receptacle for the body, with or without the removable lid in view. In fact, there is even an example provided on this very post, with Christ being lowered into a sarcophagus, and with a gentleman at the foot end ensconced on a domed lid! I am now more than ever convinced that what we are supposed to assume to represent the “Shroud” in the atrociously drawn Pray Codex – viz the slanting white panel with zig zag pattern (“herring bone weave”) and L shaped arrangement of 4 holes (“poker holes”) – is in fact the raised lid of a recently vacated sarcophagus. But do not despair you Shroud seekers. There is a nominal representation of it shown coiled up on the lid – though I expect to be told that is the face cloth (despite Scripture stating the latter had been left in a corner of the tomb)..","date":"2012-06-05","mins":"1:31 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-12493","author":"colin_berry","post":"I try to stay clear of that upper anointing picture, having no idea as to what is burial shroud as distinct from garments, or where the burial shroud starts or ends, or drapes around whom. All is speculation, given the illustrator fails to provide clues in terms of patterning, colour etc. What is certain is that our minor league illustrator was making no attempt to use the anointing scene with the three men to signal his having previously laid eyes on any iconic Shroud, assuming it were contemporaneous and residing hundreds of miles away, as shown by the absence of “herringbone weave” or “L shaped poker holes”. A degree of caution is needed when interpreting the lower “angel/empty tomb” scene too, where the illustrator’s abilities to depict an abandoned burial shroud on a sarcophagus lid atop any empty sarcophagus are stretched to his technical limits. It’s anyone guess whether there’s a face cloth/napkin sitting in that heap of linen – but given the fairly close adherence to the Biblical account in the scene, i see no compelling reason why he would have felt obliged to show it. The only folk here who desperately want a napkin in the lower scene are those who want us to believe that the lid with the holes and zig zag pattern is THE Shroud, and that any heaps of linen must be the napkin alone. That’s hardly objective analysis and interpretation, is it? – more a case of “seeing what one wants to see” to fit a favoured previously scripted narrative. There are a few scientists, or rather so called scientists, who operate like that too. I have a name for them – but can no longer use it here, since Dan will then put me back on watch..","date":"2012-06-15","mins":"2:42 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-12001","author":"colin_berry","post":"Your picture, circa 1200, is quite interesting David for a number of reasons that may throw some light on the supposedly ground breaking feature of a naked Christ in the Pray Codex. Both take liberties of course with the Biblical account, but this one more so than the Shroud. This one has Christ being anointed with oil in the presence of Joseph, Nicodemus AND the Marys, which of course was not how it was described in John. It was the men only who did the initial treatment with the 100lbs of myrrh and aloes, with no mention of oils, and it was the women who were intending to administer the oils, ointments etc later, but were prevented from doing so by the Sabbath, and on returning to their duties at the earliest opportunity, i.e. The first day of the new week, found the tomb empty. So here we have a composite picture, with the men, the women, the oil, and perhaps not surprisingly a Christ who is not completely naked. But when you look at the Codex, it’s just the men, but still with some artistic licence (oil being applied, but no sign of bulk myrrh and aloes), but with the absence of women from the picture, pre Sabbath, the artist has allowed himself the licence of oil being applied to a completely nude body. Having made that decision to show a nude body, finer sensibilities are preserved by showing hand crossed over the privates. So it’s wrong to count both the nudity and the crossed hands as if representing TWO separate points of correspondence with the Shroud, since one – the position of the hands – is a consequence of the other – the decision to allow the more realistic nudity that might accompany anointing, especially of preceded by washing. Yes, it may well have been the decision to show a strictly male administered anointing, albeit having no scriptural reference, that influenced the decision to show a body with no signs of blood or other mistreatment, leaving the viewer to assume that the body had had a prior wash – in short a more sanitised version of what might otherwise have made for a gut wrenching depiction of the immediate aftermath of crucifixion. Having removed any suggestion of spilt blood from the anointing scene, it would make no sense to have any suggestion or hints of a bloodied Turin Shroud (as we now call it) in the subsequent scene with the empty tomb, with just the angel and ladies in attendance. The panel with the zig zag pattern, the tiny holes, the red streak was NOT therefore an attempt to represent the Shroud, but merely the patterned lid of the tomb… Any idea it was the Shroud is a total red herring, but I’ve no doubt that idea will run and run, thanks to the existence of this and other sites that give free expression to dogmatism and scepticism alike, the former always guaranteed to win more support from those who might be described as iconophilic… that about exhausts all that this sceptical science bod wants to say on the subject of the Pray Codex – as good an example of subject selecting pseudo science if ever there was (Stephen E. Jones B Sc, Grad Dip Ed please note)..","date":"2012-06-06","mins":"11:19 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-145773","author":"colin_berry","post":"Let’s hope there are specifics to discuss in the new pdf. (Yes, let’s discuss specifics: I can hardly be expected to respond meaningfully to the broad brush generalities here). Will the new pdf withdraw the extraordinary claims of its two predecessors, i.e. That any scorch image from a heated template (TH’s bizarre choice of template!) will show excessive contrast, and that it’s impossible to scorch just a few surface fibres in a thread? Maybe pdf has a different meaning in French. Potpourri de fantasie? ; ) Fact 1: if one uses a bas relief template with smooth rounded contours, in place of TH’s peculiar sunken relief with those shallow right angle ledges, there’s no reason why there should be excessive contrast. Fact 2: It’s the easiest thing in the world to show that a contact scorch can affect just a few of the most superficial fibres in a thread. I’m still at a loss to understand how TH was only able to see an ‘all or nothing’ effect under his microscope. I may make a longer comment here later in the day, explaining more fully why I think contact only imprinting is the only realistic option if staying within the realms of conventional physics and chemistry. Anything else is almost certainly likely to be science fiction. PS: I re read one of Giulio Fanti’s pdfs on his “corona discharge’ hypothesis yesterday. There’s a highly questionable assumption made in his chemistry. It’s the one where he suggests that secondary uv radiation is the real effector of carbohydrate coloration. I’ll explain why if anyone is interested. It ain’t rocket science (think pre chemical industry ‘bleaching field’ technique)..","date":"2014-08-24","mins":"1:57 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-139918","author":"colin_berry","post":"What if the Mark1 Shroud had been a scorched on representation of a Templar leader, notably Jacques de Molay, slow roasted to death in 1314 (using a heated metal template or similar modelled on the individual in life)? What if an attempt had been made by the Shroud’s first recorded custodians in a tiny French village (L for Lirey?) to claim it was a sweat imprint of the crucified Jesus, while covering their backs with the production of the Mark 1 Lirey Pilgrim’s badge (with what looks suspiciously like a barbecue grill with trellis pattern on the reverse side)? What if the Lirey custodians then pushed their luck too far in producing a Mark 2 pilgrim’s badge (see Machy mould) to which an inset feature was added, namely a representation of the Veil of Veronica above the word SUAIRE, i.e. A possible attempt to suggest that the Shroud was a life sized post mortem version of the Veil of Veronica, with a heat scorch now cleverly ‘re invented’ as aged body sweat? What if that Mark 2 Lirey badge was the last straw where the local bishop at Troyes was concerned (Ian Wilson having also proposed something along these lines in his splendid BSTS comparison between the Lirey badge and Machy mould), and threatened the Lirey custodians with charges of wilful misrepresentation or worse? What if the Lirey custodians then panicked, and quickly added some L shaped poker holes to the Shroud, maintaining that they had never claimed it to be the burial shroud of the crucified Jesus but that it might have been used to wrap the ‘slow roasted to death’ St.Lawrence, still relatively corpus intactus in Rome, circa AD 258? (thus that L for Lawrence)? Fanciful narrative? Maybe, but mine does not lack for some supporting detail(s) that might be described as otherwise enigmatic and unexplained (can the proponents of alternative “what if” scenarios say the same?), and it doesn’t stop with that trellis pattern, or some other curious details on the Lirey pilgrim badge or surviving mould thereof. Look for example at this example from early art (sorry, I don’t have a date) of St.Lawrence being slow roasted. Https://encrypted tbn2.gstatic.com/images?q=tbn:A Nd9 Gc Qh Pk S Qp1 W 9 QV Kpzz Zy1 Ep L Euc PW7 Qg Yr5w Hfa5j J6kh0 Nf F8 Does not the martyr’s posture and state of undress, with strategic positioning of crossed hands, remind you of something?.","date":"2014-07-23","mins":"2:02 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"},{"id":"comment-139971","author":"colin_berry","post":"It would be L for (St.) Lawrence, or, less probably, L for Lirey David. L for Lawrence would dovetail neatly with the point Thomas made earlier re the short(ish) hair and the (shortish) beard. That is exactly how the Man on the TS is depicted on the Lirey badge, regardless of hair or beard length on the actual TS. The Lirey custodians were engaged in a long term process of creating a myth around their possession, but had to ensure there was an alibi to keep the Bishop(s) of Troyes off their backs. Officially it was the Shroud of Lawrence(?). Unofficially it was the whole body version (post mortem) of the Veil/Suaire of Veronica..","date":"2014-07-23","mins":"9:57 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"},{"id":"comment-139935","author":"colin_berry","post":"Oh dear, yet another claim that it was the TS that influenced art, even that of the iconic St.Lawrence with his celebrated and memorable method of of dispatch. So why the crossed legs, daveb, if it’s merely a plagiarising of the Shroud, which frankly I doubt? Crossed feet (maybe), though I’ve recently concluded from spending lots of time on Shroud Scope that they weren’t (though one can excuse medievals for thinking the feet were crossed). Naturally I chose the picture that best approximated the TS posture, but there are scores, hundreds of them available by googling (st.lawrence, roasted, grid iron) etc, showing a huge range of combinations, with and without loin cloth, with and without rods for holding down the subject, with and without securing cords on wrists, midriff or ankles etc etc. Incidentally, the securing cord (?) on St.L’s midriff, where shown, is interesting in view of the Lirey badge dorsal side, with its so called “blood belt” (Ian Wilson), given it’s the only “blood” imagery. Securing cords are not needed for crucifixion, not with nails at any rate, but I know another form of despatch that does, as did the Templars. One might also venture to suggest that it was the iconography of St.Lawrence that made nudity in devotional art respectable, provided certain conventions for concealment of procreational/recreational paraphernalia were followed. Devotional art had many centuries (eleven to be exact) in which to perfect the iconography of St.Lawrence.prior to the first public display of the Lirey Shroud in 1357 display. Is it too much to ask that it be relieved of the charge of being “derivative” or, alternatively, credited with an amazing precocity, using paint to record the Shroud’s ‘pre history’ while failing to leave a few token words, indeed any words, by way of explanation in script? But where would this site be with its Shroud spotting and Shroud spotters? St.Lawrence must come as a welcome break from HPM ology….","date":"2014-07-23","mins":"4:41 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"},{"id":"comment-139937","author":"colin_berry","post":"Typo last sentence: “without” its Shroud spotting etc….","date":"2014-07-23","mins":"4:44 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"},{"id":"comment-140089","author":"colin_berry","post":"Postscript to my previous comments re the L symbol, or, as I prefer to hypothesize, L word.] How odd that the first home for the Shroud on arrival in Turin, having been brought from Chambery in1578, was not its present one, i.e. The chapel between St.John’s Cathedral and the Royal Palace, but, the chapel of St. ?????????. Can you guess? Yup, it’s that same L word again. That’s Lorenzo, i.e. Lawrence. Do I hear folk say that’s just a coincidence? How many coincidences that link Lawrence with the Shroud are needed, one wonders, to tip a balance between correlation and causation?.","date":"2014-07-24","mins":"3:34 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"},{"id":"comment-139952","author":"colin_berry","post":"Frankly, I can’t see what relevance attaches to the proportion of images of the saint in life v death, since it’s the manner of his death that is in the frame, and the way the particular gruesome way he died was portrayed in art over the centuries, relieving the TS of having to be ground breaker in matters of slow torture and nudity. What’s more, your search terms needed to be more focused on his death. Try googling (st.lawrence martyrdom grid iron), and see the difference: https://www.google.co.uk/search?q=st.lawrence+martyrdom+grid+iron&source=lnms&tbm=isch&sa=X&ei=F5b PU O1 Fqz H7 Abe2 YHI Bw&ved=0 CAYQ A Uo AQ&biw=1429&bih=727&dpr=0.9.","date":"2014-07-23","mins":"7:08 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"},{"id":"comment-174267","author":"colin_berry","post":"In my latest incarnation as revered biblical scholar, here’s a verbatim account of what I added as an appendix to my recent unceremoniously entitled “body bag” posting that may (hopefully) resolve any perceived difficulties. It differentiates between Joseph of Arimathea’s linen on the one hand, used to transport the body from cross to tomb (as per synoptic gospels) and the final burial “shroud” , as per John, the latter probably narrow windings if the truth be told that replaced the temporary linen. (see also a separate appendix on the Pray manuscript that arguably combines the synoptic versions and John’s showing both Joseph’s opened out linen AND the winding cloths in readiness). From my posting: APPENDIX 1 : what the NT has to says on the “linen”: Matthew, Chapter 28: 57. When the even was come, there cam a rich man of Arimathea, named Joseph, who also himself was Jesus’ disciple. 58. He went to Pilate and begged the body of Jesus. Then Pilate commanded to body to be delivered. 59. And when Joseph had taken the body, he wrapped it in a clean linen cloth. 60. And laid it in his own new tomb, which he had hewn out in the rock: and he rolled a great stone to the door of the sepulchre and departed. There is no evidence there that the linen cloth was intended to be used as the final burial shroud. Indeed, it’s clear it was intended primarily for transporting body from cross to tomb. One is not entitled to assume that a sheet of linen used to transport a bloodied body then doubled as the final burial shroud, implying there was no cleaning of the body. How likely was that? Why would the Marys bring ointments etc the next day, unless it was intended to first wash the body – and then remove it from the soiled ‘body bag’ prior to wrapping in fresh clean sheets? Mark, Chapter 15 43 Joseph of Arimathea, an honorable counsellor, which also waited for the kingdom of God, came, and went in boldly unto Pilate, and craved the body of Jesus. 44. And Pilate marvelled if he were already dead: and calling unto him, the centurion, he asked him whether he had been any while dead. 45. And when he knew it of the centurion, he gave the body to Joseph. 46.And he bought fine linen, and took him down, and wrapped him in the linen, and laid him in a sepulchre which was hewn out of a rock, and rolled a stone unto the door of the sepulchre. 47. And Mary Magdalene and Mary the mother of Joses beheld where he was laid. How likely is it that a length of cloth used to transport a bloodied body from the site of execution would double as final burial shroud? Luke, Chapter 23 50 And, behold ,there was a man named Joseph, a counsellor and he was a good man and a just: 51… etc etc 52. This man went unto Pilate and begged the body of Jesus. 53. And he took it down, and wrapped it in linen, and laid it in a sepulchre that was hewn in stone, wherein never man before was laid. 54. And that day was the preparation, and the sabbath drew on. 55. And the women also, which came with him from Galilee, followed after and beheld the sepulchre, and how his body was laid. 56. And they returned, and prepared spices and ointments; and rested the sabbath day, according to the commandment. John, Chapter 19 38. And after this, Joseph of Arimathea, being a disciple of Jesus, but secretly for fear of the Jews, besought Pilate that he might take away the body of Jesus: and Pilate gave him leave. He came therefore, and took the body of Jesus. 39. And there came also Nicodemus (which at the first came to Jesus by night) and brought a mixture of myrrh and aloes, about a hundred pound weight. 40. Then took they the body of Jesus, and wound it in linen clothes with the spices, as the manner is it of Jews to bury. Observe there is no indication as to what was used to transport Jesus to the tomb. While the “clothes” used to “wind” Jesus are described as linen, it seems fairly certain they used new material, different from that (unspecified) material used for transport. Might this be the source of confusion – the reference to linen used in two different contexts, one for transport in Matthew, Mark and Luke, and another different linen in John used for the final “winding”. Matthew, Mark and Luke describe a linen ‘body bag’ – unlikely to be used as burial shroud. John describes a linen burial shroud, with no indication as to what preceded it, if anything, as body bag..","date":"2014-12-02","mins":"2:39 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross"},{"id":"comment-174301","author":"colin_berry","post":"“The main point is, that the ‘descent from the cross’ is not described in the gospels. A fortiori, no ‘linen’ of ‘shroud’ is mentioned in connection with the descent from the cross.” How do you square that with Mark Chapter 15, Jos? viz: 46. And he bought fine linen, and took him down, and wrapped him in the linen, and laid him in a sepulchre which was hewn out of a rock, and rolled a stone unto the door of the sepulchre..","date":"2014-12-02","mins":"8:50 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross"},{"id":"comment-174313","author":"colin_berry","post":"Sure it was David. It came with a 700 year guarantee…But we’ll need to look out the store receipt..","date":"2014-12-02","mins":"11:41 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross"},{"id":"comment-174332","author":"colin_berry","post":"Does the pomposity come naturally, or is it something you have to work at?.","date":"2014-12-02","mins":"2:57 pm","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross"},{"id":"comment-174398","author":"colin_berry","post":"“You raise a lot of issues on this site, which suggest you’re not at all aware of Barbet’s work”. Priceless! Have you consulted any logicians recently? You really ought, for your own good..","date":"2014-12-03","mins":"12:53 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross"},{"id":"comment-174485","author":"colin_berry","post":"How odd. There’s resistance being shown on this site to the idea of the body being transferred directly from cross to J of A’s linen. It first showed in Jos Verhulst’s posting (this one) and has been demonstrated in a number of comments since, typified by daveb’s, telling us that no sheet was needed to transport the body to the tomb, it being just a short distance, according to one biblical verse. Maybe someone can explain the difficulty with the three synoptic passages that all say essentially the same thing, namely that the body of Jesus was received into J of A’s sheet immediately after “taking down” from the cross and/or before arrival at the tomb. Medieval artists showed no inhibition in portraying the deposition from cross to linen, as I had to remind folk, and have been supported in that by Hugh Farey. So what’s the difficulty? Is it something to do with the question (unresolved) as to to whether J of A’s linen was still in place at the moment of image imprinting in the tomb (pro authenticity narrative naturally)? If so, that’s not the issue where this posting is concerned, which is purely to do with the timing of the body’s initial placement into J of A’s linen, not the subsequent fate of that linen. My interest in the precise timing (for which I’m happy to accept the synoptic gospel account) is to do with building credibility for my ‘sweat imprint’ hypothesis, i.e. To help with rationalizing my scorch hypothesis. It was not intended to cast doubt on any of the proposed pro authenticity scenarios that start with the arrival of a body at a tomb. My interest is focused entirely on a medieval trickster’s thinking as to what may have happened en route from cross to tomb, long enough for a sweat/blood imprinting of the TS image that repeated on a larger scale that which, according to legend, produced the fabled face on the Veil of Veronica. Having said that, I realize the difficulty of keeping the different scenarios – pro and anti authenticity in their separate water tight compartments. But we should surely all agree on respecting the chronology of the biblical record as far as J of A’s linen sheet is concerned, whether or not we see it as one and the same as the ‘Holy Shroud’ that presently resides in Turin. J of A’s linen make its first appearance at the cross, not the tomb..","date":"2014-12-03","mins":"12:40 pm","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross"},{"id":"comment-174432","author":"colin_berry","post":"If I read you correctly, Thomas, what you are saying is there is nothing to say that the sheet of linen, purchased by J of A, was not the one onto which the blood and image of the present TS was acquired, i.e. It could have been used for transport from cross to tomb, and still have been in place, burial shroud like at the instant of Resurrection, even if not originally intended as the final burial shroud (the sabbath having interrupted final preparations). You’re right, there’s nothing immediately inconsistent with that narrative. But it would turning a blind eye to the writings of Zugibe who claims that the body must have been washed (or partly so) to account for the imprinting and appearance of the scourge marks. All sorts of complications arise if the present shroud had received blood both before and after washing. The different blood stains would surely be far more heterogeneous and “complex” than is the case. In drawing attention to the synoptic accounts of a sheet of linen being deployed to receive the body immediately after removal from the cross, I am simply flagging up what I consider to be a new and credible non authenticity scenario. A medieval entrepreneur realized those verses from the three synoptic gospels offered an opportunity to build on the Veil of Veronica theme. If a lady’s shawl, briefly dabbed onto a sweat and blood stained face en route to the site of execution could subsequently develop into a portrait quality likeness, as per legend, albeit with miraculous assistance, then why not the imprint of sweat and blood left on Joseph’s linen too (with biblical authority too, unlike the Veronica legend!? What’s more, there would be an instant defence against the charge that one was falsely claiming to have the genuine burial shroud. Response: “Who said anything about burial shroud? It’s not the shroud – it’s simply the linen used to transport the body from cross to tomb, and later retained as a keepsake , without laundering, such that sweat imprint gradually yellowed with age.” Please believe me when I say I’m not here to wind people up with a non authenticity message, but will hang around until I’m absolutely certain that folk know the grounds upon which that message is based. Even now there are some who don’t seem to have cottoned onto the fact that the “scorch hypothesis” is still in business. What’s changed is the rationale for medieval scorching of a life sized double image. Initially I tried to link that with the Templar executions by slow roasting, based on Lirey’s Geoffroi de Charny being allegedly a nephew of de Molay’s key aide, Geoffroi de Charney who died the same day in 1314 (plus scraps of evidence from the Lirey badge etc). There is no longer any need to seek a Templar link if the purpose of the scorch technology was to produce a life sized version of the Veronica – the faint scorch image being cunningly marketed as an ancient yellowed imprint left by sweat, with additions of blood as the finishing touch.St.Francis de Sales’ letter to his mum in 1614 when Bishop of Geneva says it all. He had seen the Shroud at close quarters and viewed it as an image bearing sweat and blood. The word sweat was used several times. Must run. Grandfatherly duties..","date":"2014-12-03","mins":"4:06 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross"},{"id":"comment-174575","author":"colin_berry","post":"Pleased to hear it Thomas. But have you considered the implications? Imprinting onto a linen sheet used immediately after ‘taking down’ generates an entirely different narrative (or possible narratives) than imprinting much later onto the same sheet or a replacement one. It’s not an area I’m not keen to get into, having said many moons ago that much of what has been written re ‘re bleeding’ from old wounds, ‘unclotting’ , etc by this or that mechanism (fibrinolysis, serum exudates of retracted blood clots etc) strikes me as counter intuitive, indeed credulity stretching. None of those complicated some might say contrived scenarios are needed if the imprinting occurs, whether 1st or 14th century, from a real or simulated corpse in which the wounds are still relatively fresh. But all of that overlooks the elephant in the room – the time constraints imposed on imprinting of a secondary body image. If the TS is J of A’s linen sheet, then who’s to say it was not replaced with something else (like Nicodemus’s linen) prior to imprinting of body image by supernatural processes? Who’s to say that medieval hoaxers had no intention of “modelling” a supernatural imprinting of body image – and were content to propose a Veronica like imprinting of sweat as well as blood onto the transport linen en route to the tomb? I may be totally wrong re imprinting mechanisms, but am sure about one thing: the biblical record simply does not justify the description Turin “Shroud” if there’s no evidence that the sheet of linen was ever intended to be used as the final burial shroud. It should be re named the Turin Linen, or maybe “Turin Imprint”, leaving open the possibility of it being a larger post mortem analogue of the pre mortem Veil of Veronica. Any miracle would be less to do with ‘resurrection imprinting’ than morphing of a sweat imprint into a negative image of a recognizable human being..","date":"2014-12-04","mins":"2:18 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross"},{"id":"comment-174596","author":"colin_berry","post":"Have just taken a closer look at the Rubens painting that is the subject of this posting (click to enlarge) and spotted something I’d missed (maybe other did not). The linen sheet is actually being used to aid removal from the cross, being deployed like a chute or slide. One of the important looking gents (probably Joseph of Arimathea) has a free end of linen wound around the leg of Jesus and clearly being used as a friction brake. There are other outstretched hands being used to support and ease the body down gently. Some here have tried to dismiss the idea of Joseph’s linen being used primarily as a means of transport to the tomb, stating that wasn’t necessary (tomb nearby) despite the biblical record stating that J of A’s linen was produced at the cross (not the tomb). Well, now we have another entirely practical reason for using linen at the cross that was needed whether the tomb was 10 or a 1000 yards away – i.e. As an aid to “deposition”. Here is one more reason for thinking that Joseph’s linen was not intended for use as the final burial shroud, just one more that can be added to a growing list. Why do we assume the image on the TS, whether authentic or not, was imprinted onto a burial shroud, when there was an opportunity for imprinting onto Joseph’s linen, the latter being removed and replaced by something else (as hinted at in the gospel according to St.John – and the Pray manuscript). Sorry to repeat myself – but Turin “Shroud” looks increasingly like a misnomer – one that may well have put generations of scholars off the scent..","date":"2014-12-04","mins":"6:15 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross"},{"id":"comment-174599","author":"colin_berry","post":"PS One might predict that “deposition” linen for use as a chute would be twice body length or more! Oh, and of good sturdy quality. Ring any bells?.","date":"2014-12-04","mins":"6:47 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross"},{"id":"comment-174289","author":"colin_berry","post":"There’s a wiki entry devoted entirely to the ‘Descent from the Cross” and with it a gallery of images. Https://en.wikipedia.org/wiki/Descent from the Cross#Gallery Many of the images show the body being received into Joseph’s sheet of linen, exactly as per biblical chronology (synoptic gospels) or being transported in the linen sheet, the latter being used more as a stretcher than a closed up body bag. (Artists would prefer the former over the latter for obvious reasons, leaving the face visible). The body bag idea was inspired by my revised belief that the TS could have been someone’s entrepreneurial idea of modelling a bigger and better version of the Veil of Veronica for which Joseph’s linen summoned up for immediate transport made a lot more more sense than any final burial shroud, especially if as seems reasonable the body was intended to be washed free of blood and sweat before applying ointments etc). A stretcher would have imprinted one side only. The “body bag” idea allows for simultaneous imprinting of both sides, albeit in a “thought experiment” for post hoc rationalization of the TS image – not I hasten to actually imprint from sweat, real or simulated (considering, as I now do, the TS image to be a contact scorch from a 3 D or bas relief template that ‘masquerades’ as an ancient sweat/blood imprint). As I said earlier, daveb would seem to me to be placing far too much emphasis on the one reference to the tomb being near the cross. Personally I would not wish to carry a naked bloodied crucified man even 10 yards as if an animal carcase, far less 100 or more. Joseph’s provision of linen can be interpreted as a respectful gesture to the newly dead, still on display to onlookers, once the humiliation and public spectacle of Roman crucifixion had been completed..","date":"2014-12-02","mins":"6:24 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross"},{"id":"comment-174308","author":"colin_berry","post":"OK, point taken Hugh. Semantics we know, ancient v modern, can be a bit of a minefield, at least for those who take a word and assume it has a specific meaning. But there’s the other side of the coin too: those who read of Joseph of Arimathea’s purchase of “fine linen” and take that to mean the final burial shroud. There’s no evidence I can see in any of the four gospels that Joseph’s linen was bought or intended for that purpose. Indeed, the evidence supports an entirely different interpretation: it was intended to receive and enclose, partially or completely, the body of Jesus immediately after removal from the cross, and to assist with discreet transport to the sepulchre. The rest is speculative, but from the narrative in John appearing to pick up from where the synoptics left off, any cladding that was used for concealment and transport was then replaced with different linen, what might then properly be termed a burial shroud. That would have been after washing and application of spices, ointment etc. As you indicated earlier, medieval artists, some of them at any rate, clearly saw Joseph’s linen as a solution to immediate needs before arrival at the tomb. No one has yet commented on the possible insights offered by the Hungarian Pray manuscript – namely that it shows both Joseph’s linen under the laid out body, and replacement narrow winding strips in readiness. Does not the John account suggest that the latter were in place, along with spices etc, before Nicodemus vacating of the tomb and final preparations for interment before the arrival of the sabbath.. In that scenario, blood etc would have been on Joseph’s linen, which having served its purpose could then have been taken from the tomb for laundering and re use. Pro authenticity imaging of the body would have been onto Nicodemus’s arguably tighter, more compact, more disposable winding strips, with or without some (fairly minimal) late seepage of blood. Take away message: Joseph’s “fine” line was unlikely to have been one and the same as the shroud with a body image if requiring a resurrection event. But it could have been proposed by medieval entrepreneurs (“Relics U Like”) as the transport linen onto which an apparent sweat/blood imprint had been formed, a full body sized version of the Veil of Veronica, post rather than pre mortem..","date":"2014-12-02","mins":"9:58 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross"},{"id":"comment-174290","author":"colin_berry","post":"PS: While the main title is “Descent from the Cross” there’s an alternative one given: “Deposition of Christ”. Deposition into what? Into Joseph’s linen, obviously as shown in most of the accompanying images, yet curiously the text fails to make a single reference to the linen. I confess to finding myself totally wikified….","date":"2014-12-02","mins":"6:40 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross"},{"id":"comment-188105","author":"colin_berry","post":"Yes, you’re probably right, daveb. Sadly, Charles F is probably not false flagging as Mike M, despite my deep suspicions. I’ll now have to find another way of destroying his otherwise impeccable credentials as a historian. Speaking of irony, I was pleased to see the other day that there’s to be a new feature installed on the next Google Translate update. It’s a fine tuning of the ‘Auto Detect language’ facility, one that will enable it to detect irony with a claimed 95% success rate, especially on Old World websites. The word on my grapevine is that it’s to be installed as default setting on all New World websites so as to reduce the risk of international misunderstanding, obviating the need for hassle free rendition to Cuban seaside resorts, water boarding, all out nuclear war etc..","date":"2015-02-01","mins":"2:08 pm","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","title":"Picture for Today"},{"id":"comment-188045","author":"colin_berry","post":"Is that really Mike M touching base? Or has Charles F cybermorphed?.","date":"2015-02-01","mins":"7:35 am","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","title":"Picture for Today"},{"id":"comment-132454","author":"colin_berry","post":"OK: are you not aware of the perils and pitfalls of what is known as “selection bias” (googlable)? The first person to single out a particular obscure set of line drawings because they showed “L shaped poker holes” was guilty of selection bias. It’s been downhill all the way ever since, certainly in a probability/statistics sense, especially as the said drawings are for the most part poorly executed, with many features that are obscure or ambiguous (tomb lid? shroud?) as to their interpretation, at least to the modern eye. The first person to spot those “L shaped poker holes” in the HPM was I understand Mechthild Flury Lemberg, who is not an art historian, but a celebrated textile restorer not noted for her expertise in probability and statistics. Her “sample size=1” observation was then quickly taken up by celebrated historian Ian Wilson (displaying selection bias) and then by celebrated TV documentary maker David Rolfe (displaying selection bias). The latest recruit to the bandwagon is an energetic Polish Shroud scholar (displaying, guess what, selection bias). It’s high time the HPM, essentially an inexpert medieval strip cartoon, was given a decent burial. It’s an egregious example of, guess what… ?.","date":"2014-06-23","mins":"1:37 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132564","author":"colin_berry","post":"Last word from me, OK. We are looking at a glaring instance of selection bias, in which someone has singled out an an obscure series of ink drawings, allegedly showing “L shaped poker holes” (mere circles) and then proceeding to find any number of further “correspondences”. Each of the latter has required the eye of faith – like interpreting a tomb lid as a shroud, or interpreting a zig zag pattern as a herringbone weave. It all goes back to the initial selection of a poorly executed line drawing, with one ambiguous feature, and then, surprise, surprise, discovering more and more ambiguities, each of which has been harnessed to build a spurious case for “multiple correspondences”. Sorry, but some of us refuse to buy into this self delusion..","date":"2014-06-23","mins":"4:37 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132479","author":"colin_berry","post":"“I don’t know what exactly type of “selection bias” you have on mind. The presence of L shape holes on both TS and HPM, for example, is absolute and undisputable fact.” Nope. They are burn holes on the TS, certainly, but they are small pen drawn circles on the HPC – not necessarily intended to represent any kind of holes, least of all burn holes, and indeed almost certainly not intended as holes (given the other non L shaped collection on the lid/shroud that is rarely if ever mentioned, and the assortment of little circles used elsewhere on hems of garments etc etc.). It’s also rather stretching credulity to suppose that someone wishing to incorporate a supposed image of the TS into his ’empty tomb’ scene would have chosen the so called poker holes as his motif, inviting ridicule (“but they came much later dear chap”). He could have used an unambiguous herringbone weave, such as we see on the Lirey Pilgrim’s badge, or discreetly shown some or all the distinctive bloodstains. Did you see what I said about your probability computation? It’s risible to calculate the probabilities of outcomes AFTER the event. See the playing card analogy. Http://colinb sciencebuzz.blogspot.fr/2014/06/might shroud image have been produced.html Counting points of correspondence is also statistically flawed unless one counts points of non correspondence too (especially when it’s a sample size of 1). The HPM fixation has been a nonsense from the word go. I repeat it shows total ignorance of, or indifference to, the selection bias trap. Yawn. I’m bored. I want the delivery van to arrive with my quicklime, having planned all my preliminary tests..","date":"2014-06-23","mins":"5:26 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132570","author":"colin_berry","post":"Ever searched image files for early representations of St.Lawrence of Rome being slow roasted over hot coals? I have. Note semi or total nudity, strategic placing of hands. Can’t vouch for incorrect number of fingers however..","date":"2014-06-23","mins":"5:21 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133165","author":"colin_berry","post":"“Sarcophagus” we’re told means ‘flesh eater’ Charles, and porous acid neutralising rock (e.g.limestone) construction apparently aided the process. Why the need to accelerate natural decomposition? Rock tombs in short supply? Thus the need to remove remains to ossuaries a year or two later? There’s a whole new area of crypto necro archaeology waiting to be opened up here methinks. Might the little holes have been needed to let oxygen in, and putrefaction gases escape? 100lbs of myrrh and aloes? Keep the flies and rodents out? Let the microbes do their job… Personally speaking, I’d prefer to let my earthly remains nourish a new sapling at my favourite spot on the planet – Eilenroc at the tip of the Cap d’Antibes,.","date":"2014-06-27","mins":"4:35 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132578","author":"colin_berry","post":"Plagiarism is one thing. Noting others’ suggestions, followed by go it alone googling is something else. That’s especially the case when the hat tip is freely acknowledged, as was the case two years ago on my own site: April 23, 2012 at 8:31 pm “In fact, you have just done me a huge favour, whether you realize it or not, by making reference on Dan Porter’s site to the martyrdom of St. Lawrence (St.Laurent in France) whom the Church accused of failing to hand over the Holy Grail/Chalice that he was suspected of hoarding (forgive me if I have got it wrong or over simplified – this being all new to me, and from cerebral RAM).” Nuff said..","date":"2014-06-23","mins":"6:01 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133175","author":"colin_berry","post":"Sure enough Charles. But there were plenty of other sarcophagi in the Greek/Roman era that, in view of population pressure and land shortage, needed to be cleared of their contents and removed to ossuaries in short order, making way for still more who had shuffled off their mortal coil. Death becomes a growth industry when population expands. So ventilation holes may well have been a standard feature – to speed things along..","date":"2014-06-27","mins":"5:48 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-145820","author":"colin_berry","post":"I’d be interested to know what folk make of the wiki entry on “Man of Sorrows”. Http://en.wikipedia.org/wiki/Man of Sorrows The sea change in ‘acceptable’ imagery in Western devotional art is what in science we would call a new paradigm. Interestingly, it arrived (apparently) in the late 13th to mid 14th century. You will see mentions in that link to the new artistic fashion of representing the crucified Jesus, right down to “crossed hands” (though unhelpfully not illustrated). That medieval New Age trend would almost certainly have been mightily assisted (according to that same wiki article) by the Pope in 1350 lavishing rewards in the form of indulgences (“14,000 years” no less off one’s thumb twiddling spell in purgatory) in return for paying homage to the then original and still extant ‘Man of Sorrows’ image, a come on marketing ploy if ever there. Inescapable imperative: to conform, nay prostrate oneself, to the then prevailing fashion (sounds off stage – ringing cash registers, or the medieval equivalent thereof). 1350 note, that being just 5 7 years before the first recorded appearance in the written record of a certain image at Lirey of a presumably crucified man with those, er, crossed hands, arguably displaying the same artistically daring, height of fashion “man of sorrows” look, albeit somewhat quirky and OTT. Maybe it was the medieval equivalent of the ‘socialist realism’ demanded of artists and musicians in the Soviet era. Or there again, I know nothing about art (but know what I like – and don’t like – like having my opinions made for me by other people..","date":"2014-08-24","mins":"10:28 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-133216","author":"colin_berry","post":"You and others here are demanding that the sceptic prove a negative. “Prove that it’s NOT the Shroud that is depicted in a particular line drawing” (pre selected needless to say). “Prove that the moon is NOT made of green cheese.” One is justified in being stubborn when faced with this kind of bullying. One cannot be reasonably expected to prove a negative..","date":"2014-06-27","mins":"11:44 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133233","author":"colin_berry","post":"Notwithstanding the somewhat passé turn of phrase (re the moon and green cheese) there’s a vast difference between someone claiming that two things are related on the basis of alleged “congruences”, fanciful or otherwise, and demanding that others prove that each and every one of the various propositions is incorrect. I repeat: no one should be expected to prove a negative, far less a cobbled together list of them. Five or six weak “congruences” are not a substitute for a single compelling one,.","date":"2014-06-28","mins":"2:36 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133244","author":"colin_berry","post":"Tristan: I said no one can be reasonably expected to prove a negative, like this or that feature is NOT inspired by prior knowledge of the TS. I did not say that no negatives can ever be proved, since that’s clearly not the case. You could easily disprove someone’s contention that none of the contributors on this thread are less than 150 years of age, but might find it a lot harder to disprove that none are less than 25. It’s to do of course with the burden of proof (as distinct from disproof). The burden of proof re the HPM rests with those who claim it incorporates features that required prior knowledge of the TS. We have seen claims for “congruence”, but one must surely agree that they fall short of proof. Do you seriously imagine they would stand up in a court of law? Attempts to switch the burden of proof, requiring sceptics to prove negatives, should be seen for what they are – an admission of defeat..","date":"2014-06-28","mins":"4:13 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134425","author":"colin_berry","post":"Thanks Thomas. For me, the most disturbing aspect of this entire debate has been the wayward spelling of “its” (possessive) in the title….","date":"2014-06-30","mins":"3:42 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134421","author":"colin_berry","post":"No doubt you’re aware of the scientific congress planned for October 2015 on the shores of Lake Balaton (Hungary), Thomas. “The Pray Manuscript: artistic allusion to the Turin Shroud or cruel delusion? The search for secure foundations”. I think you should give the keynote address. See link below to venue (one that should help concentrate minds)..","date":"2014-06-30","mins":"3:18 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134428","author":"colin_berry","post":"I say, steady on old chap… We don’t welcome unseemly displays of contrition here… Nil carborundum illegitimi….","date":"2014-06-30","mins":"3:52 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134505","author":"colin_berry","post":"Nice one Charles. One tiny quibble: the issues raised go way beyond those of academia. What the world of academia does or does not think frankly does not bother this experimentalist too greatly. We’re down to the nitty gritty details at a more visceral level – resenting those who try to browbeat us into submission with their shallow, self serving agenda driven line of argument, carefully selecting what they want us to see, getting ratty and insulting when one points out the inner contradictions. It’s a microcosm really of a battle for hearts and minds that been going on for centuries – enlightenment v mind control propaganda..","date":"2014-06-30","mins":"12:30 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134592","author":"colin_berry","post":"Hello Angel I’m putting together a posting right now that addresses the question of what one can “see” or “not see” on the TS, with emphasis especially on male pattern hair especially (beard and moustache). It will be stressing yet again the caution that is needed given that the TS is NOT a photograph. It’s a Xograph (but what is X? How does each body feature appear in an Xograph? What is or is not accentuated?). Even if the TS shows ‘moobs’, to use the current slang, that does not necessarily mean there’s a genetically based feminisation. Moobs are a common sight right now in my part of the world, with so many of us fellas wearing T shirts despite it being rainy Wimbledon fortnight. Have your read up on the likely reasons? It’s due partly to plain obesity, but there are other factors to do with the hormonal balance, and the enzyme (aromatase) that interconverts testosterone and oestrogen. So we fellas have to avoid oestrogen like substances in food and drink (beware hops in beer!) and fairly mundane nutritional factors like zinc status can be important. I agree with you about Jesus displaying through reported words and action an occasional softer side, but I’d never for a moment thought it might have a genetic basis. Interesting..","date":"2014-06-30","mins":"11:08 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134626","author":"colin_berry","post":"PS to Angel. You see male breasts. Others might see chest hair, especially in those contrasty Enrie negatives. I had wondered about chest hair, and had been looking for wispiness when, thanks to your prompting, a veritable matt was right under my nose all the time. However, I shall be displaying Enrie and Durante pix side by side, when the risk of seeing things that aren’t really there becomes all too apparent, arguably facial hair too..","date":"2014-07-01","mins":"3:07 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134513","author":"colin_berry","post":"Thanks for that OK. You’ve proved my point, not that it needed any further demonstration where this thread is concerned. Your entire MO is one of mind control. You are, to put it mildly, a control freak. Have a good life (but try to ease off on the mind control)..","date":"2014-06-30","mins":"1:14 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135382","author":"colin_berry","post":"Eloquent as ever Hugh – and almost certainly correct in your assessment – which I have long shared. Incidentally, has anyone ever explained why there was only this one attempt, that we know of, to incorporate imagery into a devotional picture that (allegedly) signals to the cognoscenti that the original burial shroud has/had been conserved largely intact (bar an unfortunate mishap with something hot)? Why aren’t there scores, nay hundreds of other instances of this particular flagging up of the Shroud, either as simple and somewhat amateurish pen and ink line drawings, as per Pray Codex, or more ambitious and grandiose works of art? One’s reminded of the old joke: why is there only one Monopolies Commission?.","date":"2014-07-04","mins":"6:43 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135678","author":"colin_berry","post":"“If you want to undermine my reasoning, try to do it with mathematics” I could have done that 500 comments ago, OK, using Stats and Probability 101. But it was more fun watching you paint yourself into a corner. Some advice: never multiply probabilities, even fanciful plucked out the air ones like yours, unless you are absolutely certain the events are independent. But the features (“events”) of the HPM you cite are almost certainly non independent, given (a) it’s just one carefully selected artist, not a random selection and (b) the work of a poor draughtsman, one who inserts one obscure or ambiguous feature after another into his illustrations (e.g. A lid/door/(rigid) shroud), is likely to introduce others too (stepped pyramid pattern, angel sitting or standing, enigmatic head, enigmatic letter/symbol, and notably those L (and P) shaped circles) that were singled out for attention initially, elevating the HPM to its totally undeserved celebrity status in sindonology. So those many features you list are not “independent” events.They are characteristics of a carefully chosen ‘outlier (statistically speaking) with serial instances of artistic vagueness (at least to the modern eye). You had no business multiplying your (fanciful) probabilities together. They are almost certainly non independent. You and others have made a mountain out of possible molehills (but we can’t be sure they are molehills).","date":"2014-07-06","mins":"1:58 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135708","author":"colin_berry","post":"There’s another principle of statistics that seems to have been forgotten here. Association does not prove causation. Put another way, so called congruences may be entirely coincidental, or maybe given excessive weight due to judgemental bias. Counting points of congruence to build a case for causation is statistically fraught with hazard unless one gives equal weight to points of non congruence. Sample sizes of one (HPM) do not assist one’s case either..","date":"2014-07-06","mins":"3:43 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135697","author":"colin_berry","post":"Can’t help you there, Hugh. I’ve never encountered it before until today. I believe it must be “OK’s Law of Something That Has Never Occurred To Anyone Else”. Laws cannot be proven, right, merely verified? I challenge OK to verify his law..","date":"2014-07-06","mins":"2:56 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135716","author":"colin_berry","post":"Sorry. OK. It would take too long to address each of your laboured points individually. Suffice it to say you have driven a coach and horses through both theory and practice of probability and statistics. At the risk of reinforcing all your misjudgements as regards me and other sceptics I have to say this: you cannot ignore or trash the most basic ground rules of those two established disciplines, and expect folk to remain silent. Not for nothing are they referred to as “disciplines”. Be as subjective if you wish (of which we are all guilty from time to time) OR be scrupulously objective. But please desist from wrapping up your subjectivity in pseudo objectivity, as you have done by sidelining statistics and re writing probability theory..","date":"2014-07-06","mins":"4:18 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135972","author":"colin_berry","post":"Am I the only one to think that now is the right time for Dan to close comments on this thread?.","date":"2014-07-07","mins":"12:52 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135824","author":"colin_berry","post":"“That is evidently a subjective interpretation, but I find it persuasive, more so because of the curved unsymmetrical sides of the rectangle in this particular case which I interpret as representing a burial cloth. Others for reasons best known to themselves do not find it as persuasive.” Here’s one of those others who looks at the way, say, the staff and sceptre have been drawn freehand in the very same illustration, without recourse to a straight edge. So is it any surprise that the rectangle also lacks perfectly straight sides? All it means is that the hapless illustrator did not have a ruler about his person, or if he did, considered it too risky to use with an ink loaded quill (risk of ink blots). Why expect perfection in one object, while turning a blind eye to the crude sketchy characteristics of another that is immediately adjacent? The power of the amateurish HPM to erode the critical faculties of what might be termed the Shroud spotting tendency doth truly pass all understanding….","date":"2014-07-07","mins":"12:08 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135977","author":"colin_berry","post":"No. That much we are agreed upon. But there’s much that could be usefully subtracted. But it can’t or won’t happen here..","date":"2014-07-07","mins":"1:04 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132245","author":"colin_berry","post":"“Simpletons”? You in particular should cease this constant ad hom sniping at sceptics, as you refer to us Thomas. The head in question HAS been the subject of previous discussion on this site as to whom or what it represents. My own idea for what it’s worth is that it represents God, still angled as if to breathe life into a dead body, that the letter “a” was an abbreviation for “life” in Latin. Seek (Google or otherwise) and ye shall find. Personally I have better things to do than constantly recycle old debates. Read how I concluded my “quicklime” posting yesterday under “Tongue in cheek finale” and you’ll see what I think of your term “sceptic” to say nothing of OK’s phoney probability calculations..","date":"2014-06-22","mins":"2:49 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132251","author":"colin_berry","post":"Still labelling I see, from “sceptic” to “simpleton” to “scientist”. Where the HPM is concerned, and Flury Lemberg’s “I spy, with my little eye, L shaped poker holes”, eagerly seized upon by Ian Wilson and David Rolfe, I’m not a “sceptic”. Too polite. I’m what you might call a scoffer. Nuff said..","date":"2014-06-22","mins":"3:09 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132246","author":"colin_berry","post":"As I thought – googleable: https://shroudstory.com/2013/03/18/the curious a in the hungarian pray manuscript/.","date":"2014-06-22","mins":"2:54 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-8320","author":"colin_berry","post":"Gethsemane was mentioned earlier. Last night I was comparing the four Gospel accounts of the Crucifixion, and what led up to it, and came across a curious passage in Mark only. It’s one I never recall from years at Sunday School, and consists of just this – two verses: Chp 14 v 51 “And there followed him a certain young man, having a linen cloth cast about his naked body and the young man laid hold on him” v52: “And he left the linen cloth, and fled from them naked.” And that’s it. Linen cloth? Naked? Well you can guess the kind of thoughts that entered the mind of this shroud sceptic, ever alert to clues that all is not what it may seem. Cue Google, and there are any number of entries on that bizarre episode that defy explanation. Here’s one that caught my eye, if only because it articulates (towards the end) the same hunch I formed about why there was a reference to a linen cloth and naked body so soon before the Crucifixion. I shall leave you with the passage in question, and see what reaction it elicits on this site with those who are much better at home than I with holy scripture: Link (My bold formatting of a particular key sentence): The key to identifying this young man might be found in the “linen cloth” he had lightly draped about his body. The particular Greek word that is used for this “linen cloth” is used in only one other event in the New Testament – to depict the “linen cloth” in which the body of Jesus was wrapped for burial (see Matthew 27:59, Mark 15:46, and Luke 23:53). Thus, the only reference we have for this kind of cloth in the New Testament is that of a burial shroud used for covering a dead body in the grave. If the answer to this naked young man’s identity lies in the cloth he had wrapped around his body then follow along with me because it leads us to only one other conclusion. You see, when a body was prepared for burial, it was washed, ceremonially cleaned, and buried naked in a linen cloth exactly like the one described here in the Gospel of Mark. Furthermore, the Garden of Gethsemane was situated on the side of the Mount of Olives. Toward the base of that mount is a heavily populated cemetery, with many of its graves going back to the time of Jesus. When Jesus said, “I AM,” the power that was released was so tremendous that it knocked the soldiers backward (go back and read the story again for that moment). But it may have also caused a rumbling in the local cemetery! When that blast of power was released, a young boy, draped in a linen burial cloth in accordance with the tradition of that time, crawled out from his tomb – raised from the dead! Now you may be thinking “oh really?” Stay with me here… The reason he “followed” Jesus was to get a glimpse of the One who had resurrected him. The word “followed” means to continuously follow. This tells us that this resurrected young man trailed the soldiers as they took Jesus through the Garden on the way to His trial. When the soldiers discovered the young man who was following Jesus, they tried to apprehend him. But when they reached out to grab him, he broke free from their grip and fled, leaving the linen cloth in their possession. Now I don’t know this for certain but it is something that appears to be reasonable as you study Scripture. It doesn’t change the story instead it is just a little more detail that makes you wonder at the mystery and the depth of all that was happening that weekend. So was it Mark? A resurrected dead guy? Or someone else wandering in the Garden wrapped in only a linen cloth? You can review the information and decide for yourself. This is just another of the amazing events that happened around the time of the crucifixion and resurrection of Jesus..","date":"2012-02-15","mins":"5:25 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","title":"The Shroud of Turin: a pale shadow of its former glory?"},{"id":"comment-8346","author":"colin_berry","post":"Well, Chris thinks the linen was a normal everyday item of clothing, and Dave B thinks it was pyjamas. What Chris in particular seems to be doing is ignoring the fact that word translated as “linen” is only used in one other context in the Bible, namely to refer to Christ’s burial cloth, i.e.shroud. He also seems not to find it remarkable that someone would be described as being “naked” under his robe before the thing had actually been tugged away. So of the two versions, I am more inclined to believe Dave B’s (pyjamas), suggestive of something that was skimpier than normal wear. But I think both of you are trying to evade the real point – the writer Mark is describing an omen of some kind – one that involves death, or a premature assumption of death,with its live man in a burial cloth, and may even be flagging up the possibility of being able to escape a prematurely invested shroud if one is willing to go naked. Those two verses could either be seen as representing a harbinger, or, alternatively, there might be a hint that the system of confinement in a tomb was not as irreversible as some might imagine, especially if the individual concerned had been wrongly assumed to be dead. Just a thought and a mischievous one at that some might think. But it’s a one off thought, I can assure you, from someone out of area, prompted by those odd two verses that seem to lack any obvious context..","date":"2012-02-16","mins":"3:59 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","title":"The Shroud of Turin: a pale shadow of its former glory?"},{"id":"comment-8288","author":"colin_berry","post":"Ah,but despite those authentic lookiing sepia tones, Dan, your image that accompanies this posting is a negative > positive modern era enhancement, and not what would have been seen centuries ago, either on the full Shroud or a framing of the head alone (Mandylion). Try this one instead. (Not quite so photogenic, eh, if you will pardon the anachronistic expression?): original negative image.","date":"2012-02-15","mins":"10:02 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","title":"The Shroud of Turin: a pale shadow of its former glory?"},{"id":"comment-32572","author":"colin_berry","post":"Give a self professed archaeocryptologist enough rope (like modern day digital art) and he’ll hang himself – but not before he has thoroughly tied himself in knots.;.;..","date":"2013-05-02","mins":"5:16 am","url":"https://shroudstory.com/2013/04/25/the-shroud-of-turin-blimp/","cat":"art","title":"The Shroud of Turin Blimp"},{"id":"comment-32607","author":"colin_berry","post":"“I am speechless”. If only that were the case….","date":"2013-05-02","mins":"10:34 am","url":"https://shroudstory.com/2013/04/25/the-shroud-of-turin-blimp/","cat":"art","title":"The Shroud of Turin Blimp"},{"id":"comment-32700","author":"colin_berry","post":"Breaking news: I see that Daniel Milberg has deleted all of MPH’s theorizing from his blimp posting. So much for the misguided (some might say bizarre) attempts to interpret digital art via increasingly desperate English language word association… Manic is the word that springs to mind….","date":"2013-05-03","mins":"2:50 am","url":"https://shroudstory.com/2013/04/25/the-shroud-of-turin-blimp/","cat":"art","title":"The Shroud of Turin Blimp"},{"id":"comment-32863","author":"colin_berry","post":"I’d advise pre digital era photography for MPH – working with developers and photosensitive emulsions. He could then spend most of his day inside a dark room… ; ).","date":"2013-05-04","mins":"5:57 am","url":"https://shroudstory.com/2013/04/25/the-shroud-of-turin-blimp/","cat":"art","title":"The Shroud of Turin Blimp"},{"id":"comment-32195","author":"colin_berry","post":"PS: it’s of course a Balkenkreuz on the blimp’s tail fin, , symbol of the WW2 Wehrmacht. The artist sensibly avoided a more potent symbol of that era in German history…..","date":"2013-04-29","mins":"4:55 am","url":"https://shroudstory.com/2013/04/25/the-shroud-of-turin-blimp/","cat":"art","title":"The Shroud of Turin Blimp"},{"id":"comment-32193","author":"colin_berry","post":"And now for something completely different (relax – it’s from a mere ‘chemist’, so can be instantly dismissed). It was executed in 2005. That was the year that Pope Benedict XVI, a Bavarian German, assumed office. The artist may have been aware of that Pope’s interest and prior involvement in the Shroud, and had attempted to link it with international politics. The blimp is prevented from taking off, being confined, nay trapped, within a hangar. The latter is cathedral like in its general proportions, but is lined with dollar bills. Is it American money that is preventing an incoming German Pope’s pride and joy from truly taking off, preventing a renaissance of the RC Church? I leave it to others to make tendentious connections between mighty US dollar and the Shroud, though no doubt the conspiracy theorists will not be slow to suggest that the result of the radiocarbon dating had been “paid for” by Stateside WAS Ps….","date":"2013-04-29","mins":"2:37 am","url":"https://shroudstory.com/2013/04/25/the-shroud-of-turin-blimp/","cat":"art","title":"The Shroud of Turin Blimp"},{"id":"comment-32744","author":"colin_berry","post":"Daniel Milberg must be hugely grateful to have someone here who is capable of interpreting what was in his unconscious or subconscious mind when he threw together his digital images..","date":"2013-05-03","mins":"8:38 am","url":"https://shroudstory.com/2013/04/25/the-shroud-of-turin-blimp/","cat":"art","title":"The Shroud of Turin Blimp"},{"id":"comment-32297","author":"colin_berry","post":"“… re the word Hangar: the cryptographic fact is it plays with the Aramaic word Naggar, meaning “Builder” (i.e. “wood and stone cutter”) in connection with Yeshua’s trade; Yeshua Ha Notsry, short for Natsory (Judean Hebrew), “Jesus the Nazorean/Nazarean” in English.” What we see here is a spectacular conflation of visual imagery and verbal/written expression. When it’s impossible to introduce a term like “hangar”into a thread without its etymology being dissected, and parallels drawn with an Aramaic word from a totally different context and era of history, you know that the semantic gymnast in question has become hopelessly trapped within a mental gymnasium entirely of his own making, one that is totally divorced from the real world..","date":"2013-04-30","mins":"1:21 am","url":"https://shroudstory.com/2013/04/25/the-shroud-of-turin-blimp/","cat":"art","title":"The Shroud of Turin Blimp"},{"id":"comment-32215","author":"colin_berry","post":"The origin of the word ‘punishment’ has suddenly occurred to me….","date":"2013-04-29","mins":"8:55 am","url":"https://shroudstory.com/2013/04/25/the-shroud-of-turin-blimp/","cat":"art","title":"The Shroud of Turin Blimp"},{"id":"comment-32224","author":"colin_berry","post":"“In the English speaking world, punning is viewed as more of a tic than a trick”. Http://www.bbc.co.uk/news/magazine 21011778 On thing is for certain: an artist like Daniel Milberg would NEVER incorporate wordplay into his visual medium..","date":"2013-04-29","mins":"9:32 am","url":"https://shroudstory.com/2013/04/25/the-shroud-of-turin-blimp/","cat":"art","title":"The Shroud of Turin Blimp"},{"id":"comment-32234","author":"colin_berry","post":"Max Patrick Hamon : CB, good to you If you think you are a specialist of Daniel Milberg, which I also very much doubt. Any kind of play on words, or allusions that rely heavily on words, would restrict appreciation of the art to a single language only. Why would an artist, least of all one employing digital techniques that are ideally suited to transmission via the world wide web, choose to paint (or pixellate) himself into a corner, or risk being seen as anglocentric, obscure and impenetrable? Get real. Daniel Milberg’s art is international – as are the themes that he selects for our attention. If he exercised the kind of preciousness and self indulgence that you do on this site, he would quickly find himself a nonentity – and rightly so..","date":"2013-04-29","mins":"11:00 am","url":"https://shroudstory.com/2013/04/25/the-shroud-of-turin-blimp/","cat":"art","title":"The Shroud of Turin Blimp"},{"id":"comment-32325","author":"colin_berry","post":"Max Patrick Hamon : Methinks, Milberg’s surrealistic digital work of art does deserve a surrealistic cryptological approach if you really want to know the whole truth behindenburg it. One is increasingly put in mind of Hal, the failing computer in 2001 – A Space Odyssey: “I know I’ve made some very poor decisions recently, but I can give you my complete assurance that my work will be back to normal. I’ve still got the greatest enthusiasm and confidence in the mission. And I want to help you.” and later: ” I’m afraid. I’m afraid, Dave. Dave, my mind is going. I can feel it. I can feel it. My mind is going. There is no question about it. I can feel it. I can feel it. I can feel it. I’m a… fraid. Good afternoon, gentlemen. I am a HAL 9000 computer. I became operational at the H.A.L. Plant in Urbana, Illinois on the 12th of January 1992. My instructor was Mr. Langley, and he taught me to sing a song. If you’d like to hear it I can sing it for you… Daisy, Daisy, give me your answer do… “.","date":"2013-04-30","mins":"6:33 am","url":"https://shroudstory.com/2013/04/25/the-shroud-of-turin-blimp/","cat":"art","title":"The Shroud of Turin Blimp"},{"id":"comment-32345","author":"colin_berry","post":"How strange. A man who reaches for words (not even in his own language) like a drowning man reaches for any passing flotsam or jetsam… Words as life supporting buoyancy aids – hmmmm…..","date":"2013-04-30","mins":"8:55 am","url":"https://shroudstory.com/2013/04/25/the-shroud-of-turin-blimp/","cat":"art","title":"The Shroud of Turin Blimp"},{"id":"comment-32376","author":"colin_berry","post":"Any interpretation that attempts to account for visual information in the picture – the date of execution (2005), the WW2 military insignia, the ceiling above the blimp etc etc – whether correctly reading the artist’s cues or not, is legitimate speculation. What you have been doing here is not legitimate speculation, since you are attempting to impose multiple layers of word associations that have no relevance in digital art. You would be well advised to put Japanese digital art into your search engine, and spend an hour or two interpreting the rich imagery you will see there, where any attempt to invoke word associations is impossible because you won’t know the Japanese characters that represent the components of the image, and even if you did, they do not lend themselves to your kind of misguided attempt to ‘cryptoanalyze’. Merhinks you have rather shot yourself in the foot today, through demonstrating that your cryptoanalyzing tendency is not rooted in an appreciation of early Western art – coded or otherwise – denied to us ordinary mortals, but to a particular turn of mind that sees all visual imagery as a proxy for spoken or written language. It is not. Visual imagery is free standing, unless you have compelling evidence to the contrary. If you are so certain you are right, then go back to Daniel Milberg’s site where you were earlier – and ask him to state whether your approach is correct or not….","date":"2013-04-30","mins":"3:12 pm","url":"https://shroudstory.com/2013/04/25/the-shroud-of-turin-blimp/","cat":"art","title":"The Shroud of Turin Blimp"},{"id":"comment-189056","author":"colin_berry","post":"Even as the rather washed out looking monochrome representation that we see here, the TS life size front and back image is so unique as to warrant the description ‘iconic’. Think of if you like as history’s very first “Test Your Own IQ”: (“Q.1: What must have occurred for this double image to look the way it does? 1 mark.). Given it’s uniqueness, given its instant recognizability, then there would surely have been images similar to the one we see above, etched into the public consciousness, had the TS had been around somewhere or other for 1300 years before the radiocarbon dating. Even if kept under wraps and out of sight by an amazingly efficient order of custodians, swearing each new generation of key holders to silence and absolute secrecy, surely the ‘idea’ would have leaked out and been sketched, painted, carved, cast by someone, somewhere, sooner or later, probably sooner? But where, pre 1355 that is? And if not, why not?.","date":"2015-02-04","mins":"5:20 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-190091","author":"colin_berry","post":"As I said earlier today on a more recent posting (“CNN”) it’s a pre 1355 image with this, the unique and iconic TS configuration that one seeks. I’ve blacked out all detail, because that is not important in the present context. All that matters is that double image, head to head in the one field of view that says unequivocally that someone, somewhere had laid eyes on the distinctive TS image prior to its first recorded display in 1355 or thereabouts. Fragmentary evidence that merely hints at particular features of the TS, but does NOT show the head to head configuration does not count, especially if open to other more obvious or mundane interpretations. That is not evidence. It is special pleading..","date":"2015-02-07","mins":"5:54 pm","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-190389","author":"colin_berry","post":"Never underestimate the power of certain talismanic images, David G, with their ability to fixate and mesmerise. Some folk go to a lot of trouble to resurrect them (to serve their new purposes) and once resurrected, to preserve them. It only takes one individual to spot the potential in a particular image, once seen in full (not conveniently folded up to support agenda driven narratives). Obvious example (I’m sure there are others). You’ll spot the image I’m sure. I wish one could say the same for others on this site (those who cannot see the wood for the trees). I’ll continue to respond to questions put to me personally (common courtesy) but I can say with a fair degree of certainty that I’m now largely finished with this site, having sussed out (I think) the mindset that sustains shroudology. It’s neither good nor bad, merely an interesting facet of the human condition..","date":"2015-02-09","mins":"10:40 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-190096","author":"colin_berry","post":"All I seek is an image comparable to the one above, dated pre 1355. A simple head to head outline or silhouette of a doubled human figure will do. Simple it may be, but it’s iconic. It’s the unique and instantly recognizable TS image, stripped down to its bare essentials..","date":"2015-02-07","mins":"6:11 pm","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-190105","author":"colin_berry","post":"I am not talking about particular details of the TS that are not unique to the TS. I’m talking about the ‘big picture’, the one with a particular detail that is unique to the TS – namely the head to head double image (see above). Where does that configuration appear prior to 1355? (It’s standard practice in academic enquiry to strip away at non essential detail, and to continue doing so until all that remains is the essential detail, essential that is to the particular context under consideration, which in this instance is the unique outline or ‘footprint’ of the TS double image that sets it apart from all other images.) Suppose by some stretch of the imagination that successive generations of custodians, some 50 or more, had managed to keep the TS itself safe and out of sight, out of memory. That’s no reason for thinking that the distinctive shape i.e. ‘footprint’ of that image, a double man – head to head, would, or could have been kept a secret as well. To do so would have been one tall order, indeed well nigh impossible. Time to call it a day..","date":"2015-02-07","mins":"6:52 pm","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-190191","author":"colin_berry","post":"One has only to ask a child which animals have a long neck or a trunk and one gets the right answer straight away. There’s no need to specify the number of eyes, legs etc etc. That’s identifying from verbal clues where the sum of the details are irrelevant, it being the defining characteristics that are all that matters. However, the same principle could be demonstrated pictorially, e.g. By showing children silhouettes of giraffes or elephants in different postures, where the eyes are not visible, or the legs obscured through squatting postures etc, in which it is the single defining feature – the neck or truck that is the give away. One could almost turn that example into a morality tale methinks for deployment on internet sites, whenever folk attempt to obscure issues with a welter of unnecessary and/or irrelevant detail..","date":"2015-02-08","mins":"5:09 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-135446","author":"colin_berry","post":"Here’s a link to a fun picture. It shows a convention of flat earthers gathered at a carefully selected spot on the planet – Meteor Crater in Arizona. Https://encrypted tbn2.gstatic.com/images?q=tbn:A Nd9 Gc TB2vl Xbtt QX x Hx Kx1s Rnpw3 Cjprs0 Zcj Mrbh81 UP7t8o Kcvi Y Sceptics are given binoculars to convince themselves that the Earth does NOT recede downwards towards the far horizon. Some might consider their horizons somewhat limited – to say nothing of displaying selection bias. (Apologies to those tourists in MY carefully selected graphic – chosen to make a claim that is totally at variance with objective reality)..","date":"2014-07-05","mins":"3:07 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-190544","author":"colin_berry","post":"Full house (10/10) Shroud of Turin Blog? Or “The Thoughts of Chairman Max”?.","date":"2015-02-10","mins":"5:50 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-190650","author":"colin_berry","post":".","date":"2015-02-11","mins":"2:03 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-190655","author":"colin_berry","post":".","date":"2015-02-11","mins":"2:17 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-189311","author":"colin_berry","post":"Likewise, one can couple medieval paintings of horses with earlier cave paintings of rhinoceri with well developed horns to prove that unicorns really did exist..","date":"2015-02-05","mins":"6:00 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-190677","author":"colin_berry","post":"2 =Moi (CB) 3 & 4 = Professor John Cummings and Dr.Hans Englyst Dietary fibre symposium, London, circa 1986 And below: Reprint: 1986 Englyst and Cummings with the first published reference to enzyme resistant starch in bananas – green versus ripe:.","date":"2015-02-11","mins":"5:13 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-190675","author":"colin_berry","post":".","date":"2015-02-11","mins":"4:56 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-189134","author":"colin_berry","post":"“It comprises some 276 pages, double spaced, with 251 footnotes, and 20 illustrations taken from his 136 slide presentation.” Yes, but what one seeks is just one teeny weeny hint in the historical record that there was a life size imprint on linen of a TS like double image prior to 1355 .Nope, not “excuses” (“it was folded up to look like a face only portrait, no double image”) but real evidence for the existence of what we see now. How could an iconic image have remained secret for 13 centuries, only to have suddenly re appeared from the mists of time with no ‘history’, on relatively pristine, newish looking linen (don’t mention the radiocarbon dating)? 276 pages, or 2760 pages, or 27600 pages do not compensate for a 1300 year old vacuum in the historical record..","date":"2015-02-04","mins":"2:58 pm","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-189394","author":"colin_berry","post":"“I was dead serious, Colin. You have no precedent in art history for the Shroud so you can’t ipso factso call it man made. You have only a theory – no proof. ” There’s a simple reason why the TS has not precedent in art history, David G. It was not intended to appeal to artistic sensibilities. How could it, being a faint negative monochrome imprint? It should be seen essentially as a medieval puzzle – more mathematical than artistic. The viewer on first acquaintance had first to recognize the image as a bodily imprint, not a painting. He was then expected to make the connection between the strategically separated frontal and dorsal images and the use of an up and over sheet of linen, not canvas, to realize that it corresponded with the biblical account of Joseph of Arimathea’s intervention,. The viewer was then invited to invest further mental effort in matching up the bloodstains to the biblical account of the scourging, crowning with thorns and crucifixion, but with no flagrum, no thorns, no nails or lance in the ‘picture’. Two puzzles for the price of one – bodily imprint AND blood. Is it any wonder it was an instant hit? But it had to be unique! Finally, when the medieval viewer has put all those together he was then amenable to the suggestion that what he was viewing was NOT merely a contrived counterfeit, but the real linen that enveloped Jesus. However, for that conclusion to be drawn it was imperative that there were no prototypes still in in circulation. No doubt they had existed – if only from the one originating workshop – but they had to be promptly destroyed. Let’s stop thinking about the TS as art. It leads one down a totally false trail. It only became art once Secondo Pia had shown the stunning effect of reversing the tonal values.The first cohorts of medieval viewers would not, and could not have foreseen that transformation, or have done that in their own heads..","date":"2015-02-05","mins":"11:46 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-189251","author":"colin_berry","post":"“Likewise, until the skeptic produces proof of Shroud prototypes in the art or historic record, it too remains theory that it is man made.” You cannot be serious, David G!!.","date":"2015-02-05","mins":"1:19 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-189639","author":"colin_berry","post":"From wiki (my bolding): ‘Rolling Stone’ magazine described (it) as “Lennon’s lavish daydream” and music critic Richie Unterberger said “‘Lucy in the Sky With Diamonds’ was one of the best songs on The Beatles’ famous Sgt. Pepper album, and one of the classic songs of psychedelia as a whole. There are few other songs that so successfully evoke a dream world, in both the sonic textures and words.” In a review for the BBC, Chris Jones described the song as “nursery rhyme surrealism” that contributed to Sgt. Pepper’s “revolutionary … sonic carpet that enveloped the ears and sent the listener spinning into other realms.” Er, ring any bells?.","date":"2015-02-06","mins":"5:54 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-189661","author":"colin_berry","post":"Newspaper taxis appear on the shore Waiting to take you away Climb in the back with your head in the clouds And you’re gone….","date":"2015-02-06","mins":"7:21 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-189685","author":"colin_berry","post":"Dan: Is there a site administrator’s option whereby you can increase the number of “Recent Comments” that are retrievable beyond the present maximum of 10?.","date":"2015-02-06","mins":"8:25 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-189277","author":"colin_berry","post":"Please read my first comment on this thread daveb. I asked why there was no evidence of the life size double image existing in the public consciousness prior to 1355. I confess that I have not as yet got round to reading Jack Markwardt, and look forward to doing so. But unless there’s new and substantive evidence in those 276 pages for one or more sightings of the iconic TS front and back full length body image pre 1355, ideally negative, suggestive of a bodily imprint, then my failure to read Markwardt is simply not relevant to the question posed..","date":"2015-02-05","mins":"3:47 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-190079","author":"colin_berry","post":"It’s evidence for the iconic double image, frontal v dorsal, nearly but not quite joined at the heads, having been sighted pre 1355 that one seeks for the existence of the TS pre Lirey. Single images don’t count. If in the course of following hundreds of postings on this site and elsewhere, and thousands of comments, one has never once encountered evidence for the existence of such a double image or the slightest hint thereof and, moreover, gets no response when making a specific request for that image, then I think it’s fair to assume that it doesn’t exist..","date":"2015-02-07","mins":"5:06 pm","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-186011","author":"colin_berry","post":"Would someone care to make me an offer for the GENUINE Mona Lisa? Yes, this is the real one, not that cheap and garish imitation that hangs in the Louvre. There are three ways you can tell that mine is the original. Firstly, all, and I mean ALL the original paint pigment has fallen off, leaving just a ghost of Da Vinci’s original. Second, you will note that what remains is a tone reversed negative. Yes, when pigment detaches from a Da Vinci, one is left with a negative of the original. Not many people know that. However, the real proof that mine’s the original comes from entering the image into a 3 D rendering program: Only a genius of the highest order – Leonardo Da Vinci – centuries, nay millennia ahead of his time – was able to paint an image that degrades to leave a photographic negative with encoded 3 D properties. Message to prospective purchasers: informal ostentations are held nightly at my home, 3, Railway Cuttings, East Cheam. Entrance is free, but viewers are expected to purchase the East Cheam Pilgrim’s Badge, cast in durable epoxy resin for a special reduced price (£35 plus VAT)..","date":"2015-01-24","mins":"3:15 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-186359","author":"colin_berry","post":"“The particular aspect that intrigues me is that the feet are usually seen widely separated and pointing outwards, whereas the Shroud has them close together (overlapping) and pointing inwards.” Sorry Hugh, but I beg to differ re the stated position of the feet on the TS. I may be out on a limb here, but even with my (arguably) best imaging, using the enhanced 2008 BBC/Haltadefinizione (edited to 25/50/ 100 brightness/contrast/midtone in MS Office) I see no clear evidence for the feet being crossed. Admittedly one might imagine that to be the case from the frontal image (left above), where there’s a vague diagonal slant of one foot (viewer’s left) to the right, and assuming a single nail based on the presence of just one prominent bloodstain. But that interpretation is not supported in the dorsal image (right) where there would seem to be soles of both feet being separately imaged, albeit less convincingly than one might wish for. Who’s to say that crossed feet are not a somewhat fanciful interpretation, introduced by an early artist of some renown, one that was subsequently accepted as ‘gospel truth’ by his contemporaries and later generations, but more an article of faith – or unquestioning belief – than anything else? None of this detracts of course from your note of caution above. If anything, it makes the need for caution even stronger..","date":"2015-01-26","mins":"6:49 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-186968","author":"colin_berry","post":"Twice now on this site I’ve reminded folk that any difficulty in seeing the TS body image from a distance would have been rendered less of a problem in public displays by the presence (or maybe deliberate addition) of blood stains and scourge marks. So while “over flagellation” has been cited as evidence of a paying of lip service to prevailing artistic fashion it might equally well have been done to assist visibility, while not compromising the credibility that attaches to a faint body image per se deemed to be a genuine imprint of the body of Christ. Response to my ‘blood compensates for faint body image’ from the eccentric strand of thought that would have us believe that the TS body image is all about disintegrating medieval paint pigment? Answer: zero. Why bother further when one’s own and others’ objections re blood and other crucial image properties (tone reversed negative, 3 D properties) persistently fall on deaf ears? Changing the subject: has anyone here ever tried mega dosing on Vitamin C (say 1 gram or more per day, which may seem large, more than 12 times the UK RDA, but still only a third that recommended by Nobel Laureate Linus Pauling)? Vitamin C is the current preoccupation on my sciencebuzz site (the TS having been relegated for now for reasons to do with monotonous banging of drums). Single 1g doses of Vitamin C cause my finger joints to “crack”. My wife who, without any prompting or encouragement from me, offered her services last weekend as a guinea pig says the same – her finger joints are now cracking. Has anyone else here found that?.","date":"2015-01-28","mins":"11:40 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-11908","author":"colin_berry","post":"The blogger in question has a strange policy of restricting visitors to his site to just one comment, although he makes exceptions for some but not others. So I confine myself to mining the site for useful information, while often finding myself totally at odds with the interpretations, and especially with those “proofs” of his (a strangely dogmatic term for a B Sc biologist to use, but never mind). Stephen Jones did a post on the Pray Codex back in January 2010 in which he attempted to show that the Pray Codex was not the only work of devotional art to be influenced by an alleged prior sight of the Shroud. One of the images shown was the “Entombment of Jesus”, 1181, by Nicholas of Verdun, Klosterneuburg Abbey, Vienna preceding the Hungarian Codex by just 11 or 12 years. I would strongly urge folk to look closely at that image and to compare it with the Codex. Be prepared for a surprise. Why? Because the panel of the Codex with the zig zag pattern and that fabled L shaped arrangement of 4 circles (“poker holes”) that is almost universally assumed to represent the Shroud is probably nothing of the sort. Comparing with the Vienna picture, it is the raised lid of a sarcophagus….","date":"2012-06-04","mins":"3:36 pm","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-186365","author":"colin_berry","post":"PS Afterthought: the Lirey Pilgrim’s badge shows crossed feet, frontal and dorsal. It’s understandable that has been seen as the gold standard (well, lead/tin alloy) where image interpretation is concerned. But without knowing who produced the badge, and/or the accuracy of his own observation and interpretation, we’d be unwise to consider “crossed feet” to be an established feature of the TS..","date":"2015-01-26","mins":"7:24 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-184308","author":"colin_berry","post":"Beware folks. English gents who write history books are not one and the same thing as academic historians..","date":"2015-01-18","mins":"1:34 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-187004","author":"colin_berry","post":"Yes. I’m aware of the suggested link between joint noise and magnesium deficiency (with some folk taking the magnesium chloride supplement you indicate Carlos). But the joint noise (variously described a creaking, cracking, clicking) did not come on until after taking the first 1g tablet , finally went away after some weeks, and then immediately returned with 2nd, 3rd tablets. I suppose it’s possible that Vitamin C might cause loss of magnesium, explaining its action, but why 1g should have that effect is not obvious (the human body is said to contain 21 28 grams of Mg)..","date":"2015-01-28","mins":"2:49 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-187135","author":"colin_berry","post":"Thanks Thomas. It’s in fact quite instructive and possibly enlightening to put oneself in the position of a medieval monk who has been given the task of making a faint body imprint more visible from 50 yards,while (a) doing nothing that detracts from the ghostly body image and (b) can lend further credibility to a 33 AD provenance consistent with or reinforcing the New Testament accounts of the torture and crucifixion.. Personally, I’d start with the major blood flows, and not worry too much about some of them seeming to trickle down the frontal hair, the important thing being to leave a signature of the crown of thorns (the latter not being imaged). I’d then add the scourge marks, making them as evenly spaced as possible, with minimal cross crossing that looks untidy, and trying not to undo my major bloodstain handiwork work by mixing up or overlapping the two types. Forearms? There’s a lot of work gone into creating those intricate blood trails there, so don’t go and spoil it by adding some distracting scourge marks as well, bar the merest hint. I’d also be very careful to keep scourge marks clear of the area on the dorsal side where the viewer expects there to have been long hair reaching down to the shoulders, especially as the latter itself is poorly imaged. Maybe the colleague who did the body image to simulate a sweat imprint felt it best to give the merest hint of a hair imprint, hair tending to trap sweat, perhaps, as distinct from facilitating its passage from scalp to linen. One then mentally compares one’s own mapping with the actual. Hmmm. Now that’s interesting, at least to this pair of jaded but still quizzical eyes. Might there be the makings of a book here? Nah.Too much by way of bare bones, not enough flesh for an entire book. It might make a magazine article though. Can anyone here suggest or recommend a suitable magazine targeted at history buffs in the the general population, available on news stands, preferably an online presence too? But would it accept a few thousand words from this gifted amateur (admittedly lacking solid academic credentials, sigh) on the “real” history of the Turin Shroud?.","date":"2015-01-29","mins":"3:07 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185076","author":"colin_berry","post":"Typo: “I for one shamelessly…”.","date":"2015-01-21","mins":"6:53 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-187021","author":"colin_berry","post":"Thanks Carlos. Here’s a Google translation: “The use of magnesium chloride in osteoarthritis, and similar processes, no scientific basis … ..but “works” in many cases, after long periods of administration. Would administer my wife as a crystalline powder one teaspoon a day (very bitter and may have a laxative effect) and I have indicated some of my best friends, always with good results that the usual medication is unable to obtain. With this dose no adverse effects.” Thanks for the interest. Probably best we stop there..","date":"2015-01-28","mins":"4:02 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185075","author":"colin_berry","post":"Yes, the TS image is elusive, or at any rate the one that people see with their own eyes on rare showings in Turin. That much we know because of the many statements that one has to stand well back (metres) to discern the form of a man, and that the image ceases to become visible if one gets too close. (I have to take the word of others for that, but see no reason to take issue). But that creates a conundrum, does it not? If the human eye cannot make out the image close up, then how can the camera do so? What is a camera, but a primitive eye? One has to assume there has been some playing around with lighting and exposure settings etc to give the photographic images upon which we amateur image analysts are so utterly dependent. There’s an upside to that too. If the original photographs have been doctored in some way to make them more understandable, then who’s to say we have been given the optimal settings (sorry Mario ; ). If for one shamelessly put Shroud Scope and Halta Definizione images into my MS Office Picture Manager, and often find there are effects that are interesting and possibly even scientifically significant (who knows?). So when a historian comes along and says that this or that part of the TS image is missing, be it hair on back of head or crown of thorns or loin cloth, the first thought that enters my head is “How can you know what’s there and not there, given you are restricted to the same images as the rest of us? Back in November of thereabouts I reported some interesting differentiation to be seen between hair and at least some skin body image that was best seen with the Halta image. I described a “two tone effect”, that may or may not have implications re mechanism of imaging (that need not concern us right now). I’ve just this minute put the Halta images from the BBC’s site back into MS Office to look again at the question of hair length in the dorsal image. Is anyone thinking what I’m thinking? Methinks there are no grounds for saying that the dorsal side image shows lack of hair, or short hair, least of all for claiming that long hair is absent. Oh, and while we’re discussing the head, there’s something worth noting re that “missing” crown of thorns. There was a posting on this site a while back about someone who thought there were horns coming out of the head, which was clearly based on a misinterpretation of the edges of a water stain. One wonders if some medieval artists made a similar error, but interpreted the water stain edges as thorns, or the remains thereof. As a general observation, if one’s to sustain the case for crucial parts of the image being missing through wear and tear, one has to demonstrate that the effect is seen elsewhere on the TS, and not just at one or two other ‘controversial’ sites like loin cloth (where artistic sensibilities play a role). Personally I see no evidence whatsoever for any major, generalized dropping off of image. To claim that a crown of thorns and/or loin cloth is missing through wear and tear is simply casual guess work. It’s not scholarship. Nor is it scholarship to claim that others will prove one right in the fullness of time, once there’s been a proper stocktaking and evaluation of the entire canon of Western devotional art. It’s the scholar making the controversial claim who is supposed to do that, or at least make a systematic start. MA and Ph D dissertations invariably require hard slog..","date":"2015-01-21","mins":"6:48 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185093","author":"colin_berry","post":"The lengthy preamble and context should surely have made it clear that it was photographed images> of the TS that were in the frame..","date":"2015-01-21","mins":"8:27 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185142","author":"colin_berry","post":".","date":"2015-01-21","mins":"12:08 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185127","author":"colin_berry","post":"“Imprint”? “Monochrome” ? “Negative quality”? Where on earth did you dig up these obscure and perplexing terms, Hugh? Spare a thought for your audience please, historians especially..","date":"2015-01-21","mins":"11:06 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185344","author":"colin_berry","post":"“To have the person in a loose shroud on a flat floor resulting in visible elbows on the dorsal side is of course an anatomically absurdity.” There was an opportunity for imprinting, real or simulated, before placing on a hard stone bench Henrik, one that medieval artists with a knowledge of scripture were aware, notably the juncture at which Joseph of Arimathea makes his first appearance, i.e. Tricky, cumbersome and no doubt messy transfer from the cross into an improvised fluid absorbent linen “stretcher”. There was ample opportunity for imprinting of those elbows (albeit notional) in the above painting. That same configuration we see above could also explain why the artist who produced the 1516 Lier copy decided to show a highly prominent imprint of the buttocks. That unexpected dare one say indelicate feature was alluded to shortly before Christmas by Hugh Farey, inviting us to speculate. Might the Lier artist have been assuming that imprinting occurred en route from cross to tomb? It would explain why blood, real or simulated, is so prominent a feature of what is routinely (misleadingly?) billed as a “burial shroud”. As I mentioned a while ago, there’s really no good evidence from scripture that Joseph’s linen was ever used or intended as such (quite the contrary in fact from the account in the non synoptic Gospel according to St.John)..","date":"2015-01-22","mins":"6:14 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-186312","author":"colin_berry","post":"You are absolutely correct, Thomas re the misreading of syntax. “Marks” is followed by “of” and then subclauses with more “ofs” which are clearly governed by the single priming reference to “marks”. Given the marks linked to scourging, nails and lance are not accompanied by the actual hardware that inflicted the wounds, the latter identifiable only by their respective blood signatures, there are no grounds for assuming that the “marks” left by a crown “of” thorns represent the crown itself. The writer was simply deploying a compressed style of syntax as a means of bookending the 4 different origins for the blood stains each inflicted by a missing object..","date":"2015-01-26","mins":"1:44 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185404","author":"colin_berry","post":"All I’m saying, Henrik, is that elbow imprints on the dorsal surface may or may not have been present originally, depending on events (authenticity) or modelling assumptions (medieval origin). That being the case, no firm conclusions can be drawn from the presence of elbows in later “copies” , not necessarily faithful to the original. When the region of the TS in question was obliterated by fire in 1532. It’s not just a single can of worms. It’s 2 or 3 cans of worms, not necessarily the same variety with no way of knowing which is which because the labels have been burned off and/or been re labelled freehand with marker pen by an unknown hand. Sorry, I couldn’t resist making the point that elbow imprints, had they been present, would square with prominent buttock imprints if the TS image had been imprinted on linen during transport to rock tomb before questionable burial rituals ones that may or may not have involved cleaning off first flow blood. Imprinting during transport makes medieval model building options a lot simpler to imagine, e.g.simple sweat and blood imprinting, through excluding more exotic resurrection linked phenomena (flashes of radiation etc). We down to earth sceptics who consider that a rerun of the radiocarbon dating would return essentially the same answer have to to seize the opportunity for point making when offered, given we have no exotic narratives up our sleeves with which to grab headlines..","date":"2015-01-22","mins":"11:41 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185322","author":"colin_berry","post":"Postscript to my earlier comment re the intrinsic unreliability (?) of what one sees, or thinks one sees, or thinks one cannot see, in photographs of the TS. I’ve just recalled that last year I suddenly remembered there was a scanner on my inkjet printer, and used it once or twice to record model scorch images, instead of my handheld digital camera. The results were at least as good, indeed better, which is perhaps not surprising if I’m right in thinking that electronic scanning dispenses with converging lenses and other optics, as well as using uniform strip lighting that is normal to the item being scanned. Does anyone here know how the Durante and Halta Definizione images were each obtained? Might one have been a photographs in the first instance, the other a scanned image? I seem to recall seeing a gantry/guide rail type arrangement mounted above the TS in 2002 pictures of the recording set up, but what was the mobile unit – a lens and camera or ‘merely’ an electronic photocell? What would be interesting at least to this neophyte Shroud researcher, aka Johnny Come Lately (thanks Mr.Rolfe) would be to find that one was photographed, the other electronically scanned. It might help explain the two tone effect seen in the Halta image (above) but barely detectable when I last checked Shroud Scope (Durante) images despite identical photoediting (same brightness/contrast/.midtone settings in MS Office Picture Manager). Maybe one system sees/detects things the other doesn’t. If scanning were superior, and the two tone effect scientifically significant, might there be an additional criterion that needs to be met in attempts to model the TS image (not that one welcomes making an additional cross for one’s own back)..","date":"2015-01-22","mins":"4:26 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185331","author":"colin_berry","post":"PPS: I should have researched scanners and how they operate before posting the above comment. In fact they do have a lens in the scanner unit. Apologies for that. But there’s another factor that may be relevant, apart from optical hardware. It’s the distance between the scanned object and the scanner sensor, which is bound to be much smaller than the case with point and shoot photography. Might a scanner be better able to detect subtle differences in the surface, especially superficial ones that escape conventional digital photography? Oh, and I meant to say “making a rod” not cross for one’s own back..","date":"2015-01-22","mins":"5:23 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185448","author":"colin_berry","post":"Houston (or rather Mario and fellow IT/imaging experts): we have a problem: Haltadefinizione site (see link above): “HD digital photography by Haltadefinizione® is an indispensable tool for researchers who wish to access anytime to unique images of the Shroud and process them in real time” Mario (above): This photo file has never been shown publicly (at the resolution taken), not even on the app Shroud 2.0, although many people think so. What is on Shroud 2.0 is a lower resolution. It’s described as an “indispensable tool for researchers”, as indeed it probably is. But is it available to researchers? If so, then why no details on the Halta site about how to gain access, beyond those relating to the feeble Shroud 2.0 (a damp squib if ever there was).?.","date":"2015-01-22","mins":"3:16 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185451","author":"colin_berry","post":"Correction: The Oxford Group, not Movement. (The two are often confused)..","date":"2015-01-22","mins":"3:37 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-186323","author":"colin_berry","post":"Acknowledgement of error? Not quite yet, Thomas, but maybe realization will dawn shortly:.","date":"2015-01-26","mins":"3:18 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185443","author":"colin_berry","post":"Might one assume that it’s the concept that is being targeted, daveb (imprinting at transport)? Are the details of that hypothesis being scrutinized and filtered to oppose a perceived agenda? No agenda (on my part). The route to a sweat/blood imprint of a crucified man, probably modelled by an entrepreneurial medieval artisan, 13th/14th century, came directly from a consideration of the TS image characteristics (and radiocarbon dating). Checklist: faint negative image with bloodstains, 3 D properties, scorch like spectral signature, suggestive of a contact imprint. No evidence of pre interment preparation or post mortem decomposition, least of all irradiation by energetic sub atomic particles. If it looks like a sweat/blood imprint, real or modelled, then it probably is one (stripping out the 20th/21st century interest initiated by the David Rolfe with his carefully crafted, mystery mongering “Silent Witness”, 1978 and coordinated Sunday Times Colour Supplement feature). Yes, the latter turned this head too, but only for 33 years. Scales finally fell from this Johnny Come Latelys eyes. It’s taken all these years to learn DR’s real theist moral rearmanent agenda (is there still an Oxford Movement?). Good luck to him I say. Some of us prefer to hang loose on those issues that so preoccupy our unanointed ‘Bishop of Beaconsfield’..","date":"2015-01-22","mins":"2:55 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185780","author":"colin_berry","post":"Here’s what appeared at the end of the 1989 Nature paper: https://www.shroud.com/nature.htm Conclusions The results of radiocarbon measurements at Arizona, Oxford and Zurich yield a calibrated calendar age range with at least 95% confidence for the linen of the Shroud of Turin of AD 1260 – 1390 (rounded down/up to nearest 10 yr). These results therefore provide conclusive evidence that the linen of the Shroud of Turin is mediaeval. The results of radiocarbon measurements from the three laboratories on four textile samples, a total of twelve data sets, show that none of the measurements differs from its appropriate mean value by more than two standard deviations. The results for the three control samples agree well with previous radiocarbon measurements and/or historical dates. Here’s what (arguably) should have appeared: The results of radiocarbon measurements at Arizona, Oxford and Zurich yield a calibrated calendar age range with at least 95% confidence for the 3 contiguous samples of linen assigned to each of the 3 laboratories from a chosen corner of the Shroud of Turin of AD 1260 – 1390 (rounded down/up to nearest 10 yr). These findings, while demonstrating that the sampled linen of the Shroud of Turin is medieval, may or may not be confirmed for the entire Shroud: further testing from a larger number of sites, some less peripheral, closer to image bearing areas, will be needed to confirm these preliminary data. The results of radiocarbon measurements from the three laboratories on the four textile samples, a total of twelve data sets, show that none of the measurements differed from its appropriate mean value by more than two standard deviations. A more rigorous and detailed statistical treatment of data, while desirable, is unfortunately not possible, given the non randomised apportionment of contiguous samples to each of the three laboratories. Having acknowledged the limitations of the sampling frame, and the preliminary nature of the dating exercise, the results for the three control samples appear to agree well with previous radiocarbon measurements and/or their independently measured historical dates..","date":"2015-01-23","mins":"3:22 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185915","author":"colin_berry","post":"Illegitimi non carborundum..","date":"2015-01-24","mins":"4:11 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"}]
