[{"id":"comment-36974","author":"colin_berry","post":"Jesterof : 2 colinsberry ( I am glad you lifted up your self imprisonment))) http://www.ncbi.nlm.nih.gov/pubmed/16556678 Never mind self imprisonment. I simply have a low threshold for pseudo science. According to your version of genetics (XX genotype) , what the Roman centurion should have said was “Truly this transvestite was the Daughter of God”..","date":"2013-06-14","mins":"1:14 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36984","author":"colin_berry","post":"You are Fabri Oksana MD, with your initial medical training in the Ukraine. Back in the 80s. Http://ww2.doh.state.fl.us/irm00 Profiling/profile.asp?Lic Id=102020&Prof NBR=1501&External=TRUE I believe you currently hold a position in a Florida hospital as an anaesthetist (UK description). That does not make you an expert on all matters relating to physiology, biochemistry and genetics..","date":"2013-06-14","mins":"1:51 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36979","author":"colin_berry","post":"I never used to have any opinion regarding Ukrainian pre clinical training (Soviet era) – but I do now. Kindly stop bullsh*tting the site, even if preferable (slightly) to trolling..","date":"2013-06-14","mins":"1:37 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36992","author":"colin_berry","post":"I’ve said what I want to say, and will again take my leave. But rest assured that pseudoscience here or elsewhere will not go unchallenged, no matter what kind of ad hom is directed against me. (What kind of medic – least of all an anaesthetist is able to diagnose mental disorder in folk whom they encounter on web forums? And even if that were possible, how professional is it to make instant diagnoses? Sorry, ‘jesterof’, but you are doing no favours whatsoever to those who provided your qualifications for practising any kind of medicine in your adopted country, namely the USA. Seems to me you have brought some Soviet era nastiness with you)..","date":"2013-06-14","mins":"2:49 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36999","author":"colin_berry","post":"From your 2009 profile (see link above): Publications This practitioner has not provided any publications that he/she authored in peer reviewed medical literature within the last ten years. In other words, there is no evidence that you have ever done any independent research, certainly not published, yet you attempt to belittle someone whose researches are easily retrievable from Google, and which have been widely cited in other people’s papers. You lady should learn some manners – and STOP THE TROLLING..","date":"2013-06-14","mins":"4:49 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-305","author":"colin_berry","post":"This comment has just appeared on Dan Porter’s shroudofturin site. I shall address only key points right now, since I’m busy on other aspects: June 22, 2012 at 5:25 am | #22 Reply | Quote To «anoxie» If you have any doubts on scientific questions concerning bloodstains my advice is not to ask Dr. Colinsberry because he’ll always provide misleading answers with the aim of discredit the Shroud. You had better read previous excellent post on this blog concerning Shroud bloodstains by medical immunologist Dr. Kelly Kearse. My husband is a medical doctor and he read all Drs. John Heller and Alan Adler’s papers on blood issue in their book «The Orphaned Manuscript». This book contains several papers by these investigators most of them published in «peer reviewed» scientific journals and the conclusion is crystal clear, Shroud red stains are not red ochre and vermillion in a collagen tempera, actually they are blood. Inasmuch, Professor Adler and Dr. John Heller did nor perform just the Hydrazine test that Dr Collinberry described in a very confusing way. They actually tested not one but several samples from red stains and also studied red stains from human blood on fabrics as controls. The finding of hemoglobin characteristic spectra, other spectrometry data, detection of blood proteins, bilirrubin and other blood components enables them to conclude that there is indeed blood on the Shroud. Italian forensic investigator Professor Baima Bollone obtained similar results working with material collected from other locations on the Shroud. BLOOD ON THE SHROUD IS NOT A GUESS IT IS A SCIENTIFIC FACT. Kindest regards Maria da Glória Centro Português de Sindonologia My reply: Kelly Kearse’s contribution, which I was the first to commend, was primarily about the methodology of ABO blood testing, it touched only briefly on the protocols used for the Shroud, so who is being misleading here? re Alan Adler’s protocols: it’s easy to be impressed by lists of the tests he did perform to confirm “real” blood, albeit degraded. But one has to be a specialist in the area of tetrapyrroles, whether cyclic, like the porphrins, or linear like the bile pigments, to know that uv.visible and fluorescence spectra alone do not provide proof positive. For two years I was a bile pigment specialist, working on Philadelphia on the phototherapy of neonatal jaundice, and teamed up with a then major drug company (SKF) to use state of the art methodology for identifying bilirubin photo derivatives. Key among those were initial thin layer chromatography, followed by derivitization to form volatile TMS derivatives, followed by mass spectometry. We were not content to look just for finger printing fragments – we regarded detection of the molecular ion as our goal. That was in 1972, well before the STURP studies, but nowhere have I seen Alan Adler using such rigorous methodology to confirm that he was detecting porphyrins, as distinct form substances with porphyrin like spectra and fluorescence. Nor have I seen any real evidence for the existence of bilirubin, apart from diazo reactivity and fluorescence. Why no chromatography? Why no mass spec? Why inflict a quirky conjecture involving a trauma induced bilirubin and “para hemic” methaemoglobin to explain the permanent red colour of the “blood”? That is not science – that is daydreaming and pure fantasy. So sorry, Madam, I am not taking lectures from you or anyone else on scientific methodology and credentials (though I thank you for pointing out that I hold a doctorate) .As for your suggestion that I “always provide misleading answers etc”, it is your own partisan position that is shown up here, not my own, as anyone reading my EXPERIMENTAL postings over the last six months, invariably backed with ample photographic evidence and couched in moderate language should prove beyond all reasonable doubt. Colin Berry aka sciencebod.","date":"2012-06-22","mins":"10:02 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","title":"It’s clever, some might say pretty, but is it science?"},{"id":"comment-36971","author":"colin_berry","post":"Beard?.","date":"2013-06-14","mins":"12:59 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-240","author":"colin_berry","post":"Thanks for calling by Charles. I’ve been an admirer of your comments on The Other Site these last two or three weeks (please don’t go, at any rate not just yet – you come as a breath of fresh air, with a welcome hint of carbolic vapour). You bring an academic rigour that is so often lacking in Shroudology – in stark contrast to the other kind of rigor, single issue rigor mortis so frequently on display there. Re historians: there are those who, like yourself, have ideas, and then write books, and there are those who write books (for a living) and then have ideas, naming no names. Thank goodness for Kindle, which spares me having to part with double digit money only to find I have bought yet another “Tale of Mystery and Imagination”..","date":"2012-05-01","mins":"11:33 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","title":"It’s clever, some might say pretty, but is it science?"},{"id":"comment-174","author":"colin_berry","post":"Message to MPH: enough is enough .I have consigned that last comment of yours to the Word Press trash bin. Now if you don’t mind kindly stay away from my site. Thank you..","date":"2012-04-21","mins":"4:09 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","title":"It’s clever, some might say pretty, but is it science?"},{"id":"comment-170","author":"colin_berry","post":"Annotated version now added to the post. Some of it is may not be crystal clear – especially the section on clotting/exudation, where I had difficulty in following the train of argument or where it was leading (I wonder if there was not a typo in the original with “bilirubin” being entered when maybe methemoglobin was intended).","date":"2012-04-21","mins":"8:32 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","title":"It’s clever, some might say pretty, but is it science?"},{"id":"comment-171","author":"colin_berry","post":"Anyone tempted to think I make too much of Adler’s ingenuity and creativity, or over rate the impact his ideas had on impressionable or receptive minds, needs only to read the following, written this year by Barrie Schwortz no less: By Barrie Schwortz ©2012 STERA, Inc. The Prelude Speaking on the telephone with Dr. Alan Adler, STURP blood chemist, was always something of an adventure and every conversation was a truly unique experience! (Anyone who knew him can verify this). Sometime in mid 1995 I was having one of my regular telephone conversations with him, not realizing that this conversation would ultimately prove to be one of the most significant in my life. At the time, I was still not completely convinced that the Shroud of Turin was authentic (and it was eighteen years after I had held it in my own hands)! Although the STURP data had clearly proved that the Shroud was not a painting or a photograph or a scorch or a rubbing, we had been unable to determine a mechanism that could create an image with those specific chemical and physical properties. However, based on the data we did have, I didn’t believe for a moment that the Shroud of Turin was a medieval “hoax!” I stayed abreast of what was happening in the Shroud world, but there were still many unanswered questions and one of the most important ones was that no one had ever properly explained, (at least to me), why the blood stains on the Shroud were still reddish in color. When the Shroud was first put before us in 1978, Vern Miller and I stood side by side over the cloth and we looked very closely at some of the dense red blood stains found there, and then at each other. I guess we could both see the doubt in each other’s eyes, since we were both nodding slightly to the negative. We had each noticed the red color of the stains and we both believed that old blood was supposed to turn black or brown over time (and Vern had much more forensic experience than I did). If these stains were that old, why were they still red? Truthfully, at first glance, the stains did not really look like blood. We discussed it quietly and agreed that this observation cast some serious doubt on the validity of the stains. In my case, it was the last serious piece of the puzzle that kept me from accepting the Shroud as authentic. Now, eighteen years later, the subject of the red blood came up during this conversation with Al and I told him it was something of a “deal breaker” for me. As I look back on that conversation today, I am puzzled as to why I had never asked him about this before. He was the most logical person to have discussed it with as he was the top blood expert on our team and had done the chemical analysis that proved the blood was actually blood. Yet, for some reason, it never came up until that moment. I guess the 1988 radiocarbon dating results had pushed everything else off the table. It was then that Al Adler gave me the answer! He explained that extended torture, like that suffered by the man on the Shroud, causes the breakdown of the red blood cell walls and the flooding of bilirubin (an enzyme produced in the liver) into the bloodstream. Apparently, blood of that nature will remain red forever! There it was: a simple, straightforward answer from the expert. I can’t remember exactly how long after that conversation I took to reflect on everything before making the decision that there was only one answer possible about the Shroud: it had to be authentic. I remembered Sir Arthur Conan Doyle’s axiom spoken through the lips of Sherlock Holmes, “If you eliminate all the possibilities, whatever remains, no matter how improbable, is most likely the truth.” Based on that logic, there was only one answer possible. I had spent years studying the science of the Shroud and its image. After all that time, the scientific evidence had actually convinced me the Shroud of Turin was authentic! It was really something of a shock. Https://docs.google.com/viewer?a=v&q=cache:rx L–e XYIN0 J:www.shroud.com/pdfs/history.pdf+&hl=en&gl=uk&pid=bl&srcid=ADGEE Sg Q Dszi3 Km F4 Nq T Fin Zap Iw ZRW Ar V6p2gt5 X Agy Af D Jj W2 A Cu Bk Iv E Qll H Vi X Xdy S Jf T81x Nr0n Xduuu Yyn G Wfs GXECYUBD P Pwaf Nwq YQX Zc04ki S Wkk MKF Ty O Ve O WH Et2 G&sig=AHI Etb Qpf S7 Ew9 byx9j LKUTN0am Jr0g AQ.","date":"2012-04-21","mins":"9:39 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","title":"It’s clever, some might say pretty, but is it science?"},{"id":"comment-169","author":"colin_berry","post":"Afterthought: tomorrow I might try adding a simpler version of Alan Adler’s account, one that is less intimidating to those without a specialist chemical background. I think it important that technical terminology should not be allowed to deter folk from appreciating the kind of reasoning that has been employed in that argument, so as better to decide for themselves whether it’s a scientific argument or whether it is something that, whilst showing a degree of ingenuity, is not in point of fact scientific (at least without additional supporting data)..","date":"2012-04-20","mins":"9:55 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","title":"It’s clever, some might say pretty, but is it science?"},{"id":"comment-242","author":"colin_berry","post":"My first acquaintance with the Shroud was back in the late 70s. It was a big feature in the Sunday Times magazine, coming close on the heels of the David Rolfe “Silent Witness” documentary, and the Mandylion connection was one of the several persuasive aspects of the article. Thirty or more years on I am able now to see how this myth has come about, and it has numerous compelling aspects that have contributed to its staying power. I am presently preparing a post on that negative image that transforms into the ghostly luminous positive that I suspect has turned a lot of minds – initially my own included. For now, I’d simply ask this. How could an unattractive negative image have been framed as the fabled Manydlion, and then enchanted the early Church to the extent of inspiring the iconic image of Christ, when no one had ever seen the positive image, only achieved in 1898 with silver salt photography? What’s more, there is a logical contradiction here. We are constantly told that no medieval artist would have attempted to paint a light/dark reversed negative, which is true (few modern artists attempt it either), yet we are asked to believe that a negative image (which I believe to be a branded “scorch” off hot metal or ceramic) was “seen” through the eyes of pre medievals as if magically transformed into an image of a haunting soft focus image of Christ. I agree with you entirely. The Wilson hypothesis may have hit the jackpot in terms of book sales through accounting for a huge 500 year (?) gap in the history, but it never made sense to this science bod in “pre photography”/scientific terms either , and I am glad that a respected historian like yourself has established that the history is bunk too. PS: My two sons both did history degrees. I like to think that some of their father’s respect for history (with respect for primary sources) rubbed off on them….","date":"2012-05-01","mins":"2:20 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","title":"It’s clever, some might say pretty, but is it science?"},{"id":"comment-247","author":"colin_berry","post":"I don’t know about you, Charles, but I knew most of the answers in advance to Dan Brown’s conundrums, simply though reading for interest, and thought the entirely literary device of the granddaughter having to follow an IQ obstacle course was too ludicrous for words. My dismay at the advance of New Age Impressionabilty was confirmed on a visit to the Louvre with hordes of Da Vinci Code tourists ticking off one more stop, presumably the New Age Pyramid, on their supposedly ‘historica’l trail of the grand daughter and then that of the preggers post Crucifixion Mary Magdalene who landed up in France, just in time to found the Merovingian dynasty….","date":"2012-05-01","mins":"4:06 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","title":"It’s clever, some might say pretty, but is it science?"},{"id":"comment-245","author":"colin_berry","post":"You’ve reminded me that it was your comment that alerted me to the strange, not to say questionable, provenance of That Thread from the Middle. In fact I copied it to file, the highest accolade this science bod can pay a non scientist (now upgraded to honorary scientist). There is indeed a book that desperately needs writing, before the entire world goes mad with New Age pseudo science. Maybe it needs dual authorship (fronted by a published historian with a no nonsense scientist in support role). Oops, sorry, that’s the opportunist part of me getting above himself… ..","date":"2012-05-01","mins":"3:14 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","title":"It’s clever, some might say pretty, but is it science?"},{"id":"comment-2201","author":"colin_berry","post":"Correct me if I am wrong, but you seem to be saying “OK, it’s been touched up. So what? It could still be genuine. Prove to me that there are not the remnants of real 1st century blood under various additions, even things as mundane as medieval artists’ pigments.” Obviously I cannot. Such an exercise would be hard enough if there were free access to unlimited TS material. Thanks to the presumption that the shroud is holy, or might be holy, or could just conceivably be holy pending conclusive evidence that it is not holy, then we are prevented from testing the a priori assumptions that prevent us from testing … if you see what I mean. Arguing with the authenticists is becoming more and more like arguing with flat earthers. It all comes down to insistent demands to provide incontestable evidence, nay proof that it is 1st century, and even radiocarbon dating is then fair game for the “I challenge you to prove me wrong” tendency (invisible re weaving etc). But I’m sure I don’t need to remind you that science does not work on that basis. Science prefers to focus attention on the genuine anomalies, the ones that yield fresh data and clues. There’s no scientific kudos to be had for constantly banging one’s head against a brick wall, for persevering with lines of enquiry that lead nowhere..","date":"2013-07-19","mins":"7:41 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/ok-so-there-is-bilirubin-in-the-shroud-bloodstains-or-so-we-are-told-but-how-much-precisely/","cat":"alan_d_adler","title":"OK, so there is bilirubin in the Shroud bloodstains (or so we are told). But how much precisely?"},{"id":"comment-996","author":"colin_berry","post":"I suspect it takes a lot more than amputation, or even “trauma” to elevate bilirubin. It’s understandable that should happen in foot strike injury where the red cells are subject to mechanical stress and undergo haemolysis, but to read some of the Shroudie literature, most emanating from Alan D Adler – a man with a limitless imagination – one could be forgiven for thinking that any prolonged trauma induces severe jaundice. That’s news to me… What could be the mechanism? Scourging, maybe, but if that is primarily damage to superficial blood capillaries, would not most of the damaged red blood cells simply bleed out, rather than return to the venous circulation (how could they if the capillary vessels are damaged?) Returning to what you said in an earlier comment, Hugh “6) I read somewhere that pink fluorescence might be due to the charring of the cloth in the absence of oxygen. I tried heating a bit of linen tightly wrapped in tinfoil, and also inserting it into a test tube with boiling water in the bottom (driving out the air). Fluorescence remains firmly greeny yellow.” I seem to recall a chemistry experiment in which something was heated in sand to exclude oxygen. It may have been to make charcoal, or perhaps something more exciting. Maybe that would be worth a try Incidentally, I suspect that some scorching from templates is effectively anaerobic – evaporation of adsorbed linen moisture and then pyrolysis generating steam etc that, having nowhere to go except through the interstices of the weave to the underside, effectively flushes out oxygen along the way. But oxygen may be needed to get certain classes of pyrolysis products or reaction pathways with more or less fluorescent products, maybe some fluorescing red, some green. Plenty there to occupy the experimentalist. The field is clear (I discovered early on in my research career that my eyes are very sensitive to uv, of which there was a great deal in the intense light source I used for my phototherapy studies – a high pressure mercury lamp – ostensibly for uv – from which I had removed the filter to get the visible light). Incipient retinal damage (and bad headaches) was what the optician said – so I’d advise you to take care… Maybe ordinary specs filter out most of the uv, as they are supposed to theoretically, but they didn’t protect me….","date":"2012-10-24","mins":"3:17 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/ok-so-there-is-bilirubin-in-the-shroud-bloodstains-or-so-we-are-told-but-how-much-precisely/","cat":"alan_d_adler","title":"OK, so there is bilirubin in the Shroud bloodstains (or so we are told). But how much precisely?"},{"id":"comment-2086","author":"colin_berry","post":"Hello again Adrie Yes, I see it has Google’s fingerprints all over it – or should that be tentacle imprints, despite there being no formal link up between Word Press and Google that I am aware of. That in itself is enough to make me wary. I’ll keep the comments option open for as long as possible, but would not be surprised to find myself shut out of my own blog, such is the increasing extent of control freakery where the online world is concerned. Forget about the touching concern for our security: they are all looking for connectedness and the commercial spin off that goes with it, needless to say. They want the world to be one big social network. No thanks. I like a degree of privacy and I like to be in control of my own opt in decisions. It’s been interesting hearing from you Adrie. While we differ in our standpoints, I have been hugely impressed with your eye for detail..","date":"2013-04-06","mins":"11:22 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/ok-so-there-is-bilirubin-in-the-shroud-bloodstains-or-so-we-are-told-but-how-much-precisely/","cat":"alan_d_adler","title":"OK, so there is bilirubin in the Shroud bloodstains (or so we are told). But how much precisely?"},{"id":"comment-2084","author":"colin_berry","post":"I’ve just received an email from Word Press that begins as follows: Just Another Word Press Weblog ← Freshly Pressed: Friday Faves Greater Security with Two Step Authentication We know your blog is important to you, and today we’re proud to announce Two Step Authentication: an optional new feature to help you keep your Word Press.com account secure. For those of you who use Two Step Authentication with your Google account, you’ll know how useful this feature is for keeping your account secure. Two Step Authentication works like this: when you log in to your Word Press.com account, we’ll prompt you to enter a secret number. To get that secret number, you’ll need to download the Google Authenticator App on your smartphone. It generates a new number every 30 seconds, making it virtually impossible to guess. All you need to do is open the app on your phone, and type in the number it’s showing. If you don’t have a smartphone, you can instead opt to have the number SM Sed to you… …………………………….. As it happens I had already semi mothballed this site (maybe just as well). Don’t be surprised to find the site totally mummified next time you visit, or at any rate in suspended animation, given that I have no intention, now or in the future, of combining my internet and mobile/landline existences. We bloggers have to be extra security conscious – Word Press does not seem to appreciate that….","date":"2013-04-06","mins":"7:34 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/ok-so-there-is-bilirubin-in-the-shroud-bloodstains-or-so-we-are-told-but-how-much-precisely/","cat":"alan_d_adler","title":"OK, so there is bilirubin in the Shroud bloodstains (or so we are told). But how much precisely?"},{"id":"comment-2082","author":"colin_berry","post":"When I went to Philadelphia to work on the phototherapy of neonatal jaundice, all but one of the overhead strip lights had been removed from the lab.That’s because bilirubin is photosensitive – the very property that is exploited in phototherapy. I know that Alan D. Adler claimed there were “extraordinary” levels of bilirubin in Shroud bloodstains. Quite how he could have known that, given his rudimentary analytical procedures, is anyone’s guess, and why was a scientist using a term like “extraordinary”? Scientists are supposed to be precise and quantitative. I remain to be convinced that there is ANY surviving bilirubin in Shroud blood, and even if there were, I defy anyone to show it can link up with oxidized haemoglobin (methaemoglobin) to form a permanently red pigment.Bilirubin prefers to keep its own company (forming internal hydrogen bonds that account for its poor solubility in most solvents, except those like DMSO etc that disrupt hydrogen bonds). Sorry, but I deal in ‘hard’ chemistry and biochemistry. Adler had no business using STURP as a launch pad for his fanciful and far fetched speculation. Barrie Schwortz should stop proselytizing Shroud authenticity on the back of Adler’s bilirubin hunch that was in my considered view complete NUTS..","date":"2013-04-04","mins":"5:39 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/ok-so-there-is-bilirubin-in-the-shroud-bloodstains-or-so-we-are-told-but-how-much-precisely/","cat":"alan_d_adler","title":"OK, so there is bilirubin in the Shroud bloodstains (or so we are told). But how much precisely?"},{"id":"comment-12802","author":"colin_berry","post":"“…we can assume red traces are bloodstains…” Nothing can be assumed in science, anoxie… Always demand the evidence, no matter how many reputations may be compromised or damaged by doing so….","date":"2012-06-20","mins":"2:51 pm","url":"https://shroudstory.com/2012/06/20/berry-shroud-was-scourged-not-the-man-a-critical-look-at-faccini-and-fanti/","cat":"blood_studies","title":"Berry: Shroud was Scourged, Not the Man. A Critical Look at Faccini and Fanti"},{"id":"comment-12820","author":"colin_berry","post":"I did a critique of Adler’s ideas back in April, anoxie. Http://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its clever some might say pretty but is it science/ Remember – they are just ideas – yours, mine, Adler’s. Ideas tend to be ephemeral, from whomsoever they come. No need to get worked up ….","date":"2012-06-20","mins":"4:38 pm","url":"https://shroudstory.com/2012/06/20/berry-shroud-was-scourged-not-the-man-a-critical-look-at-faccini-and-fanti/","cat":"blood_studies","title":"Berry: Shroud was Scourged, Not the Man. A Critical Look at Faccini and Fanti"},{"id":"comment-12832","author":"colin_berry","post":"Mention the subject of image forming mechanism and you can be sure that Rogers’ name will be quickly invoked. Mention bloodstains and it’s Adler’s name that is mentioned. Mention them separately and it’s science, but mention them in the same sentence then it’s a problem of “social skills”. Any problem of “social skills” here is when people who have adopted pseudonyms start to get personal with those who have not. It’s an unequal contest – and one in which I wish to have no further part where this thread is concerned. No one seems willing to say precisely what is imaged when we refer to a scourge mark. Is it entirely blood, in which case it is a subset of “bloodstains” and presumably imprinted on the cloth at the same time as bloodstains, while having a distinctive morphology (dumbbells etc), OR is it an acquired detail of body morphology that is imprinted along with the rest of the body features, which just happens to have also acquired a thin film of blood to make it a hybrid marking on the Shroud – part image/part blood? Methinks there is a growing credibility gap where those “scourge marks” are concerned. But then some of us have been growing increasingly incredulous about “bloodstains” too from seeing how they look remarkably “image like” under the Shroud Scope, i.e. Confined to the ribs of the weave, with no penetration worth speaking of into the furrows. Time methinks to write another post, and to stop being mealy mouthed about something that is plainly a contrivance, and a very clever one at that, but simply does not stand up to close scrutiny, at least by those of us with limited social skills… ; ).","date":"2012-06-21","mins":"1:17 am","url":"https://shroudstory.com/2012/06/20/berry-shroud-was-scourged-not-the-man-a-critical-look-at-faccini-and-fanti/","cat":"blood_studies","title":"Berry: Shroud was Scourged, Not the Man. A Critical Look at Faccini and Fanti"},{"id":"comment-12813","author":"colin_berry","post":"No, Alan Adler analysed a sample which, solubilized in a ferocious chemical reagent (hydrazine) had a uv and visible absorption spectrum that he identified as “porphyrin”. But uv and visible absorption spectra, with their relatively few peaks and broad plateaux, are in no way a substitute for fingerprinting an organic compound, e.g, by infrared absorption spectra, by nmr absorption, or by glc mass spectrometry. Alan Adler not only omittted to do those three confirmatory tests. Instead, he proposed a theory that the permanent red colour of “blood” on the Shroud had amazingly survived despite centuries of exposure to light, air etc, and was the result of his novel hypothesis involving complexation between a trauma induced novel oxidation state of oxidised haemoglobin AND a trauma induced outpouring of bilirubin. Occams’ razor anyone? The trauma? Crucifixion – which we sceptics describe as “begging the question”. Sorry, anoxie, but you don’t know the half of it. I spent the first two years of my research career in Philadelphia studying the mechanism of phototherapy of neonatal jaundice, in particular the way in which bilirubin degrades when exposed to light and oxygen. The process takes hours, days and maybe weeks – but not centuries… The idea that Adler’s stress induced bilirubin stabilises his hypothetical “para hemic” trauma induced methaemoglobion to centuries of exposure to light and air is pure baloney… There, somebody had to say it… There has to be huge question mark over the claims of two of STURP’s most prestigious chemical researchers – Ray Rogers and Alan Adler. I write as a retired chemical/biochemical researcher. And you, anoxie?.","date":"2012-06-20","mins":"3:37 pm","url":"https://shroudstory.com/2012/06/20/berry-shroud-was-scourged-not-the-man-a-critical-look-at-faccini-and-fanti/","cat":"blood_studies","title":"Berry: Shroud was Scourged, Not the Man. A Critical Look at Faccini and Fanti"},{"id":"comment-12777","author":"colin_berry","post":"Your comment only makes reference to “bloodstains” anoxie? But did the STURP team include “scourge marks” in their scan of “blood stains”? If F&F are correct, then they ought to have done so. But did they? The quotation I have provided from that http://www.historian site would suggest that they did not. Had they done so, then iron would/should have been detected. That’s why I try to keep an open mind, and why I think we need a new map that shows unequivocally where ALL the iron is located on the Shroud, not just those puddly image areas that have been conventionally seen as “the bloodstains”. Thus the need for an iron map that definitely includes the “scourge marks” as well as sites of major haemorrhage. Perhaps you know of the existence of such a detailed and discriminating map. If so, I’d be interested to have a link. I note your advice, but would point out that my comment re x ray fluorescence was by way of a PS on a posting that addresses more immediate issues, like what one can see with one’s own eyes, especially now we have high resolution images at out fingertips..","date":"2012-06-20","mins":"8:55 am","url":"https://shroudstory.com/2012/06/20/berry-shroud-was-scourged-not-the-man-a-critical-look-at-faccini-and-fanti/","cat":"blood_studies","title":"Berry: Shroud was Scourged, Not the Man. A Critical Look at Faccini and Fanti"},{"id":"comment-12772","author":"colin_berry","post":"Houston, or rather anoxie, we have a problem. Http://www.historian.net/shroud.htm “The debate on the authenticity of the shroud became centered on whether the reliable presence of iron oxide was relevent to the shroud image and the “bloodstains” on the cloth and the precise nature and origin of the iron oxide. A part of the answer to this was provided by x ray fluorescent analysis performed by STURP… scientists … which determined there was no relevence between concentrations of iron oxide particles and the varying densities of the image.” Now compare that with F&F who state that numerically the scourge marks are “the most abundant bloodstains on the Shroud of Turin” (my italics) All blood contains haemoglobin. No matter how much that haemoglobin degrades over the centuries, it will always leave an iron “signature”, even if finally iron oxide. So how come the STURP team failed to detect iron if scanning the entire Shroud image with its 372 scourge marks? How come each scourge mark did not register as a hot spot for iron oxide, assuming that F&F are correct? I demand a recount….","date":"2012-06-20","mins":"8:02 am","url":"https://shroudstory.com/2012/06/20/berry-shroud-was-scourged-not-the-man-a-critical-look-at-faccini-and-fanti/","cat":"blood_studies","title":"Berry: Shroud was Scourged, Not the Man. A Critical Look at Faccini and Fanti"},{"id":"comment-12857","author":"colin_berry","post":"Enough of the time wasters, and that includes YOU, daveb, with that puerile and derogatory last comment. If there are those here who are genuinely interested in the science, as distinct from the tub thumping and/or point scoring, then they know where to find me. Colin Berry aka sciencebod.","date":"2012-06-21","mins":"6:28 am","url":"https://shroudstory.com/2012/06/20/berry-shroud-was-scourged-not-the-man-a-critical-look-at-faccini-and-fanti/","cat":"blood_studies","title":"Berry: Shroud was Scourged, Not the Man. A Critical Look at Faccini and Fanti"},{"id":"comment-29673","author":"colin_berry","post":"The posting is about an idea I proposed some months ago – a testable idea – a scientific idea – so I make no apologies for having a scientific background (though biomedical as it happens). If had to rank the plus points of the idea, strongest first, they would be: 1. Practical convenience – leech blood does not clot, and is probably a better, thicker consistency for painting on. 2. It would explain the absence of potassium (the leech disposes of plasma and its physiological electrolytes) 3. It might explain the atypical porphyrin spectrum 4. It might explain the unexpectedly bright red colour and its longevity. 5. It might explain the (apparently) strong signal for hydroxyproline in Shroud blood – not free HP, but protein HP (as leech collagen). I consider there are enough ticks in enough boxes to warrant a test of leech markers in Shroud blood, especially if, as I suspect, tests for Adler’s “bilirubin” with definitive analytical techniques (chromatography, mass spectrometry etc) were to prove negative, showing bilirubin has no role to play in the bright red colour. Medicine has a role to play in Shroudology – but only if one is approaching from a 1st century perspective. Mine is 14th century, post radiocarbon dating, where medicine has NO role to play. Without the corroboration that comes from radiocarbon dating, medicine is not just irrelevant – it risks being seen as snake oil pseudoscience…..","date":"2013-04-06","mins":"3:18 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29664","author":"colin_berry","post":"You cannot be serious. If connective tissue were as fragile as you suggest, needing constant re modelling, don’t you think we would have heard of it by now – in the form of sports injuries, lengthy recuperation periods? It seemed pretty tough stuff to me, years ago in zoology classes….","date":"2013-04-06","mins":"2:04 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29660","author":"colin_berry","post":"What our physician may not appreciate is that I was interested in the use that Rogers made of HP long before any thought of leeches had entered my head. Why was he suddenly talking about a large signal for HP in blood one moment, and then using the presence of that signal to dismiss any idea of scorching the next? Did he know that the meat industry used HP evolution as a marker for unheated meat (i.e. Heated meat would have already lost most or all its HP), and then go looking for it in blood? That seemed improbable and methodologically wrong – improbable because ordinary blood has trace amounts of HP only, and methodologically wrong because it is protein HP in peptide linkage that is easily volatilized. That suggested that Rogers had discovered a large signal corresponding to HP by accident merely by eye balling his pyrolysis mass spectrogram, and that having correctly identified it, then assumed it was normal for high levels of HP to exist in blood. (Whether he assumed the HP to be the free amino acid, or a serum protein with exceptionally high HP one can only guess, but on either count he would have been mistaken). Having this prominent marker he then hit on the idea of using as a ‘heated meat’ marker – which suggests he thought it was HP in intact collagen or similar. The only way that I could make sense of all of that was to assume that Rogers had indeed found a very strong HP signal in Shroud blood, far in excess of what one would expect in ordinary blood, fresh or certainly aged. So why was it there, and might it be linked with the another anomalies – like the atypical porphyrin spectrum, the paucity of potassium, the absence of discernible RBC membranes in particular? Having realized that a forger might have preferred to use partially digested blood from a leech, with its thicker consistency, anticoagulants etc, it was then natural to see if leeches were well endowed with collagen or other HP rich connective tissue, which indeed they are, so I have merely adduced Rogers’ presumed HIGH levels of Shroud blood HP as evidence of leech involvement. At no stage have I said that HP is not a constituent of normal human blood, indeed acknowledging from the outset that HP is a trace constituent, typically below 1mg% as I recall. I have yet to discover if Rogers gave a precise figure for his HP that would permit a decision on whether it was or was not in the likely range of human levels. However, there are quicker, easier ways of testing the leech hypothesis – i.e. To look for leech antigens in Shroud bloodstains. Maybe there are some left over sticky tape samples languishing in a lab somewhere that could be used for the test. If it’s negative, then one retired science bod is simply left with egg on his face. He shall no doubt survive such a grievous blow to his self esteem. If it’s positive, the Shroud blood could only have been painted on, making a major decorative feature linking it to the Gospel account invalid, and producing an answer consistent with the radiocarbon dating (which I for one have never doubted for one moment, feeling as I do that the image is simply a contact scorch, and that the bloodstains are too good, too immaculate, to be anything other than ‘painted on’. Christianity may have had more than one immaculate conception….","date":"2013-04-06","mins":"12:49 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29728","author":"colin_berry","post":"I cannot recall seeing a single critical comment on this site (not counting my own) directed at Adler’s bilirubin story – the one that took as its starting point the observation that the TS blood looked too red to be ordinary aged blood. Indeed, Adler’s bilirubin is cited and re cited as if unassailable fact, despite the fact that he never attempted to isolate what he called bilirubin, or measure it by its characteristic mass spectrum, relying instead on unreliable colour reactions in spot tests etc. When this one time bilirubin researcher comes along, and dismisses the bilirubin story on the grounds that the bile pigment could not possibly survive for centuries with intermittent exposure to light, being photosensitive – what happens? We’re told that the “too red to be blood” prospectus is simply a myth, and that even if not mentioned by name (why not?) all those who observers who have expressed surprise at the ‘redness’ – from 16th century Poor Nuns to Barrie Schwortz, to Alan D. Adler have all been in the grip of an optical illusion. Would we have seen our physician’s assault on the central tenet – i.e. That Shroud blood is redder than one might expect – if I had not proposed a new, non authenticity promoting explanation, and if Adler’s bilirubin story, you know, the one that just happens to promote authenticity, had remained the default explanation – one that Barrie M.Schwortz* likes to quote as having been for him the ‘clincher’? Answers on a postcard please. *you know the Founder and Director of the so called Shroud of Turin Educational and Research Association (Inc) and who is responsible for those ‘redacted’ versions of Adler’s and other STURP researchers’ work on the internet. (Apologies if my arguments are occasionally light on detail – but I am not willing to do business with any organization that claims to foster “education and research” while in fact promoting authenticity using arguments that I personally consider pseudo science, in the same way that I consider Adler’s bilirubin story to have been pseudo science, Rogers’ hydroxyproline story to have been pseudo science, and much else besides that has emanated over the years and decades under the imprimatur of STURP and STERA)..","date":"2013-04-07","mins":"3:37 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29732","author":"colin_berry","post":"“Colin, I’m not convinced by the bilirubin explanation, I don’t think Kelly Kearse has ever been either. So far there is no adequate scientific explanation.” Well, I guess that’s progress of sorts anoxie. What’s needed now is for Barrie Schwortz’s STERA to release into the public domain all of the data on “bilirubin”. That way, with a little precis writing from those of us who know our pyrroles from our porphyrins, folk should then be able to see for themselves that what was promoted as chemical inspiration, supposedly based on hard fact, was in all likelihood pure day dreaming and speculation based on candy floss data. One suspects there was more than a little playing to a gallery when that authenticity promoting explanation was conjured up for the waiting masses, the latter understandably hungry for some seemingly authoritative science, but unable to detect when a boffin with unaccustomed celebrity status had slipped back into blue sky mode..","date":"2013-04-07","mins":"4:52 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-12793","author":"colin_berry","post":"Some folk here seem to be evading the main issue. Are the scourge marks, the main focus of my posting, to be classified as “bloodstains” or not? Yes or no? If yes, on what evidence? Reminder: F&F say the scourge marks are numerically the “most abundant bloodstains” on the Shroud..","date":"2012-06-20","mins":"12:54 pm","url":"https://shroudstory.com/2012/06/20/berry-shroud-was-scourged-not-the-man-a-critical-look-at-faccini-and-fanti/","cat":"blood_studies","title":"Berry: Shroud was Scourged, Not the Man. A Critical Look at Faccini and Fanti"},{"id":"comment-29751","author":"colin_berry","post":"Am not sure if your comment is addressed to me or Hugh, anoxie. If me: 480nm is the range of blue light wavelength that needs to be absorbed for the solution to transmit remaining predominantly red light in the range you cite. Since it is Adler’s absorption spectra we are discussing, then 480nm is where one expects to see a prominent peak for his alleged Met Hb bilirubin complex, or as I would prefer to say, non complex, minimally cluttered with other absorption bands, if wishing to be confident of a blood red appearance..","date":"2013-04-07","mins":"10:31 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29733","author":"colin_berry","post":"Anoxie : … which doesn’t mean bilirubin is not part of the answer. The spectra obtained with addition of bilirubin and methemoglobin is non additive : http://img.springerimages.com/Images/Springer/PUB=Springer US Boston/JOU=10470/VOL=2008.56/ISU=1 2/ART=2007 9076/Media Objects/WATER 10470 2007 9076 Fig3 HTML.jpg As far as color is concerned, red means more relative absorption in blue/violet. That link makes the point better than anything I can say as to why all of Adler’s data need to be searchable and accessible online, and not just in copyrighted books and so called ‘Orphaned Manuscripts’ (redacted). The proposition being floated there is just plain ludicrous – namely that if mixing A and B reinforces absorption in particular parts of the spectrum – notably the blue/violet you mention – then regardless of what is happening elsewhere – you re assured of your intensification of red colour. One does not often meet intensely blood red colours in the laboratory, so when one does, it pays to look closely at the absorption spectrum. A simple model compound for “blood” is iron(III) thiocyanate, with the Fe(CNS) ++ ion. When you look at its absorption spectrum, there is a single almost symmetrical peak, centred approximately on 480nm: That’s the only kind of spectrum that guarantees that a compound will be blood red – one with a single peak at that value. I’m not saying that there cannot under any circumstances be secondary peaks or shoulders, simply that Adler’s mixing exercise is worthless unless one has a photograph of the end result – to be certain that a convincing blood red colour really has been achieved. A set of absorption spectra on their own tell one next to nothing – and can in fact be highly misleading. Do you think that mixing bilirubin and oxidized haemoglobin would produce an end result that was virtually indistinguishable to the viewer from fresh blood? Hugh Farey tried it – and just a few days ago reported here a negative result. Now there’s a surprise….","date":"2013-04-07","mins":"5:41 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29760","author":"colin_berry","post":"I was about to respond to anoxie in #132, which I think I must have missed earlier, when I spotted yours. It might take a little while to address all the points you raise, given the complexity of haemoglobin spectra. First, let me disabuse anoxie of one thing, namely that I have confused absorption and transmission spectra. I have done no such thing, and if anoxie would care to take a look at this link, it’s clear that the absorption maximum of both Hb and Hb O2 is in the 400s, ie. The blue part of the visible spectrum, exactly as one would expect of intensely red compounds, and consistent with the model compound I mentioned earlier, iron (III) thiocyanate: But one has to consider the “whole picture”, across the entire visible spectrum, namely that to get the most intense red colour, one wants not just maximum absorbance in the blue, but minimum ‘spoiler’ absorbance in the red. I.e. Maximum red transmission. If anoxie looks at those two spectra, it is clear that the largest difference between the Hb and Hb O2 absorption spectra is indeed at the red end of the visible spectrum where one might least expect it. In other words, Hb O2 has less of what I have above termed ‘spoiler’ absorption in the red end on the right of the displayed spectra. Methinks it is anoxie who has absorption and transmission confused, perhaps by looking too closely at the 600 700nm region, which is NOT where the absorption maxima lie. I may or may not have time to address your other questions today, having some other matters to attend to..","date":"2013-04-07","mins":"12:14 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29769","author":"colin_berry","post":"OK. While I’m here a small word of warning. Those plots need to be interpreted with great care. Note that the vertical scale on my link above is logarithmic. While the difference between the plots at 480nm may look small relative to that in the 600 700nm, region, it probably makes a much greater contribution to the perceived colour difference between arterial (Hb O2) and venous (Hb) blood. Replotting on a linear scale would emphasize that point. Put another way, the logarithmic scale tends to compress the high absorption end of the plot, i.e.the blue (left hand) end of the spectrum, despite that being the more crucial in producing the red colour that results predominantly from blue abstraction..","date":"2013-04-07","mins":"1:44 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29789","author":"colin_berry","post":"Now we are going round in circles – or would be if there were still two to tango….","date":"2013-04-07","mins":"4:11 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29784","author":"colin_berry","post":"Anoxie : … which doesn’t mean bilirubin is not part of the answer. The spectra obtained with addition of bilirubin and methemoglobin is non additive : http://img.springerimages.com/Images/Springer/PUB=Springer US Boston/JOU=10470/VOL=2008.56/ISU=1 2/ART=2007 9076/Media Objects/WATER 10470 2007 9076 Fig3 HTML.jpg As far as color is concerned, red means more relative absorption in blue/violet. OK, so this might be relevant to Adler and his dreamt up complex of methaemoglobin and bilirubin (or there again it might not). So somebody working in an entirely different field – subarachnoid haemorrhage – is trying to use bilirubin as a CSF marker for the condition, and is having trouble measuring it in the presence of methaemoglobin – the two appear to interact non additively. OK, there may well be an interaction, at least as determined spectrophotometrically. But that does not prove the existence of a binary complex. There can be numerous reasons why spectra change when you mix A and B that have nothing to do with 1:1 adduct formation. Were you aware, for example, that there is still uncertainty regarding the precise state of molecular oxygen that is bound to oxyhaemoglobin (and perhaps methaemoglobin too)? I have seen it described variously as superoxide ion or singlet oxygen. But bilirubin is a known scavenger of at least one of those – possibly both so all it takes is for bilirubin to de oxygenate an oxidized haemoglobin, and hey presto you have a (probably dramatic) spectral change, without there necessarily being a complex formed, or even a shift to a brighter red. The plain and simple fact is that Adler should have spared us all the spectrophotometry, and concentrated in the first instance on proving conclusively the presence of bilirubin in Shroud blood, which he signally failed to do. He should have used chromatography and mass spectrometry to demonstrate its presence. (Personally, I think the chance of it surviving centuries of exposure to light and oxygen to be essentially zilch.) Without that kind of hard analytical data, every word he wrote on bilirubin was pure speculation. Pardon me if I now bow out of this esoteric discussion on a highly esoteric proposal – one that I strongly suspect has no relevance whatsoever to the real world. Now, about that leech blood…..","date":"2013-04-07","mins":"3:54 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29802","author":"colin_berry","post":"Anoxie : What is needed is to analyse spectral data comprehensively as suggested by Kelly Kearse. There is certainly no simple answer such as “bilirubin”. Some might say there is no answer at all, simple or otherwise, if there is no bilirubin – the latter existing only in someone’s over active imagination. However, the analysis of spectral data is unlikely to lead anywhere, not just because of the passage of time, but because of the subtlety of haem spectra, even in fresh material, when you consider the host of modifying factors – the oxidation level of the iron (+2 or +3), whether the haem is linked to globin or not, the range of small molecules that can bond to haem iron – oxygen, CO2, CO, NO, H2 O etc. As I see it, there are two highly conflicting hypotheses regarding Shroud blood that would lead to very different outcomes in a relatively simple analysis. One is that the Shroud blood is not in fact whole blood, but a serum exudate from retracted blood clots. That means just a little haem, but a lot of serum protein. At the opposite end of the chemical spectrum, so to speak, one has my leech hypothesis that proposes a lot of haem, but only a tiny amount of serum (more correctly plasma in the situation where there has been no clotting). So what one needs to do is model those two processes, and measure, or rather estimate, the ratio of haem to serum protein. One then needs to re measure with robust technology for artificially aged blood specimens, taken from retracted blood clots versus leeches. It might be that (1) haem is measurable by the red fluorescence under uv of chromatographically separated free or esterified porphyrins after iron removal, and (2) serum or plasma proteins merely as micro Kjeldahl (amino/peptide) nitrogen, an approximate measure of protein nitrogen. If Shroud blood really is just haem coloured serum, a wishy washy exudate from retracted blood clots, which I somehow doubt, then there will be a large excess of Kjeldahl nitrogen over porphyrin. If it’s leech digesta (“blood paint”) then it’s the other way round – a large excess of porphyrin over Kjeldahl nitrogen. OK, so it only gives a ballpark answer, but at least it’s in a real life down to earth ballpark, as distinct from the confines of a fairy tale castle in the sky..","date":"2013-04-07","mins":"6:18 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29838","author":"colin_berry","post":"It’s a classic beginner’s mistake in science to suppose that the discovery of a new effect requires that everything go on hold while one determines the mechanism of that effect. The result as often as not is a string of flawed hyptheses. Nowhere do we see that better than with the “Shroud blood too red to be aged blood” effect. That caused Adler to pluck his bilirubin hypothesis out of the sky, and it has gummed up Shroudie literature ever since. If Adler had been the “blood expert” that some on this site claim him to have been (he wasn’t – he was a synthetic organic chemist, specializing in porphyrins something entirely different) he would never have invoked bilirubin, knowing its notorious photosensitivity, and have taken a different more constructive tack. The trick is to make those new effects work for one, while keeping the understanding of their mechanism on the back burner until one has a decent purchase. As often as not, the answer when it finally comes may look academic, compared with the interim spin off. Why not simply take the “too red” observation as one more piece of evidence that Shroud blood has some unexpected properties that do not chime well with it being ordinary aged blood? There are others that get far less attention than they deserve, notably the paucity of potassium or packed red blood cells (or recognizable debris therefrom). We also have that “serum exudate from retracted blood clot” hypothesis, nay mantra, that looks like a classic case of making facts fit a narrative, instead of the other way round. That has led to the absurdity of double counting – with folk claiming to see under uv a “serum halo” on the periphery of what they are already claiming to be a patch of transferred serum. What Shroudology needs is a big clear out of dud hypotheses – ones that no one can be bothered to test – that are being used purely to make a good pro authenticity story that can then be intoned drearily on this site as if written on tablets of stone. Start by acknowledging that being invited to join STURP did not turn otherwise competent specialist chemists overnight into world class scientists of Nobel laureate standing. It’s time their limitations were recognized, to recognize they were fallible, as can be seen from standing back, and taking a long hard look at some of the “ingenious explanations” and too clever by half arguments which they attempted to conjure up out of thin air…..","date":"2013-04-08","mins":"2:41 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29854","author":"colin_berry","post":"What price then the claim that the bloodstains arrived before the body image if there has been “touching up” in later centuries? The “blood first” dogma is central to authenticity. If just some of the bloodstains were later additions, one is entitled to ask whether ALL of them might not be artistic additions made by a medieval monk (say) with a paint applicator in one hand, and a New Testament checklist in the other… And if the blood is fake, then who’s to say the basal image isn’t also of medieval provenance, like, you know, a contact scorch from a heated metal or ceramic template or templates.?.","date":"2013-04-08","mins":"7:18 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29852","author":"colin_berry","post":"Give me quantitative over qualitative data any day – and you yourself acknowledged some months ago the non quantitative basis for Adler’s fanciful claims for bilirubin. Earlier I suggested that one shelve the study of spectral shifts – there being too many different influences at work – some obvious, some less so – and concentrate on measuring a simple but informative ratio – total porphyrins / total serum/plasma proteins. If the ratio were found to be low, then that would be evidence for the view that it’s not whole blood, but a wishy washy serum exudate. Or it might be the expected ratio for whole blood. Or there again, the ratio might be higher than one would expect for whole blood. My money’s on it being the third, thanks to some creative artwork by that Brother Hirudo..","date":"2013-04-08","mins":"6:41 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29863","author":"colin_berry","post":"Do you means authentic versus non authentic? If so, why trivialize the issue by presenting it merely as a replay of a spat from 30 years ago? Did Mc Crone and Adler between them have the last word to say on the issue of authenticity? Their dispute centred as I recall mainly on iron(III)oxide, and whether its presence was a marker for ochre artist’s pigment or degraded haems or retting acquired impurities. Nobody has mentioned iron oxides thus far on this thread, so let’s draw a line under that and move on, shall we?.","date":"2013-04-08","mins":"9:06 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29881","author":"colin_berry","post":"Well, I’m sure I don’t need to remind you Dr.Kearse that one does not need to be a University professor in order to follow an analytical protocol involving mainly forensic type tests. In fact that kind of work is often best left to people who do nothing but those kinds of tests, and get very expert at doing so. Having said that, I acknowledge that Prof. Adler might have wanted to take a hands on approach, given the limited amount of material available. Look, it’s not my intention, now or ever, to give any kind of overview of his entire career, certainly not to write things that might give offence to his surviving relatives. My concern is purely with the specifics, and with the use that he made of his data in his various high profile summaries detailing his STURP involvement. Even then, I would confine myself to a light touch commentary, pointing out just one or two features that strike me as quirky and in some instances disturbing. Here’s a case in point. Everyone is familiar with what Adler wrote in his Orphaned Manuscript, published in 2002, claiming that the unusual and centuries old red colour of Shroud blood was the result of oxidized haemoglobin forming an association with bilirubin. There was no mention made there of the most elementary property of bilirubin, namely its photosensitivity and chemical instability to light. So was Adler unaware of that? Answer: NO! Here’s what he was saying earlier in 1999 when discussions were taking place on the best way to conserve the Shroud:. Note the last paragraph (bolded) “Getting it (the Shroud) conserved properly is NOT a trivial problem!” Dr. Alan Adler Richmond Shroud Conference June, 1999 This remark was made in response to a Panel on Imaging held as a part of the Conference. The panel participants (Messrs. Grundfest, Propp, Schumacher, Schwortz, and Whanger) had made several remarks pointing out the potential for light to induce potentially damaging changes on the Shroud. Dr. Adler expanded on the panel’s comments with the following comments of his own: Bilirubin, which is found in the bloodstains on the Shroud, is NOT light stable. Every time it’s illuminated, whether by ambient light, fluorescent light, photographic imaging lighting or even a flashbulb, the clock runs down to the time when the bilirubin will change in color. Further, the effects of these light induced chemical changes on the adhesion of bilirubin to the linen is not known and could be detrimental. Here is a scientist who knew in 1999 that bilirubin was chemically unstable, yet 3 years later was stating almost as fact that it maintained the red colour of blood when one expects the latter to go brown or black. It is the latter that people remember, the “ingenious idea/discovery” that everyone quotes, including the authenticity promoting founder of STERA, stating that the bilirubin effect was for him the clincher. Yet by Adler’s own admission it was a complete non starter in chemical terms. Sorry, call me old fashioned if you like, but I have zero tolerance for pseudoscience, especially Shroudie pseudoscience that as we know is agenda driven. Adler’s attention grabbing bilirubin story was not only pseudoscience, but Adler himself KNEW IT, and made it the punch line in his personal Shroud memoirs. The more I learn about certain STURP celebs and their M Os, the less I like… When the curtains opened, they did not want to disappoint their fan base, did they? PSEUDOSCIENCE!.","date":"2013-04-08","mins":"10:49 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29903","author":"colin_berry","post":"Shroudenigma : I don’t see how over painting the blood stains would have any impact on the initial stain and its prior appearance on the cloth to the body image. Any evidence that the Shroud had been over painted would totally and fatally compromise the proposition that its “original” bloodstains had been acquired 20 centuries ago. That’s unless you know of a foolproof means of distinguishing between 14th and 1st century blood. There’s also the small matter of the bloodstains all looking much the same from head to toe. Place a question mark against just one of them, and you place question marks against all..","date":"2013-04-08","mins":"3:04 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29922","author":"colin_berry","post":"We’re not in the TV studio now, you know, attempting to score easy debating points. Look back through this thread, and you will see it’s about the chemical nitty gritty, not adversarial point scoring..","date":"2013-04-08","mins":"4:18 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29913","author":"colin_berry","post":"“It’s not my intention either I don’t think discussing the data objectively is demeaning, it’s part of helping to push the science forward. Some might wonder how an accusation of “pseudoscience” might be perceived in this context. ” How could the entirely speculative implication of bilirubin (“extraordinary” levels thereof arising we were told from crucifixion trauma) be seen as pushing science forward when the initiator of that idea had previously acknowledged that bilirubin is photosensitive and chemically unstable? Was that not perverse and misleading? Some might consider my label “pseudoscience” to be over polite. Spectral results? The anomalies in the porphyrin spectra must have been profound for a porphyrin specialist like Adler to have felt obliged to invoke not just trauma induced bilirubin but trauma induced ‘para hemic’ methaemoglobin too (I’m still trying to find a reference to the latter outwith the Shroud literature). When there’s an exotic porphyrin spectrum, the like of which Adler had clearly never been seen before, don’t you think it’s up for grabs, and that anyone with a chemical background is entitled to seek alternative explanations, especially those that don’t have qualifying assumptions (like acute physiological trauma)? I had simply kept that anomaly at the back of my head for some months until (challenged on this site to provide an explanation) I had wondered what a forger might have used as a source of non clotting blood. As soon as the L word entered my head, an explanation for the peculiar spectrum followed in short order, and for other anomalies too – like the paucity of potassium, the virtual absence or red blood cells (lysis?)… One thing leads to another… That’s sciencebiz for you..","date":"2013-04-08","mins":"3:55 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29931","author":"colin_berry","post":"Please let’s avoid inquisitions about precisely what I have or have not read. I’ve told you the kind of data I consider crucial, and the kind that is not my cup of tea, the latter including spectrophotometric plots with indistinct overlapping peaks and shoulders, to say nothing of those logarithmic absorbance axes. If you suspect I have overlooked spectral or other data that are worth discussing or debating, then please feel free to link to them here – but I insist on the right to remain non committal. Horses for courses and all that….","date":"2013-04-08","mins":"5:20 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29917","author":"colin_berry","post":"None whatsoever. If bilirubin starts greening up on TLC plates within hours, – and verdins are just one class of photoderivative – then what chance is there that it would or could survive centuries on linen, exposed to light and air? It doesn’t stop at green either – it bleaches fairly rapidly in light – one reason being that it is a self sensitizer for production of singlet oxygen, the latter adding across double bonds to produce dioxetanes and other oxidation products. The presence of other substances – e.g. Methylene blue – greatly increases the sensitization, so I would not be surprised if haems and free porphyrins work too, knowing their photodynamic action that is responsible for skin lesions etc. Nope, no bilirubin on the Shroud, and it’s a pity we cannot see video clips of the evidence on which Adler based his claim for “extraordinary levels”..","date":"2013-04-08","mins":"4:08 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29984","author":"colin_berry","post":"I would say the same to you as I have just said to Dr.Kearse – I am here to discuss science, not play mind games. If you consider that i have overlooked something important as regards the spectrum of Shroud blood, then you are at liberty to say so. For my part, I prefer to stay clear of any spectra that are not of the fingerprint variety – mass, infrared, nmr etc – and especially visible absorption spectra of porphyrins which I regard as a quicksand sown with landmines. The crucial question that needs to be addressed is the ratio of total porphyrin to total serum/plasma proteins. If the serum exudate hypothesis is correct, it should be lower than normal blood. If the leech theory is correct it should be higher. Reminder re blogging etiquette: it is not for you to choose, far less demand, the ground on which I choose to state my case..","date":"2013-04-09","mins":"2:30 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30034","author":"colin_berry","post":"The reason there are “no specifics” on spectrophotometry in the visible range is there are no specifics, no diagnostic utility, no molecular fingerprinting possibilities, certainly not in crude unfractionated mixtures (like Shroud blood solubilised in hydrazine). So why am i being pressed to address spectral plots that I consider to be not just valueless, except to signpost “anomaly”? Why all the insinuations (if not from you) that I have studied those plots and don’t like what I see? Why the impression that is forming in my mind that this thread is nothing more than a baiting exercise? Here’s a link to a paper I published in 1972 that is highly relevant to the issues under discussion (I’ll probably be accused of self promotion, but shan’t lose any sleep on that account). Http://www.sciencedirect.com/science/article/pii/0006291 X72906171 Note that I separated the bilirubin derivatives first, using chromatography. Note that I did record their visible absorption spectra, but only to support and document their chemical identity as rhodins and purpurins. Note that it was mass spectrometry – a fingerprinting technique – that was used to assign chemical structures. Note I was not content to observe absorption spectra, and then immediately proceed to inflict crazy unsupported ideas on the reader. Had I done so, the paper (published in Biochim.Biophys.Res.Commun.) would never have been accepted for publication. You as a scientist should know that what matters at the end of the day is NOT leaving every stone unturned, but (life being short) devising hypotheses that are testable in principle and in practice. I’ve done just that – by proposing that one measure the ratio of total porphyrins to serum proteins. The answer should allow one to judge whether Shroud blood is more ‘dilute’ than whole blood, through being a serum exudate, or more concentrated, due to having been inside a leech that rids itself of excess fluid (and plasma proteins). The reason for its long term redness is of secondary importance and can be left for another day. I’ll read your reply, naturally, but don’t promise to respond, feeling as I do somewhat weary of this site and its repeated failure to display generosity of spirit towards those who take the radiocarbon dating at face value, seeing no major errors, no incompetence, no dark conspiracies. Yes, it would have been nice to have had more than one sampling site, but the ranging shot answer makes it virtually impossible that re testing would or could give a non medieval result. Nobody goes to the trouble of invisibly mending an inconspicuous corner when there is major damage elsewhere..","date":"2013-04-09","mins":"10:27 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29983","author":"colin_berry","post":"Please sir, can I be excused mind games today…?.","date":"2013-04-09","mins":"2:18 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30044","author":"colin_berry","post":"Thank you Kelly. I have never doubted your sincerity for one moment – just discomfited that you should set so much store by visible absorbance spectra, not just because there are vastly more informative fingerprinting techniques available – but because it risks feeding red meat to those who mischievously claim I am ignoring those slurred visible light spectra for all the wrong reasons. Having been brought up in the school of hard knocks, I prefer to ignore those hugely problematical plots that mean different things to different people – for all the RIGHT reasons… ; ).","date":"2013-04-09","mins":"11:27 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30167","author":"colin_berry","post":"Methinks one has to be very careful Hugh to state what type of spectrum is being reported. Is it an absorption spectrum – one that measures wavelength subtraction, the subject of my preceding comment – or is it a reflectance spectrum that measures the wavelength of the light that is NOT absorbed, whether it is reflected off the surface, or transmitted through the far side? If that 610nm is a peak on an absorption spectrum, then the pigment is blue or maybe green. If it’s the wavelength of reflected/transmitted light, then it’s red or orange. (Not trying to teach a grandfather how to suck eggs – just making a plea for carefully specifying labels whenever discussing Adler’s spectrophotometric results).","date":"2013-04-10","mins":"5:40 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30103","author":"colin_berry","post":"Thibault HEIMBURGER : Thank you for the answer. But…. “If bilirubin starts greening up on TLC plates within hours, – and verdins are just one class of photoderivative – then what chance is there that it would or could survive centuries on linen, exposed to light and air?” According to Adler, he found in the samples taken at the margins of the bloodstains (serum) many “olive” (green + yellow) shards (verdin ?) The TS was very rarely exposed to light. In addition the bloodstains are completely dried. Do you think that taking into account these conditions, the bilirubin would have been completely destroyed ? Adler used the Erlich’s reagent using the method of Jendrassik (microspotting technique). “Using the same microspotting technique as described above, characteristic blue azobilirubin colors could be positively detected in reflected light on the surfaces of the olive colored shards, the orange globs, and also, weakly on the more orange colored red coated fibrils. The test was sensitive to acid, turning a paler purple, and was discharged by 10 minutes of short wave UV light as is characteristic of this color test. In the previous spectral work it was noted that a peak does appear both in the whole cloth reflection studies and in micro spectrophotometry of the tape samples at about 450 nm. This is quite typical of bilidienes and similar bile pigments structures…” I understand that the Erlich (classical) test for bilirubin was positive and that the spectra were consistent with the presence of bilirubine. For me, taking into account all the parameters (the bood on the TS is real blood, olive color of some of the “objects” mainly found in the serum areas, the results of the Erlich tests on these objects, macro and microspectrometry data) are self consistent. If you think that there is no bilirubin, you must interpret the Erlich test results as a false positive. Is it a false positive and if so what are the other possibilities ? I could respond to TH’s progressively deeper inquisitions, almost as if I were on trial here, having every word finely scrutinized – almost at a microscopic level for its accuracy. But I shan’t. This nonsense has to stop. What’s in the frame here is not what I write about Adler’s appalling exposition of his so called “science” (one hopes the science itself was better than his exposition thereof) but the exposition itself. Am I the only one to consider that passage was essentially gibberish?.","date":"2013-04-09","mins":"8:24 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30254","author":"colin_berry","post":"Yes, there is a gadfly quality about your persistent buzzing around, TH, and half the time I don’t have the faintest clue what it is you expect of me. I’ve already said I don’t think there is ANY bilirubin on the Shroud. So you come back and say it has been kept in the dark for most of its history (how can you possibly know that?). What response are you expecting – that I will go away and reconsider my answer? Repeat: I do not consider there is ANY bilirubin on the Shroud. And what am I supposed to make of your “I have the answer”? The answer to what? Life? The Universe? Or do you have evidence there is bilirubin on the Shroud. If so, please elucidate. I’m all ears….","date":"2013-04-10","mins":"5:25 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30105","author":"colin_berry","post":"Correction: that link did not go to the particular passage I had in mind. Here it is in full, with the most egregiously unscientific part highlighted. It’s also worth keeping in mind that the writer had himself acknowledged years earlier that bilirubin was photosensitive and thus unstable on exposure to light and oxygen, yet here he is using it to “explain” not only a colour change, but one that survives centuries. It is Adler who should be under your microscope, TH! … The next test we did was to take micro spectrum photometry of the non birefringent red coated fibrils from the Shroud. It was obvious that the spectrum it produced did not match the spectrum of methemoglobin, at least as it is given in the standard references, which is a solution spectrum of blood. But in a film of hemoglobin there is a confirmation (sic) change ;it no longer remains in the “met”form but goes to the para hemic form. It is known now that there is a certain species which will spontaneously go the para hemic form if there is not enough turnover in the spleen and liver to process the blood fast enough. We found a spectrum that was characteristic of only one known group of compounds the so called high spin, high iron porphyrin. So instead of being wrong, the spectrum peaks were in the right place. What we were seeing was the breakdown products of hemoglobin – bilirubin and biliverdin. And one began to make sense out of all of this. There is an extraordinarily high bilirubin count, almost as high as the methemoglobin. Now how does one account for such a high bilirubin in a person? One possibility is that the person had a severe malaria, but this does not seem very likely. But a torture, scourging and crucifixion leading to shock – that would produce a tremendous hemolysis. In less than 30 seconds the hemolyzed hemoglobin would run through the liver, building up a very high bilirubin content in the blood. If that blood then clots, an exudate forms, and all the intact cells with bilirubin stay behind, only the hemolyzed hemoglobin goes out along with the serum albumin which binds the bilirubin. So what one ends up with is on the cloth is an exudate which has an enhanced bilirubin with respect to the hemolyzed hemoglobin.You now mix bilirubin which is yellow orange with methemoglobin in its para hemic form which is an orangey brown and you get blood which has a red color. In fact, we have been able to simulate the spectrum in the laboratory by the process described above. This very strongly suggests that the blood stains are of a man who was severely beaten. No one would have ever dreamed when we first started doing the analysis that the chemistry would provide corroborating evidence to what the pathologists concluded long ago about the Shroud figure. The blood has no cells, is very low in potassium, and has the right color and composition for the blood of a man who was severely flogged and crucified. This is entirely consistent with the forensic evidence…”.","date":"2013-04-09","mins":"8:44 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30257","author":"colin_berry","post":"Oh, and as regards the positive Ehrlich diazo test: you are aware, aren’t you, that the Ehrlich reagent, diazotized sulphanilic acid, can be used to make literally hundreds of different azo dyes, with all the colours of the rainbow, simply by coupling to any of a wide range of phenols, naphthols etc. The only reason why it works specifically with bilrubin is firstly that fresh authentic blood is reasonably free of interfering agents (phenols etc) and secondly such interference as does exist can be countered by adding alkali at the end which converts the red/violet azobilirubins to a blue form which is less interference prone. What you cannot do is take Shroud blood and imagine it is the same well defined predictable stuff as the blood sitting in in a hospital fridge. There is also the fact the Adler did not use his Ehrlich reagent in a test tube. It was spotted onto fibres, and he observed bits of blue colour here and there. That’s simply not good enough to make a positive identification of bilirubin, even with the added touches (uv bleaching etc). Here’s what he should have done as a bare minimum. Instead of using polar diazotized sulphanilic acid, he should have used the more lipid soluble diazotized ethyl anthranilate, then extracted the azobilirubins into organic solvent, and then run on TLC against authentic standards. Basing a test on a blue colour, when a diazo reagent can produce them non specifically from so many coupling agents, is simply not world class science, which the world had a right to expect from Adler. I see no evidence at all that he ever consulted bile pigment specialists or used any of the then state of the art technology. Why are you defending the man, given he floated his bilirubin hypothesis in that Orphaned Manuscript three years after acknowledging that bilirubin was constantly degrading on exposure to light and oxygen?.","date":"2013-04-10","mins":"5:59 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30165","author":"colin_berry","post":"Here’s a handy graphic for those wanting to get a handle on the colours of dyes and pigments in relation to their absorbance of visible light of differing wavelengths. It confirms what I was saying earlier about red dyes absorbing blue or blue violet light, and blue dyes absorbing red or orange red light, while a green dye is one that absorbs both red light and blue light. So if one is attempting to explain a blood red colour, one expects to see maximum absorption at or a little above – 500nm and minimum absorption of red light in the region of 600nm. So it’s a mystery why there are these constant references from anoxie and jesterof to the 600nm region. That is the wavelength of red light certainly, but is of NO relevance to the perceived colour of a dye that is the result of a subtractive process. The only possible relevance is in a negative sense, i.e. That the greater the absorption at 600nm, the greater the filtering out of red light that would otherwise be transmitted by a blue subtracting chromophore, and the WEAKER the red colour one would observe. Here endeth this morning’s (photo)chemistry lesson..","date":"2013-04-10","mins":"5:20 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30179","author":"colin_berry","post":"There needed to be only one touching up exercise (or Rolfe like concession that it may have taken place) to render null and void all the research on: (a) ABO blood grouping (b) authenticity or otherwise of bloodstains (c) the “blood before image” claim cum mantra a prerequisite for authenticity (d) the entire Adler/Shroud canon on the nature of the Shroud’s bloodstains (serum exudate etc). (e) the final STURP report’s conclusions that the blood on the Shroud was genuine human blood consistent with a scourging/crucifixion narrative as per Gospel accounts. If there is any fake “touching up” blood on the Shroud, then who is to say that ALL of it is not fake – of medieval provenance?.","date":"2013-04-10","mins":"6:30 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30180","author":"colin_berry","post":"Correction: Adler/Heller.","date":"2013-04-10","mins":"6:32 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30205","author":"colin_berry","post":"Jesterof : Because we are right and you are wrong. I suspect Anoxie works with practical application of the wavelength absorption of the whole blood as I do and if the TECHNOLOGY is based on the wavelength of 650 – 950 for specifically blood, you may post as much curves as you want, but RED whole blood starts to absorb RED light not earlier than 600 nm. It is a practical application of the light absorption not just tfeory on MONOCHROMIC plots. Blood is not monocgromic You need to learn some elementary physics….","date":"2013-04-10","mins":"10:46 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30335","author":"colin_berry","post":"So, Shroud blood is nothing like ordinary blood – unless one is prepared to ignore textbook spectra – and the difference cannot be explained away by invoking bilirubin (unless one rewrites the textbooks on that photosensitive pigment too). Yet received wisdom, c/o STURP, is that the blood on the Shroud is entirely consistent with human blood, right down to Group AB. How did we ever come to find ourselves in this place? Somewhere there has been a massive failure in the methods of “science”. To Adler and Heller’s credit, they did note the paucity of potassium and red blood cells – but tried to explain that away with their “exuded serum from retracted blood clots” hypothesis. Some might think that the prominence of the blood stains belies that explanation, and in any case it would not have been rocket science to have measured the ratio of porphyrins to serum proteins to test that idea – which I strongly suspect to be another of those self serving authenticity promoting ones designed to kill a second bird with the same stone (attempting to explain how hours old blood could still manage to leave almost stencil like imprints on linen). Square One is calling us back, methinks. Leech blood anyone?.","date":"2013-04-11","mins":"7:22 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30212","author":"colin_berry","post":"I think I know the source of your confusion. You are taking the diagnostic wavelengths that are used in pulse oximetry to distinguish between oxygenated and deoxygenated blood, and assuming that if they can be used to discriminate between their two shades of red, then they are universally applicable to all situations where there is a difference in redness. That is not so. The wavelengths chosen have nothing to to with the primary reason for redness – i.e. Absorption of blue wavelengths. By operating in the red there might be an attempt to pick up a small difference in red filtering, but I suspect that the main reason is that oxygenated and de oxygenated haemoglobin just happen to have sizeable relative differences in their absorbances in the red that can be measured with good sensitivity, despite the relatively low absorbances compared to those at the blue end (recalling that absorbance scales are logarithmic and that by far and away most absorbance is in the blue.) But with Shroud blood, whether “as is” initially, or pre processed, as in a leech, we are not dealing with native oxygenated v de oxygenated. Blood as tested in hospitals. All the blood will be in the aged oxidized methaemoglobin state (at least) with the iron in the +3 oxidation state. That would preclude the reversible binding of oxygen that occurs in non denatured blood. Anyone wishing to explore the colour differences between “ordinary” aged blood (brown or black) and anomalously red or red brown Shroud blood would be exceedingly unwise to confine their search to the red wavelengths at 600nm or higher., and be sadly misguided if relying on pulse oximeter theory or practice. The only folk likely to do that would be trainee technicians with a limited grasp of scientific principles. One can make allowances for technicians. However, I would not expect a physician with a proper and thorough preclinical training to make so elementary an error… (Yes, I was once a preclinical lecturer at a major London teaching hospital). You did say you were a physician, didn’t you? Or was it ‘medically trained’?.","date":"2013-04-10","mins":"11:31 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30236","author":"colin_berry","post":"I’ve said all I want to say regarding the science (maybe in the fullness of time we’ll have some 2nd or 3rd opinions that will show which of the two of us has the better grasp of scientific principles). As for your attempting to dismiss the Shroud blood colour anomaly, I can only repeat what I said earlier: no one on this site had any trouble with Adler pointing it out, not while there was an authenticity promoting narrative to account for it – that fanciful bilirubin story. It’s only when I come along, first pointing out (a year ago) that bilirubin could never have survived intact for centuries in Shroud bloodstains, and then, just a couple of days ago reported here a quotation from 1999 in which Adler himself had acknowledged as much, that all of a sudden there is no red anomaly, that it is all just a figment of our imaginations. If there were no spectral signature for that red anomaly, then how could Adler have claimed to have modelled it with combinations of methaemoglobin and bilirubin? Are you aware that it is not me you are contradicting, so much as Alan D.Adler? Speaking for myself, I have no objection to your doing that – but do make an effort to maintain a modicum of scientific and logical consistency..","date":"2013-04-10","mins":"3:19 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30365","author":"colin_berry","post":"Take a look at the epsilon bloodstain on Shroud 2.0 App – Dan’s current posting – especially on the 1 over 3 crossover theads of the herringbone weave. They are faint pink, not the brown that one would expect of centuries old oxidized haemoglobin. This ain’t no normal blood we are looking at. It’s as if the haemoglobin has been cured and preserved, like the muscle myoglobin in ham or bacon. Methinks the chemistry might be the same, as I suggested earlier (nitrite ion and/or nitric oxide has bonded onto the oxidized Fe(III)iron centre of the haem. So there ; ).","date":"2013-04-11","mins":"12:56 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30371","author":"colin_berry","post":"Ron : Colinberry; “This ain’t no normal blood we are looking at.” Finally, someone sees the light. This ain’t no normal blood is absolutely right, it is the blood of Christ….Mystery solved. R God must have a sense of humour then – in first sending STURP to suggest it was all to do with bilirubin….","date":"2013-04-11","mins":"1:22 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29443","author":"colin_berry","post":"CO? Don’t overlook anaerobically produced nitrites and/or gaseous NO within leeches, and their likely curing effect on haem bound iron, as in bacon curing..","date":"2013-04-05","mins":"2:39 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30379","author":"colin_berry","post":"Your own particular agenda, aka hang up, is becoming plainer by the minute… Reminder: scientists and technicians need each other….","date":"2013-04-11","mins":"1:36 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29508","author":"colin_berry","post":"Yes, there has to be a molecular basis for the <a href = \"http://shroudofturinwithoutallthehype.files.wordpress.com/2012/07/blood flakes shroud turin1.jpg?w=640&quot; carmine colour of Shroud blood scrapings. It is more than just a trick of the light..","date":"2013-04-05","mins":"12:12 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29527","author":"colin_berry","post":"Hello goodbye..","date":"2013-04-05","mins":"2:44 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29657","author":"colin_berry","post":"Just out of interest, who said that ‘hydroxiproline’ (sic) is absent in humans? I certainly did not. Hydroxyproline (HP) being a product of connective tissue catabolism is a minor constituent of blood. But you would not have known that from reading the use to which Raymond Rogers made of HP disappearance – roping it in as he did without preamble as a test for heated blood,. That was in a somewhat contrived argument against contact scorching as the mechanism of image formation, while overlooking to mention that the test is used by the meat industry, dealing with protein incorporated HP , NOT free HP. Linen can be scorched at temperatures that do not even melt free HP, a very polar zwitterionic amino acid, far less volatilize it..","date":"2013-04-06","mins":"11:17 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29550","author":"colin_berry","post":"Alan D.Adler was one of STURP’s top chemists, a porphyrin specialist, someone who could be relied upon to recognize a red colour that was simply too bright to be aged blood. Adler knew about meth(a)emoglobins and other oxidised haems, he knew about the crucial importance of the precise electronic configuration of the iron centre to properties like colour, uv/visible spectra, fluoresence etc. What’s more he reported the isolated porphyrin to have an aytpical spectrum. So what did he do? Say it was just a trick of the light, a artefact of photography? No, he was so taken with the various anomalies that he felt obliged to propose new chemistry to explain his findings – namely that novel association between methaemoglobin and bilirubin that would account for those eternally red bright bloodstains. Yet as soon as one dismisses Adler’s creative chemistry, and substitutes what one believes is more conventional chemistry – what happens? Folk pile in to deny the existence of the very effect that so preoccupied Adler. No, there’s nothing unusually red about the blood, they say, it’s all a figment of your imagination, and Adler is conveniently forgotten in the rush to repel the new threat, to retreat to a new defensive position. For blood to have retained its bright red colour, one can reasonably assume that the iron centre has been retained at the centre of haem, probably as oxidized iron (III) in place of the original iron (II), but with a new electron donor or donors bonded onto the iron, maintaining its electron configuration in the form that keeps it bright red. Quite what the new donors might be is anyone’s guess. Carbon monoxide has been suggested, but I’m inclined to think it might be nitrite ion, NO2 , or nitrogen monoxide (NO, a stable free radical). The first of those is responsible for giving ham and bacon and other cured meats their stable long lived pink colour, so it’s possible a similar kind of chemistry might operate between aged haems and decomposition products say of the arginine in globins. Where would this take place? Inside a leech of course, which is where one of us came in….","date":"2013-04-05","mins":"6:04 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-364","author":"colin_berry","post":"Re lysis and “solublization”: lysis alone only ruptures phospholipid membranes, and then only momentarily. They always reconfigure into a bilayer or micelle. They cannot “solubilize” unless a detergent or detergent like species, e.g. Lysophosphatidylcholine is present. The self association of water via hydrogen bonding sees to that, forcing fatty acyl side chains to self associate via Van der Waals interactions (hopefully a more accurate description than referring loosely to ‘hydrophobic’ forces, seeing as how the forces between electrically uncharged molecules are ALWAYS attractive. (The zwitterionic phosphocholine moiety aiding bilayer or micelle formation). So unless there were a mild non denaturing detergent in the aqueous buffers used for blood groiup testing, e.g. One of the Lubrols, then I cannot see how there would be true solubilization of membrane associated antigens. Without solubilization, there is always the (theoretical) possibility of lysed RBC membranes being reduced to tiny vesicles/liposomes, at least some of which could be inside out. Given the impermeability of typical biological membranes even to small molecules (ATP, sugars, etc) except those that are specifically carrier mediated then it is difficult to be certain that an antibody is able to access all of the cell surface associated antigens that were initially on the “outside”. In any case, some intact RBC are need as agglutination detectors,large enough to see aggregation under the microscope. In short, age related haemolysis is bad news, is it not, in an assay system based on RBC agglutination, even if there is some resealing and formation of miniature liposomes with correctly oriented glycoproteins..","date":"2012-07-15","mins":"6:25 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/07/15/blood-grouping-the-shroud-of-turin-like-trying-to-sort-apples-from-oranges-in-the-dark-wearing-boxing-gloves/","cat":"ab_blood_group","title":"Blood-grouping the Shroud of Turin – like trying to sort apples from oranges in the dark wearing boxing gloves."},{"id":"comment-363","author":"colin_berry","post":"And now this one has appeared on the Other Site, from Dr. Kelly Kearse no less. For the custodians of the Shroud, cutting from even a far corner may be considered too invasive. It’s hard to imagine that removing a portion from a bloodstained region would even be considered. Is the sensitivity of radiocarbon dating sufficient to evaluate a scraping or several blood flakes, particularly when divided up among several laboratories? Not my area, but it seems to be pushing the limit of detection. Colin, regarding study of AB antigens in aged bloodstains (as discussed on your website), I’m not certain that intactness or correct sidedness of any resealed red blood cells is really an issue in immunochemical evaluation of ABO antigens. True, reconstituted, resealed cells may be detected microscopically in ancient samples under certain conditions prepared for fixed staining, but it is unclear to what percentage of the total this may represent. Moreover, for immunochemical evaluation of ABO molecules, such experiments are typically performed in buffer systems that would (purposely) lyse and solubilize cell membranes, maximizing exposure and detection of any antigens present. Finally, a comment on the suggestion that [“ There could have been blood residues initially at the time of Shroud’s genesis, that have been ‘touched up’ by surreptitious additions of real blood, possibly blood of a carefully chosen group that best fits with ‘authenticity’ and what better group than AB, an overzealous custodian might have imagined…] The existence of ABO blood groups was unknown until approximately 100 years ago (Landsteiner reported their existence in 1900). Accordingly, any such “surreptitious addition” would had to have taken place relatively recently in the Shroud’s history, by a 20th century custodian…”might have imagined” is a good phrase to use. Nope, I don’t propose snipping any more rectangles from the the Shroud. What I propose is the taking of blood scrapings, pooling samples if necessary from different sites. Samples could be taken in the first instance from the less photogenic dorsal view – e.g. The back of the head, the small of the back, the feet etc. It would be nice to replicate the precision of the 3 lab dating (even if the accuracy is in doubt due to alleged ‘invisible reweaving’ – which frankly I regard as complete tosh) but I personally would be content with assay precision and accuracy that distinguished clearly between 1st century AD and a medieval/post medieval date for the blood, basically to distinguish between authenticity and forgery for the blood. (The evidence that the Man in the Shroud was crucified would appear to rest almost totally if not exclusively on the alleged bloodstains, the latter including scourge marks). I’ll post this separately, and return to some other points as and when the spirit moves me to mount a defence – which I know few will bother to read on my own site..","date":"2012-07-15","mins":"6:02 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/07/15/blood-grouping-the-shroud-of-turin-like-trying-to-sort-apples-from-oranges-in-the-dark-wearing-boxing-gloves/","cat":"ab_blood_group","title":"Blood-grouping the Shroud of Turin – like trying to sort apples from oranges in the dark wearing boxing gloves."},{"id":"comment-362","author":"colin_berry","post":"This comment has appeared in Spanish on the other site (shown here in Google translation): “If Colin can reproduce bloodstains, a halo of serum, similar to those in the shroud, shall have completed the BEST WORK done so far on the Shroud. Try it, Colin!. Is any method. Other scholars have tried for many years.” Well, it’s news to me that there is any mystery about bloodstains and their serum halos, whether on the Turin Shroud (assuming that is what is present) or elsewhere. The simplest way to duplicate them is to paint on blood while still fresh and leave it to clot and dry. Blood was an easily obtainable commodity in medieval times (physician administered bleeding from nicked veins being a standard cure all). If there is any mystery about the Shroud and its supposed bloodstains, it is in understanding how blood on a cadaver that had already had ample time to clot could somehow reliquefy to produce such artistic free flowing effects, like those blood trails on the forearms and small of back especially. Cue the mantra (aka pulling a white rabbit from the hat) re post mortem external “fibrinolysis”, which has to be up there among the more mind boggling clack ever to emerge from STURP pie in the sky theorising… Was there not there a real doctor in the house (medically qualified as distinct from chemistry Ph D) to put a lid on all that tendentious self serving nonsense?.","date":"2012-07-15","mins":"3:46 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/07/15/blood-grouping-the-shroud-of-turin-like-trying-to-sort-apples-from-oranges-in-the-dark-wearing-boxing-gloves/","cat":"ab_blood_group","title":"Blood-grouping the Shroud of Turin – like trying to sort apples from oranges in the dark wearing boxing gloves."},{"id":"comment-37859","author":"colin_berry","post":"Someone has just linked to this posting that appeared in August of last year. If anyone wondered why I did not respond, then take a look at the mischief making cartoon that accompanies it. How many folk reading the caption, could be forgiven for concluding that the “reader” who made the complaint was me, or suspected by Dan Porter to be me, using an anonymous email address? At least a few I suspect, especially if they felt the reference to “Dr.Collin (sic) Berry” was suspect, possibly “reader” himself wishing to flaunt his academic credentials. Was that Dan Porter’s intention – to sow that seed of doubt in folk’s minds? I thought the best response was simply to ignore the posting. One should never feed trolls, nor blogmeisters who attempt to use one as a target for knocking copy – or of funny ha ha cartoons with provocative and/or derisive captions. For the record, I am no more an attention seeker than anyone else on this site (while relishing lively debate) and indeed am resigned to being ignored. Being ignored is all part of life’s tatty, moth eaten tapestry. Better to be ignored than to be patronized or trolled, the latter being sadly par for the course on this authenticity promoting “blogsite”. The proof of that, if proof were needed, is that I closed down my own Shroudie site some months ago, and only comment here infrequently and spasmodically, as and when I think the record needs correcting on key issues, like the alleged radiocarbon dating “fiasco”. So no, I was NOT the “reader” who sent Dan Porter that email, and am only writing this now to forestall today’s new visitor from arriving at the wrong conclusion – and belatedly to set the record straight..","date":"2013-06-23","mins":"7:18 am","url":"https://shroudstory.com/2012/08/03/did-the-bloodstains-really-precede-image-formation-on-the-shroud-of-turin/","cat":"blood_studies","title":"Did the bloodstains really precede image formation on the Shroud of Turin?"},{"id":"comment-14502","author":"colin_berry","post":"Only an intense, highly localised corona discharge could have produced the image we see. I refer to Giulio’s tie….","date":"2012-08-05","mins":"11:33 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"id":"comment-47637","author":"colin_berry","post":"Typo (very first sentence!): I perceive the Shroud of Turin AS being in essence ….","date":"2013-10-16","mins":"9:34 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","title":"Holding the Shroud to an impossible standard?"},{"id":"comment-47657","author":"colin_berry","post":"… and people wonder why scientists, including retired ones (like me) steer clear of the internet as a medium for expressing their views and ideas….","date":"2013-10-16","mins":"11:21 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","title":"Holding the Shroud to an impossible standard?"},{"id":"comment-47659","author":"colin_berry","post":"Sorry: my last comment was posted before Mario’s appeared. (Where would we Shroudie bloggers be without Mario’s Shroud Scope?)..","date":"2013-10-16","mins":"11:25 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","title":"Holding the Shroud to an impossible standard?"},{"id":"comment-47853","author":"colin_berry","post":"In what way was it “poorly done”? The sample supplied to the three labs was dated as 13th/14th century. The relatively small spread of values is attributable to technical differences in the way the samples were cleaned, to say nothing of random statistical error. Those who go looking for a trend across the three contiguous strips are engaged in an exercise that might have been OK if the samples had been widely spaced, but they were not, and it is hardly fair to lay the blame for that at the door of the three labs. They were, to put it bluntly, fobbed of, and could only analyze what they were given. Why then do we so much about “botched” tests etc, and so little about the obvious solution – which is to repeat the testing in such a way as to remove any doubts re the sampling, alleged mending with modern material or statistics? (Other reservations, e.g. Regarding alleged contamination (“bioplastics” etc) are an entirely different issue that have little or nothing to do with “botched” methodology or sampling error, and which can be dealt with by combining radiocarbon re dating with conventional chemical analysis, e.g. Carbohydrate analysis)..","date":"2013-10-18","mins":"2:41 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","title":"Holding the Shroud to an impossible standard?"},{"id":"comment-47861","author":"colin_berry","post":"R. H. Cahall : Mr. Colinsberry: You seem to move between two ways of construing my use of the word “botched”. In the first, you defend the protocols of the labs themselves as dealing correctly with what they were given. In the second, you widen the sense to include all the protocols, or lack thereof, for selecting, gathering, and delivering the samples. The close spread of the dates does seem to indicate that the labs in question performed their respective tasks competently. My criticism was intended with respect to the broader way of regarding what transpired. I do agree that the best way to proceed is to do a re test under scrupulously sound conditions. Absent that, however, I would still maintain that the tests are, to say the least, anything but dispositive. Broad agreement – at last at least on the need to repeat the dating, but with a properly constructed, randomized sampling frame. I personally would like to see terms such as “botched” etc (and worse, much worse) abandoned until the data are in, seeing little to fault the conduct of the labs per se (assuming it was the Shroud’s authenticity that was supposed to be under the spotlight, not the honesty of the scientists and technicians themselves, the latter having been shamelessly impugned, in award winning documentaries no less that peddle conspiracy theories for the gullible and over impressionable)..","date":"2013-10-18","mins":"4:02 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","title":"Holding the Shroud to an impossible standard?"},{"id":"comment-47636","author":"colin_berry","post":"I perceive the Shroud of Turin is being in essence a thought experiment, imagining the effect of removing a victim, condemned to burning at the stake, while newly deceased but before substantial incineration, and placing in an up and over Shroud. The “hot” victim then leaves a scorch like body imprint on both surfaces of the cloth. The end result is/was intended as a visual and arresting metaphor – “Look – this is what they did to our blameless man, a latter day martyr who suffered a fate comparable to that of Christ, i.e. False witness, followed by humiliating and excruciating public execution. Evidence? It has to be circumstantial obviously, but it is there if you look for it, first clearing your mind of earlier interpretations, many of which are less than convincing, e.g. That of the so called “poker holes”. The latter were almost certainly a signal to the viewer that the man depicted had been burned at the stake, that the burn holes were produced by hot charcoal falling onto the linen while still neatly folded, prior to being used to wrap the deceased. The midline fold that is needed to explain the symmetry of the burn holes (original ones– but later 1532 also) existed before the image imprinting in the case of the original L shaped burn holes. The later 1532 holes, much larger, were a deliberate attempt to draw attention away from the earlier holes, not by patching (too conspicuous) but by swamping with new ones. The original holes were an embarrassment, you see, for those who wanted to re invent Shroud Mk1 as Christ’s shroud, so much so that we see the original holes being represented as “blood” (red paint) on the 1516 Belgian (Lier) copy, for example, showing that copyist was clearly puzzled and/or confused by the L shaped holes. Http://www.shroud.com/vanhels2.htm/ The 1532 fire (no accident, IMHO) removed that source of embarrassment at one fell swoop (though they had maybe forgotten or conveniently overlooked the ‘incriminating’ Lier copy). So, if you have ever wondered why there is a vertical axis of symmetry about the burn holes in the Shroud, both 1532 AND previous “poker holes” implying a disrespectful and arguably improbable folding down the mid line of the face – there’s your answer. It’s to do with the artisan’s deliberate attempt to signal that the victim has been roasted over red hot charcoal – some of which had fallen onto and damaged the folded linen, prior to it being used pictorially and metaphorically as a burial shroud. The victim? As I and others have suggested before, most probably a Knight Templar, possibly Geoffroi de Charney or Jacques de Molay, both burned at the stake in 1314, approx 40 years before the first display of the Shroud at Lirey..","date":"2013-10-16","mins":"9:16 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","title":"Holding the Shroud to an impossible standard?"},{"id":"comment-52557","author":"colin_berry","post":"John Klotz : Collin, You are totally without real humor. I thought I made it clear enough that I was, as we say on this side of the pond, ‘jerking your chain.” Okay, I’ll admit it, I have no dark secrets about you and have never had a comment about you censored by Dan or anybody else. What you have seen is what you have got from me. I don’t think, however, I’ll will ever write anything as funny as the wonderful, Swiftian satires you have posted on his blog. How did you ever acquire that Swiftian gift of black humor. I mean, your claim hat he Shroud was really Jacques de Molay. What an imagination and to be able to convince people ala Swift that you were being serious. Bravo. I am in awe. So you have backed down from your dark suggestion that I have something to hide. Sorry, John Klotz. You have failed the internet forum audition. There will be no further comment from me to you, given your nasty troll like attempt to blacken my character by insinuation – one that came to nought when challenged. My record in life is so clean that any attempts on my part to explore the dark side of my nature risk sudden death from boredom..","date":"2013-11-23","mins":"5:32 pm","url":"https://shroudstory.com/2013/11/23/hugh-farey-on-the-possibility-of-image-color-under-bloodstains/","cat":"blood_studies","title":"Hugh Farey on the possibility of image color under bloodstains"},{"id":"comment-52536","author":"colin_berry","post":"Think of the site as a Roman Catholic version of Pravda, where self censorship is/was the key to survival, and you can’t go far wrong. (Am only posting this to confirm my hunch that Big Brother is back in pre moderation mode, having wiped an earlier comment containing what was deemed to be an excessive number of home truths, like a reference to $TERA.Inc. Click on Send and ye shall find…)..","date":"2013-11-23","mins":"3:38 pm","url":"https://shroudstory.com/2013/11/23/hugh-farey-on-the-possibility-of-image-color-under-bloodstains/","cat":"blood_studies","title":"Hugh Farey on the possibility of image color under bloodstains"},{"id":"comment-52545","author":"colin_berry","post":"“Like the time I revealed a deep, dark secret about you. It got lost. So what. Actually, I’m kidding. Or am I?” You have my full permission to post whatever you have got on me, John Klotz, you deeply unpleasant character, you. Come on. Do your worst..","date":"2013-11-23","mins":"4:11 pm","url":"https://shroudstory.com/2013/11/23/hugh-farey-on-the-possibility-of-image-color-under-bloodstains/","cat":"blood_studies","title":"Hugh Farey on the possibility of image color under bloodstains"},{"id":"comment-10199","author":"colin_berry","post":"Thanks for your comment on this 5 year old posting Mark (better late than never!). Even now, I try to think as little as possible about the Shroud blood (or should that be “blood”?), being a ‘body image’ man. Yup, even now, nothing about the blood seems to make sense!.","date":"2017-10-30","mins":"9:01 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/07/03/lets-take-a-closer-look-at-one-of-the-peculiar-blood-stains-on-the-shroud-the-one-in-the-hair-shaped-like-a-question-mark/","cat":"blood_stain","title":"Let’s take a closer look at one of the peculiar blood stains on the Shroud – the one in the hair shaped like a question mark"},{"id":"comment-4029","author":"colin_berry","post":"Yes, but if you know your stellar processes you CAN get order out of the Big Bang. It arises in new and/or dying stars when protons and neutrons fuse to make larger nuclei, trapping vast amounts of nuclear energy in the process. It’s the later addition of electrons that creates the self organizing order, at least at the chemical and biochemical level, because they have to be inserted into strictly quantised energy levels. That’s because the build up principle gives rise to atoms with different ionization potentials and electronegativity, which in turn gives rise to the 92 or so naturally occurring elements, each with its distinctive chemistry as regards reactivity, valency etc. Don’t forget: all one needs to do is to COOL water vapour (withdrawing, not adding energy) and one can create beautiful six sided snow crystals, no two of them identical we are told. Never underestimate the potential of atoms and molecules to self organize via electrical interactions, which all goes back to the nature of subatomic particles and the energy arithmetic of stellar processes. Now if you were to ask me what is the nature of the pre Big Bang singularity from which all this order arose via expansion and cooling, I’d have to confess that I’m stumped for an answer..","date":"2014-06-08","mins":"6:29 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/07/02/lets-take-a-closer-look-at-a-subset-of-bloodstains-that-sturp-says-were-imprinted-before-the-body-image-warning-this-post-is-not-for-those-who-are-convinced-of-the-authenticity-of-the-sh/","cat":"authenticity","title":"Let’s take a closer look at a subset of bloodstains that STURP says were imprinted before the body image… (Warning: this post is not for those who are convinced of the authenticity of the Shroud of Turin)…"},{"id":"comment-52544","author":"colin_berry","post":"Dan : Nothing is in pre moderation. Nothing has been knowingly removed or blocked. Send me a copy of what is missing. I have posted it to my own site, having copied and pasted it from here, while still on screen, under “One of our comments is missing”..","date":"2013-11-23","mins":"4:09 pm","url":"https://shroudstory.com/2013/11/23/hugh-farey-on-the-possibility-of-image-color-under-bloodstains/","cat":"blood_studies","title":"Hugh Farey on the possibility of image color under bloodstains"},{"id":"comment-10203","author":"colin_berry","post":"PS:I was asked recently to comment (via email) on the pdf by Prof. G.Lucotte of Paris (BSTS Newsletter No.85, June 2017). Http://www.shroud.com/pdfs/n85part3.pdf He and his fellow analysts were given a sticky tape sample from a bloodstain on the eyebrow, just below the ‘reversed 3’ /epsilon stain. Most of it was red/yellow/brown in colour, “like all other bloodstains on the Shroud”. But, shock horror, it did not analyse as blood, or components thereof, but as “yellow red clays” (iron containing aluminosilicates)! If that is the case, then it’s now possible finally at long last to combine the blood and body image into a single narrative with the simulated sweat imprint model. How? Well, it’s admittedly a long shot at present, but here we go. The following is based on the fact that (a) clays are stable to heat (b) can be imprinted onto the linen first, before the flour. Are you sitting comfortably? Then I shall begin. The flour was sprinkled onto the oil smeared subject(s) first. A gooey slurry of fine clay (“blood”) – selected for its redness – was then trickled onto the flour coated subject, and wet linen pressed on top. The clay before flour imprinted linen was then exposed to the open charcoal fire, giving the apparent dual two tone “blood/sweat” imprinted Shroud. Gradually with time, some of the clay particles detached, leaving odd unsightly paler patches. Along came a Shroud custodian with a new blood substitute and paintbrush or dabber, probably containing at least some real blood, though lacking intact or recognizable red blood corpuscles (mushed up medicinal, i.e. Blood sucking leeches?) and did some touching up. Result: today we have hybrid bloodstains, which give positive tests for porphyrins, albeit with atypical spectra (Adler and Heller) or yellow red clays, or both. We then have an explanation for why the bloodstains are variously described as having a “peculiar” colour (STURP observer, 1978) or “too red” (Adler and Heller) when seen under the microscope on a well illuminated stage. You can wake up now. I’ve said what I wanted to say… PS: As recent as a year or two ago, I might have wasted no time in modelling the latest idea, in this instance testing out a clay slurry as Mark 1, 14th century ” blood”. Not any more – announcing the idea and leaving it at that will now have to suffice. That’s my considered response to the casual indifference of sindonology to experimental modelling – like the scores, possibly hundred of my experiments reported here on this and other sites, deploying white flour to model a 14th century SIMULATED sweat imprint that have never received the slightest mention… So why bother with the icing on the cake – fine clay to simulate the ancient blood? There’s nothing quite so closed as the collective made up mind of sindonology’s authenticity promoting clique, forever recycling its fond illusions and facile mantras. (I may do the experiment to further my own education, but shall waste no further time in reporting the outcome to those deaf ears/closed minds)..","date":"2017-10-31","mins":"9:24 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/07/03/lets-take-a-closer-look-at-one-of-the-peculiar-blood-stains-on-the-shroud-the-one-in-the-hair-shaped-like-a-question-mark/","cat":"blood_stain","title":"Let’s take a closer look at one of the peculiar blood stains on the Shroud – the one in the hair shaped like a question mark"},{"id":"comment-6783","author":"colin_berry","post":"Dan: I have to say that I’m not the greatest fan of Word Press, which denies me the option of posting under “Anonymous” (as would Google’s Blogger) as and when I feel the need to sound off about this or that abuse of science. There’s an awful lot of anti science sentiment about these days, although much of it is largely self inflicted where the Shroud is concerned – with headline seeking pop scientists being largely responsible. But it’s the same Google that hoovers up the titles that folk choose for their responses, like “Sciencebod – do some homework etc”) which then go onto Page 1 of anyone googling one’s username, which the trolls – that one picks up like fleas – are quick to spot and exploit. Yup, I may offer a comment from time to time, Dan – especially as I think that the Shroud fest is being fed by bad science, the recent Italian silliness re ultraviolet lasers being a case in point. That kind of thing simply serves to feed the abysmal understanding on the internet as to how real conference presentation, peer reviewed,science operates in the real world.. So don’t take it personally if I suddenly disengage for days or weeks at a time if or when – the sniping starts up again, as indeed it will… Don’t feed the trolls is the best motto – even when they artfully accuse one of being the troll (a favourite tactic of theirs)….","date":"2012-01-10","mins":"3:11 pm","url":"https://shroudstory.com/2012/01/10/lets-talk-red-blood-bilirubin-saponaria-officinalis-and-uv/","cat":"news_&_views","title":"Let’s Talk Red Blood: Bilirubin, Saponaria officinalis and UV"},{"id":"comment-8347","author":"colin_berry","post":"Splendid account Kelly – a model of precision and clarity. If I understand you correctly, reversion to AB in the context of reverse typing could mean simply “reversion” to decay endproducts, like CO2, ammonia etc since all this required to complement an AB finding for the sugars is detecting NO corresponding antibody in serum, i.e. Nothing. In passing, maybe someone explain something for me: if there was enough blood for doing all these tests (ABO, bilirubin etc) then how come there wasn’t enough for carbon dating? Even if contaminated by microorganisms, as indeed can the fabric per se, the latter would mainly have been contemporaneous bugs of the same era one would have thought – so should not have influenced the result too severely..","date":"2012-02-16","mins":"4:30 am","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8382","author":"colin_berry","post":"It’s amazing what people can bring themselves to imagine, or believe, Kelly, especially when if fits preconceptions. I prefer to keep the jaundice confined to my own ocular sclerae….","date":"2012-02-17","mins":"2:47 am","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8384","author":"colin_berry","post":"PS: Here’s an example of some of the great man’s science. “Later, Adler (ref) wrote that the spectra of the non birefringent red coated blood fibrils from the Shroud did not match the spectrum of methemoglobin in blood solution as it is given in the literature. However, he found “a spectrum that was characteristic of only one known group of compounds – the so called high spin, high iron porphyrins” which are found in a special form of methemoglobin: methemoglobin in its para hemic form. Now, this kind of para hemic species formed spontaneously in living persons when high quantities of hemoglobin are released in the serum from broken red cells, i.e. Under hemolysis conditions.” There is name for this kind of “science” Kelly. It is called building castles in the air….","date":"2012-02-17","mins":"3:50 am","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8399","author":"colin_berry","post":"I’m sure I read recently. Art, that the various blood stains on the two framing sides of the hair, left and right, were really on the face initially, were then transferred to the linen when the body was wrapped, and then somehow got out of synch or register in the course of some unspecified means of (photographic?) image capture onto a plane or enveloping surface, i,e. The Shroud. There’s an alternative explanation, needless to say, which is that a forger trickled freshly drawn blood onto the linen where he thought it would appear, but got his calculations wrong. On the other hand, the correspondence between blood on the image of the two arms and the linen is near perfect. Amazing, when you consider that it must have been long congealed if that from a crucified man, and discount all the flights of fancy about “proteolysis” dissolving external blood clots (which in my experience tends to dry and harden on). No doubt there will be an ingenious explanation – I’ve never been let down yet….","date":"2012-02-17","mins":"9:16 am","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8501","author":"colin_berry","post":"Alan D Adler (RIP) was a bombastic blowhard, someone who couldn’t admit when he was wrong, a surly curmudgeon, a right b*stard (not to put too fine a point on it) a large man who bullied, ranted, and argued about everything, He was, above all, LOUD, but a loveable maniac all the same ; )..","date":"2012-02-20","mins":"2:32 am","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8486","author":"colin_berry","post":"“There is always a well known solution to every human problem–neat, plausible, and wrong.” H.L.Mencken.","date":"2012-02-19","mins":"7:04 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8372","author":"colin_berry","post":"Hello again Kelly At the risk of boring you and others, could I start by saying that I spent two years at the start of my research career in Philadelphia putting congenitally jaundiced Gunn rats under fluorescent lamps to find what they did with their bilirubin (as a model for the phototherapy of neonatal jaundice). Berry CS, Zarembo JE, Ostrow JD. Evidence for conversion of bilirubin to dihydroxyl derivatives in the Gunn rat. Biochem Biophys Res Commun. 1972 Dec 4;49(5):1366–1375 I have to say that this idea that one could get enough bilirubin into blood to alter its colour makes no sense to me whatsoever. It’s orange for a start, not red, and what colour it gives to jaundiced blood would surely be masked by red cells and their haemoglobin. And while I have heard of the mild haemolysis that accompanies foot strike injury in distance runners, and an isolated anecdotal report about concentration camp victims who had been hideously abused with elevated bilirubin as a result, I can’t say as I have ever heard of trauma producing hugely elevated levels of bilirubin, certainly not enough to produce visible jaundice (skin, sclera etc) as distinct from a modest rise in serum diazo reactivity. Maybe my knowledge in these matters is outdated. It was, after all, some 40 years ago. If so, please enlighten. I’m all ears….","date":"2012-02-16","mins":"6:31 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8537","author":"colin_berry","post":"Chris : And who is speaking here? The pot or the kettle? His own daughter actually … Gotcha ; ) daughter’s refreshingly candid tribute.","date":"2012-02-20","mins":"12:18 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-196408","author":"colin_berry","post":"There is no experimental test of a hypothesis that can’t be challenged or attacked through failure to consider other people’s ideas. The purpose of scientific research is to advance one’s own ideas and hypotheses. Other people’s ideas can be considered in the paper’s final discussion, AFTER one has reported the results of testing one’s own ideas. Let those who have contrary ideas test their own hypotheses..","date":"2015-04-15","mins":"9:07 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196404","author":"colin_berry","post":"No test of a hypothesis is biased through failure to incorporate other people’s ideas. It is sufficient to state one’s own ideas, assumptions, even preconceptions. It really is time the host of this site made that clear..","date":"2015-04-15","mins":"8:38 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196426","author":"colin_berry","post":"Science is never purely and scientifically objective. It’s done by human beings, not pre programmed electronic robots. That’s why we put our ‘subjective’ hypotheses to the experimental test. It’s the interpretation of those experimental tests that needs to be objective, meaning that the same could have been arrived at by a totally disinterested outsider invited to examine the data (like a peer review journal referee) with no personal axe to grind..","date":"2015-04-15","mins":"11:17 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196423","author":"colin_berry","post":"There is no obligation on the part of researchers to state their hypotheses. A few do, most do not. They simply report the results of their experiments and their conclusions.That is one more reason for not attacking hypotheses (on the rare occasions when divulged) for failing to reflect or incorporate one’s own ideas. It is mental laziness to expect others to test one’s own ideas, or even pay lip service. If it’s your ideas, do your own hypothesis testing (with or without stating in advance what hypothesis you were testing)..","date":"2015-04-15","mins":"10:40 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-8267","author":"colin_berry","post":"Correction: for galactosamine read galactose..","date":"2012-02-15","mins":"5:47 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","title":"New thread on type AB blood: Does all old blood become AB?"},{"id":"comment-196430","author":"colin_berry","post":"I don’t know what they were thinking at the hypothesizing stage, but then neither do you for that matter. But as I’ve said, it’s of absolutely no relevance. It’s the final data that matter, and the researchers’ conclusions, with or without the initial hypothesis being articulated. Stop subjecting scientists to the third degree. It’s not how the merits v demerits of a case are judged. Stick to the facts..","date":"2015-04-15","mins":"11:48 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-8266","author":"colin_berry","post":"All blood to revert to Type AB? Well, I’m just a plain old biochemist by training, not an immunologist, but am capable of consulting wiki the same as everyone else: chemical differences between ABO blood types For reversion to AB to occur, some quite remarkable biochemistry would have to take place. Blood group O would have to acquire a NAG terminal on its carbohydrate chains, i.e. N acetylglucosamine, which it does not have in its existing chains, at least those on the red cell membrane. For blood group A, to become AB, it would have to acquire copies of its A, but with a crucial modification: a terminal NAG would have to become a galactosamine residue. The mirror image would have to happen for B to become AB, i.e. With galactose turning into NAG. Maybe there’s a post mortem enzyme that works away in dried blood stains doing all this to intrigue future forensic archaeologists But what to call the two amazing enzymes? How about ABO glycosylation conjureuperase and swaparounderase?.","date":"2012-02-15","mins":"5:45 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","title":"New thread on type AB blood: Does all old blood become AB?"},{"id":"comment-8270","author":"colin_berry","post":"Oops. Yet another correction: for N acetylglucoamine, read N acetylgalactosamine. How I wish Word Press allowed a preview or ability to edit! I’m hopeless at spotting the typos in spider’s thread type face..","date":"2012-02-15","mins":"6:10 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","title":"New thread on type AB blood: Does all old blood become AB?"},{"id":"comment-8286","author":"colin_berry","post":"Click on that link to the graphic, Ron. Don’t be scared. Treat it like a Krypton Factor puzzle – all the information you need is there. No specialised knowledge of immunology or biochemistry is required – just the ability to compare sugar sequences in the carbohydrate side chains associated with membrane associated glycoproteins (which are the cell surface associated antigens responsible for ABO blood group incompatibilities).. There can be no such thing as “degradation” to Type AB – it would require addition of sugars or sugar derivatives that are not already there (O to AB) , or substitution of one type of sugar for another A to AB; B to AB). In short it would require highly precise chemical synthesis and/or modification. It’s the sort of thing that might be possible in principle in the Golgi vesicles of a healthy functioning liver (though not in any metabolic pathway that I know of) but definitely not in a post mortem sample of dried blood..","date":"2012-02-15","mins":"9:27 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","title":"New thread on type AB blood: Does all old blood become AB?"},{"id":"comment-208880","author":"colin_berry","post":"Quote from John Heller, p 88: To Ray Rogers, at a piloting session pre Turin, August 1978: “If blood is present, we’ll find it,” I assured him, and added , “I just wish I were going with you” (Roger’s reply): “You’re not coming?” “Nope. Just one extra body. I guess I’ll have to wait till you get back.” (Rogers): “Too bad. It’s the chance of a lifetime.” “Yeah, but I guess they also serve who only stand and wait,” I found myself saying wistfully.” Bizarre: totally bizarre – to be proactive as Heller was in expressing an interest in being part of the STURP team, and then to back out of actually seeing it with his own eyes at close quarters – passing up a once in a lifetime opportunity – to say nothing of seeing the blood and image samples in situ instead of relying entirely on Rogers’ sticky tape samples with a few attached fibres and no “context”. Nope, not just bizarre but a total dereliction of scientific duty, or even mere curiosity (supposedly the driving force of science, the thing that supposed to make scientists tick). Sorry, someone had to say it. Then there’s the small matter of how he recruited Alan D.Adler, someone else who didn’t bother to go to Turin, the scientist who Barrie Schwortz routinely describes as a world expert on blood (he was nothing of the sort, being a porphryin chemist). See how Heller describes his first mention of Alan Adler:Page 132: “Then a colleague, Professor Alan Adler, popped into my mind. I had worked with Dr.Adler on various projects over the years. He would admit to being a physical chemist, thermodynamicist, and a porphyrin nut. He is a Renaissance man, with an encylopedic knowledge of the physical and biological sciences, military history, ecology and many other fields. I wondered whether he would be interested, and I decided to approach him sideways.” “Al,” I said enthusiastically, “how would you like to get involved in a real fun project? It even involves porphyrins.” “Oh yeah? Did you say fun project?” “Yup. It might turn out to be the most fun you’ve ever had on a problem.” “Sounds interesting. Are you guaranteeing it will be fun?” “Definitely” Some might consider that the above exchange adds a whole new meaning to “enthusiastically” and “fun”, namely to insinuate oneself “enthusiastically” or be recruited by a chum into a “fun” project and then let others do the tedious trudge to Turin to collect the samples. “Yup, the blood is unnaturally red, didn’t ya know? I’ve seen the fibers in Rogers’ sticky tape with my own eyes and oh boy are they red” or “Yes, there’s “extraordinary amounts of bilirubin” based on my microchemical spot tests (just don’t ask for the hard data).” And this is the stuff of books and memoirs? Science at second hand? Science by special courier delivery? The Sticky Tape of Turin?.","date":"2015-08-24","mins":"12:37 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-208969","author":"colin_berry","post":"John Heller wrote a complete book, all 225 pages of it, relating his involvement with STURP from its early beginnings, starting with his secretary making the first contact with John Jackson. In addition, it was he who recruited Alan Adler to STURP, someone whom he describes as an acquaintance. Yet neither he nor Adler could be bothered to make the trip to Turin to see the linen with their own eyes, yet felt competent to make highly cited comments about “blood that was too red” etc, all based on sticky tape samples supplied to them by Ray Rogers, and then went on to write books and memoirs. Speaking as a retired scientist who once held a highly responsible postition, advising an entire industry on matters to do with food safety (FMBRA, 1978 1990), often at short notice, requiring that I “drop everything” I frankly find the failure of either of them to accompany the STURP team to Turin, yet write books and memoirs as if fully fledged members, an appalling lapse of professional standards which Heller’s book fails to explain (certainly there’s no hint of financial considerations). If it’s “ad hominem” to condemn a gross breach of professional standards the I plead guilty as charged. Would it be “ad hominem” to report a physician who failed to spot the symptoms of meningitis, sending a child home with some junior aspirin, or an airline pilot who looks unsteady on his feet? University academics are not usually held to the same professional standards as those in front line professions, but in this instance – where there was a rare, once in a lifetime invitation to scrutinize the “Shroud” at close quarters for an entire week, and indeed take samples – the failure of two senior STURP “team members” to be there, viewing the object with their own eyes, is frankly beyond belief. I say it was a gross lapse of professional standards on both their parts, hopefully temporary. Sorry to speak ill of the dead – but that’s the nature of science – one’s positive OR negative contributions can live on long after one has shuffled off the proverbial. People chancing on published work, today or in 10 or 20 years time, have no way of knowing if the author(s) are still alive..","date":"2015-08-25","mins":"2:56 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-208995","author":"colin_berry","post":"“But it is absolutely unnecessary to launch baseless attacks on their character and accuse them of negligence or worse, which you have done on numerous occasions” But that statement is itself a character attack! What’s more it broadens the issue to things I’ve said in the past, attempting to portray me as a serial offender in making “baseless” attacks. ALL my comments re John Heller, Alan Adler, Ray Rogers etc, far from being baseless, have addressed highly technical details to do with experimental protocols and modus operandi, with a common factor emerging in all cases, namely scientists with certain specialized backgrounds going way beyond their areas of specific competence, and performing essentially as gifted and in some instances ungifted amateurs, often mixing fact and speculation leaving this reader at least flummoxed and bemused. This is NOT a character attack. It’s a criticism of their lack of professionalism in certain highly specified areas (it is and never was generalized beyond that). Barrie has gone way, way beyond the initial flagged up issue re Heller and Adler’s failure to go to Turin in 1978. The issue has been widened and turned into a serious slur on this investigator’s character. I request that he (or Dan Porter) remove the quoted passage at the earliest opportunity. Now would seem to be as good a time as any..","date":"2015-08-26","mins":"1:38 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-208870","author":"colin_berry","post":"Beware attempts to implant the idea that either John Heller or Alan Adler went to Turin in 1978 as part of the STURP team. That was not the case. Both worked with sticky tape samples supplied by Ray Rogers. I’m not saying this reader’s comment is trying to mislead – though it might have been better if he’d indicated that the “meal with Barrie Schwortz” must have been much later. But this is not the first time I’ve seen something that could be taken to mean that two absentee members were there, possibly to boost their credentials as fully involved rather than associate status STURP Does it matter? Oh boy does it matter. (“Blood too red, must be trauma bilirubin bla bla”)..","date":"2015-08-24","mins":"9:49 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-25733","author":"colin_berry","post":"Er, why not ask him directly, Richard/Jabba? If you can post comments to the Randi forum (where I failed not just once but twice to register) surely it’s not beyond your ability to post to another Word Press site (mine!)? PS It depends what you mean by real blood… ; ).","date":"2013-02-26","mins":"9:51 am","url":"https://shroudstory.com/2013/02/26/that-is-not-what-one-would-expect-to-see-if-the-blood-first-dogma-were-true/","cat":"blood_studies","title":"That is not what one would expect to see if the blood-first dogma were true."},{"id":"comment-129352","author":"colin_berry","post":"I had a little chuckle at the putdown of “self styled” scientists, followed by that reference to singlet oxygen as a “free radical”. Singlet oxygen, lacking unpaired electrons, is NOT a free radical (it would not be able to survive for an hour or more under normal environmental conditions if it were). In fact it is ordinary unreactive ground state triplet oxygen that is the free radical, albeit a diradical with two unpaired electrons. .O=O. People who live in glass houses ….","date":"2014-06-14","mins":"4:51 am","url":"https://shroudstory.com/2014/06/14/paper-chase-a-natural-stochastic-process-may-explain-the-coexistence-of-bloodstains-and-an-image-on-the-shroud-of-turin/","cat":"blood_studies","title":"Paper Chase:  A Natural Stochastic Process May Explain the Coexistence of Bloodstains and an Image on the Shroud of Turin"},{"id":"comment-25749","author":"colin_berry","post":"Richard: I’ve adopted a new blogging format, or rather the original one from the Ark (blog = web log) which allows one to cover a range of topics in each posting. I’ll add a paragraph or two tomorrow to tell you where this free spirit stands on Shroud “blood”. Be prepared for a surprise. Http://shroudofturinwithoutallthehype.wordpress.com/.","date":"2013-02-26","mins":"12:58 pm","url":"https://shroudstory.com/2013/02/26/that-is-not-what-one-would-expect-to-see-if-the-blood-first-dogma-were-true/","cat":"blood_studies","title":"That is not what one would expect to see if the blood-first dogma were true."},{"id":"comment-10681","author":"colin_berry","post":"Hello again Kelly While not wishing to appear too dogmatic about Adler’s proposed sequence of events, I feel that Occam, taking at look, would decide to put his razor away in its box, rather than have it blunted. But even if Adler’s multiple event scenario were true, and a novel trauma induced complex of high spin methaemogobin and bilrubin accounted for the red colour and spectrum, it would still leave a physicochemical elephant in the room. Why should that novel association between porphyrin and bile pigment confer everlasting chemical stability on its two components, notably bilirubin which as we know is highly sensitive to degradation by light and oxygen? Personally i consider it exceedingly improbable that the red colour is due to surviving blood pigments, whether in novel association or not. It is far more probable that it represents an exogenous pigment – chemical constitution still to be determined. But that would mean that at some stage in its history the Shroud had been doctored to make it look as if it carried stains of real red blood. If that were the case, then who is to say that real blood has not also been added from time to time? That could give rise to a heterogeneity in “blood” stains, with some real, some simulated with a dye or pigment, or even mixtures where one overlays the other. As for Saponaria, I confess to being mystified. I can understand why Adler’s internal haemolysis can produce at least some additional bilirubin (though probably not nearly as much as suggested) akin to marathon runner’s foot strike haemolysis. But why should external haemolyis, through contact with natural detergent, alter the colour or stability of the haemoglobin, or porphyrins. All it would do surely is to lyse red blood cells, releasing haemoglobin, but it would simply oxidise and darken as per usual, with or without the natural soap being present. Since when has soap been an agent that confers everlasting chemical stability? It’s suggested elsewhere that I have changed my stance on “blood”, since commenting on that splendid contribution of yours.Not so. I was simply commending you on the clarity of your exposition re blood typing, in particular those false positives, false negatives and possible interferences from microorganisms etc. Nowhere did I say that I accepted without reservation with any of the blood typing results of those whose work you cited, given the “awkwardness” of the material under test. But that’s the internet for you. Folk can always be relied upon to read more into one’s comments than one has actually said. Those blood stains will look like a side show, compared with the post I am preparing for tomorrow … Some folk here will need to have their tranquilisers and blood pressure pills handy. Hint: New Bridge (Paris)..","date":"2012-04-21","mins":"5:55 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","title":"Was Adler’s Analysis Science?"},{"id":"comment-187172","author":"colin_berry","post":"” What I have read is that the DNA from the blood samples removed from the Shroud are all the same.” What follows was hardly a ringing endorsement from immunologist Kelly Kearse , ekmcmahon, addressing the 2014 St.Louis gathering. Final sentence of his pdf: “In summary, DNA studies have the potential to distinguish if the bloodstains are representative of a single or multiple individual(s) at the molecular level. Additionally, a molecular biology approach could potentially be used to demonstrate that a DNA signal is present on the Shroud that originates from blood cells.” Note the use of the terms “potential” and “potentially”. If reliable data existed to support your assertion for TS blood samples all having “the same DNA”, one might have expected Kelly’s summary to have been somewhat less guarded, dare one say more positive. Remember: only a minority of blood cells (the white nucleated ones) have DNA. The vast majority are mature red cells which lack a nucleus. Add to that the fact that TS blood seems largely free of cellular debris (prompting no doubt that Adler/Heller description of TS ‘blood’ as a ‘serum exudate of retracted blood clots’), plus extensive DNA degradation plus adventitious contaminating DNA then it’s unlikely there’ are going to be hard and fast answers for the origins of Shroud DNA, such as it is, any time soon..","date":"2015-01-29","mins":"6:21 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187235","author":"colin_berry","post":"Sorry John, but I can’t agree with a single word of your summary; The reasons have been set out before, here and on my own site(s).Y our take has been heavily Adlerized then lightly Hellerized for good measure, and is totally wrong, wrong, wrong. As I’ve said before, the TS is either authentic, assuming the radiocarbon dating was spectacularly wrong (which would require a huge stretch of the imagination) OR… it’s a brilliant 14th century hoax/forgery conceived and executed by a perfectionist, one who was 100% dedicated to his one off project. He may have had a partner with a flair for marketing the end product or simply as an extra pair of hands.. I visualize them in my mind’s eye as looking something like this similarly single minded pair of individuals unencumbered with a strong moral purpose in life. While not wishing to make light of their nefarious activities, it’s possible they never thought of themselves as ‘breaking bad’ , not in the greater scheme of things..","date":"2015-01-29","mins":"10:36 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-25736","author":"colin_berry","post":"In pursuing me from pillar to post (for a year or more), P has been doing a very passable imitation of an internet troll. I shan’t be here to read any reply, having a plane to catch, but I do think it’s time she stopped trying to over empathize with, or fight other people’s battles.The victims of my terrible verbal onslaughts are not shrinking violets,so should be perfectly capable of defending themselves. (Wouldn’t you agree Miss?).","date":"2013-02-26","mins":"10:10 am","url":"https://shroudstory.com/2013/02/26/that-is-not-what-one-would-expect-to-see-if-the-blood-first-dogma-were-true/","cat":"blood_studies","title":"That is not what one would expect to see if the blood-first dogma were true."},{"id":"comment-188404","author":"colin_berry","post":"Ingenious, and possibly even correct Max, if as you maintain the bronze is 20th century. Given that I can think of no other obvious explanation for pincers/pliars being used at that low level just above the feet, yours seems a highly credible explanation. Can anyone else think of reasons why that hardware should be shown in a 20th century representation of the flagellation (as distinct from the subsequent crucifixion where that pinching/gripping hardware is often shown, even in the 1357(?) Lirey badge, presumably to remove crucifixion nails, though one has to look hard to see it)?.","date":"2015-02-02","mins":"10:47 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-25753","author":"colin_berry","post":"The information requested in the last but one paragraph has been added to my current posting (second most recent addition). The enhancement/colour differentiation was obtained mainly by use of maximum contrast. No artificial colourings were added, but the preservatives seem to be working. Http://shroudofturinwithoutallthehype.wordpress.com/2013/02/26/shroudie alert day 8/.","date":"2013-02-26","mins":"2:44 pm","url":"https://shroudstory.com/2013/02/26/that-is-not-what-one-would-expect-to-see-if-the-blood-first-dogma-were-true/","cat":"blood_studies","title":"That is not what one would expect to see if the blood-first dogma were true."},{"id":"comment-188299","author":"colin_berry","post":"Here’s another representation of the scourging which also shows a chain being used as restraint that is around the midriff – as well as wrist. Can anyone explain what the fellow is doing with those pincers?.","date":"2015-02-02","mins":"5:47 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188421","author":"colin_berry","post":"If you would care to compose a simple question (or structured series of questions) re bilirubin, I’ll try to answer it to the best of my ability, piero, my having researched and published on model systems for phototherapy of neonatal jaundice way back in the early 1970s. Kindly try to focus on specifics..","date":"2015-02-02","mins":"11:21 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188891","author":"colin_berry","post":"Good evening to you TH. What are these products ? – Are these products stable ? The final end products of bilirubin photodecomposition are dipyrroles (propentdyopents.) or monopyrroles (e.g. Methylvinylmaleimide). Stability is a relative term, but these are certainly stable relative to the parent tetrapyrroles, bilirubin especially. But there are intermediate products that are less extensively degraded. There’s the isomeric bilirubins with cis trans transformations involving the vinyl side chain. There are the dioxetanes formed by addition of singlet oxygen across the conjugated double bond systems, and the dihydroxyl derivatives (rhodins etc) that Don Ostrow, John Zarembo and I identified and reported in 1972. – What is the color of these products ? Dipyrroles and mono pyrroles are generally yellow or colourless. Intact oxidised tetrapyrroles and tripyrroles can be green, red, purple or yellow! – Do you think that these products could nevertheless give positive tests for “bilirubin” (the tests used by Adler and Heller)? No. It’s the central CH2 bridge of bilirubin that separates the two dipyrrole halves of the molecule that confers the chemical reactivity that enables it to form purple or red products in the Van den Berg reaction with diazotized sulphanilic acid. That central CH2 group is generally the first thing to go when bilirubin is photoxidized, resulting in rapid loss in diazo reactivity. What do you mean by “… and does not store well.” One would find progressively less “bilirubin” if one stored the pigment without proper protection from light and oxygen. One could monitor the oxidation by loss of diazo reactivity, or by watching the loss of the high Rf orange spot on thin layer chromatography. In other words, can you please explain us why the yellow green fibers, shards etc. Found by Heller and Adler in the blood and serum areas have nothing to do with bilirubin decomposition products? Remind me please. Did Heller and Adler identify those yellow green fibres as being biliverdin or bilirubin photoproducts? If so, what did they deduce from that as regards parent bilirubin, which I say could not possibly have been present after so many centuries exposure to light and oxygen. Incidentally, you wrote: ” Adler’s claims are refuted by his own later acknowledgement that bilirubin is photosensitive, being converted, as we’ve said, by light and oxygen to water soluble degradation products.” Do you have the link or the reference? https://www.shroud.com/adler1.htm See section on non ionizing radiation. I trust that helps. Don’t hesitate to let me know if this fails to answer your queries..","date":"2015-02-03","mins":"5:04 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188806","author":"colin_berry","post":"Sorry, piero, try hard as I may, I do not understand your first question: “What decomposition products may give the degradation of bilirubin?” Bilirubin is converted by light and oxygen to decomposition products. It’s another way of saying that bilirubin is chemically unstable and does not store well. Neither do I understand what bilirubin photooxidation or photoisomerism has to do with the crucial issue here, namely Adler’s claims re bilirubin being responsible for the allegedly permanent bright red colour of TS blood. Adler’s claims are refuted by his own later acknowledgement that bilirubin is photosensitive, being converted, as we’ve said, by light and oxygen to water soluble degradation products. That’s the only part of your focus on bilirubin that is relevant – namely the fact that it can’t possibly function as Adler initially claimed as a ‘preservative’ for blood. It’s bilirubin itself that needs preservative! In fact bilirubin will last indefinitely if protected from light and oxygen, which is hardly the case for a centuries old artefact that was periodically brought out its reliquary for display. Of course, the TS is now protected by an argon atmosphere, but any bilirubin that was in the original bloodstains would have degraded rapidly, for the same reason that prematurely born jaundiced infants with unconjugated hyperbilirubinaemia, gradually lose their yellow skin coloration when placed under bright visible white light (avoiding brain damage, i.e. Kernicterus). It’s the 450nm blue component that is most effective in photodegradation of bilirubin in vitro, and similarly in phototherapy in vivog..","date":"2015-02-03","mins":"9:46 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-189417","author":"colin_berry","post":"“Adler never eliminates his “bilirubin hypothesis” because of the fact that bilirubin is photosensitive.” But he does precisely that, TH. I say that with total conviction. Adler used that section under “Non ionizing radiation” in his 1993 paper essentially to retract his bilirubin hypothesis. It should never have been proposed in the first place, misusing as he did a ‘microspotting’ technique with a non specific colorimetric test (Ehrlich’s reagent) to make quantitative statements (“extraordinary amounts of bilirubin”). Nor should he have made references to “trauma” causing his claimed ‘extraordinary’ levels of bilirubin. In so doing he betrayed a pro authenticity bias. STURP was there to collect the evidence for or against authenticity – not to go preempting debate with airy fairy pro authenticity hypothesizing..","date":"2015-02-05","mins":"1:22 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-189810","author":"colin_berry","post":"When Adler put forward his idea that bilirubin was responsible for the permanently red colour of Shroud blood, there was no mention of bilirubin’s fragile nature. One has to assume that he was untutored in bilirubin chemistry, the latter being entirely different from that of the chemically more stable porphyrins in which he specialized. But come 1993 he suddenly changed his tune. Now he was recognizing that bilirubin is unstable towards light and oxygen, and that instability might then also de stabilize linen. What is that if not a late de facto retraction of his initially misguided thinking? How could bilirubin possibly be held to stabilise the red colour of ancient blood, while simultaneously breaking down and damaging linen in the process? The two positions were entirely at odds with each other. No, he didn’t say “I retract”, but his volte face made it abundantly clear that he had abandoned his initial position, which amounts to the same thing – an admission of error, an oversight, a retraction. Adler got it wrong seriously wrong but his “trauma bilirubin’ narrative continues to be proselytized to this day. Science is supposed to be self correcting. Shroudology clearly is not – more’s the pity..","date":"2015-02-06","mins":"6:21 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187257","author":"colin_berry","post":"Storyline: long running US TV series Breaking Bad http://www.imdb.com/title/tt0903747/ “When chemistry teacher Walter White is diagnosed with Stage III cancer and given only two years to live, he decides he has nothing to lose. He lives with his teenage son, who has cerebral palsy, and his wife, in New Mexico. Determined to ensure that his family will have a secure future, Walt embarks on a career of drugs and crime. He proves to be remarkably proficient in this new world as he begins manufacturing and selling methamphetamine with one of his former students (Jesse Pinkman). The series tracks the impacts of a fatal diagnosis on a regular, hard working man, and explores how a fatal diagnosis affects his morality and transforms him into a major player of the drug trade. Might the TS have been conceived and executed by the medieval equivalent of our “Walt and Jesse”. Those two (master and student – see above) set out to supply home made “crystal meth” (methylamphetamine, a potent stimulant) of the highest purity and potency to a segment of the drug dependent population desperate for its next mind transporting fix. Light hearted analogy. Not to be taken too seriously..","date":"2015-01-29","mins":"12:26 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188414","author":"colin_berry","post":"PS: but if we’re into spy clue symbolic art, then the pincers/pliars, if seen as a coded motif, might equally well be a stylized cross, i.e. The cross, snuck in to signal what was to follow. Beware: this cryptostegano wotsit is catching….","date":"2015-02-02","mins":"11:10 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188457","author":"colin_berry","post":"Shroudology is, for the most part, an academic wasteland. I know, having spent 3 years searching for something that would disabuse me of that view. If I had to summarise my case with just one example, it would be, without hesitation, the Hungarian Pray Manuscript. Scholarship? Do me a favour..","date":"2015-02-02","mins":"12:39 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188441","author":"colin_berry","post":"The thing that seems to differentiate genuine from would be academics these days is diligence and spadework, The would be academic seizes upon something – a supposed insight or brainwave – and immediately rushes to publish, whether as a book, a pdf or a comment on a web forum. The genuine academic bides his/her time. First impressions can be misleading. First impressions need to be carefully corroborated by looking at as many related examples as possible. All to often, one’s first impressions melt away. The Hungarian Pray Manuscript and its supposed pre 14th century provenance of the TS is a prime example of premature publication. Those imagined sightings of the “L shaped poker holes” are frankly first impressions and fanciful delusions that simply do not stand up to serious scrutiny, lacking what one might call internal AND external consistency. It’s spurious statistical correlation based on a sample size of 1. The same might be said of the Sudarium of Oviedo. I’ve refrained from commenting on it so far, failing to see any credible evidence whatsoever for the claimed correspondence between its blood pattern and the Turin Shroud. (Sorry Mark Guscin). Why bother commenting on so called evidence that is not evidence at all – merely wishful (clearly) narrative driven thinking dressed up as scholarship?.","date":"2015-02-02","mins":"12:09 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188469","author":"colin_berry","post":"I have been monitoring the views expressed here and elsewhere on the Sudarium of Oviedo and refrained from comment. Genuine, i.e. Published scholars, which you are not Max, should not presume to know the (unpublished) thoughts of genuine scholars with a track record of published peer reviewed research findings. If you wish to be taken seriously Max – then publish. A blog site (your own) will do for starters. Sorry to be so frank.. Someone has to say it. Stop posing as an authority. You have zero credentials as an academic..","date":"2015-02-02","mins":"1:08 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188847","author":"colin_berry","post":"We’ve been here before Max, a year ago. A paper submitted to a conference is not generally regarded as having been ‘peer reviewed’, and Dr.Nicolotti in Turin (see below) commenting on this site was not able to track down that single submission anyway. As I say, Max, you should as a first step set up your own internet site for proselytizing your views if you wish to be regarded as “published”. Max Patrick Hamon March 15, 2014 at 9:39 am BTW my paper is in French, see Loches, Graffiti anciens, “QUATRIEME RENCONTRE” 2006 (Proceedings of the 4th National Symposium of Glyptography, 2006 Loches). It was published in December 2010. You can order the book to the Musée Serge Ramond “La mémoire des murs”, Place de Piegaro, 60550 Verneuil en Halatte France – Telephone :(00 33) 03 44 24 54 81. Note: in 2012 I rewrote, revised and completed my paper to insert it in a collection of my 2004 2007 studies of the Coudray Tower enigmatic graffiti (Templar Glyptography). Hopefully the collection is to be published in December 2014… Andrea Nicolotti March 29, 2014 at 8:43 pm Mr, Hamon, I cannot find your article because the publication “Loches, Graffiti anciens, “QUATRIEME RENCONTRE 2006″ is practically impossible to find. And it is not exactly the kind of publication I had imagined. No problem. It is not important. I still wait for: 1) an example of the “dual letter” (an E within a U). 2) the colon “:” as a contraction for NOSTER DOMINVS. Thanks.","date":"2015-02-03","mins":"1:28 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188475","author":"colin_berry","post":"This comment is a prime example of what you consider to be supportive evidence Max. It’s nothing of the sort. It’s descriptive detail, not evidence. Descriptive detail and evidence are two entirely different things. You cannot hope to persuade or convince people by blasting them with descriptive detail..","date":"2015-02-02","mins":"1:27 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188698","author":"colin_berry","post":"Actually, as I’ve had to remind Max many times previously I am not a chemist by training, but a biochemist, which is something entirely different, A biochemist is less concerned with the details of particular atoms and molecules, and more with the way that living cells function at the molecular level (enzymes, metabolic pathways, biomembranes, subcellular organelles, energy transduction etc). All three of my degrees are in biochemistry. All of my published work is in biochemical or clinical journals. The remit of the biochemist is much, much wider generally than that of the chemist since the focus on life processes interfaces more closely with physiology and medicine. However if past performance is anything to go by, my saying, nay repeating this will not make the slightest bit of difference where Max is concerned. He will continue to refer to me as a chemist, which I am not and never have been..","date":"2015-02-03","mins":"1:31 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188711","author":"colin_berry","post":"Incidentally, I did some quick research on the difference between pincers and pliars. The tool in the bronze is indeed correctly described as ‘pincers’, not pliars due to the shape and angle of the grip jaws. Http://en.wikipedia.org/wiki/Pincers %28tool%29 That still leaves unanswered the question I posed earlier asking what they were doing in a scourging scene. On reflection, I cannot agree with Max re his claimed ST (Shroud of Turin) configuration of the pincers. There are no grounds for identifying anything in that bronze as being Shroud related. Might they be there as a token and/or symbolic representation of an instrument of torture? The above wiki link briefly mentions that pincers were used as such in Roman times, sometimes red hot!.","date":"2015-02-03","mins":"2:54 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188845","author":"colin_berry","post":"How come Hugh? Had Jesus had a hamstring severed he’d have been unable to carry a cross, surely?.","date":"2015-02-03","mins":"1:19 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188749","author":"colin_berry","post":"Seems we see eye to eye on on thing at any rate, daveb, namely that the pincers are there for symbolic value only – maybe to make flesh creep at the mere sight of them (victim’s and viewers alike). However, they do seem a curious feature to include so prominently, given at first sight they appear out of context (pincers being a standard item in the checklist of crucifixion hardware in Western art, along with nails, lance, sponge etc etc). Apologies btw for my misspelling of pliers. The key distinction between pincers and pliers, according to my Collins’ dictionary, is that pincers have those curbed bevelled ends that are good for making close contact with embedded object (nails etc) with a view to pulling them out. Pliers tend to have serrated jaws and are intended more for squeezing, though quite what it doesn’t say. I note your earlier comment re not placing too much reliance on art if wishing to fill in the gaps re the biblical record or be better informed as to Roman punishment and crucifixion. That I take as read. But time and again on this site we see interest and puzzlement from both pro and anti authenticity positions re the curious blood imprint across the small of the back, one that looks chain like, or maybe a twisted double coil of rope. (Yes Max, I agree it’s a rope in your close up, but that does not undermine my case). For my part, I once proffered the view that the imprint was evidence for thinking the man on the Lirey badge had not been the victim of crucifixion, but of roasting at the stake, a view that was supported by the de Charny/de Charney link, allegedly nephew and executed Templar uncle respectively. It had not occurred to me at the time that the “blood belt” (Wilson’s term) could be a visual cue to the treatment that had taken place before crucifixion, i.e. Scourging, with a chain or rope restraint. The only role I could see for the chain was as a restraint for burning at the stake (again, supported by art). A blood imprint that is not (or need not necessarily) have been from a wound, but merely from contact imprinting from a bloodied chain or rope must have implications for the debate as to whether the body would have needed to have been washed to produce the entire set of blood stains, via assorted mechanisms including new seepage of blood etc. So there’s still a valid place methinks for finding time to scan image files of western art to get new ideas that might otherwise not have occurred to one, while accepting that no one artist holds a monopoly of wisdom and insight. Indeed, some like the bas reliefartist above with those mysterious pincers, probably like nothing better than to tease the first cohorts of viewers, it being a means of getting his or her work better known and talked about. Theirs is a competitive environment with keen rivalries. The same might be said about shroudology, for better or for worse..","date":"2015-02-03","mins":"6:13 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188771","author":"colin_berry","post":"The sole purpose in putting up those pictures was to show there are precedents in art for a physical restraint – chain or rope being used in an artist’s reconstruction of the flagellation. That was to to reinforce the suggestion that what we see on the dorsal side of the TS is an imprint in blood from a chain or rope. In no way does that imply that either of the two artists was attempting to hint at any connection with the TS. Why should they? It is you Max who has made that connection with your ‘pliers =TS’ theory, one I was initially prepared to consider, but subsequently rejected in favour of a different kind of symbolism (pliers, or as I prefer to say, pincers = simple pictorial symbol for imminent torture, real or threatened, over and above flagellation per se, ). If it’s all the same to you Max, I’ll terminate this rather tiresome discussion now, with its entirely uncalled for references to snakes and eels. Having I trust made my meaning clear to others on this site..","date":"2015-02-03","mins":"7:33 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188883","author":"colin_berry","post":"Are we talking about methylphenidate (MPH, more widely known as “Ritalin), Max … or the other MPH, the one who sees spy clues in everything his eyes light upon?.","date":"2015-02-03","mins":"4:14 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187245","author":"colin_berry","post":"Oh my, David, some folk do have a long memory. That leech idea was many moons ago (>30). I still have something of a soft spot for it, coming as it did as an immediate response to being challenged to say how one could paint with fresh blood, given that it would start congealing/clotting almost straight after drawing (from a human vein that is).. Actually, I’ve just gone back to that posting, August 2012, and am relieved to see that the idea was flagged up as a question. Any fool can ask questions that the wisest man can’t answer… Did blood sucking leeches help to establish – at least in some eyes – the ‘authenticity’ of the Shroud of Turin? https://shroudofturinwithoutallthehype.wordpress.com/2012/08/01/did blood sucking leeches help to establish at least in some eyes the authenticity of the shroud of turin/.","date":"2015-01-29","mins":"11:27 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187264","author":"colin_berry","post":"Musings you say, Stan? Maybe. But what are the alternatives, given that none of us are free to walk into a certain Turin repository, and ask that a certain case be opened to allow us to probe with our hand lens? But here’s a thing: Alan Adler and John Heller, may they both RIP, despite being billed as members of STURP, did not do that either. They never travelled to Turin with the STURP team. They stayed at home and were content to work on sticky tape samples provided by Ray Rogers, having never seen the sampling sites in situ with their own eyes. So one is fully entitles in my view to view many of their observations and certainly conclusions with a degree of circumspection. The idea that the TS blood is a “serum exudate of retracted blood clots” is one that should be treated with a great deal of scepticism. It appears to be based partly on a failure to see the “formed elements’ of blood, notably red blood cells or even remnants thereof. More importantly, there was a persistent current of narrative driven comment, what with speculation as to how dried (post crucifixion) blot clots could leave an imprint, to say nothing of “trauma” bilirubin, and relying on non specific chemical tests for bilrubin, The latter was almost certainly NOT present! Adler himslef admitted as much in 2000 in his conservation paper. Bilirubin is far too photosensitive to survive more than a few years, even in dim light, never mind centuries.The phototherapy of neonatal jaundice (which I researched in Philadelphia with the late Don Ostrow for two years) depends on the marked photo sensitivity and resulting chemical breakdown of bilirubin. It’s time to stop taking things on trust (Royal Society motto: Nullius in verba– take nobody’s word for it). We have the splendid Shroud Scope that allows us to see things with our own eyes, though it helps to adjust contrast, brightness, midtone settings etc to differentiate one thing from another. I’ve just this minute done that with the image that heads this posting. Note the heterogeneity, hardly what one would expect of a “serum exudate of retracted blood clots”. As I (and Hugh Farey) have consistently maintained for some 2 years or more, what you see is probably a partially detached blood stain, with some parts more intense than others. The fluorescent halo of the stain above (wrist blood) is not around the entire stain. It’s restricted to the small limb you see top left, where the image is most strong. What price a “serum halo” when it is so localized? I repeat: Nullius in verba. It’s time to shelve most if not all the received wisdom where TS imagery is concerned. Much was written before we had access to the Durante 2002 images, and there are almost certainly new insights to be gained from the Halta 2008 high definition images, once the Vatican sees fit to release them to the public domain and/or bona fide researchers..","date":"2015-01-29","mins":"1:23 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187274","author":"colin_berry","post":"… to say nothing of the fact that forensic pathologists acquire their expertise through investigating cadavers. What special insight can those pathologists bring to bear to a faint image on linen, centuries old, when it’s not even certain that the blood is whole blood, or even ‘real’ blood, and no agreed view as to how the basal body mage was formed? The case for authenticity cannot be based on spurious appeals to the ‘expertise of experts’. There are NO experts where the TS is concerned. All we have are opinions that are more of less better informed by the scant facts available..","date":"2015-01-29","mins":"2:35 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187279","author":"colin_berry","post":"OK: I am not the one who deploys “bilirubin” as an argument for anything. The case for suspecting that the “blood” on the TS might not be whole blood, or even real blood, is based on many other considerations, notably the absence of microscopic confirmation (lack of recognizable red cells), on the atypical porphyrin visible/uv spectrum. It was the latter that prompted Adler to invoke (read: dream up) a bilirubin association, omitting to isolate and characterize either the free porphyrin OR the bilirubin, totally inexcusable except that his test material was restricted to sticky tape sample of microgram quantities of blood stained fibres supplied by Ray Rogers). As for time scales of bilirubin decomposition, it’s impossible to generalize, given the range of factors that affect it – p H, protein binding, composition and intensity of light , oxygen access v nitrogen blanketing etc etc, When I helped set up a new lab with Don Ostrow in 1970 to investigate bilirubin photo transformation, the first thing we did was to remove 1 in every 2 of the lab’s fluorescent light tubes. There was no quantitative data – we simply had to compromise between excessive exposure of bilirubin to light, and the need to see what we were doing..","date":"2015-01-29","mins":"2:53 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187270","author":"colin_berry","post":"OK: here’s what Alan Adler himself wrote in 1993, effectively destroying his own case for a role of bilirubin in explaining the (alleged) permanently bright red colour of Shroud bloodstains (my italics): https://www.shroud.com/adler1.htm Non ionizing Radiation Exposure to non ionizing radiation, such as visible light will also lead to either direct photochemical damage to both the cloth and the images or indirectly to similar damage through photocatalyzed reactions brought about by the presence of photosensitizers. Trace transition metal compounds and, particularly, the relatively large amounts of various iron containing structures present can serve as such photosensitizes (sic) Such reactions can strongly affect the images. For example, the red color of the blood has been attributed to the presence of protein bound bilirubin being admixed with methemoglobin. Overexposure to ultraviolet and/or visible radiation could modify this color, as bilirubin can be readily and quickly photodecomposed under a variety of conditions …. (skipped passage) … Clearly, the Shroud should be maintained, as now, in the dark until such matters are thoroughly investigated. Alan Adler clearly saw the need to backtrack on his bilirubin hypothesis, but could not bring himself to make that abundantly clear. Note too that there was no attempt to attach exact time scales to bilirubin photo decomposition. (Nothing would ever happen in science it one was forbidden from mentioning susceptibility to this or that unless accompanied immediately by numerical data). Science is a process of progressive refinement. It’s difficult enough as it is, without being held to unrealistic standards. The reticence we see above in failing to come clean re premature and misleading announcements in research is not uncommon. We’ve all of us been there at one time or another.,.","date":"2015-01-29","mins":"2:24 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187303","author":"colin_berry","post":"Madder you say Hugh? That rings a bell, nay an entire peal of bells. Authentic acid blood mordanted the madder dyed Shroud of Turin pinkish red before image formation – Jesus was dead. Adrie van der Hoeven http://www.researchgate.net/publication/268125045 Authentic acid blood mordanted the madder dyed Shroud of Turin pinkish red before image formation   Jesus was dead 243 pages! I bet she drinks Carling Black Label..","date":"2015-01-29","mins":"4:59 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187305","author":"colin_berry","post":".","date":"2015-01-29","mins":"5:05 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187693","author":"colin_berry","post":"Google translate: The first thing to throw “trash” is the possibility of a medieval artistic image, be it a painting, a sculpture, a bas relief or template. Only “real body” can cause the imprint of the Shroud, and everything else is wasting time. So the only “via” is to Garlaschelli …… .. And that technique has already been discarded and discredited by Walter Mc Crone. Reply: Real body? By all means, as you immediately acknowledge later. Garlachelli did indeed use a real body as template. OK, that meant finding an alternative to direct thermal imprinting. Garlaschelli did just that, resorting to a two step with postponed heating. He used cold ochre pigment for initial imprinting. He then baked the imprinted linen in an oven to chemically etch the linen that had been in contact with the pigment (especially if contaminated with acidic impurities as may have been the case with medieval ochre if made by calcining green vitriol). Garlaschelli technique discarded? My Mc Crone you say? Methinks you are a little confused there Carlos. Mc Crone claimed to have found ochre traces, sufficient he considered to account for the imagem but failed to convince folk that the tiny specks of ochre he found were artist’s ochre. But that’s not the point. Had Garlachelli’s technique been deployed in medieval times using red ochre and its acid baggage to chemically etch the linen, then the ochre has then done its job, and it no longer matters a jot if there’s merely traces left for big shot microscopists to discover centuries later,.","date":"2015-01-31","mins":"4:49 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187642","author":"colin_berry","post":"Why recruit a specialist porphyrin chemist to a project when the latter’s response to an atypical porphyrin spectrum was to abandon chemistry, resorting instead to a combination of cookery and creative accounting? That’s without mentioning the betrayal of a pro authenticity bias (“trauma” bilirubin). I frankly do not understand why TH still hankers after the bilirubin story, not unless he too considers the narrative to be more important than the chemical facts, or rather absence thereof. Bilirubin was a total irrelevance, not least because of its instability to light and oxygen. Its author admitted as much in 1993. Please can we move on (consigning bilirubin to the dustbin of shroudology)?.","date":"2015-01-31","mins":"2:11 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187824","author":"colin_berry","post":"Thanks Hugh. You are of course correct. As I say, it takes a very close reading to appreciate the nature of the image forming mechanism, mainly because “artificial ageing” of the linen takes precedence over actual image formation. It’s a posting about blood, so I shan’t labour the point, but here are key sentences: “.","date":"2015-01-31","mins":"2:59 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187826","author":"colin_berry","post":"Oops. Let’s try again: Thanks Hugh. You are of course correct. As I say, it takes a very close reading to appreciate the nature of the image forming mechanism, mainly because “artificial ageing” of the linen takes precedence over actual image formation. It’s a posting about blood, so I shan’t labour the point, but here are key sentences: ” We used a previously aged (3h at 215 C) linen cloth for the development (sic)of the image” and earlier: An absolutely weighed amount of a suitable chemical sensitizer (ed. Finally settling on an approx 1% solution of sulphuric acid)can then be added to the neutral pigment (ed. Cobalt blue) for precise results.The artificial ageing (sic) that followed consisted of air heating of the linen in an oven for 3h at 140 145 C). As I said earlier, I don’t consider that second heating step should be be seen or described as an “ageing” process, given that has already occurred, and at a much higher temperature. It’s more to assist with the evaporation of water from the dilute sulphuric acid to make hot viscous concentrated sulphuric acid – a potent chemical dehydrating agent, one that gently pyrolyses linen carbohydrates, leading to chemical changes and yellowing probably not dissimilar from that obtainable by heating without the acid albeit at a much higher temperature. So there’s a sense in which Luigi’s procedure is in essence a process of scorching, the difference being that he can use a live human volunteer and cold acidified pigment for initial imprinting, and then do the oven baking of the imprinted linen while the volunteer heads off to the shower. If the aim of the exercise in the 14th century was (as I now maintain) to simulate a sweat imprint, then my simple contact scorching off a heated metal template is just an entry level model, one that is fine for modelling 3 D properties but not much else. Luigi’s model is more sophisticated in terms of dual stage technology, but the end result – a negative imprint comprising superficially pyrolysed linen fibres – is essentially the same chemistry, but achievable at a much lower temperature using dil.sulphuric acid as a sensitizer, and substituting (if desired) a real person for a bronze statue..","date":"2015-01-31","mins":"3:27 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187875","author":"colin_berry","post":"As stated earlier, Carlos, the two step Garlaschelli technology allows one to imprint off a real human being. You may fault the end result on this failure to match the TS in every detail, but that’s hardly surprising given our total ignorance of the events that produced the image. Personally I find his paper most enlightening, once the detail is fully grasped (it’s taken me much re reading to appreciate that his methodology is essentially a localised scorching under pigment imprint, facilitated by a combination of temperature and acid). So what is your objection – given that a TS like image can be produced from a real person, who could have lived in the 14th, not 1stt century? Yes, there’s much fine tuning needed, and indeed we may never get an exact match, or even hope to. But some of us at least are not attempting to produce a facsimile copy. We are responding to the claim that science is at a loss to explain the TS image, so it has to be the genuine burial shroud of Jesus of Nazareth, radiocarbon dating notwithstanding. Science is not at a loss – it is simply deprived access to the TS, and has to rely on the limited photographic data available and relatively few forensic leads obtained by STURP over a single week 35 years ago..","date":"2015-01-31","mins":"6:31 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187789","author":"colin_berry","post":"I re read the Garlaschelli paper, and even drafted a reply Carlos. But then a thought occurred to me. Why are we discussing the body image? The posting is about blood. While there is still some uncertainty – at least in my mind – as to the claim that blood, whether whole, partial, touched up, simulated, human or animal came before body image, the two image types – one red, the other yellow – are topics that are best discussed separately. One thing’s for certain: Garlaschelli’s paper needs very careful reading. Whilst the English is immaculate, it’s all too easy to misunderstand the final experimental protocol. The term “artificial ageing’ is used for oven heating both before and/or after application of acidified pigment. I’d have preferred that the second heating step had been described as accelerated thermochemical etching of linen fibres, not ageing, and also made a little clearer why Luigi used cobalt blue as neutral pigment, not red ochre (apologies for my earlier mistake in forgetting he made that substitution)..","date":"2015-01-31","mins":"12:44 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187981","author":"colin_berry","post":"Google translation: I mean the mark of a real human body that is anatomically correct, as is the imprint of the TS, and therefore arouses medical interest. A REAL size reproduction Garlaschelli is an anatomical CARICATURA and no health concern. To make anatomical CARICATURAS serves any procedure without the need of a real human body ……… you or I can do them perfectly. If science is able to explain and play an anatomically correct human imprint for any possible method in the thirteenth and fourteenth centuries, is welcome. Sorry, Carlos, but your concept of ‘anatomical correctness’ is simply not on my radar screen. “Anatomical correctness” is too subjective to be of any use where the TS image is concerned, except insofar as one sees the correct number of certain appendages, say, (e.g.hands) but not others (e.g.number of fingers and thumbs on those hands, where the TS image is clearly “incorrect” though not necessarily the subject from which the image was imprinted). When I look around at my fellow man, woman and child I see a huge diversity of body types. That’s reflected in the part that is most visible, namely the face, where there is no consistency between obvious ratios like height of forehead relative to width of face, and that’s without considering folk of widely different ethnic origins. If you then add to that the uncertainties about image formation – the apparently orthogonal projection of a 3 D image onto linen that either requires a kind of radiation unknown to science OR (more probably in my view) a direct imprinting mechanism, probably assisted by manual moulding of cloth to contours, maybe from a bas relief, at least for the face (see Garlaschelli) then one can quickly find oneself having to abandon any mental yardstick that one previously used to decide upon anatomical correctness v incorrectness. It’s like trying to define what’s a proper red or a proper blue. An absorption spectrum in the visible light spectrum might serve as an objective standard, assuming a single maximum and no minor peaks or shoulders (rarely the case) but the human eye forms its own judgements – and what one person’s eyes see as “correct” may or may not be exactly the same as another’s..","date":"2015-02-01","mins":"1:49 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188025","author":"colin_berry","post":"“Absurd debate” you say Carlos? Debate? Methinks you have suddenly descended to ridicule and browbeating. Your emotive rhetoric, which I decline to translate, invites no detailed response. If this “debate” is to get back on track, you would need to define precisely what you mean by “anatomically correct”. But I shan’t be holding my breath, given as I say the wide range of variation that exists in human anatomy and the uncertainties re image formation. Here’s a passage from Luigi Garlaschelli that I heartily recommend to you and others who deploy that term “anatomical correctness” as though it had talismanic properties: “The accuracy of the anatomy of the Man of the Shroud has been debated many times. Some researchers consider it flawless and perfect, others think it looks unnatural. According to Frederick Zugabe it may even show evidence that Jesus suffered from Marfan’s Syndrome, a rare hereditary disease having among its symptoms elongated limbs, long spidery fingers, and a long thin face. Since the image is fuzzy and ruined by burns, it is very doubtful whether accurate anthropometric measurements are possible (for example, in the front image the feet do not even show):thus the question remains unclear.” Keep calm and carry on!.","date":"2015-02-01","mins":"5:48 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188267","author":"colin_berry","post":"Could this be the answer to your question, Thomas. “The Flagellation of Christ” by the Master of Okolicsno, 1514 Most paintings of the same genre and period show the wrists bound and held high above the head. Opting for that particular choice of restraint could have had more to do with artistic convenience, allowing for the front of the victim to be a direct target, and not merely marked as a consequence of a ‘flick around’ of the tips from a flagrum applied to the back only. See also the Lirey pilgrim’s badge showing the coiled structure on the dorsal side, the one that Ian Wilson described as a “blood belt”. Maybe “blood imprint of chain links” as a carry over from the flagellation might be a better description of what we see on the dorsal TS, maybe somewhat stylized, depending one one’s position re authenticity (?)..","date":"2015-02-02","mins":"3:30 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187419","author":"colin_berry","post":"Speaking of which (bias and radiocarbon dating): if the sample site selected was so ill chosen, prompting terms like “radiocarbon fiasco” etc, implying it was the labs’ fault, then why did those “of faith” not say so at the time? In passing: John Klotz above has me and David Mo confused. While we have some views in common, we are not clones. If there’s a God, then He moves in mysterious ways, like sending us a present (the TS) that did not date to AD 33,+/ 100 despite the sampling being carried out in a Turin cathedral with Church folk officiating..","date":"2015-01-30","mins":"7:13 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188287","author":"colin_berry","post":"The coiled structure on the Lirey badge certainly extends out onto the linen on both sides, Thomas, making it seem more like a real rope or maybe chain than the secondary imprint left by either of those. That’s not to say that’s any more or less authoritative than Wilson’s ‘blood belt’ description, or the one here (‘chain imprint’). It may simply be the way the badge maker chose to represent unclear features of the Shroud that even he did not fully understand, and that’s before the added complication of the 1532 fire (see below). Here’s another thought, maybe out of the box. That Hungarian picture in my previous comment was painted 18 years before the Chambery fire. Maybe the artist had seen the TS, or been given a reasonably accurate description. Maybe the “chain” on the pre fire TS was seen to be definitely confined to the body image only, not extending sideways. Maybe what we see today as ‘chain’ extending out onto the linen, erroneously reinforced by the Lirey representation, is just a false impression created by fire damage, water stain or a combination of the two. Maybe Leonardo da Vinci took a good photograph of the TS prior to the fire. Has anyone checked his archives thoroughly? ; ).","date":"2015-02-02","mins":"5:01 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187762","author":"colin_berry","post":"Use CON+++ etc if you cannot read what’s below. It’s an enlarged screen shot of this site’s comment entry box..","date":"2015-01-31","mins":"10:19 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-137698","author":"colin_berry","post":"To you, and Louis: try these: http://www.sindone.info/POWER1.PDF http://www.sindone.info/POWER2.PDF I tell you, this guy is a genius (and I say that despite his pro authenticity).","date":"2014-07-13","mins":"1:21 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-137702","author":"colin_berry","post":"It’s “attenuation of radiation in AIR”, if you don’t mind my saying – and a qualifying, dare one say quirky assumption in the radiation hypothesis, one of which Bernard Power is deeply sceptical, and rightly so. Does Occams’ Razor Inc (motto: “We deal instantly with needlessly multiplied entities”) have a call out service?.","date":"2014-07-13","mins":"1:41 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-137752","author":"colin_berry","post":"The current blog topic put the spotlight on blood stains being out of stereoregister with body image. Today I discovered a place where ‘body’ image, in the widest sense of the term, is out of register with its own image, with implications for imaging mechanism. Where you might ask? Clue: it’s the chin/neck region, produced by a re routing of linen to follow facial contours as it was forced onto the underside of the chin before impacting on the neck and later the chest. It put surrounding image (hint hint) out of stereoregister. In short – no tenting of linen from chin to chest, as per Vignon diagram, but close conformity (under applied pressure) with body contours..","date":"2014-07-13","mins":"3:49 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-137810","author":"colin_berry","post":"Have just this minute put up a new posting showing where I see longer “hair” than has previously been supposed, due to a break in image continuity, i.e. ‘out of stereoregister’ http://colinb sciencebuzz.blogspot.co.uk/2014/07/could this be turin shroud image that.html Why out of register? Because the linen became kinked through being forced to follow the contours under the chin before meeting the neck. So there was NO tenting across the chin chest gap , contrary to the Vignon radiation model (see diagram) with its large supposed cloth body separation at that point. Instead, there’s a light band, corresponding with low contact pressure between underside of chin and linen, and below that a more intense band, due to higher impaction pressure against the ‘square on’ neck..","date":"2014-07-13","mins":"5:46 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-137821","author":"colin_berry","post":"In a word, pressure (or impaction). In other words the linen was not draped loosely over the subject (whether corpse or statue) as imagined in radiation models. More likely, at least where the frontal image is concerned, the subject was forced face doen down into the linen, probably with something soft and yielding underneath, causing the linen to turn in under the chin. It was that which produced the permanent baked in chin crease, but also caused a discontinuity in the imaging of the hair. The radiation modellers (Vignon initially) seem to suppose there was scarcely any imaging of the neck, due to a large body cloth separation., But there is imaging of the neck, with a pale band above it, which I interpret as (a) neck and (b) underside of chin respectively. The contact model does NOT allow any air gaps, even small ones, The radiation model does, but air gaps are not allowed to exceed 3 4cm, due to the imagined ‘attenuation by air”. Some of us uncharitably see the latter as creative accounting designed to cock a snoot at Newton’s Inverse Square law relating radiation intensity to distance..","date":"2014-07-13","mins":"6:25 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-137849","author":"colin_berry","post":"It’s not difficult to see why the neck region is controversial when so may still imagine the TS image to be a photograph. It’s not. It’s an X ograph, and the nature of X is a matter of speculation. Personally I think it’s an ‘impactograph’ produced by thermal imprinting under pressure. Some who say there’s no neck are presumably focused on the pale largely image free band immediately under the chin/beard. But have they not asked themselves what caused the dark band below that? I say it’s the lower dark band that is the neck, the upper pale band being the underside of the chin. Yes, it’s speculation, but there can be no model building or testing without it. The underlay could be sand, or maybe sacking. Either way, it takes a lot of force to push a corpse or effigy into an underlay, so even if it were fully 3 D, the chances are that any imprint would look as if it had come from a bas relief. (It’s not impossible that imprinting was done from a bas relief). So failure to imprint sides is easily explained in an impaction model. Radiation models try to explain it in terms of orthogonal projection of (unspecified) radiation. Do you know of any precedents for rays streaming out from an object in that disciplined fashion, all parallel with one another, and in a direction that just happens to be convenient for imprinting onto an enveloping shroud, with no possibility of side images? I don’t, but that’s probably down to a lack of imagination..","date":"2014-07-13","mins":"7:21 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-137647","author":"colin_berry","post":"“Interesting questions regarding the blood have been raised here, but these have to be tackled by the experts in the field. And for that we are fortunate to have have Kelly Kearse.” Kelly is an immunologist. I am a biochemist (with extensive biomedical experience). In what way does that make Kelly the expert when it comes to human tissue, and me presumably inexpert? That is the crudest of putdowns, but it’s what I have come to expect from this site. I don’t care anyway for the tern “expert”. It’s largely meaningless in the context of Shroud studies. There are those prepared to accept received wisdom, others who are not, for whom everything is open to question. My next target is “imaging across air gaps” by unspecified radiation, allegedly collimated by orthogonal projection, and subject to severe attenuation by small thicknesses (3 4cm) of air. Yeah, right. Beware incoming (like the facts)..","date":"2014-07-13","mins":"11:29 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-137948","author":"colin_berry","post":"Millions of people the world over live in areas over granite bedrock and other radioactive geology, which results in accumulations of radon gas in the basement cellars etc. Surely we would have seen or heard of numerous incidents of Shroud like images if radon, supplemented by “infra sound” or whatever, were the prime causative agent? Or would De Liso say that one or other critical component from her ever expanding pre Occamized checklist was missing?.","date":"2014-07-14","mins":"1:02 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-137736","author":"colin_berry","post":"Yes Hugh. Power’s starting point was the Shroud image and its supposedly encoded 3 D (not unique as some would like us to believe, being demonstrable with model scorches). He says, quite rightly in my view, that imaging would not be possible with (fanciful) orthogonal projection i.e. Collimated radiation, unless there were a sharp fall off with distance. Since the attenuation (no image beyond 3 4cm) is too severe to be in accordance with Newton’s inverse square law, we have the conjured up 3 4 cm rule based on attenuation in air. But as Power points out, there are only two kinds of electromagnetic radiation that exhibit that behaviour – one in the microwave region, and the other in shortwave uv. One would have to posit an improbable mix of the two, he says, if trying to explain all the image characteristics of the Shroud. OK, so a classical point source of radiation which you suggest, is the preferred starting point, certainly. But where’s the converging lens in a 1st century tomb that would allow those diverging rays to come to a sharp focused image? What kind of radiation could produce a scorch image on linen without some kind of a high temperature incandescent source (producing pyrolytic damage to linen as Power points out) The Achilles heel in the entire radiation hypothesis is in one of those Power pdfs. It’s the one with the Vignon profile of image intensity versus supposed cloth body distance. I shall try putting together a post in the next day or two, showing that the twin profile (intensity v cloth body distance) is at odds with the facts at each of 3 crucial points (top of head, neck/chin and frontal feet). The real profile should have shown image intensity versus points of cloth body contact (NOT hypothetical variable cloth body separation across air gaps). Forget air gaps where Shroud imaging is concerned. They fly in the face of known physics and chemistry. Shroud imaging did NOT occur across air gaps..","date":"2014-07-13","mins":"3:16 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-137966","author":"colin_berry","post":"I tried reading one of her papers once. Jargon laden and largely impenetrable!.","date":"2014-07-14","mins":"2:28 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-137983","author":"colin_berry","post":"Yup. That’s the paper I read (or tried to). Need I say more…..","date":"2014-07-14","mins":"3:51 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-137990","author":"colin_berry","post":"Methinks you might, Chris B. Admittedly I referred only to relative movement between subject and fabric between transfer of blood and image imprinting. I overlooked to mention the chief reason adduced to explain out of stereoregister bloodstains on hair instead of face – due to the need to imagine orthogonal projection of radiation, conveniently parallel to the Earth’s gravitational field – to explain imaging of upper and lower surfaces, not sides. I see that the formidable Bernard Power has tried to account for that orthogonal projection – some kind of distortion in the space time continuum affecting the speed of light, balance between light and dark energy etc etc. One has to admire the guy’s chutzpah. Oh, I misquoted him on the mix of radiation needed to sustain a radiation model, saying one was in the uv. That was a misreading of the summary on his main site. It would have been a mix of two kinds of microwave radiation he reckons, though still improbable. We agree on that much. His grounds for dismissing direct scorching, i.e. Off a hot statue, are interesting. I feel another posting coming on..","date":"2014-07-14","mins":"4:35 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138015","author":"colin_berry","post":"To our waspish commentator: I see scarcely any air gaps when I hold my hand up to the light.Try doing it with yours. But there is tenting when linen is draped over crossed hands, and one sees an absence of image on the TS precisely where one expects it at the junction of the two hands. It was Angel who introduced “breasts” into the discussion, not I. Yes, I used the term “moobs” light heartedly, but do not subscribe to her thinking re genetics and feminization syndromes. I am still experimenting with thermochemical imprinting, and getting nowhere fast. The initial idea that a corpse might release enough moisture (moisture note, not heat) to give a thermochemical reaction with quicklime, and thence heat for imprinting around the contours of the corpse, was tested and found wanting. One needs liquid water to get sufficient heat to scorch linen, and the latter has to be in direct contact with the quicklime, making it difficult or impossible to adapt for image imprinting off a template, any template.. It is not an abandonment of simple thermal imprinting – just an alternative source of thermal energy, possibly more convenient than having to manoeuvre and heat metal effigies over hot charcoal. I have not abandoned the quicklime idea, but it’s probably a hiding to nothing: the heat abstracted by a metal template to raise its temperature means the maximum temperature achieved is then not high enough to scorch linen..","date":"2014-07-14","mins":"5:46 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138005","author":"colin_berry","post":"Thanks Henrik. I needed one more (apart from myself) to make contact imprinting a modern ‘school of thought’. I shall now go and watch your video clip..","date":"2014-07-14","mins":"5:20 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-137653","author":"colin_berry","post":"Thank you for the clarification..","date":"2014-07-13","mins":"11:41 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138023","author":"colin_berry","post":"So you’re back in full point scoring mode this morning. Speaking for myself I prefer to leave the set piece battles (“Shroud Wars”) to others..","date":"2014-07-14","mins":"6:05 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138037","author":"colin_berry","post":"“Image is continuous between the fingers. There are air gaps between fingers” On re reading the above, I’m wondering if I interpreted your point correctly. Are you saying the fingers show a continuous image on the TS, despite expected air gaps? Or are you saying that the contact model requires a continuous image between the fingers, and that the TS image shows air gaps..","date":"2014-07-14","mins":"6:33 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138062","author":"colin_berry","post":"Could you try being less telegraphic with your comments, anoxie? I’m having difficulty in understanding you..","date":"2014-07-14","mins":"7:13 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138055","author":"colin_berry","post":"I can’t believe you just said that anoxie (though had misgivings, thus the request to get you to clarify). Of course there are “gaps” between the fingers on the TS. Take another look if you don’t believe me (making sure its a positive image, e.g. Durante 2002). But it’s the interpretation of those gaps that needs great care. The gaps, more correctly poorly or non imaged areas, could be due to one of two things. Either the fingers were separated, and the imaging process faithfully reflected those gaps, OR there were no gaps between the fingers of the subject (or at best very small ones), but the imaging process created a false impression of gaps. Conversely, working back from image to subject: if one sees apparent gaps between the fingers on the TS image (which one does) then it could be due to one of two things: either the fingers really were separated with air gaps, OR the fingers were not separated, but the imaging process failed to imprint the entire width of the finger, due perhaps to their cylindrical nature, or because the underlying bone is what is predominantly captured in an ‘impactograph’, which is slimmer than the full flesh finger. Conclusion: the apparent separation of fingers in the TS image may or may not be real, depending on imaging mechanism. Finding the fingers ‘separate’ with ‘apparent gaps’ that are not necessarily real gaps does not allow one to differentiate between the two imprinting mechanisms. Finding ‘separate fingers’ on the TS is not inconsistent with a contact process, contrary to what you seem to suggest. Neither is it inconsistent with a radiation mechanism, but you are the one who have brought fingers into the debate, not I..","date":"2014-07-14","mins":"6:57 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138073","author":"colin_berry","post":"Final comment: I prefer to look at image characteristics and try to decide what the subject was that produced the image, and by what process. That’s coming in from the opposite direction, needless to say, from making a prioriassumptions about the subject from which the image was imprinted, and in so doing narrowing the range of image imprinting mechanisms, and then trying to fit observations to just one of a multiplicity of conceivable image/image imprinting models. It’s a case of leaving no stone unturned..","date":"2014-07-14","mins":"7:55 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138082","author":"colin_berry","post":"I made no reference to corpses in that last comment, anoxie. It was cast entirely in generalities. Once again, you are trying to damage my blogging credentials by any and all means possible. No I have not closed discussion here on air gaps. I have closed discussion with trolling anoxie..","date":"2014-07-14","mins":"8:29 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138100","author":"colin_berry","post":"I have to head off, Hugh, but just had time to do a quickie experiment, at great personal expense (Nutella, £1.59). I smeared the stuff over the back of my hand, coating in between the fingers, then held my hand with fingers pressed together, and pressed into white cotton. Here’s the result: Not surprisingly in my view, the image makes it seem as if the fingers were separate, as per TS. But they weren’t, honest guv. I see no reason why imprinting with a viscous paint like medium should give a result different from that of a template used as to produce a ‘thermal impactograph’. In both instances, it is only those parts of the template that make direct contact with the fabric that can leave an imprint. Bye for now..","date":"2014-07-14","mins":"9:22 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138130","author":"colin_berry","post":"My wife suggested Marmite,autolysed brewers’ yeast, David, which as I expect you know, one either likes or loathes. I like, but considered it sacrilege to waste it on so mundane an experiment. Thus a trip to my local store for something else that is brown and tacky. It tastes fine, but I see the main ingredient is sucrose, which is getting a very bad press these days. What’s occurred to me since reporting that experiment is this: the TS fingers have also had a bad press for being excessively “bony” and unrealistic. Luigi Garlaschelli thought they were fabricated, and they have been used elsewhere in the TS literature to make the case for X ray imaging (August Accetti etc). But my own fingers look “bony” in that Nutella test, and so presumably would everyone else’s. Why? Because the fingers do not imprint across their entire width, due to curvature and supporting bone. So even fingers held together imprint as if parted from each other, i.e.splayed. Conclusion: while the TS fingers maybe look a bit on the long side, they are not bony if the imprint were as I believe NOT a photograph, but an ‘impactograph’..","date":"2014-07-14","mins":"10:49 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138138","author":"colin_berry","post":"Outside obviously, David, given my belief in the correctness of the radiocarbon dating pending further tests (thus man made medieval artefact). But if I were 100% pro authenicity, and it were to be proved beyond any shadow of doubt that the TS image had been made by impaction of subject on linen (or linen on subject) I’d be tempted to suggest that Jesus made a high speed exit from an enveloping shroud, the process being what is technically termed “resurrection” according to my one and only handbook on the subject (New Testament). Not so much cloth collapse theory (Jackson) but cloth collision theory. Nuff said. Mustn’t go putting ideas into impressionable minds….","date":"2014-07-14","mins":"11:12 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138185","author":"colin_berry","post":"I can’t speak for others, Hugh, but when I use the term tenting it’s in the first of your two senses. As regards the second of your scenarios, that’s pushing the envelope a bit (literally) methinks in attempting to imprint off so 3 D an object as a sphere. The trick with pressure imprinting is to press downwards into fabric placed over some kind of easily compressible underlay (sand, sacking). Even with fully round templates, the resistance to the template is such as to make it behave effectively as if a bas relief, with imprinting off the highest relief only with minimal ‘wrap around’ lateral distortion. I’ve just done another Nutella experiment, comparing two modes of presentation – downward as described above, compared with placing the fabric on top of the template and manually moulding to contours. Note the unsightly lateral distortion when done by the second method. There’s little doubt in my mind if the TS image had been made by contact imprinting under pressure, then the geometry was fabric underneath, template on top, and the ‘bony’ fingers are exactly as expected from the model system, even using plain old Nutella as a kind of printer’s ink instead of a linen modifying heat source..","date":"2014-07-14","mins":"12:53 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138217","author":"colin_berry","post":"I was wondering who’d be first to pick up on that detail! Entrez Thibault. My preference in principle for the LOTTO method was based on it being easier to obtain a reliably faint and subtle image, one that was scarcely visible under the microscope except as a very faint yellow discoloration. That was before the age attrition notion came along: the extreme superficiality of the TS image might be due to loss over the centuries of more highly discolored fibres, a result of increased brittleness and mechanical fragility, tending to break off leaving just the fainter less damaged ones. If the attrition idea is right (testable in principle if one had access to the TS) then there isn’t the same need to write off the face down imprinting method, though it admittedly needs more careful control of temperature than the LOTTO method. But that’s not asking too much, surely, of the people who built magnificent cathedrals that stand to this day.?.","date":"2014-07-14","mins":"3:00 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138244","author":"colin_berry","post":"Sorry, Thibault. No disrespect, but you cannot continue in this fashion, ignoring my critiques of your work, then dangling your pdfs under my nose as if the last word on the subject. The pdf you cite made a totally incredible claim, one that anyone can disprove in their own home in minutes: Quote: “The cross section experiments show clearly that a light scorch, which is able to give a superficial imprint at fabric level is not superficial at all at thread level: the entire thickness of the threads in contact with the template is colored (while the threads or portions of threads which are not in contact with the hot template are not colored).” All that anyone reading this needs to do is heat some metal, scorch a linen thread, then tease the thread apart and count scorched v unscorched fibres. The vast majority will (or can be) unscorched, even from highly scorched threads. I posted a critique on Thursday, June 19, 2014 Title: “Thibault Heimburger is incorrect. A linen thread CAN be scorched from a heated metal template on ONE SIDE ONLY.” http://colinb sciencebuzz.blogspot.co.uk/2014/06/thibault heimburger is incorrect linen.html Thus far there has not been a single word in response. Precisely the same happened when Thibault published his first anti scorching pdf. I pointed out the totally unsuitable nature of his template – the opposite of bas relief, i.e. Sunken relief. Yet on the basis of that template he made some wild claims to the effect that a scorch would always display excessive contrast between light and dark, Nothing could be further from the truth, as I have shown with any number of bas relief templates with subtle gradations of tone AND 3 D enhancibilty. Again, Thibault refused to respond, claiming I had been rude (certainly I was scathing, but who wouldn’t be, given the way his pdf was written as if the last word on the subject, and treating me (clearly the target of the paper) as a non person, there being not a single mention of any of MY experiments, to say nothing a highly biased introduction, having the reader believe that contact scorching had been dismissed years ago. I cannot imagine that pdf ever being accepted for publication in a peer reviewed journal, given that Introduction. How I wish that Bernard Power was commenting on this thread. Now there’s a scientist (and I say that despite his pro authenticity stance). He understands how science operates, via model building, patient model evaluation via open discussion with other workers in the field, with progressive model refinement. Shroudology needs more Bernard Powers. Goodnight..","date":"2014-07-14","mins":"4:31 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-137649","author":"colin_berry","post":"By that reckoning, hair would not be imaged either. It too is dead protein that has (largely) left the body, albeit anchored in a hair follicle (the only part that is still living). Ingenious answer, all the same. Where would shroudology be without its ingenious answers?.","date":"2014-07-13","mins":"11:36 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138370","author":"colin_berry","post":"One of the most obvious details of the TS image is its incompleteness. Not only is there no imaging of the sides of the body, but there is no imaging of the top of the head, nor the sides of the face. That’s not all. When scientists in the past have modelled the effect of placing a shroud over a corpse (see this simple sketch diagram in the Power paper) they reveal a fairly limited number of places where one expects an appreciable air gap between cloth and body: (a) under the chin, assuming correctly (or otherwise) that the cloth tents between chin and chest (b) the area around the crossed hands (c) the frontal feet, assuming tenting at the tips of the toes. I have examined each of those three crucial points in my current posting, and in each instance find the facts fit the model albeit with some minor qualifying assumptions, supportive of a contact model, fitting with everyday experience, and obviating the need for mysterious radiation that can image across air gaps. It’s proposed that the linen followed the contours of the chin, underside of chin, neck, chest to produce the peculiar alternation of light and dark we see in the neck region of the TS, where light and dark is not due to size of air gap, but to applied pressure (or directional vector thereof) between cloth and subject’s contours. Yes, In the region of the crossed hands, we do see the effect of air gaps between hands and abdomen, producing an either/or imprinting. Put another way there is scarcely if any imaging of those areas of the abdomen that abut on those raised hands, due to a tenting effect. The hands and fingers themselves are interesting, and despite yesterday’s sniping, I have anoxie to thank for prompting my quick experiment with the Nutella that explains why the TS man’s fingers look so bony. I regard those results as a major step forward in my own understanding of those peculiar fingers, though I can’t speak for anyone else here. Reminder: no matter how close together one’s fingers are when contact imprinted, they will look skinny and separated on the imprint, at least when pushed DOWN into fabric. As for the feet, I believe I also scored a first in showing that the “missing foot” (missing we were told because it is crosses over becoming superimposed onto the other) is in fact not entirely missing, that the tips of the toes were (if one looks closely) imaged exactly as one expects from tenting in the body cloth profile referred to earlier. It’s that tenting effect, not overlap, that explains why it’s only the tips that are imaged, the sizeable air gap explaining the absence of the rest of the “missing “ foot. Talk about spheres etc in the context of the TS is somewhat of a needless distraction methinks (I speak as an experimentalist, not a mathematician).. In modelling studies the human form could be said to behave more like a bas relief in the impaction model, albeit with those crucial “awkward bits” listed. But it’s the focus on those very same awkward bits that allows one to test model against reality, and though I say it myself I consider the model emerges with added credibility and dare I say scientific respectability (Thibault Heimburger and other anti scorch evangelists please note), Meanwhile the radiation model looks increasingly improbable, lacking not just theoretical rigour but a complete absence of experimental confirmation..","date":"2014-07-15","mins":"1:36 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138488","author":"colin_berry","post":"Yup, the lonely furrow is by degrees turning into a good motoring road, though the absence of other traffic is peculiar and a little worrying. Shame too about the cracked windscreen due to local troublemakers firing off air gun pellets from the bushes that line the road..","date":"2014-07-15","mins":"10:01 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138513","author":"colin_berry","post":"Gourmet considerations aside. Nutella handprints on old cotton pillowcases work out a lot cheaper than heated brass crucifixes on linen..","date":"2014-07-15","mins":"12:03 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138774","author":"colin_berry","post":"Good evening Thibault. To avoid an overlong response, here’s a partial reply for starters, with a critical but well intentioned observation at the end. So, you make the bizarre claim that scorching is an all or nothing phenomenon at the thread level (thread note, no fibres, of which there can be 100+ or even 200+ per thread) and what’s your response? To quote back at me words I wrote in a somewhat different context! At least you had the decency to give a link to where I wrote those words – a posting that goes right back to April 14th – 3 months ago, As I say, it was a different context, to do with the faintest scorches that are scarcely visible, at least at the individual fibre level. So when I read your claim that light scorches affected the entire width of the thread, I decided immediately not to even try to reproduce your conditions, but to go for a much heavier scorch that would be easily visible to anyone shown the photographs. Note that I was making it harder for myself, not easier. Yet when I did that experiment, the result was as I expected – one can create an intense scorch on one side of a thread, without affecting the opposite side. (One can also tease it apart, and see a few heavily scorched fibres, i.e. Deep brown the rest being essentially colourless.). Here’s a link to my photograph, showing a thread that is clearly scorched on one side only. “That’s true and for that reason I made some cross section experiments and I have shown the results. Certainly you showed cut ends under the microscope which showed even coloration under your microscope, though that’s not the same as making a thin transverse section as obtained with a microtome, and your only true cross sections are in fact schematic diagrams, not actual photomicrographs. Given you are still looking at relatively intact fibres and threads, you must be aware of the artefacts that are possible under the microscope, due to refractive index differences, dichroism, total internal reflection etc. Personally I set little store by what I see under the microscope unless supported by other evidence. I have to say think you have your work cut out for you, explaining how or why you can see complete thread scorching under your microscope when anyone with 5 or 10 minutes to spare, a linen thread and heated metal should be able to reproduce my photograph in seconds, showing that two tone end result on the one thread. What’s more they don’t need a microscope to see the result of teasing it apart, with majority of fibres having escaped being scorched. Or are you claiming that the faintest of scorches can miraculously propagate across every single fibre in the entire thread, while a heavier scorch cannot? Why would a low energy scenario produce a greater effect at a distance than a much higher energy input? Sorry, but that makes no sense whatsoever. I must break off now, havingsome other matters to attend to, and will respond to your other points later, probably tomorrow. In the meantime, might I commend to you the following extract from the physicist/meteorologist Bernard Power, whom I complimented a day or two ago for his thoroughgoing scientific approach, even of we are poles apart on some of his assumptions (e.g. That 3 D enhancement needs a radiation model, when both of us know otherwise from applying Image J to contact scorches.). Note especially the last paragraph ( my bolding). Extract from Bernard Power Ph D I’ve omitted his numbers to references. Http://www.shroudscience.info/index files/THE%20 SCIENTIFIC%20 FACTS%20 Word.htm ####################################### Was the Shroud image made by a scorch from a heated metal statue? This theory originated from the observation that image on the linen has many of the characteristics in hue and shading that a thermal scorch on linen can produce. Consequently it was theorized by Ashe and others that if a linen cloth were to be draped over a metal effigy heated to 250 deg. C (which is about the scorch temperature threshold for linen) then the image could have been produced. Since the draped cloth would have various air gap distances between statue and the cloth draped over it, and since thermal radiation is attenuated in air to some degree as it passes across the air gap, then some three dimensional information might be transferred to the cloth, points closest to the statue being more scorched than those farther away. However, thermal radiation spreads out widely, and so would not give the required definition to the image features. In addition, the attenuation rates, or the drop off in radiation intensity with distance traveled through air, could not match those observed on the Shroud image. Furthermore, a true scorch also causes linen to fluoresce under ultraviolet or X ray examination. But the STURP team of investigators who examined the Shroud in 1978 found that, although the burnt patches on the Shroud from the 1552 fire did fluoresce as expected, the image areas showed no signs of fluorescence at all. Therefore, the image on the Shroud was not made by a thermal scorch. Although, since it is a ‘fraud theory’, the hot statue theory is today untenable against the accumulated evidence for authenticity, it has been historically very useful because it proposed a chemical degradation of the cellulose, and so spurred investigation of an essential ingredient of any plausible image formation theory. ####################################### Now there’s someone who understands the role and indeed necessity of model building in science. You Thibault would appear not to. Do you not have any ideas at all about how the image was formed? Are you content to nitpick on minute detail, or (worse still) to disseminate via your unchallengeable pdfs totally misleading or incorrect information about thermal imprinting, i.e. Scorching by contact, while making no constructive contribution yourself. Note the self critical manner in which Power develops his own ideas re the alternative radiation model. Message to Dan Porter; how come Bernard Power has slipped below your radar screen, despite publishing some truly seminal work on the radiation hypothesis?.","date":"2014-07-16","mins":"4:19 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138794","author":"colin_berry","post":"Thought provoking, provided one’s prepared to make a willing suspension of disbelief. That’s true for most of his writing across a wide range of topics (tornadoes, climate change, cosmology etc etc). He’s a highly original mind, worth reading even if 90% is wrong. The 10% that remains could be gold dust. Maybe you should direct your question to Adrie Van Der Hoeven. She’s all clued up on that side strip. I personally tend to give wide berth to anything that looks remotely like a riddle, wrapped in a mystery, inside an enigma..","date":"2014-07-16","mins":"6:09 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-175193","author":"colin_berry","post":"The no.3 feature you find so compelling, Thomas, namely the absence of a loin cloth, is maybe not so unexpected if you think through the logistics of producing an artefact that is hardly a ‘forgery’ (there being no ‘original’ for us to view) but something maybe better described as an elaborate hoax. The key question that needs to be asked is “What was the hoaxer attempting to portray, especially as regards the faint, almost ghost like body image?” A ‘photocopy’ captured at the instant of resurrection seems unlikely: it may appeal to 20th/21st century imagination, but there’s no evidence I’m aware of that it was ever interpreted in those terms by the first cohorts of pilgrims, least of all St. Francis de Sales, Bishop of Geneva, in that 1614 letter home to his mother. He saw the image as one of ‘sweat and blood’, and that to me would seem as good a starting point as any: the TS body image was (as I have proposed here a number of times) skilfully engineered as a ‘Veil of Veronica’ like sweat imprint. OK, so one sets out to fabricate what a sweat imprint might look like if taken shortly after crucifixion. Does one show a loin cloth on one’s body image? Answer: NO!. Any loin cloth would have absorbed the sweat and blood seat and ‘stolen’ the imprint of the problematical midriff region, preventing it appearing on Joseph of Arimathea’s linen. Was there an alternative way of preserving modesty? Yes, indeed there was. Show hands crossed over groin, even if, as some suggest, no one really has arms long enough to do that naturally after death. Buttocks? Ensure they get their fair share of those 372 scourge marks. Indeed the latter – flagellation overkill — serves a crucial role anyway in allowing one to make a visual spectacle of a very faint body imprint:a spectator may not be able to make out the body image clearly from a distance, as Charles Freeman has been at pains to point out (then proceeding straight to the scene of the accident – his misguided paint theory) but he can make out the form of a naked male if the latter is covered from head to foot with blood and scourge marks. A gory spectacle did not need an intense background body image, and indeed it, and a “painting like’ loin cloth would have detracted from credibility. The genius of the TS lies in the hard logic and self discipline that determined not only what was to be imaged, but,just as important, what NOT to image. I say it was designed and executed to represent an imprint in sweat and blood. Artistic add ones like a loin cloth or crown of thorns, even tears and/or punctures in body flesh, were ruthlessly rejected at the planning stage. Everything had to be “just right”. Nothing that was allowed to feature in the TS image that would leave no imprint in sweat or blood. That’s one of the reason why its held its fascination for so long (that and the 3 D properties that show it was template derived, not a freehand portrait in artist’s pigments)..","date":"2014-12-08","mins":"4:14 am","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","title":"Yannick Clément on Paul Maloney’s St. Louis paper"},{"id":"comment-137690","author":"colin_berry","post":"Hugh: tell me, does the name Bernard A Power mean anything to you? He is a retired Canadian meteorologist who has written some amazing stuff on the Shroud (as a sideline) with fascinating insights into radiation as a prospective effector (or not). Judging by his writings, he probably knows more about radiation effects on matter than anyone else in shroudology. As far as I can tell, his writings have never appeared on this site. Why not? He’s pro authenticity, but has gone to some considerable lengths to cast doubt on radiation mechanisms. Here’s his main site, but I can give links to a couple of highly informative pdfs if you want. Http://www.shroudscience.info/index files/THE%20 SCIENTIFIC%20 FACTS%20 Word.htm Incredibly, this guy seems to be invisible in shroudology (why????). I only discovered his work by chance through googling radiation and cloth body distance..","date":"2014-07-13","mins":"12:54 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-175240","author":"colin_berry","post":"Nabber: my advice to you is to start thinking BIG and out of the box. You will never be able to understand the impact of the TS, past and present, unless or until you are prepared to do that. Regard the Veronica as a trial run, one that conceptually allows an instantaneous sweat imprint to morph by degrees, over years, maybe decades, into something altogether more striking, the process aided and abetted by generations of artists, all exercising artistic licence, all pushing the envelope (if you’ll forgive modern parlance). Their likely medieval defence when credibility was questioned: simply invoke the supernatural. It’s the Son of God we’re dealing with here, after all, immediately prior to crucifixion (Veronica legend ) and then immediately post crucifixion (biblically endorsed, generating a FANCIFUL, dare one say Veronica like imprint onto Joseph of Arimathea’s linen). Don’t ask for supporting evidence for fanciful imprints. That’s to miss the point entirely. Oh, and never underestimate human imagination and ingenuity in situations where anything seems possible. Personally, I try to keep an open mind. Some things are not possible in conventional scientific terms, but nothing is impossible for those prepared to think BIG. Medieval artists knew that intuitively in progressively ratcheting up the Veronica from monochrome sweat imprint to fully fledged life like facial image. The TS, with its non photogenic negative image, with spare and uncompromising gory realism., was somewhat conservative in comparison. That is and was surely the secret of its enduring success – the in your face realism as distinct from artistic fancy..","date":"2014-12-08","mins":"12:59 pm","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","title":"Yannick Clément on Paul Maloney’s St. Louis paper"},{"id":"comment-46489","author":"colin_berry","post":"Title: “You guys are brutal” The term “brutality” does not exist in the scientist’s lexicon.There is no place for finer feelings – all that matters is getting to the truth. Note: this comment will not appear until vetted by the site’s Protestant Episcopalian but quasi Catholic host – protecting as always the finer sensibilities of Catholic relic worshippers. Those shrinking violets express no opinions here, being content to send Dan Porter protesting emails whenever they encounter a “brutal” comment. What a crap wolf in sheep’s clothing site…You disappoint me Dan Porter. Get some Protestant balls for God’s sake..","date":"2013-10-08","mins":"12:47 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","title":"You guys are brutal"},{"id":"comment-46663","author":"colin_berry","post":"I no longer comment here routinely because of pre moderation. So I do not intend to answer your question in detail. All I would say re the objectivity of this site, with its categorical statement that the Shroud is “at least twice as old as the now discredited (sic)carbon 14 date”, and its religious bias is this: take a look at what appears under the “About” tab. Https://shroudstory.com/about/ Note also the protest from one Brad Gore, who says he was involved in the original radiocarbon dating, and see what response he gets from the site’s host (none whatsoever, followed by “comments are closed”). Scientific objectivity? Ha!.","date":"2013-10-09","mins":"11:23 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","title":"You guys are brutal"},{"id":"comment-46601","author":"colin_berry","post":"No one here should be calling names or attacking anyone personally, its just not the place, simple as that. Nice sentiment. Shame that the sole raison d’etre of the site is to defame the people who produced the radiocarbon dating, and to do so with barely concealed innuendos and smears that stop just short of legally actionable libel. This site has to be just about the worst advertisement for Christianity imaginable, and you – with that comment – have just contributed to the rank odour of nauseating hypocrisy, whether aware of having done so or not..","date":"2013-10-09","mins":"4:26 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","title":"You guys are brutal"},{"id":"comment-46664","author":"colin_berry","post":"PS: Brad H. Gore was third author on the 1989 Nature paper with the radiocarbon dating: Department of Physics, University of Arizona, Tucson, Arizona 85721, USA.","date":"2013-10-09","mins":"11:45 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","title":"You guys are brutal"},{"id":"comment-46494","author":"colin_berry","post":"One man’s ad hom is another’s pointed observation. As I say, what matters is the truth, and this particular commentator has lost count of the number of “ad homs” he’s encountered on this site through attempting to peel away the mythology that masquerades as Shroud “science”. “Image always under bloodstain” anyone? “Only the Shroud has encoded 3 D information” anyone? “Invisible reweaving” that invalidates the radiocarbon dating but which fails to disturb that subtle banding one sees under uv anyone? Bye once again. Have fun endlessly procrastinating, when all that is needed is to repeat the radiocarbon dating on a less peripheral strip of Shroud. (But it’s a lot more fun blackening the credentials of the Oxford and other labs, isn’t it, they being “anti faith” scientists?). Jesus wept. Awaiting pre moderation by your ever anxious to please relic friendly blog host..","date":"2013-10-08","mins":"1:13 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","title":"You guys are brutal"},{"id":"comment-46717","author":"colin_berry","post":"See also “Brad H.Gore says”. Https://shroudstory.com/2008/09/28/brad h gore says/.","date":"2013-10-09","mins":"7:06 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","title":"You guys are brutal"},{"id":"comment-46760","author":"colin_berry","post":"With so much controversy there seems to be no point in cutting a piece of the relic for yet another CD test, not forgetting that there is no guarantee that correct results will be obtained. We will probably have to wait for further developments in science, So you are content to see the radiocarbon scientists maligned and slandered on this site routinely, to be accused by some here of colluding in some giant conspiracy, yet will not raise a finger to have the testing repeated with a wider range of sampling sites. You say there is “no guarantee of correct results”. So people’s reputations are less important to you than having a result that is 100% certain – is that what you are saying? Since when has 100% certainty been required in analytical determinations from restricted sampling sites? Why waste the time of scientists and statisticians who state upfront that they are content to operate at the conventional 95% level of confidence, i.e. That there is a 5% probability (p<0.05) that any differences observed could have arisen purely as a result of random sampling error? If you and co religionists are going to employ the services of outside experts, then at least get acquainted with the limitations of data derived from limited sampling sites, don't set them impossible objectives, and most important of all, don't slander them when they produce the wrong result. Some might think that some of the ire and contempt directed at the three labs is a pretty poor advertisement for the faith and convictions that underlie the belief in the Shroud's authenticity. But then most of the hate in the world today originates with religion, or what is claimed to be religion. I give it another name – bigotry. It would seem to me that you have not only prejudged on the matter of authenticity, despite the available science that states otherwise. You are so convinced of your rightness that you have also prejudged the scientists too, declaring that they and their methodology have failed abysmally. You and others are, needless to say, encouraged to adopt that warped position by what the site's host has written under \"About\" regarding the radiocarbon dating and what he declares baldly to be wrong science. What he omits to tell us is something about his own scientific background that allows him to be so categorical and dismissive. In fact he tells us nothing whatsoever about his background there or elsewhere, except that he is an Episcopalian. So what are the special scientific insights that Episcopalians have that are denied to us ordinary mortals?.","date":"2013-10-10","mins":"3:50 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","title":"You guys are brutal"},{"id":"comment-46872","author":"colin_berry","post":"“…harping on the issue of why it is still a controversial method” The cutting edge of science is always controversial. It wouldn’t be science otherwise..","date":"2013-10-10","mins":"1:30 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","title":"You guys are brutal"},{"id":"comment-46853","author":"colin_berry","post":"“So pronouncements coming from the British Museum are “ex cathedra”? etc etc” Just because I’m a Brit does not mean I hold a brief for the BM or its directors past or present. I was there not so long back – admiring the Pompeii exhibition and marvelling at the advanced lifestyle, at least of its richer citizens. But I’ve never regarded its morals as impeccable – not while it hangs on to the Elgin Marbles which should be back in Athens. If the Shroud custodians select the BM’s director as an honest broker, well judged or otherwise – then that is their decision. If he’s later suspected of bias, then don’t blame me. I cannot even recall mentioning Tite. There is no need to regard the 88/89 testing as the last word on the matter. Repeat the radiocarbon dating with a proper sampling frame, and get the director of the Louvre or the Smithsonian or that splendid Berlin museum on the banks of the Spree whose name I have forgotten to oversee matters. I would also recommend my own town museum, but they are busy with an exhibition of local memorabilia right now..","date":"2013-10-10","mins":"11:12 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","title":"You guys are brutal"},{"id":"comment-46525","author":"colin_berry","post":"What is truth? I cannot speak for truth in the spiritual dimension. But the TS is not a spiritual concept. It’s a physical entity, carbon dated to the 13th/14h century. And thus amenable to the scientific method, whether or not the dating is entirely accurate. While I am competent to speak on scientific truth, based on general precepts like concordance between hypothesis and fact, predictive utility, you know, all those down to earth pointers, I don’t claim to be the ultimate authority where scientific or any other truth is concerned. Why should anyone in their right mind claim to be? So what is the point of challenging someone to state what they understand by truth, except to hint or suggest that truth is an illusion? Is a communicating laptop an illusion? Is computer code a mere approximation to truth? Are you receiving a garbled version of my words? So what is the point of your question? Is it to suggest that one is going beyond the science into realms beyond science? I am not, repeat, not doing that. I am discussing the Shroud of Turin. So what are you discussing. What do you understand by “truth” – scientific truth that is? You could try directing your question to the Nobel prize awarding committees.They seem pretty good at distinguishing truth from ephemeral fads..","date":"2013-10-08","mins":"3:38 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","title":"You guys are brutal"},{"id":"comment-46533","author":"colin_berry","post":"“You, sir, are a drama queen”. No sir. I am a retired scientist, and you, with your obnoxious comment, represent everything that is wrong with this site..","date":"2013-10-08","mins":"4:11 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","title":"You guys are brutal"}]
