[{"id":"comment-28865","author":"colin_berry","post":"March 30, 2013 at 12:54 pm | #10 Quote I don’t know who talked about blood clots. It could simply be a differential migration between serum and figurated elements/heavy protein. Was blood fluid ? viscous ? solid ? One has to study pathological, post mortem fibrinolysis/coagulation. This is done in routine for ICU patients, obviously it is less usefull after the death of the patient. But I don’t take for granted that the boold formed solid blood clots. Thibault, have you got any reference on this issue ? Blood clots are a major feature of the Adler/Heller thesis, anoxie. The task that faced those and other investigators was to explain how dried and clotted blood, shed many hours before the arrival of the deceased individual at the tomb, could leave such striking bloodstains on the Shroud. Actually, there seem to be two rather than just one explanation, as alluded to in your comment. The first is that the clots retracted, exuding red serum, the soluble haemoglobin having escaped from lysed red blood cells.That’s the theory I have set my sights on, given it seems incapable of explaining the intensity of the “bloodstains” if the latter are merely pigmented serum. There is the other explanation, ie. That the clots were dissolved by fibrinolysis, presumably allowing fresh blood to escape. While that would allow for real blood as distinct from serum, fibrinolysis only makes sense as a means by which the internal blood vessels can be cleared of small blood clots that have formed in or around small tears etc before they have had a chance to break off, and then go and lodge in a coronary or other blood vessel producing an infarct. It would hardly make sense to have active fibrinolysis in an external blood clot, would it? That rather defeat the object of plugging a wound, and then protecting it further as the scab hardens (not softens!). Intravascular fibrinolyisis on the other hand, apart from being of dubious relevance to post crucifixional scenarios, is a highly time regulated process, with plasminogen being incorporated into clots as they form, such that the latter contains the seeds of its own destruction hours or days later as the plasminogen is later converted to plasmin, the latter being a proteolytic enzyme that is specific for fibrin digestion, converting the latter to small fibrin degradation products (FD Ps) that can be detected in the blood stream. (I once monitored FD Ps in dietary fibre studies, so am in fact not totally unfamiliar with this area, apart from having had a world expert in fibrinolysis working in the very next lab who loved to talk shop on the ride or drive home along Philadelphia’s Main Line….","date":"2013-03-30","mins":"1:31 pm","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","title":"Awaiting Live Stream from RAI Uno"},{"id":"comment-208360","author":"colin_berry","post":"Thanks OK. Hugh Farey’s BSTS Newsletter has just appeared too. Http://www.shroud.com/bstsmain.htm#81.","date":"2015-08-16","mins":"5:33 am","url":"https://shroudstory.com/2015/08/16/another-st-louis-shroud-of-turin-conference-in-2018/","cat":"conference","title":"Another St. Louis Shroud of Turin Conference in 2018?"},{"id":"comment-28868","author":"colin_berry","post":"I’m beginning to wonder if we are not talking at cross purposes, anoxie. I thought we were discussing how blood on the skin from torn vessels – capillaries, veins etc) had still managed to leave stains on linen long after the blood had clotted and dried. (The term “remoistening” that we hear deployed occasionally is one that is definitely not in my vocabulary, by the way, being a cop out unless there is an obvious source of wet liquid water, which in this instance there is not)..","date":"2013-03-30","mins":"1:44 pm","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","title":"Awaiting Live Stream from RAI Uno"},{"id":"comment-28867","author":"colin_berry","post":"Apologies. I overlooked to properly close the italics format tag after ‘internal blood vessels’. Don’t be surprised if all new comment appear in italics! I’ll enter a close tag now, but I don’t suppose it will help. When’s Word Press going to give us a proper format menu on comments as well as postings?.","date":"2013-03-30","mins":"1:35 pm","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","title":"Awaiting Live Stream from RAI Uno"},{"id":"comment-28821","author":"colin_berry","post":"And the Shroud custodians chose Italy’s supposed ‘public service broadcaster’ for this momentous occasion. What’s the Italian for ‘damp squib’?.","date":"2013-03-30","mins":"7:00 am","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","title":"Awaiting Live Stream from RAI Uno"},{"id":"comment-28832","author":"colin_berry","post":"It’s not clear if the second half of the comment from Kelly Kearse is directed to me or not – though one has to assume it is. I don’t have to justify my interest in any science related topic to him or anyone else, but if he cares to check the banner of my sciencebuzz site that has been running much longer than my Shroud ones, then he may gain a clue as to what makes this blogger tick – and it’s nothing to do with religion in general, or Catholicism in particular – and in any case this site says nothing in its name or presentation that says it’s for devout Catholics only. Indeed the host used to use ‘episcopalian’ as his username. As for today’s exhibition, there’s a strong sense of deja vu. The first HD image that I ever encountered was one that David Rolfe had briefly used on his Enigma site, showing detail and resolution I had never seen previously, but there were difficulties in getting him speedily to release more of the same. Once Mario Latendresse’s Shroud Scope came along, it became clear to me at least that the rib congregated bloodstains were hardly what one might expect from ordinary runny blood (try it), and from that, and the blood anomalies reported by the late Alan D. Adler, has evolved my hunch that it was in fact the contents of one or more well digested meals of human blood from the gut of the medicinal leech that was used as a treacly paint. Thus my interest in today’s proceedings, to see whether photographs or video footage of even higher resolution might be released, if only to see on precisely which parts of the herring bone weave the pigment has congregated to give that dense caked appearance (and far too homogeneously one would think ever to be a “serum exudate of retracted blood clots”)..","date":"2013-03-30","mins":"8:24 am","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","title":"Awaiting Live Stream from RAI Uno"},{"id":"comment-50274","author":"colin_berry","post":"Agreed, Matt, but are you aware that it’s the same Barrie Schwortz who is counselling against a repeat of the radiocarbon dating until doubts are addressed re contamination issues, notably those centred on thymol? https://shroudstory.com/2013/11/05/overheard behind us during barries talk thats only listerine/ What if anything is being done to draw up new revised protocols that address specific contamination issues? Or is radiocarbon dating to be left permanently on the back burner (or at the bottom of the freezer) as being “too problematical”? Don’t feel you have to reply, but if you do, perhaps you could explain that last sentence in a bit more detail. Are you suggesting there was some deliberate attempt to deceive, and if so, by whom?.","date":"2013-11-07","mins":"4:55 am","url":"https://shroudstory.com/2013/11/06/barrie-on-ewtn-liveand-again-in-repeats/","cat":"event","title":"Barrie on EWTN, Live–and again in repeats"},{"id":"comment-50302","author":"colin_berry","post":"Hi there anoxie. Do you think the test is incomplete ?</b? Well yes. That much is self evident, though I could understand the dating labs being cajoled into accepting a corner sample \"just for starters\" and even agreeing to that, not wishing to be accused of defacing a \"Holy Relic\". What I don't understand is the 89 Nature report claiming to have dated the Shroud. It didn't – it only dated the corner they were given (see also below re the way that was subdivided). Do you think the C 14 content is a function of vertical location? No, not being at all persuaded by claims for invisible reweaving that would have returned a data in error by 1300 years. Two to three hundred maybe, not 1300. The trend cannot be statistically significant because the snipping and subdividing was non random, and different clean up procedures were used. Do you think the samples were not randomly chosen? No, of course they weren’t. There was essentially one sampling site only, and because there was only one, all kinds of considerations, objective and possibly subjective, influenced the final decision as to where to snip. That was NON RANDOM SAMPLING which makes a nonsense of any subsequent analysis of variance, significance testing or trend analysis. One cannot even do a rigorous trend analysis across the three sub strips (except by those fancy “rigorous” methods provided later by the LSE that I don’t pretend to understand which attempt to computer model all possible combinations) because as I say the three labs were using non identical clean up procedures that could introduce systematic, i.e. Non random,. Errors. Do you think more tests had to be done beyond the boundary. Of course. Even then it won’t be entirely random for obvious reasons, at least not with strip sampling, since there are sampling sites that are obviously forbidden What one could do is place a grid over the Shroud, maybe the less iconic dorsal side only, and decide which squares cannot be removed (image bearing, blood bearing obviously). One then takes random samples (but what if they are all clumped together, purely by chance?) say 5. Even then, one does not report one’s results as pertaining to the Shroud, but to less sensitive parts of the Shroud. Sorry if you got more than you reckoned for. Are you by any chance a professional Shroud researcher, anoxie? Colorado based?.","date":"2013-11-07","mins":"10:40 am","url":"https://shroudstory.com/2013/11/06/barrie-on-ewtn-liveand-again-in-repeats/","cat":"event","title":"Barrie on EWTN, Live–and again in repeats"},{"id":"comment-50790","author":"colin_berry","post":"I had a suspicion he’d been practising….","date":"2013-11-11","mins":"12:30 pm","url":"https://shroudstory.com/2013/11/06/barrie-on-ewtn-liveand-again-in-repeats/","cat":"event","title":"Barrie on EWTN, Live–and again in repeats"},{"id":"comment-152255","author":"colin_berry","post":"I may indeed be wrong. But I’m still waiting for cogent reasons, based on detailed evaluation of rival models, so as to convince me of that fact. Ex cathedra dismissals on internet sites, unsupported by a shred of experimental evidence, cut no ice whatsoever – which is why I have less and less time for this particular troll infested community. Thank goodness for the Hughs and the David Gs, the only reason for my not having deleted the site from bookmarks long ago. And rest assured: if this comment appears on my screen with “Comment awaiting moderation”, it will be my last word here until there’s a new site manager..","date":"2014-09-18","mins":"12:30 pm","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf"},{"id":"comment-152272","author":"colin_berry","post":"Bye, troll tolerator..","date":"2014-09-18","mins":"1:29 pm","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf"},{"id":"comment-152327","author":"colin_berry","post":"Thanks for reminding me why I don’t bother with internet forums anymore..","date":"2014-09-18","mins":"6:08 pm","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf"},{"id":"comment-211052","author":"colin_berry","post":"“Last Saturday I gave two sold out presentations at the truly amazing Children’s Museum of Indianapolis and got to see their beautiful National Geographic Sacred Journey’s Exhibit in person.” “Sold out”. That kind of says it all, in more ways than one….","date":"2015-09-24","mins":"7:26 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"id":"comment-211063","author":"colin_berry","post":"I think otherwi$e, David G. Who foots the bill for all this globetrotting (like responding to an invite from, and then carefully pandering to the Big Tent in Hampshire)… ?.","date":"2015-09-24","mins":"9:05 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"id":"comment-211104","author":"colin_berry","post":"If folk here were invited to give a talk on the Shroud to a Children’s Museum, would they want the parents to be charged an $18 dollar admission fee? What if those same parents came to this site, and discovered Barrie M.schwortz soliciting for voluntary donations to support his website and STERA, on the grounds they are ‘non profit making organizations’? Barrie M Schwortz, now a self styled scientist, fronts what can only be described as a pro authenticity road $how. It must be a nice little earner….","date":"2015-09-24","mins":"3:39 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"id":"comment-211106","author":"colin_berry","post":"OK: It’s getting on for 4 years since I took a third look at shroudology (post STURP, post radiocarbon dating) and decided to do what probably no one has attempted previously, namely to report a research investigation online and in real time, from start to finish, no matter how long it took. Expenses? Certainly – but all hobbies involve some expense. If mine weren’t for linen, chemicals, microscope etc it would be for bikes or golf clubs or craft beer….","date":"2015-09-24","mins":"3:55 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"id":"comment-211110","author":"colin_berry","post":"At least English tabloids can be relied upon to spell Inidanappolis (sic) correctly… ; ).","date":"2015-09-24","mins":"4:33 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"id":"comment-211089","author":"colin_berry","post":"“Neither of us are proselytisers for our opinions, and both are happy to explain our opponents’ points of view as well.” I never thought I’d live to see the presentational styles of Hugh Farey and Barrie M.Schwortz being bookended here or elsewhere….","date":"2015-09-24","mins":"1:24 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"id":"comment-8988","author":"colin_berry","post":"New reformulated SHROUD, now with added uv enhancer. Shroud – for that extra MYSTERY in your life (and all mysteriously free of charge)..","date":"2012-03-06","mins":"5:16 am","url":"https://shroudstory.com/2012/03/06/for-immediate-release-reynolds-hosts-shroud-encounter/","cat":"event","title":"For Immediate Release: Reynolds hosts Shroud Encounter"},{"id":"comment-49176","author":"colin_berry","post":"Why should it come down to Raymond Rogers, and what he learned from one or two threads of dubious provenance? Why was he resorting anyway to stray threads, when there is/was a retained strip of intact fabric available for precisely this purpose? As for his chemical re dating via lignin degradation and vanillin, which we’re asked to believe trumps radiocarbon dating, here’s a comment that has just appeared on the Randi site: “I’m a chemist. Five or 6 days a week for 30 years. Ive been called as an expert witness in court cases several times. Tell me about these other tests and instruments. That vanillin test of Roger’s is worthless, in my expert opinion.” I for one would not waste a second of my time in constantly debating that 1988 testing, one that I see as a ranging shot exercise. Repeat the testing. Or are some of us happy with a messy status quo that is happy to trash the existing data, but does not admit the need for experimental repetition – the hallmark of good science – whether or not it confirms the medieval date? No more sterile and futile debate please. It’s more data we need..","date":"2013-10-30","mins":"5:46 am","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-49190","author":"colin_berry","post":"John Klotz : Colin, I agree with the thrust of your comment. So, in fact did Ray Rogers and others on the authenticity side. However, it’s not within your or my control. Maybe a thrust of the conference ought to be a discussion of the requirements for new C14 testing more in line with STURP’s original recommendations 30 years ago. Gove and the C14 labs were so intent on denying STURP involvement that metaphorically shot themselves in the foot by spurning advice on site selection. “The fault dear Brutus lies not in our stars but in ourselves” Unlike Brutus the fault does lie in our stars, but at events that STURP couldn’t control. I find it hard to believe that it was the radiocarbon labs’ decision, far less preference, to work with a single rectangle, cut from a corner, so close to the previous Raes sample and that mysterious side strip. What I can believe is that a presumption of innocence aka authenticity prevailed, allowing the “minimal defacement” mantra to rule the day. But that’s all water under the bridge, or should be. Given the charges not just of incompetence and/or lack of statistical or scientific rigour, but of conspiracy and fraud, the Turin custodians should now do the decent thing, and allow the radiocarbon daters back – but with a sampling frame that has been approved by the entire community of those with an interest (or stake) in the answer. You see (and you as a lawyer must surely understand this) that initial presumption of innocence re authenticity has now turned into a presumption of guilt re the returned answer of non authenticity. Everyone here should be demanding a recount. The truth will out, and no doubt will one day, but speaking personally I’d prefer it to be in my own lifetime given I’m having to slop strong alkali round the kitchen and bathroom right now in pursuit of one small facet of that truth..","date":"2013-10-30","mins":"7:30 am","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-49194","author":"colin_berry","post":"The corpse has been dead for some 25 years. So why continue with the post mortem?.","date":"2013-10-30","mins":"8:25 am","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-49244","author":"colin_berry","post":"Forget STURP no disrespect intended. STURP merely provided a ranging shot, but was superficial in its approach, literally, and some might say over respectful with those pussy footing sticky tape samplings. Forget AMSTAR (if you’ve ever heard of it – I haven’t). Look to the present. Why has there been no scientific access to the Shroud these last 25 years for scientific analysis? Christianity does not need fantasies and obscurantism to survive. It’s what sets it apart from other religions….","date":"2013-10-30","mins":"3:13 pm","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-49258","author":"colin_berry","post":"John Klotz : Colin, I was replying to a message that Georgio had posted to correct the record. I would agree that the time is long past for further non intrusive scientific examination of the Shroud. The problem is that neither you nor I, nor apparently anybody else, can get Turin to budge. I believe there may be an element in the Church that prefers the Shroud remain a mystery. If the Shroud’s authenticity is established then it becomes no less than a Revelation with a capital R. We will know more about the real Jesus that at any time in history. Also, it will be an accessible revelation. There may be some in the Church who would prefer that not happen. Holy icon, yes. New Revelation, No. I am not sure about how Pope Francis would feel if he addressed the problem. He seems somewhat obsessed with serving the poor and downcast. I don’t know where he got that from. (I’m kidding, of course I know where as does any other Christian). In some circles, I am regarded as a liberal or worse. I like to say that I am slightly to the right of JC. The only person on this blog who is directly involved in organizing the St. Louis conference is Joe Marino. I expect he is reading this thread. Actually, I am some what excited by what people are writing. I think we owe a debt to Charles Freeman for kicking this off. Maybe a theme for the conference should be “What next?” Excuse me for mentioning STURP again, but it gained unprecedented access to the Shroud. It was a unique confluence of energy that caused that to happen. First and foremost, perhaps, was Father Peter Rinaldi who was an Turin born priest serving in the United States who in a figurative sense was the one who brought the shroud to America. Then there were was Silent Witness, the David Rolfe film based upon an concept by Ian Wilson. Then there was Ian’s first book. And, although it rubs my populist grain the wrong way, there was the exiled King of Italy, Umberto. And there was of course, John Jackson, who caught fire (almost literally) and with the help of Eric Jumper organized STURP. When you appreciate this confluence, you might add another factor and please don’t groan: the Holy Spirit. It’s enough to make one believe in the Trinity. It was and is a fantastic story. The challenge is to repeat it. Maybe the first stop is St. Louis although it must be a truly international effort. However, I believe the Shroud doesn’t belong to Turin, or the Church but to humanity. Or there again, your own and other like minded people’s reaction against the supposedly amoral modern world has caused you to seek refuge in an imaginary earlier age with a presumably imposed theocratic order, one with moral certitude. Has it ever occurred to you that even in those times, there was a ferment of uncertainty, of “secularism”, of a reaction against those who claimed to have all the answers, of an urge to declare “It ain’t necessarily so”? Living with uncertainty is not to everyone’s taste I grant you, and is not likely to “win friends and influence people”, but it has one small thing going for it. It keeps an open door in one’s head for tomorrow’s new ideas. Aren’t we all hoping for 21st century enlightenment.? I am, despite having no idea as to what shape or form it will take...","date":"2013-10-30","mins":"5:04 pm","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-49182","author":"colin_berry","post":"John Klotz : Colin, Rae Rogers was published in a peer reviewed scientific journal before he died. Also, a book he wrote with the assistance of Barrie Schwortz was published two years post mortem. It come down to Ray Rogers because he’s right and often misunderstood (as I ini tially misunderstood). The issue isn’t that the cotton skewered the date, it’s that linen in the patch was of medieval origin and substantial different than the lined in the other parts of the Shroud. But enough of this. The topic is Freeman’s inquiry about he nature of conferences and I merely applaud both his question and the concept of his question. I think from his question, if he is sincere, he might have much to add as an art historian. It comes down to the fact that the radiocarbon sample was not selected at random, and even it had been, more such randomly selected sites would have been needed to get a precise and accurate dating. So why are we being told about faulty chi square tests etc? Why are we bothered about any stat’s at all, except those in the Nature paper that refer (or should refer) only to variance within and between the three labs (and even then the sampling was not randomised, given the labs were given contiguous specimens). It’s not about Raymond Rogers, far less about cotton (who said anything today about cotton?). It’s about data that derives from a single site that has been challenged on the grounds of being unrepresentative. The answer should be self evident. One does not need another conference to discuss the radiocarbon dating. One needs more radiocarbon data! Let’s discuss the sampling frame, shall we? Which areas of the frontal and dorsal sides are to be considered in and off limits (accepting one cannot cut a strip out of the face, merely because its xy coordinates have been drawn from a hat)..","date":"2013-10-30","mins":"6:40 am","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-126406","author":"colin_berry","post":"“We had hoped to have question & answer sessions but so many papers were submitted and accepted that there is no room for the Q & A” Surely by definition, a “conference” is supposed to be a venue at which knowledgeable and/or interested folk confer with one another. The conferring is supposed to be in the open, with everything on the record. A conference without verbal question and answer sessions is like a car with its axles up on blocks – with no contact between wheels and ground. The parody of real science that calls itself ‘sindonology’ continues as before. It puts one in mind of its counterpart in everyday life – “science” by pdf, where there is no opportunity for scrutiny, either by referees as in formal peer review, or even by “knowledgeable and/or other interested folk” as in the comment enabled blogosphere..","date":"2014-06-03","mins":"1:01 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-49186","author":"colin_berry","post":"That sounds OK on statistical grounds, Hugh. But I seem to recall reading that the radiocarbon labs prefer a patch to a thread for clean up purposes. Don’t ask me why. Or maybe it was a patch to a mass of small threads which would be understandable on grounds of ‘hoikability’. Maybe one longish thread would be acceptable (mutter, mutter)..","date":"2013-10-30","mins":"7:04 am","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-126500","author":"colin_berry","post":"“I do wish there had been time to fit in Q & A sessions” Who in their right mind would want to sit through 20 presentations on the Friday, a total of 11 hours, without hearing a single question from the floor, with every single word or idea unchallengeable? Time HAS to be found to fit in Q/A sessions. For the typical 30 minute paper, make it 25+5. I’m sure the contributors will understand. Or it it less a conference, more a mutual appreciation society, or dare one say “Pay Pal conclave”?.","date":"2014-06-03","mins":"10:52 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-12701","author":"colin_berry","post":"That’s one very pretty church hammer beam roof and illuminated mosaics – an usual combination surely. Are we allowed to know how it came to be chosen?.","date":"2012-06-19","mins":"9:17 am","url":"https://shroudstory.com/2012/06/19/replica-of-the-shroud-of-turin-shroud-in-droitwich-uk/","cat":"event","title":"Replica of the Shroud of Turin Shroud in Droitwich, UK"},{"id":"comment-138460","author":"colin_berry","post":"From googling (my italics) Archdiocese announces dates for 2015 public display of Shroud of Turin By Cindy Wooden Catholic News Service VATICAN CITY (CNS) — The Archdiocese of Turin, custodian of the Shroud of Turin, has announced that the shroud, venerated by many as the burial cloth of Christ, will be on public display April 19 June 24, 2015. The archdiocese said the 67 day display will be the longest period of time that the 14 foot by 4 foot linen cloth has ever been available for public viewing; providing a window of more than two months not only will allow more faithful to see it, but also will make it easier for Pope Francis to schedule the visit he has said he wants to make. At the same time, the Turin announcement said, the public display will coincide with several events in Turin for young Catholics arriving to mark the 200th anniversary in 2015 of the birth of St. John Bosco, the founder of the Salesians. In early March, the archdiocese also announced that it had chosen a theme for the 2015 display: “The greatest love.” Archbishop Cesare Nosiglia of Turin said, “The greatest love is God’s for men and women,” a love reflected in Jesus, “the son of God made man, who accepted death on the cross for the salvation of all, in every time and every situation.” The image on the shroud, he said, testifies to the “suffering and death of a crucified man” and is “a sign of that love which does not end with death.” ################################ Don’t you just love that phrase “will make it easier for Pope Francis etc etc” or “the death of a crucified man”. Is anyone else thinking what I’m thinking? Clue: remind yourself of the Vatican’s (present) position re authenticity. Methinks tickets and reservations for us hoi polloi, “young Catholics” included, are nowhere near the top of Turin’s list of priorities. Thus the information vacuum re reservations, the tumbleweed website ….","date":"2014-07-15","mins":"7:40 am","url":"https://shroudstory.com/2014/07/15/reservations-for-viewing-the-shroud-of-turin-in-2015/","cat":"2015","title":"Reservations for Viewing the Shroud of Turin in 2015"},{"id":"comment-33706","author":"colin_berry","post":"C 14 atoms in the linen also fail to deteriorate at the expected rate – yet another sign. ; ).","date":"2013-05-15","mins":"6:55 am","url":"https://shroudstory.com/2013/05/15/review-of-the-holy-shroud-exhibition-in-seville/","cat":"event","title":"Review of the Holy Shroud Exhibition in Seville"},{"id":"comment-33777","author":"colin_berry","post":"Have you read the re posted blog in its entirety, Mario? Methinks you cannot have done so….","date":"2013-05-16","mins":"11:25 am","url":"https://shroudstory.com/2013/05/15/review-of-the-holy-shroud-exhibition-in-seville/","cat":"event","title":"Review of the Holy Shroud Exhibition in Seville"},{"id":"comment-37340","author":"colin_berry","post":"Highly regarded or not, that journal was one that Rogers had helped to found, and on which he served as editor for many years (see wiki). It is highly unlikely that any other peer reviewed journal would have accepted Rogers’ paper, given the uncertain provenance and history of the few ‘leftover’ threads that used for his studies. Still more sloppy Shroudology – of which there is a surfeit. The 1988 dating is statistically open to dispute certainly (through no fault of the scientists) – but the idea that it is scientifically “meaningless” is just wishful thinking on some people’s part. Had it returned a 1st century answer, we’d be reading here that it was “conclusive evidence”, the last word on the matter..","date":"2013-06-18","mins":"6:10 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","title":"Shroud of Turin Talk in Gilroy, California"},{"id":"comment-37356","author":"colin_berry","post":"Publishing a non thermochemical paper in one’s own specialist thermochemical journal does not necessarily “taint” one’s findings, and I never said it did. But it does rather take the shine off claims that Rogers paper was considered worthy of publication in a “peer reviewed” journal, when clearly those keen to talk it up are unaware of the special circumstances, or the fact that the journal editors were probably aware that their one time colleague did not have long to live. In any case, the appropriate place for Rogers’ paper was not a thermochemical journal, regardless of his pre Shroud interests. What’s thermochemistry got to do with forensic style studies on a few threads? The appropriate place for a paper attacking the radiocarbon dating would have been the non specialist “Nature” itself, the very journal which published the 1988 findings. Did Rogers maybe submit it to Nature and have it rejected? Might Nature have accepted it as a letter rather than the more prestigious “full length” paper format? That’s the thing you see. Unless you’re an insider, you only get to know who accepts a paper. You never get to know of the ones who rejected it – or on what grounds. As an ex reviewer myself I would have accepted the 1988 paper, warts an’ all. While insisting that the authors state the provisional nature of the results, and the need for additional sampling sites, but would have rejected Rogers paper out of hand. Rogers should never have embarked on those studies in the first place. There was a furtive loner quality about it – especially the manner by which he came to receive his material. Maybe if he had lived longer he could have been persuaded to take his findings to the Shroud’s custodians and persuaded them to have the entire dating repeated, but with a proper sampling frame. He could also have argued for some parallel chemical characterization, e.g. To measure the cellulose or total carbohydrate content of the sampled material as a guide to likely levels of contamination. To listen to some here, one could be forgiven for thinking that the Shroud was now mainly a mix of fungal fibres and field pollen, held together with generations of handlers’ skin grease..","date":"2013-06-19","mins":"2:37 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","title":"Shroud of Turin Talk in Gilroy, California"},{"id":"comment-37320","author":"colin_berry","post":"It was not random sampling of the Shroud, and never intended as such. Would you expect it to be? What if a random sampling protocol had specified a sample from one of the eyes? It was sampling of 3 contiguous samples from an inconspicuous corner of the Shroud – as permitted by the custodians. Kindly cease demonising the scientists for showing a proper sensibility for the feelings of those who never wanted their ‘Holy relic’ to be messed around with by scientists… Oh, I forgot. Demonising is what you do best….","date":"2013-06-18","mins":"12:16 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","title":"Shroud of Turin Talk in Gilroy, California"},{"id":"comment-37359","author":"colin_berry","post":"But Rogers also did some trumpeting,especially of his claim that his thread was a splice of two different ones, and that an attempt has been made to disguise that fact with yellow dye. Does that not implant in the reader’s mind the idea of subterfuge and conspiracy? If so, then at what period of history? Medieval? Why would anyone go to great trouble to invisibly restore a damaged corner, taking the trouble to perform end to end splicing on individual fibres, artificially aged with dye. That medieval scenario simply does not make sense. So what did Rogers think? That maybe the alleged splicing and dyeing had been done on or after 1988 in an attempt to contaminate Shroud samples with modern carbon? Was Rogers deliberately trying to implant the idea of a dark conspiracy to discredit the Shroud? Or was Rogers just an honest foot soldier, dutifully reporting what he saw, or thought he saw, leaving others to make what they wanted of his alarmist findings? If the latter, then who’s to say that the real conspiracy, if there was one, was to discredit the radiocarbon dating retroactively by slipping some post 88 doctored threads into the public domain, i.e. Onto a respected scientist not given to suspecting, far less entertaining conspiracy theories, such that the entire 88 sample then becomes discredited on a guilt by association basis. I have a hunch – just that – that Raymond Rogers may have been used, and that he was too trusting to realize that he was being used. But he was culpable in one respect – he should never have submitted his extracurricular homework on a few donated threads to his own professional journal, such that 8 years later folk on this site still crow about his work having appeared in a prestigious peer reviewed journal, the Latinized title of which is invariably mispelled!.","date":"2013-06-19","mins":"4:15 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","title":"Shroud of Turin Talk in Gilroy, California"},{"id":"comment-37375","author":"colin_berry","post":"Matthias : It is potentially credible that a damaged corner was mended given the status of the shroud as a holy relic. So why was it folded lengthwise down its midline, at the time it acquired the 1532 burn holes? Midline folding (needed to explain the bilateral symmetry of the burn holes) would inevitably have tended, over time, to create an unsightly fold mark or even permanent crease down the middle of the face and torso. Is that how one stores a holy relic? Why was it not rolled up instead, or folded in ways that did not leave creases anywhere in the body image area? Come to think of it, why weren’t the L shaped poker holes repaired by re weaving, assuming they were acquired pre 1532? Or the later 1532 burn holes either, for that matter, instead of being infilled with patches of new cloth? Sorry, but I see no evidence that the Shroud was given the reverential care one would normally expect to be bestowed on a supposedly fragile 15 centuries old artefact, least of all a supposedly holy relic. Quite the contrary in fact. Did its medieval custodians know something about its provenance as to make them somewhat lackadaisical about handling and storage?.","date":"2013-06-19","mins":"8:58 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","title":"Shroud of Turin Talk in Gilroy, California"},{"id":"comment-37371","author":"colin_berry","post":"How can you claim that Rogers’ homework with ‘undocumented’ material discredits anything, least of the ’88 dating, given the subsequent report from Freer Waters and Jull with authentic material? https://journals.uair.arizona.edu/index.php/radiocarbon/article/view/3419 I think you should at least mention contrary findings, even if you have grounds for doubting their reliability. Failure to do that simple continues the process – all too apparennt on this site – of elevating Raymond N.Rogers to a state of near sainthood. Reminder – he was plain Mr. Rogers, a thermochemist working in a Government centre on safety testing of chemical explosives. Yes, he was gifted and resourceful experimentalist, but sometimes could not see the wood for the trees. And I I say, he should NOT have submitted his private probings of an undocumented thread or two to his own professional journal on which he had “influence”, though one makes allowance for the fact that he must have known he did not have long to live when he did so circa 2005. While I have little doubt that medieval Shroud custodians had the skill and patience to invisibly repair damaged fabric – though I doubt whether end to end splicing of threads was considered necessary, given the irregularity and flaws in the weave it seems scarcely credible that anyone would have gone to all that trouble simply for an inconspicuous corner. End to end splicing and dyeing is more likely to be modern day jiggery pokery – and I say that as someone who generally has little time for conspiracy theories. But then a single mischief making individual (excluding Rogers), wishing to defend or promote a position – hardly amounts to a conspiracy – more a cheap and rather pathetic stunt..","date":"2013-06-19","mins":"8:00 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","title":"Shroud of Turin Talk in Gilroy, California"},{"id":"comment-37323","author":"colin_berry","post":"The failure of an internet troll to apologize for her character attacks will not prevent me from pointing out her retreat into mumbo jumbo and pseudo science…But then, some of us have encountered US based lately acquired M Ds for whom those letters mean Minor Deity. Lady, I have met any number of your sort, and indeed worked with them. You do not impress me with your feeble understanding of scientific principles. Stick to anaethetising your patients. If I were one of your patients, I would beg to be anaesthetised..","date":"2013-06-18","mins":"12:35 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","title":"Shroud of Turin Talk in Gilroy, California"},{"id":"comment-48772","author":"colin_berry","post":"…his corpse gave off particle radiation while it was wrapped in his burial garment … Does anyone know precisely what kind of particle radiation Mark Antonacci (“attorney and historian”) has in mind? Is it ionized atoms or molecules, as in corona discharges, or entire nuclei (e.g. Alpha particles aka helium nuclei) or individual protons, neutrons or electrons? Or is the term particle radiation used loosely to include electromagnetic radiation? If so, what frequency range? Infrared? Visible? Ultraviolet? X ray? Gamma ray? One can hardly begin to evaluate a radiation model unless one knows the specifics. A quick search has failed to turn up clues as to what kind of beam is envisaged (it would have to be a remarkable one to produce an image by self or mysteriously assisted collimation, i.e.travelling from body to linen in strictly parallel trajectories requiring no lens or other focusing system)..","date":"2013-10-26","mins":"9:34 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","title":"Some thoughts on the St. Louis conference announcement"},{"id":"comment-48788","author":"colin_berry","post":"Hugh Farey : Have a look at the top photo on this page: http://www.resurrectionoftheshroud.com/research.html. It shows the shroud from end to end. Look what’s happened to the radiocarbon sample area. Magic! Yup, wonderful these photoediting clone tools. What concerns me more are the two references to “particle or neutron” irradiation (that magically or even non magically produces the extra C 14 to confound 20th century radiocarbon dating). Why bother to make the distinction, given that a neutron is a particle with essentially the same mass as a hydrogen atom? It hardly inspires confidence….","date":"2013-10-26","mins":"10:24 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","title":"Some thoughts on the St. Louis conference announcement"},{"id":"comment-48803","author":"colin_berry","post":"What can we ‘pseudo skeptics’ usefully say that won’t be misrepresented and maligned as pursuit of an undeclared agenda? There’s no point in striving for points of contact, far less agreement, if or when semantic hand grenades designed purely to rough up the opposition get tossed into the debate..","date":"2013-10-26","mins":"11:58 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","title":"Some thoughts on the St. Louis conference announcement"},{"id":"comment-48777","author":"colin_berry","post":"Magic you say? How can you be so dismissive, Hugh, so uncharitable? If you’re right, a possibility not to be lightly rejected, you being a physicist an’ all, then it should perhaps have been planned as a magical mystery tour. That way the showman stays on the move, like the snake oil salesman, if only to keep one step ahead of disenchanted customers, enchantment being (in this instance) the commodity that is expected and demanded… ; ).","date":"2013-10-26","mins":"9:53 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","title":"Some thoughts on the St. Louis conference announcement"},{"id":"comment-48814","author":"colin_berry","post":"It’s not quite at the midway point between Bari and St.Louis, but I know a good pub in central London with an upstairs room for hire (we used to use it for monthly meetings of the London Lipid Club). It’s called the Museum Tavern, and is directly opposite the British Museum… Oops..","date":"2013-10-26","mins":"2:38 pm","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","title":"Some thoughts on the St. Louis conference announcement"},{"id":"comment-48819","author":"colin_berry","post":"Listening to a slide presentation while supping a pint (after hours), as I used to at the London Lipid Club, never hurt anyone’s mental faculties, probably the contrary in fact. Look where Watson and Crick made a bee line for as the venue for announcing “the secret of life” – the Eagle pub in Cambridge. (It has a plaque on the wall, claiming – wrongly – that ‘s where the two announced the “discovery of DNA”, overlooking to mention the double helix). As for your suggestion that there are (only?) two other noteworthy pubs in London, words fail me. Once the shops and offices close up, London is one giant pub scene, lunchtimes too, with patrons overflowing onto the pavement outside, though maybe not this time of year, with a giant storm now heading in from the Atlantic..","date":"2013-10-26","mins":"3:20 pm","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","title":"Some thoughts on the St. Louis conference announcement"},{"id":"comment-161690","author":"colin_berry","post":"Stalling for time? What the ‘shroudology’ morass demonstrates to perfection are the hazards of an incomplete database, one in which the gaps are filled in by exercise of imagination, nay fantasy. One has to ask: who is pushing for those gaps to be filled, and who is not? I came across a pertinent analogy recently from an entirely different context while travelling in Georgia (eastern Europe). Mr. Putin is being accused there of engineering what have been called ‘frozen conflicts’ on his borders with territories (like Georgia, Ukraine, Latvia etc ) that used to be part of the Soviet Union, but have since had the temerity to break free from the embrace of Mother Russia. “Frozen conflict”? Like that in which the C 14 dating is routinely referred to as a “fiasco” and the C 14 scientists as a dodgy bunch of co conspirators? But when one suggests that a repeat determination with more sampling sites is all that’s needed to clear the air, there are instantly cries that ALL C 14 dating of ancient linen, especially that bearing images of the crucified Jesus, are inherently unreliable. There are insuperable problems of contamination, or exposure to earthquake radiation, bla bla, didn’t you know? Yeah, right. Keep the “frozen conflict” going as long as possible, eh? Is everybody booked in for the not to be missed 2015 Shroud exposition? Make hay while the sun shines….","date":"2014-10-12","mins":"12:00 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","title":"\"Just the facts, ma’am.\""},{"id":"comment-126691","author":"colin_berry","post":"New detective you say? Joseph Accetta was a member of the original STURP team, one with impeccable credentials in lasers and imaging..","date":"2014-06-04","mins":"3:18 am","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins"},{"id":"comment-127064","author":"colin_berry","post":"Try downloading this Power Point presentation from Joseph Accetta, David (he being the subject of a recent posting here, and one of STURP’s genuinely scientific, non agenda driven, non grandstanding participants in my view). Http://www.holyshroudguild.org/media/%20 INFRARED%20 IMAGING%20 AND%20 SPECTROSCOPIC%20 PHENOMENOLOGY%20 OF%20 THE%20 TURIN%20 SHROUD.ppsx (Unzip as if a pdf). Go to the last few pages (approx 24/25). There you will see model spectroscopic (ir) studies not just with thermally imprinted scorches, but also with linen that has been chemically dehydrated with 36% H2 SO4 and even your invisible ink (lemon juice). I’d be the first to admit there may be little to distinguish between an image produced by chemical as distinct from thermal dehydration (especially if chemical action was heat assisted – see Luigi Garlaschelli’s model ‘frottage’ imprinting with acid contaminated red iron oxide). It’s the vehicle for acid that is important (not too runny, not too viscous). Some of us eagerly await details of what JA will say at St.Louis. Let’s hope it receives more attention than his meticulous and detailed studies to date. Nuff said. I’m thinking of doing a post dedicated entirely to JA (he being my kind of scientist)..","date":"2014-06-05","mins":"12:55 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins"},{"id":"comment-162235","author":"colin_berry","post":"Mike M asks: “What’s wrong with such an investigation?” Nothing, if it were timely and relevant to what is being discussed here. But it’s not. What we are discussing is a hypothesis that had the St.Louis attendees in raptures. See these words from Dan’s “The Conference is Over”: “When Bob Rucker finished his extended talk, MCNP Analysis Of Neutrons Released From Jesus’ Body In The Resurrection the applause was seismic. In closing, he mentioned that he had a few handouts of his slides. They were gone in 15 seconds as people all but climbed over tables to grab them. I was approached by several people to see if I would publish his Power Point now because nobody wanted to wait until the conference papers were published, probably in December. So what caused all the excitement? It certainly wasn’t the idea that the TS had at some stage merely been exposed to neutron radiation. It was the source of that radiation (“released from Jesus’s body”) which I feel bound to say is deeply problematical for some of us who know a little about stable and unstable nuclides. To Rucker’s credit he has made predictions, quite extraordinary and daring ones, ones that Eric has flagged up before me, namely the expectation of there being a superabundance of C 14 in core regions of the TS that would date it into the future! Sorry, Mike M, but your minimalist approach for testing so heroic a Resurrection model may fit your bill but simply does not rise to the occasion. I’m ignoring your tail end observations regarding my own humble researches. If you have questions/criticisms re particular claims or the methodology/documentation employed I may respond..","date":"2014-10-14","mins":"2:05 am","url":"https://shroudstory.com/2014/10/11/chart-of-conference-well-so-far-anyways/","cat":"st_louis_2014","title":"Chart of Conference. Well, So Far, Anyways"},{"id":"comment-126944","author":"colin_berry","post":"If I’d intended to attack you and your avant garde ideas re subcellular DNA laser guns, Dave Hines, I’d have put a few pointed questions to you, like how come the TS man’s hair is so well imaged given that hair, mainly dead keratin beyond the follicle, has scarcely any intact DNA after cornification, and more besides. As it was Hugh Farey took on that task, and I was content merely to point out that Joseph Accetta Ph D (not to be confused with the radiologist August ‘glow in the dark’ Accetta MD) was no new kid on the block, as suggested by your ‘new detective’ tag. There was no personal attack in making that small point. My advice to you is to hang around. You might find the site is a broader church than you first imagined. Shame about the agenda driven blue sky thinking, though, when unsullied by anything so crass as hard experimental data..","date":"2014-06-05","mins":"1:10 am","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins"},{"id":"comment-161999","author":"colin_berry","post":"No comments permitted yet I see on “The Conference is Over ” posting? Pity. I wanted to know what Bob Rucker’s “MCNP analysis” was all about (apart from spontaneous emission of neutrons from RDVI Ps (recently deceased VI Ps) that handily converts N atoms of linen to C 14. MCNP? Manufacturing Curies Negates Patching?.","date":"2014-10-13","mins":"9:48 am","url":"https://shroudstory.com/2014/10/11/chart-of-conference-well-so-far-anyways/","cat":"st_louis_2014","title":"Chart of Conference. Well, So Far, Anyways"},{"id":"comment-162074","author":"colin_berry","post":"“Isn’t that what science is all about?” That depends. What model is being proposed that can: (a) generate a superficial negative image? (b) make it seem 1400 years younger than it really is in radiocarbon dating? (c) is experimentally testable in principle? One suspects that (c) is the brick wall. How does one get a cadaver in a laboratory or elsewhere (rock tomb etc) to suddenly start spontaneously emitting neutrons? If one cannot, if that step is deemed to have been a ‘one off’ miracle, then it’s emphatically not a scientific model. It’s an attempt to foist a preconceived narrative that while wrapped up in the language of science is untestable and therefore NOT science. In short, it’s our old friend, the bane of 90% of sindonology – it’s pseudoscience,.","date":"2014-10-13","mins":"3:45 pm","url":"https://shroudstory.com/2014/10/11/chart-of-conference-well-so-far-anyways/","cat":"st_louis_2014","title":"Chart of Conference. Well, So Far, Anyways"},{"id":"comment-160938","author":"colin_berry","post":"If anyone’s wondering why St.Louis was chosen as the venue, here’s a possible clue from the wiki entry (under ‘People’): The perception of Louis IX (ed. St.Louis) as the exemplary Christian prince was reinforced by his religious zeal. Louis was a devout Catholic, and he built the Sainte Chapelle (“Holy Chapel”), located within the royal palace complex (now the Paris Hall of Justice), on the Île de la Cité in the centre of Paris. The Sainte Chapelle, a perfect example of the Rayonnant style of Gothic architecture, was erected as a shrine for the Crown of Thorns and a fragment of the True Cross, precious relics of the Passion of Jesus. Louis purchased these in 1239–41 from Emperor Baldwin II of the Latin Empire of Constantinople, for the exorbitant sum of 135,000 livres* (the chapel, however, cost only 60,000 livres to build). *That was more than 10% of France’s then current national income, according to information elsewhere in the same wiki article. Oh, and St.Louis won’t be Barrie Schwortz’s favourite Roman Catholic saint, assuming he has one, as the rest of the article makes painfully all too clear..","date":"2014-10-10","mins":"4:43 am","url":"https://shroudstory.com/2014/10/09/it-may-well-be-the-best-publicized-conference-yet/","cat":"st_louis_2014","title":"It may well be the best publicized conference yet"},{"id":"comment-161334","author":"colin_berry","post":"Where future research on the TS image is concerned, it’s time to discriminate between, on the one hand, the STURP view that saw the image as pyrolysed carbohydrates and, on the other, the idea of it being some kind of Maillard reaction product. (That’s whether or not one buys into Rogers’ putrefaction vapour model (it not being the only means of ending up with a Maillard product). The problem one is up against, from a chemical standpoint, is the superficiality of the image and its chemistry, relative to the bulk carbohydrates of flax fibres. It’s a tall order, analytically speaking, to distinguish image signal (or should that be signature?) from substrate background noise. There is a possible way it might be done, though it’s admittedly a bit of a long shot. Ray Rogers employed the technique of pyrolysis mass spectrometry, which basically fragments a specimen and then collects and measures those fragments according to their m/e (mass to charge) ratios. It was that technique that allowed him to pick up a signal for hydroxyproline in the “blood”, an important finding, even if his conclusions were open to differing interpretations. So how might that technique be refined to discriminate between pyrolysis and Maillard products? The crucial difference is the small amount of additional Maillard reacted nitrogen in the image compared to the non image areas. If one simply took image and non image areas and performed pyrolysis mass spec, looking for differences in fragmentation pattern that could be related to known chemistry, there would almost certainly be a signal/noise problem, as already stated. But there’s a possible way of filtering out some of that noise, or at any rate pinpointing the crucial fragments. Adler and Heller discovered that the TS image is bleachable with diimide (N2 H2), which is a powerful reducing agent. The latter can be reasonably assumed to decolorise chromophores by adding hydrogen atoms across double bonds. So the trick is to do difference spectrums, before and after diimide treatment, and look for all those fragments that differ by m/e =2, corresponding to addition of two hydrogen atoms per molecule or fragment thereof. Having located those key fragments, one then looks up their m/e values, giving preference (where any ambiguities might exist) to those which contain the element nitrogen, bearing in mind there can be no Maillard reaction without a source of that element in the form of amino ( NH2) groups. If one finds nitrogen in the key diimide reducible fragment, then one should think Maillard reaction. If one does not, then think simple pyrolysis..","date":"2014-10-11","mins":"10:55 am","url":"https://shroudstory.com/2014/09/28/john-jackson-to-moderate-future-testing-discussions-in-st-louis/","cat":"st_louis_2014","title":"John Jackson to Moderate Future Testing Discussions in St. Louis"},{"id":"comment-161022","author":"colin_berry","post":"Would that be after one has feasted on the “soda/popcorn daily in (hotel) lobby, 3 10pm daily”? http://www.stlouisshroudconference.com/updates/recent post one Personally, I attend conferences to expand my horizons – not waistline..","date":"2014-10-10","mins":"9:52 am","url":"https://shroudstory.com/2014/10/09/it-may-well-be-the-best-publicized-conference-yet/","cat":"st_louis_2014","title":"It may well be the best publicized conference yet"},{"id":"comment-161341","author":"colin_berry","post":"PS: I see from googling that one can purchase deuterated and tritiated diimide (N2 D2 and N2 T2 respectively). Those reagents would greatly simplify the task of spotting the reduced fragments on mass spectrographs, given they contain heavier isotopes with m/e ratios 2 and 3 times greater than hydrogen..","date":"2014-10-11","mins":"11:24 am","url":"https://shroudstory.com/2014/09/28/john-jackson-to-moderate-future-testing-discussions-in-st-louis/","cat":"st_louis_2014","title":"John Jackson to Moderate Future Testing Discussions in St. Louis"},{"id":"comment-161113","author":"colin_berry","post":"“But if the C 14 had produced a date of AD 30, I’d expect skeptics would now be doing the exact same thing — pointing out the methodology flaws. “The linen may be first century but how do we know the image area is?”” Maybe. But I personally would not have been one of them. One does not lightly impugn motives, without some kind of independent supporting evidence, preferably involving actions. There was no shortage of furtive actions behind closed doors in Turin to feel fully justified in impugning motives, like the clandestine stripping out and retaining of one or more threads from the centre of the C 14 sample, only to conveniently and shamelessly reappear later as part of a C 14 debunking exercise. Certain of the more shrill pro authenticity propagandists talk about the C 14 “fiasco”, in a shabby attempt to incriminate the scientific integrity of the labs and their personnel. Some of us have little doubt as to where the real blame lies, pointing to a wholesale abandonment of integrity, and it was upstream of the 3 testing labs..","date":"2014-10-10","mins":"3:37 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","title":"St. Louis, Friday Morning"},{"id":"comment-174899","author":"colin_berry","post":"From Russ’s Powerpoint presentation (see above): However … Unlike the Burns The image does NOT fluoresce under uv fluorescence. The image is NOT the result of heat So… it looks like a scorch, but isn’t. There’s one thing we can be pretty sure about: the TS image was NOT formed by the kind of high temperature incineration that produced the 1532 damage. The latter was full thickness burns, leaving gaping holes with charred and scorched edges. Nothing so extreme is or was needed to produce an image of TS like faintness by brief contact scorching from a heated template. The latter is cooling the moment it makes contact with the cloth, producing (if one wishes) a superficial image that affects only a few fibres at the surface of the thread with no obvious reverse side scorching. If you’re going to hold up the 1532 burns marks as a reason for rejecting the scorch model then do please add some caveats. If you’re feeling generous, you could even introduce some balance by pointing out how well they respond to 3 D enhancement, just like that ‘profoundly mysterious’ TS image (see this blog’s margin notes). Sorry to mention the bword….","date":"2014-12-06","mins":"6:24 am","url":"https://shroudstory.com/2014/12/06/st-louis-theology-presentation-by-russ-breault/","cat":"st_louis_2014","title":"St. Louis Theology Presentation by Russ Breault"},{"id":"comment-161097","author":"colin_berry","post":"It’s not really carbon dating methodology that is in the frame, is it? It’s the question as to how one takes test samples from a treasured religious icon for sadly destructive testing such that any authenticity supporting answer, let’s say 33 AD +/ 100 years, would not have left the then “authenticated relic” irreversibly damaged. The 3 radiocarbon labs were no doubt conscious not merely of their technical responsibilities for producing accurate and roughly concordant answers but also of the weight of opinion had they turned up a answer that supported authenticity. That is the only reason I can think of for their agreeing to work on a single sample from an inconspicuous corner (“let’s be content with a ranging shot exercise for starters”). Is that so heinous a crime on their part, acquiescing to what appears to have been arm twisting eleventh hour appeals for minimally intrusive sampling? Personally. I’ d have walked away, but that’s easy to say when there are two other competitor labs still in the running, able to grab some kind of publicity and kudos, whatever the answer, making one’s own behaviour seem prima donna like and ungracious. Why appoint three labs, when all were to be fobbed off with a single strip for subdividing? A clever game of divide and rule on the part of the nervous Shroud custodians? Solution: divide (single snipping) and play safe, covering all bets, all outcomes? Leave oneself a escape route, where others could be confidently expected to point out the all too obvious methodological flaw, and more besides?.","date":"2014-10-10","mins":"2:08 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","title":"St. Louis, Friday Morning"},{"id":"comment-174930","author":"colin_berry","post":"There might be a hundred differences between the TS image and certain model scorches depending on factors like temperature. All one is doing with a uv lamp is showing up just one or two of those differences, due to presence or absence of particular chemical entities while remaining ignorant of all the others that are non fluorescent. If you don’t know (or care) what’s causing the fluorescence at the molecular level, then any argument based on fluorescence is frankly worthless, especially when it’s about the absence of fluorescence. Yes, I for one would like to know which particular chemicals give certain scorches their uv fluorescence (I suspect they are polycyclic aromatics whose flat shape favours loss of energy from excited electronic states by fluorescence). But gaps in one’s knowledge that one freely acknowledges are no grounds for being held hostage for not having done those experiments, not when others, better equipped than I am, haven’t bothered to do them either, being content to ‘play the fluorescence’ card, or allow others to do so. I prefer to hypothesize and experiment, that being the scientific MO. I don’t ‘play cards’. We can discuss TH and his pdfs another day. Suffice it to say I have checked out his claims and found them wanting or incorrect in certain key aspects, as he has been made aware..","date":"2014-12-06","mins":"9:58 am","url":"https://shroudstory.com/2014/12/06/st-louis-theology-presentation-by-russ-breault/","cat":"st_louis_2014","title":"St. Louis Theology Presentation by Russ Breault"},{"id":"comment-162653","author":"colin_berry","post":"The marketing of the Shroud, 2010? Puts one in mind of the Ford Edsel. Http://en.wikipedia.org/wiki/Edsel OK, so it had an engine and four wheels….","date":"2014-10-15","mins":"1:34 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-162689","author":"colin_berry","post":"Oh dear. You are showing your age, Paulette. Chemical anti acid remedies like the one you mention, based on aluminium and magnesium hydroxides, were introduced about 60 years ago and caused no end of side effects. Then the H2 receptor antagonist like cimetidine and ranitidine were introduced, sophisticated rational drug therapy, acting at the sites of acid secretion. Now we have an entirely new class of proton pump inhibitors like omeprazole, acting via an entirely different mechanism, even more sophisticated with fewer side effects. My problem is not stomach acidity. It’s the gut feeling of disgust at seeing the wholesale prostitution of science to push an agenda. St.Louis managed to plumb new depths in pushing that agenda..","date":"2014-10-15","mins":"3:46 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-162765","author":"colin_berry","post":"You call it a “conference”, Thibault, yet there was no discussion allowed after each paper. That’s not a conference. It’s a marketing exercise. Just don’t look too closely at what’s being sold, though Joe Marino’s bio gives a clue: “Both Joe and Sue performed exceptional work on researching the Shroud, and bringing its message to the world.” What a travesty. What a mockery of science….","date":"2014-10-15","mins":"11:50 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-162665","author":"colin_berry","post":"Stateside Shroudology is the pits. If anyone is any doubt on that score, they need look no further than St.Louis, 2014..","date":"2014-10-15","mins":"2:49 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-162874","author":"colin_berry","post":"Reminder: it’s called : “Shroud of Turin Blog Latest news and views on the Turin Shroud” There’s nothing in that title to suggest that the site exists for the benefit of true believers in the Shroud’s authenticity, or to “protect them from embarrassment”, whatever that means. If it did, or I so much as suspected that were its true purpose then (a) I wouldn’t be here, even offering occasional comments, caustic or otherwise and (b) it would serve no useful purpose in being online, accessible to all and sundry without password protection. It’s an open to anyone site. So kindly cease sounding as if you were some kind of stakeholder in the site with the right to dictate the tone of the proceedings. [Insult removed]. My mission was made clear when I set up my sciencebuzz site in 2005 – to expose media dissemination of pseudo science wherever and whenever I found it. Shroudology is 90% pseudoscience; the St.Louis so called conference, allowing no questions to speakers, has just dumped a whole new critique free truckload. Corpses as neutron emitting, image imprinting sources? Yeah, right..","date":"2014-10-16","mins":"11:14 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-162883","author":"colin_berry","post":"Yes, but inserting “Insult removed” means that late arrivals will have to speculate as to what I said, and in all probability imagine the “insult” to be greater than was the case (especially as I phrased it as a question for consideration). Time methinks to take another holiday from this site and its trolls (especially in view of Mike M’s recent obnoxious slurs my experimental competence, claiming that I worked without protocols, controls, proper documentation etc). You let that past, didn’t you Dan Porter? One rule for me… (My recent experiments not only compared linen treatments in butted edge to edge test samples, but also examined systematic temperature variation, albeit with no numbered scale. When did anyone here last see that being done?). I say enough is enough – for the time being at any rate. I’ve said all I need to say about that travesty of a “conference” that made no provision for conferring..","date":"2014-10-16","mins":"11:58 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-162596","author":"colin_berry","post":"None of this gushy off beam posting is Dan Porter’s nuanced somewhat world weary laid back prose style. (What’s the opposite of being on steroids? Being on Sanatogen?) Nope, he didn’t pen a single word of it. Maybe just as well, given the flatulent content..","date":"2014-10-15","mins":"10:21 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-162617","author":"colin_berry","post":"Make no mistake. The St;Louis conference revealed the febrile, wild eyed face of Shroudology like none other before it… Shame this site’s host was suckered in….","date":"2014-10-15","mins":"11:50 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163341","author":"colin_berry","post":"“There were so many papers that there was no time for discussion after each paper. ” That kinda says it all – simple cause and effect. I once organized a Dietary Fibre conference at FMBRA, Chorleywood, UK way back in the 80s. Admittedly it was only a 1 day affair, but I was able to fill most of the slots by personal invitation to those whom I could be certain had something new and useful to say – big hitters like David Southgate, Hans Englyst etc. It would never have occurred to me to organize a conference that left no room for discussion after each paper. Conference = Confer ence – a place where people get to confer. Online open to all interaction is interesting as an adjunct – but cannot serve as a substitute, especially if there’s no guarantee that a speaker will respond, or do so in the manner he/she would address questions from the floor to a room full of experts, possibly with one or more media folk in attendance, scribbling notes.. That’s my last word on the matter, at least on this site. I shall deal with further points, constructive or otherwise, on my own site, as I did yesterday with the recent comments posted here on shroudstory some 6 days ago regarding own experimental programme. Nuff said..","date":"2014-10-18","mins":"12:35 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-162624","author":"colin_berry","post":"But my main comment – a response to Piero’s second comment – is still missing, despite sending a second and third time. Why? Buggy software. Maybe, Maybe not..","date":"2014-10-15","mins":"12:22 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-162630","author":"colin_berry","post":"PS: Have just spotted “Note: Pictures and bios shamelessly copied from the conference website.”. Do you not think that should have been at the start, Dan, not right at the end, where it could be so easily be missed…?.","date":"2014-10-15","mins":"12:33 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-151228","author":"colin_berry","post":"Hudson’s so called patent application is anything but. Try reading some real patent applications, ones that focus on the practical patentable detail, which don’t try to bamboozle with superfluous so called electron orbital theory (the latter padding out being meticulously contrived bullsh*t designed to overawe the gullible with pretentious waffle)..","date":"2014-09-15","mins":"3:08 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-151246","author":"colin_berry","post":"The date on the patent application was 1989, 20 years after the dates you quote, the latter relating to the earlier enabling legislation. We do not know from the photocopy of the application whether or not it was approved. I suspect not. Forget about differences between organic v inorganic chemistry where patent applications are concerned. There is no role for abstruse mechanistic chemical theory in either, unless needed to make the case for the novelty of the process for which patent protection is sought. But there was no substantive link between the somewhat mundane chemical detail and the (over) interpretation at the electronic level. Indeed, there was a yawning chasm between the two… In fact, the practical detail looks somewhat laboured and suspect (I’ll spare you the detail)..","date":"2014-09-15","mins":"4:33 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-151334","author":"colin_berry","post":"I too learned about transition elements, degenerate d orbitals and crystal field field theory in Prof Ron Belcher’s inorganic chemistry department, University of Birmingham, England, 1963 66, while studying for a first degree in biochemistry. Before and after that, I also learned to spot deliberate deceit by snake oil merchants, albeit cleverly and laboriously disguised as “science” (University of Life, 1944 present). Nuff said..","date":"2014-09-16","mins":"1:05 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-152757","author":"colin_berry","post":"“Colin, it may be the fact you view everything with a jaundiced eye…” Really? Even part time trolls need to do their homework. Https://shroudstory.com/2014/06/05/good 3d from a conventional photograph/.","date":"2014-09-20","mins":"1:31 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-153029","author":"colin_berry","post":"Angel: there’s nothing “antithetical to Christian belief” in being a sceptic where the TS is concerned. Ask the Vatican if you don’t believe me. I’ll be spending the rest of today reviewing the totality of my evidence (presented in some half dozen postings spread over 30 months or more) regarding one tiny detail of the TS image. I refer to the transverse twin track imaging of a crease in the linen at chin/neck level. I believe my observations on the fine structure of that crease, captured as some kind of scorch, constitutes prima facie evidence for the TS body image having been imprinted via physical contact between linen under applied tension and/or pressure and a heated template, probably metal. It’s based as experimental hands on science always is – on patient, detailed model construction and testing. What models will you be testing today, Angel, you being a scientist an’ all, or so you would have us believe? Superconductor aided levitation? Good luck with getting your feet off the ground. My advice, for what it’s worth, would be to concentrate on keeping your firmly feet on the ground… Occasional blue sky thinking is fine, provided you then return to terra firma. As regards your description of me having a ‘jaundiced eye’ for “all” authenticity supporting research: wrong. That’s troll speak whether you realize it or not. My ridicule and contempt is reserved for jargon laden pseudo science that postures as real science, invariably deployed by sad, mind control fanatics to promote their obsessional pet theories or agendas (political, philosophical, theological, ideological etc etc). These people, with their easy access to the media, risk damaging the brand (real, model testing science, that is) in the public’s perception, especially when they preface their soundbites with “speaking as a scientist”..","date":"2014-09-21","mins":"3:15 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-47589","author":"colin_berry","post":"I too want to live to be 92 daveb. That way I stand a (slim) chance of seeing in the day when the Vatican finally decides to arrange a re run of the carbon dating. And who knows, Rogers’ Maillard reaction/impurity coating theory may even get to have a decent burial before my own….","date":"2013-10-15","mins":"5:24 pm","url":"https://shroudstory.com/2013/10/14/update-on-the-ieee-workshop-september-in-italy/","cat":"event","title":"Update on the IEEE Workshop: September in Italy"},{"id":"comment-47546","author":"colin_berry","post":"Who needs these ding dongs anyway, which are generally no more than a collective chewing of the cud? Why not have an electronic Shroud congress instead, to which submissions would be invited and thrown open to discussion? I nominate Dan Porter and his site to serve as mein host for the planet’s first Electronic Shroud Congress (on condition that submissions are listed by surname in alphabetical order ; )..","date":"2013-10-15","mins":"7:45 am","url":"https://shroudstory.com/2013/10/14/update-on-the-ieee-workshop-september-in-italy/","cat":"event","title":"Update on the IEEE Workshop: September in Italy"},{"id":"comment-47550","author":"colin_berry","post":"43 years, John K.? Snap. In my case, it comes with a touch of advancing senility, despite constant ministrations from spousal unit, like my writing “ding dong” above when I meant to say shindig. Yes, there’s scope for Skype too or similar. Can a real time video conferencing session be embedded in a blog site? It would serve as a long overdue opportunity to get the mass media focused on the mainstream of Shroud studies, instead of it being prey, as at present, to every passing opportunist or attention seeker playing on ignorance or gullibility..","date":"2013-10-15","mins":"8:07 am","url":"https://shroudstory.com/2013/10/14/update-on-the-ieee-workshop-september-in-italy/","cat":"event","title":"Update on the IEEE Workshop: September in Italy"}]
