[{"id":"comment-50282","author":"colin_berry","post":"I shall continue to keep an open mind on the length of those fingers, while seeking the first opportunity to close it when some more clinching evidence comes along. In the meantime, I’d just like to point out another feature of the fingers – their skeletal like boniness – that has been the subject of much speculation, some of it at the wackier end of the scale (let’s not go there right now). Personally I think the boniness is prima facie evidence for imprinting by a contact process than one by radiation. With a contact process, it is just those parts of each finger that are approximately in the plane of the linen (i.e parallel) that make best contact, especially if there is applied pressure, and that is the top surface. One has only to go a few mm below that topmost plane, and the curvature of the finger means progressively less contact and pressure. There is also the likelihood of a tenting effect across the fingers that means poor imaging between the fingers. Now look at the Shroud image and you will see precisely the kind of shadowing one would expect. Radiation theories, collimated radiation? Why should they produce any shadowing effect between the fingers, given the proposed orthogonal projection of radiation, and given that the cloth body distance differences are relatively small in the case of fingers, certainly much smaller than the mysterious 4 or 5 cm cut off that is said to operate in the radiation model? A day or two ago I was drawing attention to the deep shadow in the eye sockets, which in the contact model is similarly accounted for in terms of curvature and obliqueness, with a resulting fall off in contact pressure and imprinting tendency. Obviously there are other issues to be addressed, like tenting with a stretched fabric, or less tenting if there is manual moulding of fabric to the contours of the subject – but at least those possibilities exist and can be advanced by way of excuse/explanation if necessary (albeit at the risk of inviting Occam’s police involvement)..","date":"2013-11-07","mins":"6:39 am","url":"https://shroudstory.com/2013/11/07/a-guest-posting-by-o-k-on-the-allegedly-too-long-fingers/","cat":"guest_posting","title":"A Guest Posting by O.K. on the Allegedly Too-Long Fingers"},{"id":"comment-50291","author":"colin_berry","post":"Wedded to scorch theory? Didn’t STURP describe the image as essentially that of a scorch (if not using that precise term)? It would be truer to say that I was attracted to Shroudology not by the contact scorch model, but by profound scepticism as regards Di Lazzaro’s radiation scenario with those uv laser beams. But I still started experimenting with radiation first, using a photosensitizing pigment (charcoal) to trap radiant heat from an incandescent lamp, and producing scorch marks under the charcoal but not elsewhere. It’s only in the last few weeks I’ve realized that the technology is essentially no different in principle from that used by Luigi Garlaschelli (substitute ochre as sensitizer, and warm air/infrared radiation in an oven for my spot lamp, but the end result is the same – selective scorching under the sensitizer. Methinks contact models have a lot going for them, but one now needs to compare direct contact between hot template and cloth, or indirect via Luigi’s rubbing/frottage procedure followed by secondary thermal cooking. (Incidentally, he had to use a touching up brush to get the fingers looking right). Luigi’s gives a fuzzier and arguably more authentic look than my relatively sharp imprints, but I would maintain the templates are still relevant and certainly handy for quick modelling of macro level contact scorch characteristics. As regards your other question, I expect you have heard of “degloving”. It’s a horrible injury that folk get when their ring gets trapped in a conveyer belt, or the dog’s lead gets wrapped around a finger, and can strip off the entire flesh with nerves and blood vessels right down to the bone. I personally can’t see why that should happen as a result of crucifixion, but then what do I know? I’m just a scorch bore through despair with agenda driven so called scientists attempting to make up new laws of radiation physics as they go along..","date":"2013-11-07","mins":"8:05 am","url":"https://shroudstory.com/2013/11/07/a-guest-posting-by-o-k-on-the-allegedly-too-long-fingers/","cat":"guest_posting","title":"A Guest Posting by O.K. on the Allegedly Too-Long Fingers"},{"id":"comment-184252","author":"colin_berry","post":"One’s heard of making a rod to beat one’s own back. Here’s an even more, er, flagrant example. PS: Hugh beat you to it with the true nature of the object shown, Andrea, but it’s good to have independent confirmation..","date":"2015-01-18","mins":"6:19 am","url":"https://shroudstory.com/2015/01/18/a-number-of-marks-falling-all-over-the-surface-of-the-body/","cat":"history","title":"A number of marks falling all over the surface of the body"},{"id":"comment-184271","author":"colin_berry","post":"Stand by for another clash of Titans over priority, Here’s a link that should help to establish criteria and ground rules: http://en.wikipedia.org/wiki/Leibniz%E2%80%93 Newton calculus controversy.","date":"2015-01-18","mins":"8:14 am","url":"https://shroudstory.com/2015/01/18/a-number-of-marks-falling-all-over-the-surface-of-the-body/","cat":"history","title":"A number of marks falling all over the surface of the body"},{"id":"comment-159","author":"colin_berry","post":"I see. Because I omit to mention all your daft ideas, mordanting included, having contented myself with “auto collimation etc” (and it was I who introduced collimation on this thread, not you) that means this Biochemistry Ph D is ignorant of mordanting. Is that the extent of your intellect this morning – to imagine that failure to parrot each of your terms, the way you parrot mine, implies ignorance on my part? I also mentiond the requirement for a vacuum tube as well as a collimator if you wish to think in terms of molecular beams. But you have made no mention of that. By your logic that means you have no idea what a vacuum is, or why it would be needed in your idiotic model, along with much else besides. In fac t what your model needs is nothing more sophisticated than a waste paper bin. For your information, I first encountered mordanting as a young teenager with a home chemical laboratory, a friendly local pharmacist who supplied me with virtually any chemical I asked for. I probably encountered mordanting as I worked my way through every fat textbook of descriptive chemistry in the local library – the kind they don’t write anymore – probably under the chapter headed “aluminium”, more specifically alum and aluminium oxy or hydroxyanions, Now kindly stop plastering my site with your Walter Mitty fantasizing. You clearly don’t have the first clue about the scientific method: you are simply making it up as you go along, pretending to knowledge you do not possess, except at the most superficial wiki page level. You are also highly insulting towards someone who, unlike you, has solid research credentials, ones that are easily checked (I can supply you with some keywords if your wish). Better still, find somewhere else to post. You have outstayed your welcome… I shall try to ignore anything else you post here, and may at some stage have to set up a block with Word Press if you persist..","date":"2012-04-20","mins":"11:32 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/15/did-you-know-there-is-a-high-definition-image-of-the-turin-shroud-most-of-it-still-under-wraps/","cat":"beard","title":"Did you know there is a high-definition image of the Turin Shroud (most of it still under wraps)?"},{"id":"comment-153","author":"colin_berry","post":"I see you have set out your imaginary scenario for how the image was formed on Dan Porter’s site. Http://shroudofturin.wordpress.com/2012/04/16/the image on david rolfes website absence of eyebrows/#comment 10596 As I suspected from your use of fanciful terms like “auto collimation” etc is absolute tripe from start to finish. Everything there exists purely in your own head. There is nothing that is rooted in reality. Now look at my comments. They invariably start with an experimental finding, either my own or someone else’s. They relate to the real world as we perceive with our senses. Folk are then free to accept or reject my interpretation – but irrespective are always left with something concrete in terms of physical science – one or more experimental findings. It’s the difference between a fairy story (yours) and film review (mine). One is about fairies, which are entirely imaginary. The other is about a film – which one can still go and check out for oneself, whether one likes what the reviewer says or not, with a view to deciding for oneself, having to take nothing on trust..","date":"2012-04-20","mins":"9:27 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/15/did-you-know-there-is-a-high-definition-image-of-the-turin-shroud-most-of-it-still-under-wraps/","cat":"beard","title":"Did you know there is a high-definition image of the Turin Shroud (most of it still under wraps)?"},{"id":"comment-146","author":"colin_berry","post":"You have come onto my site – the site of a retired scientist – one that has been relating week by week an interplay of experiment and ideas – the scientific method – and wasted no time in attacking my scientific credentials. You have then used my site to promote your own outlandish and unscientific ideas (“autocollimation”, “vaporographs”), clearly with no intention whatsoever of performing a single scientific experiment, all the while promoting yourself as an expert in this or that, none of which has any bearing on the scientific method. You are, my friend, what is known as a ‘crackpot’. I am not a crackpot. I am a published scientist with a solid reputation in all the areas I have worked, in all the problems I have addressed. Now may I politely suggest that you sling your hook… Colin Berry M Sc, Ph D.","date":"2012-04-18","mins":"8:33 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/15/did-you-know-there-is-a-high-definition-image-of-the-turin-shroud-most-of-it-still-under-wraps/","cat":"beard","title":"Did you know there is a high-definition image of the Turin Shroud (most of it still under wraps)?"},{"id":"comment-143","author":"colin_berry","post":"Geekish addition: I reported earlier a strange observation, namely the loss of the herringbone pattern on converting 2 D images of Rolfe panel 1 to 3 D in Imaje J software – and cautioned against generating artefacts of 3 D imaging. I have since discovered that the herringbone can be restored simply by increasing the “Grid Size” setting, right up to 100(max) if necessary. Having read the accompanying notes, it seems I should not have included Grid Size in my standard ‘optimized’ settings, since it has to be adjusted to suit the size in terms of pixels for each new inputted image – indeed one should match the other. These things are sent to try us. That’s one less post to write (not a bad thing since I’m somewhat weary of writing posts at the moment, given the kind of reception they get in the Shroudie world – which seems to be 95% true believer where authenticity is concerned and keen to trash anything that doesn’t fit with their preconceptions. I am reading Sam Christer’s “The Turin Shroud Secret” (Sphere 2012) at the moment. It is very well written – the dialogue between the LA detectives being sharp and witty..","date":"2012-04-18","mins":"7:26 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/15/did-you-know-there-is-a-high-definition-image-of-the-turin-shroud-most-of-it-still-under-wraps/","cat":"beard","title":"Did you know there is a high-definition image of the Turin Shroud (most of it still under wraps)?"},{"id":"comment-144","author":"colin_berry","post":"Correction: … Rolfe Panel A to 3 D in Image J software.","date":"2012-04-18","mins":"7:28 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/15/did-you-know-there-is-a-high-definition-image-of-the-turin-shroud-most-of-it-still-under-wraps/","cat":"beard","title":"Did you know there is a high-definition image of the Turin Shroud (most of it still under wraps)?"},{"id":"comment-141","author":"colin_berry","post":"OK, you’ve made your point (in triplicate). We cannot hope to resolve all the uncertainties this afternoon – no doubt all will become clear in the fullness of time, once we know more about the provenance of Rolfe’s banner – the one I have called Rolfe Panel A from the outset. Now why don’t you go and find a nice pavement cafe somewhere and relax and unwind? I’m told that Nantes is one of France’s most delightful cities. We are touring the Cevennes in a few week’s time, but I hope to look in on Nantes before I run out of available lifespan….","date":"2012-04-18","mins":"1:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/15/did-you-know-there-is-a-high-definition-image-of-the-turin-shroud-most-of-it-still-under-wraps/","cat":"beard","title":"Did you know there is a high-definition image of the Turin Shroud (most of it still under wraps)?"},{"id":"comment-128","author":"colin_berry","post":"For anyone still following this thread, apart from (clearly) non scientifically qualified advocate of ‘auto collimated vaporographic mordanting’, I have just added the following as a postscript to this posting: “Important: have just realized, two days after posting this, that the image also has “hair” – it’s the darker band on the left that occupies about 1/5th the width of the image. Note that it too shows nothing in this HD close up that would distinguish it as strands of hair. The darker image is essentially no different from what one sees, say, on the bridge of the nose. As before, the caveat is needed that one needs to see the HD image of the entire face and head. But some tentative conclusions are possible: while one can argue, as I have done above, that the “eyebrows” are not really there – that it is the brow ridge that could have been imaged by a kind of pressure imprinting (“barography”?) the same can hardly be said of the “head of hair”, given that the outer margin of the hair (at leas)t does not have underlying bone if viewed as a frontal image. So what would cause head hair, if indeed real hair, to be imaged if neither photography nor “barography” can be invoked? Certainly not vapourography either (see comments) given that hair does not putrefy to form those organic amines (putrescine, cadaverine) that Ray Rogers thought were instrumental in image formation via Maillard reactions. The plot thickens, as they say…” I have two more postings planned. One will be to document a curious effect I discovered last night, and briefly reported to Dan Porter’s site, namely the loss of the herringbone weave pattern in 3 D imaging (Image J software) and its replacement by a uniform mesh pattern (the implication of which need to be considered by the high priests of Shroud image analysis). The second will be a brief one on what can, or rather cannot be seen, in that shank of head hair(?) which intrudes on ‘Rolfe Panel A’….","date":"2012-04-18","mins":"8:32 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/15/did-you-know-there-is-a-high-definition-image-of-the-turin-shroud-most-of-it-still-under-wraps/","cat":"beard","title":"Did you know there is a high-definition image of the Turin Shroud (most of it still under wraps)?"},{"id":"comment-134","author":"colin_berry","post":"To anybody reading this who has a grain of common sense: suppose your were given a choice between two Shroud images for close study of the image characteristics. Which would you choose? One with the herringbone weave clearly visible, or one without? I know which one I would choose, because I know objectively that the real object in the Turin cathedral has a herringbone weave. Any image that fails to show that weave pattern must clearly be a defective one. I personally had never encountered a Shroud image that showed the herringbone weave so clearly until last week – viewing the banner on David Rolfe’s relatively new Enigma blog. I don’t know if it is or is not a video still. It may well be. If it is, then it was taken with a good tripod support that eliminated camera shake – because there is no hint of blurring. The only limitation is the inevitable pixellation that occurs on magnification, but one can enlarge sufficiently to see that the image is confined almost exclusively to those diagonal ribs, and that the superficial image on those ribs is largely of the same character wherever one looks – the bridge of the nose, the eye ridges, and even the vertical shank of “hair” on the left side, showing no discernible strands of hair. For a unique HD image to appear as a blog banner, unlabelled, unheralded, is a curious way for a valuable research resource to enter the public domain with no fanfare whatsoever. Hopefully David Rolfe will provide some background in due course, and better still release the entire HD image. Until then, let’s not look this gift horse in the mouth….","date":"2012-04-18","mins":"12:03 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/15/did-you-know-there-is-a-high-definition-image-of-the-turin-shroud-most-of-it-still-under-wraps/","cat":"beard","title":"Did you know there is a high-definition image of the Turin Shroud (most of it still under wraps)?"},{"id":"comment-124","author":"colin_berry","post":"Continue to post here if you wish – seeing as how you use other people’s sites to promulgate your own eccentric views. Just don’t expect me to respond..","date":"2012-04-17","mins":"1:12 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/15/did-you-know-there-is-a-high-definition-image-of-the-turin-shroud-most-of-it-still-under-wraps/","cat":"beard","title":"Did you know there is a high-definition image of the Turin Shroud (most of it still under wraps)?"},{"id":"comment-130","author":"colin_berry","post":"Did Occam provide a machete too?.","date":"2012-04-18","mins":"11:13 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/15/did-you-know-there-is-a-high-definition-image-of-the-turin-shroud-most-of-it-still-under-wraps/","cat":"beard","title":"Did you know there is a high-definition image of the Turin Shroud (most of it still under wraps)?"},{"id":"comment-122","author":"colin_berry","post":"Any kind of ‘vaporographic’ theory, autoregulated or otherwise, would require a molecular beam, which in turn would require a collimator and a vacuum tube. I doubt that kind of hardware was available in 1st century tombs; Oh, and the idea that a blow fly protected cadaver a few days old is going to be producing a stench, and enough putrescine, cadaverine etc to react with linen components to form an image is also pretty fanciful. Anyone who has hung game, even in warm surroundings, or even stored meat in a room temperature “safe” behind perforated zinc prior to fridges becoming common, will know that the sort of advanced decomposition implied by Rogers’ chemical musings, does not take place as quickly as implied. It can get a bit high, certainly, but stench and olfactory assault by organic amines? I think not. Frankly I find it incredible that Shroudology is still cluttered with such superfluous baggage. I trust you are not proposing to add to it with your theory. Are you scientifically qualified, btw?.","date":"2012-04-17","mins":"11:38 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/15/did-you-know-there-is-a-high-definition-image-of-the-turin-shroud-most-of-it-still-under-wraps/","cat":"beard","title":"Did you know there is a high-definition image of the Turin Shroud (most of it still under wraps)?"},{"id":"comment-115","author":"colin_berry","post":"“This is not a “scorchgraphy” but a vaporographic mordanting (of a thin impurity layer).” I have taught chemistry and biochemistry to medical school students, and chemistry to A level pupils still at school. No disrespect to Ray Rogers, who was clearly an ill man (died 2005) but I like to think that any one of them could have shot down that vapour theory in seconds (based on the science of gaseous diffusion etc). That theory depended on not just one but two qualifying assumptions, both highly speculative. To support an hypothesis that the image was the product of Maillard (sugar amine) reactions he first proposed the presence of impregnating saponins in the cloth to provide chemically reactive pentosans, and then the presence of advanced decomposition gaseous organic amines (cadaverine etc). That’s two small probabilities multiplied together to get an overall probability that is close to zero… and that’s without taking gaseous diffusion into account that would have prevented recognizable images being formed… Sorry, but dreaming up possible scenarios without rigorously testing them is not science. It’s daydreaming. Fortunately, there is a way of testing Rogers’ highly improbable ideas. If he had been correct, then the image areas should contain higher levels of nitrogen from those decomposition amines, bearing in mind that linen fibres contain little nitrogen (being mainly non nitrogeneous carbohydrates). I confidently predict that there is no enhanced level of nitrogen in any of the the image bearing areas, including those that are said to be “blood”. Why did Rogers not perform that simple test? Rogers, towards the end of his life, was sadly “losing it”. That’s not to demean the accomplishments of his earlier career..","date":"2012-04-16","mins":"3:31 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/15/did-you-know-there-is-a-high-definition-image-of-the-turin-shroud-most-of-it-still-under-wraps/","cat":"beard","title":"Did you know there is a high-definition image of the Turin Shroud (most of it still under wraps)?"},{"id":"comment-118","author":"colin_berry","post":"You can hardly expect me to know everyone else’s theory, your own included, if you are content to publish your ideas as comments on other people’s sites. Life is too short to go trawling elsewhere on the offchance of learning something new. If your theory differs importantly from Rogers’, and is soundly based, then OK, let’s hear it. But beware. I have little patience for “explanations” that are scientifically illiterate…or even semi literate. The world of Shroudology is awash with enough of those as it is. Any theory that involves vapours looks doomed from the start – unless you have a way of making gaseous molecules travel in straight lines….","date":"2012-04-16","mins":"5:44 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/15/did-you-know-there-is-a-high-definition-image-of-the-turin-shroud-most-of-it-still-under-wraps/","cat":"beard","title":"Did you know there is a high-definition image of the Turin Shroud (most of it still under wraps)?"},{"id":"comment-111","author":"colin_berry","post":"Ihave been in email contact with David Rolfe. He confirmed my hunch that his banner was the real Mc Coy. Neither you nor I can know at this stage whether Rolfe Panel A is representative of the whole of not – although Rolfe did say that the entire image was “homogeneous” in character. I take the latter to mean that the image is confined almost exclusively to those diagonal ribs of the herringbone weave (strongly suggestive of a contact scorch, as I have suggested many times now)..","date":"2012-04-16","mins":"2:20 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/15/did-you-know-there-is-a-high-definition-image-of-the-turin-shroud-most-of-it-still-under-wraps/","cat":"beard","title":"Did you know there is a high-definition image of the Turin Shroud (most of it still under wraps)?"},{"id":"comment-105","author":"colin_berry","post":"I doubt very much that there is an image anything like as good as the one we are discussing now, which I mischievously refer to as ‘Rolfe Panel A’. Where else can you see the relationship between image and weave in such high definition? If you think Enrie’s images have that same clarity – as if examining under a hand lens – then please let me know. Better still, provide a link. Your comments re interposing of objects between face and linen are noted – but are pure speculation on your part, needless to say, and pretty fanciful at that too. Your initial assumption is that the image is from Palestine, 1st century AD. Mine is not. Until the C dating is repeated, I am happy to accept the findings of the three labs, and view the Shroud as a very clever medieval artefact. It may not have been made in Europe, needless to say. That French knight may have acquired it in the Middle East while away on his Crusades. He may have been offered the Shroud as the next best thing to the Holy Grail..","date":"2012-04-16","mins":"12:05 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/15/did-you-know-there-is-a-high-definition-image-of-the-turin-shroud-most-of-it-still-under-wraps/","cat":"beard","title":"Did you know there is a high-definition image of the Turin Shroud (most of it still under wraps)?"},{"id":"comment-109","author":"colin_berry","post":"By way of reply to this point, i have added another photograph to the posting 9second one, immediately after ‘Rolfe Panel A positive’. I’m no expert, but it looks like a pretty professional set up to me, what with the glide rails, and the angled cameras – probably sources of illumination too. But why nitpick on the technical minutiae? It should be clear that there is nothing imaged that anyone would have recognized as “eyebrows”, had the surrounding area been blanked out, andthe observer told merely that it was part of a face. I strongly suspect that the same would be true for “moustache” and for “beard” in close up too, which is why the absence of the complete image is so frustrating, especially as Rolfe was saying 4 years ago about interesting features – which is a bit of a tease given he gave no specifics. It is ludicrous that a documentary maker can see and report on the HD image, whetting appetites so to speak, and for scientists like myself to have to jump through hoops to get access….","date":"2012-04-16","mins":"2:15 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/15/did-you-know-there-is-a-high-definition-image-of-the-turin-shroud-most-of-it-still-under-wraps/","cat":"beard","title":"Did you know there is a high-definition image of the Turin Shroud (most of it still under wraps)?"},{"id":"comment-49008","author":"colin_berry","post":"I didn’t know you were into dinosaur bones….","date":"2013-10-28","mins":"1:28 pm","url":"https://shroudstory.com/2013/10/22/stephen-jones-on-the-stuttgart-psalter/","cat":"flagrum","title":"Stephen Jones on the Stuttgart Psalter"},{"id":"comment-49011","author":"colin_berry","post":"Not so much “smoking gun” – more a fairground pop gun with the cork stuck in the end of the barrel, refusing to move when one pulls on the trigger..","date":"2013-10-28","mins":"1:43 pm","url":"https://shroudstory.com/2013/10/22/stephen-jones-on-the-stuttgart-psalter/","cat":"flagrum","title":"Stephen Jones on the Stuttgart Psalter"},{"id":"comment-49252","author":"colin_berry","post":"Thank goodness for the scientific method (hypothesis, prediction, experimentation, evaluation, new hypothesis, more experimentation etc etc). It beats obsessive dogmatism any day, even if it doesn’t lead direct to the correct answer… Better to travel hopefully than to arrive...","date":"2013-10-30","mins":"4:27 pm","url":"https://shroudstory.com/2013/10/22/stephen-jones-on-the-stuttgart-psalter/","cat":"flagrum","title":"Stephen Jones on the Stuttgart Psalter"},{"id":"comment-329","author":"colin_berry","post":"I use sciencebod01 as the first part of my email address, followed by the “at” symbol, followed by aol.com, broken up here to make life a little difficult for the spammers. I look forward to receiving those photos (but wonder why they are not already in the public domain if they are supposed to be a key exhibit in any debate as the authenticity or otherwise of the Shroud)..","date":"2012-06-27","mins":"10:09 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/23/reply-in-small-considered-instalments-to-thibault-heimburger-re-my-sorry-mr-rogers-posting-2/","cat":"blood","title":"Reply  – in small considered instalments – to Thibault Heimburger re my “Sorry Mr.Rogers” posting"},{"id":"comment-327","author":"colin_berry","post":"” A few days ago I gave you privately the possibility to obtain for free etc etc…” Sorry, but I have not the faintest clue what you are talking about Thibault. Privately? By what means? An email? I have received no email. Nor have I seen a comment on this site or on Dan’s (which would hardly be private anyway). Why privately anyway? Are these images not already in the public domain? Are you not able to provide a link? I hope those pictures are better than the ones I displayed above from the source you mentioned… Oh, and while I don’t take kindly to people who adopt the overbearing tone you did in that comment above, I most certainly did not respond with an ad hominem attack. If you think I did, then please accept that was not my intention. I am very happy to discuss the science – but you are wasting your time telling this retired scientist that such and such was “dismissed ” years ago. Nothing is more guaranteed to get me intensely interested in the grounds on which something or other was dismissed, especially as the objectivity of so many ‘authenticists’ – including I hasten to add some STURP scientists – has repeatedly been called into question by their resort to novel and often bizarre “crucifixion” or “resurrection” physics, chemistry or physiology. But until I see those images, and have had a chance to study them, I see no point in commenting further..","date":"2012-06-27","mins":"9:36 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/23/reply-in-small-considered-instalments-to-thibault-heimburger-re-my-sorry-mr-rogers-posting-2/","cat":"blood","title":"Reply  – in small considered instalments – to Thibault Heimburger re my “Sorry Mr.Rogers” posting"},{"id":"comment-9851","author":"colin_berry","post":"Abstracts of the papers presented at Pasco are now available: http://shroudresearch.net/conference 2017/ What is one supposed to make of this one? xxxxxxxxxxxxxxxxxx 2:05 pm to 2:35 pm“Linen Coloration by Pulsed Radiation, A Review” by Paolo Di Lazzaro and Daniele Murra. Several years ago, it was demonstrated that very short and intense bursts of Vacuum Ultraviolet radiation could generate a truly Shroud like coloration at the microscopy level. It is time to rewind the tape and put those experimental results in their proper context: the motivations of the work, the search for the optimum (but hard to achieve) working point, the photochemistry clues, the repeatability of the results, the scaling up from coloration to image production, what our results have really shown from a strictly scientific point of view, what are the implications in other areas such as philosophy and metaphysics, what journalists (and some scientists too) have misunderstood. The talk will present a fascinating survey of 10 years of experimental attempts, efforts, intuitions, insights, accomplishments, disappointments, controversies. Xxxxxxxxxxxxxxxxxx If you ever wondered why they are called “abstracts”, here you have a possible explanation!.","date":"2017-08-06","mins":"10:29 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/19/shroud-scope-8-372-impossible-scourge-marks-surely-on-the-shroud-of-turin/","cat":"blood","title":"Shroud Scope 8: 372 impossible scourge marks (surely?) on the Shroud of Turin"},{"id":"comment-9837","author":"colin_berry","post":"STURP’s Ray Rogers (RIP) claimed the Shroud body image possessed an incredibly thin skin. An even thinner skin has just revealed itself. All it took to reveal it was a little gentle teasing… 😉.","date":"2017-08-02","mins":"5:24 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/19/shroud-scope-8-372-impossible-scourge-marks-surely-on-the-shroud-of-turin/","cat":"blood","title":"Shroud Scope 8: 372 impossible scourge marks (surely?) on the Shroud of Turin"},{"id":"comment-9805","author":"colin_berry","post":"Hello Hugh (a glitch in Word Press has you appearing here as “Anonymous”) Quick reply (more later): Enter (youtube shroud of turin conference 2017) into your search engine and you should get up on screen a list of those Pasco presentations that were recorded on video. Https://www.google.co.uk/search?tbs=qdr%3 Am&tbm=vid&q=youtube+shroud+of+turin+conference+2017&oq=youtube+shroud+of+turin+conference+2017&gs l=psy ab.3…33448.41330.0.46246.25.25.0.0.0.0.239.3283.0j24j1.25.0….0…1.1.64.psy ab..0.23.3023…0j33i160k1j33i21k1.qe TW Wj6 Z Deo See my latest posting re radiant infrared energy for links to individual presentations, only some of which I’ve viewed so far, having other matters to attend to..","date":"2017-07-26","mins":"3:11 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/19/shroud-scope-8-372-impossible-scourge-marks-surely-on-the-shroud-of-turin/","cat":"blood","title":"Shroud Scope 8: 372 impossible scourge marks (surely?) on the Shroud of Turin"},{"id":"comment-9799","author":"colin_berry","post":"Yes, all that was brought up at the seminar and even your website was mentioned which is why I’m here to find out your thoughts on all this. I find your responses interesting and informative and take them under advisement when searching out what’s really true or not. Well, I’m heartened to learn that sindonology is not ignoring this lone wolf researcher completely! (Oh, and the only reason I operate as a lone wolf is because there’s no comparable ‘sceptics’ club’ or even website that responds as I do the the claim that the Shroud image is non reproducible by modern technology). But again, we have this piece of linen with the faint negative image that has 3 D information in it (no other man made painting or medium can do that) and that the closer you get to it the more it disappears rather than getting more detail to view. There’s just too much there to just toss it off as some sort of Middle Age fake. You’ve chosen a posting of mine from some 5 years ago for your visit here James without saying why. It makes a point which could, if checked out , deliver a knock out blow for authenticity – namely that the 372 scourge marks on the shroud which we’re told are faint imprints of blood – not part of the body image – are accompanied by unexplained uncommented upon physical scratching of the linen threads too. That suggests the scourge marks were not delivered to a body, whether 1st or 14th century, and then imprinted, but delivered straight to the linen! The latter if true provides virtual proof of forgery/simulation, call it what you want, while at the same time neatly explaining why the scourge marks are (curiously) NOT part of the body image. However, the main reason for posting this reply is to ask whether you are familiar with my current Model 10 (flour imprinting/thermal development) and the manner in which it developed from Model 2 (one step scorching from hot metal template)? Forgive me saying but I get the impression you are not. Were that to be the case, then you need to know that I have addressed issues like negative image and 3 D rendering almost from the word go, and was able to reproduce and account for them even with Model 2. Negative image and 3 D are really no big deal. If you wish I’ll supply photographs from old experiments that make the point better than a few words here can. Model 10 arose after searching for a means of sensitizing otherwise resistant linen to heat. Various agents were tested, but the one that performed best was white flour, initially rubbed into the surface of linen before ‘branding’ with a hot metal template to get a negative 3 D enhancible image (which could be as faint as one liked if one used repeated pressing while the template cooled). It was a red letter day for this investigator when he realized first that a COLD UNHEATED oil smeared metal template could be dusted with flour, and used to make a flour imprint on linen, then heating the linen instead of the metal to get the two stage image.There was another red letter day when realizing that the process could work just as well by dusting skin as well as cold metal, resulting quickly in imprints of my hand that were also negative and 3 D enhancible! Microscopy followed in short order, starting 2 years ago, albeit instantly mocked by one of sindonology’s high profile promoters of authenticity, and I am now no longer as bemused as you are with fibres that are essentially either coloured or non coloured with few in betweens (the half tone effect) or with discontinuities, striation etc ertc. In other words Model 10 reproduces most, indeed probably all the allegedly ‘bizarre’, enigmatic characteristics of the Shroud body image. Model 10 invokes a thermally generated chromophore that is briefly LIQUID and thus able to migrate within threads, indeed within fibres too, accounting for many perhaps all of those otherwise weird microscopic properties. It remains to be seen how long my message will take to percolate through the hard impenetrable rock surface that is sindonology. Things do not augur well if the last two years are anything to go by, without a single reference to flour imprinting appearing on any other site bar Dan Porter’s retired one – not even on the otherwise impressive Hugh Farey’s supposedly ‘sceptical’ BSTS Newsletter. It surely begs the question as to why. No artist has come forth claiming that he/she did it all during the MA era – you would think that one would. There’s no signature on the linen as to who the artist is whereas all painting from that time forward always has the artist’s name or logo or something. “Painting” is a needless diversion from the essentials, unless used as an inferior and easily debunked means of faking the Shroud. Artists’ inorganic pigments would have been easily recognized as such when newly applied. (Even that mid 1350s Troyes bishop described the newly “discovered” Shroud as “cunningly” painted). But the clincher that shows the image is not artists’ paint pigments, not even age degraded ones, is Adler and Heller’s finding that the body image could be bleached quickly using diimide, which is virtually 100% proof that the chromophore is organic, i.e. Carbon based, relying on conjugated double bonds for colour ( C C=C C=C etc, maybe with nitrogen in the sequence too, e.g. C C=N C=C ) I don’t have access to diimide, but simple domestic bleach quickly decolorises all my images, whether direct scorches (Model 2) or developed flour imprints (Model 10). I’ll take a bet with anyone that diimide will work too! Diimide (N2 H2) is highly specific in the way it acts, hydrogenating those conjugated double bonds, destroying the specific light capturing wavelength specific properties of the chromophore. There are no grounds whatsoever for thinking diimde could bleach solid inorganic pigments like red ochre etc, the sort invoked by Walter Mc Crone. He may well have seen microparticuate matter (which can be accounted for in Model 10 as flecks of wheat gluten or other constituents of the flour imprinting medium) but he failed in my opinion to make a convincing case for his “just a painting” interpretation, and neither has Charles Freeman for that matter. As I say, the “just a painting” school of so called thought is a needless distraction. The Shroud image is an IMPRINT, not a painting, which explains among other things the negative image and 3 D enhancibility. PS The reason the Shroud body image is an imprint is because it was INTENDED TO BE SEEN AS SUCH, instantly – with added visual cues from the DOUBLE body image showing BOTH sides of a naked recumbent man, flagging up a discarded shroud, not a work of art for hanging on a wall or similar. All the effort that went into conceiving that unique and iconic way of representing the imagined appearance of Joseph of Arimathea’s linen after removal of the body for burial would have been for naught if ordinary paint pigments had been used for the body image. No, it had to be something far more subtle, something that could be interpreted as an ancient yellowed sweat IMPRINT, with blood in all the right places to allow the pilgrim to identify the man immediately by the manner of his death. Forget paint entirely. It’s a hiding to nothing….","date":"2017-07-26","mins":"7:02 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/19/shroud-scope-8-372-impossible-scourge-marks-surely-on-the-shroud-of-turin/","cat":"blood","title":"Shroud Scope 8: 372 impossible scourge marks (surely?) on the Shroud of Turin"},{"id":"comment-9807","author":"colin_berry","post":"Forgive my saying, but that’s’ a link to the (as yet) pre conference Pasco prospectus James. I don’t see any updates displaying any of the actual proceedings between Wed July 19 (Day 1) and Sat July 22. (final Day 4), including your flagged up “seminar”. Maybe I’ve missed the addition by Bob Rucker of a new tab?.","date":"2017-07-26","mins":"3:53 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/19/shroud-scope-8-372-impossible-scourge-marks-surely-on-the-shroud-of-turin/","cat":"blood","title":"Shroud Scope 8: 372 impossible scourge marks (surely?) on the Shroud of Turin"},{"id":"comment-9797","author":"colin_berry","post":"“The Arizona data was thrown out because their data was too far outside what they considered the norm to be and just use the other two labs’ data.” I think you must have got the wrong end of the stick James No way was the Arizona data discarded. See the Nature paper. Https://www.shroud.com/nature.htm As regards the rest of your comment, it’s basically a recitation of what’s recycled year in and year out. Nothing one contributes by way of correctives ever gets taken on board, or even acknowledged. Sindonology proceeds as if on tracks, allowing nothing to stand in its path. Sindonology makes a mockery of the scientific method, and is indeed (thanks to uncritical media coverage) highly damaging to science, causing the public to believe that it can be used to prove anything … When I first suggested hot metal scorching as a possible imprinting mechanism, I was immediately jumped upon by STERA’s President no less and told to read the literature since i was clearly ignorant of the fact that “all scorches fluoresce under uv”. But they don’t as I showed later. What was being touted as an inviolable principle was based on nothing more that an observation that the scorched edges of the full thickness 1532 burn holes showed a weak pink or red fluorescence, with no testing of experimental scorches to back up the “all scorches fluoresce under uv ” mantra. Has STERA and its President’s website ever acknowledged its mistake, or issued a corrective, never mind an apology. Nope. Absolute silence. This site with 400 or more postings reporting a 5 year evolution of ideas through 10 scientifically tested models and much new data that you won’t find elsewhere has never once received a singe mention on Barry M.Schwortz’s shroud.com. Despite it claiming to provide updates on research and the internet. Why not? Because sindonology has no time for real science. All it does is recycle the same old pseudoscience, year in, year out. Sindonology is an insult to genuine science (though I hesitate to mention it, I am btw a published Ph D scientist)..","date":"2017-07-25","mins":"11:59 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/19/shroud-scope-8-372-impossible-scourge-marks-surely-on-the-shroud-of-turin/","cat":"blood","title":"Shroud Scope 8: 372 impossible scourge marks (surely?) on the Shroud of Turin"},{"id":"comment-9788","author":"colin_berry","post":"One has to wonder how anyone, miraculists included, could arrive at a model that required an enormous stockpile of nuclear bombs exploding briefly, able ‘miraculously’ some might think to scorch linen without burning off every strand of hair and beard, leaving an image of a bald clean shaven man! You give a clue. That bizarre scenario is generated by mathematics. How did that arise? Well, until seeing the entire argument (I confess to being in no hurry t0 do so) I think what we see is a textbook example of someone who fails to appreciate the difference between heat and temperature, who being unable to conjure up a source of heat able to produce a classic scorch – the kind you or I could produce with a hot iron, oven etc – has to resort to to a scenario where the absence of appreciable mass is compensated by dreaming up astronomical temperatures operating ever so briefly! Why is it so important to consider heat as well as temperature (heat being determined not only by temperature – an intensive property – but by extensive properties too, notably mass of the particles, their specific heat capacities etc)? There’s a simple experiment anyone can do that brings home the problem facing anyone looking to any kind of direct scorch mechanism that thermally discolours (“scorches”) the surface of untreated linen, no matter how superficially. Get some metal that can be heated strongly, then gripped in pliars or similar. One can use an aluminium pencil sharpener as I used to 5 years ago. Place it on a ceramic hob and leave it there till it reaches maximal temperature, then pick it up with the pliars and stamp onto linen. You’ll get an immediate dense scorch, maybe smoke and smell too. Now for the interesting bit. Lift and apply the metal to another patch of linen. Note the substantial drop in image intensity. Keep doing the same and you may well find you don’t get more than 5 or 6 imprints, of rapidly decreasing intensity, before there’s finally no visible scorch at all. Why? Because scorching is highly endothermic. Chemically dehydrating the carbohydrates of linen, i.e. Driving off the elements of water (2 H per O) as steam, requires lots of energy. So each pressing drains a big chunk of thermal energy from the metal making it progressively less able to produce a new scorch. For the scorch model to work reliably one would have to have some kind of thermostat regulated system, i.e. Operating at and holding one’s carefully selected intermediate temperature, replacing drained off energy as soon as it was lost, without which one would be struggling to get a manageable system for producing an image that was of even intensity all over, and not too faint, not too strong. That incidentally is why I gave up on Model 2 (scorching off hot metal template). The combination of high temperature initially AND maintaining that temperature was simply asking too much of medieval artisans. I’d suggest that it is likewise asking too much of supernatural forces too if the dissipating heat problem is solved by invoking close on a hundred atomic bombs offset by a vanishingly small application time to make the superficial scorch possible. That’s true, even if spell binding conference mathematics delivered to a receptive self selected audience from a home computer by Power Point (like the one in Pasco last week) maintains it’s not only feasible but worthy of serious consideration! Had I been in that gathering, I’d have been eyeing the location of all the exits, looking for the nearest one from which I could slip away as unobtrusively as possible. I’ll be back later James to address your earlier points..","date":"2017-07-25","mins":"7:20 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/19/shroud-scope-8-372-impossible-scourge-marks-surely-on-the-shroud-of-turin/","cat":"blood","title":"Shroud Scope 8: 372 impossible scourge marks (surely?) on the Shroud of Turin"},{"id":"comment-9833","author":"colin_berry","post":"Two weeks have passed since sindonologists gathered in Pasco, Wa, USA for their 3/4 day “International Conference”. One might have expected to have seen some outcome appear on an internet search. But I’ve just entered (turin shroud pasco 2017 conference) into a well known search engine, with various recent time filters (Past 24hrs/Past Week/Past Month) and – with a single exception – see below – nothing has come back. Amazing! Clicking on the video filter would of course have brought up the You Tube clips referred to earlier together with those hot links I supplied. The exception was to Mario Latendresse and his very recent Academia paper re the Mandylion/Image of Edessa etc, which makes brief reference to his Pasco presentation. Http://www.academia.edu/34089071/Who Saw the Mandylion and What was its Size Judging by the slide captions Mario seems to have been unable to establish any definite link to those images and the Shroud which comes as no surprise to those of us who broadly accept the radiocarbon dating, warts ‘n’ all. Admit it sindonology. You’ve run out of ideas, brainwaves, sensational headlines etc etc. Your ludicrous non falsifiable suppositions re outbursts of subatomic particles from a deceased body, human, superhuman or otherwise are just infantile. Now go and do some serious solid scholarship, all you tedious authenticity obsessed agenda pushing sindonologists. You bore me to tears… Mario has shown you the way to go….","date":"2017-08-02","mins":"7:15 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/19/shroud-scope-8-372-impossible-scourge-marks-surely-on-the-shroud-of-turin/","cat":"blood","title":"Shroud Scope 8: 372 impossible scourge marks (surely?) on the Shroud of Turin"},{"id":"comment-9786","author":"colin_berry","post":"You raise some interesting points there James which I shall try to respond to in the next day or two – maybe in instalments. Returning for now to the suggestion that sceptics have closed minds to the possibility of miraculous 1st century events: my own gripe is not so much with the idea of miracles. It’s with miraculists who not only try to create new science, trumpeted to the media making it impossible to ignore (the latest example being those “nanoparticles” allegedly of “trauma” creatinine and ferritin in a minute sample of Shroud “blood”). It’s the riding roughshod over conventional science. A case in point is the presentation at Pasco by Charles A.Rogers, entitled the Free Electron Model. One of the first slides he puts up starts with: “Electrons move freely between positive and negative ions in water solution”. No they don’t! Ions for the most part have: (a) filled outer shells of electrons with stable electronic configurations identical with those of the noble (“inert”) gases having no tendency to move elsewhere, except in energy consuming electrolysis (b) hydration shells of water that mean the electrons of ions in water solution never get close enough to exchange, not that they would have any inclination to do so. I used to teach this stuff to 15 year olds – it being part of the UK National Curriculum Chemistry for GCSE etc. Back tomorrow!.","date":"2017-07-24","mins":"8:54 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/19/shroud-scope-8-372-impossible-scourge-marks-surely-on-the-shroud-of-turin/","cat":"blood","title":"Shroud Scope 8: 372 impossible scourge marks (surely?) on the Shroud of Turin"},{"id":"comment-9791","author":"colin_berry","post":"“The thing I brought away from the three day Pasco, WA conference is: the TS seems more legitimate than a MA forgery in that a forgery means there is an original somewhere that this TS has been forged from.” OK, the term “forgery”, which I occasionally use but don’t particularly care for, is usually in reference to an attempt to copy an existing artefact. But it doesn’t have to be if the artefact had been imagined, rather than actual which I believe to be case. “Simulation” or “imagined recreation” might be a better term. Yup, someone with entrepreneurial flair, imagined what an imprint of the sweat laden, bloodied body of the recently crucified Jesus might look like on Joseph of Arimnathea’s “fine linen” created instantly en route from cross to tomb before the blood had clotted, and even while there were still blood flows from body to cloth, but viewed centuries later – some 13 to be more precise. In other words the time scale is being moved forward from resurrection on the third day to the first few minutes after taking a body down from the cross and transporting it with honour to a nearby rock tomb.The standard description “burial shroud” for the TS is simply not justified by the four Gospel accounts and indeed has to be seen as self serving to those who attempt to promote it on the back of “science”, Shroudie true believer non sceptical conferences especially, it the final signature indeed tangible “proof” of a resurrection event. Why would they do that, i.e. Fake/forge/simulate/recreate J of A’s linen “shroud” , used for what nowadays the media would refer to coarsely as a body bag’? Well they did in fact have an existing artefact, one that served as a scaled down prototype, namely the Veil of Veronica. That as you must know was alleged to be the imprint left by the face of Jesus on a lady bystander’s offering used to mop up sweat on the way to the cross. Whether real or faked (it hardly matters) that could have concentrated opportunist, market niche seeking minds – how to simulate an ancient yellowed whole body sweat imprint, and in so doing to trump and out class the Veil, then a huge attraction/money spinner. Create, correction, RE CREATE a whole body imprint, front and back, head to head on quality linen to make an instant and arresting visual challenge – indeed a brain teaser one that served to implant the idea with minimal verbal prompting that what one was privileged to be looking at after a long pilgrimage on foot or horseback was a GENUINE imprint, one that had survived centuries of storage by secretive guardians (Templars?), not merely an oh so run of the mill painting or liturgical prop for a routine Easter church service as some would have us believe, based on next to no evidence. More to follow!.","date":"2017-07-25","mins":"10:09 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/19/shroud-scope-8-372-impossible-scourge-marks-surely-on-the-shroud-of-turin/","cat":"blood","title":"Shroud Scope 8: 372 impossible scourge marks (surely?) on the Shroud of Turin"},{"id":"comment-9783","author":"colin_berry","post":"Hello James My own interest in the Shroud is less to do with authenticity – though it’s obviously something that can’t be ignored entirely – and more to do with the claim that the body image – and to lesser extent the bloodstains – are things that could never have been produced by a medieval forger. I say they are easily reproduced – in the comfort of one’s own home in fact. What was needed was an appreciation that medieval forgers were not attempting to reproduce a burial shroud, but Joseph of Arimathea’s fine linen delivered to the cross, intended primarily for discreet transport from cross to tomb, later to be replaced by more specialized burial garments. The task was to simulate the impression that a sweat laden body plus blood might leave on linen, and look like centuries later. The inspiration for the body imprint may well have been the legendary Veil of Veronica that was attracting large numbers of pilgrims to Avignon – the mid 14th century site of the Papacy. My flour imprinting method produces an actual image – i.e. Negative, reasonable 3 D response in the appropriate software, the matching microscopic properties (halftone effect, striations, discontinuities etc) bleachability, fuzziness, water resistance, longevity etc etc. All of those can be accounted for in my model which explains the body image as a thermally developed contact imprint, one in which Maillard browning reactions between the reducing sugars and proteins etc of flour result finally in high molecular weight melanoidins. Can the same be said of all the weird and wonderful mechanisms based on sudden flashes of neutrons, protons, uv radiation, pulsed laser beams etc etc? All I’ve seen so far are patches of yellow or brown discoloration, e.g. Those that Paolo Di Lazzaro reported back in 2011. The way to dismiss medieval forgery is to adopt the mindset of the medieval forger and try to produce a Shroud like body image using only the technology available in the 14th century (which I believe I have done). If one fails repeatedly then fine, then by all means set aside the radiocarbon dating, then propose miraculous intervention that generates a truly unique image with properties inexplicable with the modern day science and technology (though how you hope to reproduce them in the home or laboratory to convince sceptics is another matter). Pasco? Which presentation impressed you the most? None that I’ve seen thus far has impressed me in the slightest. But then I’m biased, towards the strictly applied scientific method that involves putting all preconceptions to one side when planning and performing experiments. I repeat: the Shroud body image can be simulated, provided one makes it one’s task to simulate an ancient sweat imprint (which is a design consideration, NOT a preconception)..","date":"2017-07-24","mins":"5:41 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/19/shroud-scope-8-372-impossible-scourge-marks-surely-on-the-shroud-of-turin/","cat":"blood","title":"Shroud Scope 8: 372 impossible scourge marks (surely?) on the Shroud of Turin"},{"id":"comment-9792","author":"colin_berry","post":"“Other things included (there were nineteen listed) was image formation. The image was basically scorched on the linen not unlike an iron scorching material. Another thing is that the image is only one or two microns thick, laying on top of the fibers and not into the thread. Then of course the negative image; in MA times that concept wasn’t known then”. Aren’t you and the authorities you quote making a huge assumption there, not just that the image was “scorched on” (which leaves much to the imagination) but more importantly, went onto plain untreated linen, with the implication or assumption that it was the major constituent of the linen (cellulose) that was being chemically modified. Yes I know that to be part of the Di Lazzaro narrative, and that of many others too, that their radiation or whatever is targeting cellulose. Heller and Adler promoted that message too when interpreting the visible, uv and ir reflectance spectra as indication the presence of “conjugated carbonyls” formed from dehydration./oxidation of “cellulose” as the explanation for the yellow chromophore. But where was the backing evidence? And what about Rogers’ claim that the cellulose of the TS looked physically intact, judged by its allegedly native crystallinity under crossed polaroids etc? Why was Rogers’ claim never followed up by requesting from the Turin custodians a few more fibres from which to judge whether the chromophiore was derived from something added to the linen at manufacture (starch, saponins etc) and that the end product was in fact complex, high molecular weight melanoidins formed by chemical reaction between nitrogenous compounds and reducing sugars (I’ll spare you the details of Rogers’ pro authenticity naturalistic model, or rather semi naturalistic given the added starch, the focus being on those melanoidins which are NOT products of all the assumed cellulose modifying chemistry). Image thickness? Rogers estimated it at 200 600nm, i.e. 0.2 to 0.6 microns, a bit smaller than the range you quote James. That was based not on what he could see under the microscope but what he couldn’t see, i.e. Alleged detachable image layer in cross section (ipso facto it must be thinner than the shortest wavelength of visible light). I’ve since seen comments from one or other of the chief Italian groups, I don’tr recall which, to the effect that they have been able to confirm the thickness of the image layer with improved technology, finding it to be in the same ballpark – maybe the one you quote, but have still to see any hard evidence to back their claim (I don’t spend $40 or more on reprints purely on the off chance they might have what I’m looking for”. But if my flour imprinting Model 10 is correct, which I now believe it to be with virtually 100% confidence (OK, 99.99%) then all talk of detachable coatings and precise image thicknesses is misleading. Why? Because the thermally generated briefly LIQUID chromophore gets inside the threads and travels via capillary channels between and around cellulose microfibrils, colouring up weakly the most of the thread’s interior (it’s hard from the outside to tell how much, but my initial results with cross sections admittedly with equipment that is pushed to its limits re magnification and resolution suggests most of the interior of the thread is coloured. How do other folk manage to measure image thickness if the chromophore is dispersed so diffusely in the interior of threads? One waits for their evidence with bated breath! So sorry to disagree, but I say the image is not just on top of the threads, it’s inside too! Negative image? One mustn’t assume that means photographically derived negative image. “Negative” simply means tone reversed. Any contact image, say a muddy footprint on a white tiled floor, is a “negative’ image, inasmuch as real Caucasian feet are not black, and not all floor tiles are white. The negative Shroud image is the least of one’s problems where modelling is concerned, and indeed is prima facie evidence for imprinting via contact, notwithstanding those hugely misleading pro authenticity modelling exercises that deploy linen loosely draped over volunteers, essentially begging the question (since medieval imprinters of a whole body onto linen would press the fabric firmly down onto the flour coated surfaces so as to include desired relief that would otherwise be missed due to initial air gaps). Still more to follow!.","date":"2017-07-25","mins":"11:07 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/19/shroud-scope-8-372-impossible-scourge-marks-surely-on-the-shroud-of-turin/","cat":"blood","title":"Shroud Scope 8: 372 impossible scourge marks (surely?) on the Shroud of Turin"},{"id":"comment-9795","author":"colin_berry","post":"“The 14 C carbon dating group went into the investigation already determining in their minds that the TS is a fake (different from a forgery) and intended to prove it which they did, tossing data that didn’t agree with their preconception of the age. (There was a whole hour dedicated to 14 C dating that was used and was presented by several different scientists there). In sum total I believe that the TS is not a fake based on what the seminar produced.” Are you seriously buying into that crazy notion that 3 different labs, as far apart as Arizona, Oxford and Zurich would all conspire together to produce the wrong date range for the linen (1260 1390) i.e out by a massive 1300 years, all under the nose of the British Museum? Yet the Shroud first entered recorded history in about mid 1350s with its first display at Lirey, i.e. Corresponding to the radiocarbon dating, and did so with no ‘back story’ worth speaking of, bar a ragbag of anecdotal sightings much later of this or that piece of cloth, never once described in terms of the once seen never forgotten head to head life size double body image. I’m sorry to hear you subscribing to what I frankly consider to be hugely insulting to the radiocarbon scientists, and to the highly reputable journal Nature too with that multi author paper. What I don’t understand is why Turin allows all these dark whispers to continue, based either on the kind of slander you and others perpetuate, or even the more mundane idea that the corner sample was atypical of the whole, invisibly mended etc etc. It’s high time that Turin and/or the Vatican did the decent thing and arranged for repeat dating using a wider range of sample sites. All that would be needed with today’s improved more sensitive technology would be a few pulled threads – hardly disfiguring, especially if replaced with modern ones treated to look the same..","date":"2017-07-25","mins":"10:24 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/19/shroud-scope-8-372-impossible-scourge-marks-surely-on-the-shroud-of-turin/","cat":"blood","title":"Shroud Scope 8: 372 impossible scourge marks (surely?) on the Shroud of Turin"},{"id":"comment-299","author":"colin_berry","post":"I have just added this comment to The Other Site: No one seems willing to say precisely what is imaged when we refer to a scourge mark. Is it entirely blood, in which case it is a subset of “bloodstains” and presumably imprinted on the cloth at the same time as bloodstains, while having a distinctive morphology (dumbbells etc), OR is it an acquired detail of body morphology that is imprinted along with the rest of the body features, which just happens to have also acquired a thin film of blood to make it a hybrid marking on the Shroud – part image/part blood? Methinks there is a growing credibility gap where those “scourge marks” are concerned. But then some of us have been growing increasingly incredulous about “bloodstains” too from seeing how they look remarkably “image like” under the Shroud Scope, i.e. Confined to the ribs of the weave, with no penetration worth speaking of into the furrows. Time methinks to write another post, and to stop being mealy mouthed about something that is plainly a contrivance, and a very clever one at that, but simply does not stand up to close scrutiny, at least by those of us with limited social skills… 😉.","date":"2012-06-21","mins":"5:23 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/19/shroud-scope-8-372-impossible-scourge-marks-surely-on-the-shroud-of-turin/","cat":"blood","title":"Shroud Scope 8: 372 impossible scourge marks (surely?) on the Shroud of Turin"},{"id":"comment-9817","author":"colin_berry","post":"Thanks again James. (Am not sure why your comment, as with Hugh’s too, came through not only as Anonymous, but as if from a ‘newbie’ as well, requiring my approval, but let’s not worry about that for now).. I’m not sure if this dialogue is getting us anywhere. Part of the problem is your scatter–gun approach. I think where the Shroud’s concerned it’s important to take one aspect, indeed one tiny detail at a time and examine in as much depth as possible. There’s a lot of claims in sindonology that simply don’t stand up to close scrutiny, but still get bandied around year after year. If you’d care to say what you regard as THE major sticking point, and whether or not it’s influenced by what you saw or heard at Pasco, I’d be only to happy to engage further. But please bear in mind that I’m mainly here for the hands on modelling, in response to claims that the Shroud body image is non reproducible. Anything to do with age and alleged authenticity (pollen, limestone etc) I tend leave to others. Cheers.","date":"2017-07-27","mins":"11:36 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/19/shroud-scope-8-372-impossible-scourge-marks-surely-on-the-shroud-of-turin/","cat":"blood","title":"Shroud Scope 8: 372 impossible scourge marks (surely?) on the Shroud of Turin"},{"id":"comment-9823","author":"colin_berry","post":"We can have meaningful discussions provided the initial proposition makes sense to me, James. But as Hugh pointed out earlier, there’s really no call to go invoking the supernatural. Merely because an image loses definition when viewed at close quarters. Were you to do a systematic survey of the vast range of different images, ancient and modern, I’m sure you’d find any number where there’s a minimum viewing distance for maximum definition and clarity. The human eye after all is a highly complex organ, relying on electrical impulses between rods and cones in the retina at the back of the eye and the distant ‘black box’ visual cortex at the rear of the brain – with nothing more than a slim signal conducting cable connecting the two (read ‘optic nerve’)! Just think of the multitude of ways in which the eye and its bio hardware can be fooled with optical illusions! Anyway, thank you for your visits and contributions. Feel free to visit again any time, once your irritation with my warped sense of humour has subsided. Oh, I too like that Sherlock Holmes quotation you gave earlier. I just hope that my Model 10 is the point where the impossible, near impossible, vaguely credible etc have been eliminated, and my thermally (specifically IR?) generated MOBILE chromophore* narrative begins to attract attention. – not that my research endeavours depend on instant feedback, far less pats on the back. *Yes, the key feature of Model 10, as stated 2 years ago here and on Dan Porter’s retired site, is a briefly liquid thermal cocktail capable of migrating via capillary channels within linen threads away from the immediate site of generation. The initial model assumed the chromophore travelled BETWEEN fibres (based on modelling with water based blue ink). That’s now been modified to capillary transport WITHIN fibres..","date":"2017-07-28","mins":"2:55 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/19/shroud-scope-8-372-impossible-scourge-marks-surely-on-the-shroud-of-turin/","cat":"blood","title":"Shroud Scope 8: 372 impossible scourge marks (surely?) on the Shroud of Turin"},{"id":"comment-9820","author":"colin_berry","post":"Dear Customer Yes, we do indeed stock the item you are seeking, namely the Magic Face of our Lord imprinted on finest linen for hanging on your wall. However, you failed to specify which of the two versions you wanted. Was it the more expensive of the two ($1500)? That’s the one where from a distance it looks like blank cloth, where the face only appears when you get closer, and disappears again when you step back. Or was it the cheaper version ($250) where the face is only visible at a distance, and disappears as you get closer? Yes, a check is fine. Kindly make it payable to Relics U Like. 😉.","date":"2017-07-28","mins":"7:01 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/19/shroud-scope-8-372-impossible-scourge-marks-surely-on-the-shroud-of-turin/","cat":"blood","title":"Shroud Scope 8: 372 impossible scourge marks (surely?) on the Shroud of Turin"},{"id":"comment-9814","author":"colin_berry","post":"Even now James I am struggling to comprehend the subtlety of image formation on BOTH sides of linen when the chromophore – maybe even proto chromophore – is (a) initiated by highly localised infrared heating of the side of the linen exposed to the radiant heat (b) is highly mobile – if liquid and able to migrate along threads AND individual fibres (c) undergo polymerisation reactions – I use the term loosely – en route, maybe taking a little time for full colour development. Just think: one could have proto chromophores formed initially, barely coloured if early products of Maillard reactions. They they migrate to the opposite side of the linen on the superficially situated fibres of threads but using the interior of those fibres as protected ‘passageways’. Along the way. Further complex chemical reactions lead to the final yellow melanoidins that deposit colour evenly (half tone effect) inside fibres, visible (just) from the outside, better with the naked eye as it happens than through a microscope (through close packing effects). Some colour, maybe not much, gets deposited on the opposite side of the linen, accounting for the scarcely visible “second face”. Then what? Answer: what’s to stop the liquid returning to the irradiated face, blurring the edges of the image, making it more “diffuse” especially viewed at close quarters (with ref to your earlier point, also addressed by Hugh) given that threads in a weave criss cross from one side of the linen to the other. We now have an explanation for why the colour is concentrated on the “crown threads”” of the ‘main’ image side, but is not exclusive to those crowns – see the Mark Evans photomicrographs where the colour can be seen going into interstices – and who’s to say it’s not coming OUT of interstices too, having made a complete circuit so to speak! (Late addition: come to think of, there’s no reason why the first formed liquid exudate from the superheated flour should not make multiple circuits. Little happens initially when it reaches the non irradiated side, but when it returns to the irradiated side it gets a fresh injection of heat which sends it on a second round trip, the process being repeated several times which results in a more spread out image on the radiated side than would otherwise be the case (especially if the infrared promotes the final polymerisation reactions that result in the more highly pigmented solid high M Wt melanoidins, and if the much reduced infrared results in little darkening on that opposite side as the liquid exudate rapidly ‘passes through’ without stopping, at least initially) You want subtlety – I can give you subtlety (modified Model 10!) You may feel that the image properties are far too unusual and subtle to be the end result of human technology. But you cannot expect a scientist – this scientist – to uncritically accept your bewilderment as grounds for giving up on the science and passively accepting yours and others ‘miraculist” interpretations. Human development and material progress would scarcely have proceeded beyond witch doctors and their magic spells and incantations if that kind of thinking had prevailed centuries or millennia ago. Scientists question – and then EXPERIMENT! It’s what we do. It’s not purposely disrespectful to the spiritual word – it’s just not willing to let that world have the final say on every subject under the sun, given what we now know about the complexities of atoms, ions and molecules. Late addition: I’m thinking I should drop my description of Model 10 as the “flour imprinting” model. It’s insufficiently informative, and may indeed act as an instant turn off for those seeking a more with it ‘sciency’ name. Maybe the “IR triggered/mobile chromophore” model, or something shorter and catchier. Suggestions welcome (preferably polite)..","date":"2017-07-27","mins":"6:50 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/19/shroud-scope-8-372-impossible-scourge-marks-surely-on-the-shroud-of-turin/","cat":"blood","title":"Shroud Scope 8: 372 impossible scourge marks (surely?) on the Shroud of Turin"},{"id":"comment-181778","author":"colin_berry","post":"On reading this comment an hour ago, Mario, with its reference to Gian Carlo Durante, I was minded to ask if you might tell us the story behind your amazing Shroud Scope, especially the Durante images. Http://www.sindonology.org/shroud Scope/shroud Scope.shtml Am I the only one to have puzzled how you managed to navigate your way round copyright issues without having legal writs flying everywhere. But I decided first to google “Gian Carlo Durante”, it being the first time I’d seen his first two names, and quickly came across this fascinating pdf that documents the controversial 2002 restoration. Tucked away inside is a heart warming sentence that Gian Carlo Durante generously waived his copyright on his 2002 photographic archive, leaving Turin and the Holy See as the sole owners. Http://www.shroud.it/GHIBER 2.PDF One’s tempted to say more, a lot more, where copyright on photographic images of the TS is concerned. Frankly I’m amazed that private individuals with camera equipment, no matter how respected professionally, were ever allowed to acquire copyright anyway for what is surely a technical operation only. All that was required of them was to make as objective as possible a photographic facsimile with no obvious creative input that would aid further research. Nuff said (for now at any rate) except to repeat that request to Mario to provide an account of his ‘coup’ in transferring the Durante image to the public domain (a click away on our laptops). Thanks too to Thibault Heimburger, who was able more recently to place the still copyrighted Mark Evans archive onto freely downloadable pdf. Https://shroudstory.com/2013/11/18/must see the informative mark evans photomicrographs/ Is that the complete archive, or are there images that we have not seen, especially of magnified close ups of blood and image areas?.","date":"2015-01-07","mins":"4:04 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181888","author":"colin_berry","post":"Thanks for the prompt reply, Mario. I shall take another look at your site to see what I may have missed previously re the complete Mark Evans archive. For now, the chief point of interest to this data starved researcher is your reference to 25% resolution of the Shroud Scope images. Is that a reference to the Durante photomicrographs? Was that a condition imposed by the Turin authorities when you first approached them to release those images? Why would they do that? I for one would greatly appreciate having blood v body image at the highest possible resolution in order to see precisely where those blood (and body) images are located relative to the ribs, furrows and obverse side of the herringbone weave. Do you think the higher resolution images, if available, might help to resolve outstanding issues re superficiality, blood migration across the weave, whole v partial nature of the blood stains Mario? If so, then I would urge you to exercise your influence and good offices where the Turin and other authorities are concerned with a view to getting the highest resolution micrographs placed into the public domain. Your Durante/Shroud Scope, and more recently the Evans/Heimburger pictures, have been a boon to us independent researchers, , i.e those of us who choose to operate outside of the magic circle and largely pro authenticity promoting sindonology symposium circuit, but they have whetted our appetite for more. Do you by any chance have access to the obverse side (aka reverse, aka recto) images, visible in 2002 when the Holland cloth was removed, which I gather were photographed by Gian Carlo Durante? Might one hope to see them added to Shroud Scope in 2015, hint, hint? ; ).","date":"2015-01-07","mins":"2:32 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181476","author":"colin_berry","post":"Friendly suggestion to Piero: Less (empty) talk please about AFM or CFM in 2015 pending some real ACTION. Possible re design of Piero’s kitchen: Yup, that’s the gear that we’ve been told is the answer to all our problems. Crowd funding maybe? I’ll willingly chip in £100, on condition I’m allowed to see the equipment in action on a genuine TS image sample (shroudtstory calling Turin). If not – I’ll insist on a full refund. “Evaporation ” of my hard earned cash resources (see current post) will not be tolerated..","date":"2015-01-05","mins":"11:38 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-182026","author":"colin_berry","post":"Thanks again Mario. Am I the only one to find I initially understimate the wealth of detail that is available on Mario’s site? Take those thumbnail Mark Evans images referred to in the first of Mario’s links above. At first sight, one could be forgiven for thinking they are a repetition of the images that appeared in TH’s pdf. But there’s a difference, due partly to format. Not only do those images on Mario’s site expand to full screen when you click on them, but one can then magnify them further with repetitive clicks (up to 8 on my laptop) with CON+, with no appreciable loss of resolution. Here’s a before and after comparison of what one sees with just one of Evans pictures (small of back with blood). Magnificent! But there’s a sting in the tail. Suppose the kind of image you see above had been available before STURP set off to Turin in 1978. Would the protocol have been content for STURP member A to take sticky tape sample of blood regions back to the States to be examined and interpreted by STURP members B and C, resulting in seemingly conclusive mantras like “no red blood cells” and “not whole blood, but a serum exudate of retracted blood clots”? Look closely at those photographs. What was needed (surely?) was a separate lifting of the TWO kinds of pigment one sees in the magnified pictures – the denser spots of dark red pigment, and the diffuse much paler red regions. Might remnants of whole red blood cells have been seen in the first of those one wonders? Might it be the second that is better described as more serum like, albeit with some accompanying pinkish porphyrin pigment due to haemolysis? Then there’s a second question that needs to be addressed. Is the ‘patchiness’ a faithful record of the initial imprinting. Or were the dark red areas far more extensive originally,prior to having subsequently flaked off over the centuries? In that view, all we see now are the surviving patches of ‘whole’ (?) blood dotted about here and there that are anchored more firmly. Roll on STURP Mk2. Autumn (‘fall’) 2016 would seem a realistic target date, once the 2015 tourists are all safely back at home..","date":"2015-01-08","mins":"5:44 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-8279","author":"colin_berry","post":"@Dave B For you to be telling a published scientist to “lift his game” without making any effort to see how his work has been received in the scientific community is quite simply laughable – not to say insulting. It is you who needs to get down off that high horse of yours, Dave B. And I do not need any pompous half baked lectures from you on the history of science either..","date":"2012-02-15","mins":"7:26 am","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin"},{"id":"comment-8230","author":"colin_berry","post":"“But such persuasive evidence will continue to be ignored by the skeptics, merely because it does not match with their preconceived notions and agenda, their preference for reductionism, and they will no doubt continue to fiddle with heating metal bas reliefs, and scorching countless ironing boards.” If I were in the business of replicating the Shroud with ironing boards, nope, with a heated bas relief and a bed of sand, I’d avoid using sifted sand. A few bits of flint or gravel strategically placed here and there might do wonders for added ‘authenticity’ – like creating conduction hot spots that replicate some or all of those 15 or 20 “unique” features. Yup, all it would take in the sand bed model is a bit of stone or fragment of twig to produce a “swollen” cheek (the latter being so “anatomically flawless” as to be in advance of the Gospel account ; ).","date":"2012-02-14","mins":"10:30 am","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin"},{"id":"comment-8262","author":"colin_berry","post":"But wasn’t someone just the other day here saying that one has to stand back several feet from the Shroud to be able to see what the image represents, such is its faintness? What price then for a framed head to serve as a conventional portrait? That Mandylion must have come as a bitter disappointment to some, especially the short sighted in days before spectacles were commonplace. I suppose one could argue that the image was far more intense in centuries past, and that most has subsequently flaked off.That being the case, what price all the current marvelling at its superficiality and thinness (200nm) if all we see today is a pale shadow of its former glory..","date":"2012-02-15","mins":"4:01 am","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin"}]
