[{"id":"comment-215707","author":"colin_berry","post":"An impressive summary indeed, but oh so negative in the final analysis. Where’s the beef? Had there been that iconic double image – both sides of the same man, aligned head to head – in someone or other’s possession for 1300 or years prior to Lirey, it would have leaked out into the public domain, if only as a rumour. It would have required just one quick sketch, scarcely more than graffiti, to become an instantly recognizable logo, signalling the sheet that enveloped the crucified Jesus, leaving his supposed faint bloodied imprint of BOTH sides. But there’s no record pre 1355 of any such iconic double image. So why not just accept that the double image did not exist before the mid 14th century? Why not regard it as an ingenious artefact that has (allegedly) perplexed the brightest and best of modern day scientists? Or has it? Which top notch scientists have been invited to examine it? If anyone here knows of any, then please name them and their research achievements. Don’t be content to say they were “experts” or highly regarded in their chosen field. State the discoveries and insights for which they are famous. I say the TS has never been investigated by a top notch scientist associated with a major discovery, no disrespect to the Hellers, Adlers, Rogers etc, certainly not of Nobel Prize standard. Yet the UK institute where one of my medically qualified offspring works does immunological research is reputed as having a still active Nobel Prize winner on every floor! They do exist, and I’ve no doubt some are quite approachable. Why has the TS not been evaluated by someone of that standing? I’d be happy to give them some pointers, like urging them to ignore the mantra that says the image cannot be a thermal imprint on account of it not fluorescing under uv. Expect to see 3 new short postings soon – the first detailing the properties of my recently acquired uv source, the second describing the results of using it to illuminate direct thermal scorches (Mk 1 model, with hot metal templates applied to linen) compared with the largely irrelevant charred edges of full thickness burn holes as per 1532 Chambery fire, an improper reference standard if ever there was, and, phew, the third with oven roasted white flour imprints, still using my own hand as cold template – and still the currently favoured Mk 2 model..","date":"2015-12-06","mins":"3:30 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-206267","author":"colin_berry","post":"Well said Thomas (even without the reference to my own clumsy attempts to arrive at a solution)..","date":"2015-07-21","mins":"7:30 am","url":"https://shroudstory.com/2015/07/21/a-rare-piece-of-cloth/","cat":"history","title":"A Rare Piece of Cloth"},{"id":"comment-282","author":"colin_berry","post":"It’s not an article – it’s a response to a response….","date":"2012-05-31","mins":"7:15 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/23/a-reply-to-dan-porter-and-his-shroud-of-turin-associates-re-the-significance-of-the-lirey-pilgrims-badge/","cat":"badge_lirey","title":"A reply to Dan Porter and his Shroud of Turin associates re the significance of the Lirey Pilgrim’s Badge"},{"id":"comment-182","author":"colin_berry","post":"Here are just two of the responses on Dan Porter’s site today. Both are intrigued by the Lirey badge, scarcely aware it would seem of its existence, far less its significance, until today. Yet the site owner wastes no time in posting that sour put down response of his, not just in one but two quick fire postings. Make of that what you will, folks, sceptics especially… Comment 1 (from a site regular) This is the first time I have seen this badge in the public arena, or even heard mention of it, although evidently the cognoscenti have been aware of it. Doubtless they can provide more detailed information about it if so inclined. Its dimensions, identity of the coats of arms, its material and other aspects would be of considerable interest. Its provenance and dating are obviously critical to its identity. Max includes the note that a similar impression of the figures is apparently on the Coudray tower. Ian Wilson includes a colour plate of Templars Molay and Charnay being burned at the stake taken from a British Library ms (plate 28c in “The Shroud” 2010), If the colour plate is a moderately realistic representation, then both men appear beardless and also tonsured. If the badge can definitely be connected to the Templars, it would seem to add some little weight to Wilson’s theory that the Templars were at least aware of the Shroud image. To me, the left hand image appears to have a face and is therefore intended as a frontal image; I cannot discern a face on the right hand image, and presume it may be intended as a dorsal view as represented on the Shroud. An alternative explanation might be that if they indeed are connected to the Templars, they might represent the two Templar victims, although I tend to favour a Shroud like image representation. If the figures are indeed frontal and dorsal views, then it seems highly unlikely that they can be seen as anything else but a representation of some intended connection with the Shroud image, There is nothing else like it which it could otherwise represent, Any potential the badge might have for creating a rubbing or any other kind of copy is an irrelevant distraction from whatever else its true significance might be, assuming that it’s a genuine article. …………………………………………………………………………………… Comment 2 (another site regular) Just an interesting note about this medal : Did anyone noticed the herringbone weave on the cloth ? This is the best confirmation that the artist who have done this medal during the 14th century was looking at the Shroud of Turin..","date":"2012-04-23","mins":"4:41 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/23/a-reply-to-dan-porter-and-his-shroud-of-turin-associates-re-the-significance-of-the-lirey-pilgrims-badge/","cat":"badge_lirey","title":"A reply to Dan Porter and his Shroud of Turin associates re the significance of the Lirey Pilgrim’s Badge"},{"id":"comment-2987","author":"colin_berry","post":"PS. I see that image of the naked saint with those “scourge marks” is right in the middle of the period of interest,see caption below, i.e. Between the Templar roastings and the Lirey badge. Yet we’re constantly told that the TS image couldn’t possibly be of medieval artistic provenance on account of the nudity. Strange that there hasn’t been mention of the huge Lawrence related canon of art Across The Way, given that so many of its contributors, yourself included, are keen students of that sort of thing. Caption: “The Martyrdom of Saint Lawrence from the Laudario of Sant’Agnese, about 1340, Pacino di Bonaguida. Tempera and gold leaf on parchment, 7 1/2 x 8 3/16 in.” Scourge marks? I have not come across any reference to a preliminary scourging, have you? Might not those marks represent where those nasty sharp looking pitchfork or trident ends were used to press the victim down, or generally restrained? He’s shown unrestrained in that image. Others show the feet secured to the grid with what appears to be cord or similar (even if a fire proof chain would seem more appropriate)..","date":"2014-02-12","mins":"8:27 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2014/02/11/a-revised-flow-chart-model-for-why-the-turin-shroud-was-first-documented-in-14th-century-france/","cat":"2000_year_old_earthquake","title":"A revised flow-chart model for why the Turin Shroud was first documented in 14th century France."},{"id":"comment-2984","author":"colin_berry","post":"Hello again Hugh (congrats btw on your BSTS appointment) Enter (St.Lawrence martyrdom ) into Google, click on Images, and that picture of the naked TS like depiction of St.Lawrence is in the third row of images. So far I’ve been unable to find who painted it, and when, though it looks quite early (pre 16th century?). Any thoughts about the reverse side of the Lirey badge? Why show that peculiar trellis like pattern strung between posts if not intended to represent a horizontal grill, like say a grill for roasting Templars en masse?.","date":"2014-02-11","mins":"11:22 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2014/02/11/a-revised-flow-chart-model-for-why-the-turin-shroud-was-first-documented-in-14th-century-france/","cat":"2000_year_old_earthquake","title":"A revised flow-chart model for why the Turin Shroud was first documented in 14th century France."},{"id":"comment-150095","author":"colin_berry","post":"Don’t believe a thing you read in the World News Daily Report. It bills itself as a satirical site, as I discovered through chasing up its other story on the ‘discovery’ of an aboriginal city in the centre of Australia. Http://www.hoax slayer.com/fake news ancient city found australian desert.shtml In any case, it stands to reason that there is life after near death..","date":"2014-09-11","mins":"1:52 am","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","title":"An Old Christian Papyrus"},{"id":"comment-144223","author":"colin_berry","post":"My concern is less to do with research that has not yet been done through lack of academic curiosity. It’s to do with pre emptive so called research, read rhetorical dissing, designed to block off certain avenues, declaring them to be bad or dangerous neighbourhoods. Shroudology reeks of agenda driven control freakery. I expect to be banned (or issued a yellow card) for saying that. So I’ll say it again. Shroudology reeks..","date":"2014-08-16","mins":"2:16 pm","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route"},{"id":"comment-9300","author":"colin_berry","post":"Anyone would think this banding hypothesis (neat, plausible but wrong) had been written on tablets of stone. A few moments of thought about the imprinting of a certain transverse crease should be sufficient to demolish any notion that vertical banding was the cause of the gaunt looking features. There is another explanation for the cut off peripheries of the face, and it’s nothing to do with colour variations in the yarn, and everything to do with the mechanism of image imprinting, But I’m not here to debate technical matters – not any more. I’m thinking of setting up a new site that will specifically address this and then rest of Shroudology’s received wisdom, which all too often strikes me as little more than tendentious pseudo scientific twaddle. And no, I will not be intimidated by “Fourier transforms” and similar injections of computer mumbo jumbo, which in this instance has contributed precisely nothing. I’ll give you a link when my new site is ready ..","date":"2012-03-14","mins":"4:12 am","url":"https://shroudstory.com/2012/03/13/banding-maybe-jesus-looked-different/","cat":"history","title":"Banding: Maybe Jesus Looked Different"},{"id":"comment-925","author":"colin_berry","post":"Hello again. Just a quick holding reply before I head off to see my new grandaughter, The question of what to make of the crucifixion hardware is a tricky one I grant you. It’s not made easier if one believes the accounts, set out by Knight and Lomas, that De Molay was not only slow roasted at the stake – before that he had been hideously tortured during his 7 years of incarceration, and part of that torture featured being crucified to a door. If the latter were true then one has a rationale for lots of things to do with a later fusion (confusion?) of crucifixion and roasting – and the Lirey Badge may have played on that ambiguity and help to explain why the early Shroud was able to get a grip on the medieval imagination, incorporating two distinct but overlapping ideas. My ideas are a watered down version of Knight and Lomas, inasmuch as they have proposed that de Molay was placed in a shroud immediately after crucifixion, long enough for some kind of chemical image to have been formed. I don’t buy into that, preferring to think that a scorch was produced off a hot replica as a kind of grim metaphorical statement – this is what the King and the Pope did to the head of a rich and supposedly powerful order..","date":"2012-10-11","mins":"7:28 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/24/comparison-of-lirey-badge-cluny-medal-depicting-the-shroud-of-turin-in-the14th-century-with-the-1865-forgeais-drawing-for-open-discussion/","cat":"arthur_forgeais","title":"Comparison of Lirey Badge (Cluny medal)  depicting the Shroud of Turin in the14th century with the 1865 Forgeais drawing – for open discussion"},{"id":"comment-923","author":"colin_berry","post":"Think of it from a forger’s point of view. If you imprint side by side, then the two images have to be juxtaposed just so – or junior will ruin the outing by asking loudly: “Daddy, why is his head higher on one side than the other?”. There is no such problem doing the two end to end – since they are not viewed side by side, and who’s to say how much slack linen there would be when doubled back on itself above the head? Have a nice day out yourself Sunday week … (leafy Beaconsfield).","date":"2012-10-10","mins":"7:49 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/24/comparison-of-lirey-badge-cluny-medal-depicting-the-shroud-of-turin-in-the14th-century-with-the-1865-forgeais-drawing-for-open-discussion/","cat":"arthur_forgeais","title":"Comparison of Lirey Badge (Cluny medal)  depicting the Shroud of Turin in the14th century with the 1865 Forgeais drawing – for open discussion"},{"id":"comment-918","author":"colin_berry","post":"Hello there. Maybe I’m missing something here, Hugh, but why would I need to mention the herringbone pattern? Sure it’s important – because it creates a direct link between the memento and the artefact it represents – but I am not challenging that. Why would I? I’ve acknowledged from the outset that the Badge was made as a pilgrim’s memento of the Shroud, as it existed in 1355 or thereabouts, residing in the Lirey church. My position is not that the Lirey Shroud, at least its body image, is something different from what is presently in Turin (though bloodstains may have come later): it’s to do with what the Shroud represented or was perceived to represent by its first cohort of viewers. Were those first pilgrims paying homage to the alleged burial shroud of Christ, or to an image of a celebrated Templar Grand master, hideously tortured and roasted over hot charcoal? Or was there some confusion in people’s minds, due to attempts by De Charny and his wife to present one or other of the executed Templar leaders, alleged heretics, as a Christ like figures? Nope, the herringbone pattern makes it near 100% certain that the badge represented the present Shroud – but I thought that would be self evident, which is why I did not mention it. Single “blood chain” across the back? Well you obviously concur with Ian Wilson that it represents blood, i.e. From the spear wound from the side. But if so, why is it shown in so highly stylised a fashion, i.e. As a near prefect helix. Nothing else about the man’s image seems to have stylised or even non stylized representations of crucifixion. Where are the nail wounds, the crown of thorns, scourge marks, the reversed 3 of the present Shroud etc? If the casting technique allows a minuscule herringbone pattern to be reproduced, then why not these tiny details as well? I have to say that I regard the “blood chain” as nothing of the sort – it is simply a chain, i.e. A metal chain, one used to secure the individual to the stake before lighting the fires. Or maybe there was deliberate ambiguity, at least where the Badge was concerned, a preplanned attempt to morph a Templar related image into a biblical/crucifixion one, which if the case was stunningly successful, fooling both medieval and modern folk. Double image? Again, representing what is on the Shroud, which in turn is indicative of an image left by someone enclosed within an up and over cloth. If it had not had dorsal and frontal images, would folk have perceived the cloth as a Shroud that had enveloped a dead body? I doubt it. The empty tomb? Well, it’s a very medieval looking tomb, would you not agree, i.e. A sarcophagus, rather than a cave like cavity in a rock face maybe with a simple shelf? Again, the Badge artist may have been striving for deliberate ambiguity – one can view that feature either as a sarcophagus to represent the biblical sepulchre OR as a kind of barbecue grill on which the condemned was stood above glowing coals. What nobody seems to mention is how un Christ like the figure on the Badge looks. Yet the Shroud is said to have given rise to the classical image of Christ that began to appear in art several centuries before the Badge was made. For all the symbols (ambiguous ones) on the Badge, and the details that confirm it as a keepsake souvenir of the Shroud, there is a fundamental disconnect where it really matters. The Man on the Badge does not obviously resemble the Man on the Shroud. Why? Because the latter was not intended IN THE FIRST INSTANCE to represent Christ, and it was not until strategically placed bloodstains were added to the Shroud that people then made the connection that they were encouraged/urged to make, abandoning all “erroneous” indeed heretical (?) folk memories to do with Templar martyrs. Thanking you for your interest..","date":"2012-10-09","mins":"9:51 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/24/comparison-of-lirey-badge-cluny-medal-depicting-the-shroud-of-turin-in-the14th-century-with-the-1865-forgeais-drawing-for-open-discussion/","cat":"arthur_forgeais","title":"Comparison of Lirey Badge (Cluny medal)  depicting the Shroud of Turin in the14th century with the 1865 Forgeais drawing – for open discussion"},{"id":"comment-226","author":"colin_berry","post":"Here is a comment, or rather a semi hysterical diatribe, that has just appeared from “Ron” on the Other Site: “Well Colin if you disregard those comments on C14 especially as you claim to be a scientist/chemist, then I would say you are either blinded by bias or a fraud. There have been many other archeologists that have commented the same and agree with Hawass’s statement. Any scientist, archeologist, anyone who has dealt with radiocarbon dating would agree with those comments. It is a true fact that RCD is error prone, highly subseptable to contamination and ‘based’ on some voodoo mathematics, not to mention relies on “basic assumptions” regarding c14, c12 levels prior to the 1950s…this is fact Colin, not stories or assumptions. People like you now have to deal with the ‘FACT’ that the 1988 RCD is INVALID and scientifically speaking have no argument against the authenticity of the Shroud. All you can do now, since you’ve failed to replicate the image attributes in any form, is try to nit pic at studies that have been done by some with maybe far more knowledge then you, which sorry to say seems pathetic to me. Thanks for coming out.” Odd, isn’t it, how the true believer single issue internet sites can generate these instant experts in specialist technology – when the latter delivers the “wrong” answer, yet bandy around the “right” answers as if battle trophies. I personally try to avoid confrontations with these internet amateurs, not because I consider myself an expert (least of all on the fine detail C 14 dating protocols, while understanding the broad principle) but because one is on a hiding to nothing. One can do the research, point out the error, and nine times out of ten there is either no response, or a change of subject (“what about the blood stains?” or “what about superficiality of the image?” ,,, ad infinitum, ad nauseam. ). Nope, I have no intention of wasting my time on other people’s denialism, aka flat earthism. What I will say is this: firstly, it was not the 3 labs who made that crazy decision to sample from one corner only. That was foisted on them at the 11th hour by a so called scientific adviser whose name I shan’t repeat here, but who managed to keep it off the final multi author paper. If people don’t like the answer, then they should stop casting aspersions at the integrity of the 3 labs, and lobby Turin to have the analysis repeated, using a better sampling frame. Finally, I have to say I find this nitpicking on the C 14 dating not just unseemly, but intellectually dishonest if the truth be told. Imagine the result had come back confirming the Shroud was 1st century AD. Imagine then I or someone else had questioned the reliability of the methodology. It’s not difficult to guess the response of the Rons of this world – the type who casually sticks the charge of “fraud” on someone who blogs under his full real name, with a solid track record in experimental science. It would be “tough titty, that’s the science chum, you cannot argue with the science, you are not entitiled to comment on something outside your own speciality.. Bla bla bla”. It is knowing that would be the response of flat earther Ron and his ilk that I respond to his systematically biased advocacy here on my own site, where I can say what I want, within reason, without having Dan Porter the Ober Gruppen Fuhrer vetting all my comments, and/or blocking some as has happened in the last day or two. Dan’s “Shroud of Turin” site is a slick operation to continue marketing the Shroud as an unsolved mystery, and no doubt to keep the cash registers ringing in the States and elsewhere. I have no more time (or patience) for Dan Porter’s site.","date":"2012-04-28","mins":"12:05 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/25/a-comprehensive-new-theory-that-provides-medieval-origin-for-the-turin-shroud-a-scorching-into-linen-and-human-consciousness-of-the-last-of-the-knights-templar/","cat":"1532_chambery_fire","title":"A comprehensive new theory detailing a medieval origin for the Turin Shroud: a scorching onto linen – and human consciousness – of the last of the Knights Templar."},{"id":"comment-221","author":"colin_berry","post":"Try googling… shroud turin knights templar… I’m feeling somewhat humbled right now, but in a strange way quietly elated. Why? Because other folk have arrived at the precisely same conclusion as me, having made a link with the Templars, but from entirely different directions. Mine has been plodding scientific, supplemented with wider reading. My own contribution has been that Lirey badge realizing that it was not all it seems – to the casual observer The Shroud was devised as a metaphorical headstone to a major force in European history – the Knights Templar extinguished by a combination of debt encumbered monarchy and a papacy – fearful of a secret rich and powerful society, evoking some of today’s misgivings, justified or otherwise, re that other secret fraternity, the freemasons with their strange and non transparent rituals..","date":"2012-04-27","mins":"7:19 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/25/a-comprehensive-new-theory-that-provides-medieval-origin-for-the-turin-shroud-a-scorching-into-linen-and-human-consciousness-of-the-last-of-the-knights-templar/","cat":"1532_chambery_fire","title":"A comprehensive new theory detailing a medieval origin for the Turin Shroud: a scorching onto linen – and human consciousness – of the last of the Knights Templar."},{"id":"comment-224","author":"colin_berry","post":"Copy of exchange with “bmoon1” on yeserday’s DT article o the teaching of history: http://www.telegraph.co.uk/education/educationnews/9229379/Pupils failing to study British history at school.html#comment 512815103 bmoon1 replied to you The shroud is that of Jesus Christ. The hand weave of the cloth is very important. France did not hand weave at the time you would have everyone believe the shroud was dated; France used looms. The hand weave of the shroud coupled with the particular design of the weave is typical of linen weave in the First Century in the Middle East. The linen contained pollen from plants found only in Turkey and Palestine. The linen shows a clear imprint of a Roman coin. The blood imprints on the wrists and ankles show the stakes piercing at these points, rather than the wrongly believed hand and feet piercings. The face shows clearly Sephardic features. The carbon dating sample was not done on the main body of the linen; the fabric used was not representative of the entire shroud. Finally, the fold of the shroud is also unique to that of the Middle East in the First Century. Everything completely fits in with the shroud being removed by the disciples and hidden in a cave. From there it was taken to an early church and then stolen by Turks. It was stolen from the Turks by a Frenchman in the 1300’s and from that point we have always known of it’s whereabouts. I do not know why you would wish everyone to believe your incorrect and baseless claims. •19 hours ago • Pupils failing to study British history at school 2 people liked this You replied to bmoon1 Naturally I have seen each and every one of those arguments before, and while contributing to Shroudie blogs – like Dan Porter’s – have refrained from comment. Why? Because few if any of those arguments are scientific ones, capable of being tested scientifically. That does not mean they are mistaken – simply that they are non scientific, and, if the truth be told unscientific. My starting point was to attempt to reproduce the image characteristics of the Shroud by means of scorching (direct contact with a hot metal bas relief template) to demonstrate its superficiality, negative light/dark reversed character, encoded 3 D information, all of which I have demonstrated and reported on my sites over a period of several months. The next step was to think of a rationale for why anyone would go to the trouble of imprinting a scorch onto linen in the medieval era, which looked hopeless to start with, until I came across the Lirey pilgrim’s badge. The rest as they say is history – medieval history! All those points you raise are what we boring and tedious old science bods, including this retired one, would describe as ‘special pleading’ – with a search for facts purely to support preconceptions. The scientific approach is to collect and appraise facts that are not driven by preconceptions – except maybe as temporary working hypotheses – while admitting in my case to an irritable response to being bombarded by others’ preconceptions (ENSA’s “miraculous flashes of uv light”), and then thinking to oneself “Hold on a minute, there’s something not quite right here. If it looks like bullsh*t, smells like bullsh*t, then it probably is bullsh*t…” •19 hours ago • Pupils failing to study British history at school 1 person liked this You replied to bmoon1 I’ve been puzzling that first point of yours for the last 24 hours – thus the tardy reply – and have to say I think you are somewhat confused about weaving. Inasmuch as mechanized looms did not appear till the 18th century, then it was always “hand weaving” before that. But that still required a loom – it would be virtually impossible to do any kind of weaving – at least for more than a square inch of two – without some kind of loom. Even the ancient Egyptians used looms to weave. So there is really no case to answer re your weave point – the Shroud would have been hand woven on a loom whether it was first or 14th century. As for the herringbone twill, I’m amazed at the authority with which folk talk about weaving practices in Biblical times. Where are the samples from that era stored that one can go and examine closely?.","date":"2012-04-28","mins":"10:59 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/25/a-comprehensive-new-theory-that-provides-medieval-origin-for-the-turin-shroud-a-scorching-into-linen-and-human-consciousness-of-the-last-of-the-knights-templar/","cat":"1532_chambery_fire","title":"A comprehensive new theory detailing a medieval origin for the Turin Shroud: a scorching onto linen – and human consciousness – of the last of the Knights Templar."},{"id":"comment-218","author":"colin_berry","post":"See this related Telegraph article for my first MSM outing on the Templar hypothesis. I’m getting stick already from those who react first to new, unfamiliar ideas. Ah, the world of ideas – fools and academics rush in… http://www.telegraph.co.uk/education/educationnews/9229379/Pupils failing to study British history at school.html#comment 511919369.","date":"2012-04-27","mins":"5:39 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/25/a-comprehensive-new-theory-that-provides-medieval-origin-for-the-turin-shroud-a-scorching-into-linen-and-human-consciousness-of-the-last-of-the-knights-templar/","cat":"1532_chambery_fire","title":"A comprehensive new theory detailing a medieval origin for the Turin Shroud: a scorching onto linen – and human consciousness – of the last of the Knights Templar."},{"id":"comment-214","author":"colin_berry","post":"A Telegraph editorial is today making a case for children to learn the important dates in English history, like 1649 for Charles the First’s execution, and the story behind them. Http://www.telegraph.co.uk/comment/telegraph view/9228944/The date harvest.html It was an opportunity for this shameless opportunist to flag up another important date, 18th March 1314, the execution of the last of the Knights Templar, and to give wider currency to my theory re the Turin Shroud (or rather a development of others’ earlier ideas that for some reason never quite achieved lift off). Here’s what I wrote: “It’s considered that today’s Freemasons are essentially a revival of the Knights Templar who promoted and financed the Holy Crusades. That makes important the date 18th March 1314 when the last of the Templars’ worthies – Jacques de Molay and Geoffrey de Charney, were hideously slow roasted at the stake on a small island in the Seine. It’s the story behind it (see title above) that is important, or rather what ensued, which in my humble opinion, based on a close look at the Lirey Pilgrim’s badge, recovered from the Seine close to the execution spot, has evaded the grasp of generations of historians and TV documentary makers. Yes, the Lirey badge does depict bishops (with heads broken off) displaying the fabled Shroud of Turin. But the man on the Shroud looks nothing like Christ, and indeed looks for all the world like a man who has been roasted. Sorry Ian Wilson et al, but you have missed a lot of detail on the Lirey badge. No, it was not an “open tomb” between those two coats of arms. It was a barbecue – with a grill top for roasting Templars. Thank you DT for providing an opportunity for promoting my out of the box theory for what inspired the Turin Shroud. See my most recent blog post on a medieval origin for the Turin Shroud (which fits with the C 14 dating).” Link to this site Colin Berry, retired science bod (who maintains that the Shroud image was scorched onto the fabric – akin to branding livestock with a hot iron).","date":"2012-04-27","mins":"7:23 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/25/a-comprehensive-new-theory-that-provides-medieval-origin-for-the-turin-shroud-a-scorching-into-linen-and-human-consciousness-of-the-last-of-the-knights-templar/","cat":"1532_chambery_fire","title":"A comprehensive new theory detailing a medieval origin for the Turin Shroud: a scorching onto linen – and human consciousness – of the last of the Knights Templar."},{"id":"comment-262","author":"colin_berry","post":"Postscript to the above comment: immediately after placing that comment on the DT editorial, my comment was wiped (not even replaced with a “Guest – comment deleted). But that was not the end of it. Oh no. I have been blocked from sending any more comments to most of the DT’s site (the site is compartmented) What’s more, all of the previous comments I have sent the DT under my real name have been deleted in toto (with “Guest comment deleted” inserted in most cases). This is not just censorship – retrospective in this instance. It is (im)pure vindictiveness. But the DT and me go back a long way, some 6 years in fact – and aggression and vindictiveness is the DT’s way of dealing with commentators who sing from a different hymn sheet to that of the press moguls who now run and/or control that paper. I have removed the DT from my “favourites” tab. It is now the paper I look at last, if at all. If only the Times would respond to my email asking for a reduced subscription rate for those who wish only to access news and current affairs….","date":"2012-05-11","mins":"7:10 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/25/a-comprehensive-new-theory-that-provides-medieval-origin-for-the-turin-shroud-a-scorching-into-linen-and-human-consciousness-of-the-last-of-the-knights-templar/","cat":"1532_chambery_fire","title":"A comprehensive new theory detailing a medieval origin for the Turin Shroud: a scorching onto linen – and human consciousness – of the last of the Knights Templar."},{"id":"comment-209","author":"colin_berry","post":"Somebody with whom I have crossed swords before on The Other Site writes: “Thanks for the reminder that Colin Berry is completely out of his gourd. I’d almost forgotten. Also: “looks nothing like Christ – no long hair, beard” Are we looking at two different Shrouds, or is Colin so desperate to see what he wants to see that he’s managed to convince himself that there’s no long hair or beard?” Here’s a challenge for him. Print off those enlarged two images in the posting of the “Man on the Badge” and get friends and colleagues to guess whom is represented. I’d be very surprised if many, indeed any, immediately reply “Why, Jesus Christ of course”. What the Deuce?.","date":"2012-04-26","mins":"5:20 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/25/a-comprehensive-new-theory-that-provides-medieval-origin-for-the-turin-shroud-a-scorching-into-linen-and-human-consciousness-of-the-last-of-the-knights-templar/","cat":"1532_chambery_fire","title":"A comprehensive new theory detailing a medieval origin for the Turin Shroud: a scorching onto linen – and human consciousness – of the last of the Knights Templar."},{"id":"comment-201","author":"colin_berry","post":"One assumes, quite naturally, that the crossed feet on the Shroud signify the postion they were in for crucifixion – being nailed together – and held in that same postion through rigor mortis (despite the fact that rigor mortis wears off). The feet might equally well be in that position as a consequence of being roasted..","date":"2012-04-25","mins":"8:30 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/25/a-comprehensive-new-theory-that-provides-medieval-origin-for-the-turin-shroud-a-scorching-into-linen-and-human-consciousness-of-the-last-of-the-knights-templar/","cat":"1532_chambery_fire","title":"A comprehensive new theory detailing a medieval origin for the Turin Shroud: a scorching onto linen – and human consciousness – of the last of the Knights Templar."},{"id":"comment-402","author":"colin_berry","post":"Here’s a comment from Carlos on The Other Site, using a Google translate from his Spanish first: July 30, 2012 at 9:26 pm | #5 “Colin Berry has evolved, began burning the fabric with hot metal plates and now, shortly thereafter, maintained the hypothesis of light burn.Ha, ha, ha, ha. Colin end up being a defender of the authenticity of the Shroud! I’m at that point, the light burn, according to Colin Berry. Be very careful with the use of words, associating the word burn (SCORCH) HIGH TEMPERATURE only a source of ERROR. A burn is an oxidation dehydration and oxidation dehydration there produced by HEAT (high temperature), oxidation dehydration from COLD (low temperature), oxidation dehydration by a chemical CHEMISTRY (without reference to temperature) likely …….. And other ways. Lazzaro di obtains oxidation dehydration of the fibril flax ultraviolet light apparently without appreciable increase in temperature… ” In Spanish: “Colin Berry ha ido EVOLUCIONANDO, empezó quemando las telas con planchas de metal caliente y ahora, poco tiempo después, mantiene la hipótesis de la quemadura por LUZ. ¡ ja, ja, ja, ja !. ¡Colin terminará siendo defensor de la autenticidad de la Sábana! Estoy en ese punto, la quemadura por LUZ, de acuerdo con Colin Berry. Hay que tener mucho cuidado con la utilización de las palabras, asociar la palabra quemadura (SCORCH) sólo con ALTA TEMPERATURA es una fuente de ERROR. Una quemadura es una oxidación deshidratación y existe la oxidación deshidratación producida por CALOR (alta temperatura), la oxidación deshidratación producida por FRIO (baja temperatura), la oxidación deshidratación por una sustancia química QUÍMICA ( sin tener relación con la temperatura)……..y otras probables maneras. Di Lazzaro obtiene la oxidación deshidratación de la fibrilla del lino mediante luz ultravioleta al parecer sin aumento apreciable de la temperatura” Reply: I don’t recall if I have made any distinction between a light scorch and a heavy one, Carlos. But rest assured that when attempting to model the Shroud body image I prefer a light sepia coloured scorch to a heavy red brown one. OK, so some of my photographs show the latter, like those on my banner above, but that’s simply to display an image with more impact. You mention Di Lazzaro. I criticized him recently for some experiments he reported using hot coins to scorch, which he said would never reproduce the superficial image of the Shroud. My answer: well yes, if you operate at 230 degrees C, then you have arbitrarily chosen a temperature that guarantees pyrolysis of cellulose. I then stated what should have been obvious: use lower temperatures, ones that have little or no effect on cellulose, but which would pyrolyse the chemically more reactive hemicelluloses of the primary cell wall. That way you can achieve a highly superficial image. In fact, with careful control of temperature (and maybe time and contact pressure as well) one can get an image that is as faint and as superficial as one wishes. I’m afraid that coin experiment of Di Lazzaro’s did nothing to repair his reputation in my eyes after those OTT experiments of his late last year with the uv excimer laser beams, based on entirely fallacious grounds, i.e. That plain old thermal energy (conducted heat) must invariably result in excessive scorching. I repeat: one can make a scorch as light or as heavy as one wishes – that should be plain commonsense (a quality that our Dr. Di Lazzaro appears to be lacking). Forgive my plain speaking – but you too should try not to trivialize or misrepresent other people’s experimental approaches. I have shown serial thermal imprints from horse brasses as they cool down, showing how the image intensity fades progressively almost to nothing. I would not expect the faintest images to fluoresce under uv light, given they are unlikely to have proceeded to the later aromatic compound stage that one gets with higher temperatures and greater charring..","date":"2012-07-31","mins":"8:22 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/07/26/charring-fluorescence-and-image-forming-mechanisms-beware-shroudologys-junk-science-and-flawed-logic/","cat":"1532_fire","title":"Charring, fluorescence and image-forming mechanisms. Beware Shroudology’s junk science and flawed logic…"},{"id":"comment-401","author":"colin_berry","post":"This comment has just appeared on The Other Site: Yannick Clément July 30, 2012 at 1:02 pm | #2 “… The bloodstains on the cloth are a huge PROOF that the Shroud is not some kind of artistic forgery… In that regard, the body image cannot be a scorch, unless you believe that the resurrection could have caused a light scorch on the top most fibers of the cloth. If that’s an hypothesis you think is possible, then it would fit into the scenario #4 I describe in my article. But because scorched linen normally caused a fluorescence visible on UV fluorescence photos, the body image on the Shroud don’t react like a scorch, so I think it’s fair to say that this hypothesis is highly unlikely (to say the least)…” There are two entirely different points made there, both of which I shall address briefly. Yannick persists in referring to “bloodstains” as indeed do most commentators (and I’m guilty of it myself, but for different reasons – I usually enclose it in quotation marks, but don’t like to overdo it). But the chief STURP authority on ‘bloodstains’ (Alan D.Adler) found there were no blood cells visible, no potassium worth speaking of, and even an anomalous porphyrin spectrum. His response: to claim that what we see is not whole blood, but a serum exudate from blood clots (and the atypical spectrum was attributed to a novel, some might say fanciful complex with bilirubin). So why claim that the bloodstains PROVE the authenticity of the Shroud when even STURP failed to find whole blood, but instead a highly depleted fraction thereof that might be described as serum with some scanty products of haemolysed red blood cells? One cannot base a major argument for authenticity on blood when what is present is apparently not whole blood but a fraction thereof, whose presence depends on a series of hypothesised steps that release some components but allegedly hold back others. Sorry, Yannick, but you do not appear to understand the difference between fact and theory. You do not understand the rigour that is needed when framing a scientific argument. You do not understand that science works more often by disproving rather than proving. As for the fluorescence argument, you are repeating the same old mantra – that if the Shroud image were the product of scorching, then it should show the same fluorescence as the blackened charred margins of the 1532 burn holes. That is faulty logic, and can also be shot down in chemical terms (read this posting, if you have not already done so, with its references to high temperature pyrolytic products, notably those with aromatic ring systems, that are fluorescent but NOT likely to be formed at lower temperatures, ones that merely produce a faint sepia coloured scorch – recalling that the Shroud body image can be described as, wait for it, a faint sepia coloured scorch)..","date":"2012-07-30","mins":"5:52 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/07/26/charring-fluorescence-and-image-forming-mechanisms-beware-shroudologys-junk-science-and-flawed-logic/","cat":"1532_fire","title":"Charring, fluorescence and image-forming mechanisms. Beware Shroudology’s junk science and flawed logic…"},{"id":"comment-6851","author":"colin_berry","post":"Posted – just 5 minutes ago….","date":"2016-01-25","mins":"6:39 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)"},{"id":"comment-6822","author":"colin_berry","post":"Lettering on the Shroud? U shaped boxes? So how come I can’t see them on Durante 2002 images (“Shroud Scope”) despite increasing (or as I would say, restoring) the contrast? Why 3 different languages (supposedly)? Why are the claimed translations/meanings so inconsequential and yawn provoking? Why bother with such things when there are far more important issues that need addressing, like the precise chemical composition of the body image (something I’m deliberating on at present, being unimpressed with the STURP description as “conjugated carbonyls”, at least where yellow fibre coloration is concerned, given that the simplest conjugated carbonyl, acrolein, CH2=CH CHO is colorless.). Failed attempt to obtain a decent face on the doll you say? Failed attempt to get a complete face, maybe, though the part that did imprint had I thought captured a remarkable degree of detail. The flour imprinting technique is not well suited to imprinting off a smooth polymer, the flour failing to transfer cleanly and completely to wet linen despite the template being smeared with oil etc to trap flour. See the late addition this morning to my current posting, where vegetable oil is replaced with egg yolk without better result (but egg yolk and egg white performed brilliantly when imprinting off real human skin – my hand, indeed as good if not better than vegetable oil – see 3 D rendered results). My name is not uncommon in England. There’s the one you mention, there’s also Sir Colin Berry, the pathologist who’s an influential Govt advisor, and there’s a now elderly radio disk jockey too. I met another namesake at a friend’s wedding, purely by accident. None are relatives as far as I’m aware..","date":"2016-01-22","mins":"6:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)"},{"id":"comment-6835","author":"colin_berry","post":"Why not try yourself, piero? The technique is exceedingly simple, once you have selected a template of your own choosing.. What I can’t guarantee at present is that flour will transfer cleanly and completely to wet linen from all template materials and surfaces..","date":"2016-01-23","mins":"7:11 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)"},{"id":"comment-6813","author":"colin_berry","post":"The purpose of science is to illuminate – not to create an all enveloping fog of ifs and maybes. Sorry piero. Someone had to say it..","date":"2016-01-21","mins":"5:22 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)"},{"id":"comment-6849","author":"colin_berry","post":"Actually, I did briefly see a use for your wooden framework, piero, albeit in a non authenticist context. But wishing to avoid a lot of sawing and nailing, I decided to achieve the same goal using the lid off an expanded polystyrene box and a Stanley knife. The purpose? All shall be revealed in my next posting, hopefully in the 24 hours that follow this comment (new posting). Look for a King Neptune likeness in the next flour imprint (tone reversed) sporting an apparent beard that is not actually present on the template,. Sorry. I’m rather too busy right now to comment on entirely different approaches, like your proposed Pb++/H2 S model. Piero: I have to say that were I in your position, I’d be placing orders on the internet right now for what are simple chemicals anyone can buy, and checking out those ideas to see if they work in practice. I now have to go and wash King Neptune with soap and water and look at his attenuated image..","date":"2016-01-25","mins":"4:35 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)"},{"id":"comment-6815","author":"colin_berry","post":"The pear shaped head is easy to explain – some flour was left on the doll, failing to transfer from vinyl to linen. It’s possible I used to too much oil. I’ll repeat the tests with the faintest smear, just enough to assist uniform dusting with flour, and see if that gives a better result. Yes, the cheeks were well imprinted, but that’s hardly surprising, wouldn’t you say, given they are prominent on the doll, so receive more of the applied pressure from one’s imprinting hand than would the less elevated relief? Hair? Yes, I’m interested to see whether hair imprints as well as skin, and whether there would be little if anything to distinguish hair from skin in the final imprint, as per the Shroud..","date":"2016-01-21","mins":"5:49 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)"},{"id":"comment-6846","author":"colin_berry","post":"Hiya MB. I’ve just added a response to your question onto the end of this posting, together with this image from June 2012, Hope that answers your question. Blood is problematical, one need hardly say, albeit for entirely different reasons from body image. But until one is ready to put on the table a credible explanation for the basal body image – or basal blood image, as per Adler and Heller whatever – there seems little point addressing technological aspects of the blood problem in detail. Even the scientific aspects remain uncertain, given the atypical porphyrin spectrum which may or may not have been satisfactorily accounted for by Adrie’s vd H’s madder mordanting hypothesis..","date":"2016-01-25","mins":"6:53 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)"},{"id":"comment-6847","author":"colin_berry","post":"Progress update: 25 Jan 2016 Am now fairly confident that a contact image of the face would have been obtained using LOTTO (face up), not LUWU (face down) presentation to wet linen. LUWU had its attractions, since the imaging is purely a function of the pressure and ‘give’ in the underlay, there being no manual moulding. The pressure helps solve the problem of the prominent nose – it flattens under pressure! But there’s a downside to LUWU, as shown with modelling with terra cotta and doll’s head templates – the linen develops unsightly radial creases over which one has not control which would have compromised the end result. So for now at any rate the focus is on LOTTO, which is more variable in its outcome and less ideal for scientific modelling where reproducibility of results is the aim. But LOTTO it has to be. LOTTO has been piloted with the inanimate models (see above) to give promising results. But can it cope with a real human face, or will recourse be needed to a bas relief, as was considered the case by Garlaschelli with his “frottage” imaging with powders – a technology that has much in common with the one used here, except for the powder imprinting medium being on top of the linen, instead of sandwiched between template and linen? Here’s a rough and ready attempt on my part to see what happens to wet linen when pressed and/or stretched over the contours of my own face. The right hand was used to hold the camera so it’s a less than ideal result in the stretching department when one is forced to ‘let go’. It may just be possible to obtain a satisfactory imprint, provided the wet linen is pulled down tightly over the extremity of the chin and then turned underneath. That tension helps flatten the nose AND allows for imprinting of the lips. Might one have an explanation for what I’ve previously termed the “baked in chin/neck crease”? It has a small kink in the middle that some might think is the result of linen having been placed under tension and having buckled at chin level, so to speak.. As I said earlier, the direction of this project takes its cues from the results of practical modelling. There is no need or justification for rushing into full scale modelling, especially as one can be fairly certain – based on prior experience – that any results deemed unsatisfactory for whatever reason will be immediately seized upon as evidence that the basic approach is wrong. I say the basic approach is right. It’s getting the details right that is important, no easy task when there are few if any pointers from the STURP or any other previous investigations as to the kind of technology employed. Everything is basically guesswork, though driven in this instance by the (literally) hands on modelling..","date":"2016-01-25","mins":"8:48 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)"},{"id":"comment-6838","author":"colin_berry","post":"Folk in general, and commentators in particular, are of course free to do their own experiments in accordance with their own priorities. What they should not be doing is attempting to impose their priorities on me.I have my own longstanding research programme, now in its 4th year, and have my own entirely scientific priorities, centred on (a) model building and (b) asking the the right questions, guided by model building. To complete this posting I have just added a final postscript, together with new previously unpublished postings from one of my model building exercises, using a terra cotta model for the face, Here’s one of the attached photographs. I shall shortly be testing out an idea for improving the LUWU methodology. One might then be in a better position to decide whether the TS image, if as I believe a contact imprint, was made by LOTTO, LUWU or a combination of the two. That, and re opening the question of the chemical nature of the TS image (polymeric partially aromatized melanoidins, possibly with a lipid peroxidation involvement?) are MY research priorities..","date":"2016-01-24","mins":"8:35 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)"},{"id":"comment-6825","author":"colin_berry","post":"I could have given you a very detailed account of my thinking, TH, with references to the amphipathic properties of egg yolk phospholipids, notably lecitihins, the historical use of egg yolk in tempera paints pre oil paints etc etc. Given the belligerent and insulting tone of this comment, you will have to wait while I get on with MY science. Colin Berry M Sc, Ph D..","date":"2016-01-22","mins":"9:13 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)"},{"id":"comment-6828","author":"colin_berry","post":"As I say, you will have to wait while I complete MY investigations in my own good time, and as I see fit, TH. I owe you no favours. Quite the contrary in fact, given your failure to correct serious errors in your previous pdfs that have attempted to debunk my previous experimental findings and conclusions. Try doing your own open ended research, unwedded to preconceptions, and then maybe we can discuss the nature of real objective science. I do not take lessons from you, a medical practitioner, TH, on how to do scientific research. Where else have you seen a viable model for the TS body image comparable to the one I have developed with flour imprinting?.","date":"2016-01-22","mins":"9:34 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)"},{"id":"comment-207417","author":"colin_berry","post":"One thing’s for certain. It’s not haematology (US: hematology) judging by the recent reference of his to Alan D. Adler as a “blood expert”. If he thinks otherwise, he maybe needs to consult John Heller’s “Report on the Shroud of Turin”, published 1983, and read how Adler came to be co opted to STURP (post the Turin expedition!). Putting favoured resarchers, living or sadly no longer so, on pedestals out of reach of informed criticism, claiming them to be “experts” (a largely meaningless term) has no place in science. But then the individual in question is not a scientist He simply has no clue as to the ethos of science as a series of progressive approximations..","date":"2015-08-04","mins":"11:59 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207420","author":"colin_berry","post":"“I talk about those who are real scientists in one particular field and who are doing official researches in other fields.” Kindly cease the pigeon holing. Science is not about collecting Boy Scout proficiency badges. Science is a mindset. Science is a process. I seem to recall there are some 13 recognized process skills in science – hypothesising, designing experiments. Analyzing data etc etc). The first step in science is to set aside preconceptions. Not everyone is able or willing to do that, as you yourself demonstrate so clearly, while claiming to be “scientifically superior than thou”..","date":"2015-08-04","mins":"12:26 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207421","author":"colin_berry","post":"Thanks for demonstraing so clearly why you are not to be relied upon as a source of up to date scientific knowledge and insight. Apart from the fact that you have no scientific qualifications that I’m aware of, you are the epitomy of the internet know all, proving the old adage that “a little knowledge is dangerous”. If the truth be told, you don’t know the half of it, or indeed a tenth. Is there a single issue regarding Shroud science you are willing to discuss in depth? If so, say so. If not, then start listening to what others have to say, including those of us who have worked on blood, bilirubin, starch etc (while not claiming to be “experts”) instead of trying to close down debate with your impassioned and soulful rhetoric (which incidentally ain’t science)..","date":"2015-08-04","mins":"12:43 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207411","author":"colin_berry","post":"“Here I was getting rid of a troll…” Music to my ears, oh site controller, and just what shroudstory has needed for long time: internet snacks for those S.Carolina alligators of yours. ; ).","date":"2015-08-04","mins":"11:35 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207432","author":"colin_berry","post":"These I spy with my little eye hints of a Shroud like image being known but not recorded pre 1355, failing to flag up its iconic double image uniqueness are useless. Some of us prefer hard facts to this never ending stream of maybe this maybe that flummery – an instantly forgettable substitute for sound scholarship, far less hard science..","date":"2015-08-04","mins":"2:17 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207398","author":"colin_berry","post":"Dan. I’m not clear why links to my site are cluttering up your “Recent comments”. It’s certainly not intentional on my part. It’s maybe something to do with the Word Press pingback feature, which has been an enormous non switch offable irritant. It kicks in whenever one makes a link to one’s own previous postings – and now to (courtesy) links it would seem to those I make from mine back to yours. Maybe you know of a way to deal with it. As a temporary expedient I shall stop linking back to specific postings here, and simply refer to “something that has recently appeared”..","date":"2015-08-04","mins":"9:35 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207789","author":"colin_berry","post":"Maybe our medieval relics U like artisan was attempting to model what you see in this and similar artwork, Thomas, with the so called “Shroud” being J of A’s transport linen. Https://shroudofturinwithoutallthehype.files.wordpress.com/2014/12/deposition removal of transport linen.jpg?w=640&h=510.","date":"2015-08-09","mins":"2:58 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-167706","author":"colin_berry","post":"“I knew I had my evidence for painting.” You may recall, Charles, that some 2 years ago, nearer 3, I offered you my services as a co writer, handling the scientific side, which you were probably wise to decline at the time. Methinks in retrospect, with the wisdom of hindsight, you should maybe have taken up the offer. The notion that the TS image was painted is frankly a non starter, on a whole number of grounds. Its exquisite response to 3 D enhancement is just one of them..","date":"2014-11-01","mins":"2:24 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-167766","author":"colin_berry","post":"Good evening Charles. I look forward to reading your article. But unless it’s a treatise in science as well as history, I for one see no need to suspend judgement on matters to do with the image, certainly not your claim that it’s a painting of its time. Could not the ‘over flagellation’ be explained in a non authenticity model simply by supposing that the body image was so indistinct from a early stage that liberal addition of scourge marks was needed to give it “body”? Beyond that one doesn’t need to be pro authenticity to feel there is something exceptionally unusual about the TS image that frankly sets it apart from all others. Dismissing it as ‘just a painting’ is to close one’s eyes to a century or more of accumulated evidence that the image is unique, and could not possibly have been produced free hand. The Italian artist Irene Corgiat once produced a tolerable look alike with her electric pyro tool, but does it pass the 3 D test? She didn’t say, but anyone can upload it into Image J as I once did, and the result is sure to leave one underwhelmed. I’m not saying that none of the peculiar TS image characteristics are non reproducible. Some of the ghostly character of the Secondo Pia ‘negative’ plate is the result of light/dark reversal (as can be seen by tone inversion of a charcoal sketch). But the 3 D response is at best nominal probably because it’s simply not possible to achieve the same mathematically precise gradation of tone and image intensity..","date":"2014-11-01","mins":"7:46 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168152","author":"colin_berry","post":"Can you be absolutely clear about one thing, please Charles, namely the chemical composition of the artists’ pigments allegedly used for: (a) the body image b) the blood (or “blood”)? Would you say your views are the same or different from those of Walter Mc Crone’s? If as I suspect you agree with Mc Crone that the body image is red ochre (a type of iron oxide, Fe2 O3) then how do you account for Adler and Heller’s observation that it is bleached by diimide? The latter bleaches organic compounds by hydrogenating chemical double bonds.There is no obvious way that it could bleach an iron oxide. Would you agree that the question of “blood”, real or simulated, is far too problematical to be dealt with in a historical treatise? Yet so much hangs on the detailed chemistry as well chronology and art history if wishing to dismiss the TS image as merely “paint” of one kind or another..","date":"2014-11-03","mins":"5:24 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168218","author":"colin_berry","post":"Aren’t we making an assumption, Charles, namely that the image that is now in Turin was created in a single step – body and blood together – or as some might prefer to say blood (first) then body image. How do we now it happened like that. Who’s to say that a body image was not created first using hitherto unknown technology for a purpose of which we are totally ignorant and can only speculate. Being body image only it would have been totally free of blood including scourge marks. So who’s to say who the image represented if there were no signs to indicate the cause of death (crucifixion included). Who’s to say the image was not later ‘re invented’ so to speak, with applications of blood and scourge marks in all the biblically correct places? There’s an obvious objection to this, namely the blood first/image second mantra. That finding, based on the Adler/Heller protease digestion on a microscope slide has always intrigued me. Is it a sound conclusion, or might it have arisen as the result of a hitherto unrecognized artefact? We biochemists always have to be on our guard against methodological artefacts, especially when there is lots of extraneous biological material in the system under study (1st clue – see below) One hour ago, this discourse suddenly led to me to think of an explanation for why a mistaken blood first conclusion could have arisen, based on the failure to see a yellow image after digesting off the blood. I feel another posting coming on, though it might take a little time to research and write. Here’s a second clue for the chemical cognoscenti: porphyrins have a well known ‘photodynamic action’ when illuminated, either with uv or long wave visible light, generating … singlet oxygen!.","date":"2014-11-03","mins":"9:28 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168183","author":"colin_berry","post":"“So read the descriptions in my article and explain what you think accounts for the very vivid ‘bloodstains’. The number one explanation I have been given so far is paint, probably, if the vividness of the colour is taken into account, vermilion, but perhaps you have an alternative explanation, Colin?” Yes, I’ve been through your article several times now Charles, and find it thought provoking and (in places) provocative too. That’s why I was interested to hear your opinion re the chemical nature of the body image and bloodstains if, as you suggest, they were both applied freehand as artists’ pigments. (My own views on the nature of the body image and blood have been the subject of numerous postings, and are probably best kept to one side for now to avoid cluttering up the discourse). Can be confine ourselves first to the body image (blood being hugely more problematical)? The body image is bleached by a reducing agent (diimide), Susceptibility to one type of simple chemical invariably means it’s susceptible to others too, like oxygen in the air, maybe activated by light. (There are well known model chemical systems in which photooxidation results in bleaching of dyes and other organic chomophores occurs due to self sensitized production of singlet oxygen). So while the original image may have been a lot easy to see at a distance than today’s TS, one has to consider a whole range of physical and chemical options and scenarios, instead of assuming it was simply paint that had flaked off. The latter would not explain why the resistant faint ‘signature’ has the physical and chemical properties of chemically dehydrated linen carbohydrates, i.e essentially “scorch like” (even if that term was not used by STURP). Nor would it explain why a highly degraded image comes to have so spectacular a response to 3 D rendering software. Thousands of oil and water colour portraits must have flaked away over the centuries. How many have left a faint and intriguing quasi photograph? Once you take on board that the image we see today is the primary image, albeit now somewhat faded, and reject any paint flaking hypothesis that is unsupported by chemical evidence of trace contamination, then one is back where we started. Despite your historical analysis, the TS remains an unsolved scientific enigma – and that cannot be casually dismissed with scientifically flaky explanations that depend on even flakier paint..","date":"2014-11-03","mins":"7:07 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168253","author":"colin_berry","post":"Hello again Charles. I try not to assume anything – preferring to hypothesize and then see if there’s other data that fits with the new possibilities or not. Having said that, I’m not entirely clear as to the meaning of your question, or why you are asking it. When you ask if the images are as they were in 1350, which images, and based on what kinds of alteration, natural or man made? Fading? Additions? Subtractions? With or without blood? Let’s assume you mean just the basal frontal and dorsal body images. Here’s a graphic I did early last year to indicate what the present (faded) image looks like with the blood taken away – simply an image of an unclothed man without obvious wounds or scourge marks, not open bleeding ones at any rate, though bruises are not excluded. Sure, I would expect those images to have been a lot more intense 600+ years ago, on the (hypothetical) assumption that the image represents discolored intrinsic linen carbohydrates (not Mc Crone’s and possibly your flaking inorganic pigment). What I cannot conceive of is a doctoring of the post production image to add or subtract any BODY image. What could have been used as bleach? They did not have diimide. What could have been added that would have been indistinguishable from the original in every respect? Problematical to say the least. Blood is an entirely different matter, and it’s hard to imagine that some over zealous clerics have not been doing some touching up or even making serial imaginative additions over a passage of time. So my answer would be that the TS image, without its blood, including scourge marks, would have looked much the same as today’s – only more so!.","date":"2014-11-03","mins":"11:43 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168314","author":"colin_berry","post":"You appear to be saying that a crown of thorns was needed to match the artistic conventions of a particular era of history, so ipso facto must have been there at one time, so has somehow been deliberately removed without your saying how. That may be possible in your narrative, one that sees the image as painted, with general flaking off with age, and maybe amenable to selective chiselling off. But there’s no hard evidence for a painted image, Charles, and if I’m not mistaken there’s an element of circularity in your argument. (“The TS image must have been more prominent originally in 1350 to allow display to spectators viewing at a considerable distance, and since that’s not possible now, it must be due to flaking off of artists’ pigments). But there’s an alternative narrative, one that does not see the image as painted, but imprinted, whether from a 14th century template or less probably a 1st century corpse.. That image may fade with time, and indeed almost certainly does on chemical grounds (on the assumption that all things must pass, thermally or radiation induced chromophores included). But it does NOT flake off, such that it leaves no trace.One does not have to believe in the “scorch hypothesis” its widest sense to see that it provides a model for a image resistant to flaking off physically(though fading by chemical bleaching is probably inevitable). I hesitate to say this, Charles, but there’s a pre 1978 whiff about your entire thesis, You have simply failed to take on board the STURP evidence that the image is on the carbohydrate, and NOT applied with a paint brush. You seem to have bought in 100% to the Mc Crone pigment narrative, but genius though he was with microscopy and forensic spot tests etc, he could not bring to bear the range of physical and chemical techniques that STURP had at its disposal. (OK, so I’m on record as knocking STURP, but most of my criticism was directed at the pro authenticty slant of some of the findings, notably those of Adler’s (bilirubin) and Rogers’ (starch impurity coating) but NOT the central proposition that the image was due to a subtle and superficial chemical modification of linen fibres or something almost indistinguishable form those chemically (like a starch coating). Your revisionist scholarship re art history frankly fails to dovetail with the mainstream science, Charles. One of them is wrong. I know which of the two I prefer..","date":"2014-11-03","mins":"2:13 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168323","author":"colin_berry","post":"I agree with you on that score, Louis, even if I don’t accept your earlier description of Alan D. Adler as a ‘bilirubin expert.’ He was a porphyrin specialist. There’s world of difference between cyclic and linear tetrapyrroles. But don’t tell anyone I told you so..","date":"2014-11-03","mins":"2:53 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168339","author":"colin_berry","post":"Sorry to disagree, Louis, but it’s a cardinal principle of science that if a scientist is seen to be departing from strict objectivity (for whatever reason, well intentioned or otherwise), then his or her findings can no longer be taken seriously. Objectivity is a highly fragile commodity. As a general observation, the older and more prominent the scientist, the more likely it is that strict objectivity has been de prioritized. That’s maybe why universities depend on a steady infusion of ‘new blood’ research students. They tend to be less respectful towards certain ‘overriding concerns’. ..","date":"2014-11-03","mins":"3:28 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168367","author":"colin_berry","post":"But the TS is not to be seen as a work of art (even if one has no clue as to its original role). Had it been a work of art, the artist would not have been content merely to add blood. There would have been representations of wounds as well , i.e. Apertures in the skin, like nail holes in hand and feet, lance wounds in the side etc. But the body image is completely free of skin lacerations etc, and the ‘blood painters’ knew better than to rectify that omission. Why? Because it would have compromised credibility as the “real” burial shroud. The TS was NOT intended to be seen as a painting. Apart from the secondary blood additions, nothing would have been done to spoil that carefully contrived illusion. The basal body image was NOT a free hand painting. It was an imprint off a 3 D template. Sorry to have to spell it out so forcibly, but all this talk of art history is leading us seriously astray..","date":"2014-11-03","mins":"5:16 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-2979","author":"colin_berry","post":"Norman: Kindly stop using my blog to promote a novel (page turner or otherwise). I’ve already given a considered response to your first comment. So how about reciprocating with a comment on a comment – to prove you are more than a self promoting author (or agent )? Blog etiquette and all that….","date":"2014-02-11","mins":"5:58 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2014/02/11/i-spy-liftinglowering-ropes-on-the-lirey-badge-which-point-to-roasting-not-crucifixion-time-to-rethink-the-shroud-of-turin/","cat":"chain","title":"I spy (?) lifting/lowering ropes on the Lirey badge (which point to ROASTING, not CRUCIFIXION). Time to rethink the “Shroud of Turin”"},{"id":"comment-6052","author":"colin_berry","post":"I was on the point of composing a reply to your first comment, pointing out the evolution in my thinking re the TS (see my other site: http://colinb sciencebuzz.blogspot.co.uk/ ) and even the self doubts expressed in the posting above. However, noting this second comment, and your claimed/assumed 2000 year old provenance being “100%” certain when the radiocarbon dating says otherwise (if you think otherwise, then demand a recount!) I frankly see no point in composing a detailed response to your comments..","date":"2015-04-15","mins":"9:38 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2014/02/11/i-spy-liftinglowering-ropes-on-the-lirey-badge-which-point-to-roasting-not-crucifixion-time-to-rethink-the-shroud-of-turin/","cat":"chain","title":"I spy (?) lifting/lowering ropes on the Lirey badge (which point to ROASTING, not CRUCIFIXION). Time to rethink the “Shroud of Turin”"},{"id":"comment-172074","author":"colin_berry","post":"“Here the challenge is that, on the surface, it is very difficult to establish and prove there was a motive to create the TS — in the form and detail that we see. However, sometimes a detective must take what clues he has to try and build a narrative that fits those clues, in an effort to piece together a motive.” Nice fair minded comment David G, as ever. Might this short extract provide a clue as to motive? It’s from: http://shroud2000.com/Fast Facts.html The Historical Trail Fast forward to France in the Middle Ages for now because that is where the fully documented and continuous history of the Shroud begins. But there is more to the story on the Shroud’s probable history. We’ll get to that later. 1353: The Shroud’s fully documented history began in Western Europe when it was revealed by Geoffrey De Charney (sic) in Lirey, France. 1452: De Charney’s granddaughter sold the cloth to the Duke of Savoy in exchange for two castles. It remained in the Savoy family until 1982 when it was officially willed to the Catholic church although it had custodial care of the Shroud for centuries. Or am I building castles in the air? (Well, two for starters, which isn’t bad as family heirlooms go. Beats silverware any day – tarnishes)..","date":"2014-11-19","mins":"11:00 am","url":"https://shroudstory.com/2014/11/19/i-think-he-sees/","cat":"history","title":"I think HE sees?"},{"id":"comment-172052","author":"colin_berry","post":"Has there ever been a conspiracy theory up till now that showed so glacial a rate of progress? Full blown? Wild? Wooly. Give me time. Maybe I’ll be able to finger a Pope as prime instigator. Film rights?.","date":"2014-11-19","mins":"8:14 am","url":"https://shroudstory.com/2014/11/19/i-think-he-sees/","cat":"history","title":"I think HE sees?"},{"id":"comment-172080","author":"colin_berry","post":"Personally I prefer waterways to paths – more sedate progress. Am exploring a certain creek at the moment. Now then, where did I put that paddle?.","date":"2014-11-19","mins":"11:35 am","url":"https://shroudstory.com/2014/11/19/i-think-he-sees/","cat":"history","title":"I think HE sees?"},{"id":"comment-12684","author":"colin_berry","post":"I felt sure you would work in a mention of St. Raymond somewhere….","date":"2012-06-18","mins":"3:50 pm","url":"https://shroudstory.com/2012/06/17/john-the-baptist-relics/","cat":"history","title":"John the Baptist Relics?"},{"id":"comment-172155","author":"colin_berry","post":"I’m minded to make a “gift” of my childhood stamp collection to the nation, daveb. That’s to keep it safe from predators (dog, grandchildren, taxman). All that’s needed to bring me closure is a small token of appreciation, say a manor house in the west country and the latest Range Rover and it’s a done deal. Life is devoid of meaning without these selfless gestures of Christian charity, wouldn’t you agree?..","date":"2014-11-20","mins":"12:23 am","url":"https://shroudstory.com/2014/11/19/i-think-he-sees/","cat":"history","title":"I think HE sees?"},{"id":"comment-9358","author":"colin_berry","post":"“I fall back on what Pope Benedict had to say in the UK, when he was there to mark the beatification(?) of Cardinal Newman. “Faith without knowledge is fanaticism! Knowledge without faith is fascism!” He certainly knew something of the latter disease. And we have seen the general mayhem in our times that can result from uninformed fanaticism.” it’s one thing for a combative science bod to be misquoted (repeatedly) on this site, and even to find himself on the receiving end of that same (mis?)quotation above with the reference to “fascism”. But nowhere have I been able to find that Pope Benedict XVI ever made a specific reference to fascism in the context of faith and reason, or would have approved of folk attributing to him on internet forums the opinion that any deficits of faith implied a tendency towards fascism. Here’s a report from his UK visit that would seem a more credible version of the Pope’s actual words: “The heart of the speech was a pitch for constructive dialogue between faith and reason, and therefore between church and state. As he has before, Benedict argued that reason shorn of faith becomes destructive ideology; faith without reason shades off into a distorted “sectarianism and fundamentalism.” Not a mention of that f word anywhere, so Dave B’s allusion to the Pope’s own background seems especially ill judged..","date":"2012-03-16","mins":"5:18 am","url":"https://shroudstory.com/2012/03/15/maybe-the-james-ossuary-is-jesus-brothers-tomb-maybe-not/","cat":"history","title":"Maybe the James Ossuary is Jesus’ Brother’s Tomb, Maybe Not"},{"id":"comment-12688","author":"colin_berry","post":"Ron : Don’t bother Yannick, it’s obvious Colin has his sciencebod ‘nonscientific’ binders on. The fact he would even try to compare the two ‘completely different situations’ proves it. It actually is well known that materials such as cloth, linen etc; are known to be very difficult to carbon date, usually giving erroneous results. Plus the facts mentioned that the Shroud’s contamination history is not fully known, has been handled for millenia, burnt etc; escapes scienbod’s mind. One must also question the absolutely unconventional process of the 1988 carbon dating and the total lack of procedures and protocols followed, and furthermore the many questions raised by the non peer reviewed Nature paper. Considering Colin’s continuously cuttin up of other’s scientific work I have no issue in pointing out his very non scientific stance on this issue. If he is a true scientist he would agree the c14 dating done in 1988 was flawed and should be nullified till further tests can be done. R No comment, now or at any time where Ron Anon is concerned. Colin Berry aka sciencebod Retired scientist.","date":"2012-06-19","mins":"1:03 am","url":"https://shroudstory.com/2012/06/17/john-the-baptist-relics/","cat":"history","title":"John the Baptist Relics?"},{"id":"comment-12662","author":"colin_berry","post":"But it’s radiocarbon dating, so the answer can’t be right. The sample was not representative of the entire John the Baptist. There must have been contamination with modern bone. One has to look at the entire historical record of this artefact and not rely purely on just one totally discredited methodology … Oops, sorry, it’s the right age. I take back everything I just said… I say, this radiocarbon methodology has really come on in recent years….","date":"2012-06-18","mins":"4:05 am","url":"https://shroudstory.com/2012/06/17/john-the-baptist-relics/","cat":"history","title":"John the Baptist Relics?"},{"id":"comment-185922","author":"colin_berry","post":"Here are the compared images from Dan’s posting (Arquata above, TS below) to which I’ve added a little extra contrast. Once again, we see artistic evidence that the TS was viewed all those centuries ago as a sweat/blood imprint, and thus assumed to be authentic. That’s a far cry from the eccentric notion that it was originally designed and/or seen merely as a painted prop for mere liturgical use..","date":"2015-01-24","mins":"4:41 am","url":"https://shroudstory.com/2015/01/24/new-paper-on-the-shroud-of-arquata/","cat":"history","title":"New Paper on the Shroud of Arquata"},{"id":"comment-9393","author":"colin_berry","post":"As I indicated, I found myself on the receiving end of that same misquotation back in February, which you can easily confirm by googling. If you know of Godwin’s Law of internet forums, you will understand the attraction that particular misquotation holds for those who indulge in misrepresentation or ad hom as so many do on this site. Indeed, you are guilty of misrepresentation yourself, in suggesting I took the “fascism” comment personally in the present context. I did not, as a careful re read should make clear. I have responded to your earlier “bankrupt scorch theory” on my own new site (http://strawshredder.wordpress.com). As indicated previously, I no longer feel this site to be a suitable forum for discussing technical and scientific detail given the sniping, the misrepresentation, the gratuitous and offensive ad hom and, more recently, the pre moderation and threatened editing of my comments..","date":"2012-03-17","mins":"3:27 am","url":"https://shroudstory.com/2012/03/15/maybe-the-james-ossuary-is-jesus-brothers-tomb-maybe-not/","cat":"history","title":"Maybe the James Ossuary is Jesus’ Brother’s Tomb, Maybe Not"},{"id":"comment-9394","author":"colin_berry","post":"I read the full text of Benedict’s Regensburg address yesterday. Nowhere did I see any warning of reason, with or without faith, leading inevitably to fascism, and I while you cite that particular speech, best known for its references to Islam, I see you carefully omit to mention its contents. In his UK speech, it was “destructive ideology” that was mentioned, which might just as easily have been a reference to communism as to fascism, especially as the former is underpinned by the “reason” of Marxist Leninism. Did Hitler ever make appeals to reason? I thought he played mainly to people’s fears and resentments, offering easy scapegoats, leading finally to the Holocaust, which is yet another reason (apart from misquoting the Pope) why fascism should never be casually slipped into internet debates. But it is, all the time, here included – as the existence of Godwin’s Law demonstrates, verified yet again..","date":"2012-03-17","mins":"6:04 am","url":"https://shroudstory.com/2012/03/15/maybe-the-james-ossuary-is-jesus-brothers-tomb-maybe-not/","cat":"history","title":"Maybe the James Ossuary is Jesus’ Brother’s Tomb, Maybe Not"},{"id":"comment-192763","author":"colin_berry","post":"This has to be a hasty reply, Julian, since I’m about to head off to a medieval hill village while the sun is shining here on the Med. The answer to your question is a resounding YES. But has Charles Freeman still not got his head round the difference between a negative image and a mirror image? We know for certain that the TS is negative, thanks to Secondo Pia, and some assume it’s also a mirror image, based on dubious (lack of) scriptural evidence for the position of the spear wound – left or right. In fact, the negative proprties alone should be sufficient to be 99% certain (at least) that the image is a passive imprint from a shaped template (animate, living or dead, OR inanimate) , not a free hand painting or freehand anything. I’m preparing a new post right now that spells out the differences between negative and mirror images, showing that the two CAN be independent, since they arise for different reasons. The starting point will be this mock up of a rubber stamp, which will serve as my initial (pseudo)3 D template. It will then be reverse processed as per Secondo Pia, and then 3 D enhanced to a pseudo pseudo version of the original, with or without correction of the left right reversal that accompanies any IMPRINTING mechanism where the template has to be turned away from the operator through 180 degrees in order to make the imprint. The light/dark reversal occurs for entirely different reasons, needless to say, independent (in principle) from mere left right reversal..","date":"2015-03-08","mins":"3:43 am","url":"https://shroudstory.com/2015/01/24/new-paper-on-the-shroud-of-arquata/","cat":"history","title":"New Paper on the Shroud of Arquata"},{"id":"comment-192820","author":"colin_berry","post":"Posted: http://colinb sciencebuzz.blogspot.co.uk/2015/03/is shroud of turin image really.html.","date":"2015-03-08","mins":"3:20 pm","url":"https://shroudstory.com/2015/01/24/new-paper-on-the-shroud-of-arquata/","cat":"history","title":"New Paper on the Shroud of Arquata"},{"id":"comment-185974","author":"colin_berry","post":"That’s an interesting interpretation you have there, Hugh. I now have two possibilities to consider. It won’t be easy, not with present resources (Shroud Scope, 2008 BBC/Halta, Shroud 2.0) valuable though the first two have been in the past. How much longer must we wait for that high resolution 72 GB Haltadefinizione file, still under wraps according to Mario Latendresse, become available to researchers one wonders? Any chance that you could use your BSTS/shroud.com clout to get it released?.","date":"2015-01-24","mins":"11:02 am","url":"https://shroudstory.com/2015/01/24/new-paper-on-the-shroud-of-arquata/","cat":"history","title":"New Paper on the Shroud of Arquata"},{"id":"comment-185945","author":"colin_berry","post":"Colin was able to sharpen the image of the Turin Shroud. Did he try do the same with the image in question or satisfy himself with the image at hand? John: I used the image(s) that accompanied this posting, but have just repeated the exercise with those shown by Di Lazzaro et al in their paper: Note the reversal of order: the TS is now on top. I raised contrast in MS Office Picture Manager from 0 to 77 (max +100), accompanied by a modest intensifying of dominant colour by reducing mid tone value from 0 to 21 (minimum 100). I’m finding the midtone setting a handy probe for Shroud images, it giving a visual indication of chief colour component(s) by splitting the RGB mix. My earlier claim for the Halta Definizione image on the BBC’s site (2008) is two tone I now realize to be mainly the result of a strengthening of a red component in the faint sepia image achieved by lowering the midtone setting. One can see a similar effect by deconstructing “sandy brown” – a standard web shade. I’ll shall keep quiet for now about the working hypothesis that is presently being explored except to say that Ray Schneider’s Ohio conference paper is proving a mine of useful information, albeit heavy going for a mere biochemist. His references to “apparent blood” on beard and elsewhere are interesting. Http://ohioshroudconference.com/papers/p08.pdf.","date":"2015-01-24","mins":"7:37 am","url":"https://shroudstory.com/2015/01/24/new-paper-on-the-shroud-of-arquata/","cat":"history","title":"New Paper on the Shroud of Arquata"},{"id":"comment-9308","author":"colin_berry","post":"Well, if Goofy is supposed to illustrate the power of Fourier transforms, then all I can say is, “Where is the useful new information after removing the banding?” Let me think now – Goofy – what was the name of his pal? Ah yes, that explains all. No explanation I see for how an imprinted image of a crease can display on the problematical “banding” area as if it were not there. Looks like I shall have a good opener to my new site, with a classic example of disingenuous barrel scraping on the part of the Sindonology so called experts to explain away otherwise embarrassing details….","date":"2012-03-14","mins":"12:19 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”"},{"id":"comment-9378","author":"colin_berry","post":"My new site is now up and running. Enjoy… Clutching at straws.","date":"2012-03-16","mins":"3:49 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”"},{"id":"comment-9337","author":"colin_berry","post":"Still more ad hom. Here’s a sample, taken almost at random, from the science buzz site of the individual whom you ludicrously try to portray as a specialist. You could not have chosen a more inappropriate example. My record as a commenter on ALL topics of scientific interest (and the occasional mathematical one too) speaks for itself. And you – what is your contribution to the blogosphere – outwith this SPECIALIST site? How many sites have you set up? Misrepresentation is, and always has been, the name of the game here – like Dan’s claiming above that I denied the existence of banding. I did nothing of the sort. I simply said it was not the primary reason for the bilateral loss of peripheral image – and indeed Barrie Schwortz’s photo enhancement, shown above, with raising of the luminance on the B/W photograph (which incidentally is equivalent to lowering the luminance on the actual Shroud image) without the need for Fourier transforms should serve to prove my point. The Fourier transforms are being used to window dress a dud hypothesis that is full of self contradictions, like that crease I mentioned. The dud hypothesis (banding) simply attempts to preempt discussion as to the real reasons for bilateral loss of peripheral image symmetrically on both sides of the face – which is more likely a result of the imprinting mechanism, NOT the banding. Once again I must thank Dan for supplying so egregious an example for my new site of the shameless misapplication of a specialist technical tool – mathematical in this instance – one designed to make the gullible think there is “more than meets the eye” where the Shroud is concerned. It is of a piece with Di Lazzaro’s uv laser beams, which is where this NON SPECIALIST came in… Now awaiting moderation… yet another symptom of the control freak mindset which, if the truth be told, is what the Shroudie circus and roadshow is all about.. This comment will now be copied and pasted to my own site..","date":"2012-03-15","mins":"3:26 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”"},{"id":"comment-9487","author":"colin_berry","post":"Who is “colinsberry Ron”? Is this a software glitch? I had nothing to do with the above comment (but have had two comments of my own held back)..","date":"2012-03-21","mins":"2:27 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”"},{"id":"comment-7099","author":"colin_berry","post":"I’m pretty certain Dan that I had not seen that eloquent piece of writing until today – honest – but feel humbly grateful to have at least echoed some of the insights expressed… Who was it the other day who, on this site,suggested that the human brain works by some mysterious quantum mechanical process totally unfathomable to present day science, and quantum mechanics, let’s recall, is totally indifferent to Cartesian tiime and space (now that’s what I call a powerful idea!)….","date":"2012-01-17","mins":"1:11 pm","url":"https://shroudstory.com/2012/01/17/paper-chase-danusha-goskas-untitled-essay/","cat":"history","title":"Paper Chase: Danusha Goska’s Untitled Essay"},{"id":"comment-143102","author":"colin_berry","post":"Don’t you just love it on this site when folk impute to one things one did not say? (I knew the biblical account at the age of 8, and need no reminding about Simon of Cyrene)..","date":"2014-08-09","mins":"10:31 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143080","author":"colin_berry","post":"There’s scarcely any encroachment of one scourge mark on another, according to Fanti and Faccini’s mapping of 372 of them in total (see their pdf, or a link to a screen grab image in my own critique of it some two years ago). It must have taken real skill on the part of the scourgers to successfully target new unflayed skin in so precise and geometrical a fashion. One could be forgiven for thinking that the scourge marks, blood for the most part (as distinct from body image) had been applied manually to linen by an excessively neat technician using a customized hand tool There are other peculiarities, like a subset of scourge marks described as “fine cuts” when viewed under uv light to obtain a fluorescent background. Again, it’s almost as if the fabric itself had been scourged. Surely not?.","date":"2014-08-09","mins":"5:55 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143238","author":"colin_berry","post":"How would the mob have known that Jesus had been “reduced to a mess”, if indeed that was the case (which I doubt very much from the aforementioned verbal exchange between accused and inquisitor that came after, not before, scourging). Even if Jesus had been a scarlet mess of flayed skin from head to toe, much would have been concealed by the “kingly” purple robe. Might “behold the man” simply have been a ironical reference to the spoofing of a king’s apparel? But heck, what do I know?.","date":"2014-08-10","mins":"9:07 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143244","author":"colin_berry","post":"Sorry, but you’ve lost me there. Creativity is about presenting new angles that no one has previously thought of. There’s nothing in the least bit creative about showing the scourged Christ in a ‘kingly’ robe, conveniently open to reveal the blood. That’s simply one of many imaginative artistic reconstructions of the sparce on detail biblical account that you have chosen from image files to support a view that has absolutely no biblical support whatsoever – namely that the intention was to make scourging so severe (as per Shroud) as to make it appear virtually indistinguishable from a slow form of execution in its own right (which of course the Romans had sadistically perfected, and which may have misled artists to over exaggerate in the biblical scenario). From John’s account alone I interpret the preliminary scourging as having been a token gesture – possibly intended as an attempt to meet the mob’s demands halfway, a ploy that might (optimistically) have placated the rabble rousers while playing for time, hoping that a lesser but still severe punishment and humiliation might have made them drop their demands for immediate execution..","date":"2014-08-10","mins":"10:04 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143221","author":"colin_berry","post":"I was wondering what the biblical scholars here make of the account of the scourging in St.John, differing as it does from the other three gospel accounts inasmuch as the preliminary punishment ordered by Pilate came well before the latter’s final protracted decision to acquiesce to the braying mob. Pilate in fact continues his interrogation after the scourging, and despite some initial and understandable silence on the part of Jesus succeeds finally in extracting a cogent answer. “Thou couldest have no power at all against me except it were given thee from above: therefore he that delivered me unto thee hath the greatest sin.” Does that sound like someone who has been scourged to within an inch of his life, with 372 tears in the flesh no less (not counting the copious blood flows from the similarly pre installed crown of thorns)? Come on folks. Get real. Even if the TS body image were authentic, the too perfectly spaced plethora of different scourge marks has to be an imaginative add on..","date":"2014-08-10","mins":"7:15 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143265","author":"colin_berry","post":"So what are you saying, Thomas? That John was a shoddy journalist? That he was making it up as he went along? “Holy scripture”? Holy unbelievable?.","date":"2014-08-10","mins":"4:58 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143246","author":"colin_berry","post":"There’s that handy expression: “necessary but not sufficient”. Imagination is necessary for creativity, but is not sufficient. I find a brisk walk, followed by a pint of decent ale at a local hostelry helps too..","date":"2014-08-10","mins":"10:48 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143276","author":"colin_berry","post":"I selected the version from John since it was the one that seemed most at odds with the comprehensive scourging of the Man on the TS. But even with his testimony, a similar discrepancy arises when once considers the largely matching narratives, needless to say, from the synoptic gospels. Why scourge someone to within an inch of their lives if that’s just the start of a prolonged public spectacle of humiliation and torture? Do you really want the victim passing out from shock, possibly dying on you prematurely? Specifically: Matthew: scourging “by Pilate” before handing over to the soldiers. Nothing to suggest that the scourging was as comprehensive as the TS would suggest, in view of subsequent taunting with the scarlet robe, the mock kneeling before the “king” etc etc, suggestive of someone still capable of standing and indeed required to carry a cross. The reasons for Pilate administering a scourging, or maybe delegated (unclear), having stated his belief that Jesus was innocent of the charges brought against him, are not clear, and maybe someone knows the protocol. If not, I’d suggest it was merely a convention that if a Governor sent someone off for execution, even against his better judgement, then protocol demanded there had to be a ritualistic scourging, maybe for taking up the Governor’s time, possibly/probably fairly token so as not to seriously sap the victim’s strength for the further ritual still to come. Mark: essentially the same as Matthew: Pilate scourged Jesus before sending him off for execution. No suggestion that it was incapacitating. Luke:: Quotes Pilate as saying, twice, that he would “chastise” Jesus before letting him go, having found him not guilty of the charges levelled against him. It is not clear if that “chastising” took place when Pilate finally felt obliged to acquiesce to the mob’s demands. Either way, there are no grounds for thinking the chastising (a level down from scourging?) would have been anything like as severe as suggested by the TS. One gets the impression that the image of an over flayed Man on the TS is used not just to fill in gaps in the biblical account, but to attempt to seriously overwrite the consistent message from all four gospel accounts that the scourging must have been fairly nominal, so as so allow for subsequent humiliation and spectacle of the still fully conscious victim before actual crucifixion, and indeed to allow a further round of interrogation in John’s account..","date":"2014-08-10","mins":"6:08 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143336","author":"colin_berry","post":"“Likewise we cannot then expect them to give the gory details of the scourging punishment.” Methinks you have missed the point. It’s pure conjecture that scourging/chastisement, in all cases while under Pilate’s jurisdiction, ever matched either the gory scenes we see in so much art, so much imaginative speculation, or as implied by 372 scourge marks on the TS. Why would Pilate subject Jesus to so horrific a scourging, reducing him to ribbons, when he had been protesting right to the last that the accused had no case to answer? I say it was nominal chastisement, done in accordance to some or other convention, in the presence of Pilate, and perhaps his wife too, and the victim then delivered to the soldiery for crucifixion. The scourging, flagellation, chastisement, call it what you wish, was NOT carried out by the sadists who came up with the wheeze of robe, crown of thorns etc. As I say, it was under Pilate’s direct command and control, entirely separate from the gloating tormentors, no matter whose account you read, and for all we know was administered by Pilate himself (if one takes the Matthew, Mark and John accounts literally) or was to be administered by Pilate (with a question over whether it was actually performed) in the Luke account. I’m frankly amazed that anyone should suppose that Pilate would have personally delivered or even supervised the kind of brutality that is taken for granted by this site’s pro authenticity tendency. Neither can it be explained away purely by saying the NT spared us the grisly detail. One has to consider the context, i.e. Of a governor doing his level best to spare Jesus right up to the very last minute – not to go creating a gory blood spectacle in his own chambers as we are being asked to believe.The biblical account should guide shroudology, at least for those who wish to persuade sceptics of the TS’s authenticity, NOT vice versa. There are no grounds whatsoever for thinking that Pilate was complicit in having Jesus cut to to ribbons. Nobody else but Pilate ordered or applied the scourging. Repeat: the location and time sequence are vital considerations if one is to see the preliminary scourging in its proper context. Nobody bows and scrapes mockingly to a collapsed and quivering heap of raw meat. Get real folks. The scourge narrative has been hideously over hyped to fit with those hugely improbable markings in blood (all 372 of them) none of them part of the body image, and in this sceptic’s view, late additions by the narrative embellishing tendency..","date":"2014-08-11","mins":"2:39 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143344","author":"colin_berry","post":"PS: the clincher, as I said earlier, is the John account in which Pilate calls Jesus back one final time AFTER the scourging. That to me says the scourging was better described in the Luke version as “chastisement”, probably more for show than anything else, administered by Pilate himself (possibly to express his impatience and/or an attempt to elicit more informative answers to his questions)..","date":"2014-08-11","mins":"3:23 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143356","author":"colin_berry","post":"Because the body image is exceedingly faint, indeed is said to disappear from view if one gets too close. Adding lots of “scourge marks” in blood compensates for the now you see it now you don’t body image..","date":"2014-08-11","mins":"4:08 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143383","author":"colin_berry","post":"Quick reply: My narrative? What narrative? I’ve simply resorted to textual analysis, pointing out the ABSENCE of evidence, i.e. Biblical evidence that Jesus had ever been subjected to the degree of scourging we see on the TS. Mine is not a narrative, though I’ve speculated as to reasons for a conjectured non life threatening, non incapacitating chastisement. It’s more by way of a critique and a challenge, emphatically NOT an attempt to impose my own narrative. I am not anti Shroud authenticity. Starting in Dec 2011, when I first encountered that appalling excursion by ENEA’s uv excimer laser team into ‘theoscience’ with their elementary misunderstandings of basic fundamental physics and chemistry (see tail end of my latest sciencebuzz posting) my beef has been the shoddy self serving so called scholarship that underlies so much of the pro authenticity case, and at all levels (scientific, medical, historical, and now even biblical). Dan Porter can call me a dilettante if he wants to – it won’t make a blind bit of difference. One does not need to be either a specialist scholar or Renaissance Man to function as a detective or investigative reporter..","date":"2014-08-11","mins":"8:07 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143354","author":"colin_berry","post":"Thomas: thank you. As I expect you know, there are scourge marks visible on the Lier copy of the TS (1516) though more sparce than on the TS, shoulders and back especially. There are none that I can see on the Lirey Pilgrims badge, circa 1357 (?). One could claim that’s on account of its small dimensions, but an artisan who was able to show a repeating herring bone weave pattern should surely have been been able to add a few score marks to the naked figure to represent scourging. So yes, I do believe that TS Mk 1 was free or largely free of scourge marks, and was “read” i.e. Interpreted in its first Lirey showings as a relatively clean and uncluttered sweat imprint, analogous to the Veil of Veronica, with nothing to upset the squeamish. Yes, a blood coated stamp could have been used to create scourge marks. That might explain why one only sees an imprint of the “thong” between the 2 or maybe 3 lead pellets, there being no sign of thong imprints where thong meets, ie. Immediately abuts onto, the first most proximal of the pellets, relative to the flagrum handle. Maybe someone decided to keep things simple, maybe too simple, too formulaic..","date":"2014-08-11","mins":"4:01 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143379","author":"colin_berry","post":"Hello Matthias. Long time no see/hear. Wherevyerbinhidinallthistime? This is by way of a holding reply, since I’m shortly off out. I did on a posting on the Lier copy some two years ago, and have just added a couple of enlarged photos onto the end, showing what I believe to be scourge marks within the yellow boxes. Http://shroudofturinwithoutallthehype.wordpress.com/2012/07/25/faking it part 3 why do early copies of the shroud show so little evidence of the in your face blood stains we see today some wont like the answer/.","date":"2014-08-11","mins":"7:25 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143110","author":"colin_berry","post":"It’s not easy to remain calm and patient on this site, David. Look at Dan Porter’s tactics back in Feb 2012, when he circulated my ideas among the Shroud Science Group SSG. Dan was able to provoke Paolo Di Lazzaro (PDL) into doing a one off scorch experiment just for my benefit: https://shroudstory.com/2012/02/21/colin berrys idea is untenable and heat cannot produce a superficial coloration/ I responded, making no secret of the fact that I deeply unimpressed by his self serving research design .PDL remained silent, and Daniel Porter has in any case closed off comments. I have since referred intermittently to PDL’s perverse coin experiment, set up to show scorching in a worse possible light, but have been unable to elicit from him any acknowledgement of my presence as a serious researcher, at least as well qualified scientifically as he is (arguably better since his background appears to be more technological than scientific). The only reason I hark back to the past is that today I finally assembled a full riposte to PDL and his flawed attempts to refute the scorch hypothesis with what I consider bad radiation physics, totally ignoring the thermochemistry of pyrolysis (“scorching”) processes notably their endothermic nature under real operating conditions that helps protect against excessive scorching. Http://colinb sciencebuzz.blogspot.fr/2014/08/might turin shroud simply be contact.html (see tail end with my responses in blue font). I shan’t now be drawn into engaging with PDL directly, given that his understanding of basic fundamentals of physics v chemistry is in my opinion so totally off the mark..Instead I invite Dan Porter, of other members of the SSG to submit PDL’s ideas and mine to a learned scientific society for an impartial opinion. That is how confident I am that it’s my version, not PDL’s, that is the more correct of the two. In the meantime I shall try to remain calm and patient, despite continuing attempts here to write this blogger off as a oddball. At no stage in my scientific career have I ever been an oddball. Everything I say and do is based firmly on the evidence. The double/negative image of the TS is THE imperative that should have guided research directions, but which has in my opinion been largely ignored (notably by the ill focused technology obsessed STURP, obsessed as it was with dismissing a ‘painted’ image). A negative double image with 3 D enhancibility was a product of CONTACT IMPRINTING off a 3 D or semi 3 D template, for heaven’s sake, not artistic painting..","date":"2014-08-09","mins":"11:36 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143407","author":"colin_berry","post":"I find this comment totally baffling. It seems to be implying that I have some kind of axe to grind in asserting that the Lier copy shows scourge marks. Pray what might that be? If we’re agreed there are scourge marks, or representations thereof on the TS, then why not on a copy thereof? Why should the presence or absence of scourge marks on the Lier copy be an issue to divide pro and anti authenticity opinion. If folk here want the Lier copy to lack scourge marks, then I’m totally relaxed on that score. However, I’ve taken that colour version of the Lier copy, which seems a bit bright, and low contrast, and made some minor adjustments using MS Office Picture Manager. Make what you wish of the result (which I’ve added to my Lier posting – see link above). I see transverse streaks, especially on arms and legs and maybe shoulders, consistent with an attempt to depict scourge marks. One is free to differ – and as I say I’m totally indifferent on that score. My message on this posting is that it’s pure conjecture to suppose that Jesus incurred some 372 scourge marks at the hands of Pontius Pilate or his subordinates (“cut to ribbons” in common parlance). There’s simply no evidence in any of the four gospels to suggest that Jesus was grievously wounded by the preliminary scourging. Quite the contrary in fact: the John version argues strongly that he was not..","date":"2014-08-11","mins":"11:51 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143476","author":"colin_berry","post":"Methinks you are coming across now as someone who takes dogmatic positions, which in this instance can be for no sound reason, given the Lier copy WOULD show scourge marks were it to be an accurate copy of the TS. As I say, I’m not going to dwell on so trivial an issue for any longer than absolutely necessary, but it does become necessary when one encounters the reference to ‘fair observers’ implying I do not qualify for that description. I devoted an entire posting to the Lier copy some two years ago, and do not recall anyone saying my analysis lacked objectivity or was otherwise at fault. Here’s an independent source that makes a brief reference to scourge marks and the Lier shroud copy. I leave folk here to draw their own conclusions, not wishing to have my own “fairness’ further called into question by those who will brook no opposition. It’s a straight cut and paste, with no editing: i.e. The emphasized words are the author’s, not mine. Details of the Lier copy. The artist painted exactly what he saw, using only ONE paint for the body image: a dark reddish brown waterpaint, prepared following the Venetian tradition, using the white of an egg as a binder. The differences in colour intensity, are due to the application of the paint in layers. The nose and upper parts of the face and body are very dark, in time almost turned to black. The double image is undoubtedly a copy of the faint NEGATIVE image on the Shroud. Therefore, all is shown in reverse. The wounds, not correctly situated, are depicted in CRIMSON RED. Was this painted in concordance with the descriptions of the Shroud, from the hand of count de Lalaing and father Zantvliet? The wounds caused by the scourging and the thorns are almost invisible. The nail wounds are placed in BOTH palms. From: The Red Stains on the Lier and Other Shroud Copies By Remi Van Haelst, Belgium https://www.shroud.com/vanhels2.htm.","date":"2014-08-12","mins":"2:30 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143480","author":"colin_berry","post":"“There is really no case that the scourging was a mere chastisement.” Still more dogma, dressed up as sweet reason. My advice: forget about all the bloody images from medieval art. Go back to the 4 gospels, re read the highly nuanced exchanges between Pilate and the accused, and then ask yourself why flagellation inflicted by Pilate himself or under his personal direction would have been so brutal as portrayed in attention grabbing art, given Pilate’s repeated insistence to the mob that Jesus had committed no crime. There was no market in medieval times for art that showed a reluctant and half hearted flagellation: indeed it would probably have been seen as sacrilegious. We really ought not to allow our interpretation of the written account, bare though it is on detail, to be influenced by those from past centuries who felt an obligation to hype up the biblical record. (Mike M please note. That image you gave was the product of an over vivid imagination, which as I say was inconsistent with the John version, with interrogation continuing after (a tongue loosening?) flagellation..","date":"2014-08-12","mins":"3:00 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143422","author":"colin_berry","post":"Yes, all four of the gospels say that vinegar was offered, presumably as the only fluid, shortly before the end. One could reasonably suppose that it hastened metabolic acidosis and death, but apart from sounding excessively first year medical, that would suppose it had been accepted. What seems more probable is that the vinegar was an unwelcome substitute for what the victim really craved for, i,e. Plain water, so death was hastened by dehydration. One could go further, but risk being deemed “creative”, or attempting to sneak in an agenda driven narrative..","date":"2014-08-11","mins":"2:39 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143096","author":"colin_berry","post":"I have to tread warily, PHPL, having missed all the live CCTV footage on the crucifixion and its aftermath. So I have to take it on trust that there were two scourgers, not just one, and the flagrum ends flicked round the sides of the body. Looking at the video stills (Shroud Scope, F&F’s handy map) I’m still puzzled as to how 372 scourge marks could have been so evenly distributed, with scarcely any overlapping. Oh, and how someone could even lift a heavy cross piece never mind carry it any distance, having had 372 skin breaking wounds inflicted with the attendant clinical shock, loss of blood and plasma fluid etc doth pass all understanding..","date":"2014-08-09","mins":"10:01 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143415","author":"colin_berry","post":"“The wounds on the TS point to a scourging that went, at some point, beyond mere punishment. They were severe enough to stress his body to the point that he falls thrice on the way to Golgotha and then lasts but a few hours on the cross.” While I don’t claim any clinical expertise, the constant references to “vinegar offered on sponges” suggest another possibility – i.e. Deliberate depriving of water, with death being hastened by dehydration and heart failure..","date":"2014-08-11","mins":"1:50 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-1861","author":"colin_berry","post":"Yes, but despite the enlargement, look at the inferior definition and detail in those pictures Hugh. This is not just about photography, of that I am fairly certain. I suspect it is about the Cluny Museum and its curators, and have an interesting view of a (white lead ?) encrusted earlier badge that could back that up. I’ll flag up the ‘duty of ‘care’ issue later today, although one suspects the damage has already been done and is irreversible..","date":"2013-02-22","mins":"10:29 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/22/shroudie-alert-day-4/","cat":"cluny_medallion","title":"Shroudie-Alert: Day 4. Mainly about the Lirey badge, the Cluny Museum, Pope Benedict XVI and the remarkable staying power of junk science…"},{"id":"comment-1850","author":"colin_berry","post":"Hello again Hugh. Thanks, you’ve ended my lengthy Comments famine. I’ve been following your comments Over There with interest, especially today on that so called “pooled” blood in the small of the back. Sterling work that man… I knew I could rely on you to know the provenance of that image. It explains puzzling references I’ve seen to there being more blood on the face – the beard etc – than is commonly supposed. If you’re correct, and I see no reason to think otherwise, there’s been too much tinkering with the evidence. Are you going to point out Jones’s poor choice of picture – at source? Alas, I cannot, for reasons I shan’t go into. I’d be interested to hear your view on Jones’s references to “wounds” and “bloodstains” as if separate entities. Do you know of any wound on the Shroud that has its own distinctive morphology, not merely ‘presumed’ to be out of sight under a bloodstain?.","date":"2013-02-19","mins":"10:50 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/19/shroudie-alert-day1/","cat":"medieval_forgery","title":"Shroudie-Alert: Day1.Chief topic: the Lirey Pilgrim’s Badge and that enigmatic chain…"},{"id":"comment-1855","author":"colin_berry","post":"I now have similar inhibitions about leaving any comment on The Other Site, Hugh, being fearful of the ‘epicyclic tendency’ that exists over there, and its intolerance for those who view the TS as a clever and intriguing medieval artefact (until presented with convincing evidence to the contrary). In fact I was on the point of alerting Matthias over there (a kindred spirit where free enquiry is concerned) to my belief that it is not only Ian Wilson’s “blood belt” across the small of the back that started out as an imprint from a chain, but the frontal “spear wound blood stain” too. (See my 17:37 entry above). I’m confident Matthias would reflect on that heretical idea before rushing to judgement, but doubt whether the same could be said for most of the others, who will almost certainly reach straight for the Thesaurus and bottle of green ink before calling me all the names under the sun..","date":"2013-02-20","mins":"7:06 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/19/shroudie-alert-day1/","cat":"medieval_forgery","title":"Shroudie-Alert: Day1.Chief topic: the Lirey Pilgrim’s Badge and that enigmatic chain…"},{"id":"comment-215795","author":"colin_berry","post":"Really? This link suggests that Hugh is spot on. Http://www.totalmateria.com/page.aspx?ID=Check Article&site=ktn&NM=239 Copper is the most likely metal to have been used, certainly in history, to reduce the high melting point (960 C) of silver, and to make for a tougher more hard wearing end product. It’s highly unlikely that the reliquary housing the Chambery shroud would have dripped molten silver onto the linen in the 1532 fire if it had been pure silver. It requires a roaring blue bunsen flame to melt pure silver – not the sort of orange yellow flame one gets from burning timber, especially if the oxygen supply is limited. Thus the notion that it must have been a silver alloy, probably silver/copper..","date":"2015-12-07","mins":"8:04 am","url":"https://shroudstory.com/2015/12/06/ssg-member-wants-to-know/","cat":"history","title":"SSG Member Wants to Know"},{"id":"comment-145842","author":"colin_berry","post":"If one clicks on the first image in this posting to enlarge on screen, one sees that all three paintings show nail wounds in the palms, not the wrists. So what price the idea that it was the Shroud that inspired the art? What seems far more probable, indeed important circumstantial evidence, is that the “Man of Sorrows” fashion in art, arriving in the 13th century or earlier, well before the Lirey display, became adopted for the Shroud, with that blood stain on the wrist a personal touch. There’s also the small point that if the TS image had been influential in the depiction of crossed hands etc prior to 1350, then ipso facto there would/should have been something in the written record well before 1350..","date":"2014-08-24","mins":"1:12 pm","url":"https://shroudstory.com/2014/05/06/ten-reasons-to-believe/","cat":"history","title":"Ten Reasons to Believe"},{"id":"comment-27632","author":"colin_berry","post":"Some here might be interested to be made aware the existence a little known branch of scholarship, devoted entirely to the shooting down of steganography (see above). It is called, er, stengunography. Here’s an example of the genre from another site, not a million miles from this one, that was posted about an hour ago: “Merged into the dress of the Holy Mother(?) with the flask of oil, there’s that head of an elderly man. I seem to recall that has been interpreted by some as indicating the presence of God the Father. In view of the direction that head is pointing, ie. Toward the (just?) vacated shroud, I wonder if he’s not there to represent a miraculous life restoring breath from On High, and that “a” is some kind of letter that alerts the viewer to that idea of Paternal Assistance (PA for short). Just a thought. PS. Note the way the angel’s finger points straight at that “a”. And I have just found this, merely by inputting “latin word for life”, so was intrigued to see the bolded phrase: anima : “life” , “breath of life” , “the vital principle” Might that be “a” for anima?.","date":"2013-03-18","mins":"8:32 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","title":"The Curious ‘a’ in the Hungarian Pray Manuscript"},{"id":"comment-174647","author":"colin_berry","post":"“…that is my own personal perspective on ANY non authenticist narrative. Whatever value they might have in coming to any understanding of the image formation process, I consider them for the most part to be trite and superficial by comparison.” Someone is missing the point here. There is no ‘non authenticist narrative’ where the TS is concerned, for the simple reason that non authenticists do not regard the TS image as a photograph. Their interest is in knowing what it might be if not a photograph. Until they know what it is, then no detailed interpretation is possible of this or that detail, least of all a medical one, given that none of knows whether it was a real person or an effigy thereof that was imprinted. The Bucklin/Barbet autopsy reports on a faint 2 D image of unknown origin are frankly an expression, indeed assertion of religious faith, wrapped up in the language of pathology and science. The full title of Barbet’s 1953 book, the one daveb chides me for not having read, was hardly calculated to appeal to the scientifically inclined reader. There was no call for Barbet to advertise his religious affiliation in the title of his book..","date":"2014-12-04","mins":"2:24 pm","url":"https://shroudstory.com/2014/12/03/the-shroud-of-turin-is-not-the-image-of-edessa/","cat":"history","title":"The Shroud of Turin is not the Image of Edessa?"},{"id":"comment-174580","author":"colin_berry","post":"How can you describe what you see (yellow pointer?) as an “abrasion” Thomas, when it’s indistinguishable in character from surrounding body image? All one can say surely is that it’s an asymmetry in the facial features, one that cannot be readily explained without knowing the precise mechanism of image imprinting (which was definitely not photography)..","date":"2014-12-04","mins":"3:40 am","url":"https://shroudstory.com/2014/12/03/the-shroud-of-turin-is-not-the-image-of-edessa/","cat":"history","title":"The Shroud of Turin is not the Image of Edessa?"},{"id":"comment-174657","author":"colin_berry","post":"Thibault: first, one cannot attribute an asymmetry in facial features to injury unless one is absolutely certain the face is that of a real man. Templates never produce irregularities? They can, if one uses treated linen to make it more sensitive to scorching. I have been experimenting with different additives. One is white flour – but it has to be spread very evenly. Surplus flour tends to cake and produce image distortion, giving the appearance of a bad template. Compared with a photograph, the TS imprint contains little in the way of real information, due to paucity of detail, low image resolution, general fuzziness, lack of colour differences, absence of texture, lack of light directionality that precludes the kind of hints one gets from 2 D images as to 3 D relief. One can’t even differentiate between hair and skin of the TS, except by location, such is the uniformity of image characteristics. If you can see bruises, why can’t you see details like nipples, navel, fingernails, wounds (as distinct from their blood flows)?.","date":"2014-12-04","mins":"5:01 pm","url":"https://shroudstory.com/2014/12/03/the-shroud-of-turin-is-not-the-image-of-edessa/","cat":"history","title":"The Shroud of Turin is not the Image of Edessa?"},{"id":"comment-174605","author":"colin_berry","post":"“Given this level of detail by an experienced forensic pathologist whose everyday work involved examination and reports on such injuries, and would not be easily fooled by any false artifice, the non authenticist narrative can hold little interest for those informed and seems nothing more than a bizarre distraction from the truth.” You have overlooked one tiny detail, daveb. Dr.Barbet was not examining a real corpse. He was looking at the same faint 2 D negative image as you, me and Thomas, none of us (least of all Barbet) having any certain knowledge as to how it was formed., except for one thing. It is not a photograph, so cannot be interpreted as if a photograph. Oh, and one other thing daveb. Kindly spare me your hoity toity signings off. They do you no credit whatsoever..","date":"2014-12-04","mins":"7:54 am","url":"https://shroudstory.com/2014/12/03/the-shroud-of-turin-is-not-the-image-of-edessa/","cat":"history","title":"The Shroud of Turin is not the Image of Edessa?"},{"id":"comment-76481","author":"colin_berry","post":"“Colin’s cult like devotion to an idealized Jacques Molay it’s a legitimate suggestion. ” Hilarious. But you don’t seriously expect me to rise to your bait, do you Mr. Klotz?.","date":"2014-02-04","mins":"10:13 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76501","author":"colin_berry","post":"“I guess CB, you are afraid to give an honest answer to the question.” I’ve spent the last two years giving honest accounts of my thinking re the Shroud, close on 200 postings, and here you are today casting doubt on my honesty. I was posting on the details of the Lirey badge and Machy mould long before they received any attention on this site, and it was those that steered me in the direction of the Templar connection. It’s the way research works – one observes closely, taking nothing on trust, then one follows one’s nose and one’s instincts. People like you who try discern hidden motives or question one’s integrity are fortunately few and far between. My policy is to ignore. I said goodbye to you once before, following a particularly squalid attempt on your part to pretend you had something on me. I shall say it again, Mr.Klotz. Goodbye – and good riddance. I shall ignore anything that you put to me directly..","date":"2014-02-04","mins":"11:17 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76449","author":"colin_berry","post":"OK, I was sloppy. Maybe I’m having an off day. Some of us have off years, don’t we Paulette?.","date":"2014-02-04","mins":"8:37 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76517","author":"colin_berry","post":"PS. Here’s a link to my first posting on the Lirey badge (April 2012). Http://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was the shroud of turin intended as a visual double entendre with an martyred knight templar serving as proxy for the crucified christ/ It was focused mainly on Geoffroi de Charney, proposed uncle of Geoffroi de Charny, the latter being first known owner of the Shroud while at Lirey, with only passing reference to Jacques de Molay. My original suggestion was that it was a depiction of Geoffroi de Charney on the shroud (albeit as a thermal imprint off a metallic template) he having died at the stake the same day in 1314 on that Seine island as Jacques de Molay. Later came the idea that, if only for convenience, the template may have been a life size crucifix of Jesus, thus creating the ambiguity right from the word go, with or without a deliberate attempt to deceive the gullible (at least initially). But then things got out of control, once word spread that the Lirey knight and his wife were in possession of the ‘genuine’ Shroud, “brought back from the Crusades, you know”..","date":"2014-02-04","mins":"11:52 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76545","author":"colin_berry","post":"One also has to question the business savvy of someone writing a book, presumably to sell, who claims there’s no mileage in a Templar/Jacques de Molay explanation. Maybe he has never heard of Knight and Lomas, who sold their book (“The Second Messiah”) on the back of precisely that hypothesis. Indeed, I had no sooner unveiled my variant, April 2012, based on an imprinting off an heated effigy as distinct from the still living de Molay – which I happen to consider the more viable of the two options, the latter involving some quite exotic chemistry – than the site’s host here made an immediate link with the Knight/Lomas book, even to the extent of displaying the dust cover as decorative accessory. Https://shroudstory.com/2012/04/23/colin berry historybod a tale of two meanings/ Dan knew about the book. I’m sure a lot more here did as well, so the Templar link had currency long before I stumbled on it in my round the houses fashion. I don’t know what led those authors to make the initial connection but mine, as I said earlier, was arrived at by a close scrutiny of the Lirey Pilgrim’s badge. Finding nothing on the (non Christ like) figure depicted there to suggest crucifixion but rather more to suggest burning at the stake. I ALWAYS prefer to work from a secure, or relatively secure basis in fact and detail, than parachute onto a (seemingly) new area from clear blue sky. That’s why uninformed, especially back biting criticism, is simply water off a duck’s back. ..","date":"2014-02-04","mins":"3:42 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76445","author":"colin_berry","post":"You must surely be aware, Paulette, that every scientist “makes things up” before doing research, real research that is. It’s called hypothesizing. One then goes into a different mode (objective tester of a hypothesis, imagining that it had come from someone else, and then attempting to shoot it down). Or are you suggesting that research is best left to automatons? The latter are not noted for generating original ideas. Those who can do… ; ).","date":"2014-02-04","mins":"8:26 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76437","author":"colin_berry","post":"Yes, I’m more and more inclined to the view that is was fabricated initially as the (symbolic) shroud of a slow roasted Templar, maybe Jacques de Molay or Geoffroi de Charney. Thus the one off resort to pyrography, aka scorching, an imaginative ploy on the part of a medieval graphics artist. In fact, I attempted almost a year ago to fit the differences between the Lirey pilgrim’s badge and the (earlier? later?) badge produced from the Machy mould. Http://shroudofturinwithoutallthehype.wordpress.com/2013/02/28/shroudie alert day 11 emeritus pope benedict xvi what is one to make of his devotion to the shroud despite that radiocarbon dating/ Here’s a key passage: 09:40: I’ve spent the last half hour looking closely at the mould for a Lirey badge – the one now (fortunately) in the possession of scholar Alain Hourseau. If I’m not mistaken there’s a strong clue as to how the non Christ like image of the Man on the Lirey badge was gradually melded with that of the Man on the Shroud to identify BOTH in the minds of pilgrims as that of the crucified Christ. How was that achieved? It was very very clever. It was done by adding a third image to the Lirey badge (Mark 2, Mark 3?) of a facecloth, but not the Oviedo type one, with blood only, but a recognizable Christ like face (not dissimilar to the Secondo Pia reversed image!!!!). This gets more interesting by the minute. Back later. The above was based on the view that “suaire” in French is not strictly speaking a shroud, but a face cloth – thus the allusion above (no more) to the Oviedo facecloth, but what I had in mind was an attempt by the proto Madison Ave Lirey team to unite in people’s minds the separate biblical references to both shroud and facecloth via badge to badge image morphing, thereby pulling off one of the most spectacular marketing coups in history. (Oh, as an afterthought, if Joe Marino is reading this, I shall be researching my files on Ray Rogers’ wilderness years post 1988 up to 2000 to see if I can substantiate that possibly mistaken claim for him to have been piqued re the radiocarbon dating. I need to pin down precisely when the 78 sticky tape “image ghosts” morphed (that word again) into “starch impurity coatings”, inspired by references to Pliny, that marking his descent I consider into non covert authenticism)..","date":"2014-02-04","mins":"8:09 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-28150","author":"colin_berry","post":"Postscript: here’s a link to a paper I co authored on bilirubin and novel derivatives thereof in 1972 http://www.sciencedirect.com/science/article/pii/0006291 X72906171 Note the use of chromatography and mass spectroscopy to (cautiously) assign tentative chemical structures. Now here’s a challenge for TH. Show me a single reference to Adler or Heller ever having used any kind of chromatographic technique to separate claimed “bilirubin” from Shroud blood, or mass spectroscopy to confirm its identity? Here’s another question: what firm conclusions could either of them have drawn simply from doing colour change spot tests with Ehrich’s or other diazo reagents, or from fluorescence under uv light? Remember that centuries old blood does/did not behave like modern blood, requiring an aggressive reagent (hydrazine) simply to get it into solution. Adler, a porphyrin specialist, did not even investigate the atypical porphyrin spectrum of Shroud blood using structure identifying techniques then available, notably mass spectrometry. He straight away dreamed up a complex with bilirubin, claiming “extraordinary” levels of the latter, despite its instability to light and oxygen (exploited in the phototherapy of neonatal jaundice, my first postgraduate, research project), Has TH ever seen a figure for that billrubin? It’s certainly not in his ‘Orphaned Manuscript’ account hat concluded with his remark that he had stumbled across something that had been wholly unpredictable when he set out to investigate Shroud blood. Shame he didn’t use the tools of the trade, so to speak, which I and others in a related tetrapyrrole field regarded as essential. Hard data is a scarce commodity in Shroud science – the lack of which has permitted far too many agenda driven individuals to build their houses of cards that end with science morphing into theology. Science is science. Try merging it with anything else, forcing it to conform with the latter, and it ceases to be science. It becomes pseudoscience. My remit as a blogger is simple I am against pseudoscience in any shape of form – wherever it shows its face in the media. Sir Paul Nurse, the President of my country’s Royal Society urged scientists not so long ago to speak out against pseudoscience. I didn’t need to be told. I have been doing that for several years – on matters as far apart as fad diets and climate change. The Shroud is just one of many instances – but disturbing in the way that pseudoscience is increasingly being used to debunk and defame real science and to demonise those who are considered off message. One has only to see the scatological comments appearing right now – ones that the site host allows – while in the same breath claiming he wants his site to be seen as sceptic friendly. Cue schoolmasterly lecture, claiming that the serious charge of disseminating pseudoscience is ‘ad hom’. It isn’t, and in any case, it is unreasonable to expect a sceptic to be scrupuloulsly polite to anyone perceived as systematically peddling pseudoscience, especially those who make no secret of having a theological agenda. I repeat: science is science. There is no such thing as theoscience..","date":"2013-03-23","mins":"4:34 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28094","author":"colin_berry","post":"If TH cares to enter bilirubin into his favourite search engine, along with any of the following surnames, he will quickly see that there was a thriiving interest and literature on that bile pigment in the 70s long before Adler and Heller began floating their uninformed ‘off the wall’ ideas, now quoted on this site as if brought down from the mountain on tablets of stone. Try these for starters: .Mc Donagh, Lightner, Bonnet, Schmidt, Billing, Cole, Lathe, Stoll, Heirwegh, Blankaert, Ostrow, Odell. And quite a few others, most of whom I either met, collaborated or worked with. Will that do, sir?.","date":"2013-03-22","mins":"5:12 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28108","author":"colin_berry","post":"The purpose of a site such as this should surely be to SUMMARISE what others are saying elsewhere. Since when has there been an obligation for bloggers to be required to provide short summaries on request or demand, having to compress what they may have argued closely and at length, just so the Thibaults of this world can post their knocking PDF’s here (top right) with no facility for leaving a comment? On yer bike (or Mobylette)….","date":"2013-03-22","mins":"6:32 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28063","author":"colin_berry","post":"What, no allusions to intimate anatomy today Mr Klotz? Has the site’s host asked you to tone down your line in personal insults? (Nope, didn’t think so). As for embracing laser beams, monkey to the ENSA organ grinder, you may well regret the decision to hitch yourself to a falling star. Reminder: laser beams were entirely a man made creation, taking no cues from the natural world. It requires very special hardware, with precise geometry to generate energetic coherent light, capable of scorching linen (impinting a life size image of a man adds another order of magnitude of difficulty, never mind input energy). Odd don’t you think that agenda driven pseudoscientists such as Paolo Di Lazzaro have to fall back on a 20th century box of tricks to make their fantasies appear half credible, or in your case the kind of fraction that is best converted to a decimal, with lots of noughts after the decimal point..","date":"2013-03-22","mins":"11:55 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28207","author":"colin_berry","post":"I am not just a “critic”, TH. I am a retired scientist/science blogger with well over 150 postings on the TS alone in the last 14 months, quite a number of which have been devoted to the details of Adler’s work. Have you read them? If not, then why not? In any case, while I hesitate to say it, I do not regard this forum as a fit place to discuss the finer technical details, given the hostility that exists here towards sceptics, and the kind of language and backbiting that is permitted here. I also consider that your attack on the scorch hypothesis (viz.your pdf) was not just badly conceived, in view of the unsuitability of the template, but the lofty manner of its presentation too, with your total ignoring of my work with bas relief templates, the 3 D imaging, the evidence for superficiality etc .Why say to the site’s host that you want me especially to look at your work, when you cannot even bring yourself to acknowledge my existence within those many pages, far less my original researches? Why do you imagine that simple light microscopy allows you to reject scorching when comparing a newly acquired scorch from your crude template with one that is centuries old and been subject to much handling and several insults? The final, totally uncompromising conclusion of yours betrays a degree of pomposity the like of which I have rarely seen in any research monograph Until you are willing to get down off that high horse of yours, and cease making your insistent demands for this or for that, then you are right – there can and will be no ‘fruitful discussion’. There is blogging etiquette and there is scientific etiquette, and I have to say you have failed to impress so far on either of those counts. That is my final word to you on this site. You know where I can be found if it’s real science you wish to discuss, divorced from irrelevant side issues..","date":"2013-03-23","mins":"5:54 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28245","author":"colin_berry","post":"Planet Earth calling Yannick Clément: Look at the epsilon and other stains. Look at their colour and intensity relative to body image. Look in close up at the way the densest pigment is congregated along the ribs of the weave. Do they look like Adler’s wishy washy “serum exudates” to you (even if that conjectural serum had acquired some haem from leaking erythrocytes in Adler’s “retracted blood clots”? Or do they look like something much closer to whole blood? I know what I think, using the evidence of my own eyes. Advice to Yannick: you too should start using your own eyes – and cease endlessly parroting those fallible individuals whom you unwisely hero worship from morning till night..","date":"2013-03-24","mins":"2:41 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28291","author":"colin_berry","post":"“If you don’t want to trust the judgement of these experts, what can I do about it??? ” Sorry, but with those few words you show that you simply don’t have the first clue about science, Yannick. Fleischmann and Pons were both considered experts before publishing their (non reproducible) papers on cold fusion. One can be an expert in interpreting existing knowledge, but be totally hopeless at contributing new science. Scholarship and original science are NOT necessarily one and the same thing. My advice to you is to stick to what you are good at – library and internet research. Scientific research requires unique and specialist skills that are not easily acquired – not without long training in the school of hard knocks. – like seeing whether one’s hypotheses ultimately prove fruitful – or , as likely as not, go onto that great heap of beautiful ideas that were destroyed by one ugly fact. Pseudoscience can be about publishing before having properly tested – either because the idea looks too beautiful to be wrong, or one is pursuing an agenda, whether aware of it or not..","date":"2013-03-24","mins":"6:42 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28288","author":"colin_berry","post":"TH: I am not a poster of pdf monographs. I am a blogger who reports his thoughts and researches as they come. My blog describes a journey – one in which I have attempted to make sense, day by day, week by week, of what has been described as the most studied artefact in history. Blog postings invite comments. Pdf monographs do not… So will you, haughty Dr. Monographer, kindly desist from pursuing me from pillar to post,? (Or should that be post to pillory?) If you have objections to specific points, then state them here – as comments – or on my own site if highly technical. I re read that monograph of yours today. You need to distinguish between scientific principle and technical detail. You need to consider heat convection as well as conduction (it being one of the three mechanisms of heat transfer). You then need to consider how technical detail might produce a variety of different outcomes, with no breach of scientific principle. Factors like cloth on top v cloth underneath template, presence or absence of underlay, dry or damp, contact time and pressure might alter the nature and subtlety of the image. At least we are agreed one one thing – the slightest air gap results in no image – at least with brief contact. So why are you making the contact/conduction model your primary target? It’s the radiation models with those agenda driven ‘miraculous flashes of light’ that should be addressed in the first instance,. That’s assuming you wish to be taken seriously as an objective scientist. Or maybe you too have a soft spot for the agenda driving all those radiation models? If so, then dream on – but kindly don’t waste your time and mine with those pretentious self serving monographs that invite no comments or criticism….","date":"2013-03-24","mins":"6:01 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28294","author":"colin_berry","post":"Again, you are quoting the findings of your favourite Shroud expert – but I doubt if you had heard of that chemical kineticist working on explosives before his being recruited to STURP. Yes, he was a gifted chemist, and using his pyrolysis mass spectrometry was able to detect that hydroxyproline you mention in blood. But as I have said previously, he straightaway assumed it was a marker for human blood, and that it could be used to differentiate between heated and unheated blood (let’s not go into detail on that). Shame then that he did not consult with biochemists and haematologists. Had he done so, he would have learned that one expects only the tiniest trace of hydroxyproline in blood, it being a marker for connective tissue, notably collagen.The presence of connective tissue is evidence that Shroud “blood” is not simply blood. I would not expect you to know that, but by the same token you should not expect this retired biochemist to be rendered speechless by your reciting the claims of an explosives chemist who frankly was way out of his depth – to say nothing of field of expertise – when dealing with centuries old stains that may or may not be authentic blood. Even a virtuoso physical/organic chemist can only do so much when confronted with aged degraded biological material… Blood first? Maybe, maybe not, but the jury should still be out on that one, given the paucity of rock solid evidence…. Personally I think the “blood” came from a leech (the latter providing connective tissue and hydroxyproline) and that the image preceded blood. Both those ideas as testable in principle – so are scientific even if new methodology needs to be developed. Cue hollow laughter when one read not so long ago a claim from the Vatican that Shroud authenticity was not falsifiable. Oh yes it is – like showing that the blood came after the image, and/or is loaded with leech connective tissue and specific immune markers..","date":"2013-03-24","mins":"7:23 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28317","author":"colin_berry","post":"Yannick Clément : What speak very loud to me Colin is the fact that Barbet, well before the STURP direct investigation of 78, was already claiming that the bloodstains on the Shroud were caused by exudates of blood clots (i.e. Not composed of complete blood) and was also already claiming that there was probably halos of clear serum around each stains, which were both independtly confirmed after the investigation of 78. In sum, the STURP investigation “only” confirmed the ideas described by Barbet during the 1930s. Note that, for Barbet, who saw the Shroud outside the Basilica of St John the Baptist (in sunlight) during the 1933 exhibition, these stains could not have been caused by anything else… After this public showing of the Shroud, that was an evidence for him and, guess what, his profesionnal impression was later confirmed by 2 independent experts in the US and in Italy. Why putting such a strong result into question Colin? Again, I urge you to use the evidence of your own eyes (and that of Durante’s HD images in 2002, available on Shroud Scope). The bloodstains on the Shroud do not look like a serum exudate. They look like whole blood. In fact they look better than whole blood. They have a sludge like look, almost as if applied like paint with a roller, so that there is a striation – an alternation of light and dark, corresponding with the ribs and furrows of the herringbone weave. Look closer at most of the bloodstains and you can see evidence of blood having flaked off in the past – with areas where it is still in place, and other usually larger areas where there is only a faint patch to show where it was originally. The clincher is the presence in the otherwise denuded areas of tiny bits of dense pigment in pits and crevices where it has hung on, resisting detachment. If there is substantial amounts of serum (which I doubt, given the paucity of potassium) then it is under the bloodstains, and still in the denuded areas that are now a very faint pink. The notion that the major .’bloodstains’ represent a serum exudate (i.e. A high ratio of fibrinogen depleted plasma proteins relative to haemoglobin) is a complete figment of those people’s imagination. There is far too much “sludgy” red pigment (‘haem’) for that to be the case. The “serum exudate” idea conveniently fits a certain narrative that tries to account for why dried blood clots might transfer to linen with extraordinary precision, homogeneity and efficiency, looking for all the world as if had been whole blood that had trickled down the linen itself – instead of skin or hair many hours before. That idea is TOTALLY at odds with the evidence of one’s own eyes. So how could Barbet, and then Adler and Heller have got it so wrong? I cannot speak for the first, but I can for Adler/Heller. Despite being called members of STURP, neither went to Turin in 1978, neither saw the Shroud with his own eyes. Both were content to work with scrapings or individual fibres that had been detached with sticky tape and handed over thousands of miles away. I’ll say no more about the ‘science’ except to remind folk that each and every scientist has a (potential) dark side where creativity substitutes for hard evidence in the final write up.. Yes, that’s a euphemism… As for Adler and Heller being called members of STURP – that’s bizarre – and a major management failure!They were no more members of STURP than the radiocarbon dating laboratories. In fact the latter have a better claim to being described as STURP, or STURP Mk 2, or Honorary STURP. At least they went to Turin to see the Shroud with their own eyes. I bet they would not have described the in situ appearance of those bloodstains as a ‘serum exudate’. It’s time that term ‘serum exudate’ was banished from the Shroud literature….","date":"2013-03-25","mins":"5:35 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28366","author":"colin_berry","post":"Linen has some 8% of moisture that would need to be vaporised before scorching could occur. That moisture will be turned to steam by the hot template – superheated steam. There will be additional steam and other gases/vapours from the pyrolysis of carbohydrates. Two points: firstly the transfer of heat by gases (or liquids) as distinct from immobile solids is convection, so there will always be a convection component when pressing hot metal into linen, in addition to conduction. Second – the conductive properties of cellulose become somewhat academic given the passage of superheated steam at high speed through the weave to the reverse side of the cloth. One has only to use a damp underlay to see how much heat is rapidly transmitted to that underlay, which can be seen and felt in the form of rising steam and the underlay becoming painfullyhot to the touch. How strange that I had Paolo Di Lazzaro claiming (wrongly) that it was impossible to scorch the topside without scorching the reverse side too, now to be told that the conductive properties are so poor that any scorching can only be confined to the immediate environs of the template. I believe that the combination of conduction and convection can account for the scorching being primarily on the parts of the weave in direct contact with the hot metal, but with some encroachment of the scorch into the oblique threads diving into the weave – probably due to the effect of hot gases. Further evidence comes from placing linen into a fan oven at temperatures that are too low to get a rapid contact scorch – the linen gradually browns in a situation where the mode of heat transfer is almost entirely by convection. So as far as convection is concerned, it is most definitely not a dreamed up component – it is something that cannot be avoided, since the steam and other hot gases has to go somewhere, and with a solid metal as template, the main exit route will be through the weave into the underlay. That’s in my set up, pressing the template downwards into underlay. In your geometry, with cloth stretched over template, there is still a convection component, since the gases can then rise naturally by expansion and buoyancy. As I say, there’s no avoiding convection, even in a model in which the prime mechanism of imprinting is conduction – with convection providing some of the subtlety of the image, softening edges, and even generating that faint reverse side image in some instances. As already indicated, there is a sludge like appearance of the blood on that herringbone weave – hardly what one would expect from soluble haemoglobin that has leaked from retracted blood clots. Anyone wanting to claim that the colour was due purely to pigmented serum (highly improbable in my view) should at least have some evidence that it is serum, e.g. By showing that albumins are present, but NOT fibrinogen. I was pleased to see the robustness of your comment regarding radiation. So why was that not mentioned in your pdf? Barring Maillard reactions, for which there is simply no evidence (failure to detect reducing sugar and/or extra nitrogen) the conventional wisdom is that some kind of radiation produced the image – a model that is strongly promoted by Jackson’s Shroud Center. Few dispute that the image has the appearance and spectral properties of a heat scorch, due to chemical dehydration of linen carbohydrates, So how come it is my conduction/convection model that gets all the critical attention, as if I were proposing some wildly improbable kind of physics or chemistry, when it is in fact common knowledge that hot metal leaves an imprint of its own shape on linen,? Why were the major plus points not mentioned, namely the fact that contact imprinting explains the negative character, the non directionality, the ability to get 3 D enhancement, the ability to get a scorch that is as strong or faint as one wishes, simply by altering temperature, contact pressure etc? Anyway, I have written and posted my letter to the Royal Society, and regardless of its policy line if any on the Shroud, still to be established, I shall follow up if necessary by asking iif any of its Fellows knows of, or could devise a test for contact scorches – physical, chemical or both. It’s incredible that there is scarcely any information worth speaking of on the Shroud image, beyond some reflectance spectra, spot tests etc. Yet mention a conduction scorch and scorn is heaped upon one, the worst of which has come from Paolo Di Lazzaro and John Jackson, but with you not far behind TH..","date":"2013-03-25","mins":"6:22 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28333","author":"colin_berry","post":"It’s customary in science to provide experimental demonstration of any straightforward hypothesis. In this instance we seek evidence that a dried on blood clot can transfer so much haemoglobin to linen via “clot retraction and serum extrusion” as to form a stain that looks for all intents and purposes as if it were whole blood. I’m sure that with your extensive knowledge of the literature, Yannick, you’ll be able to provide a link to the experimental confirmation that one seeks. If you can’t, then I’ll be forced to repeat my original request/demand – namely that we should get this narrative embellishing, intelligence insulting, pseudoscientific twaddle out of the literature….","date":"2013-03-25","mins":"11:04 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28341","author":"colin_berry","post":"There must be easier ways of doing this narcissism thing (180+ postings to date – only a relatively small number of which, not surprisingly, have been showcased on this site). Ever heard the origins of the word “blog”? Like, you know, weblog – a running account in real time of some interest one has picked up, and wishes to communicate to kindred spirits? Oh, and I do have other interests you know (current affairs, the EU, UKIP, Stonehenge, climate change, nutrition, astronomy etc etc). There’s no obligation to read, you know, if the ideas expressed are not to your liking… There are millions of other blogs out there you could visit. Or there again, maybe my iconoclasm has sown a seed of doubt, and you just can’t tear yourself away….","date":"2013-03-25","mins":"12:55 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28336","author":"colin_berry","post":"Are you familiar with the expression: “make a cogent argument”, Paulette? Adler did NOT accompany the STURP team to Turin (and should have done!) but may have done so much later. Would you care for a link or two? Yes, I have hypothesized that it was leech digesta that was used, probably in the 12th/13th century, to paint the Shroud, based on bloodstains looking too concentrated and sludge like to be ordinary runny blood, explaining why the stains are deficient in potassium ions (because leeches dispose of plasma and its electrolytes), the atypical porphyrin spectrum (long residence in the leech gut with bacteria etc causing chemical modification) and the practical advantages of using blood that will not clot (leeches secrete an anticoagulant called hirudin). Yes, it’s just a hypothesis, Paulette, but one with a difference: it is easily testable, which makes it a scientific hypothesis. What’s more, I am more than willing for that hypothesis to be tested tomorrow, Vatican/Turin custodians permitting, even if the result proves negative and I end up with egg on my face.That’s the difference between me and STURP’s prima donnas – I’m not on an ego trip, merely interested in seeking answers to the Shroud “enigma”. I learned yesterday that my first research employer in Philadelphia sadly passed away in Seattle in January. He was described in his obituary as a “yellow giant” – probably googleable a reference to his immense bilirubin expertise. For some 12 months in 1971/72 I had tried to persuade him that his explanation for why phototherapy for neonatal jaundice works so efficiently, and by a peculiar effect that he himself had discovered (excretion of “unchanged” bilirubin) was not the right one, and that bilirubin had probably isomerised under light to a more polar, more easily excretable form. But he was too wedded to his hypothesis, and it was me who turned out to be correct, thanks to the work of another group based in California. Scientific genius? Nope. I just worked systematically through the evidence, doing some simple experiments, eliminating this and that, until I was left with photoisomerism as the only likely answer. Fortunately I managed to work that idea into a different paper on which I was chief author (published BBRC in 1972). Just as well, since he failed to mention mine in the big write up. That’s also how I operated with later research projects (resistant starch etc) and with the Shroud – by a remorseless process of elimination. I would hope that you as a science teacher would recognize the patient, non glory seeking systematic approach when you see it. Have a nice balance of the day….","date":"2013-03-25","mins":"11:56 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28346","author":"colin_berry","post":"“Colin say : “Adler did NOT accompany the STURP team to Turin (and should have done!) but may have done so much later. Would you care for a link or two?” But what about Baima Bollone Colin? He was a true expert in forensic science and HE WAS THERE IN TURIN IN 1978 WITH THE STURP TEAM AND SAW THE SHROUD UP CLOSE AND PERSONAL! I would like you to address that fact…” Sorry, I just can’t cope with the killer arguments appearing on this site right now (first Yannick, then Paulette, then Chris, then Yannick (again, and again, and AGAIN and AGAIN …) Should anyone care to discuss the science, they know where to find me (click on username). As the Telegraph’s Tom Chivers said a year ago, following that ludicrous ENSA Pope pleasing stuff with uv laser beams, scorching at best a few fibres on a handkerchief: “The Shroud is fake. Get over it.” (Shroud Mk1 was probably not a fake, more likely a grim post 1314 political statement, then subsequently re cycled and Christianized, all for the benefit of fee paying pilgrims – but why bother with the details of sinister French medieval history here?).","date":"2013-03-25","mins":"1:27 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28350","author":"colin_berry","post":"Yawn….","date":"2013-03-25","mins":"2:32 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28281","author":"colin_berry","post":"Science v pseudoscience is not a simplistic ‘us versus them’ thing. It is about previously respectable scientists moving over to the dark side. It’s about the nature of creativity, of hypotheses properly tested or immediately peddled as gospel truth. White chalk on a black background seems appropriate for conveying the idea of a light versus dark side..","date":"2013-03-24","mins":"3:02 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28446","author":"colin_berry","post":"Further to what I was saying Daveb earlier, I would maintain that much of the so called mystique of the Shroud is manufactured, or ‘all in the mind’, conveniently supporting a narrative. That is true of the body image being claimed to be far too superficial to have been formed by any known physics (so self evident that nobody bothered to check). Now we see the mystique manufacture continuing with blood that is not really blood, but merely a serum exudate from a retracted blood clot (that again just happens to support a particular narrative etc etc). Has anyone ever dared to see whether experimental serum exudate transfers applications to linen match up with those striking HD photographs of Shroud bloodstains? You know, the ones that show highly superficial blood – preferring one part of the herring bone weave to another, thus emphasizing the weave pattern, almost as if something with a paint like consistency had been applied with a roller or swab and stayed mainly on the surface, as distinct from soaking into the weave. So there’s an alternative narrative – one that says that far from being highly diluted haemoglobin, it was just the opposite – highly concentrated, tending to stick to the first bit of linen with which it came into contact, instead of migrating into the weave., sludge like instead of a mobile runny liquid. What can one man do, confronted with so many instances of what without any shadow of doubt is agenda driven manufactured mystique? Methinks that letter I sent the Royal Society yesterday was far to restrained. I should have told it the way it is… Shroudology is based on nothing more than decades of carefully manufactured mystique. Thanks Dave B, thank TH, for crystallizing my thoughts, and making me think of a nice alliterative tag that sums up the name of this particular strain of pseudoscience – manufactured mystique….","date":"2013-03-26","mins":"5:48 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28417","author":"colin_berry","post":"To anoxie (no reply tab on her most recent comment) No fan or ventilator is required to produce a powerful convection current. The conversion of liquid water (or fibre bound moisture, which amounts to the same thing) results in evaporation, with a HUGE increase in volume as liquid water – > water vapour, aided by the Charles’s Law volume increase over and above 100 degrees C when there is actual physical contact between hot template at 200 250 degrees Celsius and the moisture containing linen (and let’s not forget the extra steam and gas that comes from the pyrolytic dehydration and subsequent scorching of linen carbohydrates). That superheated steam then rushes through the interstices of the weave to the other side. In other words, we ARE dealing with convection, even if it’s secondary to what is primarily a contact/conduction model. It wasn’t till I switched to a hands on approach that the convection aspect became apparent – through seeing the expulsion of steam, and discovering the hard way j with those hands and their nerve endings just how hot the damp undercloth had become. In fact, it was the observation that heat was being transmitted to the underlay far more speedily and efficiently than one might have expected from conduction alone, and was making the template stick to the underlay through heat fusion, with excessive reverse side discoloration too, that I realized the need to dampen the underlay. That then creates a heat sink for the surplus heat, mainly convected as distinct from conducted and helps prevent reverse side scorching. (Are you reading this, Paolo?) There’s a moral there somewhere – always do the experiment – it can expose gaps in one’s theory. In this case the gap was in describing the model as contact/conduction. It is not: it is contact/conduction/convection. Or as you might prefer anoxie: contact/primary conduction/secondary convection..","date":"2013-03-26","mins":"1:20 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28474","author":"colin_berry","post":"Your original question was “Colin, would you kindly please present your findings or result of your experiment (must be photographic negative image) so that I can make a comparison between yours and the photographic negative image of the shroud? Right now I don’t care about the blood. I just want to see the image.Thanks”. I responded to that in some detail, and what do I get for my trouble? Something you should have said at the outset, namely that for you the Shroud is a spiritual comfort, one that defies and transcends image analysis or any other scientific investigation, making the latter irrelevant in your worldview, So why make out initially that the detail was important to you? Has it occurred to you that you are doing a fairly good imitation of the dreaded internet time waster – and one moreover with what looks suspiciously like an anti atheist hang up. (You’re not related to David Rolfe by any chance, are you?) Theology is of no relevance whatsoever to whether or not the Shroud is what some of the regulars on this site claim it to be, citing (or as often as not, parroting) so called scientific evidence i.e. That it is the actual burial cloth of Jesus of Nazareth. If two people agree to fight a duel with sabres called science, one doesn’t expect one of the combatants under pressure to suddenly pull a gun called theology..","date":"2013-03-27","mins":"4:43 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28384","author":"colin_berry","post":"Forget about the charcoal, Donn. That was used in my first experiments to demonstrate that heat/light radiation might just in principle (thermostencilling) but only if an opaque pigment such as charcoal were present – and much else besides (converging lens etc) Rather then give a lot of links, why don’t you simply put (shroud medieval scorch) into your search engine, and locate the site that has ‘withoutallthehype’ in its URL. Then look at the banner. The first picture on the left is the 3 D enhanced Shroud negative. The next three show how that can be modelled by scorching an image directly from a 3 D bas template (a trinket I brought back from W.Africa) but if you put ‘horse brass’ into your search you’ll get a lot more end results using thermal imprinting, aka scorching by contact. All scorch images from 3 D bas reliefs should respond to 3 D enhancement, since the image intensity is like an analogue recording of 3 D relief that can be scaled on the vertical height (z) axis. Alternatively, try it yourself. Find something metal that has some relief – a coin will do for starters. Heat on a hob, test with cotton or linen to check its hot enough to produce a scorch, then remove, press into the cloth (have a damp underlay, e.g. Dishcloth underneath), then if possible lift, move to a new spot, press, lift etc. (here it helps to have a template that has something that can be gripped, e.g. With pliars). You should get a row of images of progressively lower intensity, usually a few, three or four generally, until the template has lost so much heat it can no longer scorch. But here’s the interesting thing. If you photograph the images, and then enter them into Image J software, you can use the latter firstly to view the inverted image, i.e. Light/dark reversed, and then use the 3 D enhancement to get some pleasing and in some cases spectacular results (though for the latter you really need a template that has more relief than a coin). All scorch images, right down to the faintest that are only just visible respond to Image J 3 D enhancement in my experience. What’s more, one can do a charcoal sketch of the Shroud ‘as is’ image, enter it into Image J, then process as if it were a scorch. That way you can see the two stages of enhancement. Inversion alone can give an amazing transformation, and then 3 D enhancement will have you asking “Wow, did I really do that?” You’ll experience a little of what Secondo Pia must have felt in 1898. Just replace the ‘wow’ with Mamma Mia….","date":"2013-03-26","mins":"3:09 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28085","author":"colin_berry","post":"Many scientists, competent or highly professional in their own fields, have gone off at a tangent and damaged their reputation by claiming to be instant experts in new areas outside their expertise. An example was Nobel Laureate Linus Pauling when he claimed that vitamin C deficiency was a major cause of human diisease. I debate the specifics of the scientific nitty gritty – and I know that Adler certainly – an organiic chemist who specialized in porphyrin synthesis – was not the “blood expert” that some claimed him to be. Six years before he published his ridiculous hunches re bilirubin as though fact, I was publishing my results of the photoconversions of bilirubin under visible white light – at one of your ivy league universities. Nope, I don’t claim to be a giant of a scientist – but I was the first to propose photoisomerism as the crucial step – and if Adler had approached me re his bilirubin hypothesis, I’d have told him to read a few papers on the chemistry of that substance, and why it is highly improbable it would form an binary adduct with methaemoglobin, due to intramolecular hydrogen bonding, and why bilrubin could never confer everlasting stability to a second substance (the permanent red colour of Shroud blood) due to its instability to light and oxygen. As I say, I’m only here for the science. I host a site (sciencebuzz) that has addressed a wide range of topics that have captured public interest or imagination, but often where mis or disinformation is rife. It is the latter in ‘Shroudology’ that’s convinced me that close scrutiny by the planet’s most highly regarded scientists, starting with my own country’s elite scientific society, is long overdue, especially due to the people I have singled out, and because of the scurrilous attacks on the integrity of the radiocarbon labs. (“Night of the Shroud” etc). The pseudoscience, to which Adler and Heller contributed mightily, with untested hypotheses posturing as fact, with pseudoscience dressed up with all the trappings of science, has gone on for far too long… This site stands as a monument to 30 years of misinformation – and worse,.","date":"2013-03-22","mins":"4:06 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-25438","author":"colin_berry","post":"Authentic what? Authentic mystery man? How does an authentic mystery man differ from a non authentic mystery man? Call me old fashioned if you like, but I prefer transparency … even if I don’t like what I see..","date":"2013-02-23","mins":"6:21 pm","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","title":"To hide away and suppress the Cluny Medal"},{"id":"comment-25431","author":"colin_berry","post":"How about a posting from you, Dan Porter on what – or whom – you represent with your plethora of authenticity promoting websites? I see that shroudofturin4journalists is under (re) construction. The new version would appear to be more RC oriented, judging by the newly installed, as yet inactive tabs. Come on, Dan, aka episcopalian. You know you want to go the extra mile, if only to attend weekly confessionals. Come on, confess to us first. What was the real reason for your mid life crisis re the Shroud? Ought you not to have shaken it off by now, judging by the photo (tempus fugit etc)?. My enduring obsession is simple – I like enigmas, one of them being Daniel R. Porter….","date":"2013-02-23","mins":"4:15 pm","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","title":"To hide away and suppress the Cluny Medal"},{"id":"comment-8064","author":"colin_berry","post":"I have just this minute posted the following to the Bad Archaeology site: Re the image being “anatomically impossible”, for example “the neck is too long”. There is a simple explanation for that in my sand bed model. When the heated metal effigy (bronze statue or whatever) is pushed into the linen/sand, the cloth is first pressed against the “square on” features of the face, and then turns a right angle at the end of the chin, when it is then pressed lightly against the underside of the chin before it hits the next square on surface, i.e. The neck. But here’s the crucial point: when the linen is then removed and laid flat, the scorch imprint of neck will look too long because the top portion represents the underside of the chin, which can be a considerable length (it is about 10 cm on both me and the missus! Colin Berry.","date":"2012-02-08","mins":"3:30 pm","url":"https://shroudstory.com/2012/02/03/was-bad-archaeology-fooled/","cat":"history","title":"Was Bad Archaeology Fooled?"},{"id":"comment-8601","author":"colin_berry","post":"Thanks for the encouragement, Mark. There have indeed been new developments in the last few days in fact, reported on another site. Http://www.internationalskeptics.com/forums/showpost.php?p=11745357&postcount=191 Thanks to the “Zeke” filter provided on Windows 10, I’ve been able to reduce the three step model (imprinting/oven roasting/water washing to just 2! The beauty of the Zeke filter is that it promotes texture (like adhering solid particles) above background, such that the entire history of the Shroud image is open to inspection. I say it began as an encrustation that wasn’t washed off as initially suggested, per my site banner, but has only PARTIALLY flaked away naturally, still leaving bags of evidence , visible (especially) with the Zeke filter (courtesy of Windows 10). In short, it’s now a 2 stage model (imprinting/roasting) not 3!. My ideas are being rubbished on that “skeptics” site, but the resident know alls there would rubbish the idea that the Sun rose each morning… The important thing right now for this real time internet reporter is to get visibility on search engines, which show a distinct bias. I have to say, at least Stateside (e.g google.com) towards pro authenticity claims!!.","date":"2017-03-08","mins":"5:06 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?"},{"id":"comment-233","author":"colin_berry","post":"Thanks lovetar. Have just had a quick look at that link of yours. It confirms some of my suspicions that the Shroud’s details depart somewhat from the biblical account. I’m especially intrigued by the suggestion that an expensive linen cloth would only have been used to cover the body en route to the sepulchre, and not left there..","date":"2012-04-29","mins":"6:17 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?"},{"id":"comment-185","author":"colin_berry","post":"Well, I have had to block several of your comments, MPH, not because I cannot take abuse, but because I don’t want it clutttering up my comments threads, distracting from the train of thought. That’s why I allowed the last two, as a signal that I still look at each comment and give some thought as to whether it is really deserving of the filter or not. In fact, you have just done me a huge favour, whether you realize it or not, by making reference on Dan Porter’s site to the martyrdom of St. Lawrence (St.Laurent in France) whom the Church accused of failing to hand over the Holy Grail/Chalice that he was suspected of hoarding (forgive me if I have got it wrong or over simplified – this being all new to me, and from cerebral RAM). The parallels with the Templars and their wealth and persecution by Philip IV of France is all to clear. What makes it all so compellling is the punishment meted out to Lawrence – being slowly grilled to death – precisely the same fate suffered by Jacques de Molay and Geoffroi de Charney. Now we know why that particular form of execution was ordered – there were historical and symbolic precedents. Tomorrow I will add a new posting in which I compare details of the Lirey badge recovered from the Seine (1855 from memory) with those from a drawing done some 10 years later. There are some interesting indications that the man on the Lirey badge was indeed being grilled from below, additional to the ones I have already suggested. In other words, he was nott the victim of crucifixion as commonly assumed – although the artist who produced it was engaged in a mischievous kind of ambiguity – one that was intended to gull both impressionable medieval pilgrims and suspicious and wary Church authorities alike… The Shroud of Turin may bve seen as a spin doctor’s tour de force (as they might say in France).","date":"2012-04-23","mins":"8:31 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?"},{"id":"comment-187","author":"colin_berry","post":"Here is a comment from R on Dan Porter’s site from someone who clearly has not read what I wrote, and has simply used Dan Porter’s negative spin doctor’s summary as a guide to what I said. “Colin’s mis interpretation of many of the symbols seen on this metal just goes to show my several previous comments that maybe a new pair of glasses are warranted is correct 😉 Blood stains turn to chains, firm body features turn to armour, etc; etc; yet clues such as herringbone weave, the naked body, the flagrum, the nails, the tomb seem to disappear in his analysis. It has been stated that the medalion was most evidentally created whilst de Charny was still alive and as the Lirey expositions were ongoing, this conclusion comes from the depiction of the coat of arms and their ‘specific’ positioning. This was covered in detail in Wilson’s latest book The Turin Shroud and backed by others. So the medallion would be pre 1356. Medallions were common place among pilgrims in the middle ages and apparently it was good luck to toss them into waters, hense the finding of this medalion in the siene river.” Just that reference to “blood stains turn to chains” should be sufficient to show that someone has not bothered to do his homework. If anything, it is the other way round – that what was originally portrayed as a chain around the waist has been turned into blood stains. Why? because the “chain” on the Lirey badge is not just around the waist – it is seen to extend from both sides of the body. Given that it would be difficult if not impossible to bleach or otherwise erase what I believe is a heat scorch, that would suggest to me that the original Shroud image – as depicted on the badge – was later replaced by a new one, in which the “chain” was removed and replaced by blood stains. When was that done? 1532 would be my guess using “fire damge” as a cover. That’s why the Savoy custodians were grilled by 3 bishops and 10 noblemen no less, suspicious that the 1532 Chambery fire was really an accident, or arson as suspected, and whether the surviving Shroud, minus a few details like those absurdly bloated (armoured?) shoulders in the original, was really the same as the one they had recalled from seeing years previously, if at all with their own eyes, and responding to complaints from previous pilgrims that the 1532 fire had changed the Shroud image as regards some important details, like making it unequivocally the crucified Christ, with no Templar coded imagery….","date":"2012-04-23","mins":"8:52 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?"},{"id":"comment-179","author":"colin_berry","post":"Dan Porter has just this minute posted on this one (full marks for an almost journalistic response time, Dan, but shame you continue to vet all my comment before allowing them to appear). Http://shroudofturin.wordpress.com/2012/04/23/colin berry historybod a tale of two meanings/ Dan writes as follows: “Remember ‘The Second Messiah: Templars, the Turin Shroud and the Great Secret of Freemasonry,’ by Christopher Knight and Robert Lomas. Amazon in the U.K. Has five copies. In the U.S. Where you can buy a Kindle version, Amazon proclaims, “Using the latest scientific techniques , the authors prove that the shroud [Jacques de]Molay was wrapped in is the one now known as the Turin Shroud. Well, Colin Berry, has a new twist on this. Yes, it is still a scorch ala Berry and not the chemical approach taken by Knight and Lomas and. . “ Yup, I knew I had come across that link between Molay and the Shroud some weeks ago, and it was consigned to a filing cabinet at the back of my mind, the one labelled “yet another conspiracy theory?” but hours of googling these last few days failed to turn up that Knight and Lomas book. Anyway, it’s good to know that others have spotted a connection too – apologies to those authors for not citing their work, of which I knew nothing until 5 minutes ago. Thank you Dan. I shall now try to get my hands on a copy of that book..","date":"2012-04-23","mins":"9:44 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?"},{"id":"comment-176","author":"colin_berry","post":"In fact, looking again closely at the Man on the Badge (which I invite readers here to do), especially thr face and the feet, does that not strike you more as an image of a man being burned, rather than crucified? Note the way the head is tilted slightly upwards – as if enduring fearsome pain – rather then the downwards tilt one sees so often in crucifixion images of an exhausted man. The feet are also interesting. Yes, they are crossed, as expected if nailed together. But they could also represent feet that are being roasted and are in a spasm of pain. And what is that beneath the feet? A second chain? If so the links are oddly separated. Might it not be a nominal portrayal of burning wood?.","date":"2012-04-23","mins":"5:12 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?"},{"id":"comment-8585","author":"colin_berry","post":"Thanks for your interest Mark. Beware — you too may find yourself becoming progressively addicted to this intriguing topic. Even as a medieval fabrication, the people who created it displayed sheer genius – all the more impressive for keeping a technology secret that has confounded modern day scientists. The secret I believe is to fathom out what could have been added as a heat sensitive imprinting agent (recognizing that linen is incredibly resistant to chemical and thermal change) the non image incorporated surplus of which was then washed out in the final step. I believe the secret ingredient was white flour, but that is far too mundane a proposal for some of the people I’m talking to right now on a different site. Yup, there’s no point adding more to this site. I discovered yesterday that while my current page 3 ranking on google.uk (enter : shroud of turin) is now ahead of Stephen Jones’s blog, he’s on Page 3 of Stateside google.com and I’m nowhere to be seen, at least on the first 12 pages! What chance does a private blogger have of getting his ideas across when the ‘system’ is so obviously discriminating , read bent and corrupted, against sceptics like myself, at least Stateside.?.","date":"2017-03-04","mins":"6:42 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?"},{"id":"comment-4444","author":"colin_berry","post":"I don’t know about you, but I find it somewhat irritating that a wiki article about Geoffroi de Charny should be accompanied by an illustration of his son, even if labelled as GDC II. The suggestion that the two looked alike (as well they might when encased in knightly armour) is neither here nor there – since it could simply mean they were both clean shaven and had similar hair lengths. How much can one tell from brasses and line drawings anyway? It’s simply a source of possible confusion (of which some might think there’s enough already as regards de Charney v de Charny, which is a sore point with this blogger, having once been airily dismissed for confusing the two despite my having carefully made references to the claims for an uncle v nephew relationship)..","date":"2014-08-13","mins":"6:57 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?"},{"id":"comment-4443","author":"colin_berry","post":"Yes, the “nailed on a door” scenario is the one proposed by Knight and Lomas in their ‘Second Messiah’ theory. It’s an interesting idea, indeed ingenious, but I frankly don’t buy into their chemical image theory (lactic acid, singlet oxygen etc). It was Geoffroi de Charney, preceptor of Normandy, who was burned at the stake in 1314, alongside Jacques de Molay, last Grand Master of the Knights Templar. It was Geoffroi de Charny and his wife who were the first recorded owners of the TS. Note the slight difference in spelling. It was suggested by a prominent genealogist that de Charney and de Charny were uncle and nephew respectively. The possible Templar connection opens up all kinds of possibilities apart from the one suggested by Knight and Lomas, especially if you add the evidence from Barbara Frale that the Templars were using an image of a bearded man on linen in secret initiation rituals well before the events of 1314. Pity we don’t know whether the image was painted on, or more scorch like as per TS. Thanks for looking in. I’ll respond to your second comment later today..","date":"2014-08-13","mins":"5:59 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?"},{"id":"comment-258","author":"colin_berry","post":"5th May: I submitted this post to my.telegraph.co.uk a few days back. It appeared briefly, attracted one comment, and then quickly disappeared. Yet it is still listed on Google searches that have the relevant search terms, but when one clicks, there is a message “This blog has been archived or suspended”. Yet am still able to comment on my.telegraph. Google still keeps snapshots of postings in “Cache” which remain after one’s link has gone dead. Here’s a link to my censored posting: http://webcache.googleusercontent.com/search?q=cache:A Jo Cs Mo Cw8 EJ:my.telegraph.co.uk/shroudofturinwithoutallthehype/science bod/3/a new theory that gives a medieval origin to the turin shroud/+&cd=7&hl=en&ct=clnk&gl=uk&client=firefox a Now why would the Telegraph not want its readers to see my theory? Answers on a postcard… Alternatively, I am a victim of what some suspect is a cheap and cheerful substitute for “moderation”, one that automatically deletes any posting or comment that receives more than a certain number of “Report this comment” clicks. Others before me have suggested that this is the way it works on the Telegraph (and no, it’s not Disqus that makes all the decisions, contrary to popular belief). A robot system that responds merely to numbers of Report clicks is to my mind not fit for purpose. That should be self evident, but is especially the case because the Disqus system does contribute through allowing those who report a comment to give no reason ( and preventing those who do wish to give a reason). This makes it easy for organized lobbies and pressure groups to target those who are perceived as “the enemy” and get their postings and comments deleted. It is what’s called “astroturfing” – pretending to be grassroots opinion. In other words the DT/Disqus ‘report comment’ system is totally dumb and open to manipulation – resulting in mindless yes, literally mindless, deletions, while at the same time leaving a marker on Google that one’s work has been deemed dodgy for some reason or other that is not specified. It really is time that the Telegraph and Disqus got together and worked out a more sensible way of policing my.telegraph and other DT forums. There are other issues too, which I shall not go into now, but would be happy to disquss if invited to do so..","date":"2012-05-05","mins":"8:31 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?"},{"id":"comment-171159","author":"colin_berry","post":"For the record, I am not and never was “Weaving Fan” as claimed by Stephen Jones. I even put up a posting some 2 years ago to disabuse him of that. Quite why Dan has chosen to return to what started as a brief spat between the two of us (it began when I was rudely balled out for posting a second comment having overlooked his site’s draconian house rules) is a total mystery. Surely it’s not an attempt to portray me as a hypocrite when I continue to lodge protests against the tolerance shown here to a handful of site trolls, one in particular, whom Dan compares with “hecklers” at political meetings. How much heckling was permitted from the floor at that St.Louis conference he attended recently? Or is it considered OK to foul up debate on internet forum via personal and vitriolic attacks on genuine contributors, whether pro or anti authenticity, while operating from behind the safety of a pseudonym? But as I say, I was not “Weaving Fan” and am somewhat uncomfortable with the title of this posting. What useful purpose does it serve?.","date":"2014-11-14","mins":"1:47 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-171198","author":"colin_berry","post":"Glad you like my, er, Scotch Irish sense of humour Louis. But there’s a serious side to me too, in the metaphysical department that is. Knowing your serious misgivings ray Re Rogers on account of his alleged logical positivism, be on the lookout for my forthcoming book, to be entitled: “Fuzzy Logical Negativism – the Quantum Solution to Every Question in the Universe – For Those Who Already Know The Answers”. (CB Publications, New York, London and Little Codswallop). Maybe Dan can be prevailed upon, or arm twisted as we say, to post a flavour of what’s in the pipe dream, (sorry, line) from time to time, say once a week, he being my very bestest friend, especially as we both know New Yoik. There will be a range of flavours on offer – sweet, sour, bitter – something for everyone. There will be no excuse for anyone not to buy my book. In return for advance orders with full pre payment, I can do you a special deal on my publishing house too..","date":"2014-11-14","mins":"8:53 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-171173","author":"colin_berry","post":"Thanks Dan..","date":"2014-11-14","mins":"3:56 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-171214","author":"colin_berry","post":"“When do you expect your book to be launched?” What, ike a huge luxury cruise liner, say the Titanic? Or a rocket launch, like, er, well let’s skip that one, shall we? No, nothing quite so challenging (or risky) as a launch. I thought I’d take a leaf from the Ford Edsel book of marketing, and go for a softly, softly approach, spread over several weeks, nay months, a fender here. A grille there, you know, like a strip tease, reveal one’s hidden charms one tiny fleeting glimpse at a time. Then would finally come the big day when the veil is swept aside and the entire model is revealed in all its glory, and jaws would drop, and folk would exclaim “Yes, that’s IT!” (or was is “Is that it? “, I can never remember). It’s all there on the internet – the Edsel way of insinuating one’s devastatingly original creativity into the public consciousness by degrees. Http://content.time.com/time/specials/2007/article/0,28804,1658545 1657867 1657781,00.html From your Scotch Irish humorist. (“They all laughed when I said I wanted to be a comedian. Well, they’re not laughing now” – Bob Monkhouse)..","date":"2014-11-14","mins":"11:15 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-6659","author":"colin_berry","post":"There is no chemical method that can date the Shroud, either to the 14th or the 1st century. All a chemical method can do is tell you something about its present state. The various claims that these tests can serve as chemical clocks is moonshine, given the thermal insults to which the Shroud has been subject (1532) or to which it may have been subject in order to imprint a mid 14th century simulated body image, e.g. By the oven roasting technology that I and others have proposed. So let’s be hearing no more about, at least not here, about your AFM or any other claimed alternatives to radiocarbon dating piero. This site exists to promote science, not pseudoscience. Those like yourself who distrust the radiocarbon dating are, needless to say, entitled to their opinion, and to express it once and once only if unsupported by hard data. They are not entitled to constantly undermine confidence in the radiocarbon dating on other people’s websites by constant repetition of their opinion, if there’s no supporting data. That’s not science. It’s propaganda, no matter how cunningly disguised with the language of science. If you’re determined to proselytize your AFM as a viable alternative (which it’s NOT) then there’s an alternative to constantly filling up the comments on other people’s websites, piero. Go create your own website. It takes only a few hours at most, minutes even if you’re not trying to win prizes for artistic merit. I can recommend either Word Press or Google’s Blogger, each having its pros and cons. You are of course at liberty to post comments here on other matters, but pseudoscientific AFM etc is no longer accepted..","date":"2016-01-05","mins":"4:27 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-171161","author":"colin_berry","post":"Stephen Jones still thinks it is, Thomas if you check his latest comments. But then who am I to argue, being allegedly blind to the truth his truth that is? Heads and brick walls do not make easy companions….","date":"2014-11-14","mins":"2:39 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-6641","author":"colin_berry","post":"Your pro authenticity bias is now showing piero. Any kind of bias in science, if not based firmly on a secure foundation of fact, is not science at all, but pseudo science. Be warned piero. Pseudo science, no matter how well disguised, is not welcome on this site..","date":"2016-01-02","mins":"5:45 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6625","author":"colin_berry","post":"There are only two ground rules where this humble site of mine is concerned. First, I insist on civility (which does not preclude forthright criticism on condition that it addresses the issues, not the perceived character faults of the man). Second, I’m a firm believer in focus. Comments should be relevant to the posting. If one wishes to address an issue that is different from the latest posting, then please take the trouble to find a previous posting that is relevant, and attach one’s comment to that. Happy New Year, and happy blogging (respecting just two ground rules)..","date":"2015-12-30","mins":"6:10 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6644","author":"colin_berry","post":"PS: I suddenly remembered we’ve been here before, piero, my having posted this (altered) cartoon to Dan Porter’s site in February last year: My views on your AFM obsession have hardened since then, now that your pro authenticity bias, dare one say mission, has become all too apparent. Do you want me to spell them out? I shall if you continue to proselytize AFM (with or without a supporting cast of other) as promising a pot of gold at the end of a rainbow. You know and I know that is not the case..","date":"2016-01-02","mins":"8:34 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6624","author":"colin_berry","post":"Sorry, piero, but if it’s answers you seek from this simple soul, you will need to keep your questions simple and straightforward. Right now, your questions are making my head spin….","date":"2015-12-30","mins":"4:04 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6614","author":"colin_berry","post":"I’m all in favour of non destructive techniques, piero (assuming the Vatican allows a second “STURP” which I doubt will happen anytime soon). If or when it does, I’ll suggest a new protocol for testing the “blood”, considering the first was seriously mismanaged by Rogers, Heller and Adler, indeed botched. One has only to read Heller’s account in his book to see that is not an unfair accusation.The blood testing was indeed BOTCHED (the subject of my next posting). But new techniques must not only be non destructive. They have also to be informative. That means the technique has to have been demonstrated to yield useful and interpretable data in situations more straightforward than the TS. Pardon my saying, but I doubt that is the case for your AFM technique – unless piloted first with known model systems – notably ‘scorches’ generated by each of the three known methods of thermal energy transfer – conduction, convection and radiation. My money is on conduction and/or convection. Radiation may appeal to those attempting to link the TS with biblical resurrection, but it has huge theoretical obstacles to overcome if wishing to be taken seriously as a scientific explanation..","date":"2015-12-29","mins":"7:13 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6655","author":"colin_berry","post":"Readers of this posting might be interested to see its wider context, highlighted in this recent comment from Hugh Farey on the International Skeptics Forum site: http://www.internationalskeptics.com/forums/showthread.php?t=299015&page=58 Comment #2318 Those who have very much enjoyed the intellectual cut and thrust of shroudstory.com have been upset by its recent closure, although with competent searching it remains an essential repository of primary sources and intelligent opinions. There was a time when I found internationalskeptics worthwhile, and indeed, followed chiefly mathematical arguments from an authenticist to a non authenticist viewpoint. Since then, I have scrupulously examined every authenticist argument for discrediting the radiocarbon date, and found nearly all of them spurious, although there are still one or two grey areas. Many of the other evidences for a medieval date have also been scrutinised, in detail, with a view to determining their level of support. The d’Arcis memorandum is one of these. Over the years the weakness of the authenticist position on this site has resulted in some very slack counter arguments from non authenticists, with the result that, although Jabba is frequently blamed for the pointless continuation of this thread, which must surely for heading for the Guinness Book of World Records, it has really been maintained by his opponents. In more or less the same three words (“I’ll be back”), posted every month or so, Jabba has managed to keep a pack of hounds snarling at his heels, without achieving the slightest progress in denting his belief in the Shroud’s authenticity. Mostly, the site has become an increasingly inaccurate re iteration of supposed non authenticist arguments, to the edification of nobody. There may be an unrecognised worthwhile reason for the maintenance of this thread, which is to demonstrate the weakness of authenticist arguments, or the strength of non authenticist ones, to readers who follow it, but never comment. For several years they have been largely disappointed, I fear. Neither the Pope, nor Bishop d’Arcis, nor Bishop Henri, nor anybody else, has left any record that they knew the painter responsible for the image of the Shroud. All we have is an unsigned, undated draft of a letter addressed to the Pope from d’Arcis, claiming that the Shroud being exhibited in Lirey in 1389 was not a true relic of Christ, but a deceitful fraud, and that the whole thing had been investigated by Henri of Poitiers, “the truth being attested by the artist who painted it,” after which it had been hidden for 34 years or so, a date so precise that it suggests some knowledge (or assumed knowledge) that the first time the Shroud was exhibited was in 1355 or so. (“Or so” perhaps being crucial, as we shall see. The Latin is “vel circa”) This is important. We do not have Bishop Henri’s report. What we do have is his signed, dated, effusive commendation of Geoffroi de Charny written on 28 May 1356, with no mention of a fraudulent Shroud. It seems unlikely that Bishop Henry would have been so kind if he had just condemned a fraudulent relic. Geoffroi de Charny died at the battle of Poitiers on 19 September 1356. Suppose, for a moment, that d’Arcis’ information, whether or not he actually sent his letter, was correct. An interpretation of the evidence could be that the Shroud began to be exhibited after de Charny’s death (‘vel circa’ being the operative words here), and Bishop Henri, having commended de Charney only the previous Spring, was shocked to discover that by the Autumn the canons at Lirey had exceeded their remit. This seems possible, and to me the most likely. It is sometimes claimed that since there is no proof that d’Arcis’ letter was sent, that no credence should be given to it. However, even if this particular complaint was not received by the Pope, he nevertheless commanded in 1389 that the Shroud could only be shown as a representation, and without all the ceremonial trappings of sanctity that might attend the display of the real thing, suggesting that at least somebody had complained. It is not obvious whether he personally thought the Shroud was genuine or not, but he certainly acted as if it wasn’t. On the other hand, if we decide that the “vel circa” is not adequate to reconcile the conflicting evidence from 1356, we could claim that Bishop Henri knew all about the Shroud and commended Geoffroi de Charney for building a chapel for its veneration. His commendation specifically states: “after scrupulous examination […] of the said knight’s sentiments of devotion, which he has hitherto manifested for the divine cult, and which he manifests ever more daily. And ourselves wishing to develop as much as possible a cult of this nature, we praise, ratify and approve the said letters in all their parts – a cult which is declared and reported to have been canonically and ritually prescribed, as we have been informed by legitimate documents.” What could this “cult” have been, if not that of the Holy Shroud? Well, the fact that the church is dedicated to St Mary may be related to that. It may be worth considering how we know about the two conflicting documents in this case. The d’Arcis memorandum has been researched twice, by the Catholic Historian Ulysse Chevalier, at the turn of the 19th/20th century, and by Hilda Leynen in the 90s. The document by Bishop Henri was discovered by Bruno Bonnet Eymard, who is a fairly extreme fundamentalist Catholic and Shroud authenticist, who thinks that the radiocarbon date was falsified by Dr Tite and Cardinal Ballestrero in the sacristy of the Royal Chapel in Turin in 1988. Although his discovery of the Bishop Henri document was presented to the St Louis Shroud Symposium in 1991, it was not referred to at all by Luigi Fossati in his two articles for Shroud Spectrum International in 1992, or in Jack Markwardt’s ‘The Conspiracy Against the Shroud’ in 2001. Finally, Luigi Fossati draws our attention to an interesting change of phrase in successive communications from Pope Clement to Troyes, at around that time, beginning with “figura seu representatio” (July 1389) amending it to “pictura seu tabula” (January 1390), but reverting to “figura seu representatio” in May 1390. References: D’Arcis memorandum: https://archive.org/details/tudecritiquesur00chevgoog Bishop Henri commendation: “The Shroud of Turin: A Case for Authenticity” (google.books) Markwardt Discussion: http://www.shroud.com/pdfs/n55part3.pdf Fossati Discussions: http://shroud.com/pdfs/ssi41part3.pdf and http://shroud.com/pdfs/ssi42part14.pdf Bruno Bonnet Eymard: http://crc internet.org/our doctrine… shroud turin/.","date":"2016-01-04","mins":"10:59 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6605","author":"colin_berry","post":"Hello piero. Welcome to the site. I’m just a boring old biochemist by training, and don’t have a clue about all these gee whizz physical scanning techniques that you continue to discover. However, the big however, even if I did, I would not be very optimistic about scanning the Shroud with your new positronor even AFM technique, considering it unlikely to give immediate answers. Why not? Because one needs a theoretical model, maybe imperfect, but one that one can first model in the laboratory (or garage in my case) and scan using the same technique, in order to provide a baseline reference. Science operates best when it has reference models, even if they are highly simplified. New York dialect? What prompted that ? Yes, I know New York, having visited it a few times while living and working in nearby Philadelphia. That was back in the 70s mind you, but I have fond memories of NY, it then having a vibrancy that hit you as soon as you stepped off the train. London too, which I visit every couple of weeks for pleasure, is now vibrant, but in a different way, being so very international. It’s a lot more fun these days, exploring previously neglected streets and quarters, now packed with visitors, knowing there’s bound to be a good pub or restaurant close at hand, catering for the new influx. The Tube train is much better now too, with trains every 2 minutes on my regular routes. Italy: can you recommend a good tourist resort in the deep south? I’ve never been further south than the Bay of Naples, and would now like to visit the “toe” and “heel”..","date":"2015-12-28","mins":"4:20 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6629","author":"colin_berry","post":"AFM? Atomic Force Microscopy? Or Annoyingly Futuristic Moonshine? Here’s some unsolicited but well intentioned advice piero. If you can’t produce a detailed experimental protocol that has a reasonable chance of generating new insights, then make a New Year’s Resolution to stop cluttering up other people’s sites with your AFM mumbo jumbo..","date":"2015-12-31","mins":"5:37 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6601","author":"colin_berry","post":"Have just spotted this comment on Stephen Jones’s site (which I refuse to link to until I get a proper apology for his falsely accusing me a while ago of trolling his site under a pseudonym, and then proceeding to add further insult to injury): As far as I’m aware there are no medieval paintings or sculptures depicting a naked Jesus Christ,( His genitalia are always concealed by a subligacum) so this peculiar aspect of the image of the Man of the Shroud is no doubt one of the many pieces of evidence pointing towards authenticity. This is one point I usually highlight in my lectures about the Shroud. Antero de Frias Moreira Centro Português de Sindonologia December 28, 2015 at 7:35 PM This is a non argument, Dr.Moreira. Nobody disputes that the image on the TS is that of a recumbent man who, from the tidied up position of his hands, is or was DEAD. By the same token, the position of those hands means that few if any finer sensibilities are going to be offended re exposed genitalia. They are NOT exposed, the hands serving exatly the same function in that regard as would be the case if the subject had been clothed. Conclusion: one cannot cite the alleged “nakedness: as evidence against a medieval provenance, for the simple reason that the figure depicted is not that of a fully naked man, at least from the viewer’s perspective. Get real, you eternally wishful thinking advocates of authenticity. Let’s be having some genuine arguments please instead of these limp self serving excuses for arguments..","date":"2015-12-28","mins":"12:25 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6595","author":"colin_berry","post":"Next posting here? I think it will be necessary to grasp a certain nettle as to who actually had legal title, i.e. Owned in crude parlance, the Lirey Shroud at the time of its first display and thereafter. Charles Freeman – never my favourite historian due to glossing over or ignoring crucial detail – is now making out on the last two or three comments threads on the shroudstory site that it was the Lirey canons who owned the Shroud – or at any rate considered themselves the owners – which if true would be convenient for his “just a painting, just a liturgical prop for an Easter ceremony” narrative. No, those canons were NOT the owners. They were given the duties and responsibilities of stewardship and display, certainly, but that is not the same as having legal ownership, as was duly established much later. Stewards would have been affronted at having the Shroud transferred physically from the Lirey church elsewhere, as happened decades later after Jeanne de Vergy becoming widowed in 1356, leaving them (or successors) with no key attraction to display. However, that is entirely different from signifying a loss of legal title if as seems likely they never had it in the first place. Nothing I’ve read so far, including ther Pierre d’Arcis memorandum that Freeman briefly cites in support of the canons as owners, suggests that those De Charny appointed clerics and their successors were anything more than stewards..","date":"2015-12-26","mins":"1:28 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6600","author":"colin_berry","post":"End of an era. Dan Porter finally closed up shop on his shroudstory site an hour ago. All comments threads have been closed (just as well since I had been planning an even more surreal addition to that bizarre and dubiously relevant insertion from piero on what has to be the ultimate conspiracy theory, namely that all pre 1100 history has been cleverly faked!). I had to go a googlin’ to find the meaning of Dan’s “Goodnight, Mrs. Calabash, wherever you are” sign off. It’s a reference to a catch phrase made famous (in the US) by radio personality Jimmy Durante (1893 1980). Https://en.wikipedia.org/wiki/Jimmy Durante Goodbye Dan. You will be missed. Thanks for the appreciative comment in your final posting, my patience over 4 long years having finally been rewarded!.","date":"2015-12-28","mins":"9:45 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6647","author":"colin_berry","post":"Back to piero and his AFM. Here’s the entry from wiki, slightly modified, to purchasing something on hire purchase, or an instalment/installment plan as it’s known in the ex Colonies and elsewhere. Hire purchase (colloquially called “buying on the never never”) is the legal term for a contract, in which a purchaser agrees to pay for goods in parts or a percentage over a number of months or years. In the US and Canada, hire purchase is termed an installment plan although these may differ slightly as, strictly speaking, in a hire purchase agreement the ownership of the good remains with the seller until the last payment is made… The hire purchase agreement was developed in the UK in the 19th century to allow customers with a cash shortage to make an expensive purchase they otherwise would have to delay or forgo. So, you get the goods upfront, and then pay for them over an extended period. Now then: does anyone else here – apart from myself that is – notice the difference between hire purchase as originally conceived and piero’s AFM credit scheme? When do you start paying in the piero scheme? When do you get the goods? What does “the never never” refer to in piero’s scheme – when you finally finish paying, or when you finally get the goods, if ever?.","date":"2016-01-03","mins":"11:33 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6590","author":"colin_berry","post":"See the late addition to this posting, responding to a point raised by Angel on the shroudstory site, in which she claims that the man on the TS sports a ponytail. If that ‘ponytail’ really represents hair, then why is the tone in that contrast restored Shroud Scope picture totally different from the hair that is on the scalp as distinct from the neck and back region. The first is greyish, the second is reddish brown. One cannot assume the ‘ponytail’ represents imaging of hair, not in a medieval modelling scenario (I hesitate to use the term ‘forgery’ for reasons already alluded to). Why not? Because (a) one does not know what was used as subject (real person or effigy) and (b) one does not know the mechanism of imprinting or imprinting medium. Angel: you are making the common error of treating the TS image as it it were a photograph. It’s not..","date":"2015-12-24","mins":"8:39 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6588","author":"colin_berry","post":"If you ask me, one of those 5 or 6 chaplains exceeded his/their brief, possibly while his lord and master was being held captive in England for 18 long months. The brief was to make an imprint of the newly crucified Jesus in sweat and blood, as it might have appeared on Joseph of Arimathea’s linen, to accompany Hugh Farey’s life size recumbent wooden statue. But with ample time on his hands,he got carried away, and made the dual sweat/blood imprint look FAR TOO REALISTIC. The rest as they say is history. Like taking away the statue, leaving what for all the world (bar those tedious sceptics) looked like it might be THE genuine 1st century shroud..","date":"2015-12-23","mins":"7:16 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6593","author":"colin_berry","post":"Thanks Hugh. I’ve only looked at the pictures so far. Interesting. Am looking forward to seeing your BSTS Newsletter 82! Merry Christmas..","date":"2015-12-25","mins":"5:53 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6640","author":"colin_berry","post":"Point 1: Cellulose depolymerization? Yet another chemical clock that is impossible to calibrate with certainty, along with lignin breakdown, fibre mechanical fragility etc. Who needs a unreliable chemical clock when there’s radiocarbon dating? If the objection to the latter is the limited sampling, then the answer is simple. Go back and sample a wider range of sites. Point 2 (image characteristics) : I’ll try addressing that later. First I have to figure out precisely what it is you are proposing, and whether it’s really AFM that is crucial and in the frame, or whether it’s really those other techniques (Raman etc) that have now suddenly crept in as reinforcements. Sorry piero. I’m frankly not impressed so far, and indeed am frankly underwhelmed, but I shall withhold judgement for a short while longer. Maybe there’s something I’m missing but I’ll be darned if I can see it. The expression “much ado about nothing” springs to mind..","date":"2016-01-02","mins":"5:32 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6653","author":"colin_berry","post":"The radiocarbon dating is 1260 1390. Admittedly that is the answer for one subdivided corner only. Those who think there’s a substantial sampling error that could make the date seem 1300 years younger should be pressing for retest, not substituting , or attempting to substitute soft chemistry for hard nuclear physics. The medieval date given by radiocarbon dating, combined with the two fold image of a crucified man, makes it near certain that the TS is/was an attempt to model the image that might have been left on linen by the crucified Jesus. At least three researchers, myself included, have deployed an oven heating step to model the body image. So all those chemical clocks that rely on any kind of physical or chemical degradation of linen fibres (lignin degradation, mechanical weakness, cellulose depolymerization etc) are totally unscientific if they not only discard the radiocarbon dating, but acknowledgement too of the thermal technology that might and indeed probably was employed to produce the body image. That’s not counting the possible effects of the 1532 fire as well. This attempt on your part and others (Rogers, Fanti, Di Lazzaro etc) to sideline the radiocarbon dating – essentially to pretend it’s not there or has somehow been invalidated – and to substitute phoney chemical dating, or attempt to do so, may be acceptable in sindonology, piero. But is not acceptable in experimentally based science, and more to the point is NOT ACCEPTABLE ON THIS SITE (see the blog title). I reserve the right to delete further comments from you or anyone else piero that I consider to be pseudoscience, aka mumbo jumbo.This site does not see itself as a substitute or successor to shroudstory.com (RIP)..","date":"2016-01-04","mins":"4:16 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-6635","author":"colin_berry","post":"Message received, piero, but still not understood. What kind of information would you expect to obtain from AFM? Would it allow you to identify the target molecule(s) for image reception, e.g. Hemicelluloses, lignins, cellulose, pectins etc? If so, would it allow you to deduce the precise nature of the chemical modification (dehydration, oxidation, conjugated carbonyl bonding etc? Or as you assuming, perhaps mistakenly, that tables of figures and plotted graphs alone will lead you straight to answers, in the absence of any reference standards against which to make comparisons, e.g. Thermal or other imprints from model systems? Or maybe you have chosen those reference standards already, but are keeping your cards close to your chest. If so, please be more open with us (this being the informal blogosphere) because endlessly holding up your gee whizz AFM as the ultimate technology if in fact deployed in what looks suspiciously like a theoretical vacuum (from where I’m standing) is a research strategy that is hardly guaranteed to hold your readers’ attention for more that a few picoseconds at most. Sorry to be so candid, but it’s time to place those cards down on the table..","date":"2016-01-02","mins":"3:20 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/","cat":"turin_shroud","title":"What happened to make Geoffroy de Charny’s humble chapel the first undisputed mid-14th century home of the Turin Shroud? A second ransom demand?"},{"id":"comment-207540","author":"colin_berry","post":"Glad to see that you too have deduced the blindingly obvious Thomas. So why Dan and others line up Fulbright and Dreisbach as if somehow contradicting one’s chronology of sindon first, othonia second (whether or not the latter were narrow strips or maybe another single sheet) is baffling to say the least. And to anyone who considers Diana Fulbright to be above reproach, I suggest they take a look at her caption to Fig 1 (the shrouded corpse at the top of Dan’s posting). Fig 1: Body wrapped “according to the custom of the Jews” (Based on forensic analysis of the image on the Turin Shroud”. Talk about a circular argument, begging the question etc etc. And one’s supposed to genuflect to that kind of insult to the intelligence?.","date":"2015-08-06","mins":"2:39 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"},{"id":"comment-207532","author":"colin_berry","post":"Perhaps you, Dcn Andy, and Dan for that matter, would care to state precisely where you think my interpretation of ‘sindon’ and ‘othoni’ differs significantly from that of Dreisbach and Fulbright. This could be interesting – analysis is depth as distinct from mere skimming the surface. Be warned: I found two glaring instances of “begging the question” yesterday, one from each of the authorities you name, showing that TS celebrities are not above creating cherry jam for the masses. Indeed, it’s the celebrities who are responsible for most of it. Dan Porter’s attempts to snuff this blogger out with his wet blanket techniques will not succeed. The bit is between the proverbial teeth – and yes, I do have teeth. I despise pseudoscience in all its forms and its agenda driven practitioners. I do not need this site and its lazy, partisan “my expert is more authoritative than thou” rhetoric to get my message across (though it may take time – years rather than months), In the meantime: here’s some advice. If you don’t like my line of reasoning, then state why. Stop lining up your so called experts, stop the cut and paste of their words imagining that to be some kind of rebuttal. It ain’t. In fact, it sums up this site beautifully: an unwillingness to address issues in DEPTH anf in DETAIL (with a handful of exceptions but for whom I would not be here)..","date":"2015-08-06","mins":"12:14 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"},{"id":"comment-207455","author":"colin_berry","post":"It was just a few days ago now that Dan was complaining about the length of my postings and having to scroll to the end to find updates. Now he’s complaining about the new diary format (which allows me to keep the same generic title for each post, stressing sceptical approach, not specific content) in which new additions are added at the top (what Dan refers to as upside down). What could be simpler than going to another site and looking to see what’s at the top, having to do little or no scrolling. Here is what the visitor sees first, a listing of the 6 topics covered in the current week (No.32): 6th topic. Spotlight on scientist Barrie.M.Schwortz 5th topic: Whose book in the early 1980s might be said to have undermined the “tradition” of regarding the Shroud simply as an “imprint” formed on the linen used to receive a body from the cross, of manufacturing cherry jam? 4th topic: an altogther different explanation for why the man on the Shroud has fingers but no thumbs. No pathology needed in the medieval modelling narrative. 3rd topic: The mysterious Gematria. How does it work? 2nd topic: Why does this blogger write “Shroud” instead of Shroud? 1st topic: Why did obscure little Lirey near Troyes, France, come to host the first undisputed appearance of the “Shroud” double image in European history? Google rankings? I gave up fretting about those a long time ago. What matters in the final analysis is what folk will be saying in 5 or 10 years time. For now, I’d rather be anonymously right than famously wrong. The top priority is to identify and archive the media outpouring of “Shroud” related cherry jam, past and present, that masquerades as science (real science that is)..","date":"2015-08-05","mins":"2:59 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"},{"id":"comment-207487","author":"colin_berry","post":"“Is that what the Pray Manuscript shows? Hmmm? The question as to what sindonologists, or at any rate some of them, see as the “Shroud” is far too important to be relegated to a hmmm. I would say that the semantics are one of the most questionable aspect of all. Get that wrong, and pretty well everything else is guaranteed to be wrong. The crucial question is whether it was Joseph of Arimathea’s linen (sindon) that was present at the time of imprinting, or some entirely different linen, described as othonia If it was the first, then the appropriate model is that of contact imprinting, maybe en route from cross to tomb, maybe a little later. But if it’s the second, and used different linen, whether as narrow winding strips or not, then the door is opened to any number of imagined imprinting mechanisms, real or speculative, that are not mere contact prints. I say the illustrator of the Pray Codex recognized the existence of TWO different ttpes of linen, one shown under the body, ie.Joseph of Arimathea’s (labelled red JA) and the second in readiness, being reeled out in the background, linking the figures of Joseph, A.N.Other and Nicodemus, probably supplied by the last of that trio, along with his 100lbs of aloes and myrrh (see John) and thus lablled blue N for convenience.. Would it be an imposition to suggest that those who have doubts about or reject this interpretation try to summon up a little more than a hmmm? I say the TS should never have been called the “Shroud”, given most folk read that as burial shroud, for which there’s no biblical authority. It should have been called the Deposition or Retrieval or Transport Linen. I’m fairly certain the illustrator of the Pray Manuscript would have concurred..","date":"2015-08-05","mins":"11:25 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"},{"id":"comment-207500","author":"colin_berry","post":"“You wondered why I hadn’t covered something you wrote.” Without knowing which posting or part thereof you are referring to, Dan, it’s hard to comment. I suspect it was less a complaint, more a statement, flagging up the fact that there was material on my site that a fellow commenter could not expect to know about, unless they had visited. Speaking of which – looking in on other folks’ sites – I’ve tended perhaps to assume that your site is a blog (of sorts) and that you have other blogs ”within the family circle’ bookmarked. You say that’s not the case, that you rely on search engines. Fair enough. It’s not my place to tell you how to run your site. By the same token, it’s for me to run mine, to find a style that I’m comfortable with, which may or may not be Google or shroudstory friendly. My chief beef is not pro or anti auhenticity. It is pseudoscience, sindonology being perceived as a major offender. Polite suggestion. Don’t bother with my site. Ignore it completely. However, I shan’t ignore yours. If I see a posting or comment that makes a good talking point, I will add a new entry to my daily log. If I consider it needs wider exposure, I’ll let you know by posting a comment to your site when a suitable opportunity arises, inserting a link to mine. Inevitably there will be some who will claim, as they have done previously, that I’m “using your site to promote my own”, to which the answer is: “that’s how the blogosphere works” and “that’s how one gets search engine visibility, through linking to other sites”. As stated previously, Google rankings don’t in fact bother me much these days, though I note my new format site is now showing under (Shroud of Turin) if one restricts the search to “last week” or earlier to “last 24 hours”, which bodes well for the future..","date":"2015-08-05","mins":"3:08 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"},{"id":"comment-207689","author":"colin_berry","post":"Those who monopolize and/or disrupt other people’s blogs should be judged entirely on their manners and modus operandi – not their perceived vulnerabilities. Ordinary uncomplicated folk have rights too..","date":"2015-08-07","mins":"1:09 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"}]
