[{"id":"comment-306","author":"colin_berry","post":"Speaking of The Other Site, here is a comment that I have just placed on my “Alan Adler” posting: This comment has just appeared on Dan Porter’s shroudofturin site. I shall address only key points right now, since I’m busy on other aspects: June 22, 2012 at 5:25 am | #22 Reply | Quote To «anoxie» If you have any doubts on scientific questions concerning bloodstains my advice is not to ask Dr. Colinsberry because he’ll always provide misleading answers with the aim of discredit the Shroud. You had better read previous excellent post on this blog concerning Shroud bloodstains by medical immunologist Dr. Kelly Kearse. My husband is a medical doctor and he read all Drs. John Heller and Alan Adler’s papers on blood issue in their book «The Orphaned Manuscript». This book contains several papers by these investigators most of them published in «peer reviewed» scientific journals and the conclusion is crystal clear, Shroud red stains are not red ochre and vermillion in a collagen tempera, actually they are blood. Inasmuch, Professor Adler and Dr. John Heller did nor perform just the Hydrazine test that Dr Collinberry described in a very confusing way. They actually tested not one but several samples from red stains and also studied red stains from human blood on fabrics as controls. The finding of hemoglobin characteristic spectra, other spectrometry data, detection of blood proteins, bilirrubin and other blood components enables them to conclude that there is indeed blood on the Shroud. Italian forensic investigator Professor Baima Bollone obtained similar results working with material collected from other locations on the Shroud. BLOOD ON THE SHROUD IS NOT A GUESS IT IS A SCIENTIFIC FACT. Kindest regards Maria da Glória Centro Português de Sindonologia My reply: Kelly Kearse’s contribution, which I was the first to commend, was primarily about the methodology of ABO blood testing, it touched only briefly on the protocols used for the Shroud, so who is being misleading here? re Alan Adler’s protocols: it’s easy to be impressed by lists of the tests he did perform to confirm “real” blood, albeit degraded. But one has to be a specialist in the area of tetrapyrroles, whether cyclic, like the porphrins, or linear like the bile pigments, to know that uv.visible and fluorescence spectra alone do not provide proof positive. For two years I was a bile pigment specialist, working on Philadelphia on the phototherapy of neonatal jaundice, and teamed up with a then major drug company (SKF) to use state of the art methodology for identifying bilirubin photo derivatives. Key among those were initial thin layer chromatography, followed by derivitization to form volatile TMS derivatives, followed by mass spectometry. We were not content to look just for finger printing fragments – we regarded detection of the molecular ion as our goal. That was in 1972, well before the STURP studies, but nowhere have I seen Alan Adler using such rigorous methodology to confirm that he was detecting porphyrins, as distinct form substances with porphyrin like spectra and fluorescence. Nor have I seen any real evidence for the existence of bilirubin, apart from diazo reactivity and fluorescence. Why no chromatography? Why no mass spec? Why inflict a quirky conjecture involving a trauma induced bilirubin and “para hemic” methaemoglobin to explain the permanent red colour of the “blood”? That is not science – that is daydreaming and pure fantasy. So sorry, Madam, I am not taking lectures from you or anyone else on scientific methodology and credentials (though I thank you for pointing out that I hold a doctorate) .As for your suggestion that I “always provide misleading answers etc”, it is your own partisan position that is shown up here, not my own, as anyone reading my EXPERIMENTAL postings over the last six months, invariably backed with ample photographic evidence and couched in moderate language should prove beyond all reasonable doubt. Colin Berry aka sciencebod.","date":"2012-06-22","mins":"10:04 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/21/shroudie-congresses-places-where-fantasies-are-peddled-20/","cat":"acheiropoietus","title":"Shroudie Congresses – places where fantasies are peddled…"},{"id":"comment-323","author":"colin_berry","post":"This comment has just appeared on the Other Site, expressing sentiments that I, and no doubt many others, would heartily endorse: June 27, 2012 at 3:54 am | #59 Max says “I am definitely not trying to write a research paper. Here. Just passing/bombarding comments in snatches while working….” And, as a result, wasting everyone’s time. Is there any way of making it clear to you that no one knows what you are talking about for most of the time and so your comments have no value whatsoever. Please think for yourself: “What am I hoping to achieve by entering all these comments’. “.","date":"2012-06-27","mins":"8:23 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/21/shroudie-congresses-places-where-fantasies-are-peddled-20/","cat":"acheiropoietus","title":"Shroudie Congresses – places where fantasies are peddled…"}]
