[{"id":"comment-115091","author":"gerard","post":"This may also go someway towards explaining why Jesus did not survive long on the cross. If He was partially paralysised He would not have been able to pull Himself up to breath. Louis, that movie over did it. The scourging scene does not reflect the the injuries visible on the TS. I believe, except for the crown of thorns & spear wound, Jesus got the standard Roman crucifiction, horrible as it was..","date":"2014-05-08","mins":"11:24 pm","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","title":"Breaking News:  New Injury Details Seen on the Shroud of Turin"},{"id":"comment-21076","author":"gerard","post":"First of all greetings everyone and a very merry and traditional Christmas to all. I have been a Shroudie since I was 10 yrs old. I have read or watched just about all the many papers, books and film on the subject. Yannick, to me your argument is “(The image is) OBVIOUSLTY THAT OF JESUS DEAD AFTER HIS PASSION. Where do you see signs of life (glorious or not) there???” Why could not the moment of resurrection record the state of the corpse? Perhaps at the moment of dematerialisation? The image on the cloth shows a dead body. The image exists because of the resurrection event. Science has proven the first but so far has not disproven the second. Is it wrong to believe this?.","date":"2012-12-24","mins":"3:46 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"id":"comment-21133","author":"gerard","post":"Yannick, nobody knows what a resurection event looks like. Any natural process known might leave an imprint from a body but what about the hair? A natural process also eminating from the hair? What about the time needed for a natural process? If a natural process left an imprint, how could it be a photographic negative in 3 D? Is there any other known example? No. By a process of elimination we get to the only other explaination. A miracle..","date":"2012-12-26","mins":"11:16 am","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"id":"comment-21252","author":"gerard","post":"The Jospice mattress image was created while the poor man was still alive was it not? Over an extended period as he was left in the same position. I think most agree that the man of the Shroud is deceased?.","date":"2012-12-28","mins":"12:06 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"id":"comment-21291","author":"gerard","post":"Max, no one told me. I’m just re acquainting myself with the Jospice mattress. Described by the priest as a surface phenomena just like the Shroud. Les’ position was changed at 5.25am and he died at 5.55am. His body was washed and removed by 11.00am. Btw I got Ian Wilson’s 2010 The Shroud for Christmas but haven’t got through it yet. Presume there is mention of it as the was in The Blood and… Actually, don’t tell me. I want enjoy a good read. Lol And, just on a general point. I know the subject of the Shroud can be very emotive. Please don’t misconstrue anything I might write. I find I’m not as good as some people in getting my point across via a keyboard. I tend not to be as good at it as say arguing my position in person and so tend to go directly for the salient point and not beat around the bush as mostly I deplore typing because I’m so bad at it. In the time it’s taken me to type this I could’ve written a book with a dictaphone. Kindest always, to everyone..","date":"2012-12-28","mins":"7:46 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"id":"comment-21298","author":"gerard","post":"Can you link to your article for me please Louis?.","date":"2012-12-28","mins":"8:46 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"}]
