[{"id":"comment-191495","author":"thibault_heimburger","post":"How is it possible to write that, Andrea? How can you compare Vignon or the problem of the Pray codex with this absurd ‘parody’ ? You are a serious man. So, I can only understand your comment above as a joke..","date":"2015-02-21","mins":"12:55 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","title":"A Bas Relief Match to the Shroud of Turin Image?"},{"id":"comment-136343","author":"thibault_heimburger","post":"In English: http://www.bnf.fr/en/tools/a.welcome to the bnf.html.","date":"2014-07-08","mins":"4:01 pm","url":"https://shroudstory.com/2014/07/08/a-long-cloth-mandylion/","cat":"art","title":"A Long Cloth Mandylion?"},{"id":"comment-136337","author":"thibault_heimburger","post":"It seems that this interesting illustration belongs to a manuscript that is in the ‘Bibliotheque Nationale de France” (BNF) in Paris. The website of the BNF: http://www.bnf.fr/fr/acc/x.accueil.html Some years ago, I went to the BNF for some researches. A quick look at the BNF free research engine ( http://gallica.bnf.fr/) does not provide any link to the original manuscript. If somebody could give me more information (tittle of the manuscript and/or author etc.) I could perhaps obtain more information and/or have a look at the original manuscript..","date":"2014-07-08","mins":"3:53 pm","url":"https://shroudstory.com/2014/07/08/a-long-cloth-mandylion/","cat":"art","title":"A Long Cloth Mandylion?"},{"id":"comment-25676","author":"thibault_heimburger","post":"No Paulette, Colin is right. He discovered the truth: I must confess that I am a member of the TS Secret Confraternity. Dan, you are a member of this confraternity and you should now acknowledge this fact. It is true that in the past the members of our Confraternity did try to hide some facts and they burnt the TS in 1532. They obviously folded the TS as described in the Aldo Guerreschi Michele Salcito paper. More seriously, it is fascinating to observe CB’s evolution. He has now a wonderful scenario for a movie. Thibault..","date":"2013-02-25","mins":"5:54 pm","url":"https://shroudstory.com/2013/02/24/cluny-medal-versus-lirey-badge/","cat":"art","title":"Cluny Medal versus Lirey Badge"},{"id":"comment-145498","author":"thibault_heimburger","post":"Colin: “Why is there so much indifference to the TS image being a negative, when there is no known physics, other than direct contact imprinting, that can produce an image across air gaps without external hardware (converging lens, camera obscura, photosensitive film etc)?” See: http://colinb sciencebuzz.blogspot.fr/2014/08/the turin shrouds all important.html Who says that the TS image is not a contact imprint? Nobody. Everybody agrees that most parts of the body imprints are contact imprints (probably 80% of the frontal image). The true question is: is the TS image a contact ONLY imprint? In order to answer to this question, several researchers performed many detailed experiments in the past. None of them have shown that a contact ONLY mechanism could explain all of the TS image. The TS image seems to be incompatible with a contact ONLY process. The term ONLY is important. In this sense there is a tremendous difference between contact ONLY image and contact+non contact image..","date":"2014-08-22","mins":"4:19 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145725","author":"thibault_heimburger","post":"Colin, I wrote: “The true question is: is the TS image a contact ONLY imprint? In order to answer to this question, several researchers performed many detailed experiments in the past. None of them have shown that a contact ONLY mechanism could explain all of the TS image.” Your answer: “That’s because the modelling assumed a corpse (or human volunteer in lab experiments) and a loosely draped cloth. In other words the model assumed authenticity, and is simply trying to account for apparent discrepancies. Thus we have the absurdity of the ‘collapsing cloth’ theory that even Rogers felt obliged to dismiss as unscientific.” I thought I was clear enough. The researchers in question were mainly anti authenticity researchers who tried to reproduce the TS image using a contact only technique (Nickel, Garlaschelli, Pesce for the scorch hypothesis and others). You wrote: ” One can consider the problem of imprinting into the valleys and hollows of a 3 D template that would normally be inaccessible to a loosely draped cloth that missed them through bridging extremities. That’s where some methodology I described previously comes into its own, i.e. With manual moulding of linen to 3 D relief, increasing the area that is imprinted” At least we agree that the “scorch hypothesis” is a contact only model: no contact=no color. Your experiments as well as my own experiments clearly show that neither convection nor radiation can produce a color in this model. I agree that manual moulding of linen to 3 D relief can increase the imprinted area. This is obvious. However, looking carefully at your crucifix experiments, many areas of your heated crucifix are not at all imprinted (for example the thighs): there is no color at all in those areas. Your 3 D rendering is misleading: these uncolored areas seem to have 3 D properties (Image J) but these pseudo 3 D properties (in those uncolored areas) come from the shadows coming from the “valleys” in the fabric which are only the result of the pressure applied to the fabric. In practice, it seems very difficult (according to my and your experiments) to obtain a color from the “valleys” of the template. You wrote: ” As for contact or contact only, I consider that a semantic irrelevance, believing as I do that there is no known physics that will imprint across air gaps. If you or anyone thinks there is, Thibault, then please specify the nature of the process. Is it convection or radiation? If radiation, is it electromagnetic or not? if electromagnetic, which part of the spectrum?” You know what? I have to thank you for your help. Sincerely. You will have my answers tomorrow in my final PDF paper (including new experiments, answers to your previous criticisms and more ..). I know you don’t like PD Fs.However I have no other mean to present my thoughts, my experiments and my photographs..","date":"2014-08-23","mins":"8:03 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145865","author":"thibault_heimburger","post":"Thanks Colin But I can’t see this “another image”… Dan?.","date":"2014-08-24","mins":"4:21 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-145857","author":"thibault_heimburger","post":"Hi Colin, ‘Maybe pdf has a different meaning in French. Potpourri de fantasie? ; )’ You mean ” Pot pourri de fantaisie” I like it! We need humour and I am sincere. We are not enemies. I am writing my new and last PDF. I would like to include some of your pictures in this PDF. Do you agree?.","date":"2014-08-24","mins":"3:28 pm","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-192719","author":"thibault_heimburger","post":"I agree Hugh, Some thoughts in haste. I have seen all of the pictures provided by Skeptic. In all of them, the ‘rectangle’ is obviously interpreted as the lid of the sarcophagus. It it not at all the case for the ‘rectangle’ of the Pray Codex. Why? It is AS IF the author of the manuscript had tried to represent another thing. Something with stepped pyramids (herringbone weave ?), two red lines (blood ?), rounded circles (holes ?)….","date":"2015-03-07","mins":"4:06 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192817","author":"thibault_heimburger","post":"I wrote: “I have seen all of the pictures provided by Skeptic. In all of them, the ‘rectangle’ is obviously interpreted as the lid of the sarcophagus. It it not at all the case for the ‘rectangle’ of the Pray Codex. Why?” Skeptic answered: “Thibault, I think this begs the question…” No, this is the key point. Let me explain. If the upper rectangle is a lid (Proposition A= true) then the lower rectangle is necessarily the sarcophagus (Proposition B = true). A (true) implies B (true). Do you agree ? The skeptics thinks that the upper rectangle cannot be anything else than a lid. It is true that the rectangular shape of this object strongly suggests that it is a lid. But it is also true that , in the context of medieval paintings and illuminations of this particular event, the lids (when present) are not similar to the ‘lid’ of the Pray Codex. They are always depicted as an homogeneous rectangle and very often, their three dimensional properties are obvious. To the contrary the upper rectangle of the Pray Codex is bi dimensional (flat) and heterogeneous (two parts with something which can be interpreted as a stylized herringbone weave, the other part with crosses). Therefore we can not know with certainty what is the upper rectangle. In this case, I suggest to test the hypothesis: If B is not true then A is not true. Logically, this proposition is strictly equivalent to the previous one: If A is true then B is true. In other words, if the lower rectangle is not a sarcophagus, then, the upper rectangle is not the lid of this sarcophagus. Therefore the question is now: does the lower rectangle of the Pray Codex represent a sarcophagus or not ? I have uploaded the 70 first pictures cited in David Mo: https://sombraenelsudario.wordpress.com/2014/08/10/las santas mujeres en la tumba vacia imagenes/ Thanks to you David for this work. If you look at ALL these pictures, you will discover that in almost all the pictures the sarcophagus is clearly depicted as a sarcophagus. I mean a 3 D object that is immediately understood as the sarcophagus of Christ (in this context). At this time (XI XV century), the painters were truly able to represent the 3 D properties of an object via some kind of perspective (even a naive perspective). I only could find 4 pictures in which the sarcophagus is depicted as a flat 2 D rectangle. But in these cases, the painter used some ‘trick’ so that the observer immediately understands that this object is in fact a 3 D object. The fact is that there is nothing in the lower triangle of the Pray Codex suggesting a 3 D object, i.e a sarcophagus. This is the key point. As shown by the other paintings in the Pray Codex, the author of the Pray Codex was certainly not an amateur. In other words, if the author of the Pray Codex wanted to depict the sarcophagus in the lower rectangle, he would have used beyond any doubt some kind of 3 D representation. Therefore, the lower rectangle can not be a representation of a sarcophagus. Therefore the upper rectangle can not be the lid of this sarcophagus. So what is it ? Skeptic asked: ‘ But anyhow: do you think the two rectangles represent the two halves of the shroud?’ My answer: yes. More later…..","date":"2015-03-08","mins":"3:14 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192986","author":"thibault_heimburger","post":"Dear Hugh, ” But chiefly I agree with Gian Marco that this is in many ways a typical Three Marys scene, which demands certain traditional elements, including (by this time) a sarcophagus and a lid, more or less rectangular, and a shroud, more or less crumpled into a heap. These elements are present. If the artist wanted to show the shroud more clearly, he would have added it to the composition, not substituted it for one of these elements, and if he had wanted to create a new icon altogether, he would not have made it so similar to the previous icon that it could easily be mistaken for it.” You have understood perfectly my reasoning. I agree that the Pray codex is a three Marys scene, that typically contains one element: the sarcophagus and very often the shroud and often the lid. But here the problem is that the lower rectangle, which is assumed to be the ‘sarcophagus’ does not look at all like a sarcophagus for the reasons I explained. If the only feature (the sarcophagus) that is ALWAYS found in the Marys scene is absent (i.e as a 3 D object), There are 3 possibilities: 1) the painter was truly hopeless. I don’t think so. All of the paintings (even the most naive) shows that at the time everybody could represent more or less a 3 D object. The high (the third dimension) of an object is always shown and obvious. For example, on the Pray Codex (upper scene), we can see that the author was able to represent the 3 D (the high) of the table. 2) The painter was sure that, despite the lack of 3 D characteristics, his lower rectangle would be interpreted as the sarcophagus. I cannot eliminate this hypothesis. 3) Although the whole scene is a ” three Mary scene”, the upper and lower rectangles does not represent the sarcophagus and the lid but Christ’s shroud. After all, the shroud was in the empty tomb. Let’s try to interpret the Pray Codex this way: the Angel shows Christ’s shroud, not the sarcophagus. More later….","date":"2015-03-09","mins":"4:09 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-190444","author":"thibault_heimburger","post":"I agree with David. 135 comments (!). Most of them have nothing to do with the subject. Moreover, 80 90% of these ‘comments’ made by Max are truly foolish, insulting and out of topic (Jules Vernes, Rose Croix..). Why not the Alien ??? I regret that some of you have decided to answer to him. This is pity! Do not answer please! Colin wrote: ‘I’ll continue to respond to questions put to me personally (common courtesy) but I can say with a fair degree of certainty that I’m now largely finished with this site, having sussed out (I think) the mindset that sustains shroudology”. Me too. Thibault..","date":"2015-02-09","mins":"4:30 pm","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-190601","author":"thibault_heimburger","post":"“Max is doing some excellent work … ” ???: ((!! (Of course, this is a Cryptographic Rosicrucian anagrammatic reference). Dan, your blog is a wonderful mean to discuss seriously about the TS, including scientific, historical or theological points of view. Look carefully at this thread. The first 17 comments are interesting and (more or less) related to the subject. Then Max wrote: ” NO WONDER antibiotics may by their very success prove to be a deciding factor in the decline of the present civilization…” (!!!) And then :” Ever heard of VERY CHEAP probiotics?” Capital letters are from Max himself. Antibiotics, probiotics !!!! Finally and sadly Max succeeded in introducing his own obsessions. Now, in this tsunami, I am simply unable to find easily the comments of Colin or Hugh (etc.) to which I would like to answer. Dan , you wrote: ” Maybe a limit on the number of comments per day. What do you think ?” IMHO, I do think that a limit of 5 comments per day (not only for Max but for everybody) could be an acceptable compromise..","date":"2015-02-10","mins":"4:43 pm","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-190074","author":"thibault_heimburger","post":"Thanks Daveb for the link http://www.shroud.com/pdfs/stlmarkwardtpaper.pdf I have read it carefully. This is a very complex problem and I am not all all qualified to give any kind of judgment. I can only say that Markwardt’s paper must be read carefully by the historians. Colin, you wrote: “Yes, but what one seeks is just one teeny weeny hint in the historical record that there was a life size imprint on linen of a TS like double image prior to 1355”. According to Jack Markwardt, we have several historical records of a life size image on linen many centuries prior to 1355, namely the “Image of God Incarnate”. In addition, Jack provides an interesting (historically based) explanation regarding the apparent disappearance (!) of this relic in Constantinople. Historical records must be criticized with the historical method, taking into account the context etc. But in any case, nobody can state that there is absolutely nothing about a life size image of Christ on linen before 1355 in Lirey..","date":"2015-02-07","mins":"4:36 pm","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-191672","author":"thibault_heimburger","post":"Hugh, maybe I was not clear enough. I wrote: ” “But what is the probability that a MEDIEVAL forger could paint a ‘negative’ image that matches the accurate ‘photographic’ negative properties of the TS image? The fact is that the painters who tried to reproduce the TS image itself failed to reproduce the negativity.” The painters in question are the MEDIEVAL painters and the fact is that the MEDIEVAL reproductions of the TS (“the painters who tried…”) do clearly show that these artists were unable to understand the concept of negativity. Do you agree now ?.","date":"2015-02-23","mins":"3:55 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191586","author":"thibault_heimburger","post":"Not so disturbing. Basically, Brian Lai first drew an eye and then inverted the colors (white–>black and black–>white) It is a typical modern way of thinking. In order to think so, one has to know the modern concepts of photographic positive and negative. If a medieval forger had to paint an imprint of a body on a sheet, he should have to represent via painting some kind of cloth to body distance or pressure. For example, he should have to paint more heavily the parts of the body which are in close contact with the cloth. This is possible. But what is the probability that a medieval forger could paint a ‘negative’ image that matches the accurate ‘photographic’ negative properties of the TS image? The fact is that the painters who tried to reproduce the TS image itself failed to reproduce the negativity. This shows that the concept of ‘photographic’ negativity of the TS image was not accessible to a medieval forger..","date":"2015-02-22","mins":"4:14 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-184910","author":"thibault_heimburger","post":"Charles, You made some claims. For example the article about the Zittau Veil. For example: “.A photograph from the beginning of the twentieth century shows that the veil must have been in good condition until the Second World War , ..; from our point of view the cloth was in a nearly intact state.’ Where is this photograph? In the article or elsewhere? Google does not provide any high resolution picture of this veil. Please, show us the Villers article, the photographs etc. Without any kind of concrete example, this discussion is meaningless..","date":"2015-01-20","mins":"3:28 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-184598","author":"thibault_heimburger","post":"Thanks Henrik for recalling me this interesting paper. There are some points I wish to comment. Looking at the many reproductions of the face (Fig.1), we better understand how far were the medieval painters from the concept of negativity. They tried to simply reproduce what they saw. They made several mistakes. In most reproductions we understand that they tried to “reconcile” the “strange” figure they saw with the usual characteristics of a human shape, an albedo (see for example the rounded open eyes). In the context of the Shroud, Negativity is linked to some kind of body/fabric distance. On the basis of the reproductions, it is even not obvious that a medieval painter could think in such a way. Some of the reproductions do show an attempt to reproduce the faintness of the image. This fact implies that about 150 years after Lirey, the Shroud image was more or less as faint as today. Fig.23 and 24 show pigment flakes, not found on the Shroud. For some of you, the pigments disappeared with time and/or (alleged) washing etc…living only the medium (Gesso, Gum Arabic ….). Even in this case, I think it is impossible for many reasons..","date":"2015-01-19","mins":"3:56 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185790","author":"thibault_heimburger","post":"David Mo wrote: ““IN 1527” is not present anywhere on the Noalejo’s shroud. It is a free translation of the text. This is not serious from the point of view of the epigraphy.” No, it is not a “free translation of the text” “1527” is obvious on the dorsal side of the Noalejo’s shrouds. Http://www.academicjournals.org/article/article1380797649 Barta%20and%20 Carrascosa.pdf David knows that but (if I understand well), he wants to read something that “made in 1527”. According to him, since “IN 1527″ (Capital letters are from David) is not written,we can not be sure of the true date of this painting. Moreover, ” This is not serious from the point of view of the epigraphy” Epigraphy ? Look at the 1571 Alloy painting which shows exactly the same epigraphy, and we don’t see “IN 1571”, just “1571”, with the same characters than those found in the Noalejo’s shrouds. In the latter reproductions of the Shroud, the letters are different and much more similar to our modern numerals. This strongly suggests that the Noalejo’s shrouds were truly painted in 1527. “For example, we cannot exclude that the cloth don’t be a free copy of a copy of a copy made in more recent date than 1527.” This sentence makes no sense. In this case, why 1527 ? The Noalejo’s shrouds were painted in 1527. Therefore, ” Charles should reconsider some points of this article”..","date":"2015-01-23","mins":"4:02 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185190","author":"thibault_heimburger","post":"“Is it not easier to explain added details in a copy of a faint original than to explain why the artist chose to paint a faint copy of the much more vivid original?” I do not see any added detail in this beautiful copy. To the contrary I do see some missing details (for example the epsilon blood mark). The attempt to create a faint image with fuzzy contours is obvious. It is the best example of such an attempt but not the only one. Why a painter of the 16th century would reproduce a faint image, if the original was not faint at the time? This is a non sense. We can be sure that in 1527 the image was about the same as the Turin Shroud we see today: a faint image with fuzzy contours an without any added “details” like a crown or a loincloth. The observation of this beautiful and successful reproduction of the TS before the Chambery fire is very interesting. I’ll look at it in detail..","date":"2015-01-21","mins":"4:20 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-186213","author":"thibault_heimburger","post":"Hugh, I think you gave the answer. “Firstly, almost all the illustrations of ostentations in Beldon Scott are of engravings or woodcuts or prints, which do not lend themselves to indistinct representations of anything, while the copies in cloth mentioned above are paintings, which can be as faint as you like.” The illustrations of ostentations are constrained by technical considerations. The painted copies are not constrained. Conclusion: the illustrations of ostentations can not be a reliable source for the the knowledge of the TS as it was seen at the time. The painted copies are the only one able to give some information about the TS as it was seen at the time. In this sense the study of the shroud of Arquata is very important. Https://shroudstory.com/2015/01/24/new paper on the shroud of arquata/.","date":"2015-01-25","mins":"3:42 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-186463","author":"thibault_heimburger","post":"Hugh, maybe I missed something. Do you think that the drawings of public exhibitions (the basis of Charles’ claims) do represent the TS as it was or do you prefer to look at the many paintings which were made (for most of them) by a direct viewing of the TS?.","date":"2015-01-26","mins":"3:06 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"}]
