[{"id":"comment-211108","author":"thibault_heimburger","post":"Dan: Sorry, but you blog appears to be now something like a an English tabloid. See for example: “Barrie M Schwortz, now a self styled scientist, fronts what can only be described as a pro authenticity road $how. It must be a nice little earner…” What do you think?.","date":"2015-09-24","mins":"4:05 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"id":"comment-213853","author":"thibault_heimburger","post":"Hugh, you are right but it’s only a Power Point presentation. Yes, the foundation of Mc Crone’s “painting” hypothesis is based and only based on the particles. This is is main error. The problem of the Shroud image is NOT a question of particles. MC himself recognized that the color of the image is mainly due to the yellow fibers. Http://www.shroud.com/pdfs/thibault%20final%2001.pdf.","date":"2015-10-29","mins":"2:14 pm","url":"https://shroudstory.com/2015/10/29/battle-of-the-chemists/","cat":"presentation","title":"Battle of the Chemists"},{"id":"comment-215255","author":"thibault_heimburger","post":"“Apart from the very obvious mending around the burns, and the hemming around the edges of the cloth, there is no evidence of any repair elsewhere on the Shroud, is there?” According to the textile experts, no. According to Rogers’ experiments on actual Raes/C14 threads, yes (cotton content, dye, splice in Raes#1,vanillin). There is a conflict between two types of expertise. The Shroud must be dated again..","date":"2015-11-28","mins":"4:01 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","title":"Finally, An Explanation for the Exclamation Mark!"},{"id":"comment-211093","author":"thibault_heimburger","post":"David: “Do I think he is doing these talks/presentations simply for monetary gain and late life fame? No. But I can’t know his motivation without being able to read his mind and heart. Can anyone besides Barrie?” CB: “I think otherwi$e, David G.”. See this infamous “$” I know personally Barrie since about 10 years. I know that he is the most honest person I ever meet. His motivation? David, I can’t believe you don’t know his motivation. I am disgusted by these comments. Adieu. Thibault..","date":"2015-09-24","mins":"2:58 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"id":"comment-194883","author":"thibault_heimburger","post":"Adler: ““All the types of Shroud fibers gave positive tests for only two elements, calcium and iron. However, these elements do not derive from the presence of iron oxides or calcium carbonates in the fibers, as positive tests are obtained without the need for prior acidic digestion and therefore these elements can be considered as being coordinately covalently bound to the linen’s cellulosic structure. Other samples of old linens show the same type of results and therefore the presence of these elements can be ascribed to chemistry arising during the manufacture of linen from flax, e.g;, the retting process carried out in naturally hard waters”. This shows (if necessary..) that Adler performed his experiments very conscientiously and with control samples. His results show that there is no evidence of added calcium on the shroud, therefore no evidence of gesso. Of course, this fact itself does not eliminate the possibility that a thin layer of gesso (Calcium carbonate+proteins) was applied on the surface of the Shroud. The key is that gesso always contains a proteinaceous binder. Adler clearly demonstrated that there is absolutely NO protein on the Shroud (except in the blood stains). Even if all the pigments are now lost, we should find some traces of this proteinaceous binder at the surface of the shroud. There is absolutely no cementation of the fibers, there is absolutely no evidence of any kind of proteinaceous binder (using both micro chemistry and micro spectroscopy) on the Shroud (except the blood stains). Charles: “Carbonate used to this day to seal linen before the paint is applied to the outer fibrils ( thanks STURP).” Charles, you can not use some STURP data (Calcium) and “forget” the analysis of these data. Given all of the STURP the data, your “hypothesis” is completely ruled out..","date":"2015-03-30","mins":"3:42 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-126332","author":"thibault_heimburger","post":"Ok, you wrote (to Joe): ” And please, it would be good to post an answer for the second question in this topic https://shroudstory.com/2014/05/31/were both ventral and dorsal corners of the shroud rewoven/” What is this “second question” please ?.","date":"2014-06-02","mins":"4:27 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-128016","author":"thibault_heimburger","post":"Dear Giorgio, What do you mean by “Section D” ?.","date":"2014-06-09","mins":"3:00 pm","url":"https://shroudstory.com/2014/06/08/anticipating-the-conference-thibault-heimburger-on-rogers-samples/","cat":"st_louis_2014","title":"Anticipating the Conference: Thibault Heimburger on Rogers’ Samples"},{"id":"comment-173628","author":"thibault_heimburger","post":"Well, I wonder… I was there and made my presentation. I don’t remember if Russ was sleeping : ) But, it’s not really important. You’ll have the entire paper in the next update of shroud.com..soon..","date":"2014-11-29","mins":"1:16 pm","url":"https://shroudstory.com/2014/11/26/st-louis-videos/","cat":"st_louis_2014","title":"St. Louis Videos"},{"id":"comment-173639","author":"thibault_heimburger","post":"I don’t think so. Bob clearly reported that Rogers maintained a strict chain of custody on everything he had. In my paper, I have shown that there is little doubt that the Raes and radiocarbon Rogers’ samples are both genuine Shroud samples. And more… First, we can conclude that the 2008 Bob Villareal paper concluding that the Raes threads are made of cotton (and not linen) is no longer reliable. At the time, they had no ancient/processed linen for comparison. “However ageing/processing of linen can dramatically change the spectral characteristics. This make it very difficult to conclusively identify an unknown sample”. This explains the discrepancies between Bob’s 2008 paper and my own findings: the large majority of Raes 7 (one of the threads studied by Bob) is made of linen fibers although 10 20% of the fibers are cotton. Bob’s problem is that the properties of the threads/fibers analysed by FTIR etc. Seem to be very different from of piece to another. So, he is very “confused”. Bob: “The Shroud data were highly variable. Some fibers appeared very similar to the ancient linen standards. Other were (more ?) similar to modern cotton or processed linen ..” Is it not what is expected from a “mixture” of threads in this area? I am waiting for the precise data of Bob’s paper..","date":"2014-11-29","mins":"2:49 pm","url":"https://shroudstory.com/2014/11/26/st-louis-videos/","cat":"st_louis_2014","title":"St. Louis Videos"},{"id":"comment-177833","author":"thibault_heimburger","post":"Hugh, Pam’s paper follows this one, which is more detailed: http://www.shroudofturinexhibition.com/Shroud of Turin exhibition/Home files/Updated report on the Consideration to the Uniformity and Effects of the Fabric in the Shroud of Turin 5 1.pdf I do not understand your sentence: “Pam’s excellent paper has elegantly demonstrated how little contamination there is, and therefore how unlikely it is that any reweaving has had any effect on the C14 dating.” What about the “stain”, the shrinkage (” Shrinkage is possible but the distortion within this area is so localized and acute that interference of a different kind such as mending maybe worth considering (Fig 20)”), the possible stitches, the differences in the spaces of the warp and weft interlacement (Fig.16), this strange black fiber … I agree that none of these observations necessarily imply reweaving. But they possibly suggest reweaving and in this case why do you think that this reweaving would have had any effect on the C14 dating. Why are you speaking of “little contamination” in this context ???.","date":"2014-12-19","mins":"4:15 pm","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","title":"New Paper by Pam Moon"},{"id":"comment-162703","author":"thibault_heimburger","post":"“St.Louis managed to plumb new depths in pushing that agenda.” It seems that some people are able to make some definitive comment about the St Louis conference without having any knowledge of the content of the papers. For me, several papers were very interesting: – Spectroscopic Analyses Of Fibers From The Shroud Of Turin–What Do They Mean? – Speculations On The 14th Century Origins Of The Turin Shroud. – Study Of Shroud Feature Evidence Using Video And Photogrammetric Analysis Methods – The Mandylion Or The Story Of A Man Made Relic by my friend Sebastien Cataldo (with the help of Yannick) – The Future Of Research On The Shroud * – Hypothesis That Explains The Shroud’s Unique Blood Marks And Several Critical Events In The Gospels – A Critical (Re)Evaluation Of The Shroud Of Turin Blood Data: Strength Of Evidence In The Characterization Of The Bloodstains *. A particularly clear and interesting paper by Kelly Kearse. – The Hypotheses About The Roman Flagrum: Some Clarifications – Modern Scholarship And The History Of The Turin Shroud – The Full Length History Of The Turin Shroud – Constantinople Documents As Evidence Of The Shroud In Edessa – Maybe my own paper: The Origin Of Rogers’ Raes And C14 Samples – And the open discussion: Future Testing Of The Shroud The authors can be found here: http://www.stlouisshroudconference.com/app get involved/program. There were at least 11 papers that, in my opinion, were well informed. Most importantly, I have seen several people with opposite opinions discussing peacefully over a glass of wine. Friendship and respect were the key words of the Conference. Dan wrote: “We all owe a debt of gratitude to Joe Marino and his committee” Yes..","date":"2014-10-15","mins":"5:19 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-173763","author":"thibault_heimburger","post":"Bob:”You don’t know where it comes from, you don’t know what the history of it is, you don’t know who has had this sample… It’s a mystery how we can get anything to agree with these samples if we don’t have of those parameters…” Well, I think the answers are in my paper. “Have they tried to analyse individual fibers since 2008? Because it looks like he is reinterpreting his 2008 paper without new analyses.” That’s why I wish to look at his paper. I was there during Bob’s presentation but I must confess that many things were not clear for me because of my poor understanding of spoken English ….","date":"2014-11-30","mins":"5:47 am","url":"https://shroudstory.com/2014/11/26/st-louis-videos/","cat":"st_louis_2014","title":"St. Louis Videos"},{"id":"comment-26540","author":"thibault_heimburger","post":"Yannick, Obviously you think that I am stupid man. When I wrote ” whatever your explanations” any intelligent man should have understood that I perfectly understood that you were using an analogy. But they are different kinds of analogy. I repeat: comparing “biased science” of the Nazis with “biased science” of some Shroud researchers you hate is not only an insult but, above all, a non sense. There is an enormous difference and science has nothing to do with that. What difference ? In the first case (the Nazis) killed thousands of people to “prove” their racist theories. With the Shroud, we are dealing with a linen sheet. Be careful..","date":"2013-03-05","mins":"4:35 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26437","author":"thibault_heimburger","post":"Dear all, Just some thoughts in haste. Although I agree with most of Yannick’s theological points of views, I completely disagree with his behavior. Hugh and others are honest researchers. Yannick, The “Nazi” reference is absolutely revolting (whatever your explanations). Peace. Thibault..","date":"2013-03-04","mins":"5:10 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"}]
