[{"id":"comment-328","author":"thibault_heimburger","post":"On 24/6, I received in my mail box a message from “casting a critical eye…” (you), beginning by the words “Hello Thibault; is is kind of you visiting my humble blog..”; On 25/6, I replied using the same way (=privately = it does not appear in your blog). This is the message I was speaking about. Apparently, it does not work. No, the ME photographs are not in the public domain. Would you give me your private email and I’ll send you immediately my previous email..","date":"2012-06-27","mins":"10:01 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/23/reply-in-small-considered-instalments-to-thibault-heimburger-re-my-sorry-mr-rogers-posting-2/","cat":"blood","title":"Reply  – in small considered instalments – to Thibault Heimburger re my “Sorry Mr.Rogers” posting"},{"id":"comment-50466","author":"thibault_heimburger","post":"Very good remark/question David.","date":"2013-11-08","mins":"4:26 pm","url":"https://shroudstory.com/2013/11/07/a-guest-posting-by-o-k-on-the-allegedly-too-long-fingers/","cat":"guest_posting","title":"A Guest Posting by O.K. on the Allegedly Too-Long Fingers"},{"id":"comment-326","author":"thibault_heimburger","post":"I will not comment your ad hominem attacks. Except that your description of my job is an insult, not only for me but for the many people I try to treat. You obviously don’t know what you are speaking about. A few days ago, I gave you privately the possibility to obtain for free some of the Mark Evans photographs (no answer, no thanks) from the copyrights owner. There are at least 3 of them showing bloodstains from low magnification (with the weave pattern, furrows etc..) to high magnification. By looking at them, you’ll obviously see that you are completely wrong. Regarding the proteolytic enzyme (please read carefully the original article), you’ll find the details of the experiment. But, most important your comment ” and when nothing is known for certain about the integrity of the target protein, or the presence or absence of other proteins, e.g those of flax cells that may play a role in image formation and adhesion” is simply a non sense in this context. Incidentally I also have a degree in Biology. I’ll probably will not waste my time here..","date":"2012-06-27","mins":"8:53 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/23/reply-in-small-considered-instalments-to-thibault-heimburger-re-my-sorry-mr-rogers-posting-2/","cat":"blood","title":"Reply  – in small considered instalments – to Thibault Heimburger re my “Sorry Mr.Rogers” posting"},{"id":"comment-181329","author":"thibault_heimburger","post":"Thanks to the pigs! Seriously, I do consider this paper as one of the most interesting paper regarding the “blood problem”. Read it carefully. Looking again at my M.Evans collection, it is clear that the blood stains on the Shroud are not whole blood but serosanguineous exudates. I agree with Adler. This paper must be considered as a a starting point. Some ideas for new experiments with my own blood ? Happy New year to all of you..","date":"2015-01-04","mins":"3:21 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181668","author":"thibault_heimburger","post":"Dear Mario (bonne année à vous!) You wrote:”There are at least two types of bloodstains coming from the hair that should be considered separately. 1) The bloodstains that appear coming from pressure, such as the ones on the back of the head. 2) The bloodstains that appear not coming pressure, such as the ones from the front side. They do appear differently. Right?” And: “The compressed explanation I gave, is for the back, not the front”. Thank you for this clarification. I agree. I was speaking about the rivulets seen on the front side in the hair. The bloodstains on the back of the head seem to be much more realistic. As I wrote, ” blood impregnates the hair locks whose roots are in/near the injury”. This is perfectly seen in the beautiful photo from OK above. Look at the blood in the hair versus blood on skin. The blood imprints seen in the hair on the front side are compatible with blood on skin but not with blood on/from hair. My thoughts: what we see on the back of the head is the contact imprint of some hair locks full of blood. But you then wrote: ” The bloodstains you mentioned, coming from the front on the side of the face, cannot be coming directly from the scalp, because these bloodstains are far away from the scalp. They could simply be coming from the hair from blood that drips from the head into the side hair. I could should [??] you such transfer, from hair to cloth by using a viscous liquid. They look similar as we see on the Shroud.” Sorry, I don’t understand!! And if you have some “hair to cloth” transfer experiments, can you show them? Thank you. Thibault. PS: you wrote: ” Have you tried to put some blood (or viscous liquid) on some hair and pressed them on a cloth and see the result?” I can try with my own blood. But, sorry, my hair is not long enough ; )) I have to think about that !!.","date":"2015-01-06","mins":"3:34 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181891","author":"thibault_heimburger","post":"Thanks Mario, I’ll read carefully your comment tomorrow. But today, as everybody in France, I am to much shocked by the ultra violent terrorist attack in Paris..","date":"2015-01-07","mins":"3:07 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181501","author":"thibault_heimburger","post":"Dear Mario, Blood in the hair. Before looking at blood transfer from the blood in/on the hair to the cloth, we must know how blood flows in the hair when there is an injury in the scalp. The answer: blood impregnates the hair locks whose roots are in/near the injury. Therefore any bloodstain in the hair coming from the crown of thorns must be consistent with the hair image. There are blood images in the hair (frontal side) which are NOT consistent with this fact. Mainly the winding blood mark seen in the hair area (front side). It is simply impossible even if “the hair is compressed against the bloody wounds on the scalp and the blood seeps through the hair ” However, if this blood rivulet does not come from the hair but from the face (as shown by Lavoie and Adler, with experiments), there is no more problem..","date":"2015-01-05","mins":"3:35 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"}]
