[{"id":"comment-3022","author":"thibault_heimburger","post":"There is no doubt that suaire comes from sueur which itself comes from sudarium. But what is the question? Your question, if I understand well was: why do we see the term suaire and not the term linceul on the Lirey badge? Because in old French suaire was the only word that could point to the linen sheet that was used For Jesus burial (in the context of the Lirey shroud) They did not use the term linceul because at the time, the term linceul referred to every kind of sheet www/cnrtl.fr/etymologie/linceul.","date":"2014-02-16","mins":"8:22 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2014/02/15/how-a-cunning-14th-century-visuo-semantic-marketing-ploy-helped-establish-the-authenticity-of-the-shroud-and-corrupted-the-french-language-into-the-bargain/","cat":"alain_hourseau","title":"How a cunning 14th century visuo-semantic marketing ploy helped establish the ‘authenticity’ of the Shroud – and corrupted the French language into the bargain."},{"id":"comment-3019","author":"thibault_heimburger","post":"Http://www.cnrtl.fr/etymologie/suaire As early as 1175 or 1273 (in an epic poem: “le sac de Rome”), the term “suaire” has been used as equivalent to shroud. It comes from the the latin word “sudarium”, which in the ecclesiastic Latin (as opposed to classical Latin) referred to “the linen that was used to bury Christ”. Even today, most if not all of the French people understand “suaire” as meaning a burial cloth and not as a “face cloth” (there is no word in modern french for “face cloth”) !! The idea that the term “suaire” makes ” an early appearance in the context of the Shroud” is false..","date":"2014-02-16","mins":"12:52 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2014/02/15/how-a-cunning-14th-century-visuo-semantic-marketing-ploy-helped-establish-the-authenticity-of-the-shroud-and-corrupted-the-french-language-into-the-bargain/","cat":"alain_hourseau","title":"How a cunning 14th century visuo-semantic marketing ploy helped establish the ‘authenticity’ of the Shroud – and corrupted the French language into the bargain."}]
