[{"id":"comment-6824","author":"thibault_heimburger","post":"And now a new experiment with eggs! Why ? Where are you going Colin? I am waiting for the result of your previous flour imprint model applied to a real human face and/or a bas relief (not only the hands). Science (and the problem of the TS image) is not a game..","date":"2016-01-22","mins":"8:59 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)"},{"id":"comment-6826","author":"thibault_heimburger","post":"Still waiting for the result of your previous flour imprint model applied to a real human face and/or a bas relief (not only the hands). No more no less..","date":"2016-01-22","mins":"9:18 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)"},{"id":"comment-6836","author":"thibault_heimburger","post":"Colin, please call me Thibault and not TH. You proposed a testable scientific model, namely the “flour imprinting model” for the TS image. Nice. This model must be tested and compared with the original. At first glance, it seems that this model is interesting. One of the main question is: is it possible to get an imprint similar to that of the TS face using your model? I’m just asking the answer to this question, knowing that you could give us the answer easily. For your information, I am doing experiments based on Mc Crone’s claims and based on own flour imprinting model (using a Christ like bas relief face)..","date":"2016-01-23","mins":"8:52 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/21/more-original-cutting-edge-stuff-from-hugh-farey-appears-in-his-latest-bsts-newsletter-no-82-december-2015/","cat":"1532_chambery_fire","title":"More original, cutting edge stuff from Hugh Farey appears in his latest BSTS Newsletter No.82 (December 2015)"},{"id":"comment-77552","author":"thibault_heimburger","post":"Yes rigor mortis takes usually 12 hours to develop. But “after violent death, rigor mortis begins quite rapidly (usually within 1 to 2 hours after death” (Zugibe, the crucifixion of Jesus, 2005). This is called “cadaveric spasm”. “Likewise, the legs, which were in slightly bent position, would maintain the same type of cadaveric spasm and subsequent rigor mortis prior to being taken down from the cross” (idem). According to Zugibe, there is no problem at all. Therefore, the scenario is: Jesus died: 3 pm Rigor mortis (cadaveric spasm) began between 4 and 5 pm and achieves completion quickly (including the legs). Jesus was still on the cross: “likewise, the legs, which were in slightly bent position, would maintain the same type of cadaveric spasm and subsequent rigor mortis prior to being taken down from the cross” (idem) Probably between 6 and 7 pm, Jesus’ body was taken down from the cross. The rigor mortis was complete. Burial completed before 7 pm: just before burial, rigor mortis was broken. ” When the man of the Shroud was taken down from the cross, the rigor mortis was broken in the arms and legs in an attempt to flatten out the body prior to placing it in the Shroud” (idem). Interestingly (my own point of view), the fact that on the Shroud there are some blood stains in the area of the back of the knees and no image suggests that the breaking of the legs failed. They tried (explaining the blood stains) but they failed (explaining the bent legs). David: “How does the rigor/not rigor argument affect the bas relief scorch theory – if at all?” I can’t see how any kind of bas relief scorch theory could explain the bent position of the legs. It seems to me impossible..","date":"2014-02-08","mins":"5:27 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-79439","author":"thibault_heimburger","post":"I completely agree with Mario. What does mean: “some circular or elliptical crushed shapes would be visible”? How can it be visible ? Only by the 3 D rendering of the dorsal TSM image. It is well known that the dorsal image shows few 3 D properties ( withe regard to the frontal image). This fact alone is significant. Look at: http://thierrycastex.blogspot.fr/2012 09 01 archive.html Particularly at Fig.4 and 4bis Lavoie’s paper is fully irrelevant because he did not even consider rigor mortis (and it is obviously agenda driven)...","date":"2014-02-14","mins":"5:46 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-186713","author":"thibault_heimburger","post":"I wrote: “more later…” Back to the 1653 shroud of Arquata (and there is no doubt about the date) I have translated the whole paper (via Google), I have seen the powerpoint presentation from Bari and I have discussed with Paolo Lazzaro. How do you interpret the following facts: – The contours of the body, the bloodstains, the hair (and the letters) are clearly seen and made with pigments. – The inside of the “body image” do not show any kind of pigment. It shows ONLY some kind of mechanical “abrasion” of the warp threads only and probably a sponge like passage for the “face” (which in fact do not show any kind of anatomical feature). Whatever the mean used by the artist, his purpose is obvious: to show or imitate the very faint color of the body image of the TS in 1653. This is linked to this discussion: https://shroudstory.com/2015/01/18/you cannot fold and unfold a painting and more/ Comments are welcome..","date":"2015-01-27","mins":"3:57 pm","url":"https://shroudstory.com/2015/01/24/new-paper-on-the-shroud-of-arquata/","cat":"history","title":"New Paper on the Shroud of Arquata"},{"id":"comment-186020","author":"thibault_heimburger","post":"I am not sure you understand the importance of this paper. For the first time, we have a scientific study of a unique 1653 copy of the Shroud. This copy is unique for many reasons. More later….","date":"2015-01-24","mins":"4:39 pm","url":"https://shroudstory.com/2015/01/24/new-paper-on-the-shroud-of-arquata/","cat":"history","title":"New Paper on the Shroud of Arquata"},{"id":"comment-28087","author":"thibault_heimburger","post":"Colin, You wrote: ” Nope, I don’t claim to be a giant of a scientist – but I was the first to propose photoisomerism as the crucial step – and if Adler had approached me re his bilirubin hypothesis, I’d have told him to read a few papers on the chemistry of that substance, and why it is highly improbable it would form an binary adduct with methaemoglobin, due to intramolecular hydrogen bonding, and why bilrubin could never confer everlasting stability to a second substance (the permanent red colour of Shroud blood) due to its instability to light and oxygen.” Would you please be kind enough to give me/us the references of the “few papers on the chemistry” of bilirubin ?.","date":"2013-03-22","mins":"4:25 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-174655","author":"thibault_heimburger","post":"But this is THE problem, Colin. We agree that there is an asymmetry in the facial features. But is is not any kind of asymmetry. This is an asymmetry which is perfectly consistent with an imprint (whatever the mechanism) of a man who had severe injuries. And those injuries are truly realistic from a forensic point of view. If the TS image is the result of an imprint from a medieval template, I can see only 2 possibilities: 1) There was no asymmetry in the template but the final image asymmetry is the accidental result of the imprinting mechanism. And this asymmetry perfectly matches the imprint of an injured face…. 2) The medieval “face” model/template “contained” this injury like asymmetry. Does it exist a single example of medieval bas relief or statue with this kind of feature?.","date":"2014-12-04","mins":"4:34 pm","url":"https://shroudstory.com/2014/12/03/the-shroud-of-turin-is-not-the-image-of-edessa/","cat":"history","title":"The Shroud of Turin is not the Image of Edessa?"},{"id":"comment-28104","author":"thibault_heimburger","post":"Dear Hugh, There are 2 different problems: 1) Are Heller’s and Adlers’ tests reliable regarding Bilirubin. I am waiting for CB’s answer to my previous post. (I just received CB’s answer. More later) 2) The red carmine color of the blood on the TS. For the moment these 2 questions have to be studied separately. Remember that there are other possibilities regarding the red color of the blood. Thibault..","date":"2013-03-22","mins":"5:24 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28105","author":"thibault_heimburger","post":"Yes Sir, I’ll try to find the papers on Google Scholars. Comments later. Meanwhile, would you please SUMMARIZE here why, in your opinion, Adler’s findings re the presence of Bilirubin in the blood are not reliable (I am not speaking about the red color of the blood) ?.","date":"2013-03-22","mins":"5:39 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28203","author":"thibault_heimburger","post":"BILIRUBIN Yes, if you want to discuss about Bilirubin, you have to summarize your thoughts. I think that Adlers’s tests are reliable. You think that they are not. Why ? The problem is the method. There is no way to have a fruitful discussion without a short summarize of your critics of Adler’s (peer reviewed) papers. Thibault..","date":"2013-03-23","mins":"5:12 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28284","author":"thibault_heimburger","post":"CB: “I am not just a “critic”, TH. I am a retired scientist/science blogger with well over 150 postings on the TS alone in the last 14 months, quite a number of which have been devoted to the details of Adler’s work. Have you read them? TH: Yes I did. CB: ” I also consider that your attack on the scorch hypothesis (viz.your pdf) was not just badly conceived, in view of the unsuitability of the template, but the lofty manner of its presentation too, with your total ignoring of my work with bas relief templates, the 3 D imaging, the evidence for superficiality etc .Why say to the site’s host that you want me especially to look at your work, when you cannot even bring yourself to acknowledge my existence within those many pages, far less my original researches? ” TH: Wonderful ! I/we now understand the true reason of your behavior: I did not even quote you in my “paper” ! Mea Culpa, mea maxima culpa !!! You obviously did not understand the aim of my paper. CB: ” Until you are willing to get down off that high horse of yours, and cease making your insistent demands for this or for that, then you are right – there can and will be no ‘fruitful discussion’. There is blogging etiquette and there is scientific etiquette, and I have to say you have failed to impress so far on either of those counts.” TH: “blogging etiquette” and “high horse”: Are you are describing your own behavior.? “Scientific etiquette”: any true scientist should be able to summarize his thoughts so that others can discuss them. But don’t worry: I am preparing a new paper regarding your own experiments and statements, i.e scorch, 3 D, blood, bilirubin, Adler’s work etc. Thibault..","date":"2013-03-24","mins":"3:42 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28360","author":"thibault_heimburger","post":"Colin, I understand your point of view (“a journey”). But the fact is that is is very difficult for me (and probably for others) to have a general view of the scorch hypothesis (for example) on your blog where your successive ideas are scattered in so many posts. Some thoughts in haste: – heat transfer: I agree that heat transfer through radiation can be ruled out. The only kind of heat transfer in scorch experiments, I (and you if I understand well) found is conduction. This explains all my observations. The very low diffusion of heat in linen is the key parameter and it does not depend on the other parameters. Now you have a problem and you have to introduce convection. Did you see in your own experiments any kind of indication of convection? In my opinion, convection is a perfect example of theoretical ad hoc hypothesis without any experimental basis. – Blood/ blood exudates: please, remember that the optical characteristics of hemoglobin are so that even a very low quantity of hemoglobin gives a red color. In other words, the fact that the blood stains look like whole blood do not exclude the possibility that they are in fact blood exudates. Thibault..","date":"2013-03-25","mins":"4:45 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28442","author":"thibault_heimburger","post":"Dear Hugh, Sorry, I was not clear enough in my previous post. I was referring to the “fact” that CB, looking at the blood stains on the TS consider that they look more like whole blood rather than blood exudates. I wonder why he thinks so. But if CB’s assertions are based on the fact that the blood on the TS seems to be to much colored for blood exudates, I disagree. The red color of this hemoglobin is another question. You wrote: ” Has anybody identified actual hemoglobin on the shroud, as opposed to its breakdown products?” What do you mean exactly ? Thibault..","date":"2013-03-26","mins":"4:57 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-171257","author":"thibault_heimburger","post":"From G.Vial (Shroud Spectrum International 38/39) ” Of the 2 types of faults seen in Fig.4 [Shroud], the implication is that the archaic method was used to make the cloth of the Shroud .Unfortunately, we do not yet know when the modern method began to be used. Daniel de Jonghe has remarked only that this type of fault disappeared in the chevrons of canvas used for painting of the 18th century”. My comment: This suggests that the “archaic” method disappeared in the 18th century. This also suggests that the so called archaic method was still used in the Middle ages as well as in ancient times. The “faults” does not tell us anything about the date of the TS. ” As for the herringbone weave; only superficial descriptions have been advanced, irrespective of the technical complexities of the type of loom necessary.There is a fundamental difference between a 2:2 twill and one of 3:1. The herringbone and lozenge weaves are known since the Iron age, if not earlier, but the fragments discovered are generally 2:2 and all are wool. The borders of the Antinoë cushions are 2:2 and are wool.. Damask cloth, for example those of Palmyra, Treves, Conthey, Ribeauville, Cologne, Holborough, are “derivatives” of 3:1 twill (..) but they are in silk. (..) The only herringbone in LINEN so far analysed and published is that cited in note 10. It is very late second half of the 16th century and much simpler than that of Turin. (…) If one takes into account the 3 constitutive elements of a textile the structure, the primary material, and the reduction of warp and weft one must acknowledge that the Shroud of Turin is truly “incomparable”. If I understand well, 3:1 “derivative” (what does it mean?) herringbone clothes could be produced in ancient times, but all of those clothes were in silk. On the other side the only known 3:1 herringbone LINEN cloth (apparently similar to the Shroud) comes from a painting of “the last supper” made by Martin de Vos” on a 3:1 linen herringbone twill weave dating from the end of the 16th century. It is noteworthy that Vial did not know of any other similar 3:1 linen cloth from the 14th century in Europe..","date":"2014-11-14","mins":"5:42 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-171428","author":"thibault_heimburger","post":"Thanks Mike for recalling to us the two very interesting studies of Tyrer. In fact, I think that Vial and Tyrer do not truly disagree. However, Vial was certainly much more cautious than Tyrer. For example, I do not think that the comparison between the Holland backing cloth (or the patches) and the Shroud can be taken as an evidence. The only sure fact is that the method used to make the Shroud was the “archaic” method but this term is misleading since, from Vial’s sentence, one can infer that this archaic method disappeared only in the 18th century. If I interpret correctly, on the basis of the faults, the 1534 backing cloth has been made using the modern method and the TS the “archaic” one that, however, was still in use in the 18th century. Clearly, there was a large time overlapping of several centuries in the use of both methods. Strictly speaking, the textile studies show that the TS could have been made in the first century from a technical point of view This is also Mrs Flury Lemberg’s opinion. But no more..","date":"2014-11-15","mins":"1:15 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"}]
