[{"id":"comment-128286","author":"thibault_heimburger","post":"Dan, you wrote:” Personally, I’m finding the software [Image J] confusing and some options limited”. And: “It’s Image J that I am struggling with. Having said that, however, I still think this package is much more powerful than the VP 8 Image Analyzer. Once we figure it out more completely, we may be able learn a great deal more about the image on the shroud.” Can you explain that ? Your first sentence seems to be contradictory to the second one..","date":"2014-06-10","mins":"5:23 pm","url":"https://shroudstory.com/2014/06/10/more-on-colin-berry-is-up-with-an-interesting-posting-about-3d-enhancement/","cat":"3d","title":"More on Colin Berry is up with an interesting posting about 3D enhancement"},{"id":"comment-209380","author":"thibault_heimburger","post":"Could this reader from Baltimore explain in detail the problem ? and Dan ?.","date":"2015-08-31","mins":"2:41 pm","url":"https://shroudstory.com/2015/08/31/colin-berrys-and-my-3d-plotting-problems/","cat":"3d","title":"Colin Berry’s and My 3D Plotting Problems"},{"id":"comment-176127","author":"thibault_heimburger","post":"Colin, Can you explain how you obtained the Image J 3 D rendering above? I can’t. Thank you..","date":"2014-12-13","mins":"3:37 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-176386","author":"thibault_heimburger","post":"Https://app.box.com/s/uxg1xps16i4ithba4bk9 Now I better understand the problem. Thanks to you, OK and Colin. Look at the original “Rovere 1625 couleur” picture. You can see that the color density is almost the same in all parts of the body image. Nevertheless, using J Image, you can obtain a 3 D rendering. The same is true for the negative image of the original image in grey scale. What does it mean? It means that, using J Image, you can obtain a pseudo 3 D from any kind of image. Why? How is it that, using J Image, one can obtain a 3 D rendering from an monochrome painting with sharp contours? I think I have the answer and that OK is right..","date":"2014-12-14","mins":"3:09 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-176764","author":"thibault_heimburger","post":"Colin, Sorry but I can’t answer now (to much professional work) More later at the end of the week..","date":"2014-12-15","mins":"5:10 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-175948","author":"thibault_heimburger","post":"Things are more complex. Read: http://www.shroud.com/pdfs/thibault%20final%2001.pdf p. 18 20.","date":"2014-12-12","mins":"3:23 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175947","author":"thibault_heimburger","post":"Hi Kelly, Nice to read you here again! But don’t expect any precise answer from Charles. “Different micros copyists with varying levels of expertise have come up with different opinions as to whether there is vermilion on the Shroud.” is the only kind of vague answer you will obtain from Charles. For example, I am still waiting for his answer to the question of lack of any kind of protein on the Shroud (except in blood stains) Unfortunately, Charles is “stuck” to his hypothesis despite the many scientific proofs of its falsity..","date":"2014-12-12","mins":"3:19 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175751","author":"thibault_heimburger","post":"Charles: “So the challenge is on to refute me!” This has be done many times. For example, STURP has shown that there is absolutely NO trace of protein (nanogram level) on the Shroud,except in the bloodstains. This is the KEY. No protein= no gesso The presence of calcium does not prove anything. In fact, the process of converting flax to linen, as described by Adler and Heller (” During this process the natural ion exchange properties of cellulose operate and two ions found commonly in natural waters that most strongly bind in this way are Ca and Fe …”) simply explains the presence of calcium (and Iron) on the whole shroud. I have verified (in the scientific literature) that the process of ion exchange truly exists. Today, the experts in old fabrics widely use the modern scientific tools. You have many scientific data, mainly from STURP. You failed to use them, or more exactly you used wrongly some of them. “Calcium carbonate is, of courses, natural but when you find it spread across the surface of a piece of cloth, the context is most likely one where it was used to seal the cloth I leave it to you to suggest alternative explanations”. You have the answer in Adler and Heller’s paper. In addition, since the same was found for Iron, does the gesso hypothesis explain that ? I have seen that you failed to precisely answer to my previous questions. Could you please answer to these questions: In your hypothesis: 1) How do you explain the lack of any kind of protein on the Shroud (except in the bloodstains) ? 2) How do you explain the distribution of Iron ?.","date":"2014-12-11","mins":"3:55 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-211717","author":"thibault_heimburger","post":"OK’s paper is interesting in that it warns against some use of Image J. For now, I have read carefully Part 1. I don’t understand why OK is writing about the halftone effect. The halftone effect, per se, has nothing to do with the 3 D problem. OK wrote: “The 3 D effect is actually an optical illusion. Or better saying it was intended to be an optical illusion.” I don’t understand. OK wrote: ” In essence, Jackson & Jumper took the crude photo of the Shroud, determined location of 13 characteristic points on the face, determined their vertical coordinates on the model, determined the relative intensity of those points with VP 8 (much more primitive than Image J we use today), …” No they used a microdensitometer for these 13 points (not the VP8). Why did they not use this method for the whole TS image ? Because they calculated that the number of data would be prohibitive (about 1700). That’s why they used another visual method based on the VP8. There is much more, BUT.. Before writing anything about the so called 3 D properties of the TS image, we must clarify what it means. Here is the challenge: how can we scientifically define a 2 D image having intrinsic 3 D properties (“encoded” 3 D data)?.","date":"2015-10-03","mins":"2:37 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-211977","author":"thibault_heimburger","post":"Hi Hugh, Is you face really so flat ? ; ) More later. Thibault..","date":"2015-10-07","mins":"2:51 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-151242","author":"thibault_heimburger","post":"Just two thoughts in haste: 1) Most, if not all of the linen fabrics, either medieval or ancient, were certainly washed with different kinds of soaps in water. This is certainly true for the Shroud that is a fine linen cloth. Therefore one can expect to find some residual impurities at the surface of the cloth. 2) According to Rogers, the fact that some colored bundles of fibers are found adjacent to bundles of uncolored fibers can be explained by the properties of the uneven “thin layer” of impurities left by the evaporation/concentration process following the washing. The “surface tension” is the key parameter. Rogers: ” My point in mentioning surface tension effects is to show that different amounts of suspended and/or dissolved impurities would deposit during evaporation of the washing liquid, depending on the surface characteristics of the batch of fibers. The soluble and colloidal components of crude starch would be in solution/suspension, and those impurities would be deposited on all parts of the cloth as the liquid evaporated. Differences in deposition would be seen depending on the surface properties and the rate of evaporation.(…)”. From: https://shroudofturin.files.wordpress.com/2012/08/rogers maillard reaction for dan blog 2.pdf Is there another hypothesis explaining this simple observation/fact ? I do not know if the chromophore is the “thin impurity layer” or the PCW. But I know that Rogers was a true scientist who was in contact with several experts..","date":"2014-09-15","mins":"4:19 pm","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level"},{"id":"comment-152007","author":"thibault_heimburger","post":"Dave: “An important observation for me is that Rogers claimed to have removed the image coloration from a fibre by using dimide. This left the underlying fibre exposed, intact and unaffected. For me that is a strong argument in favour of his hypothesis that the image lies only on the coating of the fibre, not the fibre itself. I think it can only be refuted by demonstrating that Rogers was mistaken about the results of this experiment.” Adler (not Rogers) did the diimide experiment.( Mario is right). Adler also found the “ghosts” and then Rogers too. Even if ” like so many other experiments involving the Shroud, it was only ever done once”, I do think that it is a fact. Rogers have shown later that the medulla of the image fibers is not colored. He also have shown that the “cellulose crystals” of the image fibers were not changed by the image forming process. There is absolutely no doubt that the color is only at the very surface of the image fibers. What does the diimide experiment mean? Colin writes (see :http://colinb sciencebuzz.blogspot.fr/2014/08/lets move things along one easy step at.html): “More importantly, diimide works at the molecular sub microscopic level. Nothing can be deduced from colour or texture changes about structure at the macroscopic level (coatings etc). The very term ‘colour removal’ is itself misleading if implying that anything is physically removed. Colour ‘removal’ is a chemical change that does not physically remove anything (diimide actually adds hydrogen atoms, e.g. Across C=C double bonds, that interferes with the chromophore’s light absorbing properties).” I fully agree ( yes !!!) and I could not explain better. In other words, the diimide experiment says nothing about the chromophore carrier (PCW or impurity layer) except that it is at the very surface of the image fibers and that it very likely consists of C=C double bonds. Up to now, we have no mean to know what is the surface chromophore carrier..","date":"2014-09-17","mins":"4:09 pm","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level"},{"id":"comment-152030","author":"thibault_heimburger","post":"“Would I be correct in deducing that if hydrogen was added, that is in effect a reducing reaction, the opposite to oxidation?” That’s true. “As the experiment, like so many others involving the Shroud, seems to have only ever been done once, that still leaves a doubt, even though it is suggestive, Max’s epigram “testis unus testis nullus” remains true, and like so many other experiments it need to be repeated to create any kind of scientific conviction.” Ok. But, as I wrote, there are other experiments (Rogers), showing that the cellulose itself was not changed by the image forming process. There is no doubt: this is a proved fact. What kind of process? More tomorrow..","date":"2014-09-17","mins":"5:38 pm","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level"},{"id":"comment-210818","author":"thibault_heimburger","post":"I agree with OK. The title of the paper “There is no mass spectroscopy evidence that the C14 sample from the Shroud of Turin comes from a “medieval invisible mending” is truly misleading. ” He [Rogers] tests for the presence of vanillin, giving insufficient details to enable the reproduction of this analysis besides observing a change of color. He could not detect any vanillin on the main Shroud but apparently he could detect “some” vanillin in the Raes sample”. That’s all. But Rogers gave several details in his paper. “He [Rogers] analyzes the Raes sample ..and C14 sample .. With a microscope, supposedly identifying a pigment, alizarin, by means of its change of solubility by p H variations.” “On the basis of solubility tests, Rogers hypothesizes the presence of pentosans rather than cellulose on the Raes samples (sample c)” Again,this is a completely biased reading of Rogers’ TCA paper. Finally, the only interesting part of this paper is based on the interpretation of the MS spectrum of the Raes sample by Rogers. Rogers interpretation of this spectrum could be true or not. As a proof that Rogers is wrong in his interpretation of the MS spectrum, the authors write that ” the mass spectra from the Raes sample ..shows the characteristic peak pattern derived from the fragmentation of a molecule with a long hydrocarbon moiety”. That’s true, except that there are several other molecules showing the same “peak pattern”..","date":"2015-09-20","mins":"4:38 pm","url":"https://shroudstory.com/2015/09/17/guest-posting-on-the-thermochimica-acta-editorial/","cat":"paper_chase","title":"Guest Posting on the Thermochimica Acta Editorial"},{"id":"comment-469","author":"thibault_heimburger","post":"Colin, The “40,000 fold” is not found so in the document. However, I have found what follows : ———————————————– ” Effects of temperature : (….) Casein glucose … were held in equilibrium with an atmosphere of 70% RH, at temperatures of 0, 10, 20, 28.5, 37 and 55°C, as described above, and examined at intervals for free amino N content and for color. …A further experiment was, however, performed at 70°C to obtain a figure of less accuracy. When the results were plotted it was found that all the curves of amino loss against time were of the same general shape and tended to the same final value. The rates could therefore be compared quite adequately by considering only the initial reaction rate determined by drawing the tangent at zero time to the smoothed curve. A number of readings were taken at short reaction times to ensure the accuracy of the initial portion of the curve; The values for the initial rate, expressed as % loss of amino N per hour, were : 0°C: 0.0015 10°C: 0.0067 20°C: 0.034 37°C: 0.71 55°C: 9.3 70°C: 58.” —————————————— I assume that these numbers are the basis of the “40,000 fold” statement (0.0015 x 40.000 = 60) But it is the VERY INITIAL rate of the reactions (and not of the color) that finally “tended to the same final value”. This has nothing to do with the development of the color in the first weeks as explained in my comment on Dan’s blog. Of course the temperature has a critical influence on the rate of the Maillard reactions but there is no doubt that many of them can give a yellow brown discoloration within some days, months or years at room temperature (Rogers explained that in the paper I wrote that is now on Dan’s blog)..","date":"2012-08-12","mins":"9:20 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/12/quickie-response-to-thibault-heimburger-re-that-1949-lea-and-hannan-paper-on-the-casein-glucose-maillard-reaction/","cat":"casein","title":"Quickie response to Thibault Heimburger re that 1949 Lea and Hannan paper on the casein-glucose Maillard reaction."},{"id":"comment-203380","author":"thibault_heimburger","post":"From Colin in “the Telegraph”: “Simply paint a gluey cold water slurry of plain white flour onto one’s 3 D subject – whether a real person or a bas relief (probably the latter for the face), imprint onto linen, then press the dried imprint with a really hot iron (linen setting). Hey presto, one gets a negative sepia coloured Shroud like image of one’s subject. Nope, it won’t wash out, so may well be permanent. It may even display those ‘mysterious’ 3 D properties if you use dowloadable software (Image J etc) that excels in finding “3 D” wherever there’s tonal contrast in one’s 2 D image.” Colin seems to be a very strange person. Here and on his own blog he looks like a true scientist. Now, in “the Telegraph” (!!), we have the very simple final answer. No Colin, your results have nothing to do with the TS image properties. Is Colin serious or not ?.","date":"2015-06-23","mins":"2:54 pm","url":"https://shroudstory.com/2015/06/23/a-shameless-plug/","cat":"image_theory","title":"A Shameless Plug"},{"id":"comment-193708","author":"thibault_heimburger","post":"Colin: “When M Ds start to sound like amateur psychiatrists. It’s time to head for the hills. Bye to this thread., Or as my wife says “Above your paygrade, Heimburger”. “Amateur psychiatrists” ???? I do not see any kind of relationship with my post. Are you becoming completely mad, Colin? I DO NOT accept such insanity from you. Colin: “as stated here and elsewhere, this blogger now aligns himself with Joseph Accetta in thinking that the TS image was probably dyed onto the linen, rather than heat scorched.” “Rather than heat scorched”….Interesting. But why do you abandon this hypothesis which, allegedly, explains all the properties of the TS image ?? No explanation. “Might we finally have a handle on the Shroud imprinting technology by assuming Accetta is correct with his dyeing, but taking it a stage further? Suppose alum had been used as a mordant, applied first to impregnate the linen. Then suppose the dye imprinting was done, so that the dye attached quickly to the surface mordant, so there was no appreciable reverse side coloration.” “Surface mordant” is meaningless in this context. To apply FIRST a mordant (to “impregnate the linen”) and THEN the dye. Do you know what you are speaking about ? And now: “I need a name to describe my new modelling of the Shroud image (inspired by Joseph Accetta) using an alternative to his iron/oak gall ink. Mine uses alum mordanted concentrated aqueous extract of pomegranate rind deployed not as ink, this syrup being deployed as a kind of natural sticky “paint”. Dye, alum, alum mordanted concentrated aqueous extract of pomegranate rind …syrup .” as a paint. Etc… Nevertheless, STURP DID NOT FIND any trace of dye, alum, iron/oak gall ink… and the observed fact that the image fibers are not cemented together shows that no kind of paint, dye or ..syrup has never been used to make the TS image. Your aim is clearly to adopt the STURP conclusions that are in line with your conclusions but to eliminate those that are obviously against them. Yes, bye to this thread..","date":"2015-03-18","mins":"5:25 pm","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-193636","author":"thibault_heimburger","post":"I have not read the entire Colin’s blog posting. I will. But obviously, with time, he introduces more (and more) ingredients. Why ?.","date":"2015-03-17","mins":"3:56 pm","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-193793","author":"thibault_heimburger","post":"Colin, Do you really think that I do not know anything about the scientific method ? You don’t know anything about me. Do you really think I know nothing about dye mordant? I studied it several years ago. Let’s forget that for the time being. I would like to make very preliminary comments about J. Acetta’s hypothesis: the Shroud image as a woodcut imprint: “Woodcuts are a technique of printing designs from planks of wood incised parallel to the vertical axis of the wood’s grain. It is one of the oldest methods of making prints from a relief surface, having been used in China to decorate textiles since the 5th century ad. In Europe, printing from wood blocks on textiles was known from the early 14th century, but it had little development until paper began to be manufactured in France and Germany at the end of the 14th century.” http://fr.wikipedia.org/wiki/Gravure sur bois The oldest woodcut known in OCCIDENT is the so called ” Bois Protat” http://fr.wikipedia.org/wiki/Bois Protat ” Aujourd’hui, la bibliographie spécialisée est revenue sur la datation très précoce de Bouchot et s’accorde à considérer que le bois Protat date du début du xve siècle.” In other words, the first known woodcut template known in Occident ( the French ‘Bois Potrat” woodcut) was made AFTER 1400 A.D. The specialized bibliography demonstrates that there is no example of woodcut imprint in Occident before the beginning of the 15th century in Occident. Obviously the shroud (even if it is a 14th artifact) can not be a woodcut imprint..","date":"2015-03-19","mins":"3:52 pm","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-193786","author":"thibault_heimburger","post":"Hugh, – ““— What can those in the field of science say about how the laboratories proceeded in 1988?”” I agree with your answer: ” I think there is little doubt that the laboratories performed their duties perfectly well and reported their results to their employer, which I believe was the British Museum, acting on behalf of the Shroud’s owner, in as frank a way as possible.” Nevertheless a difference of about two centuries in such a small sample is at least amazing. Such a difference can not come from different cleaning methods used by the 3 laboratories (see the results of the other samples tested). The best French expert in ancient textiles (Moulherat) was shocked by the fact that the C14 sample came only from a single area. The additional statistical analysis (Van Haelst, Riani etc..) clearly show that there is something abnormal in this dated sample. “— Can they write a paper about how dye was involved?” I myself have wondered if the chronological radiocarbon gradient might have been due to a dye applied to the Holland backing cloth to make it match the shroud, especially in the ‘missing corners’ area. I don’t think anyone has said much more, have they?” I don’t understand your answer. Why are you speaking about the Holland cloth in this context ?.","date":"2015-03-19","mins":"2:42 pm","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-18768","author":"thibault_heimburger","post":"Some answers from the scientific literature (for some reasons, some years ago, I purchased dozens of peer reviewed papers about cellulose, aging, lignin …): Lignin is not a polysaccharide (as said by Carlos) Raw, non bleached flax contains about 3 % of lignin and about 2% of “extractives” (i.e., waxes, resins). Lignins (plural) in flax is found in the middle lamella (that includes the primary cell wall), cell wall junctions, and in the S1 (external) layer of the secondary wall (a 1 microm. Wide band just bellow the primary cell wall). XPS (analysis of the first 10 nm of a surface) shows that lignin in non bleached flax is found on about 66% of the surface of the fibers. But “together the AFM and XPS results strongly suggest a surface model where lignin is present on natural cellulose fibers only as clusters and islands thicker than 10 nm”. Lignin is very sensitive to light. It is the main cause of the yellowing of paper. Near UV produces chemical reactions (photochemistry) in some chemical groups of lignin producing yellow chromophores, particularly o quinones. In the literature, natural aging (and yellowing) of linen textile does not study the role of lignin but the cellulose itself. “It is well known that cellulosic fibers (…) undergo degradation under the action of external agents, such as light, heat, microorganisms (…), insects and chemicals. In any case, oxygen attack is mainly responsible for cellulose degradation (..). The process is essentially due to the oxidative scission of the cellulosic macromolecule and its rate can be expressed in terms of number of glucosidic bonds broken per unit time”. In other words, even without light, heat or microorganisms, the oxygen in the air even at room temperature explains the natural (very slow) yellowing of the background of the Shroud. That’s why it is now conserved in an inert gas (argon). The question is: ” During the processing of flax, there is an attempt to remove the lignin from the fibres, but even in modern linen, some lignin remains. Could it be (a constituent of) the ‘impurity layer’? It turns yellow quite readily in quite a short time at quite low temperatures, and with exposure to light, much more easily than cellulose, more easily than starch, and for all I know more easily than sugar as well. Has anyone else looked into this, and if so, with what conclusion?” I don’t know but this is a crucial question. Let me explain: – We know that the “impurity layer” is about 0.2 to 0.6 microm. Thick (Rogers) – We know that lignin is found in flax fibers as a major component of the PCW, which is about 0.2 microm. Thick. – We know that lignin covers the majority of the surface of flax fibers – Lignin (photochemistry) degradation produces many molecules with C=C and C=O groups. A very interesting question. Just some thoughts (for the moment). Thibault..","date":"2012-11-03","mins":"2:36 pm","url":"https://shroudstory.com/2012/11/02/an-image-formed-by-the-yellowing-of-lignon/","cat":"image_theory","title":"An image formed by the yellowing of Lignin?"},{"id":"comment-193892","author":"thibault_heimburger","post":"Hugh, I agree with Anoxie. You wrote: “I’m afraid I disagree. Even if the three samples came from completely different cloths, there is sufficient data to preclude a 1st century date for any of them.” Your sentence above implies that you seem to think that, in the repair hypothesis, this very small area is comprised of several sub units with different ages. As you know it is not at all the case with the repair hypothesis. The repair hypothesis clearly states that the C14 sample is entirely comprised of a blend of new threads and old threads, with a majority of new threads in all of the sample. The proportion of new threads vs old threads being slightly different, which might explain the anomaly. I completely agree with Anoxie: “Remi Van Haelst doesn’t rule out a 1st century date, what he rules out is the validity of the C14 dating. According to his article the pb is either an inhomogeneity in the sample OR an unacceptable interval if you assume that the sample is homogeneous. Does it exist a 95% confidence interval of 3 centuries (1150 – 1440) in any kind of C14 dating performed on a homogeneous small sample? Probably not. Therefore the sample is not homogeneous. What kind of inhomogeneity can you imagine ?.","date":"2015-03-20","mins":"3:42 pm","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-171247","author":"thibault_heimburger","post":"OK Colin, I have read your very very very..long (but enlightening) answer on your blog. It will take me many hours to re read and understand what you really have in mind. Then, I’ll write my comments before Sunday. The next step will be to write my last “Scorch” paper and you’ll be surprised..","date":"2014-11-14","mins":"3:54 pm","url":"https://shroudstory.com/2014/11/13/a-sweat-imprint-that-is-a-negative-which-is-comparable-to-a-brass-rubbing/","cat":"image_theory","title":"A sweat imprint that is a negative which is comparable to a brass rubbing"},{"id":"comment-14675","author":"thibault_heimburger","post":"The (very long) “paper” (The many details and parameters of the Maillard reaction hypothesis and related topics by Rogers himself) is coming very soon. Sorry for the delay. Thibault.","date":"2012-08-09","mins":"3:56 pm","url":"https://shroudstory.com/2012/07/30/asking-thibault-for-more-details-concerning-rogers-hypothesis/","cat":"image_theory","title":"Asking Thibault for more details concerning Rogers hypothesis"},{"id":"comment-23333","author":"thibault_heimburger","post":"Look at Colin’s site. I was glad to discuss with him and to provide him some photographs he does not have. Unfortunately, Colin is not a gentleman. Colin is definitively “out” for me. Sadly… Thibault..","date":"2013-02-03","mins":"4:05 pm","url":"https://shroudstory.com/2013/02/03/be-sure-to-read-the-comment-by-thibault-heimburger/","cat":"image_theory","title":"Be sure to read the comment by Thibault Heimburger"},{"id":"comment-208769","author":"thibault_heimburger","post":"Colin, “Note the coloration lies beneath a glossy reflective layer(PCW?) that is uncoloured!” No disrespect but the way you are using the microscope is a non sense (at least in this case) ! Your so called “coloured fiber” (yellow rectangle) is not at all a fiber. It is the “space” between two fibers. See: https://app.box.com/s/pczohlvpofu42fz3wg5xz6rkmbk340fy If you want to try to know where the color is in your new model (very difficult), I suggest you to look at single fibers, using very high magnification, and without “maximum contrast”. Something similar to Fig. 19 or 20 in my old paper: https://shroudofturin.files.wordpress.com/2014/04/scorch 2 eng final.pdf More later..","date":"2015-08-23","mins":"8:51 am","url":"https://shroudstory.com/2015/08/21/close-to-the-finishing-line-or-the-starting-line/","cat":"image_theory","title":"Close to the finishing line or the starting line?"},{"id":"comment-208784","author":"thibault_heimburger","post":"What I can see is another picture (which shows nothing interesting), that has nothing to do with what I wrote above I repeat your picture does not show a fiber. I repeat: Your so called “coloured fiber” (yellow rectangle) is not at all a fiber. It is the “space” between two fibers. I repeat, you CAN’T demonstrate anything with this kind of picture. Your answer is not an answer..","date":"2015-08-23","mins":"11:08 am","url":"https://shroudstory.com/2015/08/21/close-to-the-finishing-line-or-the-starting-line/","cat":"image_theory","title":"Close to the finishing line or the starting line?"},{"id":"comment-208777","author":"thibault_heimburger","post":"I don’t see this additional photomicrograph in Topic 8..","date":"2015-08-23","mins":"9:54 am","url":"https://shroudstory.com/2015/08/21/close-to-the-finishing-line-or-the-starting-line/","cat":"image_theory","title":"Close to the finishing line or the starting line?"},{"id":"comment-21757","author":"thibault_heimburger","post":"I agree with Paulette : “I just want to say I appreciate what Colin is doing even if he comes off sounding a bit too arrogant at times. We need to address everything Colin questions. In due time, I am certain we will.” The problem is that Colin is dealing with so many different questions that it is difficult to study in depth most of them. I WOULD BE GLAD TO WORK WITH SOME OF YOU TO STUDY IN DEPTH SOME QUESTIONS STARTING FROM COLIN’S CLAIMS. If some of you are interested, please ask Dan my private email address. Thibault..","date":"2013-01-08","mins":"5:17 pm","url":"https://shroudstory.com/2013/01/08/colin-berry-takes-on-banding-and-more/","cat":"image_theory","title":"Colin Berry Takes On Banding and More"},{"id":"comment-198733","author":"thibault_heimburger","post":"Colin, “I could have sworn that the headline characteristics were the negative superficial image with 3 D properties, no reverse side image, absence of fluorescence under uv.” Yes, but do you really think that these properties are the ONLY important properties of the TS image ? There are many other properties that are important to consider. First example: image fibers on the TS are not cemented together. This is an observed fact, not a “moving target”. Can you demonstrate that the image fibers of your nice “Galaxy warrior” imprint are not stuck together? You have a microscope. Thanks..","date":"2015-05-09","mins":"4:56 pm","url":"https://shroudstory.com/2015/05/09/colin-berry-has-it-all-figured-out-sort-of-maybe/","cat":"image_theory","title":"Colin Berry Has It All Figured Out, Sort Of, Maybe"},{"id":"comment-201084","author":"thibault_heimburger","post":"See: http://colinb sciencebuzz.blogspot.fr/2015/06/are peculiar fingers of turin shroud.html Colin: If I understand well your “Nutella’s experiments” (!) show that : “coated hand pressed downward into linen” (rather than “linen molded onto coated back of hand”) could explain the “peculiar fingers” of the TS image.’ For the time being, i don’t see anything resembling the TS image. You wrote (in red): “What you see above is the most scientifically revealing image in the current posting, and dare I say, the most important in my 300 postings to date (I confidently expect more charges of arrogance). Loosely draped linen, hanging under the force of Earth’s gravity alone does NOT conform to finer details of body contours, certainly not anything so discrete and detailed as the bunched fingers of the hand. (Yes, the test needs to be repeated with a weightier length of linen fully matching that of the Shroud, but I’m confident that the outline of individual fingers will NOT be seen through the linen). ” Really?.","date":"2015-06-04","mins":"1:58 pm","url":"https://shroudstory.com/2015/06/01/colin-berry-its-the-negative-image-with-3d-properties-stoopid/","cat":"image_theory","title":"Colin Berry:  It’s the negative image with 3D properties, stoopid"},{"id":"comment-169926","author":"thibault_heimburger","post":"Very amazing. What to do want exactly Colin? Or what are you expecting from me?.","date":"2014-11-08","mins":"4:41 pm","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-191503","author":"thibault_heimburger","post":"I agree with Colin, except for point 3: “3. The 3 D properties of the TS negative image which contrary to early reports is not unique to the TS, but in fact are easily modeled with contact only imprints, e.g. Model scorches from a heated template as this blogger and others has demonstrated, e.g. With a brass crucifix”. At least, a 2 D painting of the shroud also show so called 3 D properties using J Image, even better than the TS. There is a problem with J Image. More later….","date":"2015-02-21","mins":"1:50 pm","url":"https://shroudstory.com/2015/02/21/colin-berry-stop-calling-the-faint-image-a-faint-image/","cat":"image_theory","title":"Colin Berry:  Stop Calling the Faint Image a Faint Image"},{"id":"comment-191675","author":"thibault_heimburger","post":"Yes OK, only apparently. But things are very complex. I have to think about it. I will not post my images but I’ll try to write something about this problem as soon as possible. As I wrote, you can ask Dan my private email address. I would be glad to discuss with you..","date":"2015-02-23","mins":"4:15 pm","url":"https://shroudstory.com/2015/02/21/colin-berry-stop-calling-the-faint-image-a-faint-image/","cat":"image_theory","title":"Colin Berry:  Stop Calling the Faint Image a Faint Image"},{"id":"comment-199896","author":"thibault_heimburger","post":"The wounds were then washed and this procedure tried again. This resulted in reasonably good impressions of the wounds ( Fig. 1 )..","date":"2015-05-22","mins":"4:51 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199897","author":"thibault_heimburger","post":"Sorry David, Forget this about comment. Some problem with my computer..","date":"2015-05-22","mins":"4:53 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-200171","author":"thibault_heimburger","post":"Just back from a 3 days stay in Verdun. David: “We are discussing about the inconsistency of Zugibe’s theory. Zugibe claims that the trails of blood were produced after (or during) the washing of the corpse.” Not at all, David. We are supposed to discuss about the pre mortem scourge marks which were washed according to Zugibe. This is not true for the post mortem trails of blood..","date":"2015-05-25","mins":"2:50 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199467","author":"thibault_heimburger","post":"I fully agree. More later….","date":"2015-05-18","mins":"4:16 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199466","author":"thibault_heimburger","post":"“Prof. Zugibe does not explain why the forehead, arms and feet of the man in the Shroud were not washed, while his back (and chest?) were. ” Sorry Hugh, Prof.Zugibe explained that. Do you have his book ?.","date":"2015-05-18","mins":"4:13 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199721","author":"thibault_heimburger","post":"Hugh, Now you agree that you misquoted Miller and Pellicori. Thanks for you fair play. There are “serum rings” around many scourge marks on the back. Looking at the photos you have, from the Miller an Pellicori’s paper, you don’t see them. This is normal. There is a huge difference between photos published in a paper and the original photos. Remember: Adler, for example, looked at the original photos. It is interesting to note that the presence and the visibility of the serum rings seem to be bound to two main parameters: 1) the more or less close linen body contact 2) the amount of blood. “Colin lead this post with a series of observations which lead him to doubt the credibility of the authenticist viewpoint. To refute his claim, what is needed is either counter observations or different conclusions, not airy quotes of FACT which are no such thing.” What do you mean exactly by “counter observations or different conclusions, not airy quotes of FACT which are no such thing.”? I completely disagree with Colin. The TS scourge marks are much more credible as real scourge bloody imprints than as painted pseudo scourge marks..","date":"2015-05-20","mins":"4:22 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199375","author":"thibault_heimburger","post":"Colin you wrote: “When someone is flayed with a Roman flagrum, one expects to see the skin ripped to shreds, with blood flows to match. One does not expect to see neat imprints correspondingly exactly with the shape of the metal or bone pellets, as if all they did was to produce contusions with just the right amount of weeping blood to “imprint” an image, with no surplus to obscure and thus ‘spoil’ the image. The scourge marks are frankly not credible, except as the work of a forger intent on creating over simplified neat and geometric patterns that lack both realism and credibility.” That’s why Fred Zugibe (RIP) thought that the TS man was washed. Http://www.crucifixion shroud.com/Washed.htm ” However, if the body was washed, the dried blood around the wounds would be removed causing an oozing of bloody material within the wounds resulting in the production of relatively good impressions of the wound” If the TS man was washed, the scourge marks are credible. Please read his book: “The Crucifixion of Jesus a Forensic Inquiry”., p23, Fig.2 3 showing “a beating across the back of a young person”. “The scourge marks are frankly not credible, except as the work of a forger intent on creating over simplified neat and geometric patterns that lack both realism and credibility.” Please look again at those scourge marks http://www.sindonology.org/shroud Scope/shroud Scope.shtml I don’t see any “over simplified neat and geometric patterns”. I see exactly the contrary. The scourge marks can not be the result of the work of a forger. Just look at them..","date":"2015-05-17","mins":"6:08 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199783","author":"thibault_heimburger","post":"Sorry David, I don’t understand at all what you say. Can you please explain in detail..","date":"2015-05-21","mins":"2:14 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199787","author":"thibault_heimburger","post":"Thanks Hugh, It’s now clear that Zugibe’s explanations/hypotheses are not known or understood. I am the only who has his book “The Crucifixion of Jesus A Forensic Inquiry” Second edition 2005 ? I’ll try to scan the relevant pages and then I’ll post a link to them. Thank you for your patience..","date":"2015-05-21","mins":"3:24 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-14802","author":"thibault_heimburger","post":"In Rogers experiment above ,it is true that he wrote that “a very light color could be observed on the top surface after standing 24 hours at room temperature” but the the color seen in the above picture “developed after a few minutes of heating at 66°C” simulating aging. I guess the same color density could be obtained after some months/years at room temperature alone. Of course Colin Berry is wrong. If significant amounts of amines and reducing sugars are allowed to react they will react and produce a color; It is not a hypothesis but a fact. The question is : how many time to see colored melanoidins ? All the literature shows that the color can develop within some hours, days, months or years, depending on many parameters and first of all the temperature. For example, the Amadori rearrangement (one of the first step of the reaction) takes places spontaneously at 25°C. There is absolutely no doubt that, in Rogers hypothesis, a color must be seen on the Shroud after some months or years (latent image). Rogers submitted his hypothesis with Arnoldi in a peer reviewed journal Melanoidins. Ana Arnoldi is one of the best expert of the Maillard reaction in Europe. But certainly Colin is a better expert in Thermochemistry than Rogers and in Maillard reaction than both Rogers and Arnoldi !! More tomorrow..","date":"2012-08-11","mins":"6:33 pm","url":"https://shroudstory.com/2012/08/11/colin-berry-so-how-could-ray-rogers-have-got-it-so-wrong/","cat":"image_theory","title":"Colin Berry: So how could Ray Rogers have got it so wrong?"},{"id":"comment-14829","author":"thibault_heimburger","post":"Colin Berry on his blog now added an interesting comment quoting an old paper by Lea and Hannan. I have this paper (not only the abstract). This paper is on the “effect of activity of water, of p H and of temperature on the primary reaction between casein and glucose”. Not exactly the same that expected on the Shroud. However, it is a good example of the changes in color in a simple “Maillard system”. What does one read in this paper ? The changes in color were studied only at 37°C with different values of p H and Relative Humidity (RH). The color was expressed in Lovibond units. Look at Wikipedia to see what Lovibond (old) scale is. Let’s say that bellow 2 no color is truly seen. At 3 it is yellow, at 5 yellow brown. What I read is that after 64 days at 37°C. And 70% RH a color between 2.6 (p H 6.3) and .4.4 (p H 10) can be seen. More interesting is the subsequent paper here by the same authors : “A note of the relative rates of reaction of several reducing sugars and sugar derivatives with casein” Biochimica Acta et Bipohysica Acta 4 (1950), p.532 534 that is available for free (I can’t give the link. Just use “advanced search” in Google Scholars). Now, with the same methods, the authors studied the color development after 4, 8 and 16 days at 37°C (p H 6.3 and 70% RH). They used 8 different carbohydrates. The Lovibond color for glucose after 16 days of storage was 0.3 (nearly no color, like in the previous experiment). But the color of arabinose was 2.5 and that of xylose was 2.7 after 16 days only. It means, as expected, that the color depends also on the carbohydrate and glucose used in the first paper is one of the worst. There are many other parameters to study. Particularly the last step of the Maillard reaction (polymerisation and production of true melanoidins). At least, I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature. PS: I have just sent the promised document entitled “Rogers’ Maillard reaction hypothesis explained in detail by Rogers himself” to Dan..","date":"2012-08-12","mins":"12:31 pm","url":"https://shroudstory.com/2012/08/11/colin-berry-so-how-could-ray-rogers-have-got-it-so-wrong/","cat":"image_theory","title":"Colin Berry: So how could Ray Rogers have got it so wrong?"},{"id":"comment-24578","author":"thibault_heimburger","post":"Dear all, still waiting for Colin’s “D day” ; )… More seriously, it seems to me that Colin is furious with me because I did not answer to his 3 part rebuttal of my paper about the scorch hypothesis. I will not answer. Why ? 1) Because his rebuttal (and some following posts) does contain many ad hominem attacks 2) Because his rebuttal is a non sense, i.e. An incredible “bouillabaisse”. 3) Because he thinks that all of my observations are meaningless since I used a bad template. Therefore, I asked him to show his own photographs using his microscope (with his “good template”) at thread and fiber level. But for him, I had not the right to decide what he has to do ! And finally, he obliquely admitted that his own observations were similar to my observations. It is interesting to follow Colin’s thoughts : snow, sand, clay, conduction and now convection etc.. What does it mean ? It means that the the first simple scorch hypothesis does not match the TS image properties. And Colin has to try to find more and more “ad hoc” complex mechanisms through “thought experiments” “Ad hoc” means that it is absurd to think that a medieval forger had to use some very complex mechanism to fool the 20th century researchers, while it was so simple to mislead a crowd in the Middle ages. Thibault..","date":"2013-02-17","mins":"5:59 pm","url":"https://shroudstory.com/2013/02/16/colin-berrys-big-day-tomorrow/","cat":"image_theory","title":"Colin Berry’s Big Day Tomorrow"},{"id":"comment-52432","author":"thibault_heimburger","post":"Thanks Colin. I have seen your new pictures on your blog. Much better. Try again to use your camera (at the beginning, it’s difficult) but it is the only way to obtain HD pictures of a larger area (low magnification). This is the only way to see the color pattern at thread level on some adjacent (weft and warp) threads. In your new experiment, I see that some areas (like the torso) are more colored (brownish) than other areas (the arm); It would be very interesting to compare them this way. And to compare with the ME pictures. And to look at the superficiality in you new model. And … If you can’t obtain those pictures, ‘ll try to do that, following your new technique..","date":"2013-11-22","mins":"4:25 pm","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-52321","author":"thibault_heimburger","post":"Thank you for your comments. There are so many things to think about…. Thank you Colin for the photo and congratulations for your new method. The photo looks like the very Light Scorch (VLS) I got, but it is blurred. I understand that it is only a preliminary photo. Just a suggestion: don’t use the USB microscope. Try to use your camera through your microscope..","date":"2013-11-21","mins":"7:44 pm","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-1811","author":"thibault_heimburger","post":"Regarding the crease (A above), it is just one of dozens of transverse creases “caused by compressing the fabric in the process of rolling it inappropriately… it is very important to analyse the correct interrelations, because we have to be careful not to give inappropriate weight to the existence of these creases.” (Flury Lemberg, Sindone 2002). This crease has nothing to do with the image formation process. These transverse creases are very different from the “V shaped” fold running vertically all along the center line of the fabric. “its existence points to the fact that the cloth, in order to protect its precious content, has been folded length wise with the image facing in, apparently from a very early point in time”. But once again this fold was made after the image. Much more interesting is the discovery of another almost invisible fold, called by FL the “primary fold”. This fold can only be seen using grazing light. It is another much more delicate v shaped grove only a few centimeters away from the other one described above which also runs along the whole length of the fabric. It belongs to the very first folding after the Shroud had been finished and is due to the production process of the fabric and is not the result of using the fabric. This is certainly the only fold that was there before the image. I have no high resolution photographs of this particular fold but at the first look there is nothing interesting to expect. Therefore A is false. Regarding B and C, I see no problem at all with any kind of non contact process. This kind of process may or may not leave an image between the chin and the chest. Actually there is an image whose intensity is clearly related to the color of the transverse bands that are clearly seen. Once again the “banding effect”. Is the banding effect (which is a fact) consistent with the scorch hypothesis ? I wonder.. Thibault..","date":"2013-02-02","mins":"7:29 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/01/could-this-be-clinching-evidence-that-the-shroud-image-is-a-contact-scorch/","cat":"medieval_forgery","title":"Could this be clinching evidence that the Shroud image is a contact scorch?"},{"id":"comment-207900","author":"thibault_heimburger","post":"Colin, No half tone effect ?? To “demonstrate” the lack of half tone effect (as observed in situ by STURP) you have used the ME photographs after applying a very high contrast effect. You can’t. Do you know how contrast/brightness works ?. If not, ask Barrie, a true expert. Regarding your experiments, I agree with your approach. But, for now the results are not convincing (see my previous message). 1) the imprint of you fingers shows sharp borders, contrary to the shroud. 2) No 3 D, contrary to the Shroud 3) Distortions, contrary to the shroud. We need much more..","date":"2015-08-10","mins":"3:38 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-6753","author":"thibault_heimburger","post":"Congratulations Colin. You have shown that there is no obvious wrap around distortion in the contact imprint coming from a very small template (Galaxy warrior) or a perfect cylinder as long as certain conditions are met. And then ? Then, you have to show that on a real human face and/or a life size bas relief. Given your experimental model, I see no obstacle to these experiences..","date":"2016-01-14","mins":"9:14 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/12/contact-prints-from-a-3d-figure-will-always-be-wider-and-suffer-from-wrap-around-distortion-true-or-false/","cat":"contact_imprint","title":"Contact prints from a 3D figure will always be wider and suffer from wrap-around distortion. True or false?"},{"id":"comment-1823","author":"thibault_heimburger","post":"Colin: “Yes, I too was surprised at how “easy” it was to see the streaks in Enrie, and how difficult in Durante’s.” The reason is easy to find. But I will not give the answer on this blog..","date":"2013-02-03","mins":"9:39 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/01/could-this-be-clinching-evidence-that-the-shroud-image-is-a-contact-scorch/","cat":"medieval_forgery","title":"Could this be clinching evidence that the Shroud image is a contact scorch?"},{"id":"comment-1817","author":"thibault_heimburger","post":"Colin, I was just writing a polite answer to your previous posts, with a proposal to send you some photographs from Flury Lemberg’s book, showing that you are wrong regarding the creases and particularly your “final picture”. While I was writing, I received your last post. Since this last post is simply an insult to me and to Mrs. Flury Lemberg (probably the best expert in the world), I will not waste my time with you. I am ready to discuss with a gentleman. You are not a gentleman. Sadly, Thibault..","date":"2013-02-03","mins":"7:49 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/01/could-this-be-clinching-evidence-that-the-shroud-image-is-a-contact-scorch/","cat":"medieval_forgery","title":"Could this be clinching evidence that the Shroud image is a contact scorch?"},{"id":"comment-207693","author":"thibault_heimburger","post":"I am glad to see that Colin now reads John Heller’s book. Pellicori wrote two papers: – ” The Shroud of Turin through the Microscope” (with M.Evans) in which we read : ” The Shroud is not a product of a clever Medieval artist” ( Archaeology, January February 1981 Vol. 34) – ” Spectral properties of the Shroud of Turin” (Applied Optics, 15 June 1980, Vol. 19, N° 12, p. 1913 1920) in which Pellicori described his experiments. From the abstract: ” Simulated aging by air baking reproduced the color of the background linen. Simultaneously, an invisible deposit of perspiration plus skin oils became visible and displayed a reflection spectrum closely resembling that of the body image. Lightly scorched areas on the Shroud are also somewhat similar spectrally, suggesting that a resultant chemistry is possible for dissimilar causes ..” There are many methods to obtain a faint yellowish discoloration of the linen. Colin’s method is just one of them. Looking at his results: http://colinb sciencebuzz.blogspot.co.uk/2015/06/a new and simple thermal imprinting 20.html I just can say that the imprint of his hand does not at all look like the TS hand. See: Is it necessary to explain the differences ?.","date":"2015-08-07","mins":"2:55 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-1825","author":"thibault_heimburger","post":"Just a sample of Colin’s posts: “That is simply unscientific Thibault, and defies commonsense too” “With reluctance I have to say this Thibault – you don ‘t have the first clue as to the scientific modus operandi. Everything you write confirms that again and again”. ““Much more interesting”? Have you any idea how condescending and arrogant you sound, Thibault? What gives you the right to decide what is or is not interesting? For your information I find little of that section above interesting at all, and of dubious relevance.” “You are seriously testing my patience with your barracking and false insinuations…” “PS: And I see you have repeated your ridiculous allegations on Dan Porters’ site. Contemptible. And you have the nerve to bandy around the term “gentleman”. It is you, Thibault, who needs to look at the way you interact with others online. You need to stop talking down the whole time, or posturing as if you know all the answers. You don’t.” “” Is the banding effect (which is a fact) consistent with the scorch hypothesis? I wonder.. Thibault. You feel free to wonder,Thibault. Every second spent wondering is a second less spent promulgating your goal directed brand of pseudo science”. Is Colin a gentleman? You decide. No more comment on this blog..","date":"2013-02-03","mins":"10:32 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/01/could-this-be-clinching-evidence-that-the-shroud-image-is-a-contact-scorch/","cat":"medieval_forgery","title":"Could this be clinching evidence that the Shroud image is a contact scorch?"},{"id":"comment-33565","author":"thibault_heimburger","post":"Dan, your are right. I agree with Colin (surprise !!): “good blog”. But looking again at the Ray Downing’s 3 D Image, I ask: how is it possible ? Today, I visited the Cluny Museum in Paris. I saw many bas relief and (small) seals from the 13 14 centuries. I did not saw anything which could explain the TS image. The TS image is definively unique..","date":"2013-05-12","mins":"3:54 pm","url":"https://shroudstory.com/2013/05/12/dear-stephen-e-jones/","cat":"image_theory","title":"Dear Stephen E. Jones"},{"id":"comment-2108","author":"thibault_heimburger","post":"Nitpicking ? Yes “le diable est dans les détails”. I forget your (usual) graceful comment. I could explain in detail what I mean by “true” 3 D and why in my opinion there is something wrong in your digital processing. First, could your provide the links explaining in detail how Image J works to provide images in relief starting from a 2 D picture ?.","date":"2013-04-18","mins":"5:19 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/17/doh-i-can-think-of-only-19-reasons-why-the-shroud-image-was-made-by-thermal-imprinting-scorching-onto-linen-from-a-heated-effigy/","cat":"heated_effigy","title":"Doh! I can think of only 19 reasons why the Shroud image was made by thermal imprinting (“scorching”) onto linen from a heated effigy"},{"id":"comment-2110","author":"thibault_heimburger","post":"You wrote: “No. Why should I do your homework? Image J is available to everyone, not just me.” I have Image J but I am unable to find how to produce a relief. Thank you for your help !!.","date":"2013-04-18","mins":"6:11 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/17/doh-i-can-think-of-only-19-reasons-why-the-shroud-image-was-made-by-thermal-imprinting-scorching-onto-linen-from-a-heated-effigy/","cat":"heated_effigy","title":"Doh! I can think of only 19 reasons why the Shroud image was made by thermal imprinting (“scorching”) onto linen from a heated effigy"},{"id":"comment-2112","author":"thibault_heimburger","post":"For example, your “x11 cropped final x2.png” image. How is it that the blood stains do not show any kind of relief, contrary to the VP8 images ? You wrote: “If you are genuinely interested in using Image J, then you have only to say, and I will give a brief list of instructions. ” Yes, I am..","date":"2013-04-18","mins":"7:50 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/17/doh-i-can-think-of-only-19-reasons-why-the-shroud-image-was-made-by-thermal-imprinting-scorching-onto-linen-from-a-heated-effigy/","cat":"heated_effigy","title":"Doh! I can think of only 19 reasons why the Shroud image was made by thermal imprinting (“scorching”) onto linen from a heated effigy"},{"id":"comment-2106","author":"thibault_heimburger","post":"” But if it’s 3 D enhancement of a scorched on image, you seek, I suggest you take a look at my banner, especially the image at the extreme right.” Just a short comment, Colin. Your so called 3 D “image at the extreme right” is NOT a true 3 D image of the adjacent image (in the sense of the 3 D “VP8” characteristics of the TS image). You own scorch experiment shows only obvious “artistic effects” that have nothing to do with the true 3 D characteristics of the TS image. The “nose” of your template is flat although it is one of the more bright part, the borders are artificially bent etc… This has nothing to do with the 3 D MAP (it is truly a map) of the TS image. (Just compare with the image at the extreme left of your banner); In fact, I have tried to find on your blog an image coming from your scorch experiments having the TRUE 3 D characteristics of the TS. I found none, except the coins (i.e the smallest objects)..","date":"2013-04-17","mins":"10:24 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/17/doh-i-can-think-of-only-19-reasons-why-the-shroud-image-was-made-by-thermal-imprinting-scorching-onto-linen-from-a-heated-effigy/","cat":"heated_effigy","title":"Doh! I can think of only 19 reasons why the Shroud image was made by thermal imprinting (“scorching”) onto linen from a heated effigy"},{"id":"comment-208773","author":"thibault_heimburger","post":"I have purchased this paper (“Lignification in the flax stem..”) some years ago. I have it. And then ? There is a major problem with Colin. He is going so fast that nobody can follow him. Jumping from an hypothesis to another one, there is no time to discuss seriously. For example, looking at his dry flour model, I would like to see much more photographs because what I have seen is not at all convincing. Too late ….","date":"2015-08-23","mins":"9:39 am","url":"https://shroudstory.com/2015/08/23/have-we-all-been-looking-in-the-wrong-place/","cat":"image_theory","title":"Have we all been looking in the wrong place?"},{"id":"comment-208884","author":"thibault_heimburger","post":"This ” “medical training conquers all (scientists included) critic” has much more training in microscopy than you. I repeat (once again): you can not say anything about the image layer with this kind of picture https://shroudofturinwithoutallthehype.files.wordpress.com/2015/08/illum 7 nw.jpg?w=300&h=225 This is only possible if your are able to show us a picture like Fig. 19 in https://shroudofturin.files.wordpress.com/2014/04/scorch 2 eng final.pdf Just compare them. But for now I would like to study in detail ” the image one obtains with the more recent flour imprinting technology (dry flour powder this is, not wet slurry, imprinted onto wet linen). But it’s the final attenuated image after washing with soap and water – not straight from the oven.” I need a picture showing the details, i.e a much more “heavy” image (the final attenuated image only). You should upload this large file on a specialized site and then give us a link to download it..","date":"2015-08-24","mins":"3:16 pm","url":"https://shroudstory.com/2015/08/23/have-we-all-been-looking-in-the-wrong-place/","cat":"image_theory","title":"Have we all been looking in the wrong place?"},{"id":"comment-208779","author":"thibault_heimburger","post":"Yes I will try at home. With and without oil (although with oil there is no half tone, according to you !!) Probably another PDF !!!.","date":"2015-08-23","mins":"10:40 am","url":"https://shroudstory.com/2015/08/23/have-we-all-been-looking-in-the-wrong-place/","cat":"image_theory","title":"Have we all been looking in the wrong place?"},{"id":"comment-164982","author":"thibault_heimburger","post":"Anoxie and all, I fully agree with Dan. Accusations of intellectual dishonesty MUST be definitely excluded except if it is obvious. Regarding the Shroud, nobody including myself is completely objective. It is simply impossible. There are too much data, observations, interpretations etc. After about 10 years of researches, I can only say that a Middle age forgery does not make sense for me for many reasons. Regarding Colin, as I wrote, I do not understand him. I wrote: ” …All of that being based on image manipulations.” This does not imply any kind of intellectual dishonesty. Simply that he does not know/understand what he is doing while “manipulating” the images..","date":"2014-10-23","mins":"6:08 pm","url":"https://shroudstory.com/2014/10/22/homogeneous-or-not-thats-the-question/","cat":"image_theory","title":"Homogeneous or Not? That’s the Question"},{"id":"comment-164700","author":"thibault_heimburger","post":"I’m unable to read the entire Colin’s new post, given its length, its nauseating mixture of different “observations”, hypotheses, critics, etc.and the fact that Colin uses the term “homogeneous” in a very particular sense, finally adding the “new” concept of “two tone” image. All of that being based on image manipulations. Compare the original pictures given by Hugh http://news.bbc.co.uk/1/hi/world/europe/8612315.stm with Colin’s pictures. Starting from different pictures of the Shroud, I can show you everything you want. But I will not do that because I know that image processing is a professional work and I am not an expert. Anoxie: “Now, waiting for Thibault and his pdf n°3.” Recently, I had to prepare my paper for the Saint Louis Conference. My pdf3 will be written as soon as possible..","date":"2014-10-22","mins":"5:18 pm","url":"https://shroudstory.com/2014/10/22/homogeneous-or-not-thats-the-question/","cat":"image_theory","title":"Homogeneous or Not? That’s the Question"},{"id":"comment-165517","author":"thibault_heimburger","post":"I wrote: ” Regarding Colin, as I wrote, I do not understand him. I wrote: ” …All of that being based on image manipulations.” This does not imply any kind of intellectual dishonesty. Simply that he does not know/understand what he is doing while “manipulating” the images.” Colin answered: http://colinb sciencebuzz.blogspot.fr/2014/10/the turin shroud tweaking of shroud.html “Does TH know what’s happening inside his patient’s cells each time he prescribes an antibiotic or some other drug? No, and what’s more he doesn’t need to. What he does is monitor the outward symptoms, and look for changes that can be construed as improvements in the patients’ condition. It’s called intervention. It’s what professionals do. They intervene. Well, it’s much the same where image enhancement is concerned. Does TH seriously imagine that the base images available say on Shroud Scope are sacrosanct? Indeed, does he imagine they are the ‘authentic’ representation of the TS image, when 1532 burn holes do not look like burn holes? Well, they do after I have made my very minor adjustments in contrast, brightness and mid tone value (see how minor they are from my reference tablecloth photo above). No TH, I am NOT the innocent abroad you (or Dan Porter) make me out to be”. Colin, can you explain? Particularly “Indeed, does he imagine they are the ‘authentic’ representation of the TS image, when 1532 burn holes do not look like burn holes? Well, they do after I have made my very minor adjustments in contrast, brightness and mid tone value (see how minor they are from my reference tablecloth photo above”.","date":"2014-10-25","mins":"6:09 pm","url":"https://shroudstory.com/2014/10/22/homogeneous-or-not-thats-the-question/","cat":"image_theory","title":"Homogeneous or Not? That’s the Question"},{"id":"comment-165733","author":"thibault_heimburger","post":"Hi Colin, I have the Halta Definitzoni images in my computer. You wrote on your blog: “. *And if anyone says it’s “just” blood, I have another image, ready and waiting, to kick that suggestion into the long grass.” OK, please show me this “another image” Thanks..","date":"2014-10-26","mins":"6:25 pm","url":"https://shroudstory.com/2014/10/22/homogeneous-or-not-thats-the-question/","cat":"image_theory","title":"Homogeneous or Not? That’s the Question"},{"id":"comment-21427","author":"thibault_heimburger","post":"Dear all, A very interesting discussion to begin this new year!! I have so many things to say and … so many questions !!! For example, the so called “growth nodes” seen on flax fibers are not “growth nodes” but dislocation bands. In order to discuss the question of the superficiality with regard to the flax fibers microstructure, we have to start on solid bases. I have several scientific papers (not necessarily related to the Shroud) to share with you. The problem is so complex that I have to write a paper (yes another paper !!) about this topic. Please be patient …. I am happy to see that people having different points of views (Adrie*, Hugh, Anoxie, Art..and even Colin (now) etc..) are able to discuss without any kind of anathema. Thank you Dan. I wish a happy fruitful new year to all of you. Thibault. * Adrie: I must say that, although your paper is interesting, I disagree with your conclusions and there are many errors in the references and quotations..","date":"2013-01-01","mins":"1:16 pm","url":"https://shroudstory.com/2013/01/01/important-aspect-of-flax-fiber-microstructure-and-rogers-ghosts/","cat":"image_theory","title":"Important aspect of flax fiber microstructure and Rogers’ “ghosts”"},{"id":"comment-21491","author":"thibault_heimburger","post":"Max, you wrote: “If ever there would have been an invisible French reweaving, it just could not be medieval but only from the 1860s.” References please..","date":"2013-01-02","mins":"4:02 pm","url":"https://shroudstory.com/2013/01/01/important-aspect-of-flax-fiber-microstructure-and-rogers-ghosts/","cat":"image_theory","title":"Important aspect of flax fiber microstructure and Rogers’ “ghosts”"},{"id":"comment-87447","author":"thibault_heimburger","post":"That’s true. To work seriously one has to consider the differences between fiber, thread and fabric levels..","date":"2014-03-11","mins":"4:53 pm","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","title":"Is Time the Secret Ingredient We Need to Consider?"},{"id":"comment-51727","author":"thibault_heimburger","post":"David Goulet : Why wouldn’t pilgrims be fooled by a scorch? It was not a known method of image creation at that time was it? This is why I’d have thought a darker scorch would have been preferred by a forger — why create such a light scorch that would be difficult for people to see? Let me explain in detail my thoughts. What follows must be read in the context of a medieval forgery made either by a “simple” scorch technique or a more complex one, like the “composite painting” It has been claimed that the image was more visible in the middle ages than now. There is no historical proof of that (to my knowledge) but it is a direct consequence of these hypotheses. Then we are told that the heavily scorched fibers found in the inevitable “hot points” (brown areas) flaked off over the time, leaving only the lightly yellowish monochromatic colored fibers we see today. Incidentally, it would be a miracle (I can explain why, but later). Consequently, those “hot spots” that can be seen with the naked eyes must have been present in the middle ages. In other words, anybody looking carefully at the image would have recognized in some areas the typical signature of a scorch. Perhaps not the pilgrims but certainly the bishops and other “authorities” who looked at it through the centuries. To my knowledge, the possibility for the image being a scorch was never suggested until the modern ages. Think about that. Our ancestors were not stupid and they certainly knew what a scorched fabric is. Therefore, it seems much more probable that if the image is a scorch, it did not look like a scorch also in the middle ages. ” why create such a light scorch that would be difficult for people to see?” Because it’s the only way to create a “true relic”. A ghostly faint image is much more convincing than a dark scorch. And the image was as visible for the pilgrims in the middle ages as it is now. I don’t see the problem..","date":"2013-11-17","mins":"9:02 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51746","author":"thibault_heimburger","post":"Colinsberry : Quite. I’d go further, and say i do not understand Thibault’s aversion to the idea of the image being a superficial scorch, since that does not exclude authenticity. STURP described the chemical nature of the image layer essentially as a scorch, even if not using that precise term, i.e. As carbohydrate that had undergone chemical dehydration, oxidation etc. The various radiation hypothesis all envisage some reaction with linen carbohydrates that do not require the presence of other chemicals except those in air, so why not describe the discoloration as a radiation scorch? Maybe it’s the idea of a contact scorch that Thibault objects to, i.e. From a hot inanimate template as might be used by a medieval forger, but who’s to say that the chemical changes are not dissimilar to that produced by any other scorched on imprint obtained by a completely different mechanism that is more compatible with authenticity. I have no “aversion” to the idea of a superficial scorch. I just want to study it (like you Colin) but with experiments, since it is the only image formation mechanism that is testable (more or less) easily. Sorry Colin, ” STURP described the chemical nature of the image layer essentially as a scorch, even if not using that precise term (..)” is misleading and you know that the STURP excluded the scorch hypothesis. You should have written: “the STURP described the chemical nature of the image layer as essentially SIMILAR to a scorch..” But the chemistry of the image is also consistent with the effect of a weak acid etc.. Anything that produces a superficial dehydration of the surface of the fibers can work, in theory. Yes, it is the idea of a contact scorch I object to. It seems that you agree that there are at least some problems with a contact scorch imprint. So that now you are insisting on other mechanisms involving heat transfer. Radiation (energy transferred from a hot object through electromagnetic waves, mostly infra red) or convection (energy transferred through the kinetic energy of the heated molecules of air). The problem is that there is no way to obtain any color on a modern linen through a 3 4 millimeters layer of air. Read again carefully my poor pdf: page 3 (preliminary experiment), Fig.1, samples 1 and 2. . I used a metal hotplate having in its center a rounded small 3 to 4 millimeters deep depression. The temperature (not measured) was everywhere the same at the surface of the plate, including the depression. I applied firmly the linen on the plate. Is there a better way to test the effects of radiation and convection ? I concluded: “One can conclude that even with a temperature and contact time much higher than that used by the alleged forger, a true contact is necessary to obtain a color: radiant energy through air does not work.” I repeat: a contact( even a light one) is absolutely necessary to obtain even a faint discoloration. Maybe convection and or radiation could be a small part of the mechanism of fibers discoloration in contact areas when a hot template is applied on a linen: but what does it change? There must be a contact and the overall result is always problematic. I have now to work on the ME images pdf. Sorry, but I think that I will add some short comments (Am I allowed to do that ; ) ? I’ll send it to Dan in the next hours..","date":"2013-11-17","mins":"10:31 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51785","author":"thibault_heimburger","post":"Unfortunately Colin this picture is NOT from the Shroud, as I thought many years ago. It comes from one of the Fanti’s experiments (with laser or corona discharge, I don’t remember). Dan can explain that better than me, if he wants. PS: I have just sent the ME pdf to Dan. I hope that you (and everybody) will enjoy it; A good start for interesting discussions ?.","date":"2013-11-17","mins":"5:01 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51792","author":"thibault_heimburger","post":"Regarding blood and potassium: In my “paper” : http://www.shroud.com/pdfs/thibault%20final%2001.pdf I wrote: “SEM/EDX data from dried blood residues were studied by Dixon and al (T.R. Dixon, A.V. Samudra and al. A Scanning Electron Microscope Study of Dried Blood. Journal of Forensic Science, Oct.1976, Vol. 21, N°4, 797 803). . In particular, samples of blood smears, crusts and dried blood on cloth (up to 7 years old) and graphite were analyzed after subtraction of the spectra generated by the substrate. We must remember that the peak heights in the qualitative EDXRA spectra can not be directly related to the actual amounts of the measured species. All the blood spectra showed a characteristic pattern: Chlorine (Cl), Sulphur (S) and Potassium (K) peaks predominate in nearly the same ratio. Blood on cloth gave the following results, in % (rounded): Cl: 22 27, S: 12 22, K: 11 23, Si: 7 17, Ca: 5 14, P: 0.4 13, Al: 1 9, Na: 0 5, Mg: 1 3, Fe: 0 2. Although the data are presented differently (% vs. Peaks heights), the comparison with the EDXRA data of the 10 “blood” shards on the Shroud is interesting: – For the 3 major peaks of real blood: Cl on Shroud is consistent with blood, S is present but the actual peak count on the Shroud is unknown (see vermilion Hg/S chapter below) and the very small peak of K seems not compatible with K in whole blood. However, Adler gives a possible explanation for this fact (see below). – The counts for Si and Al relative to Cl in the Shroud “blood” shards are not inconsistent with the relative percentages of the same elements in real blood. Therefore, one can not eliminate blood on the basis of their presence in the “blood” shards on the Shroud as it has been claimed. – Ca is also found in blood at a level roughly consistent with what is found in the Shroud “blood”, and the small excess could come from the calcium bound to the cellulose. – The iron peak height of whole blood in EDXRA spectra is surprisingly low: there is much more Fe in the Shroud red shards than expected for whole blood. Yes, there is a problem with potassium….in whole blood..","date":"2013-11-17","mins":"5:23 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51802","author":"thibault_heimburger","post":"You’ll see those pictures “at a similar level of magnification” in my forthcoming pdf. Good night !.","date":"2013-11-17","mins":"5:49 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51525","author":"thibault_heimburger","post":"Colin, I will post some of the 32 ME photographs the next week end (including clear cloth, image, scorch, blood etc.). Now it seems you want to see individual fibers of the TS image in close up. There is the high resolution contrast phase picture provided by Rogers, (Dan, can you show it again ?). The best one. There are also the pictures from Fanti in our paper about superficiality… ” Indeed, in the paper you cite [My paper], we are really told very little about the microscopic character of the individual image fibres of the Shroud except that they are uniformly pale yellow, with no burnt bits, and those yellow fibres can be adjacent to non yellowed (the well known half tone effect)” The half tone effect has nothing to do with the observed fact that “yellow fibers” can be adjacent to non yellowed fibers. The half tone effects actually means that the color density of a given image area depends only on the numbers of yellowed fibers in a given image area and does not depend on the color of the individual fibers. All the image fibers have the same yellowish color (+/ 10%). “But there is the crucial observation that scorched fibres are brittle, and putting that together with the evidence from Fanti et al elsewhere that Shroud image fibres fracture more easily than non image fibres, there is an alternative explanation for the uniformly yellow fibres and the so called half tone effect, namely that we are now seeing only those very lightly scorched fibres (regardless of scorching mechanism) that have survived to this day without breaking and falling off. One can hardly expect the modern day experimentalist to reproduce image forming mechanisms AND the effect of centuries of ageing and disintegration.” That’s true. We have to think about the result of ageing and disintegration. I don’t think that ageing and disintegration can explain the TS image properties. We have to work. But if you write: ” One can hardly expect the modern day experimentalist to reproduce image forming mechanisms AND the effect of centuries of ageing and disintegration.” then you close the door..","date":"2013-11-15","mins":"7:27 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51514","author":"thibault_heimburger","post":"Hugh Farey : Remind us, anoxie, why did Rogers exclude the scorch hypothesis? There are several reasons. But, one of the most important can be found in his book: “”A chemist’s perspective…” P.32, Fig.VI 1: “A LIGHTLY scorched fiber. The medulla shows DARKER coloration than the rest of the fiber” Fig VI 2: An UNUSUALLY DEEPLY colored image fiber: the medulla is completely colorless” Look, at the pictures..","date":"2013-11-15","mins":"5:57 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51654","author":"thibault_heimburger","post":"Some comments: Hugh (# 56): ” Revisiting my own photos of scorched fibres, I do not find that the lumen (why does Rogers consistently call it the medulla I wonder?) is always darkened. Even in his own micrograph, presumably chosen carefully to illustrate his point, there is hardly any darkening of the lumen visible. Had the fragment that does appear darkened been photographed at X200 (like the image fibre next to it) it may not have shown any dark middle at all. This is not an important reason to exclude the scorch hypothesis. The fluorescence thing, I think, is the true cruncher.” Rogers wrote: ” When viewed in parallel light under a microscope, a scorched fiber (Fig VI I) is colored through its entire diameter, and the medulla (..)usually appears to be darker than the mass of the fiber as a result of reactions at its surface and its shorter radius of curvature. The medullas of image fibers do not show any coloration or charring (figure VI 2). Image fiber medullas are usually clean and colorless”. The fact that Rogers compared LIGHTLY scorched fibers with an UNUSUALLY DEEPLY COLORED IMAGE FIBER is the main point. No doubt that Rogers did look carefully at the samples he had. The figures in his book are only shown as an example of his observations performed on many fibers from the Shroud. The term “usually” is important. You wrote that the lumen in your own scorch experiments are not always darkened. What is the difference between “usually” (Rogers) and “not always” (you)? It should be interesting to look at your own experiments. Where did you find scorched fibers without darkened lumen ? Colin (#45): “But there is the crucial observation that scorched fibres are brittle, and putting that together with the evidence from Fanti et al elsewhere that Shroud image fibres fracture more easily than non image fibres, there is an alternative explanation for the uniformly yellow fibres and the so called half tone effect, namely that we are now seeing only those very lightly scorched fibres (regardless of scorching mechanism) that have survived to this day without breaking and falling off. One can hardly expect the modern day experimentalist to reproduce image forming mechanisms AND the effect of centuries of ageing and disintegration.” Yes, no doubt that scorched fibers are brittle. However, the burned and scorched fibers from the 1532 fire do not show any kind of disintegration (you will see that tomorrow). Moreover, I don’t think that the pilgrims and the Authorities could be fooled by a scorch imprint. This has been never described. The famous (controversial) D’ Arcis ” memorandum” does suggest a “paint” (but it is not a paint) not a scorch..","date":"2013-11-16","mins":"6:03 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-135151","author":"thibault_heimburger","post":"What to say ? Colin wrote: “I explained a while ago that I am reporting a long term ongoing research project, started some 30 months ago, in real time, with a blow by blow account.” The current result of this long time research: the TS image is a scorch, But I do not know how it was made. And It is not a photograph (we knew that). Hot template? But ‘However, I’m as conscious as the next man of the practical difficulties of imprinting successfully off a life size effigy. Mistakes would be costly, given the price of quality linen,’ Price? Is it really the problem? In my opinion, the so called practical difficulties of imprinting using a hot template are in fact impossibilities.See my PD Fs: PDF1: https://shroudofturin.files.wordpress.com/2012/10/scorch paper en.pdf PDF2: https://shroudofturin.files.wordpress.com/2014/04/scorch 2 eng final.pdf As an answer, CB wrote: http://colinb sciencebuzz.blogspot.fr/2014/06/thibault heimburger is incorrect linen.html Look at my PDF1.in which I wrote: ‘Another interesting fact comes from the observation of the lack of visible color on the backside of the lateral bands of sample 3 (Fig.2, sample 3 B) even if the corresponding areas on the front (heated) side are STRONGLY scorched. This is explained by the fact that I immediately removed the hot plate (contact time less than one second). A superficial discoloration at fabric level can be obtained even at high temperature with a very short contact time because the diffusivity of the cellulose of linen is very low’. In any case, lack of color on the reverse side does not mean “superficial” in the sense of the superficiality of the TS image as shown in PDF 2. After many hours of experiments,I know that the Ts image is not a scorch. Because heating (alone): 1) can not give a discoloration as superficial as the TS image (only 1 3 surface fibers) DO YOU REALIZE THE EXTREME SUPERFICIALITY OF THE TS IMAGE ? 2) can not explain the half tone effect. Then Colin tried the quicklime hypothesis ???? And … And now the “impactograph” (or impactogram). I do not understand CB’s way of working, jumping from one subject to another.. I definitely prefer PD Fs …..","date":"2014-07-03","mins":"4:01 pm","url":"https://shroudstory.com/2014/07/03/its-everything-to-do-with-an-unyielding-structure-called-the-upper-rib-cage/","cat":"image_theory","title":"It’s everything to do with an unyielding structure called the upper rib cage"},{"id":"comment-135353","author":"thibault_heimburger","post":"Sorry Colin, I do not consider your ‘dried onion epidermis’ experiment relevant. There are too many differences with direct experiments on linen. Do you want me to list the differences ? In fact there is absolutely no relationship between your experiment and the fact that you are supposed to demonstrate, i.e. It is possible to scorch only 2 3 fibers at the surface of a linen sheet with a hot template by direct contact..","date":"2014-07-04","mins":"3:20 pm","url":"https://shroudstory.com/2014/07/03/its-everything-to-do-with-an-unyielding-structure-called-the-upper-rib-cage/","cat":"image_theory","title":"It’s everything to do with an unyielding structure called the upper rib cage"},{"id":"comment-197863","author":"thibault_heimburger","post":"From your very preliminary pilot experiments, the first problem is to find an imprinting medium able to produce a continuous image rather than scattered colored spots..","date":"2015-04-28","mins":"2:29 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","title":"Might tactile chemography prove to be the super-model?"},{"id":"comment-197668","author":"thibault_heimburger","post":"For the time being, Colin is only at the beginning of his work. Here is what Rogers wrote in “Physics and chemistry of the Shroud of Turin” (P; 28 29): “Hypotheses on chemically induced cellulose degradation: (…) Concentrated sulfuric acid, for example, dehydrates cellulose to produce a convincing yellow discoloration; however, attempts to create an image with acid were rather disappointing. In particular, it proved quite difficult to control the depth penetration, and densities of the stains. Also, unless the acid is properly neutralized, the continuing reaction can cause disastrous effects.” Colin’s experiments show that. And: ” the results of experiments with chemically induced cellulose degradation have, so far, provided the closest approximation to the observed image characteristics; however, the approach has some difficulties. The problem of controlling depth penetration of the applied materials has already been mentioned.(…) Depth penetration can depend not only on the fluid properties of the foreign material but also on the surface and absorption characteristics of the linen fibers. Simulated image stains, to date, have been fairly successful, but more work is necessary.” “More work”: it seems to me that this is exactly what Colin is doing. For now, the results are not convincing but we will see..","date":"2015-04-26","mins":"3:52 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","title":"Might tactile chemography prove to be the super-model?"},{"id":"comment-198221","author":"thibault_heimburger","post":"Back from Turin. As in 2010, it was a wonderful experience. Colin: “Maybe we need an updated checklist.” of the defining details, the “details” that any kind of model must share with the TS. Yes, we need it otherwise we could discuss endless. In this discussion, we have to face at least two challenges. 1) The image is necessarily the result of the interaction between the Body Image Formation (BIF) Process and the linen. 2) The effect of ageing. There are some properties of the image which are directly related to the BIF process: negativity, superficiality at fabric and thread level, 3 D properties. In my opinion we can add: high resolution, fuzziness of the contours, “no patch” (the image is continuous in a given image area at macro level). But there are also some properties for which point 1) and or point 2) could be more or less important (or not): – The banding effect – Narrow range of optical densities – No saturation, no “hot point” – Faintness – Half tone – Discontinuities at micro level – Superficiality at fiber level – Mechanical weakening of entire image bearing fibres – …. In other words, is it possible to find a rational method to decide that a given model is compatible with the TS image (or not), taking into account Points 1 and 2 ?.","date":"2015-05-03","mins":"4:01 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","title":"Might tactile chemography prove to be the super-model?"},{"id":"comment-197958","author":"thibault_heimburger","post":"Colin, “These aspects of the TS that the new model is supposed to match” are very important. Your new model, at the end, must match (or at least be compatible with) the fundamental surface distribution properties of the TS: superficiality (at fabric, thread and fiber level), uniformity of the image (no “hot point”, no spot, no “hole”), half tone and fuzzy contours, and bundles of fibers adjacent to uncolored fibers… Now, if you think that these facts are not proved, despite the many photos you have, I can’t add anything. If you think that those properties are not important at all, please explain… The ” ‘scattered colored spots” (also seen in Garlaschelli’s shroud) is only my description of your hand imprint. I’ll be in Turin until Sunday..","date":"2015-04-29","mins":"3:32 pm","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","title":"Might tactile chemography prove to be the super-model?"},{"id":"comment-6991","author":"thibault_heimburger","post":"“As regards the first part of your comment, I’m having some difficulty deciding whether you agree, disagree, or both as regards my contention that the so called fluorescence photograph does NOT show fluorescence, which as you say would be limited to the margins of bloodstains and thus likely to be scarcely if at all visible in an untouched photograph taken in uv light.” I agree that the so called fluorescence photograph does not truly show fluorescence. My remark concerned only the basic photograph which is perhaps the fluorescence photograph. But in this case the manipulation of the original photograph is highly misleading.There is ” no genuine red fluorescence in all those locations like nose, beard, moustache, creases etc, and no genuine yellow fluorescence either for that matter” as you wrote. In conclusion I agree on the substance of your criticism of Stephen Jones..","date":"2016-02-17","mins":"9:02 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/25/modelling-the-shroud-of-turin-with-white-flour-olive-oil-and-a-real-face-in-pictures/","cat":"turin_shroud","title":"Modelling the Shroud of Turin with white flour, olive oil and a real face – in pictures."},{"id":"comment-6987","author":"thibault_heimburger","post":"Colin, You should be right (or not, as I think) about the fact that the photograph in question is simply “an Enrie 1931 negative that has been confusing photoedited to give false colour to higher density regions of body image (negative white to red).” For the simple reason that there is a correlation between the visible negative photograph (Enrie) and the UV Vis photograph. The advantage of the UV Vis is mainly to show some features that are almost invisible in the normal photograph (like the bright halos around most of the bloodstains or the details of the scourge marks). However you are right when you wrote: ” The choice of red as false colour makes the picture not only scientifically worthless, but a source of confusion and dare I say pseudoscience, especially if used to support the notion that the beard and moustache and nose etc are heavily bloodstained. I’d be interested to know what captions appeared on those two half pictures you mention. One wonders if the publishers of the journal played too great a role in assembling that paper, and got things DISASTROUSLY WRONG.” You wrote: “I’d be interested to know what captions appeared on those two half pictures you mention. ” I can give you not only the captions and also the UV Vis photographs. But for that you have to allow me to show them directly in my comments in this blog. (from Colin Berry: I recently discovered that this Word Press site offers a means of editing other folks’ comments so as to allow a late insertion of a photograph etc. I immediately decided it’s not something I would want to do unless requested. I’m testing the facility right now to see if it works with words, and might try later inserting a test picture as well. Let’s see if these words appear).","date":"2016-02-16","mins":"10:24 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/25/modelling-the-shroud-of-turin-with-white-flour-olive-oil-and-a-real-face-in-pictures/","cat":"turin_shroud","title":"Modelling the Shroud of Turin with white flour, olive oil and a real face – in pictures."},{"id":"comment-6990","author":"thibault_heimburger","post":"Hi Colin, This could help you: https://wordpress.org/plugins/comment images/.","date":"2016-02-17","mins":"8:34 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/25/modelling-the-shroud-of-turin-with-white-flour-olive-oil-and-a-real-face-in-pictures/","cat":"turin_shroud","title":"Modelling the Shroud of Turin with white flour, olive oil and a real face – in pictures."},{"id":"comment-6965","author":"thibault_heimburger","post":"Colin, “So I intend now to draw a line under 4 years of internet based research, and leave the MSM – with or without the aid of search engines (almost certainly without) – to find my stuff for themselves. What I may do in the next week or so is make a list of what I consider my 10 chief findings, and add links to the relevant postings. It’ll go up as one more comment, not a new posting. The present one is my last, unless or until there’s a major shift in search engine returns.” It’s your decision. For my part, I have decided to pursue your promising experiments in the coming months..","date":"2016-02-12","mins":"8:45 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/25/modelling-the-shroud-of-turin-with-white-flour-olive-oil-and-a-real-face-in-pictures/","cat":"turin_shroud","title":"Modelling the Shroud of Turin with white flour, olive oil and a real face – in pictures."},{"id":"comment-6932","author":"thibault_heimburger","post":"OK Colin But at least can you show me a HD picture of the imprint of your hands ?.","date":"2016-02-04","mins":"11:19 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/25/modelling-the-shroud-of-turin-with-white-flour-olive-oil-and-a-real-face-in-pictures/","cat":"turin_shroud","title":"Modelling the Shroud of Turin with white flour, olive oil and a real face – in pictures."},{"id":"comment-6982","author":"thibault_heimburger","post":"Yes and no. This image is in fact the cover photo of the article of Miller and Pellicori: “UV Photography of the Shroud of Turin” (Journal of Biological Photography, Vol 49, N°3, July 1981). I have this paper. It seems to be a false color enhanced reproduction of the UV/VIS fluorescence photograph of the face. It is not a ” photoedited Enrie image etc.”. Unfortunately, in the paper itself the face is not shown entirely. Page 80 we see the upper part of the ventral head area (hair, eyes) and page 81 the lower part (mustache and beard). Of course the caption on Stephen Jones site (” Above: “The Shroud face, as seen in fluorescent light.”[6], showing that while its bloodstains fluoresce, i.e. They were formed from real blood, the image does not fluoresce, showing it is not a thermal scorch [7].”) is meaningless. Bloodstains do not fluoresce.And the red is only a false color. Bloodstains do not fluoresce at all (as expected): they are black in the UV/VIS photographs (but with a highly fluorescent border in many cases) The Shroud features, in general, do not emit any visible emission under UV while the background emits a yellow green color. However,it is true that on the face the UV/VIS “darkness” of the nose, the mustache and the beard suggests (repeat: suggests) that some blood is present in these areas. More information on request..","date":"2016-02-15","mins":"10:27 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/25/modelling-the-shroud-of-turin-with-white-flour-olive-oil-and-a-real-face-in-pictures/","cat":"turin_shroud","title":"Modelling the Shroud of Turin with white flour, olive oil and a real face – in pictures."},{"id":"comment-6938","author":"thibault_heimburger","post":"Thank you so much Colin. This is the kind of pictures we need. These imprints are truly TS like. In fact your imprints of the hands are the best I ever seen( much more convincing than those of Garlaschelli for example…). Some remarks: – It’s clear that the oil assisted imprint (on left) is much more convincing than the “without oil” imprint (on right). I now understand the need to use oil. It’s easy to understand the reason. – I now clearly see that the background has about the same color than the background of the TS. Your modus operandi automatically produces artificial aging. Question: – can you confirm that your imprints are not visible on the back side of your samples ? – And now? What do you plan to do ? If I were you, I would use your samples to look at them microscopically. And you ?.","date":"2016-02-05","mins":"8:48 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/25/modelling-the-shroud-of-turin-with-white-flour-olive-oil-and-a-real-face-in-pictures/","cat":"turin_shroud","title":"Modelling the Shroud of Turin with white flour, olive oil and a real face – in pictures."},{"id":"comment-6902","author":"thibault_heimburger","post":"Yesterday, I wrote: “As I wrote: more later (tomorrow).” Correction: not “tomorrow” (i.e. Today). Too busy.. You’ll have to wait for some days. Sorry..","date":"2016-01-31","mins":"9:01 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/25/modelling-the-shroud-of-turin-with-white-flour-olive-oil-and-a-real-face-in-pictures/","cat":"turin_shroud","title":"Modelling the Shroud of Turin with white flour, olive oil and a real face – in pictures."},{"id":"comment-6911","author":"thibault_heimburger","post":"Not sure to understand what you have in mind with the photograph above. I used the same part of the face coming from the HD photograph with J Image. It is easy to see that the key parameter is the min value. Why to choose your value rather than another ? With different min values, you obtain different pictures. Nevertheless, even in your picture, it’s easy to see that the “highest” parts of the face in red are surrounded by yellow areas. In these yellow areas, the “height” (density) is intermediate. This is an example of what I call the subtlety of the TS image..","date":"2016-02-01","mins":"9:29 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/25/modelling-the-shroud-of-turin-with-white-flour-olive-oil-and-a-real-face-in-pictures/","cat":"turin_shroud","title":"Modelling the Shroud of Turin with white flour, olive oil and a real face – in pictures."},{"id":"comment-6930","author":"thibault_heimburger","post":"Thanks Colin. Working with Image J is certainly useful, I agree. As for me, I’m currently working with GIMP (a free software more or less similar to Photoshop). My goal is to study in depth the luminance (density) of the TS face. It is a work in progress. And I’m working with the HD pictures. The face is THE challenge! Meanwhile, it could be interesting to compare the hands. It would be very helpful to: 1) artificially age your sample (using your oven) 2) and to give us a HD picture of the result. Ye, I know…But it would be very useful..","date":"2016-02-04","mins":"10:13 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/25/modelling-the-shroud-of-turin-with-white-flour-olive-oil-and-a-real-face-in-pictures/","cat":"turin_shroud","title":"Modelling the Shroud of Turin with white flour, olive oil and a real face – in pictures."},{"id":"comment-6898","author":"thibault_heimburger","post":"No, it is not at all “entirely subjective”. It is a question of density gradient that can be easily measured using your model and compared with that of the TS image. “An impossible bar” ? It is the challenge of the TS. “I’m only here for the science”. Me too. As I wrote: more later (tomorrow)..","date":"2016-01-30","mins":"7:56 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/25/modelling-the-shroud-of-turin-with-white-flour-olive-oil-and-a-real-face-in-pictures/","cat":"turin_shroud","title":"Modelling the Shroud of Turin with white flour, olive oil and a real face – in pictures."},{"id":"comment-6896","author":"thibault_heimburger","post":"I wrote: “How is it possible for a medieval forger to produce BY CHANCE an imprint that after tone reversal gives a perfect (absolutely perfect) human face ? ….It is a question of subtlety of the imprint.” Then why did you answer: ” Sorry, but one cannot deploy the adjective “perfect” and in the same breath describe the features as having suffered injury”? Using the word “perfect”, I mean what follows: The (negative) TS face shows a density gradient so subtle that you can immediately recognize a human face as if you were in front of the photograph of a human being. In other words, the density gradient between, say, the nose and the cheeks is “perfect”. If you increase the density of the nose, even slightly, the abnormality is obvious. There is no abnormality of this kind in the TS face (except perhaps the mustache). What does it mean in the context of the hypothesis of the work of a medieval forger ? It means, in my opinion, that he was able to PERFECTLY transfer the information between the template (bas relief or real human face) and the linen. More later..","date":"2016-01-30","mins":"7:04 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/25/modelling-the-shroud-of-turin-with-white-flour-olive-oil-and-a-real-face-in-pictures/","cat":"turin_shroud","title":"Modelling the Shroud of Turin with white flour, olive oil and a real face – in pictures."},{"id":"comment-6887","author":"thibault_heimburger","post":"About your forthcoming “manifesto”. “(a) the negative image (contact imprinting always gives the reverse of a photograph in terms of light v dark)” That’s true. But it’s not enough. Looking again and again at the TS image of the face (positive and negative), the mystery remains. How is it possible for a medieval forger to produce BY CHANCE an imprint that after tone reversal gives a perfect (absolutely perfect) human face ? It is NOT a question of aesthetic. It is a question of subtlety of the imprint. ” (g) image superficiality? Has anyone ever properly established the degree of image superficiality of the TS, with positive evidence, precise numerical measurements? If so, please advise, preferably with a link.” The superficiality of the image has been shown. You know that. Rogers and other members of STURP found that even in the darkest areas of the TS image (the nose) the color is confined in the 2 3 first layers of the fibers of the thread. This is a positive evidence.I do not understand, in this context, what you mean with “precise numerical measurements” ? Numerical evidence of what? More later..","date":"2016-01-29","mins":"8:59 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/25/modelling-the-shroud-of-turin-with-white-flour-olive-oil-and-a-real-face-in-pictures/","cat":"turin_shroud","title":"Modelling the Shroud of Turin with white flour, olive oil and a real face – in pictures."},{"id":"comment-6880","author":"thibault_heimburger","post":"I have to say that I fully agree with this program. Good luck Colin… Yes, Piero I’m too busy… More later, sorry..","date":"2016-01-28","mins":"9:10 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/25/modelling-the-shroud-of-turin-with-white-flour-olive-oil-and-a-real-face-in-pictures/","cat":"turin_shroud","title":"Modelling the Shroud of Turin with white flour, olive oil and a real face – in pictures."},{"id":"comment-6853","author":"thibault_heimburger","post":"I look at your experiments with great interest. But I do not understand the aim of this first experiment. You wrote: ” Am now fairly confident that a contact image of the face would have been obtained using LOTTO (face up), not LUWU (face down) presentation to wet linen. ” I agree. However, your experiment does not follow the LOTTO model. I am wrong ? I’m sure that, using the LOTTO model (face up) on your own face (with the help of somebody else), the discussion could be much more interesting..","date":"2016-01-25","mins":"9:11 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/25/modelling-the-shroud-of-turin-with-white-flour-olive-oil-and-a-real-face-in-pictures/","cat":"turin_shroud","title":"Modelling the Shroud of Turin with white flour, olive oil and a real face – in pictures."},{"id":"comment-6854","author":"thibault_heimburger","post":"I have just seen your comment above. And I read: “The next goal is to to get even imprinting all over, not just the lower half, but top and bottom, the entire face.” Yes but with the LOTTO model “à la Garlaschelli”. No ?.","date":"2016-01-25","mins":"9:23 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/25/modelling-the-shroud-of-turin-with-white-flour-olive-oil-and-a-real-face-in-pictures/","cat":"turin_shroud","title":"Modelling the Shroud of Turin with white flour, olive oil and a real face – in pictures."},{"id":"comment-42083","author":"thibault_heimburger","post":"Thank you Hugh The TS image can not be a scorch not only because of the faintness of the image or the lack of fluorescence but also because even a faint scorch does not match the color distribution at macro and microscopic level. Your observation underlines the danger to use pictures like the “Shroud scope” which are useful only to emphasize some details. What kind of “transfer” are you thinking about ?.","date":"2013-08-26","mins":"3:31 pm","url":"https://shroudstory.com/2013/08/26/nicely-done-you-must-download-this/","cat":"image_theory","title":"Nicely Done: You must download this"},{"id":"comment-139644","author":"thibault_heimburger","post":"Look at: and then: Any comment?.","date":"2014-07-21","mins":"8:50 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?"},{"id":"comment-139838","author":"thibault_heimburger","post":"Sorry for the typo. Yes “gasp” must be read “gaps”. You, CB wrote: ““This zone has an almost perfect triangular shape”. What is a “perfect triangle” in the context of the TS image? Perfect in what sense? The term “perfect” is meaningless if all one is doing is looking for banding effects that can only emphasize two out of three sides of one’s “perfect” triangle, i.e. The vertical and horizontal, but NOT the hypotenuse. ” You can not seriously extract a short sentence out of its context. The hypotenuse side obviously consists of a strong image. Do you really think I/we are so stupid ? “This entire comment is pseudo geometry: it tries to explain away the region of interest as an artifact of banding. It is nothing of the sort.” Not at all. The question is: is there a faint image in that area? I only wished to show that one can not answer without taking into account the banding effect because there is an obvious correlation between the borders of this “non imaged area” and a very bright large vertical band. CB: ” Oh, and did Ray Rogers RIP really say that “when one light band intersects another one in the image the image density is lower”? I hope not, since in terms of what makes an image darker or lighter (presence or absence of pigment or coloured pixels) that statement would be profoundly unscientific.” See: http://www.shroud.com/pdfs/rogers5faqs.pdf “In ultraviolet fluorescence photographs (see Hands UV). Both warp and weft yarns show this property. Some areas show darker warp yarns and some show darker weft yarns. In some places bands of darker color cross. In other places bands of lighter color cross. The effect is somewhat like a plaid”. And: “Anna Maria Donadoni, a curator at the Museum of Egyptology in Turin, pointed out locations where batches of yarn ended in the weave and new yarn had been inserted in order to continue weaving. The yarn ends were laid side by side, and the weave was compressed with the comb. The ends are often visible, and the overlaps correspond to zones of different color in the weave. The different batches of yarn show different colors. Where darker bands of yarn intersect image areas, the image is darker. Where lighter bands intersect an image area, the image appears lighter. This proves that the image color is not a result of reactions in the cellulose of the linen. Some impurities on the surface of the different batches of yarn produced the image color. This observation is extremely important when tests are being made on image formation hypotheses. If image color is not simply a result of color formation in the cellulose of the linen fibers, image formation must be a much more complex process than we originally thought.” Hugh: thank you for your comments. There are different kinds of bands on the TS. More later..","date":"2014-07-22","mins":"4:32 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?"},{"id":"comment-140345","author":"thibault_heimburger","post":"Http://colinb sciencebuzz.blogspot.fr/2014/07/the turin shroud looks for all world.html Congratulations Colin (sincerely). Could you please give us a large photograph (as large as possible) of: I mean the scorch imprints and the 3 D renderings. Thank you in advance.","date":"2014-07-25","mins":"4:19 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?"},{"id":"comment-13114","author":"thibault_heimburger","post":"Some years ago, Rogers wrote a very long SSG message to explain step by step his hypothesis and the many parameters. I will try to summarize this message later. However, I think that experiments would be impossible for the time being for practical reasons. But as I wrote, there are professional software able to model the behavior of the gaseous diffusion between 2 surfaces taking into account many parameters (geometry of the surfaces, molecular weight, temperature, convection etc..). This may be the first step. Whatever the complexity of the structure of the TS and of the chemistry of the Maillard reaction in/on the target (the TS), the main first key parameter is the number of gaseous molecules reaching the target at a given location within a certain time. This could help to find some basic necessary conditions consistent with the so called collimation and the high resolution in the case of the gaseous diffusion hypothesis. After that we could work more in detail and perhaps perform some experiments..","date":"2012-06-27","mins":"3:57 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-49478","author":"thibault_heimburger","post":"Colin, Glad to read you again on this blog. You wrote: ” It’s from Thibault Heimburger MD, and displays photomicrographs from the Mark Evans collection. Previously I had assumed that they were not of sufficiently high magnification to show the nodes on linen fibre, which is true. But if those nodes become pigmented for whatever reason, the sites of those nodes show up as banding, with relatively white/transparent areas in between. One such Mark Evans picture shows up precisely that kind of banding on a Shroud image thread.” Looking forward to your “enlarged/cropped pictures” from Evans collection. I just wish to recall that a fiber is not a thread and a thread is not a fabric. My comments will follow tomorrow..","date":"2013-11-01","mins":"5:14 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-130895","author":"thibault_heimburger","post":"Anoxie wrote: “Thibault Heimburger : “If there is a stochastic process, it is at thread level and not only at fiber level.” Stochastic process at a thread level, seriously ?!?” I agree that this particular sentence is misleading. But reading my entire comment, you should have understood what I meant. I do not think that the image formation process is a stochastic process. The true question is: how can we explain the surface distribution of the color ? You wrote:” But “stochastic FM screening” is misleading, it is not a stochastic process but a PSEUDO RANDOM distribution of dots.” and “….”varying threshold” and “fibers properties” Could you please explain in detail ? In addition, I completely disagree with Colin. I repeat: the distribution of the image color is not consistent with any kind of scorch, even if one takes into account ageing etc.. This has been shown in : https://shroudofturin.files.wordpress.com/2014/04/scorch 2 eng final.pdf More later..","date":"2014-06-18","mins":"4:06 pm","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","title":"Photomicrographs and Stochastic Imaging"},{"id":"comment-170910","author":"thibault_heimburger","post":"Hi Colin, That the Shroud image could have been seen as a sweat imprint in the past by some people is not surprising. But what does it tell us about the image forming process? Incidentally, your claim about the relationships between the Lirey badge (and the Lirey Shroud face) and the Veronica Veil are very dubious. The face on the Lirey badge is simply a representation of the face of the Lirey shroud. From the resemblance between the Lirey badge and some pictures of the Veronica Veil you can’t conclude that the Lirey Shroud has been inspired by the Veronica Veil. As I wrote you many months ago, I add that the word “Suaire” in French (modern French language as well as medieval French) does not necessarily mean “”facecloth” with connotations of sweat” as you wrote. This word is and was used in a much larger sense, including burial cloth. As a general rule,French language is in general very precise. But it is an exception. What about the relationship between your “light scorch hypothesis” and the “sweat imprint” ?.","date":"2014-11-12","mins":"5:38 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","title":"Real 1st century or simulated 14th century sweat imprint?"},{"id":"comment-202955","author":"thibault_heimburger","post":"Dan, can you give us the link to the post from which you have extracted the comments you quoted? The question of the resolution might be very important. Thanks to OK and Dave for their very interesting comments..","date":"2015-06-20","mins":"1:55 pm","url":"https://shroudstory.com/2015/06/20/resolution-of-the-shroud-image/","cat":"image_theory","title":"Resolution  of the Shroud Image"},{"id":"comment-6645","author":"thibault_heimburger","post":"Colin, First, I would like to wish you a happy new year 2016. After some researches, I have found what follows: All of the “détecteurs de faux billets” I have found, like yours, transmit a UV light between 350 and 375 nm (UVA). In STURP experiment the UV source “enabled wavelengths of 335 to 375 nm…” and ” the film was to record only radiation emitted in the visible region of the spectrum, and none of the reflected , exciting UV”. So, Your experiments are significant. Questions: 1) How do you explain the differences between your scorch experiments and Hugh’s scorch experiments (showing fluorescence) ? Hugh ? 2) How do you explain the reddish fluorescence of the margins of the burns on the Shroud ?.","date":"2016-01-02","mins":"8:36 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/02/response-of-my-thermally-imprinted-models-of-the-man-on-the-turin-shroud-to-an-allegedly-crucial-test-with-ultraviolet-light/","cat":"turin_shroud","title":"Response of my thermally-imprinted models of the Man on the Turin Shroud to an allegedly crucial test with ultraviolet light."},{"id":"comment-22018","author":"thibault_heimburger","post":"Dear Hugh, You might find photos showing that the colored fibers are not colored under their surface in Fanti’s photos in the “superficiality paper”. Fig. VI 2 shows an “unusually deeply colored image fiber”. In fact, in some cases the medulla (the lumen) is empty, in some cases there is some amorphous material in it. In any case, as Rogers wrote: ” the medulla [of a scorched fiber ] appears to be darker than the mass of the fiber as a result of the reactions at its surface and its shorter radius of curvature”. The fact that this strongly colored image fiber has a “completely colorless lumen” while all the scorched fibers (even a “lightly scorched fiber, Fig.VI 1) have a colored lumen is strong evidence against a scorch. Regarding your observations through the microscope, please be careful. There are so many traps! Myself (I am not at all an expert in microscopy), I saw several “black lines” in the middle of my lightly scorched fibers but never wrote that they were colored medullas because they should have been at the surface of the fiber or the result of a misinterpretation However, remember that Rogers was fully aware of the traps of microscopy and you can be sure that he was right. Thibault..","date":"2013-01-14","mins":"4:50 pm","url":"https://shroudstory.com/2013/01/14/scorched-image-by-the-resurrection/","cat":"image_theory","title":"Scorched Image by the Resurrection"},{"id":"comment-118733","author":"thibault_heimburger","post":"Http://www.shroud.com/pdfs/thibault%20final%2001.pdf.","date":"2014-05-13","mins":"3:52 pm","url":"https://shroudstory.com/2014/05/13/schwortz-it-is-worth-reviewing-david-fords-noteworthy-blood-or-paint-paper/","cat":"image_theory","title":"Schwortz: It is Worth Reviewing David Ford’s Noteworthy Blood or Paint Paper"},{"id":"comment-28106","author":"thibault_heimburger","post":"CB’s comments need a detailed complete answer. I am writing it but .. Be patient..","date":"2013-03-22","mins":"5:52 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","title":"Scorching Theory: Pseudoscience or Miracle?"},{"id":"comment-49800","author":"thibault_heimburger","post":"It seems to me that nothing is clear about the 3 D characteristics of the TS. The images provided by Hugh show that. Look at them carefully. You will see that J Image does not work like the VP8, except for the first image (top left) and its “3 D” counterpart. I’ll try to explain that later but have a look here (in French, sorry): http://www.suaire science.com/documents/3 D mignot.pdf It is a document made by an expert showing why the TS image do have true 3 D properties while 2 different pseudo shroud images are very different This can help..","date":"2013-11-03","mins":"4:49 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-28090","author":"thibault_heimburger","post":"Yannick, did you read Zugibe’s book: ” The crucifixion of Jesus. A Forensic Inquiry” Second Edition? Please, remember that Zugibe is probably the most important expert in forensic science involved in TS studies: Chief Medical examiner of Rockland County, New York, from 1969 2003, adjunct Professor at Columbia University College of Physicians and Surgeons and President of the Association of Scientists and Scholars International for the Shroud of Turin. You can not rule out his opinion so easily. There are too many things to discuss regarding your post above. But before that, please answer to my question. Thibault..","date":"2013-03-22","mins":"4:59 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","title":"Scorching Theory: Pseudoscience or Miracle?"},{"id":"comment-49936","author":"thibault_heimburger","post":"Colinsberry : Do we need to discuss VP8? Are there grounds for thinking that it is any more valid as a 3 D enhancement tool than the free downloadable Image J? What is the meaning of valid anyway, given that the best 3 D enhancements are still 2 D, viewed on a page or screen, no matter which criteria are applied. The best 3 D is simply 2 D that deceives the eye, so there must inevitably be subjective factors at play in discussing the merits of one method against another, even if deploying additional tools like layered colour to compare “3 D ness” as in the paper you cite (which incidentally I found almost unintelligible in parts, despite being able to call on my wife’s language skills – and she too said she could extract little meaning from the final conclusions). If we are to restrict ourselves to objective scientific as distinct from subjective aesthetic ones, then what we need is an agreed standard for assessing the 3 D ness of a 2 D image. That could take the form, as I suggested earlier (and have previously experimented with) of starting with an agreed 3 D object, converting to 2 D images by different means, and then seeing which software programs do the best job of re creating the “look” of the original. What we cannot do is take the Shroud image as our standard, since we don’t know how well it resembled the subject whose image was imprinted, I fully agree. What do you have in mind ?.","date":"2013-11-04","mins":"5:01 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-50083","author":"thibault_heimburger","post":"Sorry, this is not why I had in mind. Your answer is based on the (supposed) mechanisms (Method A vs Method B). This is not the question. In any scientific work, as you know, the first step is to define the question. Here, the question is: ” does the 3 D VP8 Shroud image have 3 D SPECIFIC properties (I called them “true 3 D”), that are not found in any kind of man made 2 D artifacts by any mean (including scorch)”? My answer is yes. I’ll try to show that as soon as possible..","date":"2013-11-05","mins":"4:27 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-50235","author":"thibault_heimburger","post":"Colinsberry : Thibault HEIMBURGER : Sorry, this is not why I had in mind. Your answer is based on the (supposed) mechanisms (Method A vs Method B). This is not the question. In any scientific work, as you know, the first step is to define the question. Here, the question is: ” does the 3 D VP8 Shroud image have 3 D SPECIFIC properties (I called them “true 3 D”), that are not found in any kind of man made 2 D artifacts by any mean (including scorch)”? My answer is yes. I’ll try to show that as soon as possible. The mere fact that you make a comparison between the Shroud image and what you revealingly describe as “man made 2 D artefacts” shows beyond any shadow of doubt that you are not one to lecture me on what you call “scientific work” Thibault. Kindly stop lording it over us Twith your ex cathedra unchallengeable pdfs.. Your so called science is fatally compromised by your (presumably) religious preconceptions. You are attempting to dress up your investigations as science. They are nothing of the sort. If you knew the first thing about science, with its detached, objective agenda free scientific method you would realize that. But you don’t. I’m sure you are a very good physician, Thibault. But even I recognize that there’s a lot more to being a good physician than cold detached science, which is why you make a good physician, and I would not. My careers master at school urged me to take up medicine. I declined. I prefer the detachment of science – which can lead to entirely different conclusions.You rid people of their afflictions. I rid people of their misconceptions (or try to). The question is “should we be reassessing the VP8 result ?” In my mind, this means (following Hugh photos): ” does the 3 D VP8 Shroud image have 3 D SPECIFIC properties (I called them “true 3 D”), that are not found in any kind of man made 2 D artifacts by any mean (including scorch)”? No more, no less. As I wrote it is is the first step in any scientific work. Does anybody disagree ? CB seems to disagree (??) and his answer is full of insults.. Is it truly a scientific approach? And then some words about my “ex cathedra unchallenged pdfs” and my “religious preconceptions” Incredible ! What does CB know about my “religious preconceptions”. What are the relationships between my pdfs and my religious preconceptions” ?? The main FACTS: In my pdfs, I have shown ( through true experiments and microscopy) that: – There is no mean to obtain a SUPERFICIAL discoloration of a linen fabric similar to that of the TS image color – scorch imprint is NOT consistent withe the half tone effect – scorch imprint is NOT consistent with the surface distribution of the TS image – etc…(just read my PD Fs) CB’s only criticism is that I did not use a valid template. CB simply does not understand that my main purpose was to study all kinds of scorch imprints at small scale, i.e through the microscope. The template I used was perfect to study the different kinds of scorches. CB is simply incapable of showing any kind of scorch imprint showing the properties of the TS image. But of course, CB is the only one able to understand what true science is..","date":"2013-11-06","mins":"6:19 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-157763","author":"thibault_heimburger","post":"Charles, You wrote: “I have the full Cennini text. The whole point is to cover the whole cloth with gesso and then you can apply the image wherever you need to. The gesso also acts as a preservative. If the calcium carbonate is uniform and you are the one who has provided a quotation in support of this, this is a point in favour of an original priming and thus keeps open the possibility of an original painting that may have decayed with time.” OK. I answered to quickly. The whole cloth might have been entirely covered with gesso. Therefore the more or less uniform distribution of Calcium. But knowing what gesso is/was (“fluid white coating, composed of plaster of Paris, chalk, gypsum, or other whiting mixed with glue, applied to smooth surfaces such as wood panels, plaster, stone, or canvas”, from the Encyclopedia Britannica), how do you explain: – the observed fact that the fibers (image fibers as well as background fibers) are not glued together. Do you really think that it is possible with any kind of gesso ground ? – the observed fact that there is no protein binder on the image fibers.It seems that gesso always contains glue which necessarily contains proteins. If I understand well, the more or less uniform calcium distribution on the cloth (which can be explained by the retting process) and the superficial image “explained” by the method described by Cennini are enough to keep open the “possibility of an original painting”. Yes, but only if you forget all of the other observed facts that definitely rule out a painting (with or without gesso)..","date":"2014-09-29","mins":"4:01 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-139675","author":"thibault_heimburger","post":"My first comment: The first picture (http://imgur.com/H5 Gs K5 I) comes from a HD photograph of the region in question. I have transformed the original color photo (the best one available) into a grey scale photo because the famous ‘banding effect’ is much more easy to see. Note that in this first photo I did not enhance the contrast. The second photograph (http://imgur.com/I Dr Ei7 E) focus on the area of interest (the so called ‘non imaged zone’) along the ulnar side (not radial, sorry Anoxie) of the upper hand. This time it’s contrast enhanced. Here is a link to the first photograph with some markers in order to help you to see and understand what follows: 1) This zone has definitely an almost perfect triangular shape. Why? Because it is at the intersection of two light bands: A and B (the vertical band B being much more easy to see than the horizontal band A). When a light band intersects another one in the image the image density is lower. This has been shown by Rogers and the pictures shown here demonstrate that very clearly. The fact that the area in question has an abnormal triangular shape strongly suggests that the banding effect occurs. 2) Is there an faint image in this area? The main difficulty is to know how would a non imaged zone appear in this area?. In other words what is the standard density of a ‘non image’ (‘background only density’) in this particular area? I have no definitive answer. However, since the triangular zone pertains to band B, It seems reasonable to take it as a non image density standard for this band. In this case, the triangular area being slightly darker than the standard ‘non image’ reference might be an evidence (not a proof) that the so called ‘non imaged zone’ bears in fact a very faint image, almost invisible because of the banding effect. 3) The statement 2 above is heightened by the fact that the adjacent areas C and D are clearly imaged. 4) The so called gasps between the fingers. If gasp means ‘no image at all’ this is false. There is clearly a faint image and no ‘gasp’ between the fingers. The main question is: ‘contact only’ (whatever the method) or ‘contact+action at distance’ in order to explain the TS image. This post does not answer but at least it shows that thinks are not as simple as some people think. More later..","date":"2014-07-21","mins":"2:41 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?"},{"id":"comment-158132","author":"thibault_heimburger","post":"Charles, The more I read your “gesso hypothesis”, the less I understand. You did not answer clearly to my last post. Or do you seriously think that with the handling of the Shroud ” The gesso surface would have fragmented with time leaving only the evidence of calcium carbonate on the outer fibrils” without leaving any kind of protein binder (no protein at the nano to picogram level on image fibers), without any kind of cracks in the image, without any kind of cementation between the fibers etc… “One view a professor of physiology suggested to me was that what STURP thought was the remnants of blood was in fact collagen from the glue( probably boiled up rabbit skins ) that mixed with the calcium to form the gesso. His was after reading some if the STURP papers.” Eureka. No doubt that collagen mixed with calcium can explain the red color, the presence of porphyrin, the many positive tests for blood (hemochromagen ..), the albumin, the immunio chemical tests etc. More seriously, I agree that new tests are needed. But we already have strong data that can rule out a painting, at least in its common sense, with or without gesso..","date":"2014-09-30","mins":"4:17 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-157039","author":"thibault_heimburger","post":"I wrote: “Hugh [wrote], “and the scientists involved in the Shroud showed little evidence of knowing much about painting.” No. Before 1978 STURP did know that the Shroud could be a paint. They studied in depth the history of painting, the pigments that could have been used for the Shroud and much more. In fact, the main goal of STURP in 1978 was to look at the Shroud to find evidence of painting. They found none of them.” Charles answered:” That is not correct, Thibault. In their physics and chemistry article STURP specifically stated that they had not examined any paintings on linen. There is nothing in their article about how linens were prepared for painting and how the painting was actually done despite medieval treatises on the subject.” It is wrong, Charles. They probably did not examine paintings on linen but, before 1978, they made many researches on the history of painting, looking at the medieval treatises on the subject and at all of the possible materials used in the Middle ages and they even performed many experiments. Rogers wrote: ” Before going to Turin in 1978, we did many experiments on the stability of the painting materials [here, Rogers is speaking about the effect of the 1532 fire that “provided an excellent chemical test on all of the materials of the Shroud”]. ALL of the pigments and vehicles that we could identify in HISTORICAL DOCUMENTS were tested by applying them to linen and subjecting the samples to different kinds of heating” Just look at Rogers, “A Chemist perspective …”, p.10 and 11. Do you have this book? I am disappointed by this kind of comments which seem to imply that the STURP team was a team of amateurs !!! The Shroud image is not a painting (in the common sense). I do not understand what Hugh wrote in his comment quoted at the beginning of this post. Hugh, what do you exactly have in mind?.","date":"2014-09-26","mins":"3:51 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-155246","author":"thibault_heimburger","post":"Hugh, “and the scientists involved in the Shroud showed little evidence of knowing much about painting.” No. Before 1978 STURP did know that the Shroud could be a paint. They studied in depth the history of painting, the pigments that could have been used for the Shroud and much more. In fact, the main goal of STURP in 1978 was to look at the Shroud to find evidence of painting. They found none of them. “Mc Crone got his friend Walter Standford to paint a Shroud face using “10 parts per million of red ochre in a 1% gelatin [collagen] solution” (Judgment Day for the Turin Shroud, p.142). It is not perfectly clear to me exactly what this means, or whether it was necessary to paint several layers of this ‘paint’ on the cloth for an image to be visible..” “10 parts per million of red ochre in a 1% gelatin [collagen] solution” In 2011, a friend of mine, did use red ochre in gelatin using the proportions given by Mc Crone. The result: nothing: no color. Only a large waterstain on both sides of the fabric. I wonder how Standford (the Mc Crone’s painter) had been able to obtain his Shroud like image ??.","date":"2014-09-24","mins":"4:54 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-157258","author":"thibault_heimburger","post":"Charles, I have all of the STURP papers including “Physics and Chemistry…” Incidentally Hugh’s quotation confirms that STURP did look at many books about medieval paintings before 1978. This was my point. You wrote: ” If they had read Cennino Cennino’s fifteenth century treatise on painting on linen they would have discovered that he recommended applying a layer of gesso to the outer fibrils of the cloth with a knife so that the excess could be wiped off.” Do you have this book? I have found this link: http://books.google.fr/books?id=MU68 AQAAQBAJ&pg=PA32&lpg=PA32&dq=medieval+gesso&source=bl&ots=8 S Rg VGNPT9&sig=4w LLZ3 XMM Gpa Zu K Cm Ipi673 Mor0&hl=en&sa=X&ei=2 Ocm VKLYJ Mnjaoy Agqg C&ved=0 CFIQ6 A Ew Cg#v=onepage&q=medieval%20gesso&f=false See p.32 to 40, in which Cennino’s book is cited. Everybody is asked to look at it and decide if there is any kind of relationship with the TS as a 14th century French painting on linen. You wrote: “I have been saying all along ere are enough unresolved issues , especially with the calcium carbonate that is the main element in most gessos that the question should be left open”. No. If some kind of “Calcium carbonate” gesso had been involved in the TS image painting, we should expect more calcium in the image area. This is not the case. From “X Ray Fluorescence Investigation of the Shroud ot Turin” by Morris, Schwalbe and London (X Ray Spectrometry, Vol.9, N°2, 1980), we read: “The Calcium and Strontium appear as uniform background distributions”. The following link is also interesting: http://www.shroud.com/piczek.htm.","date":"2014-09-27","mins":"2:26 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-44441","author":"thibault_heimburger","post":"Interesting, Do you have some photos Matthias ?.","date":"2013-09-16","mins":"2:53 pm","url":"https://shroudstory.com/2013/09/16/speaking-of-more-scientific-testing-of-the-shroud/","cat":"image_theory","title":"Speaking of more scientific testing of the shroud"},{"id":"comment-171951","author":"thibault_heimburger","post":"Colin Berry:” I have set out a possible scenario that led to the TS being fabricated as a rival attraction to the Veil of Veronica, indeed one that built on the established credentials of the Veronica. . . As perceived by those at the time, and which later. . . Came to supplant the Veronica as the Church’s new “central icon” (to borrow Neil Mc Gregor’s words re the 14th century Veronica).” Therefore the shroud must look like a sweat imprint but that of Jesus after his death. 1) There is nothing in the very complex history of the Veronica Veil legend referring to a “sweat imprint” of Jesus face on the road of the Calvary. To the contrary, the Veronica Veil was understood as a miraculous image not as a sweat imprint, as you wrote. 2) I do not see any link between the “Machy mold face” and the Veil. For example,the Machy face clearly shows that the man of the Lirey Shroud was seen as having closed eyes (compare with the opened eyes of the priests). The “Machy mold face” is simply a representation of the Lirey Shroud face. There is no evidence that the TS forger wanted to complete with the Veronica Veil. I have seen: http://shroudofturinwithoutallthehype.wordpress.com/2014/11/17/the shroud of turin probably not miraculous just a simulated sweat imprint a triumph of medieval joined up thinking/ Colin Berry:” I have set out a possible scenario that led to the TS being fabricated as a rival attraction to the Veil of Veronica, indeed one that built on the established credentials of the Veronica. . . As perceived by those at the time, and which later. . . Came to supplant the Veronica as the Church’s new “central icon” (to borrow Neil Mc Gregor’s words re the 14th century Veronica).” Frankly Colin, I do not understand your new “paradigm” (which in fact is not a paradigm). Shortly (according to you,if I understand well): “What were the criteria that could be adopted first to produce a whole body imprint of the crucified Jesus that would pass muster, yet importantly pose no threat to the status of the Veil?” Do you really think that a medieval forger was concerned with your 16 criteria?.","date":"2014-11-18","mins":"5:23 pm","url":"https://shroudstory.com/2014/11/18/the-conspiracy-of-the-faux-sweat-imprint/","cat":"image_theory","title":"The Conspiracy of the Faux-Sweat Imprint"},{"id":"comment-149095","author":"thibault_heimburger","post":"No, I don’t take a stand for some kind of radiation mechanism. I never did it. The more I study the Shroud, the more I think that the image comes from some kind of low temperature chemical reactions in the PCW or surface impurities on the fibers. Sorry, but I can’t give more comments for the moment. Now, I have to write my paper for the Saint Louis conference. For example, my third and last PDF about the “scorch hypothesis” needs more experiments. Rendez vous in October or November..","date":"2014-09-06","mins":"1:22 pm","url":"https://shroudstory.com/2014/09/06/the-man-who-liked-to-dip-pickle-spears-in-his-beers/","cat":"image_theory","title":"The Man Who Liked to Dip Pickle Spears in His Beers"},{"id":"comment-183563","author":"thibault_heimburger","post":"“The artist was trying to his best to show that this is how he imagined a body would leave its imprint on a cloth and this would inevitably give some impression of being a negative. He may or may not have succeeded but this is what he would have been required to do if producing a grave cloth.” This is the main problem with your hypothesis. As a medieval forger/painter, I have absolutely no knowledge of negative vs positive in the modern sense. I “only” have, probably for the first time in history, to imagine the imprint left by a body on a grave cloth. Not vague stains but the precise imprint of the nose, the eyes, the fingers etc… I am a medieval forger. But I understand that I can’t paint the image like a normal painting, an albedo. I am thinking about this problem. I have the solution. To paint the most prominent parts of the body (nose..) more heavily than the other parts. In other words, to correlate the image intensity with the body/shroud distance or with the body/shroud contact pressure. Eureka !! This hypothesis has been tested many years ago by Jackson, Jumper and Ercoline ( “Three dimensional characteristics of the Shroud image”, IEEE Proceedings, October 1982 and “Correlation of image intensity on the Turin Shroud with 3 D structure of a human body shape”, Applied Optics, Vol.23, N° 14, 15 July 1984). ” Four our experiment, we secured the assistance of two certified criminal artists …compose realistic, monotone imagery, qualities found in the shroud image. In one set of experiments, we asked the artists to “freehand” shade an image of a given reference face ..in proportion to relief. In a second set, we provided the artists with relief data at 15 specific ‘anchor’ points on the face.. The artists then constructed an encoder by which they could convert distance information into shading. This encoder was a continuum of shades which correspond to various relief distances”. The result? None of the pictures do show the 3 D characteristics of the shroud body image. To summarize: 1) There is no example of a “negative” image in the history of painting 2) Even modern artists failed to produce the characteristics of the TS body image (particularly the 3 D characteristics) How could your medieval painter produce a negative image with the 3 D characteristics of the TS body image? Your medieval painter was not only a genius but a magician..","date":"2015-01-15","mins":"3:47 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-183793","author":"thibault_heimburger","post":"Dear Hugh, I am very surprised. You’ll find the original paper here: https://app.box.com/s/m0uhcjdn9m40ao95pky8p7iomtfcnx8c The reference face is obviously the same as in your BBC report. Unfortunately, there is no picture of the positive or negative paintings in the above paper. However, none of the VP8 pictures (Fig.12 to Fig.17 in the paper) is similar to your BBC VP8 image. There must be an explanation. Can you give us more details and pictures from this BBC report? Thanks..","date":"2015-01-16","mins":"4:25 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-183794","author":"thibault_heimburger","post":"PS: in order to download the paper, you have to click on the arrow (top right): “telecharger”=download..","date":"2015-01-16","mins":"4:31 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-183798","author":"thibault_heimburger","post":"Https://app.box.com/s/z50fhlbmlqss4cyq9xqa The J Image 3 D rendering of Hugh’s picture..","date":"2015-01-16","mins":"4:46 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-184111","author":"thibault_heimburger","post":"Dear Hugh, I understand your point of view: to look carefully at previous experiments. But what about this BBC report? “Brian Sagar: “Our problem was to find something that would reproduce this, leaving no traces, because we find no evidence of materials like protein or pigments of any kind, or metal ions, with the possible exception of some calcium, which was there in quite large quantities. We tried several materials that we know from past experience degrade cellulose in this way, and in the end we settled for alum, a material widely used by artists in medieval times.” They tried to find some painting medium that degrades cellulose without living any trace. (The sentence about calcium is meaningless since calcium is present everywhere on the shroud). Alum ? http://en.wikipedia.org/wiki/Alum What kind of Alum ? Alum (or more exactly Alums) is a complex class of chemical compounds. None of the numerous trivalent metals found in Alums has been found in the body image. It seems that Alums are soluble in water. This is not the case for the body image. ““Having settled on alum to degrade the cloth, Susan [Hilton, the artist] had to find a pigment, so she could see what she was painting. She chose brazil wood, often used with alum, and so popular in the middle ages that they even named a country after it. … For a canvas she used modern linen cloth that was specially woven to be like the real Shroud. That was sized with gum arabic, which contains calcium. … Finally a mixture of more gum arabic and alum was the medium to take the brazil wood pigment. The rest was up to Susan’s artistic skill.” Brazil Wood ? “Starting in the 16th centuries, brazilwood became highly valued in Europe and quite difficult to get. A related wood Sappanwood coming from Asia was traded in powder form and used as a red dye in the manufacture of luxury textiles, such as velvet, in high demand during the Renaissance. When Portuguese navigators discovered present day Brazil, on April 22, 1500, they immediately saw that brazilwood was extremely abundant along the coast and in its hinterland, along the rivers” Gum Arabic? http://en.wikipedia.org/wiki/Gum arabic “Gum arabic is used as a binder for watercolor painting because it dissolves easily in water. Pigment of any color is suspended within the acacia gum in varying amounts, resulting in watercolor paint.” It dissolves easily in water… “And the finished product goes off for a bit of aging. [Cloth placed in an oven at 190°C for an unspecified time] We know that in the 15th century the Shroud was washed, in order, they believed, to test its authenticity. They probably used soda ash to get rid of those stubborn stains, like alum and brazil wood. [Cloth boiled in a large beaker]”. Somewhere, there is an historical reference to this event (Colin?) But the Shroud show absolutely no evidence of this event. To the contrary, there are no clue of this (alleged) event and there are many proofs of the contrary. Do you really think that the Shroud was boiled, without living any trace of this violent event? ” Well, there’s the result. Looks good at a distance, and the closer you get, the less you see. [Close up] Tests showed that chemically everything was washed away except calcium and iron, and under the microscope the effect is strictly on the surface. It’s all very like the real Shroud. But the 3 D test still has to be passed. Viewed from this side [The side with the epsilon blood mark], the real Shroud looks a bit better than Susan’s painting, but turn the other cheek [Image rotated slowly through about 100°] and there’s very little difference. All in all it looks as though our fake is extraordinarily like the real thing.” Do you have the pictures ?.","date":"2015-01-17","mins":"5:19 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-184317","author":"thibault_heimburger","post":"Thanks Carlos and Colin, ” Lalaing adds that the Shroud’s authenticity has been confirmed by its having been tried by fire, boiled in oil, laundered many times ‘but it was not possible to efface or remove the imprint and image.’ Looking at the old original text this translation of the final part is true. In the text, we find the terms: “syndont”, suaire and linchoel (linceul) which are 3 words referring to the same object: the shroud. I have been unable to find the word “imprimure” in the dictionaries of medieval French. I found “emprimure” which means model or shape. “On y voidt l´imprimure de tout son trés sainct corpz, teste, viaire, bouce, yeulx, nez, corps, mains, pieds et ses chinq playes: …” My translation: We see the shape of his whole holy body, head, face, mouth, eyes, nose, body, hands, feet and the five wounds… “On le voidt clérement ensanglenté du trés précieux sang de Jhesus, nostre Rédempteur, comme se la chose avoit esté faicte aujourd´hui. ” My translation: We see it [the shroud] clearly stained with the very precious blood of Jesus, our redeemer, as if this was done today. The term “figure” is found here: “on voidt le vestige et figure de son dos, teste, chevelure, coronne et espaules.” Which means, describing the back side: We see the vestige and the “figure” of his back, head, hair, crown and shoulders. In other words, I don’t think we can do any kind of difference between “figure” and “imprimure”. Both terms mean the body image which is described as some kind of imprint. The five wounds (blood) are included into the “imprimure”. It seems that the medieval witnesses could not understand the difference between the (positive) blood marks and the (negative) body image. For them, both “imprints” were the result of the same process (some kind of imprint). We now know that it is not true. According to Lalaing: ” the Shroud’s authenticity has been confirmed by its having been tried by fire, boiled in oil, laundered many times ‘but it was not possible to efface or remove the imprint and image” Hugh, you wrote: “Antoine de Lalaing records that Shroud has often been thoroughly washed. The BBC’s research was better than you might think…” Lalaing wrote exactly: ” Et pour esprouver se c´est la mesme, on l´a boulit en huile, bouté en feu et buet par pluseurs fois; mais on n´a peut affachier ne oster la dicte imprimure et figure.” which means: “that the Shroud’s authenticity has been confirmed by its having been tried by fire, boiled in oil, laundered many times ‘but it was not possible to efface or remove the imprint and image.’ Not only washed. Do you really think that the Turin Shroud has been ‘tried by fire” and “boiled in oil” without leaving any trace of these dramatic events? I can see only 2 explanations: 1) Lalaing lied. 2) These “experiments” were performed only on a tiny part of the shroud image which are perhaps not visible today because of the 1532 fire (??)..","date":"2015-01-18","mins":"3:28 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-14838","author":"thibault_heimburger","post":"TO ALL : you can now read my “paper” : ” Roger’s Maillard reaction hypothesis explained in detail by Rogers himself” (top right of this page). Thank you Dan. For those interested, I will answer to Colin directly on his blog..","date":"2012-08-12","mins":"4:30 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature."},{"id":"comment-15132","author":"thibault_heimburger","post":"Dear all, Some weeks ago, you could read an old paper from me in which I concluded that the Maillard reaction was very likely not possible in the first days after the death of the TSM simply because the necessary heavy amines postulated by Rogers (Putrescine and Cadaverine) were missing. More recent papers fully confirm that. BUT for reasons I’ll explain later, i know think that it is not impossible that other heavy amines (not known by Rogers) may work. I’ll also will try to answer to some of your comments. More later..","date":"2012-08-17","mins":"3:15 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature."},{"id":"comment-18054","author":"thibault_heimburger","post":"Yannick, It is not true that “this demonstration has already been done long before by the STURP team (by John Jackson particularly)”. Did you really read Jackson’s paper ? Do you want me to quote exactly what he wrote in the 1982 article quoted in the references of my paper ? The same for Rogers. That’s why I wrote: “I must confess that their conclusions (at least in the papers I have) were often not so definitive as expected.” Although I knew the arguments against the scorch hypothesis, something was lacking (to my knowledge) :direct observations through the microscope with various parameters. It seems to me that you think that your demonstration starting from the bloodstains only is the absolute proof against an artifact and therefore that my work is useless. This is clearly a problem for any hypothesis involving a forger. But not a proof. Rogers himself never thought that the authenticity (i.e. A burial sheet) could be based on this kind of “proof”. You wrote: ” At the end of this paper, you wrote that you would published a follow up paper for this 2007 paper. WHY DON’T YOU START WRITING IT RIGHT NOW ??? Honestly, I really think such a paper would be a “much needed contribution to shroud science” than this paper about the scorch hypothesis !!!” Why did I not write this paper? For many reasons that I can’t explain now. I am now convinced that any kind of paint, dye or scorch can be ruled out with the highest degree of certainty. A chemical reaction remains as the most probable body image formation process. Maillard reaction is probably the most interesting (perhaps not the only one). Putrescine and cadaverine are not the reactive amines as suggested by Rogers (whatever you might think). But other reactive amines are possible. I will post as soon as possible a message explaining what I found in the scientific literature. In any case, Yannick, I have not be surprised by your comment. It was so foreseeable ! You are not required to read my paper and/or to comment it stating that it is a “waste of time”. For me it is not. Lets go step by step. Thibault..","date":"2012-10-22","mins":"3:27 pm","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"id":"comment-18300","author":"thibault_heimburger","post":"Hello, Thank you for your kind comments. I will reply to some of you as soon as possible. Thibault..","date":"2012-10-25","mins":"5:02 pm","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"id":"comment-18518","author":"thibault_heimburger","post":"Dear Yannick, I don’t understand your insistence on saying that my analysis was unnecessary. This is your opinion and I respect it but please don’t repeat again and again the same things. In fact, I had many good reasons to study myself the scorch hypothesis. The first one is that I do what I want !! The second one is that there are some arguments (the reflectance and UV spectra) which seem to support the scorch hypothesis. The third one is that I was not able to find any STURP paper based on experiments that truly and completely rule out the scorch hypothesis as the result of the the conscious work of a man. In my opinion, nobody can definitely exclude any hypothesis without experiments showing that this hypothesis is false. In this case, it means spectra, 3 D, microscopy, fluorescence and if possible chemistry. Jackson studied 3 D properties and did not definitely rule out this hypothesis Miller and Pellicori studied fluorescence and concluded from their experiments that there is strong evidence that the TS image is not a scorch. To my knowledge, nobody made chemistry experiments on lightly scorched fibers And nobody (to my knowledge) tried to compare under the microscope the color pattern of any kind of scorch with that of the TS image. In my experiments, the differences were so obvious that I could write: “now I know for sure …” You are quoting Rogers. I am glad to read that some of my observations were also found by Rogers particularly this one: “Microscopy proves that image fibers and scorch fibers are quite different in structure and composition. The distribution of color is different, even at the level of single fibers.”. However, Rogers’ observations were made on scorched fibers of the TS (from the 1532 fire) and therefore were not necessarily relevant to the scorch hypothesis as a result of the conscious choice of a forger. Testing a hypothesis is a construction. My observations are only the last step. Now there is no doubt. You was convinced a long time ago. I was not completely convinced before my own experiments. So, now we agree. It is definitely not a scorch. So please forget my “paper” now. Thibault..","date":"2012-10-29","mins":"4:47 pm","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"id":"comment-43502","author":"thibault_heimburger","post":"Dear Hugh, Yes I read this blog from time to time. About your question 4), no it is not true to state that Fanti “was not willing at all to even mention Rogers’ impurity hypothesis” until forced to do so?” I repeat : this paper was not mainly about the chromophore but an attempt to explain what is the superficiality of the TS image at fabric, thread and fiber level..","date":"2013-09-09","mins":"3:52 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","title":"Thoughts on the thoughts on the newly published paper by Ray Rogers"},{"id":"comment-54214","author":"thibault_heimburger","post":"“Has anyone ever attempted to create a graph of measured distance between points on a three dimensional human form (or just a head) and an abstract surface or hypothetical plane using gray scale tones or luma to represent the data? In other words has anyone produced a heightmap?” Yes and no. This has been done by Jackson and al. In ” Three dimensional characteristics of the Shroud Image” in Proceedings of the International Conference on Cybernetics and Society, October 1982″ (16 pages). They first used the “Small Sample Correlation Technique”: ” Our procedure for measuring the degree of correlation between image shading and cloth body distance involved first measuring the transmittance of a black and white transparency of the face taken of the Shroud in 1978 by a microdensitometer. We chose to sample 13 image locations: tip of nose, edges of nose, cheek, eyes, eye sockets, bridge of nose, lips, mustache, and forehead (…) Next we measured cloth body distance by draping a linen model of the Shroud, hand woven as to correspond with the herringbone weave and thickness of the Shroud, over a bearded volunteer subject. Side photographs were made with the cloth in place and then after immediately being removed. By superimposing these photographs and using contours gadges (…)we determined cloth body distances (…) We then plotted these data of transmittance and cloth body distance and determined a linear regression line (…) The measured coefficient of determination, r2, was 0.60 for the 13 data points, at the 95% confidence level, which implies that the actual coefficient of determination, lies between 0.20 and 0.83. Through the range is quite large owing to the small number of data points available, some observations can nevertheless be made. First the null hypothesis [no correlation] is excluded, indicating that some image correlation with image shading and cloth body distance is present (……..) The reliability in the measurements of [the coefficient of determination] could be increased if more data points were sampled. We can estimate the numbers, n, of datapoints required (..). We calculate the number of data points to be 1700. (..) This value of 1700 is prohibitive by the manual sampling technique discussed above, but may be possible via some automated sampling algorithms.” “Relief Image Technique Although we have not as yet developed an adequate large number sampling algorithm, we have studied the Shroud image with another technique that allows visual estimation of how well image shading correlates with distance.”: the VP8. Then, in this paper, the authors described in detail, step by step and with many experiments how and why the VP8 can be used to estimate the reliability of the “cloth body distance hypothesis”. They concluded: ” These results demonstrate that image shading on the Shroud correlates with distance between 2 surfaces, one of which can be interpreted as a body shape and the other as a cloth draping over that body surface. Logically, this does not prove that a cloth was draped over a body shape when the Shroud image was formed because other hypotheses not involving a cloth covered body shape might conceivably account for such an effect. (..) “Thus we may refer to the Shroud image as having a “three dimensional characteristic” which means, simply, that image shading can be self consistently interpreted as being correlated with the distance between a body an an enveloping cloth.” And finally they tested many image formation hypothesis using this “technique”: ” (..) A correct hypothesis of image formation must be able to produce an image structure capable of a “three dimensional interpretation”, for in doing so the shading distribution of the shroud image would be duplicated”. This paper is THE fundamental study of the “3 D interpretation” of the TS image. Everybody who wants to discuss seriously must read it carefully. I had to read it carefully at least 3 times to understand the logic of the reasoning. For me, the reasoning seems to be irrefutable. Is it ? You can ask me for this paper..","date":"2013-11-30","mins":"5:35 pm","url":"https://shroudstory.com/2013/11/29/this-may-be-the-biggest-mystery-of-all/","cat":"image_theory","title":"This may be the biggest mystery of all?"},{"id":"comment-48545","author":"thibault_heimburger","post":"Hugh, I have the Bremmer’s paper. What are your own conclusions ?.","date":"2013-10-23","mins":"2:52 pm","url":"https://shroudstory.com/2013/10/21/todays-how-do-we-know-the-image-is-not-painted/","cat":"image_theory","title":"Today’s How do we know? The image is not painted"},{"id":"comment-48624","author":"thibault_heimburger","post":"Hugh Farey : I don’t really have any. The blood spectrum of the shroud is not sufficiently similar to any other blood spectrum for its identity of blood to be confirmed. As it happens I wrote to Bremmer, sending the Gilbert blood spectrum for comment. He replied: – The absorption peak around 610 nm is unusual for bloodstains. Nor hemoglobin, met hemoglobin, hemichrome or bilirubin has an absorption peak near 610 nm. – The absorption increases for wavelengths > 650 nm, this is also unusual for bloodstains – The region between 350 nm and 550 nm is very flat, which is also unusual for bloodstains – Adding to this that based upon our experimental studies we found that after 2 years the hemoglobin in the bloodstain is totally converted to hemichrome and after two year the chemical composition of the stain doesn’t change anymore. – To summarize, based upon the low quality image I could say that is it not very likely that the attached reflectance graph resembles the reflection of a bloodstain. Thank you Hugh My thoughts later..","date":"2013-10-24","mins":"2:54 pm","url":"https://shroudstory.com/2013/10/21/todays-how-do-we-know-the-image-is-not-painted/","cat":"image_theory","title":"Today’s How do we know? The image is not painted"},{"id":"comment-90135","author":"thibault_heimburger","post":"Thank you Antero. Dear Hugh, you wrote: “The scorch hypothesis has not been disproved by Heimburger at all. It was barely investigated, let alone disproved.” If “barely” means that I only tested the most simple scorch hypothesis (a hot flat template applied onto linen that gives very light, light and strong scorch marks), I agree. And I stand firm. I did not test more complex processes. “My own investigations have produced much more solid evidence against the hypothesis, but I’m perfectly prepared to accept that there may be scorchy circumstances in which that does not occur”. Why not to write a paper showing (with photos) your “solid evidence” against the hypothesis ?.","date":"2014-03-17","mins":"4:05 pm","url":"https://shroudstory.com/2014/03/14/two-comments-promoted-colin-berry-has-cracked-the-shroud-enigma/","cat":"image_theory","title":"Two Comments Promoted:  Colin Berry Has Cracked the Shroud Enigma?"},{"id":"comment-88853","author":"thibault_heimburger","post":"Chris B: ” Also check out the heavily scorched areas near to burn marks. I cannot see any tufts there either.” That’s true. Surprisingly, I can’t see any evidence of abrasion in the 1532 burned areas. Yannick: “The data coming from the blood indicates that it was not damaged in any way by a high level of heat and strongly suggest an event that happened at normal temperature…” Yes, but remember that Colin does not consider the protease tests showing that blood came first as truly reliable. For me, given the data, I consider the “blood first” hypothesis as very probable, but I agree that more experiments are needed. Hugh: ” So far, as far as I know, Colin has been scorching unprepared cloth, which needs a relatively high temperature. Using hints from various sources, I have prepared linen by dripping molar solutions of sulphuric acid and sodium hydroxide on it. After it has completely dried, the test areas darken much more readily on heating than the original. This leaves us open to a couple of experimental directions: firstly, that the image could have been created by scorching, but at a much lower temperature than we normally call “scorching,” and secondly that a latent image could have been created by contact with an acid (possibly paint based) or an alkali (possibly biologically based), and the image ‘developed’ by age, heat, or a combination of the two.” I do not understand why you used sulphuric acid and sodium hydroxide on the linen. Do you think that a medieval forger used this kind of highly complex process ? Or did I miss something ? My opinion is the same: the scorch hypothesis does not explain the TS image. However, Colin provides some precise details that have to be tested. I have some ideas to test Colin’s ideas at thread and fabric level. However, I am interested in your ideas..","date":"2014-03-14","mins":"4:25 pm","url":"https://shroudstory.com/2014/03/14/two-comments-promoted-colin-berry-has-cracked-the-shroud-enigma/","cat":"image_theory","title":"Two Comments Promoted:  Colin Berry Has Cracked the Shroud Enigma?"},{"id":"comment-16017","author":"thibault_heimburger","post":"Yes a faint image is not the same as a superficial image. It is easy to show that without any sophisticated mean. Today I did it in my kitchen : ). Just take a 3 millimeter thick linen sheet. The thickness, similar to that of the Turin Shroud, is important. Put it down flat on a hotplate with a 3 4 mm deep depression in the center of the plate. The temperature is the same on the entire surface including the depression. The results : 1) Even with the fainter (yellowish) discoloration of the heated side, there is a very faint (although visible) discoloration of the back side 2) if you cut the sheet in a colored area, you see that the section of the threads is colored 3) 1)+2) shows beyond any doubt that a superficial image can not be obtained with even a very light scorch. But there is something which was very amazing (at least for me) : it is impossible to get an even faint discoloration of the heated side in the area that is just above the 3 4 mm depression of the heated plate : the linen remains white even if the temperature is high enough to give a strong brown discoloration of the surrounding areas in contact with the hot plate. In other words, the radiant energy of the heat is unable to color the linen even at a distance of 3 4 millimeters of the source. This is very important. Why ? Because it is absolutely impossible (in the context of the Shroud) to have a perfect contact everywhere, particularly in the face area. If one uses a statue or even a bas relief, there will be necessarily some (even small) non contact areas, i.e. Some non colored areas. A life size bas relief has nothing to do with small coins. I’ll try to provide soon my photographs and if possible the results of microscopy observations..","date":"2012-09-08","mins":"1:45 pm","url":"https://shroudstory.com/2012/09/08/wheres-the-evidence-colin/","cat":"image_theory","title":"Where’s the Evidence, Colin?"},{"id":"comment-22313","author":"thibault_heimburger","post":"Colin has now a microscope. Why does he not write a paper about his observations at fabric, thread and fiber level?.","date":"2013-01-20","mins":"3:48 pm","url":"https://shroudstory.com/2013/01/20/whats-in-a-linen-fi-ber/","cat":"image_theory","title":"What’s in a linen fiber?"},{"id":"comment-16050","author":"thibault_heimburger","post":"Ron, Would you please give me the exact references of Jackson’s work ? Thank you in advance. T..","date":"2012-09-09","mins":"6:29 am","url":"https://shroudstory.com/2012/09/08/wheres-the-evidence-colin/","cat":"image_theory","title":"Where’s the Evidence, Colin?"},{"id":"comment-209315","author":"thibault_heimburger","post":"I want to test Colin’s model. But what is currently his best model ?.","date":"2015-08-30","mins":"3:02 pm","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","title":"You may reassure Mr. Berry"},{"id":"comment-170458","author":"thibault_heimburger","post":"Hello OK, Your paper is very interesting. I have the Halta Definizione pictures and I would like to verify your claims using GIMP. You wrote for example :”Here we have the graph of default greyscale of it” “It” being the COLOR Durante photograph. I do not understand: what do you mean by “default greyscale” of a color photo..","date":"2014-11-10","mins":"4:30 pm","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","title":"Guest Posting by O.K. on the Shroud as a Negative"},{"id":"comment-209379","author":"thibault_heimburger","post":"THIS IS MY ANSWER TO COLIN I WISHED TO PUBLISH ON HIS SITE FOLLOWING HIS ANSWER TO MY QUESTION ABOVE. Http://colinb sciencebuzz.blogspot.co.uk/2015/08/is high energy laser beam really needed.html (Update 31 August) Sorry Colin, but I am unable to post this comment on your site, “Thanks Colin, I’ll try it but probably without oil. I do not understand why oil is needed in order to give the best shroud like image. In other words, what is not good enough with the dry flour/wet linen model ? You might be right or not. At the end I will show my results, including microscopy. And also after ageing the samples (why did not you try artificial ageing ?) I need some weeks for this work. You wrote: “Do you know of a modelled image that has a closer match with the TS?” At first glance, no. “Isn’t that obvious TH – you having visited this site yesterday (sitemeter ; )?” True. Do you spy on me ? No problem ; ) Thibault..","date":"2015-08-31","mins":"2:34 pm","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","title":"You may reassure Mr. Berry"},{"id":"comment-177366","author":"thibault_heimburger","post":"Colin wrote: “Without labouring the detail, or going over old ground, the structure of the flax fibre is probably the key to understanding the difference between light scorching (no fluorescence) and heavy deeper scorching (intense fluorescence). Light scorches probably pyrolyse selectively the carbohydrates of the primary cell wall, notably the chemically reactive hemicelluloses. Heavy deeper scorches affect the cellulose in the core of the fibre, requiring a considerably higher temperature, and generating the monomers that are needed for polymerization on the graphite pathway terminating in charcoal that are responsible for intermediate uv fluorescence.” I am unable to discuss the chemistry, but Colin’s reasoning (as quoted above) has nothing to do with the question. We are not discussing about heavy scorches versus light scorches. The problem is entirely that of light scorches. The color of the margins of the scorches on the TS (light scorch) has the same color and the same reflectance spectra than the color and the spectra of the TS image. But these light scorches on the TS do fluoresce while the TS image does not. Moreover, up to know, any kind of light scorch on linen (Pellicori experiments, Hugh experiments) shows that a light scorch on linen always produces a fluorescent “image”. It means that the TS image has many properties similar to a light scorch but that it is not a light scorch..","date":"2014-12-17","mins":"6:39 pm","url":"https://shroudstory.com/2014/12/15/is-fluorescence-still-in-question/","cat":"science","title":"Is Fluorescence Still in Question?"},{"id":"comment-1743","author":"thibault_heimburger","post":"Sorry Colin, The above photo from Hugh is NOT a fibre. It is a so called” technical fibre”, i.e. A bundle of fibers; I have just written an email to Hugh about that. You wrote in the caption: “Scorched linen fibre showing internal cellulose fibrils (x1000 mag.). Note the fractures.” Not at all. What you see is a bundle of several fibers (easily recognizable) still embedded in the rests of the middle lamella (mostly pectin). Therefore, all your above comments have nothing to do with the question. I have not the time to comment that right now;but Hugh is free to quote my email (and the attached picture) More later, as usual … Thibault..","date":"2013-01-16","mins":"10:27 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/15/time-maybe-to-re-think-the-received-wisdom-about-the-entire-shroud-image-being-highly-superficial/","cat":"artefacts","title":"Time maybe to re-think the received wisdom about the entire Shroud image being “highly superficial”?"},{"id":"comment-177552","author":"thibault_heimburger","post":"Thanks Colin for your replay. Of course I understand your reasoning. But sorry, I’m not convinced at all. We could discuss endless but the fact remains that, up to now, all of the experiments involving a “superficial surface scorch” do show a fluorescent image. As you rightly wrote many times, this is how science works: hypothesis and experiments. I must conclude, for now, that your hypothetical explanation for the lack of fluorescence of the TS image does not work. Joyeux Noël et à bientôt..","date":"2014-12-18","mins":"11:22 am","url":"https://shroudstory.com/2014/12/15/is-fluorescence-still-in-question/","cat":"science","title":"Is Fluorescence Still in Question?"},{"id":"comment-1762","author":"thibault_heimburger","post":"Dear Colin, Regarding microscopy you are right. There are many risks of misinterpretation mainly at fiber level. However, I would like to see some photographs of your own scorch experiments at fabric and thread level through your microscope. I guess you will see what I have described in my “paper” on the other site. That’s why I did not answer to your rebuttal. I was and I’m still waiting for a rebuttal based on your own observations. Regarding the ME/STERA photographs, I can say that you have already seen the most interesting photographs. If you want the entire collection, you just have to ask to the owner. Is it so difficult ? Thibault..","date":"2013-01-21","mins":"9:16 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/15/time-maybe-to-re-think-the-received-wisdom-about-the-entire-shroud-image-being-highly-superficial/","cat":"artefacts","title":"Time maybe to re-think the received wisdom about the entire Shroud image being “highly superficial”?"},{"id":"comment-92013","author":"thibault_heimburger","post":"CB: “I’m busy right now, Hugh, composing my third missive on the subject of creases (a vital spy clue I believe as to mechanism of imaging). One has to distinguish between (a) intentional creases, V shaped in cross section, tidy ones that probably pre dated the image, and were somehow incorporated adventitiously into the image, and (b) unintentional untidy creases, S shaped (or reverse Z shaped) in cross section that arrived with the imaging process via accidental linen entrapment. The two types of crease, when modelled in my makeshift laboratory, aka kitchen, behave differently under secondary contact scorching as my snapshots will reveal. TH please note. Just thought I’d clear the ground, so to speak, re nomenclature. As ever, the devil is in the detail.” I note and I am waiting for your missive. However, I already disagree with what you wrote above. First question: how can you distinguish V shaped from S shaped creases with the pictures you have ? PS: Dan, how is it possible to include a photograph in a comment ?.","date":"2014-03-22","mins":"4:13 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","title":"So then, why is there an image?"},{"id":"comment-1767","author":"thibault_heimburger","post":"“freak” = “anormal, taré” (Harrap’s dictionary). So, it seems to be an insult (in French). And “I have no right to demand results”. Yes I have. A light scorch is a light scorch. A very light scorch is a very light scorch.. Whatever the template. I must conclude that you are unable to demonstrate your hypothesis and that you failed to use your microscope even at fabric and thread level. In fact you don’t want to provide your observations on your own samples at fabric and thread level through your microscope..","date":"2013-01-21","mins":"10:24 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/15/time-maybe-to-re-think-the-received-wisdom-about-the-entire-shroud-image-being-highly-superficial/","cat":"artefacts","title":"Time maybe to re-think the received wisdom about the entire Shroud image being “highly superficial”?"},{"id":"comment-91673","author":"thibault_heimburger","post":"Warning (again): the Enrie and Durante photographs are sometimes misleading. Mrs Flury Lemberg published in “Sindone 2002” (p.45) an extraordinary photograph of the TS man face (oblique light). The crease at the base of the chin (“V shape groove”) is similar to many other creases found in other parts of the image areas. Particularly it is similar to the vertical imprint of the ” V shaped center fold” All these creases have nothing to do with the image formation process. They are related to the folding of the TS..","date":"2014-03-21","mins":"4:51 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","title":"So then, why is there an image?"},{"id":"comment-187512","author":"thibault_heimburger","post":"Colin, Strangely, the French Wiki entry of “Academie Pontificale des sciences”, does not contain the words ” ..a more closely supervised successor…”. Moreover, look at: http://www.casinapioiv.va/content/accademia/en/about/history.html “Relationship to the Holy See: The Pontifical Academy of Sciences is an independent entity within the Holy See. Although its rebirth was the result of papal initiative, and though it is placed under the direct protection of the reigning Supreme Pontiff, the Academy defines its own goals with regard to its statuted mission: “…to promote the progress of the mathematical, physical and natural sciences and the study of epistemological problems relating thereto” (Statutes 1:2). Pius XII underlined the Academy’s freedom of inquiry in an address of 1940 to the Academicians: “To you noble champions of human arts and disciplines the Church acknowledges complete freedom in method and research…”. Since the deliberations and studies which it undertakes are not influenced by any one national, political or religious point of view, the Academy constitutes an invaluable source of objective information upon which the Holy See and its various bodies can draw.” “Complete freedom in method and research”. Either the author of the English version of Wiki can demonstrate that the Academia is “a more closely successor” (of the Accademia dei Lincei) or you must ask him to remove this sentence. Incidentally, I have seen that 2 of my teachers when I was a young (!!) student are members of this prestigious academy..","date":"2015-01-30","mins":"4:26 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"},{"id":"comment-187845","author":"thibault_heimburger","post":"Colin, Regarding the Pontifical Academy of Sciences, you have perfectly the right to do what we call here “un proces d’intention”. “Why does it exist? What possible purpose is served by this marriage of church and science, especially if, as you say the members retain total freedom of action and speech. It looks to me like nothing more than a public relations exercise on the part of the Church.” It exists because the Church does consider that Science with its own magisterium has something to tell that is important to consider when the Church (with its own magisterium) has to think about some fundamental questions. It is not at all a question of “marriage”. As long as science does not consider itself as a religion (I mean science as being allegedly able to give the final and complete sense of the Reality) , which occurs too often, even today, science is an approach that can’t be ignored by the Church. The best example is that of the theory of Evolution (which is more than a theory, according to Pope John Paul II). This theory, as well as the critical studies of the texts etc. Has completely changed the understanding of the Revelation. You have the right to consider the existence of the PAS as a “public relation exercise”. I will not discuss this point more later since everybody (you included) understand what I mean. Regarding the Wiki entries about the Shroud, I am not the author. However, I still do consider that ” a scorch mark is only produced by direct contact with the hot object ” and that there is no gradation of intensity similar to that observed on the shroud..","date":"2015-01-31","mins":"4:45 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"},{"id":"comment-23888","author":"thibault_heimburger","post":"Dear Hugh, Ron is right regarding the many testimonies about the very strange impression left by the “disappearance” of the image when viewed beyond about one meter. This simply means that beyond one meter, if you look for example at a part of the TS face, you’ll not be able to recognize it as a part of a human face. Or, in other words, for your mind to be able to see with certainty a human face, you have to be about one meter away from the TS. Yes a good picture of the TS face “as is” can be found in the book “Sindone 2002” by Flury Lemberg. The photo was certainly taken with the best “white light” uniform illumination. The face is much fainter than all the photographs I ever saw, including the Durante’s photographs. Moreover, an oblique view of the same area is shown (p.45). While the creases and the blood marks are very well seen, one can literally “see” here the incredible superficiality of the image. Photographs available at request.. Thibault..","date":"2013-02-09","mins":"5:07 pm","url":"https://shroudstory.com/2013/02/08/topic-of-the-day-8-the-body-image-disappears-at-a-distance/","cat":"topic_for_today","title":"Topic of the Day (#8):  The body image disappears at a distance"},{"id":"comment-113089","author":"thibault_heimburger","post":"Https://shroudofturin.files.wordpress.com/2012/06/maillard i  my paper.pdf Please read again this paper. Anoxie wrote: “I doubt it could be a post mortem change – hairs don’t decompose – it was slowly produced on the skin and hairs in the tomb. Looking foward to Thibault Heimburger’s candidates” I’ll try to give you the results of my researches and thoughts in the next few days. Thank you for your patience..","date":"2014-05-06","mins":"4:09 pm","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","title":"To Yannick on Science and Philosophy"}]
