[{"id":"comment-203104","author":"thibault_heimburger","post":"“Pope Francis speaks his mind. That gesture seems to say that he believes the relic is authentic ” I have not the same interpretation of the gesture. It seems to me that this gesture is the gesture of a pilgrim. Piero: “do you think the Pope would the will to caress in that manner the theca (built for custody of the Holy Shroud) if the cloth was just a painting?” No, certainly not. But the fact is that Pope Francis did not kneel before the Shroud, contrary to Benoit XVI and John Paul II. Is is significant? I don’t know..","date":"2015-06-21","mins":"4:43 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","title":"A Memorable Photograph Worth a Thousand Words"},{"id":"comment-165271","author":"thibault_heimburger","post":"Hugh”: Regardless of the precise meaning of “omni fraude cessante”, it is clear from the rest of the sentence that the Shroud was not to be exhibited as the true shroud, but only as a representation.” Yes, but,as strange at it is for our modern conceptions, it does not mean at all that Clement VII considered the Lirey shroud as a forgery. We have to take into account the history of the Councils of the Church regarding the relics to understand the final official bull of Clement VII. Clearly, Clement VII had truly a neutral position, More tomorrow..","date":"2014-10-24","mins":"5:36 pm","url":"https://shroudstory.com/2014/10/23/accusations-of-intellectual-dishonesty/","cat":"news_&_views","title":"Accusations of Intellectual Dishonesty"},{"id":"comment-191980","author":"thibault_heimburger","post":"Hugh: ‘ Robert Villarreal found two pieces of cotton thread, not just fibres, butt joined together by the crust of terpene. There was no splicing, and no linen, in the tiny sample Villarreal examined. ‘ Not at all. In 2008, on the basis of FTIR spectra, Villareal found that threads coming from the Raes samples were cotton threads, not linen. The spectra of the threads as well as the spectra of individual fibers were similar to the spectra of cotton and very different from the spectra of flax. He concluded that the C14/Raes corner was not representative of the Shroud. However, as you know, I received one of those threads (Raes 7) and I found that the majority of the fibers were flax fibers. Nevertheless, I also found many cotton fibers mixed with flax fibers. I agreement with Rogers, I concluded that the ratio of cotton vs flax is strongly anomalous with regard to the main part of the Shroud. No more, no less. (See my paper on Shroud.com). But there was a problem with Villareal experiments. How is it possible that he found that the threads (including ‘my’ Raes 7) were entirely made of cotton? The answer is found in his paper shown in Saint Louis: http://www.shroud.com/pdfs/stlschoonoverppt.pdf Briefly: ‘ For modern samples, there are spectral features that differentiate unprocessed linen from cotton. However, processing/aging of linen can dramatically change its spectral characteristics. This make it very difficult to conclusively identify an unknown sample’. It means that his previous 2008 FTIR experiments, comparing modern linen and modern cotton, were not reliable. It means that his 2008 ‘cotton like’ spectra could be the spectra of aged and/or processed linen. However, this has nothing to do with the splice found in Raes 1. Raes 1 is truly a splice with a terpene like crust. This fact found by Rogers and confirmed by Villareal in 2008 is NOT refuted by Villareal’s 2014 paper..","date":"2015-02-27","mins":"5:30 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192047","author":"thibault_heimburger","post":"Thanks to you Hugh. SPLICE. According to the late (and wonderful) Sue Benford, there are 3 kinds of splice (“All general splicing information was obtained from:YARN CLEARING, KNOTTING AND SPLICING, M. Anbarasan, Premier Polytronics Ltd., Coimbatore, India”). “Wrapping: The tail end of each yarn strand is tapered and terminates with few fibers. The tail end makes a good wrapping of several turns and thus prevents fraying of the splice. The fibers of the twisting yarn embrace the body of the yarn and thus acts as a belt. This in turn gives appearance to the splice. Twisting: The two yarn ends comprising the splice are twisted around the body of the yarn, each yarn strand twists on the body of the yarn on either side of the middle of the splice. The cross section of this region distinctly shows the fibers of the two yarn strands separately without any intermingling of the fibers. Tucking /Intermingling The middle portion of the splice is a region (2 5 mm) with no distinct order. The fibers from each yarn end intermingle in this splice zone just by tucking.” I have the Powerpoint 2008 Villareal presentation. I have been able to measure accurately the 2 pieces of Raes 1 because one of the slides shows them clearly with a scale bar. Piece 1 (with the frayed ends): 6.9 mm Piece 2: 3.5 mm. Total: 10.4 mm=1.4 cm which is exactly the length of the whole piece of thread as written by Benford and Marino (probably from Rogers). The crust is about 3.75 mm. In length. We must conclude that Raes 1 is not a “twisting”. Unfortunately, my English is not good enough and I am unable to understand clearly the definitions of “Wrapping” and “Tucking”. You wrote previously: ” Robert Villarreal found two pieces of cotton thread, not just fibres, butt joined together by the crust of terpene.” At least you agree that Raes 1 is comprised of two pieces joined together, but I do not understand “butt joined together”. Can you explain what you have in mind and the possible relationship between your claim and the wrapping and/or tucking splicing techniques ? Incidentally, it is very amazing that, looking at the photographs of Raes 1, it is impossible to see the boundary between Piece 1 and Piece 2. However Rogers found it and described Raes 1 as an END TO END unique splice. COTTON You wrote: “Only now, 6 years later, do we have a presentation attempting to show that old linen spectra look like cotton spectra anyway, so the FTIR analysis is worthless. However, they do not show that Villarreal’s findings were wrong, only that “it is possible that the thread composition varied from one end to the other, consistent with the slicing hypothesis.” And: “Raes 7 and Raes 14 did not fall apart, were not splices, and were also cotton.” Yes, unfortunately, the previous 2008 FTIR analysis is worthless. The best way to analyse a fiber is polarized microscopy. I can tell you with certainty that Raes 7 is comprised of a majority of flax fibers mixed with many cotton fibers, in agreement with Rogers. Oxford found some cotton fibers at the surface of his sample. I have to repeat that, following my own knowledge of Raes 7, it is truly impossible to know the true composition of a thread without unraveling it. To my knowledge, Oxford never performed this kind of experiment (and it is understandable)..","date":"2015-02-28","mins":"5:32 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192049","author":"thibault_heimburger","post":"Hugh, “Gonella reported that he excised the threads from the center of the radiocarbon sample.” This cannot be true, can it? The threads came from the border of the ‘Reserve’ See my papers: http://www.shroud.com/pdfs/stlheimburgerpaper.pdf http://www.shroud.com/pdfs/stlheimburgerppt.pdf Questions?.","date":"2015-02-28","mins":"5:42 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192091","author":"thibault_heimburger","post":"I don’t take offence of your statements. It’s true that I am not an expert on textile. The aim of my paper about Raes 7 was only to have a better knowledge of the number and the location of the flax fibers in Raes 7. For that, you don’t need to be an expert on textile. You ‘only’ need to have a good pol light microscope, to practice differentiating flax and cotton fibers and to laboriously separate each fiber from the others. I did it. I also sent my photographs and even the slides to true experts. “And big errors are sometimes done (Rogers, for example).” Examples ?.","date":"2015-03-01","mins":"7:30 am","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192118","author":"thibault_heimburger","post":"Charles: ‘ As Thibault notes, you do not have to be an expert to spot the difference between cotton and linen which makes it easy to check out Rogers’s hypothesis on the Shroud itself or any other woven pieces from it. Also it meant that the labs could spot it as well before they did the dating. So unless you are accusing Oxford, Tucson and Zurich of deliberately concealing the cotton they must have been able to see…….’ This is not the problem Charles. When I looked for the first time at Raes 7 as it was through the microscope, I was unable to see even a single cotton fiber. The thread seemed to be entirely linen. It was only when I decided to “dissect” meticulously the thread and to separate the fibers that I could see many cotton fibers (10 20% of the fibers). You can’t imagine how difficult it was! I spent several hours (repeat: hours !) to do that, with two ultra thin needles. Do you think that the laboratories did perform this kind of laborious work? Not at all. They had no reason to do that. Oxford provided some pictures showing that they studied at least one TS thread using an electron microscope. The thread was “as received” (no attempt to study individual fibers) and electron microscopy can not show the characteristic features of cotton fibers. Nevertheless, Oxford found a ‘rogue fiber’ which has been described later as an ‘old’ cotton fiber by another specialized laboratory. I bet that many cotton fibers could have been discovered in this thread..","date":"2015-03-01","mins":"3:38 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192224","author":"thibault_heimburger","post":"Sorry my previous post was an answer to David, not Charles..","date":"2015-03-02","mins":"3:31 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192223","author":"thibault_heimburger","post":"Charles: “Did you, Rogers or Raes the same meticulous work on the other samples? Including the fibres from the main body of the Shroud, of course. How many samples were worked with your meticulous system of work?” I did not because Raes 7 is the only sample of the Raes/C14 corner I got. Rogers studied in depth some of the other Raes samples he had as well as his C14 samples. He did not perform the exactly the same work ( i.e a complete dissection if his threads) but from his writings and photographs, we have to conclude that he made this work at least partially. He wrote: ” Cotton fibers are easy to find mixed INTIMATELY with the linen fibers of Part1 Raes threads… I did not attempt to make a quantitative cotton comparison between Raes and radiocarbon threads and Shroud tapes, because there was too little cotton of any kind on Shroud samples …The cloth appeared to be pure linen”. About Raes, his photographs show some separated fibers. He made some microscopical preparations. I don’t know how many. From his writings, probably too little. He found “traces of cotton” in Part 1 (an none in Part 2) and this cotton was intimately mixed with the linen fibers. Raes did not try no quantify the ratio cotton/flax fibers in the sample. It was not his job. Shortly: Raes: “traces of cotton” mixed with linen fibers in some threads of Part 1 (but not in all of them). Rogers found many cotton fibers mixed with linen fibers in some of the Raes and C14 threads but almost no cotton in Shroud tapes. I found about 10 20% of cotton fibers in Raes 7 intimately mixed with flax fibers. Hypothesis? Conclusions?.","date":"2015-03-02","mins":"3:27 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192225","author":"thibault_heimburger","post":"Charles: “The question is whether there was enough to sway the carbon dating samples. Judging from your looking for needles in a haystack work, it seems clearly that there would not be. Time to move on on this one.” It seems to me that you don’t understand clearly the question. The high content of cotton fibers in the Raes/C14 corner is only a ‘marker’ that there is something anomalous. The hypothesis is that this corner includes a mixture of: 1) ‘Ancient’ pure linen threads 2) ‘Modern’ linen+cotton threads while the main part of the Shroud seems to be comprised of (almost) pure linen..","date":"2015-03-02","mins":"3:44 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192521","author":"thibault_heimburger","post":"David, Obviously, you did not read my paper http://www.shroud.com/pdfs/thibaultr7part1.pdf and part 2 and 3 carefully. You can find the precise answers to your two Post scriptum (Raes 1 and the name of the experts) in those papers. Just read them! And NO, Rogers and myself are not in contradiction. Exactly the contrary. You misunderstand Rogers when he wrote that cotton fibers were “easy to find”. Yes, they are easy to find (= there are plenty of cotton fibers) but not just by looking at the thread with the microscope. Rogers, too, had to separate some fibers. I just finished this work in order to confirm and quantify what Rogers found. “3.We cannot conclude anything definite, except that you found some cotton mixed with the linen in your sample in a proportion (“perhaps”) of 15%. And Rogers “too little” cotton. With different methods, “perhaps”. (This is what I called “amateurism”). What are you speaking about ? This is this kind of “charabia” I personally call “amateurism”. And please, purchase a microscope and try to count the exact number of fibers in a small piece of thread. You then will understand why I used the terms “perhaps” or “about” or “roughly”..","date":"2015-03-05","mins":"11:47 am","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-191920","author":"thibault_heimburger","post":"Giorgio’s paper is not about the the Shroud. It is an interesting work about the cognitive response of the readers of Rogers’ paper (and another one). Nevertheless, I would like to comment some sentences. “They hypothesized that the radiocarbon dating was not from threads excised from the main body of the Shroud, but rather from a location contaminated with dye cotton used in the restoration of the Shroud.” First, I repeat (!) that Rogers never said that the C14 corner was made of “old” linen fibers mixed with “new” dyed cotton fibers. This is nonsense. He said that the C14 corner is a mixture of “old” linen threads mixed with “new” linen+cotton threads, suggesting a repair. ” Due to the lack of documentation pertaining to the threads’ chain of custody, Rogers’ contemporaries questioned the threads authenticity and his research findings. The ethical responsibility by the authors and journals is paramount to the peer review process. Without any attempt at the author or journal to clarify the chain of custody or vigorously pursue questionable data, it might appear that both parties may have violated their ethical responsibility to their audience.” It is true that Rogers did not ‘clarify’ the chain of custody of his samples. The main reason comes from the fact that ‘ the Archbishop Emeritus of Turin, Giovanni Saldarini requested all unauthorized threads to be returned to Turin and any testing would be disowned on all unreturned threads’ But both Rogers’ Raes and C14 samples were authorized samples by Card Ballestrero. Unfortunately, Rogers had to take into account these ‘political’ reasons. Http://www.shroud.com/pdfs/stlheimburgerpaper.pdf http://www.shroud.com/pdfs/stlheimburgerppt.pdf.","date":"2015-02-26","mins":"4:07 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192657","author":"thibault_heimburger","post":"Essay.","date":"2015-03-06","mins":"4:42 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192713","author":"thibault_heimburger","post":"David, “Essay” was only an… essay (the common noun, not the verb). Below that word, I tried to copy and paste an image..And failed. Thus my following posts (how to put an image in a comment ?). I’ll try tomorrow. Interpretations are sometimes very funny : ).","date":"2015-03-07","mins":"3:02 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192087","author":"thibault_heimburger","post":"Thanks Hugh..","date":"2015-03-01","mins":"7:12 am","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192419","author":"thibault_heimburger","post":"Yes OK Thank you very much. It seems very interesting. I’ll loot at it carefully and give you my thoughts asap..","date":"2015-03-04","mins":"2:38 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192659","author":"thibault_heimburger","post":"Dan, Can you explain (again ?) how to show a picture in a comment ? I tried but I failed. Thanks. Thibault..","date":"2015-03-06","mins":"4:46 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-12972","author":"thibault_heimburger","post":"Thank you Yannick for this excellent summary of my old paper. I can furnish it to everybody. Or alternatively to publish it here (how?) Regarding the second part of the paper (is the TS image consistent with the laws of diffusion ?), I never finished it. I am not at all a physicist. I only used a beautiful software to try to obtain a mathematical model of what happens in non contact areas. I got some interesting results in the most simple cases but the subject is very complex. Is there here a physicist ?.","date":"2012-06-23","mins":"12:52 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-178020","author":"thibault_heimburger","post":"I did it! Funny. I could comment my own answers but I don’t want to have an influence on whoever. I encourage you to participate. Dear Giorgio, are you yourself this student?.","date":"2014-12-20","mins":"1:46 pm","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help"},{"id":"comment-178034","author":"thibault_heimburger","post":"I like your humor! Happy Christmas my friend. Thibault..","date":"2014-12-20","mins":"3:09 pm","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help"},{"id":"comment-97927","author":"thibault_heimburger","post":"CB: ” Yet the vast majority have never bothered to produce a single contact scorch. I have – hundreds of them. While I sadly lack the technology to prove it, I invite others to disprove my contention that a contact scorch on linen can be as superficial as one likes, right down to the molecular scale at surface (primary cell wall) level. ” Colin, you have “hundreds of them”.. Me too. You have a microscope. You could easily demonstrate that a ” a contact scorch on linen can be as superficial on linen as on likes..” At least at thread level..","date":"2014-04-09","mins":"4:26 pm","url":"https://shroudstory.com/2014/04/09/i-too-can-be-a-practitioner-of-peudocience/","cat":"news_&_views","title":"I, too, can be a practitioner of p$eudo$cience"},{"id":"comment-98148","author":"thibault_heimburger","post":"I have just finished my new paper…in French. I now have to translate it in English…. It will be available before the end of this week. Thank you for your patience..","date":"2014-04-10","mins":"3:22 pm","url":"https://shroudstory.com/2014/04/09/i-too-can-be-a-practitioner-of-peudocience/","cat":"news_&_views","title":"I, too, can be a practitioner of p$eudo$cience"},{"id":"comment-44106","author":"thibault_heimburger","post":"David, you wrote: “Among the reasons cited by Bruno Barberis for the Vatican being reluctant to proceed further with another scientific examination is, believe it or not, the question of money.” What are the other reasons given by Barberis ? I think the answer is crucial to understand the attitude of the Vatican and to try to develop a strategy..","date":"2013-09-13","mins":"3:29 pm","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-215194","author":"thibault_heimburger","post":"Someone asked: “Do you have any knowledge about it, ie. Is this from the picture formation on the Shroud?” The answer is NO. This picture has nothing to do with the image. According to Bollone, it comes from : ” “fibrils from a linen thread taken from the sole of the right foot with granules of pigmented material that immunofluorescence investigations have shown to be human blood.” Blood. Petrus Soon is wrong. Incidentally, I am currently working on Mc Crone’s (painting) hypothesis with new experiments..","date":"2015-11-27","mins":"4:01 pm","url":"https://shroudstory.com/2015/11/27/i-hope-this-helps/","cat":"reader_inquiry","title":"I Hope This Helps"},{"id":"comment-147577","author":"thibault_heimburger","post":"Hi Hugh, Unfortunately Shroud 2.0 app is only for those who have an Ipad etc. I do not understand why Shroud 2.0 is not available for Android and/or Windows !! However, my friend Sebastien sent me months ago some pictures from Shroud 2.0. I also have many HD pictures from Halta Definizioni, as well as Enrie, Durante, Barrie Shwortz and Flury Lemberg photographs. In all of them the “banding effect” is obvious. Of course, it is more or less marked, depending on the illumination. But it is there. By “banding effect”, I mean: the fact that the alternation of light and dark vertical (and horizontal) bands impacts on the TS image density. You wrote for example (in your PDF): ” We can now see a number of narrow vertical stripes, but the light and dark ‘bands’ do not extend into the hair” I disagree. The light and dark ‘bands’ do extend into the hair. Moreover there are also some horizontal bands which are clearly seen in some photographs that also impacts on the TS image density. The banding effect is not an illusion. Whatever the imaging process,the TS image,as we see it, is the result of the interaction between the “template” (“dead body, bas relief, painting or whatever”) and the cloth. I strongly suspect that the “banding effect” is one of the keys of the understanding of the TS image. However, I have no time enough to study it in depth for the moment. I have to write my third and last PDF about the “scorch hypothesis” and much more. If Hugh or anybody else wants to contact me for more information, just send me an email ( just ask Dan if necessary)..","date":"2014-08-31","mins":"2:57 pm","url":"https://shroudstory.com/2014/08/29/more-about-banding-on-the-shroud-of-turin/","cat":"news_&_views","title":"More about banding on the Shroud of Turin"},{"id":"comment-147364","author":"thibault_heimburger","post":"Thank you Hugh for clarification. ” The face on the shroud has a ‘vertically aligned’ look, with sharply cut off cheeks and vertically falling hair. The question is, are these light bands true representations of the model (dead body, bas relief,painting or whatever), or are they artifacts of the cloth, or of the photographs in which they appear?” The banding problem is not some kind of “all or nothing”. There are several kinds of bands on the Shroud. Here we are speaking of the alternated regular light and dark vertical bands. You have shown that these bands are clearly connected to the herringbone weave of the fabric. I fully agree and some weeks ago I also discovered the same fact in the hands area. The light bands on both sides of the TS man face are connected to the herringbone weave ( ‘pitch’) of the fabric. “So the light vertical areas defining the sides of the cheeks are really present, but they are not as precise or as well defined as they appear, and are not merely artifacts of the cloth, but real areas where the image making process just didn’t happen.” How can you conclude that in those areas “the image making process just didn’t happen.” See: http://thierrycastex.blogspot.fr/2012/04/filtrage dans le domaine de fourier.html and: http://thierrycastex.blogspot.fr/2012 05 01 archive.html and: Thierry Castex is a true expert in imaging techniques. From Castex and your studies, one can conclude: 1) there is an image in these light vertical areas. 2) The light vertical bands are closely related to the herringbone weave 3) If you exclude the effect of the weave, you obtain a much more realistic image. Now, the true question is: how can we explain the relationship between the herringbone weave and the image ?.","date":"2014-08-30","mins":"2:15 pm","url":"https://shroudstory.com/2014/08/29/more-about-banding-on-the-shroud-of-turin/","cat":"news_&_views","title":"More about banding on the Shroud of Turin"},{"id":"comment-147172","author":"thibault_heimburger","post":"Hugh, in your conclusion, I read: ” So the light vertical areas defining the sides of the cheeks are really present, but they are not as precise or as well defined as they appear, and are not merely artifacts of the cloth, but real areas where the image making process just didn’t happen.” I think you have just shown the contrary. Can you please explain me the steps of your reasoning by using the most simple English words as possible ? Thank you..","date":"2014-08-29","mins":"4:43 pm","url":"https://shroudstory.com/2014/08/29/more-about-banding-on-the-shroud-of-turin/","cat":"news_&_views","title":"More about banding on the Shroud of Turin"},{"id":"comment-52176","author":"thibault_heimburger","post":"I am disappointed. I provided the pictures and what ? So many “comments” without any kind of connection to the subject ! There are so many questions without answer. More later, if necessary. And I don’t see any kind of interesting discussion. Please look at the pdf and give me/us your comments and most importantly your ideas/questions.. Colin wrote: “I now believe I know how it was done, to produce a very faint image, with pale yellow fibres, as per these welcome pictures, mainly but not exclusively on the more superficial crowns.” This is a testable claim. Colin, I have seen you experiment on your blog. Interesting. You asked me to provide high resolution microphotos. Now, you have them. I would like to see your high resolution microphotos to compare them with the ME photos..","date":"2013-11-20","mins":"5:39 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-52182","author":"thibault_heimburger","post":"OK, I don’t read Polish, sorry. If Fig.13 and 23 were obtained via “scorch and iron technique” (what kind of technique ?), they show the typical characteristics of contact imprint which have nothing to do with the characteristics of the TS image..","date":"2013-11-20","mins":"5:57 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-52547","author":"thibault_heimburger","post":"I agree with Paulette. In Dan’s posting I only see humor and absolutely no insult but exactly the contrary: “You are constructively skeptical. Your smart and you’re a smart ass. All of this is appreciated. It isn’t (or at least should not be) about being pro authenticity or anti authenticity but about being pro truth. That takes a lot of high flying, wild duckism. Yours is a valuable role.” Colin, your new LOTTO method (Linen On Top Then Overlaid) scorch method seems to be much more valuable than the old basic scorching method I criticized in my pdf (which was probably not so wrong..). Yes I will test it with a template similar to yours. I’ll try to look at the results at every scale (fabric, thread and fibers). I need some weeks. To be honest, I am still skeptic about the possibility for the TS image to be a scorch of any kind for several reasons. But, because I am not agenda driven and since the new LOTTO method has never been studied (to my knowledge), it is a duty for me (and for everybody who has a microscope) to test it. Colin, Hugh, we need you ; )).","date":"2013-11-23","mins":"4:34 pm","url":"https://shroudstory.com/2013/11/23/on-wild-ducks/","cat":"news_&_views","title":"On Wild Ducks"},{"id":"comment-214680","author":"thibault_heimburger","post":"I am French. I am living and working very near the “Stade de France” in Saint Denis. I would like to thank everybody here, and …the world. I just would like to comment this comment: ” You mean, why do people believe in Koran and Mohammed which teach the killing of Jews and Christians. Answer: allah = satan” 1) Allah is just the name of God in Arabic language. Two years ago, I was in Lebanon (for a lecture about the Shroud) and I attended a mass in Arabic language. The term Allah was widely used to translate the term God. 2) The Kuran does not teach to kill Jews and Christians. 3) Many of my patients are Muslims. There is absolutely no problem with them. It is a war. It is NOT a war against Islam but a war against ISIS..","date":"2015-11-16","mins":"3:46 pm","url":"https://shroudstory.com/2015/11/14/paris/","cat":"news_&_views","title":"Paris"},{"id":"comment-214609","author":"thibault_heimburger","post":"Thanks, Dan..","date":"2015-11-14","mins":"11:57 am","url":"https://shroudstory.com/2015/11/14/paris/","cat":"news_&_views","title":"Paris"},{"id":"comment-146349","author":"thibault_heimburger","post":"CB: ““Why was that STURP investigator talking about linen as if it were pure cellulose”? Why was he assuming that scorching would affect something as physically and chemically stable as cellulose? Was he not aware that there are other polymeric polysaccharides in linen that are far more chemically reactive that need to be considered first as the prime target of contact scorching? There are the pectins, and, more importantly, the hemicelluloses, especially as the latter are a major constituent of the primary cell wall, the most superficial exposed part of the linen fibre.” CB should know the history of STURP studies. He does not. CB should know that the discovery of the color being only confined to the most superficial layers of image fibers came later. CB should thanks Adler and Rogers for this discovery. CB:”I’ve said it before and I’ll say it again: Dan Porter should not be allowing hugely under informed TH to subject me to trial by unanswerable pdf on this site, AND highlight those same pdfs in his sidebar. Why has he not relayed some of the criticism voiced on my own site, given that he’s covered so much of the other content? How many people here know that I have found major faults with TH’s experimental methodology (pdf 1, totally unsuitable template) and been totally unable to reproduce the major “finding” of his pdf2 (“impossible to scorch superficially at the thread level”). Years ago, I proposed you to write with me a paper in witch we could discuss your opinions and findings. This might be the beginning of a fruitful discussion; You disagreed (!!). Therefore my PD Fs. Regarding my previous PD Fs (PDF 1 and 2), CB has to wait for my last PDF (PDF3) CB: “PS: why should posting photographs be a problem for TH, necessitating that pdf format, or so he maintains. TH set up his own website years ago. Http://www.suaire science.com/auteur.htm He could use his site as a halfway house, posting his photos into an archive there, and then pasting the URL of those pix into guest postings on this site. It ain’t rocket science.” Because the software I used for my own site is no longer available. More later….","date":"2014-08-26","mins":"5:22 pm","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","title":"Resting on Our Laurels"},{"id":"comment-146105","author":"thibault_heimburger","post":"Anoxie, “But i’m still puzzled by Thibault’s answers, not mentioning the crystal structure of flax fibers or characteristics of high temperature rapid heating to discard scorching.” Rogers already answered: “Microscopy proves that image fibers are quite different in structure and composition. The distribution of color is different, even at the level of single fibers. The image was NOT formed by scorching the linen fibers”. Rogers used a petrographic microscope. I have a microscope with polarized light. However a petrographic microscope, although using polarized light, is much more sophisticated than my microscope. For example, Rogers have shown that the medulla of a “LIGHTLY scorched fiber” from the TS shows “darker coloration than the rest of the fiber” while in “an unusually deeply colored image fiber, the medulla is completely colorless” ( A chemist perspective…, p. 32, with photographs). This is the kind of facts that are completely ignored by Colin. I guess that he does not even have this fundamental book..","date":"2014-08-25","mins":"4:31 pm","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","title":"Resting on Our Laurels"},{"id":"comment-195873","author":"thibault_heimburger","post":"The best photo illustrating the superficiality at fiber level is that from Rogers: http://www.shroud.com/gallery/index.htm Scroll down to “Rogers discontinuous yellow.jpg” If you want to use it or a larger photo, please ask Barrie. There are also some very impressive photos by Giulio Fanti in the “superficiality paper”.","date":"2015-04-09","mins":"2:49 pm","url":"https://shroudstory.com/2015/04/07/seeking-help-to-identify-an-image-called-superficiality/","cat":"reader_inquiry","title":"Seeking Help To Identify an Image Called Superficiality"},{"id":"comment-82467","author":"thibault_heimburger","post":"Today, I have read a newspaper article in ” le Monde” (one of the first newspaper in France) entitled: ” Le suaire, le seisme et la science”. This paper (full of humor !!) is related to the Meccanica’s paper. Needless to say that this kind of “paper” (Meccanica’s paper) is a disaster for Shroud science. I fully agree with Yannick on this point. What do we need ? We need new data. “On July 2, 2003 the work on recording the spectra and taking samples of minute particles from the surface of the reverse side of the Shroud cloth began” (in Sindone 2002, Flury Lemberg). Raman spectra, UV Vis reflectance spectra and fluorescence spectra from the reverse side of the Shroud were performed. I wonder why they performed the spectroscopy studies on the reverse side only. “On the reverse side of the Shroud we noticed some individual weft ends a few millimeters long protruding from the cloth while on the front none are visible (…) Some of these weft ends, from 2 10 mm long, were taken for ANALYSIS. Those numbered S1 S7 come from blood areas”. All the data were given to Cardinal Poletto, the Papal custodian Card. Poletto. To my knowledge, none of these data are available. Sadly…..","date":"2014-02-25","mins":"5:41 pm","url":"https://shroudstory.com/2014/02/23/should-ssg-get-involved/","cat":"news_&_views","title":"Should SSG Get Involved?"},{"id":"comment-216981","author":"thibault_heimburger","post":"Hi Dan, Thank you so much for your work. Where will I read now so many meaningful posts and comments ? Thanks to all of you, particularly to Hugh, Colin, Charles, Mario, Louis, Kelly and many others. Colin wrote: “adieu”. I hope that it’s not the end of the story. Thanks again Dan. Thibault..","date":"2015-12-21","mins":"3:16 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-45415","author":"thibault_heimburger","post":"Could you please give us a direct link to the video. Can’t find it in the article..","date":"2013-09-25","mins":"3:48 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","title":"The Eucharistic Miracle of Buenos Aires"},{"id":"comment-173353","author":"thibault_heimburger","post":"From the pro authenticity point of view, the TS cannot be a “body bag” used to transport the body from the cross to the tomb. The blood marks would have been completely blurred. What we see on the TS can only be explained if the body has been hastily transported from the cross to the tomb as it was on the cross and without any kind of “body bag” or sheet of any kind, except perhaps with the help of a strap below the lower part of the thorax, which explains the amazing “blood belt”. Please read Barbet. From an anti authenticity point of view, I can’t comment the new Colin’s “research”: “the so called Turin Shroud was never intended to represent the final burial shroud. It was a makeshift body bag used to transport Jesus from the cross to his final resting place, the rock tomb.” or ” Indeed, it’s clear it was intended primarily for transporting body from cross to tomb” Colin quoted the Evangelists. In none of them, I can find something about the alleged sheet used to transport the body from the cross to the tomb. Where are you going, Colin?.","date":"2014-11-27","mins":"4:40 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174650","author":"thibault_heimburger","post":"Charles, you wrote: “I cannot remember whether it was him or another expert I consulted who noted specifically the absence of potassium ” This assertion is only based on the X Ray fluorescence Morris and al. Study. You should have quoted their conclusion: ” “Although no potassium was observed in any of the Shroud data, poor signal to noise ratios may preclude definite conclusions on this point”. And read: https://shroudofturin.files.wordpress.com/2013/12/bbk 7.pdf in which you can read that potassium HAS been found by Bollone, Adler and Heller and that the amount of potassium is that expected for actual blood. The same is true when you write: ” We also have the failure of the Forensic Department in Modena in 1976 to find any sign of blood in their samples .” Please, quote their conclusion:” “the negative answer to the investigations conducted does not permit an absolute judgment of the hematic nature of the material under examination.” And read Kelly’s beautiful presentation at the Saint Louis conference: http://www.shroud.com/pdfs/stlkearsepaper.pdf This is THE critical (re)evaluation of the TS blood data by an expert who has ALL of the data regarding blood. This presentation (including the Powerpoint) is so clear that anybody can understand it. You wrote: “So shall we just say that the presence of blood is not proven.I shall leave it at that as I am not as expert as those I have consulted on the matter.They certainly don’t think STURP found human blood.” If you want to consult some experts on this matter, please give them ALL of the data..","date":"2014-12-04","mins":"2:55 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174789","author":"thibault_heimburger","post":"Charles, Sorry, but I’m afraid that a fruitful discussion regarding the blood is very difficult. For example you wrote: ““I cannot remember whether it was him or another expert I consulted who noted specifically the absence of potassium ” I have shown you that there IS potassium in TS blood. No answer. You also wrote: “although I trust my expert opinion as he could not find anything that hinted of human blood and felt that that Modena tests should be treated as pretty conclusive if they had not had a single one of the standard tests showing blood…” If it is true, this suggests that your “expert” does not know the limitations of those test particularly for centuries old blood. See my paper: http://www.shroud.com/pdfs/thibault%20final%2001.pdf particularly p.24 25 with the references. And even with these limitations, Bollone obtained Teichmann crystals or hematine chlorohydrate with the usual procedures. Your answer:” It is quite clear that it is not proven that there is blood.” That’s all ?? Please ask your expert to write a precise scientific rebuttal based on all of the current available data regarding the blood on the Shroud, particularly if, as you wrote: “articles by Kelly Kearse were included among those I had read through by professor Mike Spyer who is happy to be quoted as ‘totally unconvinced’.. Particularly if Prof. Mike Spyer is this expert: https://iris.ucl.ac.uk/iris/browse/profile?upi=KMSPY35 He is truly an expert in physiology of the nervous system and cardiopulmonary systems, but probably not in the problems of very old blood or immunology. Then you wrote some sentences about the “blood cults involving Christ’s blood” and “Some of this blood was probably human and why not add it to the Shroud ..” Do you have any kind of proof that human blood has been used in those “blood cults”? Does it exist any kind of painting in which human blood has been used to paint blood?.","date":"2014-12-05","mins":"4:18 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174790","author":"thibault_heimburger","post":"Charles, can you give us a link to an image of this linen Zittau Veil (1472). Thanks..","date":"2014-12-05","mins":"4:30 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-175124","author":"thibault_heimburger","post":"Hugh, don’t you have the major paper from Adler and Heller “A chemical investigation of the Shroud of Turin”, published in the peer reviewed Canadian Society of Forensic Sciences Journal in 1981? If not, I would be glad to send it to you (or anybody else). Of course, H and A did not test for blood the fibers coming from non blood areas. But they tested ALL of the fibers for proteins. After many researches, they found that most of the usual basic tests for proteins were not specific enough. This is particularly true for the amido black test used by Mc Crone who even “strongly stained pure cellulose (viscose rayon), and even more strongly stained the heated and scorched Spanish linen controls” (one of the control they used). They found that the most sensitive and specific test was the fluorescamine test: “The best suited protein reagent tested was fluorescamine. While specific for primary amino groups, it has been reported to detect one ng of protein by the generation of a characteristic green fluorescence under long wave UV. Control tests confirmed that it would do so under our test conditions”. I have verified in the scientific literature the quoted sensitivity of this test and its high specificity for the primary amino groups. The conclusion: ” Positive fluorescamine tests were obtained on both the red and golden yellow coated fibrils, on the shards, and on both the orange and brown globs. The fluorescamine tests were definitely negative on ALL fibrils away from blood areas. This includes specifically yellow (body image) fibrils .. Thus, protein is only found associated with ‘blood’ areas and is definitely not present as a ‘pigment binder’ in the body image above the nanogram level”. It is clear that H and A tested fibrils from blood areas, image area and background for primary amino groups which are the basic chemical structure of proteins. There is no protein residue in the background and no protein residue in the image only areas. This alone is sufficient to rule out the “gesso” hypothesis. A “new” paint hypothesis must take into account all the known scientific data. More generally, I see more and more attacks against STURP’ s work by people who obviously did not read their fundamental peer reviewed papers..","date":"2014-12-07","mins":"3:03 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174988","author":"thibault_heimburger","post":"Some comments: Colin: “There’s a serious problem in identifying a red stain as real whole blood, ancient or otherwise, if there’s no strong signal for potassium (or sodium) relative to background.” I’am not sure that you have the Morris and Al. Original paper. On the Shroud they only found Calcium, Iron and Strontium. They found “the excess iron concentration in the foot ‘blood’ region ..above background..” In order to know if this iron concentration is consistent with that of blood, they measured whole blood iron concentrations in a Whatman 42 paper saturated with whole blood. Then they wrote: ” In these measurements [measurements made on the Whatman paper] we also observed potassium in addition to Iron. The K peak intensity was typically at least an order of magnitude smaller than the K alpha. Although no potassium was observed in any of the shroud data, poor signal to noise ratios may preclude definite conclusions on the point”. They did not find potassium in blood shroud areas but with the SAME laboratory apparatus they used in Turin they found a potassium signal “at least an order of magnitude” smaller than that of Fe on a paper saturated with whole blood. This explains their conclusion. The question of potassium in bloodstains versus background on the shroud has nothing to do with the paper in question. David: ““Neither Frache/Modena (negative), nor Mc Crone (negative), nor Adler&Heller (positive), nor Baima Bollone (positive) were scientific archaeologists. No one of them used specific tests for ancient blood that had been warranted by scientific archaeology.” “Is there an archeological study (independent) that had used the Adler&Heller’s methods for detecting ancient blood? Answer: No. A study made by non experts and not replicated by true experts can be conclusive? Answer. No.” Your comment do show that you obviously do not know anything about the problem of “ancient blood”. Seven years ago, I have purchased almost all of the scientific papers regarding “ancient blood”. Sorry, but you simply do not know what you are speaking about..","date":"2014-12-06","mins":"4:53 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-175125","author":"thibault_heimburger","post":"I agree Hugh. But there are several evidence that the shroud is truly a burial sheet. This is the problem..","date":"2014-12-07","mins":"3:12 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-18847","author":"thibault_heimburger","post":"“In his replies to ‘Weaving fan’, Jones missed out using the argument that cotton contamination in the Raes sample shows that the cloth cannot be of European manufacture”; Sorry, this is not true. This is a misunderstanding of what Rogers found and wrote. Raes found “traces” of cotton (Gossypium herbaceum) in one part of his sample. Rogers found the same cotton species in his Raes threads but almost no cotton in his sticky tape samples coming from the main part of the Shroud. He also found many cotton fibers in the 2 small samples coming from the C14 area (“full of cotton”). He found that some Raes threads as well as the C14 pieces of threads he had were “full of cotton fibers” while the main part of the Shroud was (almost) “pure linen”. I found in Raes thread # 7 about 10 20% of cotton fibers mixed with flax fibers (see my paper in shroud.com). The main part of the Shroud seems to have no more than 2% of cotton fibers. Raes # 7 was likely a mixture of cotton/flax fibers. Cotton (G. Herbaceum), although coming from the Midde East was used in Europa in the Middle Ages. The question is not the origin of the cotton but the fact that the Raes/c14 corner is full of cotton while the main part of the Shroud is almost pure linen. This is very important if you want to understand why Rogers thought that the Raes/C14 corner was not representative of the Shroud (the vanillin question being the other argument)..","date":"2012-11-06","mins":"4:37 pm","url":"https://shroudstory.com/2012/11/06/who-is-right-if-you-can-see-through-the-bickering/","cat":"uncategorized","title":"Who is right (if you can see through the bickering)?"},{"id":"comment-18875","author":"thibault_heimburger","post":"You should find the answer here: http://costumedabbler.ca/cotton For a complete study see my paper here: http://www.shroud.com/pdfs/thibaultr7part1.pdf.","date":"2012-11-07","mins":"3:56 pm","url":"https://shroudstory.com/2012/11/06/who-is-right-if-you-can-see-through-the-bickering/","cat":"uncategorized","title":"Who is right (if you can see through the bickering)?"},{"id":"comment-18849","author":"thibault_heimburger","post":"“Does anyone know which side holds the (main) image on the shroud?” The so called “warp side” (because about 75% of the “image side” surface is made up of warp threads)..","date":"2012-11-06","mins":"5:42 pm","url":"https://shroudstory.com/2012/11/06/who-is-right-if-you-can-see-through-the-bickering/","cat":"uncategorized","title":"Who is right (if you can see through the bickering)?"},{"id":"comment-216675","author":"thibault_heimburger","post":"“There can be no forensic analysis of the TS body image. Sorry to repeat myself.” If you mean that forensic analysis needs the analysis of a real body, you are right. Unfortunately, we have only an “image”. Does it mean that this image can not be analyzed by experts in forensic science ? Does it mean that forensic science has de facto nothing to do with the Shroud image ? I don’t think so. The document : http://www.shroud.com/pdfs/marineli.pdf shows that:” the The tibio femoral index, one of the most significant, calculated for the Man of the Shroud (equal to 83% ±3%) is completely compatible with the mean one quoted in bibliography (…), the tibio femoral index measured on three different copies of the Shroud (respectively equal to 115%, 105%, 103% ±4%) showed the incompatibility of the images painted by artists who at that time did not have enough anatomic knowledge”. Strictly speaking, it is not about forensic.However it is important. Another problem for the painting hypothesis. “Yet there is NO obvious imaging of wounds per se, not that I can see at any rate on Shroud Scope, the wound sites being inferred entirely from the location of bloodstains.” I never understood that phrase. What kind of wound imaging would you expect?.","date":"2015-12-16","mins":"3:57 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216604","author":"thibault_heimburger","post":"” there can be no forensic analysis of the TS body image” Really? See for example: http://www.shroud.com/pdfs/marineli.pdf.","date":"2015-12-15","mins":"3:31 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"}]
