[{"id":"comment-96201","author":"thibault_heimburger","post":"Colin is a strange person. On one side, he provides some interesting ideas (although questionable) based on his scientific background. His main purpose is supposed to demonstrate that almost all the previous studies on the Shroud are “pseudo science”. On the other side, he advances a strange proposal about the origin of the TS image based on very very very doubtful connections. This is pseudo (historical) science. I am not interested in Colin’s historical pseudo science. I am interested in his scorch hypothesis. Some months ago, I wrote a paper about the scorch hypothesis: https://shroudofturin.files.wordpress.com/2012/10/scorch paper en.pdf Now, I am writing another paper based on new experiments at fabric, thread and fiber level..","date":"2014-04-03","mins":"3:17 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","title":"Am I the only one?"},{"id":"comment-96854","author":"thibault_heimburger","post":"Thank you Antero, I have nothing to add to your comment. Tomorrow, I’ll send Dan my new pdf paper about the scorch hypothesis based on some new experiments and my final thoughts..","date":"2014-04-05","mins":"3:28 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","title":"Am I the only one?"},{"id":"comment-97182","author":"thibault_heimburger","post":"I am not an expert in ancient textile; That’s true. Rogers himself was not an expert in ancient textile. I never claimed that I am an Thank you Hugh. Yannick wrote: “One thing’s for sure: I KNOW Thibault is NOT an expert in ancient textile and I KNOW he’s not an expert with everything that concern the chemistry of a scorched linen, so I don’t give too much credit to anything that come out of his writings regarding the Raes samples for example or the analysis of the scorch hypothesis proposed by Colin Berry, just like I don’t give too much credit to anything that come out of Fanti’s writings regarding the chemistry and microscopic aspects of the Shroud.” “expert in ancient textile”. It seems that Yannick’s claim is based on my study of Raes 7. The aim of this study was to look at cotton fibers in the sample. I found (like Rogers) much more cotton fibers mixed with flax fibers in the sample than expected. Because I am am not an expert, I sent the samples to true textile experts. These experts confirmed that the cotton fibers I saw were truly (old not modern) cotton fibers. Yannick knows that. I am not an expert in the chemistry of scorched linen. Maybe. But who is an expert? I can say what follows: I performed many experiments with different kinds of scorch. I looked at the results at fabric, thread and fiber level. I wrote the pdf paper. Colin criticized this paper. I am now writing another paper,based on new experiments, taking into account Colin’s critics. Beyond the scorch hypothesis,I think that this new paper will give some interesting questions about the TS body image..","date":"2014-04-06","mins":"4:42 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","title":"Am I the only one?"},{"id":"comment-97684","author":"thibault_heimburger","post":"You want a reply ? This is my final reply about this question. Following your argument, Rogers who was not at all a textile expert, “contributed to hurt the credibility of Shroud science”. Remember that he based some of his most important papers on considerations about the characteristics of the Shroud as a textile. Some of them are true, some are disputable and some are false. As an example of false claims, we know that the growth nodes are in fact “dislocation bands” and that the dark spots at the “growth nodes” are very likely not lignin deposits (contrary to what Rogers wrote). This has been shown by textile experts (SSG documents). Does it mean that Rogers was wrong about anything he wrote. Certainly not. And you Yannick ? What is your field of expertise ? You wrote so many posts about Wilson’s hypothesis without being an historian. So, again, you “contributed to hurt the credibility of Shroud science” (following your argument). Does it mean that your claims, based on the study of the documents are wrong ? Certainly not. You wrote: “Now, if Thibault wants to keep on working on other aspects of the Shroud other than the biological and blood aspects for which he his an expert, so what? That’s his freedom. But he should at least know that, by acting like this, he contribute to hurt the credibility of Shroud science, at least in the eyes of the skeptics (and personally, I don’t think they are wrong by thinking like this)” Please, give me a single comment from an “expert” showing where I am wrong in my (many) previous papers (about Raes 7, Garlaschelli’s experiments, Mc Crone vs Adler, the scorch hypothesis etc…). Regarding my field of expertise, I am not at all an expert in forensic science. I am not an expert in blood chemistry. However I have a 6 months old linen soaked with my own blood (already brown). I’ll look at it. But since several years I have good microscope. I did look at as many textile samples as possible during dozen of hours. For this reason, I consider that my previous as well as my forthcoming observations regarding the scorch hypothesis are reliable..","date":"2014-04-08","mins":"4:12 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","title":"Am I the only one?"},{"id":"comment-11328","author":"thibault_heimburger","post":"I think that some explanations regarding the pcw hypothesis are necessary. The pcw (primary cell wall) is the surface layer of flax fibers. Thickness : about 0.2 0.3 micrometer (typical thickness of flax fibers : 10 20 micrometer). Rogers found that the thickness of the carrier of the color was about 0.2 0.6 micrometer Composition : mainly hemicellulose. Traces of pectin and lignin. The energy necessary to change the chemical properties of hemicellulose (and to color it) is much lower than that of cellulose, the main component of the secondary cell wall (more than 90 % of the thickness of a flax fiber). I repeat : all the facts are consistent with both possibilities. Yannick wrote : For example, can someone give me a solid and credible scientific explanation for the FACT that the ghost and the diimide leave a clean uncolored and undamaged fiber behind ? At first sight, that doesn’t seem to really fit with the idea that the primary cell wall would have been colored instead of a thin layer of impurities on top of the fibers !!! If the color would be in the primary cell wall, then the ghosts would be composed mainly of a dehydrated and oxidized primary cell wall that surely would have left a DAMAGED fiber behind. You understand what I mean ?” First Yannick, the ghosts could not live a clear uncolored and undamaged fiber behind because the “ghosts”, by definition, were not attached to any fiber. Second, I don’t understand your sentence “the ghost and the diimide leave a clean uncolored fiber behind”. Diimide was in fact used by Adler on colored fibers among 21 solvents employed in dye extraction tests. Only hydrazine (very slowly) and diimide (a strong powerful reducing agent) could bleach the yellow color of image fibers. This test only show that the color is not a dye and that the color is only at the surface of the fiber. Rogers wrote clearly :” Up until this time, we had assumed that the image color was a result of chemical changes IN the cellulose of the linen; The most likely change would involve the dehydration of the cellulose to produce conjugated double bonds system. Adler’s observations strongly suggested that the cellulose was not involved in image formation”. If the color is only in the pcw, you’ll find exactly the same result because the pcw is a thin surface layer. The cellulose is not involved. The fact that diimide leaves undamaged fibers behind shows only that it can not destroy or modify the strong cellulosic structure of the secondary cell wall. It is not surprising. But, because diimide is able to bleach the colored fibers, the chromophore carrier is likely a non cellulosic structure at the very surface of the fiber. No more no less. It is the same for all the other properties found by the STURP, Rogers etc..regarding the chemistry of the image. To my knowledge there is no known fact able to distinguish between the 2 possibilities. However the fact is that Rogers never wrote the world primary cell wall. Why ? Here we must remember that he was fascinated by the ( true ) fact that the image appears to be more dense in the dark bands than in the light bands. He thought that the bands seen on the Shroud could be explained if there were more impurities left after washing and bleaching in the dark bands than in the light bands. Therefore everything makes sense : dark bands = thick impurity layer = dense image. ALL the impurity layer hypothesis is based on this hypothesis. But the fact is that this hypothesis is very controversial. For example, many textile experts think that the bands can be explained by the heterogeneity of the density of the threads (something which is often observed in ancient fabrics). Dark bands = more threads = more fibers = more “pcw” = dense image and vice versa. In my opinion, Rogers did not even think about the pcw as a possible color carrier because he found very early a complete reliable hypothesis able to explain all the observed facts. This is human. But recently, on the basis of the description of the pcw by some experts, we found (in SSG) that all the known microscopic, macroscopic and chemical properties could be explained if the image were the result of some kind of dehydration oxydation of the hemicellulose found in the pcw. Both hypotheses are possible but the pcw hypothesis does not necessarily imply the complex process required to explain the impurity layer..","date":"2012-05-13","mins":"4:11 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","title":"Comment of the Week by Thibault Heimburger"},{"id":"comment-11378","author":"thibault_heimburger","post":"I am not the moderator of this blog. But Yannick did use words like “pseudo scientists” , “gang” or …”infamous”. Regarding the JIST (PEER REVIEWED) “infamous” paper (the co authors are Fanti, Botella, Di Lazzaro, Schneider, Svensson and myself), Yannick is completely wrong. He wrote : ” because this paper is clearly an attempt to push the primary cell wall hypothesis and almost tried, at the same time, to discredit Rogers hypothesis, than I consider it as infamous.” and “And because this paper pushed so hard the issue in favor of the primary cell wall hypothesis, it is clearly an attempt to comfort the hypothesis of Fanti about the image formation process, i.e. The corona discharge (because an electric discharge like that can color just the primary cell wall of a fiber, just like UV light also can). This is not true. The only sentence regarding Fanti’s corona discharge is found ( in the discussion part of the paper ) in the sentence: :”Fanti proposed an alternate image formation mechanism based on Corona Discharge that may be able to theoretically explain all the characteristics detected on the TS image, but is not able to reproduce all of them in a laboratory because the intensity of the required energy source is too high”. No more. I would like to participate in this discussions but not on this basis.","date":"2012-05-15","mins":"4:54 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","title":"Comment of the Week by Thibault Heimburger"},{"id":"comment-203990","author":"thibault_heimburger","post":"And now? Now we have another proof that the TS image has not been yet reproduced and remains a challenge. CB: ” Note the relative absence of lateral distortion.” Are you serious ? Lateral distortion is obvious. CB: “Do my imprints respond to 3 D enhancement in Image J?Judge for yourself, dear reader:” I judge: not at all. How is it possible to compare the so called 3 D properties of Colin’s hands with the 3 D properties of the hands of the man of the Shroud? After several years of researches and experiments, Colin, like many others, is unable to create an image similar to the TS image. It is a fact. Yes, the TS image is an imprint, not a paint. But this imprint is very special. A direct imprint (no contact, no color) seems to be unable to explain the entire TS image. Some kind of “action at a distance” seems necessary. Nickell, Allen, Mc Crone, Pesce,Garlascelli and many others and now Colin: all of them failed to reproduce the properties of the TS image. No: the mystery has not been solved (even in principle)...","date":"2015-06-28","mins":"3:35 pm","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","title":"Extreme Blogging"},{"id":"comment-201426","author":"thibault_heimburger","post":"“Hugh F carried out a number of tests in the hope of getting at least some blurry results from the decompostion of mice. Various treatments of cloth were tried, and the mice kept in a warm incubator. Sadly, although putrescine and cadaverine were very much in evidence after a few days, none of the cloths or their coatings discoloured at all. Putting them in an oven for a few hours produced irregular discolouraton, but not sufficient to relate the discolouration to the shape of the mice. All rather a damp squib, I’m afraid!” Hugh, where can we find a report of your experiments?.","date":"2015-06-09","mins":"3:08 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-201510","author":"thibault_heimburger","post":"Hugh: “Message for Thibault: I have found a scientific study done on poultry carcasses that proves that putrescine and cadaverine molécules are normally produced within the first day following death and the level increase just before the start of active decay. Of course, the study wasn’t done on a human corpse, but nevertheless, this is very interesting.” Can you give me the references ? Thanks..","date":"2015-06-10","mins":"3:15 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-191223","author":"thibault_heimburger","post":"It is true that, up to now, no 3:1 herringbone (which is not technically similar to 2:1 or 4:1 according to Vial), Z spun, large linen fabric from the Roman period has been found in the Palestinian area. Nevertheless, several fabrics have been found in this area or neighboring countries which have one or two of these fundamental characteristics. – Long and large fabrics. Like the TS we have many examples of fabrics woven “by the kilometer”. – Z twist: it is true that it is not characteristic of the Palestinian area, nevertheless “although quite rarely, LINEN threads with a Z TWIST have been mentioned at Palmyra and in the Judean Desert” (G. Vial with references). – The 3:1 herringbone twill: Damask cloth, for example those of Palmyra, Treves, Conthey, Ribeauville, cologne, Holborough are ‘derivatives’ of 3:1 twill butt they are in silk. Diana Fulbright’s paper (thanks OK) is also interesting: http://www.acheiropoietos.info/proceedings/Fulbright Akeldama Web.pdf My Conclusion: although we have to my knowledge no example of a cloth (or a shroud) from the first century in the Middle East with ALL of the characteristics of the TS, we can infer from the archaeological findings that there is no technical reason to rule out the TS as a first century fabric. Taking into account the technical characteristics, it was possible to make it in the first century CE, and taking into account the fact that Middle east (including Jerusalem) was, during the Roman period, a crossroads of trade, I conclude that there is no technical nor historical reason to rule out the TS as an imported fine linen cloth (from Palmyra or Greece or Italy…). On the other side, there are, up to now (to my knowledge), only two documented 3:1 linen herringbone from the medieval period. The first one is cited by Vial: ” The only herringbone in linen so far analysed and published is that cited in note 10. It is very LATE SECOND HALF OF THE 16 TH century and much simpler than that of Turin. The number of threads per centimeters in its main warp is practically half of the Turin count ..” It is a painting of the”last supper” (attributed to Martin de Vos) on linen with a 3:1 herringbone. And the Victoria & Albert (V&A) Museum cloth [ref. No. No. 7027 1860]. (1350 1400) http://collections.vam.ac.uk/item/O129528/printed linen unknown/ Searching for “linen textile”, “herringbone” etc ..on the search engine of the V&A museum, I could not find any kind of European medieval linen fabric similar to that of the the TS (except that quoted above) Undoubtedly, from a technical point of view, a medieval forger could make a 3:1 linen fabric in order to use it as a ‘ground’ for painting etc. But the fact is that we have only one example and this example has nothing to do with the TS (block printed linen etc.). How is it that we have no example of a medieval painting on a 3:1 herringbone linen sheet? I would like to quote G. Vial: ” If one takes into account the three constitutive elements of a textile the structure, the primary material, and the reductions of warp and weft one must acknowledge that the Shroud of Turin is truly ‘incomparable’.”.","date":"2015-02-16","mins":"5:24 pm","url":"https://shroudstory.com/2015/02/16/important-comment/","cat":"comments_promoted","title":"Important Comment"},{"id":"comment-88376","author":"thibault_heimburger","post":"Look at: http://shroudofturinwithoutallthehype.wordpress.com/2014/03/13/after 2 years and over 200 postings i think ive finally cracked it the enigma of the shroud of turin/ So, Colin finally “cracked” the enigma of the Shroud. He now can explain all of the properties of the Shroud image, i.e superficiality at fiber and thread/fabric level, half tone etc… Most of his claims are based on theoretical hypotheses. However, I think that CB’s claims has to be considered seriously. What do we need ? We need some experiments. I can perform some experiments..","date":"2014-03-13","mins":"4:38 pm","url":"https://shroudstory.com/2014/03/06/hit-and-run-trolling-and-a-whole-lot-more/","cat":"other_blogs","title":"Hit and Run Trolling and a Whole Lot More"},{"id":"comment-134936","author":"thibault_heimburger","post":"Colin is a specialist in introducing good questions into a joke. I like it. The joke is (from Colin): ‘the TS face having a “pressed against glass” look about it’, so that the beard and mustaches could be artifacts of ‘impactography’. If mustache and beard were artifacts created by impact, we should see the nose completely crushed/flattened. It is obviously not. But the only interesting question is: ‘Come to think of it, why is it not possible to differentiate between hair and skin on the TS image? Why is there no ‘strandedness’ to the hair?’ I do not understand the term ‘strandedness’. Colin and others, can you give us more insight about this problem ? In other words: why is it necessary for the hair (or mustache, or beard) to leave an image different from the image of the skin?.","date":"2014-07-02","mins":"3:13 pm","url":"https://shroudstory.com/2014/07/02/is-the-beard-of-the-man-of-the-shroud-an-impactogram/","cat":"other_blogs","title":"Is the beard of the man of the shroud an impactogram?"},{"id":"comment-54220","author":"thibault_heimburger","post":"“Scientific truth” is not a univocal term. It strongly depends on the matter (subject). I have to think about that. But, reading the comments above, I can’t avoid to think to my own medical practice. At the first look, it seems to me that ” Shroud science” has something to do with the medical reasoning. Medicine is not a science but it is related to “science” through the “Evidence based medicine”. There are several links between the study of the shroud and Medicine. More later..perhaps..","date":"2013-11-30","mins":"6:19 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","title":"It may not suit the scientific mind-set"},{"id":"comment-3136","author":"thibault_heimburger","post":"Colin, What does “MSM” and “PR” mean ? Who are these “MSM journalists” ? You wrote: “3. Mickey Mouse scientists who resort to naive or rigged experiments in an attempt to dismiss the Shroud image as a thermal imprint(” scorch”) , who fail to distinguish between a newly formed scorch OR an ancient one that has been subject to natural or accelerated ageing.” Give me the proof ! Natural or accelerated ageing of a scorch image can’t explain the properties of the Shroud image we see today. I am waiting for your experiments (accelerating ageing needs only an oven)..","date":"2014-02-26","mins":"10:37 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2014/02/26/mickey-mouse-science-now-in-the-cross-hairs/","cat":"medieval_forgery","title":"Mickey Mouse science now in the crosshairs."},{"id":"comment-96561","author":"thibault_heimburger","post":"Hi Hugh, I don’t understand the sentence: ” However, after asking around, I find that people who keep snakes as pets feed them on frozen mice, which are available quite cheaply in bulk. This looks promising, so I’m preparing an appropriate protocol for just the experiments you suggest!” Snakes, mice ?? Can you describe your protocol ?.","date":"2014-04-04","mins":"3:40 pm","url":"https://shroudstory.com/2014/04/04/let-the-experiments-begin/","cat":"comments_promoted","title":"Let the Experiments Begin"},{"id":"comment-191060","author":"thibault_heimburger","post":"The strategy of Colin is to destroy this blog. Sadly, Thibault..","date":"2015-02-14","mins":"4:36 pm","url":"https://shroudstory.com/2015/02/14/on-deaf-ears-here/","cat":"other_blogs","title":"On Deaf Ears Here?"},{"id":"comment-6680","author":"thibault_heimburger","post":"Colin, About negativity. It seems to me that we do not have the same definition. Je suis désolé mais je dois m’exprimer en français car les choses sont subtiles. La photographie (positif) de l’image du Linceul au niveau du visage est facilement reconnue comme celle d’un visage (à une certaine distance) MALGRE les contradictions évidentes avec notre expérience quotidienne d’un visage humain. C’est ainsi que travaille notre cerveau: tenter à tout prix de donner du sens à ce que nous voyons. Au contraire, le négatif de la photographie de l’image du Linceul restitue naturellement une image qui est totalement en accord avec notre expérience quotidienne d’un visage humain véritable. Notre cerveau n’a pas besoin de donner du sens à ce que nous voyons: le sens est immédiat. Il est vraiment dommage que je ne puisse pas poster des images sur votre blog pour montrer celà. Pour l’instant, je ne vois pas celà dans les différentes images de vos expériences. En d’autres termes, je n’y vois pas la négativité (au sens de l’image du Linceul). Il est possible que celà soit du à la petite taille de vos modèles. Pourquoi ne pas utiliser un modèle de grande taille ?.","date":"2016-01-07","mins":"9:35 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/07/who-says-science-cant-explain-the-shroud-of-turin/","cat":"latest_research,","title":"Who says science can’t explain the Shroud of Turin?"}]
