[{"id":"comment-164690","author":"thibault_heimburger","post":"Charles, I have your article. Some comments posted here are regrettable. I’ll post tomorrow my own critic of your paper..","date":"2014-10-22","mins":"3:49 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-164966","author":"thibault_heimburger","post":"My thoughts about Charles’paper. FIRST PART. 1) “No one appears to have investigated the kinds of loom, ancient or medieval, on which a cloth of this size may have been woven” All the textile experts discussed this point and the kind of loom with which the TS has been woven is consistent with an ancient origin. The size is not at all a problem. 2) The 1613 Tempesta engraving. As Charles wrote it shows several features very different from what we see today on the TS: the Crown of thorns, the loincloth etc. There are other obvious features Charles failed to comment. For example, the fact that the shoulders of the TS man are visible on the engraving despite the fact that after the 1532 fire, the shoulders were missing. It’s enough to conclude that this engraving can not be the exact reproduction of the Shroud in 1613. The same is true for many reproductions of the Shroud. There are even post 1532 paintings that do not show the marks of the fire! See: http://www.shroud.com/pdfs/ssi12part4.pdf When Charles writes: “Texts describing the Shroud confirm the accuracy of the Tempera engraving”, I ask: show the texts. 3) Charles basic hypothesis is that the reproductions of the TS were accurate. More precisely the loincloth which was not present in the previous reproductions of the shroud has been painted ON the Shroud after the Council of Trent in 1563 and then disappeared with time. This is not true. There are at least two dated reproductions made AFTER the Council of Trent showing absolutely NO loincloth. See the 1643 Rome painting and the 1634 Moncalieri painting in: http://www.shroud.com/pdfs/ssi12part4.pdf There is also at least one post 1563 painting without evidence of a loincloth: the 1571 Alcoy painting. 4) The other features are also very variable. The crown of thorns is obvious in some paintings, not clearly seen in others and absent in the 1652 Naples reproduction. The “blood belt” is not seen in most of the paintings (or perhaps included in the loincloth), or depicted as a chain, or clearly shown as blood in the 1634 Moncalieri painting. The image seems to be painted as a faint image in the 1634 and 1643 paintings, more or less faint in the 1516 Lier painting as well as in the 1571 Alloy, 1653 Cuneo and 1678 imperia paintings while in many other pictures it is not faint at all. Conclusion: The reproductions of the Shroud are very variable. Obviously, none of them can be seen as accurate representations of the Shroud whatever the epoch. Regarding the loincloth, it is possible that the 1563 Council of Trent plaid a role in the REPRESENTATIONS of the TS image. In any case, the fact that there are some paintings made before 1563 with a loincloth and some paintings made after 1563 without a loincloth shows that the loincloth could not have been painted on the Shroud because of the Council. Interestingly, when there is a loincloth, it is generally painted on the buttocks but not on the front (except for the 1653 Cuneo reproduction). This strongly suggests that the loincloth was an interpretation of the more or less rectangular area of the buttock’s image. The loincloth can not have been painted on the shroud itself. More later..","date":"2014-10-23","mins":"5:13 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163553","author":"thibault_heimburger","post":"I fully agree Hugh, The “off on off loincloth” is just one of the many details of Charles’ paper. There are some errors in Charles’paper but this paper must be read carefully. At the first look, it seems that Charles has shown that the painted copies of the Shroud are very different, depending on the historical period. I think there is no better demonstration that those paintings were NOT actual reproductions of the Shroud in the past..","date":"2014-10-18","mins":"3:27 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-115627","author":"thibault_heimburger","post":"I have this paper. I have to say that I am not convinced. However, there is something very interesting based on the infra red picture that clearly shows a difference between the right and the left orbit. Looking at the IR picture, the “right eye retraction” is obvious. Dan, can you show this IR picture ? I do not think that it comes from a Claude Bernard Horner (CBH) syndrome. I don’t think that the retraction (pseudo enophtalmos) can occur so quickly in the case of CBH syndrome in a traumatic context (maybe I am wrong). However, enophtalmos (eye retraction) can occur immediately in the case of fracture of the jugal (or zygomatic) bone. This is basic medicine. On the TS we have an extraordinary consistent set of proofs: the oedema of the right cheekbone, the right eye retraction (IR image) and the fracture of the nose..","date":"2014-05-09","mins":"4:53 pm","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","title":"Breaking News:  New Injury Details Seen on the Shroud of Turin"},{"id":"comment-204874","author":"thibault_heimburger","post":"I agree. The “very core” of the Christian faith was, is and remains the Resurrection. The empty tomb is just a sign. The faith is based and only based on the testimony of the apostles: the “appearances” of Jesus after his death. The key point, from a historical point of view, is connected to the historical fact that something new, unexpected, happened after the death of Jesus. This “something” is unique in the History. Those who were in despair, suddenly confessed Jesus as “Christ”, “Lord” (in the context, this can only mean “God”), and “Son of God”..","date":"2015-07-07","mins":"3:34 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","title":"Christian Faith Eroded to the Very Core?"},{"id":"comment-166678","author":"thibault_heimburger","post":"Charles wrote: “Medieval gesso as found north of the Alps was a mixture of calcium carbonate and rabbit skin glue ( collagen) although different mixes were possible. Once the surface of the Shroud came under pressure , the gesso would have fallen outwards not inwards.” Absolutely no collagen/protein (even at nanogram to picogram level) has been found on fibers from the background or from the image (highly sensitive fluorescamine test by Heller and Adler). No collagen/protein binder=no gesso. There are many possible explanations for calcium being more or less present in all parts of the Shroud. It is not an evidence for gesso or anything else. Lack of collagen/protein IS an evidence against the gesso hypothesis. Charles wrote: ” When I submitted all the so – called blood reports I could find to a Professor of Physiology he read them and said he was totally unconvinced that this was blood but more indicative of collagen.” I wonder what are these “so called blood reports”. Particularly, I would like to know how a collagen based paint could match the immunological tests performed on the blood? More tomorrow..","date":"2014-10-29","mins":"5:10 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-198657","author":"thibault_heimburger","post":"I have to admit that Colin’s work is very interesting. In fact, it is the best work (still in progress) I ever seen, based on the “chemical imprint” hypothesis. The fact is that the TS image is an “imprint”, not a paint, is obvious. The fact that the TS image is a contact only imprint rather than a contact+non contact imprint is still undecidable. Hopefully, at the end, we will see if the best contact only hypothesis (the “chemical imprint”) can match or not at least the macro properties of the TS image. Colin wrote (see his blog): “The task: produce a contact image that could be claimed to be that left by the crucified Jesus on Joseph of Arimathea’s ‘fine linen’. Not only that. The TS IS such an image. But this image has some fundamental properties. So, we will see. Sincerely, good luck..","date":"2015-05-08","mins":"4:52 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198224","author":"thibault_heimburger","post":"Back from Turin. As in 2010, it was a wonderful experience. Colin: “Maybe we need an updated checklist.” of the defining details, the “details” that any kind of model must share with the TS. Yes, we need it otherwise we could discuss endless. In this discussion, we have to face at least two challenges. 1) The image is necessarily the result of the interaction between the Body Image Formation (BIF) Process and the linen. 2) The effect of ageing. There are some properties of the image which are directly related to the BIF process: negativity, superficiality at fabric and thread level, 3 D properties. In my opinion we can add: high resolution, fuzziness of the contours, “no patch” (the image is continuous in a given image area at macro level). But there are also some properties for which point 1) and or point 2) could be more or less important (or not): – The banding effect – Narrow range of optical densities – No saturation, no “hot point” – Faintness – Half tone – Discontinuities at micro level – Superficiality at fiber level – Mechanical weakening of entire image bearing fibres – …. In other words, is it possible to find a rational method to decide that a given model is compatible with the TS image (or not), taking into account Points 1 and 2 ?.","date":"2015-05-03","mins":"4:24 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198222","author":"thibault_heimburger","post":"Dan, I have just posted a comment in this thread but it does not appear ??.","date":"2015-05-03","mins":"4:11 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198223","author":"thibault_heimburger","post":"Dan, I have just posted a comment in this thread but it does not appear ?? Trying again, I got: “Duplicate comment detected; it looks as though you’ve already said that!”.","date":"2015-05-03","mins":"4:15 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198220","author":"thibault_heimburger","post":"Back from Turin. As in 2010, it was a wonderful experience. Colin: “Maybe we need an updated checklist.” of the defining details, the “details” that any kind of model must share with the TS. Yes, we need it otherwise we could discuss endless. In this discussion, we have to face at least two challenges. 1) The image is necessarily the result of the interaction between the Body Image Formation (BIF) Process and the linen. 2) The effect of ageing. There are some properties of the image which are directly related to the BIF process: negativity, superficiality at fabric and thread level, 3 D properties. In my opinion we can add: high resolution, fuzziness of the contours, “no patch” (the image is continuous in a given image area at macro level). But there are also some properties for which point 1) and or point 2) could be more or less important (or not): – The banding effect – Narrow range of optical densities – No saturation, no “hot point” – Faintness – Half tone – Discontinuities at micro level – Superficiality at fiber level – Mechanical weakening of entire image bearing fibres – …. In other words, is it possible to find a rational method to decide that a given model is compatible with the TS image (or not), taking into account Points 1 and 2 ?.","date":"2015-05-03","mins":"3:56 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198300","author":"thibault_heimburger","post":"Miraculously my lost comment is here above. Since the subject is the “details”, I would be very interested in your answer to the question at the end of my post. Thanks..","date":"2015-05-04","mins":"1:50 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198413","author":"thibault_heimburger","post":"From a non expert. Hugh wrote: “Well, there’s a challenge then. Practically the entire classical corpus is available on the internet, so can Max or daveb find one single instance of depingere meaning to copy? That whole canard is a red herring. (I bet that’s difficult to translate into French!)” Depingere. In French we have the verb “peindre”: to paint and the verb “dépeindre”: to depict, to picture, to describe. Very different from “to copy”. The preposition “de” does not necessarily mean “from”. It seems that it is the same for Latin, including medieval Latin. See for example: http://gallicalabs.bnf.fr/ark:/12148/bpt6k6219058z/f248.zoom.r=depingere ” Depingere: Ce verbe est utilisé dans l’antiquité et au Moyen Âge à des reproductions par la mosaïque, le tissage des étofes et les émaux” My translation: “Depingere: this verb was used in ancient times and in the Middle Ages for reproductions using mosaics …” In this context, the term “reproductions” (in French) does not mean a copy but a product able to represent something. I agree with Hugh. Depingere does not mean “to copy”..","date":"2015-05-05","mins":"3:27 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-208437","author":"thibault_heimburger","post":"Colin, I have seen: https://shroudofturinwithoutallthehype.wordpress.com/2015/08/17/is the shroud of turin really just 18 years short of its 2000th birthday see this blog for a daily acerbic overview of current wrangling currently 2015 week 34/ Now you are proposing a new model, namely white flour onto WET linen. Why ? Do you realize that some people (like me) are simply unable to follow you ? A given model has to be studied in depth before switching to another one..","date":"2015-08-17","mins":"2:39 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-208513","author":"thibault_heimburger","post":"Thanks Colin, When I wrote that it’s difficult to follow you, I had in mind three things: – Your blog(s): you have now 3 blogs. “science buzz”, “shroudofturinwithoutallthehype.wordpress.com” and the last one ( I don’t have it in my bookmarks). Your thoughts, experiments, comments etc. Are scattered in both (first) blogs so that it is (and it was) difficult to follow you. – Your posts are long and contain many digressions so that it’s difficult for me to extract the important things. Please, remember I am French. By the way, English was not the first foreign language I studied at school. It was German. – Anyway, you are jumping from a given model to another ( scorch, nitric acid, flour/water paste, dry flour) without explanation..","date":"2015-08-18","mins":"2:49 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-208382","author":"thibault_heimburger","post":"Look at Colin’s site https://shroudofturinwithoutallthehype.wordpress.com/2015/08/13/is the shroud of turin really just 18 years short of its 2000th birthday see this blog for a daily acerbic overview of current wrangling currently 2015 week 33/ Topic 6. As he wrote: “Here comes the crucial test of the new model: how do my linen fibres compare with those of the Turin “Shroud” under a low power light microscope?” Great ! His first photograph looks promising. Of course, we need much more. Thanks in advance Colin..","date":"2015-08-16","mins":"4:30 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-208442","author":"thibault_heimburger","post":"Colin, OK. I understand. However it’s very difficult to follow you..","date":"2015-08-17","mins":"4:05 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-197568","author":"thibault_heimburger","post":"“Hgh: Do you really believe that a team of experts in testing blood (1969) don’t were aware that their experiment failed in such a primary variable? The problem of the tests in 1969 and 1978 was other and the same. No specific test for ancient blood was made.” Hugh is true. David, please read honestly the conclusions of this commission. Can you understand that there was, at the time, no specific test test for centuries old blood. It seems that you are aware of “specific tests for ancient blood”. I would like to know something about those ‘specific tests for ancient blood’ ???.","date":"2015-04-25","mins":"3:48 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197664","author":"thibault_heimburger","post":"” So, assuming that they have not lost or destroyed their precious tapes, why have STURP never had their tests replicated? They cannot expect to be taken seriously as experts if they do not.” Charles, those precious tapes were very small in size (5 cm2). Remember that all the tapes were first given to Mc Crone who “nearly destroyed the value of the carefully prepared samples” (Rogers). This was the first disaster. Then, most of the samples were given to Adler and Heller, who made the best job, given the condition of the samples and their means. Do you know the extraordinary difficulty of Adler’s work ? Finally, after Adler’s death, all of his samples were sent back to Turin by his wife. This was the second disaster. Do you understand now why the tests could not be replicated? What is extraordinary is the fact that STURP could nevertheless give so many reliable data that are even today the basis of any scientific study of the TS..","date":"2015-04-26","mins":"2:54 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-213174","author":"thibault_heimburger","post":"Hugh, you wrote here: “On the first two pages, it is claimed that removing weave and banding by FFT makes the Shroud face look wider and more realistic” And then: ” actually, it looks wider because the image itself has inadvertently been stretched sideways so it really is wider”. This second sentence seems to be very strange. Can you explain in detail (yes I know: this has to do with your interpretation of the banding effect). Thanks..","date":"2015-10-20","mins":"2:27 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-194723","author":"thibault_heimburger","post":"Yes Dan: “And didn’t Sam Pellicori discover that fibers inside a blood soaked thread were brown while the fibers on the outside were red?” Where does it come from ? I now disagree with Adler’s ‘bilirubin hypothesis’. There are many reasons, the first being, as Hugh wrote, that ‘mixing orange bilirubin with brown methemoglobin’ can not be made red or pink. The second one is explained in: http://www.academicjournals.org/article/article1380797458 Svensson%20and%20 Heimburger.pdf: ‘However, a recent experiment (Svensson, 2010) demonstrates that, after four months, no detectable difference in color could be found between normal blood and blood with very high levels of bilirubin.’ The third reason is that this hypothesis has been studied in depth by van der Hoeven in: https://www.academia.edu/8431835/Authentic acid blood mordanted the madder dyed Shroud of Turin pinkish red before image formation   Jesus was dead This is an extraordinary interesting paper. We may agree or not with her conclusions, but there are some interesting information about the ‘bilirubin hypothesis’. There is no doubt that the bloodstains are truly bloodstains. Why are those bloodstains too red/pink? It is a problem that has not been resolved today, but the ‘bilirubin hypothesis’ is no more reliable. There are many other hypotheses (Saponaria, post mortem acid heme madder lake on madder and starch coated Shroud…)..","date":"2015-03-28","mins":"4:05 pm","url":"https://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/","cat":"article","title":"Is Bilirubin Still Accepted as an Explanation for the Red Blood?"},{"id":"comment-208174","author":"thibault_heimburger","post":"Colin: “Back now to preparing the first instalment of a new weekly posting, addressing the claim from a certain over prescriptive, over dogmatic MD that my current images fail to respond to 3 D rendering programs. Is he not aware that all inputs into Image J give a little 3 D response whether one wants it or not (based on the non zero default setting for z, the vertical axis)? One has only to input 2 D diagrams with no 3 D history to see the truth of what I’m saying.Take away message – always incorporate an internal 2 D marker when using Image J.” This “over dogmatic MD” knows since many months or years that any kind of 2 D input gives a 3 D response using Image J. This is is the problem, not the solution.. I will explain that in detail after your instalment..","date":"2015-08-13","mins":"1:38 pm","url":"https://shroudstory.com/2015/08/05/scientist-barrie-schwortz/","cat":"article","title":"Scientist Barrie Schwortz"},{"id":"comment-213277","author":"thibault_heimburger","post":"Hugh: ” It is OK’s contention that by removing the alleged bands on either side of the face, the image would appear broader, and more realistic, even if the image was in fact the same size. By stretching the second image, the truth of his contention cannot be ascertained. His caption:”What can be seen at first glance is that the right one is much broader” is true because it has been stretched widthwise, not because of the removal of the bands.” No Hugh, OK is right about that. Just download the two pictures and give them the same dimensions. You will see that the FFT second image is truly broader and more “realistic” than the first one. The banding effect is real. The fact that the TS image appears much more “realistic” after removal of the bands (no additional input of information) is true and is not clearly explained..","date":"2015-10-21","mins":"2:38 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-213513","author":"thibault_heimburger","post":"Thanks Hugh, About the banding effect. I have read again your pdf https://shroudofturin.files.wordpress.com/2014/08/banding.pdf You have shown that the bands are closely related to the weave structure of the cloth: “However, regular bands of very slight difference in colour do seem apparent, coinciding with the change of pitch of the herringbone weave”, and “Once again, we can see that the darker shadows below the ‘bottom left to top right’ pitch make those bands slightly darker than the ‘top left to bottom right’ bands”. The first part of your conclusion: “The weave of the cloth does produce the illusion of bands according to its illumination, which serve to enhance a viewer’s perception of the intensity of the image at various places, and give the illusion of over defined dark and light bands in various places( ..)” is consistent with your demonstration. But then you jump to another conclusion: “So the light vertical areas defining the sides of the cheeks are really present, (…) and are not merely artifacts of the cloth, but real areas where the image making process just didn’t happen”. I don’t understand how, starting from your observations, you can conclude that there is no image in those areas..","date":"2015-10-24","mins":"1:39 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-208275","author":"thibault_heimburger","post":"Colin, I am tired, REALLY TIRED, of your comments about ME on your blog. ” Dr.Persistently Negative” ” he who dishes out his “science” as if medicine to treat disease” ” …Because his negative nitpicking, from countless sniping and indeed hostile comments ..” “Here’s Dr.Negative’s response to Topic 1 below: “Once again, I disapprove strongly of the way he uses and abuses Dan Porter”s site. He’s been allowed to use it as a permanent billboard for two pdfs (see margin) specifically attacking my ideas over a long period of time, with no facility there for responding to his haughty criticism, the latter based for the most part on some poorly designed experiments” And much more … You ( Colin) suggested a new model for the TS image. You (Colin) have shown the results of some experiments based on this model. OK. Looking at your results, I think that they do not match some of the most important properties of the TS image. Shame on me !!!! If you don’t accept any kind of criticism, please forget me. However, I have seen your new post on your site. My comments later. But remember that my critical comments are not ” hostile comments”..","date":"2015-08-14","mins":"2:43 pm","url":"https://shroudstory.com/2015/08/05/scientist-barrie-schwortz/","cat":"article","title":"Scientist Barrie Schwortz"},{"id":"comment-190733","author":"thibault_heimburger","post":"It seems to me that our friend Colin now has some kind of aphasia ; )) Nevertheless,I like particularly the picture of Kim Kadarshian (please don’t tell that to my wife!). Colin, I’ll be in London the next week for 2 (perhaps 3) days with my wife and my son. Some suggestions ?.","date":"2015-02-11","mins":"4:27 pm","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-190969","author":"thibault_heimburger","post":"This paper is not serious I’ll probably will not waste my time to comment it in detail. Just read the first sentences: ” Archaeology and History The linen threads of the Shroud have a twisting opposite to that in use in Israel at the time of Jesus ” Just look at the picture of the 1st century burial shroud found in Jerusalem by Shimon Gibson: http://www.dailymail.co.uk/news/article 1236161/First burial shroud carbon dated time Christs crucifixion caves near Jerusalem.html The twist is clearly a z twist (just like the shroud). Although Gibson is completely wrong when he wrote that his “Burial cloth found in Jerusalem cave casts doubt on authenticity of Turin Shroud”, the point is that we can find at least one first century Z twisted burial shroud in Jerusalem. “this twisting, however, is the same that was used in Europe in the Middle Ages”. I would like to see the references. “Then the shroud is not a fabric produced in Palestine at the time of Jesus”. But who said that the all of the burial shrouds used in Jerusalem at the time of Christ were produced in Palestine ? In fact, according to Gibson himself in the National geographic article (see: http://theshroudofturin.blogspot.fr/2009 12 01 archive.html) about his Jerusalem shroud which does contain wool: “The way the wool in the shroud was spun indicates it had been imported from elsewhere in the Mediterranean – something a wealthy Jerusalem family from this period would likely have done.” How can the authors provide any kind of definitive conclusion based on textile studies if none of the textile experts (G.Raes, G.Vial, F. Testore, Mrs. Flury Lemberg,John Tyrer) were able to rule out the TS as a first century textile from the Mediterranean area ?.","date":"2015-02-13","mins":"5:49 pm","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-191134","author":"thibault_heimburger","post":"“Does anyone here claim that there was other cotton in the Oxford sample that was missed by the lab?” Yes, it is truly possible. I know that it is difficult to understand. But, I have personally seen that. Http://www.shroud.com/pdfs/thibaultr7part1.pdf When I looked at Raes#7 for the first time with my microscope, I could not see cotton fibers. Raes#7 appeared to be entirely made of flax It was only when I decided to “dissect” this piece that I found many cotton fibers mixed with flax fibers. Most of the cotton fibers were at the surface of the thread but some of them were also found in the core of the thread, eliminating a ‘contamination’. Oxford did not make this kind of analysis. My own findings are truly consistent with Rogers’s findings..","date":"2015-02-15","mins":"2:59 pm","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-29331","author":"thibault_heimburger","post":"Who has Fanti’s book ? Thibault..","date":"2013-04-04","mins":"12:31 pm","url":"https://shroudstory.com/2013/04/04/a-critical-review-of-giulio-fantis-new-book-unreliable-results-because-of-inadequacy-of-methods/","cat":"books","title":"A Critical Review of Giulio Fanti’s New Book:   Unreliable Results Because of Inadequacy of Methods"},{"id":"comment-199224","author":"thibault_heimburger","post":"Colin: ” The crucial point surely is that there is no imaging of “wounds” or “injuries” as such on the sepia body image of the TS – absolutely none. The evidence for “wounds” and “injuries” rests entirely on the position of bloodstains at various locations. Even the “scourge marks” showing the dumb bell shapes etc of skin lacerating or indenting metal or bone tips are (we’re told) solely blood imprints – there’s no corroborating evidence in the body image.” I never understood what you mean by “imaging of wounds …” What do you expect to see on a linen on contact with a bloody wound? I would expect to see exactly what we see on the TS. Can you explain? To all: Does it exist a medieval painting depicting blood flows similar to that seen on the TS, like the “epsilon” blood stain, the other bloodstains on the face, the “lance wound” bloodstain etc….","date":"2015-05-15","mins":"2:10 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","title":"Too Great to Be a Work of Art"},{"id":"comment-29358","author":"thibault_heimburger","post":"Giorgio, Rinaldi wrote exactly: (see his text): “He [Fanti] did not have a piece of fabric, or even pieces of intact thread. He used a dust collection made by Giovanni Riggi di Numana in 1978.” Before discussing anything, I/we need the answer to my question. Rinaldi, are you here ? Do you confirm that Fanti did not use “even pieces of intact thread” ?.","date":"2013-04-04","mins":"2:46 pm","url":"https://shroudstory.com/2013/04/04/a-critical-review-of-giulio-fantis-new-book-unreliable-results-because-of-inadequacy-of-methods/","cat":"books","title":"A Critical Review of Giulio Fanti’s New Book:   Unreliable Results Because of Inadequacy of Methods"},{"id":"comment-84183","author":"thibault_heimburger","post":"Mike M; (# 109): ” If convection can produce this much of laminarity and image resolution it should be very easy to prove. Did Vignon succeed in producing an image from his experiments? The same with the pig experiment in the smithsonian documentary. Didn’t produce any image, just discoloration.” Not so easy to prove. The Smithsonian documentary proves that a discoloration occurred. To choose a pig was a good idea since pigs are (for good reasons) generally chosen to simulate human bodies. Unfortunately, the design of the experiment does not allow any kind of conclusion regarding resolution. I tried to obtain the linen sheets to look at the properties of the discoloration but unfortunately the answer was that the sheets were destroyed because of safety (bio hazard) In any case, this experiment seems to show that a chemical reaction can occur between a fresh cadaver and a linen sheet via probably a Maillard reaction. The problem of resolution is much more complex. Re read carefully what Rogers himself wrote: https://shroudofturin.files.wordpress.com/2012/08/rogers maillard reaction for dan blog 2.pdf.","date":"2014-03-02","mins":"4:50 pm","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"id":"comment-83527","author":"thibault_heimburger","post":"Hugh Farey : Oh, tut. My own attitude is not at all fudgelike, as I hope is clear in my Feb 28, 12:04 pm comment above. I just wanted to compare and contrast, as it were, the extremes on either side. Oh and, was I ever associated with Barrie Schwortz’s site, that I must disasociate myself from it? Actually I think, and so surely must you, that’s it’s absolutely invaluable in terms of its comprehensive coverage of just about everything anybody’s ever said about the shroud, even the hostiles! It even has my article criticising the Quad Mosaic images, which I know must have caused some pain. By very much endorsing the site I don’t mean I agree with Barrie’s conviction that the shroud is authentic, but I do think he and I, and Dan, if it comes to that, have arrived at our own opinions in the same way, but reading and researching everything we could, and coming to a personal opinion. We all agree that that we may be wrong, and we none of us rubbish those who have formed contrary opinions, even if they seem to be based on nothing more than a cursory glance at a magazine article, or are so peculiar as to make us privately doubt the author’s sanity. We three are, in fact, jolly decent chaps and I commend us to anybody interested in the shroud if they want to understand the controversy rather than just be told what to think. As for the scorch hypothesis, it’s that damned fluorescence (rather than the superficiality) which made me lose faith in it. I haven’t yet carried out your LOTTO process, but it’s definitely in the pipeline, and if we lose the fluorescence I shall be filled with renewed heat scorch (as opposed to chemical scorch) enthusiasm again. Hugh, I fully agree with you (except for the Quad Mosaic, that I am currently studying in depth). Colin provided another scorch hypothesis, namely the LOTTO process which can be easily tested. I am still waiting for his experiments. Since Colin is now far away from science (see his blog), you are the only one who can test his hypothesis. The fluorescence problem is just one of the problems but not the only one. We should work together on the LOTTO process. You have my email address..","date":"2014-02-28","mins":"5:06 pm","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"id":"comment-29350","author":"thibault_heimburger","post":"There were several reasons for me to ask you : “who has Fanti’s book ?” Of course, Rinaldi has the book. The main reason is as follows: reading Hugh’s translation of Rinaldi’s critical review, I understand (but I am wrong ?) that Fanti did perform his experiments ONLY on “TS” fibers coming from the DUST taken by Riggi. On the other side, I read on Barrie’s site this sentence from Fanti (?): “”But in 1988, Giovanni Riggi di Numana, the expert who cut the Shroud samples for examination by C14, and with the agreement of Cardinal Ballestrero, kept some of the fibers of the Shroud and collected fragments of aspirated blood and dust samples in between the linen and the Holland cloth”. The “and” is important: did Fanti perform his experiments on fibers only coming from the dust or also from fibers coming from a small piece of the TS taken in 1988 by Riggi ? Incidentally, we now know (see the “breaking news on shroud.com at the end) that a paper written by Fanti will be published in a scientific journal (I do not know the journal)..","date":"2013-04-04","mins":"2:02 pm","url":"https://shroudstory.com/2013/04/04/a-critical-review-of-giulio-fantis-new-book-unreliable-results-because-of-inadequacy-of-methods/","cat":"books","title":"A Critical Review of Giulio Fanti’s New Book:   Unreliable Results Because of Inadequacy of Methods"},{"id":"comment-123248","author":"thibault_heimburger","post":"Reminder: I also found the same micro fragment of oak in Raes#7 http://www.shroud.com/pdfs/thibaultr7part2.pdf see Fig.13. This micro fragment was very light. However, most probably, these fragments coming from two very different areas are “from one of the wood caskets in which the Shroud has been kept for many centuries”..","date":"2014-05-22","mins":"2:41 pm","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"id":"comment-125081","author":"thibault_heimburger","post":"Hugh, About the Quad mosaic, I would like to say what follows: 1) The authors of the experiments were true experts in this field. 2) You wrote: ” Basically, it is patently obvious that the different colours of the quad mosaics are not related to the chemical composition of the Shroud, as the main body of the shroud varies from yellow to blue on every one.” You have to consider only the portions of the Shroud that were uniformly illuminated: the lower parts. The upper parts of the Shroud (in your paper) in which you see blue colors must be eliminated for comparison because the conditions of the illumination of those parts were likely not the same as those of lower parts. One has also to consider the creases, folds etc (remember the the Shroud was not flat in 1978). Shortly, the Quad mosaic photo certainly shows us a kind of chemical map of the TS but the conditions in which the photos were taken must be taken into account. I have the High resolution Photos of the Quad Mosaic. The Quad Moasic is not meaningless. I’ll try to show that tomorrow..","date":"2014-05-27","mins":"3:02 pm","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"id":"comment-75111","author":"thibault_heimburger","post":"Anonymous hates Fanti for many years. I know Giulio and I can tell you from my own PERSONAL experience that this kind of coarse insinuations re Giulio are completely false and simply disgusting and pathetic. Dan, you know Giulio and I am surprised that you did not immediately delete the above message..","date":"2014-01-29","mins":"5:26 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-130039","author":"thibault_heimburger","post":"Hugh, you wrote: ‘ Since the intensity of the image in the areas around the bloodstains is variable, then those areas represent both contact and variable distance colouration processes.’ Can you give us examples of the first part of your sentence. I’ll explain my reasons later..","date":"2014-06-16","mins":"3:15 pm","url":"https://shroudstory.com/2014/06/16/clarification-of-the-stochastic-process-paper/","cat":"paper_chase","title":"Clarification of the Stochastic Process Paper"},{"id":"comment-183300","author":"thibault_heimburger","post":"Charles, Colin (and Louis), The extreme superficiality of the image is just one of the problems of the “complexity” of the TS. For example, Colin’s thermal imprinting can be superficial. Yes, that’s true. However, Colin have introduced new ideas like ” chemically sensitized linen”. Why? By “complexity”, I understand many other facts. For example: – what looks like a realistic bruise on the face – what looks like a realistic fracture of the nose – the “dust” on the sole of the feet area – the “strange” shapes of the blood stains … I could add many other observed facts. What about this forger?.","date":"2015-01-14","mins":"4:18 pm","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","title":"Papers by the Skeptic of STURP"},{"id":"comment-94646","author":"thibault_heimburger","post":"OK: “That’s the problem. Lack of mutual respect, and inter factional wars and animosites in the Shroud community.” That’s true. But the truth is that at the time (1978 1980) some people in Turin never wished to work with the STURP. For them, the Shroud was their own property. I have Gonella’s archives. Gonella himself complained about the attitude of some people in Turin. Just an example. In 1980, STURP and Rogers asked Gonella the Raes sample for scientific studies. Gonella agreed but somebody in Turin said :no. At the end, Card. Ballestrero ordered to send some threads to Rogers. That’s why Rogers only received some threads from the Raes sample rather than the entire sample. It seems to me that Rogers himself did not know that. The studies of Baima Bollone are certainly interesting. The problem is that he never (to my knowledge) published his discoveries in peer reviewed journals, contrary to STURP policy. Perhaps you know better understand STURP’s attitude..","date":"2014-03-29","mins":"4:49 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-51511","author":"thibault_heimburger","post":"David Goulet : I’ve been searching the internet for pics of negative photographs based on scorch images. For the most part only the Shroud and your bas relief experiments come up. So kudos for the pioneer work. It is a bit surprising that such a ‘promising’ explanation for the image formation has not been experimented with more. But people do have lives to live. I’d be interested in any photo negatives of the crucifix you might get. The scorch theory still doesn’t work for me (for many other reasons) but I think you’ve demonstrated that the Wow factor — while still Wow — could be considered a very happy accident. ” It is a bit surprising that such a ‘promising’ explanation for the image formation has not been experimented with more. ” Sorry, David. This is not true. In fact it is an old story. The scorch hypothesis has been studied (including experiments) in John P. Jackson, Eric J. Jumper, William R. Ercoline. Three dimensional characteristics of the Shroud image. IEEE 1982 Proceedings of the International Conference on Cybernetics and Society, October 1982. Does anyone of you have this fundamental paper? This is not the only one. Other researchers have tried to reproduce a Shroud like image (Pesce …). They failed. All these experiments are consistent with my own results. But it is true that CB introduces more subtle theoretical parameters that have to be studied in depth. Let’s see the results in practice..","date":"2013-11-15","mins":"5:44 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50829","author":"thibault_heimburger","post":"Colin, You wrote: ” But what about the claims for “striations” and “discontinuities” in Shroud image fibres? What’s the source of those claims. Is it really the x35 photographs that bear the name of Barrie Schwortz and/or Mark Evans that one sees in pdf documents? Was that really the top magnification available to folk like Fanti et al (2010), the list including Thibault Heimburger, because if it was, then my ageing eye sight is simply not capable of seeing the detail that is claimed to be there.” The only source? No In ” A Comprehensive Examination of the Various Stains and Images on the Shroud of Turin” by Jumper et Al (ACS advances in Chemistry N°205, Archaeological Chemistry III, 1984), we read: “Body only images (…) Macroscopic Characteristics: (…):The yellowed fibrils are not yellowed continuously over their entire length. We observed a fibril that was yellow only on the part that was on the uppermost portion of the thread but lost its coloring as it left the upper portion of the thread in its normal course of following the twist to the lower portion of the thread (…) In examining the cause of the differing integrated densities of the body only images as seen by the eye, we found that the darker portions of the image were not due to a variation of the degree of the yellowing of the fibrils, but rather to the presence or more yellowed fibrils per unit area. Thus, the extent of yellowing of a given fibril was the same, to within 10% (of full scale) of any other yellowed fibril on the basis of the microdensitometric measurements of the color micrographs. (..) In this regard, it should be noted that there are ubiquitous examples of yellowed fibrils lying adjacent to unyellowed fibrils”. At least 3 (or 4 ?) of the 6 authors of this paper were members of the STURP team that performed the in situ observations in 1978, namely Jumper, Jackson and Pellicori (concerning Druzik, I don’t know). Thus, the “discontinuities” and the fact that bundles of colored fibrils are found adjacent to uncolored fibrils is fully confirmed. Perhaps you can see that better in Fig.20 to 23 in my pdf: the scorch hypothesis revisited… ” Who’s to say these features, if present, are not a characteristic of retted flax fibre that are shown up in the imaging process, but in reality are also in latent form in non image fibres? Might those discontinuities and striations be visible in the edges of the 1532 scorched fibres too? Has anyone looked? Were they photographed at high magnification too? So much to do, so little material to work with… maybe.” Very good questions. Reviewing the Mark Evans (ME) collection disk I have, I can say that none of the 3 facts seen in the TS body only image, i.e: striation, ” interruption” and bundles of colored fibers adjacent to uncolored fibers in a given image only thread (how to name this property ?) is specific to the body only image area. It is also found in light scorches and waterstains borders. What does it mean? You wrote: ” Who’s to say these features, if present, are not a characteristic of retted flax fibre that are shown up in the imaging process, but in reality are also in latent form in non image fibres? ” Probably yes. Each of the 32 ME microphotograph I have is about 15 20 MB!! I’ll try to write a pdf with the images showing what I wrote above (There is no other mean taking into account the weight of the images). I want to collaborate with anybody who has a correct attitude. Thibault..","date":"2013-11-11","mins":"4:30 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51149","author":"thibault_heimburger","post":"Thanks Colin for recalling us the basic theoretical physics of heat transfer (I knew that). The problem is that I don’t clearly understand your goal. I do not want to discuss the Fazio/Mandaglio paper. I want to see if any kind of image produced by any kind of technique using heat transfer match the fundamental properties of the TS image. I agree that, at this stage, we have only to look at the results at large scale (the whole image, 3 D properties.) and at small (fabric, thread) scale (but for that you need a microscope using low resolution). For Garlaschelli, Fanti and myself published 2 papers. No match. For the “direct contact scorch”, you know what I think. For the “thermostencilling technique”, I do not know. No question that all of these techniques are able to give a (more or less) faint yellow image. And then ? What do you want to do now ? PS: I don’t forget the other subject (striations etc..) This is the problem with the blogs. We are jumping from a subject to another… Not comfortable for me..","date":"2013-11-13","mins":"5:45 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"}]
