[{"id":"comment-215254","author":"thibault_heimburger","post":"Dear reader, I did not analyse the “fibers” (in fact threads or yarns) # 1 and 14. I only tried to count the number of cotton fibers in Raes thread #7. Http://www.shroud.com/pdfs/thibaultr7part1.pdf See also part 2 and 3. Questions ? Rogers (not myself), using micro chemistry,found a dye on the other Raes (and C14) threads he had. He also found and end to end splice in Raes #1. Villareal and al. From the Los Alamos laboratory confirmed this observation and found that the splice was secured by a brown crust which seems to be some kind of resin. Thibault..","date":"2015-11-28","mins":"3:16 pm","url":"https://shroudstory.com/2015/11/28/analysis-of-fibers-in-the-raes-area/","cat":"reader_inquiry","title":"Analysis of Fibers in the Raes Area"},{"id":"comment-215384","author":"thibault_heimburger","post":"Most of these threads were given by Rogers to several researchers before 2005. I do not know where they are now..","date":"2015-11-30","mins":"2:51 pm","url":"https://shroudstory.com/2015/11/28/analysis-of-fibers-in-the-raes-area/","cat":"reader_inquiry","title":"Analysis of Fibers in the Raes Area"},{"id":"comment-213771","author":"thibault_heimburger","post":"Yes, in Nature. But the Nature report was wrong on that point (7 cm x 1 cm). I have a letter from Tite to Gonella, explaining that the dimensions given in Nature were wrong. He apologized to him for the confusion. I also have a letter from Testore to Maria Grazia Siliato criticizing her for using wrong data. The true dimensions and weights are given by Riggi in Fig.2 of this paper: http://www.shroud.com/pdfs/oxley.pdf A quick calculation gives a density for the radiocarbon sample(s) of 20 22 mg/cm2, which is similar to the density of the main Shroud. Maria Grazia Siliato is wrong on this point but she was fooled by the Nature report..","date":"2015-10-28","mins":"3:34 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"id":"comment-213938","author":"thibault_heimburger","post":"“My opponents claim that the banding proves that there has been no repair (or, something similar). What’s our best argument(s) otherwise?” This argument is mainly based on the STURP X Ray photographs See: https://app.box.com/s/umu5p81xr42jbjqeulztb5g3un3ygdlf The red rectangle shows roughly the radiocarbon area. It’s true that there is no obvious anomaly. Does it exclude any repair ? Probably not..","date":"2015-10-30","mins":"4:35 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"id":"comment-214015","author":"thibault_heimburger","post":"Richard, Why Not? I wrote “no obvious anomaly”. The term “obvious” is important. 1) Contrary to the main part of the Shroud it’s very difficult to see clearly the bands in the C14 corner. 2) It seems that some anomalies have been detected. See: http://www.shroud.com/pdfs/whanger.pdf See Fig17 20. 3) We do not know the true meaning of these bands..","date":"2015-10-31","mins":"3:02 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"id":"comment-314","author":"thibault_heimburger","post":"“Blood is a liquid, albeit a viscous one , but should not some blood at least have penetrated into the furrows between the threads. There is no evidence of penetration”. Do you have pictures of the reverse (non image) side of the sheet ? “Why should blood be imaged EXACTLY THE SAME in principle as other imaged areas of the body, with the image confined largely to the ribs of the weave?” Do you have Mark Evans 1978 macro photos ? If yes you’ll see that blood residues are mainly found in the furrows. More generally all the properties of the blood stains at this level (as well at microscopic level) are the exact opposite of the image only properties. “I now find myself wondering about the key claim that the blood was transferred to the fabric before the image. How reliable is the evidence on which that view is founded? I see from an oft cited 2004 Rogers paper that he bases his blood first view on a simple spot test in which he applied proteolytic enzymes to the blood stains, and found that removing the stain revealed/uncovered/exposed no image under the stain. That does not strike me as conclusive evidence for anything, certainly not for a major claim re the bloodstains. I shall obviously have to dig deeper, but if in the meantime anyone knows of better evidence than a single spot test with protein digesting enzyme, then I’d be grateful for a link. Thanks.” And the same test applied to image only fibers did not change at all the yellow color. Incidentally, another important difference between blood and image … This test was performed by Adler and Heller under the microscope and not only on coated fibers but also on red globs, orange globs, and golden yellow coating from the golden yellow fibrils (serum). ” Withing a half hour this [proteolytic] solution completely dissolved the non birefringent red particulate fibril coatings, leaving no particulate residues; This further indicates that these particulates are blood and not Fe2 O3 impregnated protein binder”. They added “Interestingly, fibrils freed of their coatings using this technique closely resemble the NON IMAGE fibrils when viewed under phase contrast”. No conclusion ? Really ? Do you have another explanation ? Shroud Scope is certainly a wonderful tool. But not at all for the kind of studies you are doing. Did you ever read the peer reviewed STURP papers ? As for your “scorch” hypothesis which has been studied in depth by many researchers (including numerous experiments) many decades ago and finally dismissed. Just one of them (among many others) : the medulla of the image fibers is clear while the medulla of the lightly scorched fibers on the Shroud is colored. Please, purchase a good microscope and test your hypothesis. Being like a scorch is not the same as being a scorch. Regards..","date":"2012-06-23","mins":"8:15 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/06/10/sorry-mr-rogers-rip-but-you-got-it-wrong-about-banding-in-the-shroud-image-ruling-out-linen-modification/","cat":"amines","title":"Sorry, Mr.Rogers (RIP), but you got it wrong about banding in the Shroud image ruling out linen modification"}]
