[{"id":"comment-295","author":"s_j_miller","post":"Whether the shroud is the work of a human hand (forgery, hoax, as pseudo sceptics would say), or whether it was accidental/incidental involving a corpse under unobserved circumstances is beside the point. Also, the carbon dating problem pales into significance as far as believers or pseudo sceptics are concerned, because the real matter at hand is the image itself. Look at the number of ‘sceptic’ websites and papers trying to explain away the phenomenon (e.g. Http://skepdic.com/shroud.html, http://www.freeinquiry.com/skeptic/shroud/, etc.). Aside from their disagreements over carbond dating analysis, pollen analysis and the apparent discoveries of paint pigments, they still fail miserably in one vital area that they arrogantly claim to have the monopoly over: objective reality. The objective reality of the shroud is the image contained therein or thereupon. The idea that the image created on the shroud is the work of a painter seems, quite frankly, ridiculous, and as it stands, it is also impossible. As the shroud dates from at least the early renaissance period, perhaps earlier (and if the pseudo skeptics want to have it both ways, earlier still), you are faced with the fact that the greatest painters of that period: Giotto, Fra Angelico, Uccello, Pisanello were not of a sufficient technical skill to present anything near photo realistic depictions on panel. Even if you attribute the shrouds earliest historical mention to a later period you would still have to concede that artists such as Leonardo, Raphael and Giorgione (and that really is pushing the limits historically) still didn’t have sufficient technical capabilities to create thoroughly realistic work. But most importantly, the shroud, if a work of hand, would not just be a remarkable piece of photo realistic work, the actual application of the paint is the most telling factor. For the image to have been painted on the shroud would have taken a painter an effort so great that he would have to be able to apply correct weights of paint or pigment, from a loaded brush or other hand held device, with a technique employing pointilism, so accurate as to be executed under conditions that would require a microscope, without error, and with such perfection as to enable a 3 D image to appear using a VP 8 Image Analyzer, and of course, imagining the entire image while executing the painting, back, front and inside out to all match perfectly while taking into account perspective distortion and blood flow into relevant parts, and one last thing – the whole image would be done in negative! All of this would have to have been done by a painter WITHOUT A SINGLE MISTAKE. The microscope has shown that quite clearly. What pseudo sceptics don’t seem to understand is that they can’t simply sweep something under the carpet like this and hope that it goes away. No matter what the argument is regarding the age of the cloth, or even of whether it corresponds to Christ, nobody has been able to explain how the image could have been made. No painter from hundreds of years ago had the time, resources or skill to paint that image. No painter now has the time, resources or skill to paint that image. If they do, they simply have to replicate it and prove to us that it’s a forgery, but they can’t. No painter can. Some crude attempts to recreate it have been attempted, but they are certainly not as accurate, and are light years away from similar when viewed under a microscope. And so the pseudo sceptics in their desperate attempt to debunk it remain unable to explain how a supra genius master painter/forger had the time, skill and resources available in the 14th century to create this wonder, while nothing else exists in the world of anything near the same level of technical accomplishment. I find it both disappointing and depressing that human beings can be so dishonest and ignorant of this obvious fact. It’s the duty of science to understand how the image came to be on the cloth. If we ever understand how it did happen by a means other than painting, we still have no means of proving that this is the shroud of Christ..","date":"2009-03-08","mins":"6:32 am","url":"https://shroudstory.com/2008/08/26/more-tetherd-cow-ahead-on-the-shroud-of-turin/","cat":"carbon_14_dating","title":"More Tetherd Cow Ahead on the Shroud of Turin"}]
