[{"id":"comment-18124","author":"ron","post":"YC; “if the Image of Edessa did survived during that time, it’s only because of a lucky historical context: the city of Edessa was occupied by the Arabs and the Christian Iconoclasts could (NOT)put their hand(s) on it in order to destroy it.”…”And where was the Shroud during that period ? No idea but certainly well hidden from the public…” Maybe in the same place as the Image of Edessa, or one in the same? ; ) R.","date":"2012-10-23","mins":"1:39 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","title":"A good question about Justinian II coins"},{"id":"comment-12184","author":"ron","post":"Colinsberry :Ron: the restriction of the sample area for carbon dating to one corner was unfortunate – but would you really want to see the Shroud disfigured by multiple sampling sites? I have for some months have been mulling over the claims that the sample came from an unrepresentative corner that had been “invisibly repaired” through devilishly clever techniques, including end to end splicing of individual fibres. My considered opinion re those claims – from the late Ray Rogers in particular – someone whose many ideas but minimalist experimental verification I find increasingly difficult to accept at face value – can be expressed in a single word: poppycock. Correction two words: utter poppycock. Considered opinion? It’s called French invisible reweaving Colin. An art that is centuries old and ‘cleverly’ can completely hide a mending, even if viewed under weak magnification. They even have books on it!! If the finding of spliced threads is not enough for you, I don’t know what to say!…But that wasn’t the point of my comment. If you had read any of my previous comments on C14 dating and you were a true/honest scientist you would agree; a single sampling, even tested several times cannot give a reliable or truthful result, especially if contamination is not known!. Therefore under those circumstances the C14 dating should have been refuted from the start! Any expert without a reputation to loose, would agree with me 100% on those points. It is unfortunate people do not do enough studying on the subject of radiocarbon dating. If they did, they would not put so much faith or emphasis on the radiocarbon dating. R.","date":"2012-06-11","mins":"5:22 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-18136","author":"ron","post":"Yannick Clément :I think we have well enough evidences Ron to completely reject that possibility ! He he! I’m not sure about that Yannick. Infact I would say that is humorous. R.","date":"2012-10-23","mins":"2:36 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","title":"A good question about Justinian II coins"},{"id":"comment-12258","author":"ron","post":"Colin why do you shirk my point about the radiocarbon dating? That is REAL science. The thing is, I think you know I’m right… Thats it, isn’t it? You along with all the Shroud skeptics will not or cannot face the fact that the C14 dating is irrelevant, if not total garbage. Why? Because it is allegedly the ONLY scientific point against the Shroud. Without the C14 dating there is absolutely nothing to go against the Shroud’s authenticity, scientifically!…Don’t believe me about the C14 dating, do some honest unbiased study on the topic. As for the Pray Codex, if you along with the others want to continue ignoring the details properly and want to conclude it is a tomb lid, go ahead, I could care less, especially since you’ve proved many times before you like to ignore much of the evidence put forth to you or twist it to your fancy. R.","date":"2012-06-12","mins":"7:25 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11804","author":"ron","post":"Are you a medieval art expert? Listening to some of your reasoning shows an approach far from common sense. Why would an artist have to show the threads going thru to predict a pattern? Are you an artist? Have you ever heard of artistic license? …The image has a beard, however slight, but still there….Maybe the Aritist was under the impression the image was not noticeable immediately hense not placing it on the Shroud. The fact that he does not show much blood or none at all is not uncommon in Byzantine art, thats a fact. Maybe the artist never viewed the complete Shroud? Only partially as mentioned in historical documents, it was raised on Fridays in Constantinople and most likely only showing from the waist up. You and others opponents are in denile, plain and simple as the depiction of the ‘naked’, ‘arms folded’,’wrists crossed’, ‘elongated fingers’ with ‘no thumbs’ man cannot be easily dismissed so simply as you wish, as these items are not typical of medieval depictions of Christ art. R.","date":"2012-06-02","mins":"12:10 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12142","author":"ron","post":"Colin, as to your last paragraph above, I feel the same about the infamous Radio Carbon Dating taken in 1988. To truly go about the business of establishing HOW and WHERE the Shroud came into existence, we must toss the c14 to the side, as way to much effort has been put on refutting the erroneus dates concluded. More time/ effort would be better served actually convincing the Turin authorities it’s time to have the Shroud properly studied. Enough of the games already!. R.","date":"2012-06-10","mins":"10:12 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11823","author":"ron","post":"I think some here should read Stephen Jones latest blog on the Pray Codex, which Dan was nice enough to link too on a here. It’s actually quite informative..","date":"2012-06-02","mins":"8:13 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11846","author":"ron","post":"You guys kill me! I give you the name of a Art Historian and you belittle it? So his book is controversial but you cannot question his art authority so easily…Typical!! Furthermore there have been several other art historians that agree, their names just escaped me. You could follow Dave’s advice below and do some reading/ research and you’ll find them. The painting you linked us to above, how rediculous. That was painted 200 years after the pray codex, in a different religious enviroment. Show us some paintings or drawings prior to or immediately around the Pray codex time, and your point will be made, not otherwise. Colin, put your glasses on, and look at the lower part of the Shroud (Where some believe it’s the sepulchre), with the red crosses, look close now; there are 5 poker holes there. R.","date":"2012-06-03","mins":"12:55 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11851","author":"ron","post":"Colinsberry :How much sillier can this Codex thing get? I’ve left you a short message on my own site, Ron Sorry, not interested in visiting your site. R.","date":"2012-06-03","mins":"1:33 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11803","author":"ron","post":"I think anyone who can STUDY the drawings of the Pray manuscript and not see a correlation with the Shroud is simply in DENIAL. Especially when medieval art historians agree wholeheartedly, that that is exactly what it depicts!!. But with that said I think the notion that Pray manuscript is needed as evidence to the radiocarbon dating being in error is irrelevant. As I’ve stated before (many times) anyone that accepts the 1988 C14 dating as being conclusive or ‘Rock solid’ evidence need to educate themselfs in the science if radiocarbon dating, protocols, procedures and failings. If one does so HONESTLY, then one would come to the conclusion that the c14 dating was and is INCONCLUSIVE and WORTHLESS, period. It truly dumbfounds me that people will or can still use the c14 dating as any kind of ‘proof’ to the age of the Shroud….It’s got to be denial or a bias, thats all I can think would drive people to believing it. R.","date":"2012-06-02","mins":"11:49 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11959","author":"ron","post":"Matt :respectfully, that is rubbish. There is plenty of symbolic , non literal material on the shroud. How about the alpha letter floating above the shroud, connnecting to the head figure of Christ? How about the crosses over the mid portion of the shroud, representing Christ’s contact with the shroud and the head cloth? How about the fact that Christ’s body, being taken from the cross, and then laid out on the shroud, is free of blood marks (this is clearly symbolic,or at least based on social / spiritual mores). Where I agree with you is that the artist is not a particularly skilled one. That doesn’t matter. In fact that explains things like the fact he painted crosses over the shroud, near the angel’s feet, to represent Christ’s image on the shroud.You haven’t addressed my points on the crosses, nor on the two red streaks. I think these are very valid, previously unmentioned points. I don’t think they are easy to dismiss, but I’d like to see you try…. Well said!…It must be stressed though; Byzantine “symbolism” here. Not post fall of Constantinople western art…There was a difference! R.","date":"2012-06-05","mins":"5:13 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11822","author":"ron","post":"Although I don’t agree with the central theme of his book, Thomas de Wesselow is one. He is a British Art historian specializing in medieval images…I’ll take his word over yours thank you. R.","date":"2012-06-02","mins":"8:08 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11961","author":"ron","post":"You are wrong in so many ways, most importantly is that the weave of the cloth would be one of the most prominent features one would notice on the Shroud, and one an artist or semi artist would depict to clarify it being a cloth and not a stone lid. The poker type burn holes would definately be the most prominent thing someone would see on the Shroud when first viewed, hense the reasoning for their depiction. You amongst others do not take into consideration the extreme ‘faintness’ of the image, as you have only seen it in pictures.(Which enhances the contrast extremely) and as opposed to other features of the Shroud. The point about a lid is a rediculous and nonsensical argument, as if one views the hundreds of entombment dipictions known, only a very few show any type of lid or esophagus most will show a sepulcre or nothing at all! There is alot more symbolism shown in the pray manuscript then you know, some mentioned above by Matt and a Byzantine trait in their art. The red x’s or crosses are of a particular meaning, and one would know this if they would study Byzantine art and it’s differences to post 1204 western art. R.","date":"2012-06-05","mins":"5:38 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11821","author":"ron","post":"Colin you are forgetting there may also be a five hole depiction on the cloth, on the lower side and quite indicative of one of the more prominent burn hole patterns…..I think your theory is busted. R.","date":"2012-06-02","mins":"8:04 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12511","author":"ron","post":"Max, maybe it’s because he is in the middle of moving! He’s got alot going right now. Give him some time. R.","date":"2012-06-15","mins":"7:45 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12520","author":"ron","post":"Colinsberry :Certainly I am coming at it from a different perspective than you and others, Matt, but to portray it in the terms you do as a clash between art and science is laughable (and if the truth be told, a wee bit pathetic). The Pray Codex is NOT a work of art, nor was it intended as such. It is a small line illustration in a Codex (i.e. Early book). The “artist” had no real life tableau in front of him – he had to draw what was in his imagination, and it’s clear that perspective was something that he (and probably most of his contemporaries) had still to master. That is why it can take the modern viewer a little time just to discern that it is a medieval style and probably anachronistic sarcophagus with its raised lid that dominates the picture (a fact that seems to have eluded quite a few here too it seems if you go back through earlier posts and comments). That’s why you cannot just stick the Codex under someone’s nose and ask “Tell me what you see”. The answer is likely to be as untutored as the ones we have seen here earlier. You have to present your straw poll sample with rival interpretations, maybe with some background biblical notes, and then ask: “Which is the better interpretation of what you see, viewed within its historical and religious context?”. I too will stop here, rather than repeat what I have already said. I have made my position clear on my own strawshedder blog, and see that it is already listed near the top of page 2 returns of a Google search of # pray codex#. You see, unlike some here, I have to think long and hard before expressing an opinion, knowing that my future credibility as a blogger, to say nothing of search engine rankings, could be undermined by indulging in over hasty or fanciful judgements. “Think long and Hard” LOL, come on Colin, you along with Mo and curly see a few old paintings with a ‘Lid’, (and let me stress again here that only a few of the dozens upon dozens of burial paintings show a lid at all.) and you instantly come to A conclusion, which to you instantly and nicely eliminates ‘details’ such as the herringbone weave and poker hole depictions, that most everyone sees (sept you ofcourse). But in saying that, everyone can and will have different opinions about the PC, and what it depicts and everyone is free to their opinion. I just think you are wrong on most of your assumptions…I have my own assumptions aswell; such as what we see is the Shroud (outter) side with the herringbone weave, 4 poker holes and wavy blood streaks depicting what can be seen on the outter side of the Shroud. The Red cosses and some red ‘x’s with the 5 poker holes depicts the inner side of the Shroud (the image side), hense the crosses in red depicting the devine one. The ‘Bundle’ you and Matt have been discussing I see as ‘possibly’ the linen strips, not the face cloth as I think the face cloth is depicted slung over Mary’s arm. The PC obviously was not drawn by a ‘skilled’ artist as several amatueristic ‘perspective’ errors were made, but although it’s failings, it does include alot of details and some ‘Byzantine style’ hidden symbols. To me it seems quite clear whomever the artist was had either directly viewed the Shroud or the details were dictated to him. Some details he derived from scripture but some obviously from the Shroud as these details would not be known unless the Shroud was viewed!…Lets not forget many clergy/monks etc; would make their pilgrimages to Constantinople and if the Shroud was there and raised each Friday, one must expect it would have been the foremost attraction one wouldn’t want to miss. R.","date":"2012-06-15","mins":"10:13 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12651","author":"ron","post":"David Mo : Ron :I have my own assumptions aswell; such as what we see is the Shroud (outter) side with the herringbone weave, 4 poker holes and wavy blood streaks depicting what can be seen on the outter side of the Shroud. The Red cosses and some red ‘x’s with the 5 poker holes depicts the inner side of the Shroud (the image side),R 1. You can’t refute a scientific test with assumptions. If you want to refute scientific evidence you must provide scientific evidence, not speculation. Speculation about the Codex Pray do not override the carbon14 test. 2. Speculation about the holes are not subjective, it is non consistent because need to combine different criteria for the four holes in “L” form and the five as “P”.Please, go to Latendresse page http://people.bridgewater.edu/~rschneid/Focus Projects/Shroud/Shroud Measure/enrie Img.html and say us the coordenates of the four and five holes that you see in the shroud.Then, go to the Shroud Scope ( http://www.sindonology.org/shroud Scope/shroud Scope.shtml ) click on “Poker Holes” box and explain us how is possible than you see a group of five holes and M. Latendresse only groups of three or four. First don’t place my comments out of context. I never used the PC to refute the C14 dating. If you read ALL my comments carefully, you’d know there are many reasons to refute the C14 without the PC or even the proposed reweaving. It’s common sense, if one “reads” on the science/protocols/limitations of C14 testing…that the c14 of 1988 should be nullified…maybe you should do some research in this area too? Second, I don’t give a shit what Latendresse sees, does he have better vision then I?, I don’t think so. Maybe YOU should take a closer look at the Shroud poker holes also? Hey, I just mentioned my speculations, how I observe the details on the PC, just as everyone else has done so also! Everyone including yourself and I can only speculate on WHAT WE SEE. Can you refute that? R.","date":"2012-06-18","mins":"1:03 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12656","author":"ron","post":"Mario Latendresse :Colins Berry wrote “Btw, there is what looks for all the world like a line of stitching on the dorsal side of your 2002 Durante image, just above waist level.” I am not sure I understand. I cannot reproduce this on Firefox or Safari on a Mac. At which zoom level does it happen and which browser are you using? What might be happening is a gap of one or two pixels between the tiles when the Shroud is displayed. The shroud is displayed as rectangular image tiles of 400×200 pixels. I have seen this on the i Pad, but not always. (So far I attribute this to a Safari rendering engine bug on the i Pad) It would clearly be seen as a repetitive pattern of vertical and horizontal straight pixel lines right through the entire Shroud image and can hardly be confused with stitches. If you could attach an image of what you see that would clarify what is wrong. As for the level of coincidences of the Pray Codex miniature details and the Shroud, it is important to take into account the entire context and details at the same time. So far, in the discussion that has been going on this post, none ever refer to the essential fact that Bela III, king of Hungary when the Pray Codex was produced, had been at the Constantinople court for a decade a few decades prior to 1293 1295 and was almost at the level of Byzantine emperor while over there. He surely must have seen the shroud that was in Constantinople. Given the fact that the shroud of Constantinople is the most likely place where the Shroud of Turin was, this fact cannot be put aside. In your reply, you did not consider this fact, neither the other clear fact that on the Shroud you have two different patterns of holes: two with a L shape, two others like a P shape (for a better term, they look like a rectangle). This is exactly the two patterns you see on the Pray Codex miniature.These are two details among others. In any attempt to measure the coincidence of such depictions one is left to quantify the probability that all these details find their way together on the same small miniature drawing. And again taking into the global context of the relation of Bela III and Constantinople. (Of course, you already know that the king is financially supporting the Benedictin monastery where the monks lived.) We could actually model such coincidences. And as an aside curiosity about the Shroud Scope, you can see a loose thread that was drop on the Shroud when the shot was taken (a lost thread during the restoration?): http://www.dshroud.com/shroud Scope/shroud Scope.shtml?zl=11&image=3&lon=3962&lat=6097&poker=t To all readers, where do you think this thread comes from? Mario your point above about Bela III visiting and living in Constantinople is a strong point! One that the details eluded me when I made my comment that the artist’s specific ‘clues’ on the PC, may have been ‘dictated’ to him. So thank you for making your comment. I would think it would be ‘VERY UNLIKELY’ that Bela III would not have viewed the Shroud, especially with his high standing! He may have even possibly been given direct personal access to the Shroud for the same reason,…better then most for sure. I don’t think there is much speculation in that reasoning also. He may have even had a subordinate make a sketch of the Shroud for all we know, as so much has been lost to antiguity. I also agree that ALL details on the PC must be considered as a whole and not disected when coming to any conclusions. R.","date":"2012-06-18","mins":"1:52 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12652","author":"ron","post":"I should qualify here that although I stated I don’t care what Mr. Latendresse sees, as opposed to what I see, I do respect his opinion. Thanks. R.","date":"2012-06-18","mins":"1:23 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-8519","author":"ron","post":"Sorry spelling error, should read as “testimony”, apparently my english writing is not that great either, LOL. R.","date":"2012-02-20","mins":"7:37 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-12658","author":"ron","post":"To Mr. Lantendresse. It looks to me that, that “thread” seems to be resting on the Shroud. I think I can see a slight shadow on the top side. I would assume it could be, ‘maybe’ from a pair of cloth kiddy gloves used during the restoration or when the Shroud was placed for the pictures. R.","date":"2012-06-18","mins":"2:12 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12657","author":"ron","post":"David Mo :I respect your opinion, Mr. Latendresse’s opinion and any other opinion. But your answer evade my question. In european football we say “throw balls out”. It is a way of stop the game when things go wrong. Did you ask me a question? I didn’t see one. If you meant a return as to how I see 5 holes, I said look for yourself! If you don’t see that one of the poker hole patterns is made up of 5 distinctive if not more holes, you along with Colin need an eye examination. R.","date":"2012-06-18","mins":"1:58 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-8517","author":"ron","post":"No need to apologize Lu, I’m Portuguese/Canadian and I can’t read or write Portuguese! …Absolutely touching testemony…You just made my day : ) God bless you. R.","date":"2012-02-20","mins":"7:33 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9744","author":"ron","post":"It is a little misleading when alot of people claim the apostles didn’t recognize Jesus (at first). My recollection is that, that happened in only two instances. Magdelane at the tomb and two apostles on the road. During the lords many other visits mentioned, especially the two main ones immediatley after the crucifixion, in the “locked room”, he was recognized immediately. So I wouldn’t put too much into this as so many do. “Children are easy to mislead”, maybe but I think they also may have an easier time of recognizing the Lord then any of us would and less likely to be ‘tricked’ by the devil as thier hearts are also closer to the Lords. I don’t know if that makes sense but it’s what I feel. R.","date":"2012-03-29","mins":"7:13 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-10661","author":"ron","post":"Hi Ginger, actually the front and back heads do not meet. There is an empty gap between them. I can’t remember how many inches exactly but it is somewhere around 5 to 6 inches. Any lines you see in that area are water stains basically in the shape of a diamond. You can see similar stains on other parts of the Shroud aswell, as the Shroud was folded when these stains occurred. Also according to a couple of the scientists the image formation seemed to have happened in a vertical or 90% angle to the sheet, that is why no side images appear. Also according to several scientists there are 3d aspects to the image and distortions (slight however) most likely caused by the draping of the cloth. What you see on the Shroud is not a picture it is actually an encoding so it may appear at first to be drawn on a flat surface but with further examination it definately was not. Hope that helps, I’m not that good at putting my thoughts in writing. If you really would like to learn more; a good book I’d suggest you read would be ‘The Resurrection of the Shroud’ by Mark Antonacci, it covers quite well the scientific, medical and archeological aspects of the Shroud plus many other things. R.","date":"2012-04-21","mins":"4:43 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-10999","author":"ron","post":"Kevin, sounds like you need a new attorney to tell you the truth. I understand the pain your going thru, do you get to see your daughter atleast? R.","date":"2012-04-30","mins":"11:20 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9203","author":"ron","post":"How anyone can question as to who was the greatest artist that ever lived, and not put Michaelangelo in the forefront confounds me! He was by any word a magician, his sculptures bearing almost lifelike personas and his paintings to me anyways, far outmatching the likes Leonardo’s. I watched a documentary recently on the painting of the Sistene Chapel, it stressed a point basically unknown by most people; that the ceiling is not flat, that it has arches, yet the figures do not distort by this fact, and in fact some figures although the arch will bend the light one way the figure seems to defy physics and is leaning the other way!….What an incredibly amazing work of art this is…. This is an amazing piece of technology, thanks Dan for posting it. R.","date":"2012-03-11","mins":"10:06 am","url":"https://shroudstory.com/2012/03/11/amazing-technology-and-ecumenical-developments/","cat":"art","title":"Amazing Technology and Ecumenical Developments"},{"id":"comment-41930","author":"ron","post":"David, I’m curious…You have been lucky enough to be just feet from the actual Shroud during your making of one of your films, I believe. What ‘feelings’, if any, did you experience?…It must have been something awesome. R.","date":"2013-08-24","mins":"11:30 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem"},{"id":"comment-9324","author":"ron","post":"Lets not downplay Michaelangelo’s (M’s) work here! Yes others painted the side frescos far before M’s work, as the ceiling was adorned only with ‘stars’ beforehand. M managed to paint 1,100 sq meters, which required basically (looking up) for four years! …It is not only a herculaneum accomplishment, physically and mentally, but an astounding work of art. R.","date":"2012-03-14","mins":"4:59 pm","url":"https://shroudstory.com/2012/03/11/amazing-technology-and-ecumenical-developments/","cat":"art","title":"Amazing Technology and Ecumenical Developments"},{"id":"comment-3268","author":"ron","post":"It truly is amazing and completely dumbfounding.Don’t these people ‘Educate’ themselfs on the Shroud science? Glad to hear your doing well! F 3.","date":"2011-06-26","mins":"1:15 am","url":"https://shroudstory.com/2011/06/12/another-renaissance-artist-theory-for-the-shroud-of-turin/","cat":"art","title":"Another Renaissance Artist Theory for the Shroud of Turin"},{"id":"comment-8002","author":"ron","post":"The plate is actually 17c in Wilson’s book and it shows the right eye, (when looking at the plate) the personage’s left eye, being somewhat distorted, swelled and (closed?) and right cheek as being quite swollen. The ‘personage’s’ right eye looks pretty normal….too me anyway…..an artist’s mistake? R.","date":"2012-02-06","mins":"4:56 pm","url":"https://shroudstory.com/2012/02/06/another-justinian-this-one-circa-652/","cat":"art","title":"Another Justinian, this one circa 652"},{"id":"comment-18179","author":"ron","post":"Angel, your interpretation of the coin lines may be incorrect, both sides do not run down passed the shoulders. On the short side I believe you may be mistaking clothing lines as hair lines. I am baffled by which Edessa cloth you are talking about? I don’t remember seeing any depiction showing the blood ‘3’ marking or any other blood markings whatsoever, and only a few that may show differences in hair length. Truth being I haven’t seen any artist depiction at all with the ‘blood 3’ marking as seen on the Shroud, even the pantocrators have this blood mark missing!…So why would it be expected to be shown on the coin?….The reasoning for no blood images, and this has been covered many times by others, is that Jesus would always have been shown as alive. I’ll also venture to say, you are taking the Abgar story as factual writings, when it is just a story written by someone who obviously was trying to interpret how the image they saw on the Shroud could have possibly have been created on the cloth. Several ancient interpretations have mentioned the image seemed as though created from the secretion of bodily fluid or sweat, so put two and two together and it is not hard to understand the writers intentions. But seriously which Edessa image has ever shown blood? Can you please link us to this image?…thanks. R.","date":"2012-10-24","mins":"7:05 am","url":"https://shroudstory.com/2012/10/22/based-on-the-shroud-of-turin-justinian-ii-solidus-has-face-of-christ-with-skewed-nose-and-unbalanced-hair-length/","cat":"art","title":"Based  on the Shroud of Turin: Justinian II Solidus has Face of Christ with Skewed Nose and Unbalanced Hair Length?"},{"id":"comment-18123","author":"ron","post":"‘Really’ is right lol. Matthia should take a close look and notice on the So T face image the hair on one side seems to get cut off by what seems to be a crease in the linen. On the opposite side the hair continues much lower, but periodically obscured, possibly due to the linen being tucked, Anyways one must also notice the fact the the short hair side is opposite the extended point of the beard, exactly as shown on the Shroud and seen on the coin. R.","date":"2012-10-23","mins":"1:26 pm","url":"https://shroudstory.com/2012/10/22/based-on-the-shroud-of-turin-justinian-ii-solidus-has-face-of-christ-with-skewed-nose-and-unbalanced-hair-length/","cat":"art","title":"Based  on the Shroud of Turin: Justinian II Solidus has Face of Christ with Skewed Nose and Unbalanced Hair Length?"},{"id":"comment-18176","author":"ron","post":"Because you cannot see it, it’s imaginary? Creative interpretations? How about YOU have no ability, or lack a keen enough eye to see the details. Seriously anyone with absolutely no backing who can dismiss others abilities and in your case also the Vignon markings as rubbish, does not deserve any serious response. R.","date":"2012-10-24","mins":"6:20 am","url":"https://shroudstory.com/2012/10/22/based-on-the-shroud-of-turin-justinian-ii-solidus-has-face-of-christ-with-skewed-nose-and-unbalanced-hair-length/","cat":"art","title":"Based  on the Shroud of Turin: Justinian II Solidus has Face of Christ with Skewed Nose and Unbalanced Hair Length?"},{"id":"comment-18121","author":"ron","post":"Max, you are absolutely correct here. If one is to expand the coin image above, and then open a photo of the negative (as viewed normally) photo of the So T face, and expand it to match in size, then compare “very closely”; It is quite obvious whomever minted this coin had viewed the Shroud directly. The congruences are amazingly accurate! The nose bend may have been slightly exaggerated (less likely) or simply be an issue of damage to the coin (most likely), otherwise there are numerous similarities that one does not find anywhere else, i.e; as in the pantocrator images for instance. Whomever minted this coin was absolutely phenomenal in his detail and obviously had a very keen eye. I am no expert by any means, but have been told I have a keen eye for detail. Anyways, anyone who disagrees, I ask you please take a ‘very’ close look, follow all the lines and you will see. It would be awesome if someone had thought of taking off angle ‘raking light close up’ photos of the face of the Shroud, as this would almost certainly be the way an 8th century artisan would have viewed the Shroud, i.e; by candle light or angled light from a window….this could explain the ability of the artisan to distinguish fine details!…I’m hoping Barrie Shwortz picks up on my comment and can enlighten us on any such photos being in existence. R.","date":"2012-10-23","mins":"1:14 pm","url":"https://shroudstory.com/2012/10/22/based-on-the-shroud-of-turin-justinian-ii-solidus-has-face-of-christ-with-skewed-nose-and-unbalanced-hair-length/","cat":"art","title":"Based  on the Shroud of Turin: Justinian II Solidus has Face of Christ with Skewed Nose and Unbalanced Hair Length?"},{"id":"comment-18215","author":"ron","post":"Latendre :I would like to clarify that my post did not intend to describe this particular Byzantine coin, sent by Giulio Fanti, as not worthy of study. It is a very interesting find. The skewed nose on that coin is, I believe, a representation of one interpretation of what can be perceived, on the Shroud, as a broken nose. And as pointed out by another comment from another commentator, It might also relate to the actual emperor who ordered this particular coin to be minted. It might also point to the presence of the Manoppello veil in Constantinople as has been hinted by Max Patrick Hamon. The idea that the nose is curved on the Shroud is not exactly correct. It appears curved since one side of the face is more prominent than the other. Drawing a straight line from the top of the nose to its tip shows a very slight curve, but so small that we could not describe this as curved. Also, it is important to remember that each time the Shroud was laid down to be photographed, the face was slightly shifted left and right, creating slight deviations across the face. You can see these deviations on the Enrie’s photo vs the Durante’s photo. The skewed nose may also simply be impact damage delivered to the coin at some point! R.","date":"2012-10-24","mins":"2:49 pm","url":"https://shroudstory.com/2012/10/22/based-on-the-shroud-of-turin-justinian-ii-solidus-has-face-of-christ-with-skewed-nose-and-unbalanced-hair-length/","cat":"art","title":"Based  on the Shroud of Turin: Justinian II Solidus has Face of Christ with Skewed Nose and Unbalanced Hair Length?"},{"id":"comment-18243","author":"ron","post":"Angel I’ve seen several renderings of the Sakli Image, some in much better detail then this one. The markings you are interpreting as a possible blood article is actually damage (flaking). The frescos are deteriorating at an alarming rate, in most probability this image we see is probably much worse off now or gone for all we know.This is actually the image I studied and interpreted the 7 dark circlets has ‘possibly’ being the intention of the artist to convey there were several layers below the face layer, and to Max, yes the nose is skewed, but only very “slightly” with absolutely no comparison to the curvature we see on the coin, not even close..","date":"2012-10-24","mins":"6:08 pm","url":"https://shroudstory.com/2012/10/22/based-on-the-shroud-of-turin-justinian-ii-solidus-has-face-of-christ-with-skewed-nose-and-unbalanced-hair-length/","cat":"art","title":"Based  on the Shroud of Turin: Justinian II Solidus has Face of Christ with Skewed Nose and Unbalanced Hair Length?"},{"id":"comment-18228","author":"ron","post":"Max, I’m going to be honest here in that I don’t see the same curvature of the nose seen on this coin as compared to the veil or the Shroud, not at all. The coin curvature is extreme, comparitively. The overlay shown in your post with the Shroud and veil is not clear at all really. If you would look closely at the coin above, there are signs of impact, or ‘possible’ impact. For instance a slight ridge on the right side of the curve and look close at the very tip of the nose, …possible damage in the form of impact flaking? These were not flat coins, they were pseudo 3 dimensional and would have raised areas, the noise dominating most likely. So not completely out of the question that this exaggerated bend in the nose could be due to damage. I also don’t see three strands of hair on the coin. One would really have to try hard to believe so. R.","date":"2012-10-24","mins":"4:38 pm","url":"https://shroudstory.com/2012/10/22/based-on-the-shroud-of-turin-justinian-ii-solidus-has-face-of-christ-with-skewed-nose-and-unbalanced-hair-length/","cat":"art","title":"Based  on the Shroud of Turin: Justinian II Solidus has Face of Christ with Skewed Nose and Unbalanced Hair Length?"},{"id":"comment-16115","author":"ron","post":"I’m not too impressed by the final image on the tortilla, but it sure is making me hungry ; ) R.","date":"2012-09-10","mins":"4:36 pm","url":"https://shroudstory.com/2012/09/10/detailed-instructions-for-creating-a-shroud-of-turin-tortilla/","cat":"art","title":"Detailed Instructions for Creating a Shroud of Turin Tortilla"},{"id":"comment-13512","author":"ron","post":"I agree partly, in that I for one would like to hear more from Dan on occasion and on many of the discussions taking place here, as I would think others here would also. What do you say Dan?, a little more input couldn’t hurt!…I for one, enjoy reading your writings anyways. R.","date":"2012-07-05","mins":"3:53 pm","url":"https://shroudstory.com/2012/07/05/davor-aslanovski-is-right-for-once/","cat":"art","title":"Davor Aslanovski is right for once"},{"id":"comment-41183","author":"ron","post":"It is GOD we are conversing about here, you know the guy who is capable of anything..","date":"2013-08-13","mins":"10:00 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-6309","author":"ron","post":"It is situated in the catacomb of Saints Marcellinus and Peter, Via Labicana, Rome. You can find a reference to it on Wikipedia, under ‘Depiction of Jesus’. Although they describe it as being a mid 4th century fresco, I have read it to being early 3rd century also, but these dates are being contested as being much earlier. It is quite interesting that I also noticed the detail of the hidden thumb, but not the long index finger and I did not take notice it’s distinction till now…well done. R.","date":"2011-12-30","mins":"3:38 pm","url":"https://shroudstory.com/2011/12/29/even-more-on-waldemar-januszczak-doesnt-think-the-shroud-of-turin-is-real/","cat":"art","title":"Even more on Waldemar Januszczak doesn’t think the Shroud of Turin is real"},{"id":"comment-6442","author":"ron","post":"It is a remarkable painting isn’t it? R.","date":"2012-01-01","mins":"10:47 pm","url":"https://shroudstory.com/2011/12/29/even-more-on-waldemar-januszczak-doesnt-think-the-shroud-of-turin-is-real/","cat":"art","title":"Even more on Waldemar Januszczak doesn’t think the Shroud of Turin is real"},{"id":"comment-40910","author":"ron","post":"I would hope for the documentary he would. Otherwise I believe any reader here would have a pretty good idea of what he means, or should know, that mainly it is the changes in protocol, and as I feel, the elimination of STURP from any further tests… I’ve always had a ‘FEELING’ considering the big ‘show’ made that infamace day on the deciding of where to cut, that they already knew where to cut to get the most ‘unreliable’ results…This may sound simply to be speculation, but one must wonder; Of the whole 42 sq. Ft. Cloth, they just happened to cut the only section of the cloth that had shown to be different from the rest in certain photos…go figure. R.","date":"2013-08-10","mins":"1:30 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41130","author":"ron","post":"Yannick Clément : Quote from Ron: “I’ve always had a ‘FEELING’ considering the big ‘show’ made that infamace day on the deciding of where to cut, that they already knew where to cut to get the most ‘unreliable’ results…” My answer: If you have read carefully the book of Meacham called “The Rape of the Turin Shroud”, you should know that they had decided where to cut long before that “infamace day”, since Gonella and the Church authorities had already set up their mind for weeks (and maybe months) prior to this morning… Note that this information comes directly from Meacham’s book and I’m not inventing anything here. Also, if you read carefully Meacham’s book, you will noticed that the most rational (and thus, probable) reason that can explain why the authorities choose to take only one sample in that particular corner of the Shroud is not at all because they thought or knew that this action would produce a false positive result (again the conspiracy theory put forward on a purely speculative basis!) but simply because this was a corner that had already been cut once before (in 1973, so it was already “damaged” in their minds) and it was also located in one of the areas of the cloth that was the most distant from the body image (thus making the sampling of a few grams of fabric more subtle in their minds for future public showings). These 2 very probable reasons (both related to the preservation of the “good look” of the cloth much more than a desire to take the best possible samples for C14 dating) were what really drove the authorities (including their scientific adviser Gonella) to take such a bad decision, which was taken long before the sampling day (again, if we believe Meacham’s claims that we can find in his book). I don’t understand why so many people have so much difficulty to believe such a rational and simple explanation. Again, if we take Occam’s razor… ; ) I have read Meacham’s book, several years ago by the way and you can think what you like and/or accept Meacham’s answers, but I don’t…Just too much weirdness surrounding the sampling choice. R.","date":"2013-08-13","mins":"12:27 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41180","author":"ron","post":"That’s right. You finally get it!….It’s my opinion and just as good as yours, unless you can show substantial evidence to your argument and can refute mine. Anyways the argument that the Vatican decided to pick that specific area just goes to prove my point, as they definitely already had the idea that it was contaminated (from the early cutting and investigation). So WHY pick a MOST PROBABLY contaminated area? R.","date":"2013-08-13","mins":"9:42 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41186","author":"ron","post":"The ‘argument’, meaning that area was chosen because it was already damaged. R.","date":"2013-08-13","mins":"10:10 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41193","author":"ron","post":"Yannick Clément : And I already have answered your question Ron : It was most probably to preserve the good look of the Shroud… So why not around one of the ‘MANY’ charred areas, if LOOKS was important lol…retarded argument, sorry. R.","date":"2013-08-13","mins":"11:00 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41188","author":"ron","post":"Yannick Clément : I got at least one solid testimony in the person of William Meacham… How do you get “solid testimony’ from someone’s speculation? Meacham was only speculating as to the reasons, he was not absolutely sure….Ron 1 Yannick 0….; ) R.","date":"2013-08-13","mins":"10:12 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41195","author":"ron","post":"Ron 2, Yannick 0. ; ) R.","date":"2013-08-13","mins":"11:04 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41410","author":"ron","post":"Hugh Farey : Yannick, suppose you had been responsible for delivering the C 14 samples to the labs. How would you have done it? Would you have taken three 1cm square samples from different areas of he cloth, one for each lab; or would you have taken three 3cm square samples, and divided them so that each lab received three samples, one from each area? And whereabouts on the cloth would you have taken the samples from? This was presumably the problem that Gonella faced, and I should be interested to know how somebody else would have tackled it. I’ll tell you how I would have done it; It’s so simple, one questions the intelligence of the people responsible. Samplings taken from any location ‘centrally located’ on the Shroud would have been optimal. The numerous charred areas or areas immediately adjacent to them would have been ideal areas in which to extract samples and could have been done from ‘several’ different areas of the Shroud without excessive visible alteration to the Shroud and therefore giving a substantially better ‘representation’ of the whole Shroud.. In fact I believe in 2002 this was actually done during the so called restoration…fairly large areas were actually removed from the charred areas! So why not in 1988 when it would have been paramount to achieving an accurate c14 reading? Furthermore, to achieve a more reliable conclusion both AMS and the older liquid counter method would have been prudent; at the time a more trusted/reliable method of c14 testing then AMS. This would have of course required a single much larger sample to be extracted, but just one. One must also remember AMS was still in it’s infancy and had not proven to that point to be very reliable, failing miserably in earlier trial runs. The point is, if whomever was responsible for the extracting actually ‘listened’ to the various c14 experts, including Meacham, they would have or should have known this. Therefore, I would conclude there was no substantial reason NOT to extract several proper sized samples from disparate areas of the cloth and that there was several areas to do so, without substantially changing the appearance of the Shroud. R.","date":"2013-08-16","mins":"10:25 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41414","author":"ron","post":"Who cares! …Yannick you seem to think you alone have read books (closely) and maintain the ‘real’ knowledge. As I stated before I have read Meacham’s book, twice actually, along with dozens of others and have studied the process of radiocarbon dating in detail. I am completely aware of all that went on leading to the 1988 c14 fiasco, and my point stands…If they had used some common sense, my idea of how it should have been tackled should have been followed…Why they ‘truly’ did not, is the million dollar question and ridiculous to think it was simply due to aesthetics. Furthermore, I do not need to rely simply on Meacham’s book, to come to my conclusions. I can think for myself. R.","date":"2013-08-16","mins":"1:11 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41424","author":"ron","post":"Yannick Clément : All I say is that your idea was put on the table at the protocol meeting and eventually rejected by every one who was there, including Meacham. I don’t say this particular sampling idea is not good however. As I said, even Meacham changed his mind about that. So, maybe this could have been the best solution, but it was not kept by the specialists that were there in Turin, because they judged it too risky for contamination and exchange of C14 atoms with some products that could have been present on the cloth at the time of the fire of 1532. Personally, I still think a proper sampling of small pieces of threads taken here and there on the backside of the cloth would offer a very good cluster of dates that could give us a very accurate average age for the cloth, without damaging it too much and while preserving its “good look” for public exhibitions. Back in 1988 you could NOT just take small pieces of thread from here and there and do a proper c14 dating. You needed a minimum of 5mg of pure carbon to achieve a proper test sampling, which meant an original sampling weight of approx. 23 mgs to start with. That would require a fair size piece. Approximately 1/2 of the 50mg pieces given to each lab. Today it can be achieved with as little as 2 3mg pure carbon. Taking thread samples from all over the place and bundling them to achieve the weight would be counter productive because you’d be mingling the sample areas. As I said before; areas immediately adjacent to the scorch’s would have been ideal and they almost certainly should have been aware of this back then. Ray Rogers was not the first to realize the potential of the scorched areas as being good areas as samples, in fact any knowledgeable c14 scientist or technician would have been aware of this, even Meacham, although he is no c14 scientist. R.","date":"2013-08-16","mins":"5:34 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41444","author":"ron","post":"“Gove, Meacham and others had indeed been listened to, and their views considered” …Did you mean to write; IF Gove, Meacham and others had been listened too? …because it’s pretty obvious they were not….especially in Meacham’s case. I am not stating at all that they were stupid, quite the opposite, …maybe a case of ‘temporary insanity’ though. ; ) “The second reason is that taking pieces from under a patch would have meant unpicking a long section of the backing cloth and folding the shroud back to find suitable spot.” …Nonsense, they had previously unstitched the Shroud in 1978 during the STURP examination, …it wasn’t STURP who did so actually, but still it was done, so this would not have been an issue in 1988. R.","date":"2013-08-17","mins":"9:53 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41590","author":"ron","post":"Hugh; Meacham may have been a little negative, but he was being cautious and he was also mostly correct…He warned about the issue of contamination with fabric and especially a fabric with unknown history. They definitely did not listen to his point on the importance of acquiring samples from several disparate areas. Gove also warned about the sampling areas and about minimal size of sampling, but he raised so many issues they probably just wrote him off….These were the concerns raised by the two, that I had in mind with my comment. Yannick; If you are talking about present day c14 sampling and not what occurred back in ’88, then I believe the best method would be to acquire several small samples from several different areas of the shroud. You should remember though, these samples must still be quite large, (single threads would not suffice). As I mentioned before, with todays technology, I believe a 2 to 3 mg weight of pure carbon is necessary for a legitimate test. That’s pure carbon, the weight of the actual sample being cut would then need to be approx.16 mgs, if my calculations are correct. Furthermore, as I’ve mentioned several times before on this blog, I don’t believe a new c14 testing would be wise, until they can find a absolute solution to the contamination issue, especially when dealing with fabrics. R.","date":"2013-08-19","mins":"10:56 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41629","author":"ron","post":"Yannick, Hugh is actually correct. To retrieve several pieces of thread from all over the Shroud and combine them would be to completely defeat the whole purpose of acquiring dissimilar samples. They probably have more then enough material sitting in containers right now, from the 2002 restoration. Enough material possibly to do a dozen tests. But please do not underestimate the issue of contamination. The complete area of the Shroud is so contaminated, from centuries of exposure to all types of elements, its possible it can never be properly tested. Think of the Shroud hanging or stored in caves, cathedrals, wherever, with oil lamps burning all night long, (the only source of artificial light used for centuries) and the Shroud flax soaking up all that carbon….How possibly could they extract that from the Shroud? …At the moment I don’t think it’s possible and until it is, a new series of c14 testing is best left on the back burner. R.","date":"2013-08-19","mins":"11:31 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41632","author":"ron","post":"” I think you’re confusing “listen to” and “agree with.” – …Maybe so, and I agree some of his suggestions were ‘out there’, but they should have at least understood the importance of dissimilar samples and the contamination issue, which from what I got out the book, was to Meacham, the biggest issues and I don’t think he was alone in stressing these points to the Shroud custodians. R.","date":"2013-08-19","mins":"11:39 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41182","author":"ron","post":"Here is where you seem to be very “LOST”. What Emmett said is “AT THE MOMENT OF HIS RESSURECTION”…meaning at the precise moment of the resurrection (whatever the resurrection was), not a moment before or after. Meaning it was a human corpse till that precise moment and at that precise moment something happened which caused a instant image to form. A very quick moment later the corpse was gone (risen). Get it now?…geez. R.","date":"2013-08-13","mins":"9:58 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-18363","author":"ron","post":"I really don’t know what Fanti is talking about. First I have never read a forensic report that states the noise was broken! In fact medical forensic specialists have stated it is not broken but that cartilage has been displaced i.e shifted…Big difference. Second I look at the expended image above and I see signs of impact damage. But if Fanti says the curvature is evident on other coins then my argument is void. Would be nice to see these other coins to evalute this curvature ourselves. I also question his confidence that the image was clearer in ancient times. How can he be so sure. Would’nt the body image get equally darker with the rest of the cloth? Leaving the contrast the same but just darker? R R.","date":"2012-10-26","mins":"12:50 pm","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","title":"More from Fanti on the skewed nose"},{"id":"comment-5435","author":"ron","post":"Looking at the comparison images, the resemblance is uncanny. One of the best paintings/renderings of the Shroud face I’ve ever seen. Is the date known, of that painting? R..","date":"2011-12-11","mins":"12:38 pm","url":"https://shroudstory.com/2011/12/11/more-on-great-armenian-art-and-possible-shroud-of-turin-connections/","cat":"art","title":"More on Great Armenian Art and Possible Shroud of Turin Connections"},{"id":"comment-5466","author":"ron","post":"A good thing to do is to compare the painting above side by side with the ‘actual’ negative image seen naturally on the Shroud, “as the artist would have seen it”, then compare. It is astounding actually how close this artist got to a perfect rendition, (as compared to many others). R.","date":"2011-12-12","mins":"7:34 pm","url":"https://shroudstory.com/2011/12/11/more-on-great-armenian-art-and-possible-shroud-of-turin-connections/","cat":"art","title":"More on Great Armenian Art and Possible Shroud of Turin Connections"},{"id":"comment-207270","author":"ron","post":"The whole Da Vinci hypothesis is simply ludicrous to say the least. For the many reasons Dave B of Wellington has stated, plus lets not forget the simple fact it has been scientifically attested that the image was NOT PAINTED, no pigments, no binders etc… Then there is the St. Catherine’s Christ Pantocrator painted in 550ad which matches the Shroud we see today with dozens of points of congruence and shows several Vignon markings. It should be established by now the Pantocrator artist used the Shroud as a model, as many coins and other paintings of the 5th and 6th centuries did also…Point is we know from this Pantocrator the Shroud we have today IS the Shroud which existed before Da Vinci 100% and before the alleged carbon14 dates. Ron.","date":"2015-08-02","mins":"10:08 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","title":"Not a Work of Art by Leonardo da Vinci"},{"id":"comment-6233","author":"ron","post":"The Paintings from the catacombs in Rome were in all probability not even ‘known to exist’ until their recent find, in very recent times. These places were of the utmost secrecy to the early Christians. Secret places for them to gather and pray~in light of the persecutions. This can be considered and proposed, from the fact that early renditions of Christ were of a young strapping non bearded blond haired youth, reminiscent of Apollo! Yet almost immediately after the finding of the Mandylion (Image of Edessa) in the mid 6th century, hidden in the west gate of Edessa, hidden since possibly the 1st century, the “caricature” changed to the one we see in the Pantocrator and many other renditions found throughout the ancient world, and with an uncanny resemblance to the face we see on the Shroud. What are the chances of this being a “New Invention”, especially with traits as the double image? and a NAKED Jesus? …In my humble opinion, the notion that this was an ‘Invention’ out of the blue, is actually quite laughable to say the least. R.","date":"2011-12-28","mins":"5:01 pm","url":"https://shroudstory.com/2011/12/28/more-on-waldemar-januszczak-doesnt-think-the-shroud-of-turin-is-real/","cat":"art","title":"More on Waldemar Januszczak doesn’t think the Shroud of Turin is real"},{"id":"comment-6430","author":"ron","post":"I’m aware of the non existant pre 6th century history of the Mandylion, no one including Wilson has proported to know of such, …just conjecture. But the finding of the Image of Edessa, such as it was called, in the apex of a gate in 525ad, is very interesting. Would someone hide a fake relic in the apex of a gate? Basically hidden for centuries? Or maybe it was just made up? That would be quite a hoax or joke don’t you think? …Very implausible to my mind. Something was found in that gate and whatever it was it was found to be ‘not made by the hand of man’. I would guess myself it was the actual Shroud as we do not know when it was placed in the gate, could have been at anytime prior to 525ad…Which does not go against your scenario, which I must say is quite plausible and would explain alot of things. I had the same thoughts as you when I first saw the fresco from the catacombs, it looked too similar to the Shroud image to be just coincidence and I still ponder on that thought. It may just be a ‘clue’ that the Shroud was ‘known of’ or ‘witnessed’ in those early centuries by some early christians, but it’s presence kept secret for reasons we already know… R.","date":"2012-01-01","mins":"7:11 pm","url":"https://shroudstory.com/2011/12/28/more-on-waldemar-januszczak-doesnt-think-the-shroud-of-turin-is-real/","cat":"art","title":"More on Waldemar Januszczak doesn’t think the Shroud of Turin is real"},{"id":"comment-207346","author":"ron","post":"I think it is extremely unlikely. If the original had been destroyed, what exactly did da Vinci use as a model to “perfectly replicate” the original? Was he aware of any copies, such as the Christ Pantocrator? …No record of him visiting St Catherine’s monastery by the way. Leonardo kept notes of ALL his works, yet no notes on the most astounding of his works? …Da Vinci may have been good, but sorry I think he would fall immensely short of producing the Shroud image we witness today. An image which has attributes not even discernable by the human eye!…As Dave B says; It’s over….. Next ludicrous hypothesis… Ron.","date":"2015-08-03","mins":"10:20 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","title":"Not a Work of Art by Leonardo da Vinci"},{"id":"comment-6434","author":"ron","post":"Yannick, FYI; The St Catherine’s monastery is located in the Sinai desert at the foot of Mt Sinai, not Palestine. The Pantocrator is much too close to the Shroud image itself, like 70+ points of congruence and in the placement of facial features, to have been created from a copy. It can then be concluded, that the pantocrator was painted, with the artist being in ‘direct view of’ and ‘in of the measurement’ of the Shroud itself!…That is NOT only in my opinion. R.","date":"2012-01-01","mins":"7:39 pm","url":"https://shroudstory.com/2011/12/28/more-on-waldemar-januszczak-doesnt-think-the-shroud-of-turin-is-real/","cat":"art","title":"More on Waldemar Januszczak doesn’t think the Shroud of Turin is real"},{"id":"comment-207347","author":"ron","post":"I don’t think anyone has even contemplated that the Sudarium has been painted. The multitude of scientific studies done on the Sudarium markings show pretty well they were extrusions of blood/pericardial fluid…1 part blood 6 parts peri fluid…I doubt highly anyone in Da Vinci’s time or earlier were aware of this or it’s meaning..","date":"2015-08-03","mins":"10:27 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","title":"Not a Work of Art by Leonardo da Vinci"},{"id":"comment-33538","author":"ron","post":"Not to be argumentative, but I don’t believe that was their conclusion exactly. As a matter of fact I think their conclusion was; They do not know what caused the image, …but then postulated it resembled a scorch. R.","date":"2013-05-11","mins":"11:37 pm","url":"https://shroudstory.com/2013/03/01/observations-consistent-with-a-medieval-artist/","cat":"art","title":"Observations Consistent with a Medieval Artist?"},{"id":"comment-4598","author":"ron","post":"Haha, I heard this story the other day on the news. Maybe the image was just a reflection of the poor patient lying on the bed in agony. I’d assume a testicular tumor may sometimes be painful, or maybe the docs just weren’t being gentle enough. R..","date":"2011-11-05","mins":"1:46 pm","url":"https://shroudstory.com/2011/11/05/the-latest-in-pareidolia-face-in-tumour/","cat":"pareidolia","title":"The Latest in Pareidolia: Face In Tumour"},{"id":"comment-191121","author":"ron","post":"Not mentioned; The other 3 students were blind ; ).","date":"2015-02-15","mins":"10:52 am","url":"https://shroudstory.com/2015/02/14/a-hung-jury-on-the-pray-manuscript/","cat":"news_&_views","title":"A Hung Jury on the Pray Manuscript"},{"id":"comment-4705","author":"ron","post":"Firstly, I think someone should educate Mr.Dorment on a couple of things. One being the Sudarium has no facial image, Two; the Shroud image has definitively been proven not to be a painting. As for the painting being an LDV work, I am no expert, but I would question it being so from some of my personal observations; One, the ‘facial’ proportions are off from typical LDV paintings, especially the eyes. Two, it is unlike LDV to have a portrait facing directly toward the observer in any of his paintings (in saying this, if it was a work of LDV, I would surmise it is his rendition from possibly viewing the Shroud)…dispelling the above mentioned issues. But the hands do have a striking comparitiveness to LDV’s style. I might suggest though that Mr.Dormant just lost his Fiver. He can just deposit it into my Paypal account. ; ) R.","date":"2011-11-10","mins":"4:18 pm","url":"https://shroudstory.com/2011/11/10/quote-for-today-did-leonardo-paint-this/","cat":"art","title":"Quote for Today: Did Leonardo Paint This"},{"id":"comment-15441","author":"ron","post":"LMAO! Now that is funny…Poor elderly lady, well intentioned, but most likely suffering from cataracts or some vision infliction nonetheless, has managed to destroy what she intended to restore…She must feel terrible! R.","date":"2012-08-24","mins":"12:32 pm","url":"https://shroudstory.com/2012/08/24/please-keep-her-away-from-the-shroud-of-turin/","cat":"art","title":"Please keep her away from the Shroud of Turin"},{"id":"comment-4778","author":"ron","post":"The globe with a cross usually held in Christ’s left hand, symbolizes Jesus’s reign over the whole earth…if i remember correctly. R..","date":"2011-11-13","mins":"3:15 am","url":"https://shroudstory.com/2011/11/10/quote-for-today-did-leonardo-paint-this/","cat":"art","title":"Quote for Today: Did Leonardo Paint This"},{"id":"comment-16004","author":"ron","post":"It wouldn’t be the first time experts could prove to be wrong! As you mentioned earlier, much has been lost from the past, it only takes one find to ‘flip’ the experts concensus on it’s head!…With all of Belting’s learned knowledge, it seems to me (from what little I’ve managed to read), and I don’t claim to be an expert, but it seems that part of what he states could be described as ‘speculation’,…no one is immune to this. I’m not completely sold in Wilson’s hypothesis dealing with the Mandylion/Shroud, but I believe there are bits of circumstantial evidence in it’s favour. Furthermore, Wilson has never claimed all Jesus depictions derived from the Shroud/Edessa image, just that depictions/style suddenly changed in the mid 6th century and this can be attested to by the many Pantocrator icons, which should not or can not be overlooked, especially since they have numerous congruences. Sure there have been similar bearded depictions of Christ found deep in the catacombs of Rome, but who can say these were widespread? Early depictions found all over the byzantine empire, pre 6th century did not follow this depiction! So why the abrupt change and suspiciously around the same time a mysterious image “not made by man” turns up in Edessa? R.","date":"2012-09-07","mins":"5:53 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","title":"Quote for Today: Hans Belting and commentary"},{"id":"comment-4789","author":"ron","post":"For some tantilizing thought, the painting shown in your last link, painted by LDV. Actually, there was a cross at the top of the orb, originally, but apparently he tried to paint it out…Look close you can still see remnants of it. R..","date":"2011-11-13","mins":"5:14 pm","url":"https://shroudstory.com/2011/11/10/quote-for-today-did-leonardo-paint-this/","cat":"art","title":"Quote for Today: Did Leonardo Paint This"},{"id":"comment-16060","author":"ron","post":"I think thats a very good point Max! R.","date":"2012-09-09","mins":"2:18 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","title":"Quote for Today: Hans Belting and commentary"},{"id":"comment-16107","author":"ron","post":"Daveb, If I may, I’d also like to add that the 6th C Mozarabic rite reveals much more then just interest in the burial cloths! The rite purportedly written by St. Leander sometime around 595 AD, actually may show that to ‘atleast’ a small circle of people, the Shroud was known, and known to have a full figure on the cloth. Or at the very least, a knowledge of such a clothes actual existence was proported. Seeing as St.Leander had ventured to Constantinople between 579 and 582, and had connections, very high in the hierarchy, it can be postulated that he was made aware of these details or he may have even ventured to Edessa himself. But as he would have to follow the Discipline of the Secret, he would be limited in the expression of such facts, hense the mysterious sentence showing up in his lithurgy. ‘The First Historical Reference to the Image on the Shroud The old Spanish Lithurgy’ Mark Guscin. BSTS No.71, June 2010. R.","date":"2012-09-10","mins":"1:37 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","title":"Quote for Today: Hans Belting and commentary"},{"id":"comment-15954","author":"ron","post":"Davor, don’t make the same mistake made recently by Stephen. Jones. There can be several editions of the same book with alterations to page count and even subtitles. R.","date":"2012-09-06","mins":"5:29 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","title":"Quote for Today: Hans Belting and commentary"},{"id":"comment-15899","author":"ron","post":"I’d really like to hear your reasoning for not taking Rev. Dreisbach’s writings seriously, and moreso why you do so because of that specific quote? I’d also like to hear your interpretation of that specific line from scripture. Thanks, R.","date":"2012-09-05","mins":"3:00 pm","url":"https://shroudstory.com/2012/09/04/so-what-is-the-problem-ian-wilson-freeman-jones-or-this-cult-of-ours/","cat":"art","title":"So what is the problem: Ian Wilson, Freeman, Jones or this “cult” of ours?"},{"id":"comment-17043","author":"ron","post":"I tend to lean towards Scavone’s hypothesis on this matter. As you say Dave, Wilson’s hypothesis tends to rely on a ‘very’ hypothetical genealogy and not much else. The only way I see the Templars involvement with the Shroud is that they ‘may have’ been given assignment in the safe delivery of the Shroud (amongst many other relics) back to France. Which is quite plausible considering their standing at the time and the confidence in their abilities in such matters. They were the Fedex or UPS of their time! So it stands quite plausible that they may have had the Shroud in their possession for a short period. R.","date":"2012-09-28","mins":"11:40 pm","url":"https://shroudstory.com/2012/09/28/templecombe-it-is-almost-too-exciting-to-think-about/","cat":"art","title":"Templecombe:  It is almost too exciting to think about."},{"id":"comment-8328","author":"ron","post":"Colin; Even in your link, remember that image is ALSO enhanced with more contrast. Some forget here that when seen ‘directly’ the image on the Shroud is NOT what we see in photos…I’m not saying anything new here I know, but it seems it needs mentioning. R.","date":"2012-02-15","mins":"6:48 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","title":"The Shroud of Turin: a pale shadow of its former glory?"},{"id":"comment-8414","author":"ron","post":"How on earth did this topic get from The Shroud of Turin: A pale shadow of it’s formal Glory to a naked guy and his discarded sheet? LOL. Lets’ try to stay on topic folks…But interesting reading nonetheless ; ) R.","date":"2012-02-17","mins":"8:04 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","title":"The Shroud of Turin: a pale shadow of its former glory?"},{"id":"comment-8330","author":"ron","post":"Talk about believe what you will!!! There is absolutely no proof the mandylion was in Paris in 1241 or 1242?, a cloth with an image was described in a list, nothing more… No precise description, no painted renditions, nothing!. Nothing to prove is was the Mandylion. You keep mentioning “majority of historians outside the pro Shroud world”…can you please refer us to some of their writings? R.","date":"2012-02-15","mins":"7:10 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","title":"The Shroud of Turin: a pale shadow of its former glory?"},{"id":"comment-8463","author":"ron","post":"Thanks for the links Daveb : ) R.","date":"2012-02-19","mins":"10:40 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","title":"The Shroud of Turin: a pale shadow of its former glory?"},{"id":"comment-6213","author":"ron","post":"Re; Update I would also guess Mr. Januszczak is not aware of the Christ portrait found in the catacombs in Rome dating around 300 AD. Which by the way also bears a striking resemblance to face seen on the Shroud. Although dated to 300 AD some believe it may be of an earlier date, possibly even the 1st century and quite plausibly painted by someone whom actually had seen Jesus. R.","date":"2011-12-28","mins":"7:22 am","url":"https://shroudstory.com/2011/12/27/waldemar-januszczak-doesnt-think-the-shroud-of-turin-is-real-but/","cat":"art","title":"Waldemar Januszczak doesn’t think the Shroud of Turin is real, BUT . . . (Updated)"},{"id":"comment-6090","author":"ron","post":"Merry Christmas Everyone! : ) Best Wishes to All. Ron.","date":"2011-12-24","mins":"4:19 pm","url":"https://shroudstory.com/2011/12/24/wishing-everyone-a-most-blessed-christmas/","cat":"art","title":"Wishing Everyone a Most Blessed Christmas"},{"id":"comment-6191","author":"ron","post":"I don’t think it takes an expert in ‘Art History’ to note this was not a piece of art created by some medieval or anyother period artist. I think people like Januszczak, tend to errogantly believe other’s lack the abilities to critic such things. I for one, can instinctly recognize this is not a artist’s rendition, “Just on viewing alone”. I don’t even have to mention facts such as the 3 D encoding, as I think anyone with eyes and even mediocre knowledge in art can recognize that this image on the Shroud is UNIQUE in it’s ‘qualities’, ‘realism’, and definately not ‘representative’ of any medieval paintings AT ALL….NOT EVEN CLOSE! It is an incredibly ridiculous claim by one who is supposed to be knowledgeable in such matters. R.","date":"2011-12-27","mins":"6:02 pm","url":"https://shroudstory.com/2011/12/27/waldemar-januszczak-doesnt-think-the-shroud-of-turin-is-real-but/","cat":"art","title":"Waldemar Januszczak doesn’t think the Shroud of Turin is real, BUT . . . (Updated)"},{"id":"comment-8329","author":"ron","post":"Big +1 to both Daveb and Joe Marino’s comments!….Exactly my thoughts and actually directing to Joe’s first paragraph, was what I was alluding too in my last comment to the VIGNON MARKINGS post. R.","date":"2012-02-15","mins":"6:54 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","title":"The Shroud of Turin: a pale shadow of its former glory?"},{"id":"comment-12139","author":"ron","post":"Colinsberry :The text that accompanies my close up fails to appear on that link Ron. Never mind. What should be clear to all is that while there are indeed 5 holes among the red crosses, they are NOT in an L shaped pattern. They instead form an approximate rectangle with a tail, so are totally IRRELEVANT where “L shaped” poker holes are concerned. I also think you display a total lack of objectivity in imagining that a region of the manuscript covered with red crosses represents part of a Shroud that is elsewhere said to show a herring bone weave, and you do not earn kudos by telling others to get glasses to see things that ARE NOT THERE. You are no scientist, Ron, and I suspect you never will be, based on present performance. Maybe if you were a scientist, you would begin to understand the irritation that I and my scientifically qualified compatriots feel about non scientifically qualified documentary makers who try to tell us how to do our jobs, who hijack scientific congresses in an attempt to extricate so called consensus views, who use their privileged access to the Shroud to adorn their blog with an HD close up that had hitherto been kept hidden from bona fide researchers like myself, with possibly more still to come, and who, last but not least, blocks access to the comments on his site to anyone whom he perceives as off message – his message. Oh, and to deploy the term “heliorectal syndrome” is not the same as crudely labelling with the A word, not if you know your Greek and Latin. It is a reference to sunshine, and a subtle indication whence it can originate in some people who have too high an opinion of themselves – like prescriptionist documentary makers who attempt to elicit scientific sound bites that chime with their own opinions instead of reporting objectively on what real scientists are actually thinking and doing… Lack of Objectivity eh! LOL Colin seriously, have you ‘looked’ closely at the pokerhole burnhole patterns on the Shroud? The main burn pattern of the 4, actually has 5 discernable holes (and can be deduced as a (P) pattern) if one wishes, the least of the four patterns has barely 4. The artist may have been depicting this has he saw it. So no, the 5 holes to 4 holes is not irrelevant. Who’s not being objective now? I’m glad I’m not a scientist, if scientists prove to be as errogant, self assured, and as blinder fitted as you. ; ) Colin, David Mo et.al; I’ve read and viewed all your post and linked pictures…You have all decided your experts in art, show a number of paintings etc; showing a lid and decide on your own that this depleats the importance of the Pray Codex,…simply nonsense. The artist of the PC may or may not have been following a trend in the depiction of the burial scene art of the time but that does not take away from the ‘idea’ that certain liberties were not taken, in the sense that the artist in question or someone close to him had seen the Shroud in person and decided to add the several identifying marks to thier depiction. David’s argument that we must also look at things missing as opposed to things being there is right, look at most all other paintings; See anything missing? Maybe all these other artists never actiually saw the Shroud, most probable since it went missing for 150 years after the fall of Constantinople. One must not dismiss Orthodox symbolism SHOWN on the PC as opposed to all other depictions shown. T He red crosses do mean something has not only for their shape but for their colour, but you guys would know that from your extensive knowledge wouldn’t you? One must also respect the Orthodox rules of depictions of icons, to understand certain hidden(?) details. Simply put, in my mind, all the other paintings you have shown, although interesting, and honestly I had seen many of them before, do NOT eliminate the PC as a depiction of the Shroud… As for the comments pertaining to Art Historians not being interested in the PC, I see it no different then the many scientists of the world ‘clamming up” about the disastrous C14 dating and it’s irroneous, if not untruthful result. Bunch of self centred, egotistical ass wipes only worried about their reputations. Again I’m glad I’m not a scientist. Ron.","date":"2012-06-10","mins":"8:48 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"}]
