[{"id":"comment-29737","author":"ron","post":"Yannick you are forgetting the most important difference between the blood found on the Sudarium verses the Shroud; Pulmonary fluid…This in itself could possibly explain the colour difference. R.","date":"2013-04-07","mins":"6:51 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29816","author":"ron","post":"Yannick Clément :No Ron… I wasn’t talking about the mixture of blood and a clear liquid. I was talking about some bloodstains we found on the Sudarium that came from puncture wounds. These bloodstains are not composed of a mixture of blood and a clear liquid but only of blood. And unlike the bloodstains we found on the Shroud, these bloodstains on the Sudarium are dark like any normal ancient blood. I don’t know Yannick, the blood around the puncture wounds do not look any darker then the blood on the rest of the Sudarium. There are actually some other darker spots in various areas other then the puncture holes. It would seem it depends on the lighting used when the Sudarium is photopgraphed how dark certain spots appear. R.","date":"2013-04-07","mins":"9:19 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30368","author":"ron","post":"Colinberry; “This ain’t no normal blood we are looking at.” Finally, someone sees the light. This ain’t no normal blood is absolutely right, it is the blood of Christ….Mystery solved. R.","date":"2013-04-11","mins":"1:09 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-14475","author":"ron","post":"Excellent points Kelly! No other “Independent Confirmation” is needed!…Heller and Adler’s paper was published in a “PEER REVIEWED JOURNAL” (Canadian Society of Forensic Sciences Journal), a very distinquished journal. Meaning; The findongs have already been independently confirmed. So why are H&A’s results still questioned??? This is much more then can be said for papers such as; the Carbon14 paper released in 1989 in Nature. Although Nature may claim the paper was peer reviewed, no official report on the testing has ever been published, even the Church has not received a report as yet!!…Yet Shroud opponents will use this paper as PROOF the Shroud is fake…go figure. R.","date":"2012-08-04","mins":"10:15 am","url":"https://shroudstory.com/2012/08/03/did-the-bloodstains-really-precede-image-formation-on-the-shroud-of-turin/","cat":"blood_studies","title":"Did the bloodstains really precede image formation on the Shroud of Turin?"},{"id":"comment-11051","author":"ron","post":"I must say, I am 100% in agreement with something Yannick has said. Mc Crone’s analysis of the blood was simply mediocre in comparison to the multiple tests done by Heller and Adler…This is a fact usually and most deceitfully left out by Shroud opponents. R.","date":"2012-05-02","mins":"1:41 am","url":"https://shroudstory.com/2012/05/01/blood-question-wheres-the-salt/","cat":"blood_studies","title":"Blood Question: Where’s the Salt?"},{"id":"comment-10546","author":"ron","post":"The studies done in ’78 found that the blood had seeped thru the fabric to the backside of the cloth. They found this when they unstitched parts of the Shroud from the backing cloth and ran light probes under the cloth. This was also confirmed during the 2002 restoration when the backing cloth was completely removed. As for the image; again in 2002 they also believe what they found was a ‘partial’ face image on the back side of the ventral image, coinciding, with the ventral face image. Apparently no other part of the cloth; ventral or dorsal showed any image except as mentioned above. As for image under the blood, I believe this was confirmed by a couple of researchers in that when a blood flake was lifted or broke away from the threads the linen was completely white underneath. It escapes me right now who these researchers were, sorry. R.","date":"2012-04-18","mins":"3:19 pm","url":"https://shroudstory.com/2012/04/18/did-he-say-blood-underneath-the-hands-or-was-he-misquoted/","cat":"news_&_views","title":"Did he say blood underneath the hands?  Or was he misquoted?"},{"id":"comment-14554","author":"ron","post":"Yannick Clément :If you read Rogers book, you don’t have a sense at all that he thought “that diffusion (alone) COULD NOT HAVE CREATED THE IMAGE”… He NEVER wrote anything like that in his book. Maybe he wrote something of that nature on the SSG or in a conversation with someone. Anyway, I don’t think anyone has the right to categorically (without any doubt) state that “diffusion (alone) COULD NOT HAVE CREATED THE IMAGE”. When you read Rogers book, you have a sense that he was not discarding that possibility IF VERY PARTICULAR AND RARE CONDITIONS WERE REUNITED. I think it’s much more prudent and correct to think that way, even if I agree on the fact that, on a probabilistic scale, it seems more probable that there was another phenomenon that took part in the image formation along with a gaseous diffusion. But having said that, I also want to emphasize the fact that it surely doesn’t mean at all that this other possible phenomenon was related with the Resurrection of Jesus Christ. And maybe (just maybe because we don’t know yet) this other phenomenon was just in fact something very similar to the alternative hypothesis proposed by Thibault Heimburger in one of his SSG paper concerning the urea that could have been present everywhere on the skin (and on the hair) after the drying of the sweat… Yannick, Rogers did definately make that statement in his paper. I am not making it up. Furthermore, I also think anyone with any sense can “catagorically” make the statement “that diffusion alone could not have created the image”, just as well as one can claim diffusion alone could. The proof is in the science and the science so far has no answer…so let’s leave it at that, already. R.","date":"2012-08-06","mins":"6:31 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"id":"comment-39073","author":"ron","post":"Daveb of wellington nz : The point being that neither the disciples, or first converts from Judaism, nor Paul’s gentiles, would have lived and died for such a religion, unless they believed that the Resurrection had a factual reality. They would not live and die for such, if it were only a vague psychological awareness, or if they saw it as a parable, or an illusion! Exactly! It has also been proven through science that it could not have been ‘illusions’ of Christ by the witnesses. Example; Jesus appearing in the room with basically all the disciples present, as stated quite nicely by Dr. Timothy Mc Grew in one of his lectures on the reliability of the Gospels, one would have to believe all the disciples had the same illusion and one where Jesus ‘asks’ for a fish, one disciple reaches to another to give the fish to Jesus and they all envision that they see him eating the fish!…..It’s nonsense to believe it was anything but real eye witness testimony….Why would they make this up? The resurrection was not even a understanding in their beliefs….One should read N.T Wright also on this very issue of resurrection. Ron.","date":"2013-07-16","mins":"1:05 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","title":"Erase the fact from the list. It is not a fact. It never will be."},{"id":"comment-14513","author":"ron","post":"Geez Yannick that one went way over your head. Colinsberry was joking, and referring to the extreme brightness/colour of Fanti’s tie l Ol…Take a close look at Fanti’s tie in the picture above Yannick. R.","date":"2012-08-06","mins":"1:11 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"id":"comment-14542","author":"ron","post":"Daveb; “Both of these properties seem to rule out any kind of gaseous diffusion as being the primary cause of the image,…” Exactly, but what Yannick doesn’t understand is that we who oppose this scenario DO NOT rule it out completely as a ‘possible’ vehicle. Even Rogers made statement to this in his paper! He was well aware that diffusion (alone) COULD NOT HAVE CREATED THE IMAGE. Another phenomena was present. What this phenomenon was is the Million dollar question. I would also state that I tend to believe the gaseous diffusion hypothesis has issues in explaining the very high resolution of the Dorsal image(especially), and also as gases are known to eminate from the orifices first and foremost, to explain the amazingly precise imaging of the face area, where most gases would be present. I also tend to refute ‘lightning’ as having any possible chance of being a catalyst in the process, as the body was inside a tomb surrounded by rock. Earth quake? possible but not probable, but needs more study. R.","date":"2012-08-06","mins":"3:29 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"id":"comment-15820","author":"ron","post":"Yannick Clément :Precision : When I say that “I don’t think anyone has the right to categorically (without any doubt) state that “diffusion (alone) COULD NOT HAVE CREATED THE IMAGE”, it is simply because science has not yet evaluate completely and correctly this hypothesis of Rogers IN EVERY POSSIBLE CONDITIONS REGARDING A 1st CENTURY BURIAL OF A TORTURED AND CRUCIFIED JEW. So, from a strict scientific point of view, no one can be as sure as Ron seems to be that this hypothesis alone could not have created the image.” I’m sorry but thinking that way is not correct scientifically, simply because it is mainly speculative (and also very premature versus the lack of experimentations done to test that hypothesis). Sorry for the late post here, hope you see this; Yannick, if you don’t believe me that Ray Rogers himself said “the maillard reaction ‘by itself’ was not the solution, that something else was going on” …please ask our friend Barrie Schwortz. He just happened to mention this ‘specifically’ in his interview on the Dr John radio show, which Dan posted a link to recently. R.","date":"2012-09-03","mins":"11:31 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"id":"comment-39969","author":"ron","post":"The scratch marks have been attributed to possibly the thongs from what I have read and also show as what appears to be welts. The actual ball remnant markings could actually be segments of torn skin. Anyone here ever experience having skin torn off to the muscle? I have unfortunately and the wounded areas were very reminiscent of what I see on the Shroud. These wounds would not stop releasing small amounts of blood throughout the surface of the wound, even with pressure added. For this reason I believe they are torn skin wounds. R.","date":"2013-07-28","mins":"1:51 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40036","author":"ron","post":"I have taken it to understand ALL blood flows from the MAJOR wounds would not have been washed, since there would have been life’s blood mixed within them. Hence no washing of the arms, hands, feet, head or specifically the chest wound area. All other areas are suspect, I have mentioned in another post the idea that when the garments were removed when they reached the cross, that this alone could possibly be a reason for the re opening of many of the scourge wounds. Once wounds are reopened, they tend to want to stay open. I doubt Jesus’s body or garments would be completely dry also, especially taking into mind he carried a heavy cross, or cross beam for hundreds of meters. R.","date":"2013-07-29","mins":"10:03 am","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-39968","author":"ron","post":"According to Jewish customs, criminals or victims of violence would not be washed is what many are relying on here. This we can not be absolutely sure of, as we get our knowledge of from laws drawn up well after Jesus’s time, when the Jews were in exile. Even if it were true, Jesus was buried by loved ones, ones that honoured him. I would think it dishonourable in their minds to NOT give him a ‘proper’ burial, which included proper washing. It would have been done in haste surely, but still done. PS; I find the idea that a body could not be washed to a finer detail accuracy of 2cm is laughable. Maybe stated by someone whom has never actually done any fine detailing in their lifetime lol? R.","date":"2013-07-28","mins":"1:40 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40038","author":"ron","post":"In one of his papers, Zugibe states ‘clearly’ that corpse’s can still bleed, even many hours after death, as he witnessed this many times during his numerable autopsies. The trickle of blood on the lower back is interesting, consider the body already wrapped in the Shroud being shifted from side to side as it is now being ‘bound’, whilst a flow from that particular wound is present and being most likely a mixture of blood and pulmonary fluid, making it very viscous. Probable? I think so. The Shroud itself shows signs of this from other wounds, especially the feet. So not so hard to discern. R.","date":"2013-07-29","mins":"10:22 am","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-39965","author":"ron","post":"Well said Hugh! Many of the ideas you mention I’ve contemplated for a long time, but have been unable to put them to so clear words….Thank you. The remnants of dirt on the knee, feet and nose can easily be explained away as you so mentioned. So no issue there, and it definitely should not be used as a ‘clue’ the complete body had not been washed. R.","date":"2013-07-28","mins":"1:14 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40422","author":"ron","post":"Thanks for this explanation. I was a little confused about the hematomas. But now understand clearly. Q; What is it called if only a thin layer of skin is ripped off and blood is emanating slowly and pooling slightly in the wound? Thanks, R.","date":"2013-08-04","mins":"9:18 am","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40252","author":"ron","post":"Yes, they are your ‘ideas’ and others can and will think otherwise. You claim my idea of the body being covered in dirt by the time it reached the tomb a Special Assumption? LOL. Reading many of your comments, I see numerous Special Assumptions made on your part, so many I have not the time to refute them all. It seems some of my comments go unnoticed in that I think my ‘assumption’ that the body after being taken from the cross would have been laid on the GROUND and thus dirty makes more sense then many of your assumptions. Remember the body needed to be removed from he cross and the nails removed, this may have taken some time and required the body shifted whilst on the ground. Golgotha, the place he was crucified was apparently an old quarry and being so, would have been conducive to LOTS OF DIRT! …Take a body completely covered in blood, even semi dried blood, roll it around on the ground and witness the miracle that it does get covered in dirt. Special assumption? I think if you use your Occam Razor, you would conclude it is the most probable conclusion. You make the assumption that there was no storm, you make the assumption the whole head area was not washed. You make I believe the assumption that washing, meant scrubbing when it could have simply been careful ‘dabbing’. You make assumptions of how the body was prepared and how or where it was laid. Especially that those completing the burial would have followed the law and not washed the body, and/or that the burial was not complete. I could go on forever here, but I don’t have the time..","date":"2013-08-01","mins":"11:46 am","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40261","author":"ron","post":"Yannick Clément : That’s your opinion… You always stuck to your preconcieved notions while I was open minded enough to let the door open to jesterof’ hypothesis, nevermind the fact that there was most certainly no washing. Did you read my arguments against a dirty body? It doesn’t seem to me that you did. Here they are (in my answer to argument #2): https://shroudstory.com/2013/07/28/guest posting challenging frederick zugibe on washing of the body/#comment 40188 Forget about the Golgotha being a rock and consider only my arguments concerning the forearms and head regions that were certainly not washed, and nevertheless, were able to produce a good body imprint, as well as many bloodstains on the cloth. This tells you that these body parts were certainly not very dirty even though they were not washed. So, if it is like that for these body parts, why thinking otherwise for the rest of the corpse (at the exception of the few areas where STURP have found some dirt)? You accuse me of “sticking to preconceived notions” LOL. I’ll leave it to the others here to decide who is STUCK in his PRECONCEIVVED NOTIONS (Ideas). R.","date":"2013-08-01","mins":"1:30 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40260","author":"ron","post":"David Goulet : You raise a good point about the ground and removal of the body. Was the body lain on the ground itself, or perhaps another cloth different than the shroud (the already soiled tunic from the march to Golgotha), or a piece of wood? Dabbing indeed is much different than washing. I agree that if it was Jesus’ followers who removed him from the cross and prepared his body they would not have cared about any prohibition regarding cleaning the corpse of a man condemned as a criminal. To them he was no criminal. As always more questions than answers. Well I will admit a lot of my thinking comes from the studies wrought from the Sudarium of Oviedo, which some here might refute, but I believe through much reading, was the actual cloth that covered Jesus’s face/head while on the cross and until reaching the tomb. In the studies of the blood traces/flows, they state that the forehead blood trace was caused by the body being placed face down on the ground and against a hard object. They also deduced the body stayed relatively in this state for almost an hour before being turned over and carried to the tomb. As for the washing; to assume it was done in a wiping motion or that some areas were too tight to actually wash, is simply preposterous and yes, I agree that the followers absolutely would not have considered Jesus a criminal and it is quite possible they did not follow the law when it came to such….he was their Rabbi! R.","date":"2013-08-01","mins":"1:25 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40314","author":"ron","post":"YC; “Note especially the very strong argument I bring you to show you that all of Jesus followers were all pious Jews who wanted to follow the Law, on the contrary of your preconcied idea…” ….Well there you go Yannick, you just answered the million dollar question; Is the Shroud authentic? ….I guess NOT, since Jesus’s followers wouldn’t dare retrieve, let alone touch the bloody Shroud of a dead man, thus breaking the Jewish laws of the time, and being pious men that is. ; l R.","date":"2013-08-02","mins":"11:26 am","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40423","author":"ron","post":"Oh my God! Good bible experts, do you mean bible scholars? Biblical referrals to storms as interventions?… No scholar would ever claim this sort of thing. Just because the bible refers to storms in many cases, does not mean that what was described during the crucifixion as a darkening of the sky, followed by an earth quake, would be one and the same!….That’s just in your mind. You seem to believe the apostles infused a lot of fictitious information into their writing, and this is clear from many of your statements. This notion of yours, along with your claims there are a lot of contradictions in the Gospels is simply not true and shows your lack of knowledge into the matter. Do you prescribe to the Jesus Seminar by chance? It sure sounds like it. R.","date":"2013-08-04","mins":"9:46 am","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-39966","author":"ron","post":"Why would one think the scourge wounds would be mostly ‘blunt’? From the descriptions I have read of the Flagrum, the balls were definitely not smooth “ball bearing” in their shape, but rough pitted and sharply edged metal balls or rough edged bone. These would have ripped at the skin and muscle underneath, in most cases, inflicting some major damage. I think many including our friend Yannick here have underestimated the damage inflicted by the Flagrum, most definately. R.","date":"2013-07-28","mins":"1:22 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40333","author":"ron","post":"Yannick Clément : In order to buried someone, Jewish or not, you MUST touch his dead body Ron! That’s an obligation that was in order at the time Pilate gave his permission to do the burial… And that’s why I don’t think there were many men who did the job because of the ritual uncleanness they had to take by doing so (by the way, an uncleanness requiring only to observe certain rituals to become purify again): 2, 3 persons at the max in my mind. But the reality is this: someone had to do the job and don’t forget that, by doing this, those who did the burial helped the Jewish Law to be respected concerning the legal prohibition to let the body on the cross after sundown. I know there were others manners to observe this rule but no matter what you think, they helped to accomplish the Law that day by placing Jesus’ body in a tomb… But in the end, I don’t care: you can keep up thinking Jesus’ followers were not pious Jews… I don’t care even if I know this is completely false. One thing’s for sure: the simple fact that no one of them dared to go to the tomb to finish the job the next day (i.e. Saturday, which was the Sabbath day) should be enough for anyone with an open mind to understand how pious these Jews who followed Jesus were… I see your up to your old tricks of shirking the point by suspiciously seeming ignorant of my point. The point was; If they were pious and observed the Jewish law to a ‘T’, who then retrieved the Shroud? According to Jewish law this would be a big no, no…So then we should assume, they being pious Jews, they would not dare retrieve ANY item from the tomb, hence the Shroud can not be authentic. Furthermore, to clarify, my point has absolutely nothing to do with the touching of a corpse during burial, That is a completely different matter altogether. R.","date":"2013-08-02","mins":"11:12 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40401","author":"ron","post":"Preconceived notions again…Even IF his followers thought Jesus was alive again, since the Shroud was covered by the BLOOD of a deceased person, they still, by law could or would not have touched it, let alone carry it off. Simply because it held the blood of the once deceased. The Pharisees would have had then stoned them to death for acquiring it, and from what I understand Jesus never appeared to the Pharisees, so they would have assumed Jesus was still dead. Which according to scriptures they did and accused the followers of steeling the body.The fact that it was illegal for them to possess ANY burial cloths, explains no mention of what happened to them, or no mention of them ever again. R.","date":"2013-08-03","mins":"10:33 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-9864","author":"ron","post":"“We live these nearly two thousand years later” This statement brings up an issue I’ve been contemplating lately…Has any real serious study gone into knowing exactly when it would be 2 mellennia from the date of the crucifixion? Given all factors can we know this date? or atleast a range of dates? It’s been on my mind ‘strongly’ for some unknown reason lately, any info or links would be appreciated. Thanks, Ron.","date":"2012-04-02","mins":"8:12 am","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9908","author":"ron","post":"So whats the consensus on the anniversary date of the crucifixion/ resurrection? LOL …will it be in our lifetimes? Ron.","date":"2012-04-03","mins":"7:53 am","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-10306","author":"ron","post":"Max. I am quite aware of these dates, but my question is what year will they convey a 2 millenium anniverary? Taking all factors into account, e.g; leap years and all other dating changes over the period…For instance take the date April 3, 33 as close as we can calculate what will be the 2000 year anniverary of that date? That is what I ask. R.","date":"2012-04-12","mins":"7:31 am","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9909","author":"ron","post":"Oh and sorry, I’m not thinking ‘second coming’ here, just curious has to what is presently calculated as the best possible date? …so I may correlate it with a trip to Jerusalem ; ) Ron.","date":"2012-04-03","mins":"8:00 am","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-17381","author":"ron","post":"I think Royal Canadian/Bill summed it up pretty well with this statement; “The fact that he has hitched his intellectual wagon to Jacobovici really should help us decide if he is qualified to call other scholars ideas into question.” …or to be taken seriously at all I would add, as Jacobovici is a total joke. As to Tabor’s insistence that he sees a ‘fish’ on the ossuary; It is simply unbelievable! I have viewed a documentary where they totally rip Tabor’s theory apart; For one they show several other first century ossuaries found in tombs in the vacinity of Jerusalem, and these have cleary ‘amphora’ etched on them. When I see the ‘fish’, I see relatively the same amphora as shown on the other ossuaries, I just can’t understand how one can make such a mistake? Anyways, main point is I am wondering about Mr. Tabor’s credibility; If Mr. Tabor, as I would assume, would have some experience in first century tombs and ossuaries, then he would be quite aware of the amphora designs found on many ossuaries previous to this find….So how can he honestly mistake this one as a fish? R.","date":"2012-10-09","mins":"4:21 pm","url":"https://shroudstory.com/2012/10/08/james-d-tabor-taken-aback-claims-about-the-shroud-blood-x-and-y-chromosomes/","cat":"blood_studies","title":"James D. Tabor Taken Aback:  Claims About the Shroud Blood X and Y Chromosomes"},{"id":"comment-15602","author":"ron","post":"Hi Max, thanks for calling me a Arch Miraculist, I’ll take that as a compliment, as I believe all evidence points exactly to that. By the way, what is “cryptovolumetrics” exactly, I can’t seem to find it in the dictionary? R.","date":"2012-08-29","mins":"10:34 pm","url":"https://shroudstory.com/2012/08/28/mr-prolifics-latest-an-exceptional-article-by-yannick-clment/","cat":"blood_studies","title":"Mr. Prolific’s Latest: “An exceptional article by Yannick Clément”"},{"id":"comment-8427","author":"ron","post":"I agree with Maria’s comment mostly, except I believe the ramifications of this information has far greater implications then just to refute the late Dr. Mc Crone’s theory…far more. I just happened to go to my personal physician yesterday for my annual, as I’ve mentioned before he is somewhat of a Shroudie also, anyways I directed him to Dr Kearse’s post and he confirmed to me that the whole notion that any blood can revert to AB in particular is nonsense and couldn’t fathom someone making that distinction… Thanks again to Dr Kelly Kearse for her wonderful tutorial. R..","date":"2012-02-18","mins":"6:20 am","url":"https://shroudstory.com/2012/02/17/kelly-kearse-hit-a-grand-slam-home-run/","cat":"blood_studies","title":"Kelly Kearse hit a grand slam home run"},{"id":"comment-15731","author":"ron","post":"Agree with Dave 100% It’s a tantilizing mystery. R.","date":"2012-09-02","mins":"3:02 pm","url":"https://shroudstory.com/2012/08/28/mr-prolifics-latest-an-exceptional-article-by-yannick-clment/","cat":"blood_studies","title":"Mr. Prolific’s Latest: “An exceptional article by Yannick Clément”"},{"id":"comment-15622","author":"ron","post":"Max Patrick Hamon :Ron, SADLY the true fact is ONLY ideollogically biased observations misconceptions, misinterpretations and misrepresentations “point to that” g.od of the gap arch miraculistic solution… I cannot help thinking the latter has nothing to do with GEN Ui NE Christian INNER CERTITUDE in Yeshua’s raising from the dead! Max your doing it again! How do you know FOR SURE, that it is not YOUR ideological, biased observations, misconceptions, misinterpretations and misrepresentations that at work here? Do you actually believe in your head you have the only ‘correct’ answer to the questions of the formation of the image on the Shroud? …Pretty high status you give yourself Max, …NOT a very humble Christian virtue! Actually in English we’d call that; “Having A Swelled Head” ; /….Oh and the question I asked at the end of my comment, it was an honest question and was not a derogatory one. It is a shame you took it as such. R.","date":"2012-08-30","mins":"10:34 am","url":"https://shroudstory.com/2012/08/28/mr-prolifics-latest-an-exceptional-article-by-yannick-clment/","cat":"blood_studies","title":"Mr. Prolific’s Latest: “An exceptional article by Yannick Clément”"},{"id":"comment-15786","author":"ron","post":"Max you are not seeking the truth, you are seeking your ‘interpretation’ of the truth. You are a ‘Naturalist’ by your own admission, by stating exactly what you claim you are not! I submit that you DO care whether it was a natural or a supernatural cause, and this is clear in your attacks and name calling on anyone who may believe in a supernatural causation!! The fact you state I am ‘brainwashed’ and that I “blindly accept” pseudo sindonlogical dogma, hense I am a arch miraculist proves my point. You assume I and others, who may have come to the same conclusion as I, have not studied the Shroud indepth, and/or with an open mind! This cannot be farther from the truth, and a terrible assumption on your part, not to mention insulting. You think I just blindly follow others ideas? Nonsense! I do not agree with much that has been written, but I have studied, as best I can, all that I’ve managed to acquire and in depth! As I’ve mentioned before; From my understanding of all pertinent evidence available: I have come to the conclusion that the image formation was almost certainly not man made, and it is improbable it was a ‘natural’ phenomena….You don’t have to agree with my conclusion Max, but don’t go calling me or others names or insulting me because I think different from you. R.","date":"2012-09-03","mins":"12:40 pm","url":"https://shroudstory.com/2012/08/28/mr-prolifics-latest-an-exceptional-article-by-yannick-clment/","cat":"blood_studies","title":"Mr. Prolific’s Latest: “An exceptional article by Yannick Clément”"},{"id":"comment-15655","author":"ron","post":"So you are a ‘Naturalist’. Which obviously brings it’s own biases into the picture. No different then an athiest’s point of view. Only that science is your religion….I’m hoping your not throwing in STURPS conclusions as “Swollen untruths or halftruths” as that would just verify my statement that you have a swelled head. If believing, from what I gather and understand of the Shroud image’s qualities, leads me to believe the Image is miraculous, i.e; Not possibly made by man or have a natural causation, How does that possibly mean I have a swelled head Max? …Makes no sense to me. R.","date":"2012-08-31","mins":"1:48 pm","url":"https://shroudstory.com/2012/08/28/mr-prolifics-latest-an-exceptional-article-by-yannick-clment/","cat":"blood_studies","title":"Mr. Prolific’s Latest: “An exceptional article by Yannick Clément”"},{"id":"comment-8415","author":"ron","post":"As for the blood being dry or not, and the postmortem bleeding etc; If no one has already read so: I would suggest reading Dr.Fred Zugibe’s paper; “The Man of the Shroud was Washed” at http://www.shroud.com/zugibe2.htm ….I think it is quite reasonable in it’s claims and could explain alot. R.","date":"2012-02-17","mins":"8:19 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8351","author":"ron","post":"WOW, is all I can say! This is going to take me a while to digest (with much study I must admit). Who would have thought we would get such an informative post so quickly on this matter? My sincere thanks and appreciation Kelly. Ron.","date":"2012-02-16","mins":"7:09 am","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8422","author":"ron","post":"Well like I said Chris; the hypothesis is quite reasonable in it’s claims and ‘COULD’ explain alot of things…but still just an hypothesis!!…I tend to gravitate, looking at all the blood evidence (and I am no forensic expert also but just from life experiences, common sense and what the evidence shows); to that the body must have been ‘atleast’ partially and quickly cleansed with water, inlight of Sabbath. Hense the reason not much dirt has been found on the body! Dirt has only been found on the sole of the feet, tip of the nose and I think the chin and one knee. It also could explain the re dampening of already dried blood from the more prominent flows like the hands, forearms, scourges etc;. Plus possibly the release of blood from open wounds, which has been very well illustrated in the paper. I also surmise, same as you they didn’t have the time to fully prepare the body and hense scriptures telling us the woman would return after the sabbath to complete the burial rituals and the reason no ‘trace’ of spices or herbs have been found on the Shroud; (that I know of). I agree with you on the side strip usage as proposed by Dr. Jackson, it just makes sense! They had to use something to hold the body in place, right? They had to improvise inlight of the lack of time…I can’t think of anyother reason for a side strip being removed from the Shroud and then resewn that makes any real sense other then Jackson’s proposal. R.","date":"2012-02-18","mins":"4:33 am","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8461","author":"ron","post":"Max Patrick Hamon :Ron, actually, there is a couple of archaeologically coherent hypothese for the resewn side strip. I know there are! but they do not make as much sense as compared to this hypothesis. They are really reaching with evidense on the Shroud that can prove them wrong. This is if you are talking about the same hypotheses I have read of. R.","date":"2012-02-19","mins":"10:23 am","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8685","author":"ron","post":"Are you talking about the two small (pieces strips) missing from the ends of the whole side strip or are you saying there was another larger strip cut off before, aswell as the known side strip? R.","date":"2012-02-24","mins":"11:39 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8373","author":"ron","post":"Colin, …Ever think, reason being you have never had or read of a specimen that was severly beaten, scourged to near death, pearced multiple times about the head, and then nailed to a cross for hours??? …Maybe if you can find a rat big enough you can attempt to follow the above scenarios upon it and then check out it’s bilirubin levels, but make sure you let it know your going to do these things to it first, so to raise it’s psychological stress levels also. ; ) R.","date":"2012-02-16","mins":"7:01 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8324","author":"ron","post":"“There can be no such thing as degradation to type AB”…Interesting statement! So if what you say is true, what exactly has everyone been talking about for decades now?….This would mean Adler amongst many other’s got it wrong?… just speculation, conjecture? To me anyways, this is an important issue, I would have expected others with much more knowledge then I, would have recognised this before and brought it forth. I’d really like to hear another view to this most interesting statement you make. Oh and Colin I did click the link, I fear very little, but being a complete laymen, I had very little idea what it meant, as to your very cryptic post ; ) …Anyways thanks. R.","date":"2012-02-15","mins":"6:14 pm","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","title":"New thread on type AB blood: Does all old blood become AB?"},{"id":"comment-8229","author":"ron","post":"Thanks Dan, If anyone is interested just follow the first link above “responded to a reader…”, scroll down to the posting by bippy123 on February 7, 2012 and read on…From further reading I found out that apparently back in 2005 there were some DNA and other studies done on a number of mummies by a Robert Connelly and he identified the blood group from the mummy of Akhenaton as A2, using two different methods; ABO blood typing system and the MNS system. Apparently Tutankhamun’s blood type is also A2 and this evidently was known before the above tests. This blood is 3400 years old! and that means theres good reason to believe that both the Shroud and Sudarium’s blood was originally AB! Thoughts? …. R.","date":"2012-02-14","mins":"8:38 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","title":"New thread on type AB blood: Does all old blood become AB?"},{"id":"comment-8424","author":"ron","post":"Right on Daveb! Thats the point here; if AB is the original blood type and add that to the numerous other evidence MATCHING the Shroud and Sudarium, taking in of course the “probability factors”, means we have very strong evidence now that the two items were “intimately related” and did at very close periods in time, contacted the same body! Hense totally refutting ANY proposed carbon dating dates, as the Sudarium can be literally traced back to the early 6th century…Furthermore, now that the Sudarium can be said in all probability to be the actual cloth that covered Christ’s face; gives us pretty precise timing of occurences following Christ’s death on the cross to his actual burial in the tomb. R.","date":"2012-02-18","mins":"5:50 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","title":"New thread on type AB blood: Does all old blood become AB?"},{"id":"comment-8249","author":"ron","post":"I’m guessing, from the lack of respondents here, that this topic is not as important as I thought lol…The fact that 3500 year old blood has not reverted to AB as we’ve been told all blood does, does not seem to highten anyone’s curiosity, is simply a mystery to me!… I’ve heard the statement (that all blood reverts to AB) for years now but have never seen any scientific documents (FACTS) to this, and I’ve searched, believe me. In my mind this statement is possibly just ‘conjecture’ and has never been scientifically proven. Where is the proof for this statement? On the otherhand we have from (RECENTLY TESTED and using 2 methods of testing), 3500 year old blood still showing it’s original A2 blood grouping? The ramifications of this to the authenticity of the Shroud and it’s counter part the Sudarium of Oviedo is huge. Atleast to me it seems so…It means; Blood does not revert to AB after so many centuries or that AB is a more recent blood group i.e. Only 1300 or so years, it further strengthens the hypothesis that the Shroud and Sudarium are intimately connected and in all probability contacted the same body! ….Q; Am I just getting carried away here over nothing? R.","date":"2012-02-14","mins":"6:31 pm","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","title":"New thread on type AB blood: Does all old blood become AB?"},{"id":"comment-8426","author":"ron","post":"Sorry error above; should read; traced back to the early 7th century..","date":"2012-02-18","mins":"5:53 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","title":"New thread on type AB blood: Does all old blood become AB?"},{"id":"comment-8284","author":"ron","post":"So what are you saying (In Layman’s terms), that degradation of Blood types is not just simply the loss of antigens? Which is basically all I’ve understood was the case. Or basically that it may be simply hogwash? …My knowledge in this area is extremely lacking, so please elaborate. R.","date":"2012-02-15","mins":"9:03 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","title":"New thread on type AB blood: Does all old blood become AB?"},{"id":"comment-209295","author":"ron","post":"Oy vey. Did you not understand my previous response?.","date":"2015-08-30","mins":"5:41 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209277","author":"ron","post":"Uh, you DO NOT wish to engage me in this manner, believe me. Also, let’s not hijack what has become a SCIENTIFIC discussion here. I came here to clarify my identity, not to argue or debate about doctrine. My mention about my conclusions regarding “Jesus” was only for the purpose of offering a more complete bio of myself, NO MORE than that..","date":"2015-08-29","mins":"7:03 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-25083","author":"ron","post":"Hugh Farey :Simples? If only. If the body was washed before being enshrouded, then what are those trickles doing along the arms? Are they from Jesus waving his arms about just before resurrection? it is clear that Chris B knows rather more about the biology of resurrection than I do. When the heart begins beating, for instance, does it not immediately pump out a fair proportion of the blood through the five major holes in the body? How quickly does Jesus sit up, and doesn’t he feel so faint that he immediately loses consciousness? And having re animated, does does he flip the shroud off with his arms before sitting up? Or does he slide out sideways? Or sit up with the shroud still covering his face? Although these questions sound flippant, they have direct implications for the appearance of the image on the shroud, and cannot be avoided if we follow Chris B’s line of thinking. Other resurrection experts have assumed the body simply de materialised, with or without a burst of energy of one kind or another, the shroud collapsing through the void thus created, and some non believers think the shroud was simply folded back by the Essenes, who lifted Jesus, alive or dead, away, leaving the cloth behind. Evidence shows the blood was not disturbed, therefore the Shroud could not have been simply pulled or lifted away from the body…so much for the Essene theory. As for the washing of the body and why there would still be blood on the body; I think some reading on your part into the ancient burial practices and beliefs of pias Jews is warranted. These beliefs and practices could explain the presence of blood, even if the body had been washed. R.","date":"2013-02-20","mins":"5:53 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-38823","author":"ron","post":"For 1, lets not forget how ‘impossible’ it would be for an artist to actually add the “exceptionally detailed” blood stains to the image, when the image is almost impossible to discern from within so many feet and 2, to do so without leaving any trace of applying such, i.e. No brush strokes, directionality etc.. R.","date":"2013-07-10","mins":"10:05 am","url":"https://shroudstory.com/2013/07/06/reader-has-jackson-come-to-realize-this/","cat":"blood_studies","title":"Reader: Has Jackson come to realize this?"},{"id":"comment-13946","author":"ron","post":"It’s obvious from your list of facts (erroneous as they may be) Matthias, that you have not studied the Shroud in any depth whatsoever!!! In fact most of the supposed ‘facts’ you list are pretty typically found on athiest non authenticity sites…I’ve seen/read all those you mention above, many times before. It’s good to hear you claim your a Christian, but I would suggest you do take the Shroud seriously, and do some research before you start making comments such as “It’s you shroudies who have to get real!!!”….seriously. R.","date":"2012-07-18","mins":"11:58 am","url":"https://shroudstory.com/2012/07/17/reality-get-real-colin-berry/","cat":"blood_studies","title":"Reality: Get Real Colin Berry"},{"id":"comment-13991","author":"ron","post":"I’m not going to write a whole book here to show the flaws in your points, you can search and read just as well as anyone. You can start at shroud.com where there you will find dozens of papers written and some cover the issues you posted. Furthermore it is up to you to support your evidence, so I ask you to point us to where you received your ‘so called’ evidence…. I will address your first point nonetheless, as I have time right now; “The figure in the Shroud is over 6 feet tall, he would have been a giant if he existed in Jesus’s time” Typical garbage put out by Shroud skeptic authors; 1 Scientific studies have shown the actual height of the man on the Shroud to be anywhere from 5′,7″ to 5′,11′ tall, approximately, as it is very difficult to access proper measurements from the Shroud, it being a porous material and susceptible to stretching and shrinking. 2 Many archaeological studies have found that the [average] Jewish male in palestine in the first century, stood approximately 5′,11″ tall. This was concluded from study of hundreds of skeletal remains found to date in the Isreali/Palestinian area. Roman males on the other hand were known to be short compared to the Jewish population being on average 5′,4″ in height…these are scientific facts, which are indisputable. So in fact Jesus may have been on the short side for a Jewish male if he stood 5′,8″ and only average at 5′, 11. R.","date":"2012-07-19","mins":"4:47 pm","url":"https://shroudstory.com/2012/07/17/reality-get-real-colin-berry/","cat":"blood_studies","title":"Reality: Get Real Colin Berry"},{"id":"comment-14444","author":"ron","post":"Matt, think about it; If there was a cap of thorns, wouldn’t it also block the image of the forehead or back of the head image? …There was no cap of thorns when the image formation occurred, I think that can be concluded simply by studying the image. There is no top of the head image for the same reason there is no side images, as the cloth would follow a vertical plain in that area. Whatever the image mechanism was, it SEEMS to have worked in a vertical projection ONLY, hense no side images. The evidence is pretty clear on this and has been agreed upon by most Shroud experts. As for Colin’s new peave on the fact there is no image under the blood, he just can’t accept that it is a FACT, which we have covered before on here and also has been agreed upon by most Shroud experts. R.","date":"2012-08-03","mins":"8:44 am","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But."},{"id":"comment-26550","author":"ron","post":"One must also wonder, if so many were crucified; Why has in only one circumstance, has evidence been found of a crucifixion victim in the escavation and study of hundreds of tombs surrounding Jerusalem? You’d think was hundreds of thousands of victims. More would certainly show up. R.","date":"2013-03-05","mins":"6:27 pm","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone"},{"id":"comment-27032","author":"ron","post":"Hugh Farey :Yes, I thought there’d be repercussions. Daveb is, of course, eminently sensible, but Ron – if my style of argument is wrong, don’t fall into the trap of using it yourself. My figure of 100 000 crucifixions was based on 1 per day (for 200 years), which I think is a fairly mild assumption, plus, according to Josephus, 500 a day during rebellions. Is that unreasonable? Upon what do you base your “Maybe only 5000 were crucified during the whole period, for all we know” come from? That’s only 10 days rebellions’ worth. Next. You “would assume the taking down of the bodies and proper burial were NOT honoured” when Josephus specifically mentions that they were. Next: “Chances are spearing was a rare and unusual practice.” Now I’m guessing, I admit, but it’s a lot harder to smash a wooden beam against somebody’s legs than to run a spear into their heart. If a crucifixion victim were clearly already dead, the token stab with a spear seems an eminently more efficient guarantee of death than going to the trouble of breaking his legs. What makes you think spearing was rare and unusual? Next: “the excessive scourging as testified by the shroud.” The bible is quite specific in saying that the scourging was not excessive. Whatever, was excessive scourging rare? According to wikipedia (yes, I know) flagellation was used as a prelude to crucifixion, and at least four Roman authors refer to victims who died of their floggings. Next: “the crown of thorns.” What crown of thorns? The Shroud shows numerous bleedings from the scalp, not a crown of thorns. Instead of mocking a man who claimed to be king, a wreath, cap or helmet of thorns could have been inflicted on any leader of any riot, or a soldier, or anyone else who wore identifying headgear. Finally. Where are all the crucifixion victims’ skeletons? Why has only one turned up? Perhaps they have been found. Crucifixion, it seems, may well have left no damage to the bones, as the nails slid past them. The one heelbone we have with a nail right through it would be a clumsy exception to the rule. The associated armbones are undamaged (although some archaeologists claim slight abrasions to the inside edges, others don’t). Nope, I don’t think my assumptions are extraordinary at all. Hugh I think you should go back and read Josephus a little closer. He states clearly that they ‘used’ to bury them properly, but not at that particular time. Meaning except for his few friends, which were taken down, most all that were hanged during the revolt were left to rot. The Romans spared very few, only the woman and children, whom were sold into slavery during and after the revolt in 68…The Romans would not have cared one morsal about Jewish law at that point. Earlier revolts or uprisings in early first century bce or ce palestine were just as violent and uncarring, where most, including woman children were also smited. Where did my 5000 figure come from? Out of a hat just like your 100,000. No one can make an educated or proper guess at the amount crucified. Did Josephus actually count his 5000 a day? doubt it very much, so again an unknown number, that was my point. It could just have been far far less then you GUESSED. Most all of the other comments I made, such as spearing being a rare occurance or the crown “cap” of thorns being used in distinction are not my personal thoughts, but thoughts by others whom have far more knowledge then I into ancient practices. Who am I to contest what the experts say? I’m just passing on what I have read. R.","date":"2013-03-10","mins":"9:00 pm","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone"},{"id":"comment-26549","author":"ron","post":"Hugh’s list is chock full of extraordinary assumptions; 100,000 people crucified? How does one know this? Maybe only 5000 were crucified during the whole period, for all we know, and most would have occurred during the destruction of Jerusalem in 68ad, where I would assume the taking down of the bodies and proper burial were NOT honoured as the Romans would not give a rats a** then about Jewish customs…Then 25% would have been speared instead of having the legs broken? Where does he get that figure, out of a hat? Chances are spearing was a rare and unusual practice. Practically, one could speculate it occurred only 5% of the times. Scourging? Normal? Not from what I have read. Scourging yes, but not the excessive scourging as testified by the image on the Shroud. The crown of thorns is still one very strong point as how many crucified victims do we have knowledge of, that claimed to be a king? Then take the excellent point made by Daveb into account, and one must certainly see the chances are extremely low that the man depicted on the Shroud is anyone other then the crucified Christ. R.","date":"2013-03-05","mins":"6:17 pm","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone"},{"id":"comment-26547","author":"ron","post":"I’m with you on this Gabriel! The c14 dating done in 1988, atleast to those that have studied radiocarbon dating, it’s methods and shortcomings would have to be BLIND not to see it is not the answer and cannot be used to any certainty on the Shroud with all it’s contamination accumulated over the centuries. A new test would most likely be futile. R.","date":"2013-03-05","mins":"5:58 pm","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone"},{"id":"comment-25769","author":"ron","post":"Thank you Thibault! Someone finally speaking from reason. It’s funny how people can just simply disregard or question evidence from world class ‘EXPERTS’ such as Adler and Heller. This evidence SHOULD NOT be questioned or diregarded so easily, otherwise then, we should question so much ‘worldy’ evidence we have come to accept in all respects… This statement says it all; The protease was only active against the serum coated fibers and as in previously study revealed smooth, non corroded fiber surfaces indicating that the blood images went onto the cloth before the image forming process and protected the underlying cloth”…this is science not pseudo science as Colin is so found of practicing. R.","date":"2013-02-26","mins":"6:03 pm","url":"https://shroudstory.com/2013/02/26/that-is-not-what-one-would-expect-to-see-if-the-blood-first-dogma-were-true/","cat":"blood_studies","title":"That is not what one would expect to see if the blood-first dogma were true."},{"id":"comment-35673","author":"ron","post":"Bare with me folks, I haven’t been keeping up lately and may mention thoughts here that have been mentioned before. The question of whether billirubin by itself, or as part of some combined chemical reaction being responsible for the reddish colour of the blood found on the Shroud is a daunting one. Recently, and several times actually, Yannick Clement has questioned why the blood found on the Sudarium (proposed back of the head area) does not have the same colouring as the blood found on the Shroud and hense has questioned the authenticity of the Sudarium in doing so. This line of questioning along with a couple of comments made in this post has sparked a thought in my mind; Could it be possible that because the Shroud and Sudarium may have been ‘processed’ differently be the cause for this fact? Maybe the specific way the Shroud linen was processed and it’s specific chemical properties, along with a reaction to the billirubin enhanced blood could be the reasoning? Therefore explaining the non reddish blood found on the Sudarium. Thoughts? … Thanks, Ron.","date":"2013-06-02","mins":"12:47 am","url":"https://shroudstory.com/2013/06/01/the-orphaned-manuscript-and-the-color-of-blood/","cat":"blood_studies","title":"The Orphaned Manuscript and the Color of Blood"},{"id":"comment-25770","author":"ron","post":"Sorry typo error, should read as; as Colin is so fond of practicing. R.","date":"2013-02-26","mins":"6:06 pm","url":"https://shroudstory.com/2013/02/26/that-is-not-what-one-would-expect-to-see-if-the-blood-first-dogma-were-true/","cat":"blood_studies","title":"That is not what one would expect to see if the blood-first dogma were true."},{"id":"comment-36186","author":"ron","post":"Yannick this is not the first time you have referenced the “Mel Gibson” movie and the flogging…You seem to think the ‘balls’ used on a flagrum would be perfectly round and smooth such as a ball bearing, …this is far from actuality and in actuality these balls would be in high probability, very crude renditions of a ball, meaning; sharp pits and edges along their circumference, not to mention they also used mutton bone on the throngs. This means there would be extensive bleeding and multiple contusions. You seem to want to downplay the intensity of the scourging and it’s devistation on the human body, just remember how scourging using the flagrum was described in ancient times;…The cruelist of all tortures. R.","date":"2013-06-05","mins":"11:19 am","url":"https://shroudstory.com/2013/06/01/the-orphaned-manuscript-and-the-color-of-blood/","cat":"blood_studies","title":"The Orphaned Manuscript and the Color of Blood"},{"id":"comment-10708","author":"ron","post":"Pont neuf…..???.","date":"2012-04-22","mins":"12:34 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","title":"Was Adler’s Analysis Science?"},{"id":"comment-10797","author":"ron","post":"Max, I really wish you would stop bombarding blogs with mutiple incoherent posts. You make it difficult for other’s posts to be picked up, literally making them lost in a minefield of babble….I beg of you. Ron.","date":"2012-04-23","mins":"11:28 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","title":"Was Adler’s Analysis Science?"},{"id":"comment-13904","author":"ron","post":"One needs to ask, is it actually possible to radiocarbon date blood? Does the human blood acquire C14 isotopes while it is ‘alive’ and flowing/ regenerating? This I would like to have answered by an expert in the field… Furthermore, I think Gabriel makes a good point as C14 dating blood would probably have more issues then C14 dating linen, which all experts agree is problematic on its own, due to unseen or untraceable contamination. There are many examples of erroneous readings from linen in archaeological studies…it’s nothing new. Another reason I find it unbelievable that so many accepted a single testing of the Shroud sample, NOT suggestive of the whole Shroud…Colin again, is grasping at straw. R.","date":"2012-07-16","mins":"5:50 pm","url":"https://shroudstory.com/2012/07/15/why-not-carbon-date-the-blood-on-the-shroud-of-turin/","cat":"blood_studies","title":"Why not carbon date the blood on the Shroud of Turin?"},{"id":"comment-13877","author":"ron","post":"Now Colin is an expert in blood…unbelievable! Question is why Dan keeps rehashing this Sciencebod. R.","date":"2012-07-15","mins":"5:26 pm","url":"https://shroudstory.com/2012/07/15/why-not-carbon-date-the-blood-on-the-shroud-of-turin/","cat":"blood_studies","title":"Why not carbon date the blood on the Shroud of Turin?"},{"id":"comment-13878","author":"ron","post":"Oh almost forgot to ask; How possibly did this artist happen to know to use a specific type of blood; (AB), which also jives with the Sudarium and with traces of bilirubin to boot? and how possibly did he manage to place this blood on the Shroud before the image (or even after the image), without any trace of application type or form, and also manage to mimic exactly, forensically perfect blood markings? …Get real. R.","date":"2012-07-15","mins":"5:36 pm","url":"https://shroudstory.com/2012/07/15/why-not-carbon-date-the-blood-on-the-shroud-of-turin/","cat":"blood_studies","title":"Why not carbon date the blood on the Shroud of Turin?"},{"id":"comment-13989","author":"ron","post":"It seems clear; Colin has NOT done much research in this area, as there are many examples of study on ancient blood which can be found easily through some simple Google searches. Further to Hiemburger’s list above lets not forget [Otzi the Iceman] and his 5300 yr old blood cells, or the 2000 yr old blood found on Obsidian knifes at the Canlona site in Mexico or the fact that Thomas H Loy found blood residue on a 10,000 yr old [slab of stone] in Turkey, blood on a slab that had undoubtably been exposed to the elements for millennia, and blood in which he was still able to analyze quite well…I think Colin’s (amongst other’s) futile attempts to disregard the true scientific studies done by Adler, Heller and Ballone on the blood of the Shroud, experts in their field and, proving it is human blood, has put him in a corner and he now blindly reaches for nonsensical solutions. R.","date":"2012-07-19","mins":"3:59 pm","url":"https://shroudstory.com/2012/07/19/yes-blood-on-the-shroud-really-could-be-really-old/","cat":"blood_studies","title":"Yes, Blood on the Shroud Really Could Be Really Old"}]
