[{"id":"comment-38411","author":"ron","post":"Damn, I see the threads he’s talking about. It looks possibly like a smaller type thread weaved in between thread 18&19. Two threads can actually been seen, a main thread apart, one below the other. Sure looks like a mending to me. Interesting… R.","date":"2013-06-29","mins":"9:04 pm","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","title":"A bit of interweaving in the Arizona sample?"},{"id":"comment-38567","author":"ron","post":"Nice find Carlos, thank you. R.","date":"2013-07-03","mins":"12:04 pm","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","title":"A bit of interweaving in the Arizona sample?"},{"id":"comment-4596","author":"ron","post":"Think what you will, it’s your prerogative. But, also implying what some scientists are hypothesizing is ‘mystical answers’, is not absolutely correct science either. Truly, I don’t need to ask a scientist about anything, I can think for myself, thank you. Remember scientists once thought flight was impossible, scientists once thought the sound barrier couldn’t be broken, science once thought nothing moved faster then light~now that is being challenged. Point is; even these hypothesis being put forward, although they seem like fiction to many, are only so because we have not advanced enough. We are just at the beginning when it comes to scientific knowledge. One must search for all possible explanations for the amazing image on the Shroud. Seriously with all the study accumulated over the past three decades by some of the best scientists we have and they are all ‘mystified’ at what could possibly cause this image!!…That alone, my friend, speaks volumes! Yes I agree keep searching for ‘natural’ causes, but don’t put down studies in ‘unnatural’ causes because you may be putting your foot in your mouth. Personally, I believe the image was put there by God and that science will never figure it out. Maybe fitting, as God I believe would really like us to humble ourselves abit. This may be just the right tool to do so. R..","date":"2011-11-05","mins":"9:56 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-4565","author":"ron","post":"Yannick, I agree with some of your first points above, but when it comes to the Image process I have to disagree with you, (somewhat). Rogers himself, even admitted he had some issues with his Milliard hypothesis, meaning I think he knew in his heart it was not the answer…Namely explaining images in areas that had not touched the body. It just does not seem to work! Some STURP members are almost unanimous in that the image formation was not (to their present scientific knowledge), caused by any ‘KNOWN natural event’ ….THAT is exactly why some researchers started to look at unnatural causes!. Sturp was not focused on ‘supernatural causes’, in fact, their only purpose was to study whether the image was some type of art or forgery, which we all know they concluded it was not, as no pigments or bindings etc; were found on or around the fibrels. A ‘supernatural cause’ must be an alternative, although not testable with science, if nothing else is found. Much of the evidence points to that. On the flip side, I do realize much more research and study is needed and that the Sturp team has not concluded all of what they would like to do, so at the moment we are all basically in “Shroud Limbo” until certain folk allow further study. R.","date":"2011-11-04","mins":"11:48 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-4629","author":"ron","post":"Yannick I think your analogy of earthquakes etc is pretty weak. Some people today still think all natural disasters are from God. Some people today also believe science is the answer to everything. Those same people you talk about, if they saw an F 18 fly over their heads would believe it was a chariot from the gods, so what?. Again, we are not talking religious thinking here verse science. Your trying to shirk the point which is simply; Just because we don’t understand or presently don’t have the means to test something scientifically, does not mean it cannot be true. Again, we are in our infancy when it comes to our science, so how on earth can you deny that some hypothesis are bogus? …Who knows maybe sometime in the future, we may advance enough to test some of these hypotheses. Don’t forget, there are alot of theories and hypotheses out there right now in the scientific world that are only that, hypothesis and theories, not testable and/or not proved. I don’t hear you bitching about any of those. R..","date":"2011-11-07","mins":"4:38 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-4630","author":"ron","post":"Sorry; the line should read; so how on earth can you SAY that some hypotheses are bogus?.","date":"2011-11-07","mins":"4:43 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-4649","author":"ron","post":"Yannick you stated “this is pure science fiction”~ It wouldn’t be the first time that ‘science fiction’ became reality, would it?… I’ve stated my position and it is a ‘neutral position’, neither for or against either hyp/ theory, but to take any stand other then that, at the moment, would be plain quess work and assumptions. Strictly stating that the formation must be ‘absolutely a natural chemical reaction’ or ‘phenomena’ or Max’s position of “the image formation IS NOT SUPERNATURAL”, is just plain wrong and dare I say closed minded….Sure we can’t test body energy hypotheses at the moment and maybe never will, but it still does not put them in the ‘lunatic fringe’ department, …JUST UNKNOWN. Oh, also let’s not start getting into the scriptures here to back our positions, as that would be fruitless, scriptures can and have been interpretted differently for millenia.Scriptures also never mentions an image on the Shroud either. Chemical or otherwise. R..","date":"2011-11-07","mins":"2:26 pm","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-4677","author":"ron","post":"There is also nothing in the scriptures that back up some form of chemical reaction for the image, quite the contrary actually, as absolutley NO ONE witnessed the Ressurection!…just the aftermath…Furthermore the aftermath speaks of angels, and of Mary seeing Christ. Is this not supernatural? How did the the huge bolder enclosing the tomb get moved? Chemically?…What happened in the tomb was a mystery to those who found it empty. As for scientific study, and as of today, not one scientist has been able to explain the images ‘chemically’ or even offered a probable chemical cause that covers all the specific attributes of images (and I doubt they will) Why? Because it seems improbable if you understand all the intricacies of the image.But even with my doubt, I will not dismiss the possibility.You also cannot say that any radiation hypothesis is improbable only because we don’t have the means, ‘presently’, to test them….So unlike some other matters dealing with the Shroud, we’ll just have to agree to dissagree. As for converting people by using the Shroud as witness or a clue, whatever. Atleast to try to catch thier attention, forget it, I’ve tried, with family and friends…No one seems interested…to my sometimes dismay but also to my sadness..","date":"2011-11-08","mins":"7:19 pm","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-4556","author":"ron","post":"I’d like to say that the main point here is not Fanti’s and/or Roger’s hypotheses, conclusions or their opposition, but Fanti’s statement that a ‘supernatural cause’ may be to blame for the erroneous C 14 dating of 1988. As I said before, I don’t believe a supernatural cause needs to be even mentioned to explain the erroneous dates…. This is simply a case of a completely messed up, unprofessional C 14 analysis by all involved. Seriously, If more people would research how POORLY the whole process of dating the Shroud was accomplished in 1988, there would be absolutely no discussion on it further, except in trying to urge the Shroud custodians for further tests. To me the question of C 14 dating is null and void, meaning the 1988 dates are now fiction and meaningless. All should now be talking about other matters….like how to get the Vatican to okay further studies by expert teams of dedicated, non biased scientists, scholars etc; Maybe Dan can start a patition! Just my 2 cents worth. Ron.","date":"2011-11-04","mins":"10:18 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-4557","author":"ron","post":"Oh almost forgot; As for all the robes mentioned above, I think the chances of any of them being authentic is quite small and the worst part is they are all so contaminated, patched etc; it would be next to impossible to ever come to a scientific conclusion on them…and does that really matter when we have the most amazing relic left by God himself, in the Shroud? …I think not. Ron.","date":"2011-11-04","mins":"10:28 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-10065","author":"ron","post":"Max, I agree with you that the money would be better off used in other ways 100%, but I have a problem with one technical part of your hypothesis (again), sorry. It has to do with the ‘assumed’ body temperature. Take note; I am not a doctor or a medical student but have been doing alot of research into this matter. With that clear; I can not see the body ever reaching a temp of 40 C or even close. My Reasoning; The body had lost an excessive amount of blood well before death, this alone would lower the body temperature to a very low state, already causing the body to compensate, but then after death the body hung from the cross for atleast an hour and stayed out in the air for atleast two hours before being wrapped in the Shroud in the tomb. By this point the body temperature, one would ‘assume’ would be quite low already. The Shroud image shows no signs of putrefaction, no bloating, therefore one assumes the body left the Shroud before then and before any temperature increases due to internal decay could accumulate. One should expect the body temp would have continued to go lower due to the enviroment i.e; a cool tomb and cool temperatures. I may be completely wrong here, but from my studies it does not seem reasnable to expect the body to reach temeratures in the range you mentioned. If there is an expert in this field on this blog that can shed some light on this, I would be happy to hear it. Ron.","date":"2012-04-07","mins":"10:08 am","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins"},{"id":"comment-9804","author":"ron","post":"It’s no matter anyways, Dawkin’s won’t take on ANY challenge…He’s CHICKEN! …Won’t even take on William Lane Craig in debate lol. Bawak, bawak, BAWAK! ; ) R.","date":"2012-03-30","mins":"6:28 pm","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins"},{"id":"comment-33255","author":"ron","post":"Colinsberry :Some might think that the “Church and Gonella himself” got it right – and were understandably “obsessed by the preservation of the integrity of the relic”. Who wants to be remembered as a science obsessed vandal? Good, well planned science should cause minimal damage to irreplaceable historical artefacts (whether 1st or 13th/14th century provenance). That’s why the 1988 dating was not a fiasco – just the first step in a gentle probing with the then state of the art technology designed to cause minimal damage – while providing a provisional ranging shot answer. Even if medieval – how was the image produced? The Shroud is a marvel, whether seen as a religious relic or not… It’s taken up millions of hours of 20th/21st century minds, after all! State of the art? Your kidding right? The technology was relatively new, actually still in it’s infancy and having growing pains. Preliminary tests were done prior to the carbon dating of the Shroud and the results were for a kindly term, ‘lackluster”, Skewed dates, far surpassing any reasonable tolerance and with absolutely no answers as to why. Then we have the serious issue of contamination with the cloth, which they(all labs) did not properly address or take seriously enough. Still today there are big issues/problems with removing all contamination from materials such as linen/cloth etc., Finally the killer; All labs (as far as I’m aware) used underweight samples! Even after they had been schooled in the importance of the minimal weight threshold of 5mg, at the time…Thats MINIMUM, meaning anything lower and all bets are off and any dates would be suspect….State of the art.? LOL R.","date":"2013-05-08","mins":"2:06 pm","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-33337","author":"ron","post":"I don”t need to be schooled, but maybe you do. AMS was not the state of the art method in 1988, (that was my point), and you would know this if you were schooled..","date":"2013-05-09","mins":"12:14 pm","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-33299","author":"ron","post":"Hugh, one must understand that the ‘conversion factor’ between the weight of the cloth and it’s carbon weight is 24%. The weight of the cloth samples must therefore be a minimum of 20.83 mg to achieve the minimum threshold weight of 5mg carbon…NONE of the labs samples were 20.83mg, when divided. They were all much smaller, some less then 2mg after conversion, hense the issue. R.","date":"2013-05-09","mins":"1:33 am","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-33301","author":"ron","post":"All of Merinelli’s c14 references were of artifacts which had been buried for centuries. It must be understood clearly that the Shroud does not compare to all those samples, in that it has never been buried. It has been subceptible to unimaginable contamination. Everything from centuries of oil burning lamps, to fires, to countless human contact, and who knows what else. Radiocarbon labs even today have no idea how to deal with that kind of contamination, let alone the three labs way back in 1988. Because of this contamination issue, RCD is basically rendered useless in dating the Shroud. R.","date":"2013-05-09","mins":"1:54 am","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-33599","author":"ron","post":"Colinferry; “Of course AMS was the state of the art method in 1988, at least for precious artefacts where it was imperative to restrict sample size to the smallest then possible, while not compromising accuracy.” “While not compromising accuracy”! That was exactly my point Colin. AMS at that point in time (1988) had not proven accurate, not by a long shot. The PC method was by far, more accurate, hense NOT making the AMS system state of the art….get it? Just because a system requires smaller samples does not make it better. As I mentioned earlier they should have not ignored all the issues with the AMS system, especially since many of the issues they found, they no answers too. So again, state of the art?…..NOT. R.","date":"2013-05-13","mins":"10:26 am","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-33609","author":"ron","post":"You are obviously not understanding the point, again, maybe intentionally? At the time of the Shroud testing AMS was very new and none of the labs had much experience with the method, whereas the other method was fully understood and used for many years. Also prior to the 1988 c14 AMS only dating of the Shroud, a series of tests were performed to compare the different methods and reliability, the results; the AMS system proved less reliable and with a miriad of phantom dates, and as mentioned before ‘unexplained’ errors. Errors and dicrepancies never resolved before the Shroud testing. How do you explain this, if the AMS system is sooo much more accurate? The whole testing was a mess, from the selection of just one unreliable method, to the choice of just one sample from one area of the Shroud. Worse though was the labs accepting to the samples which would not be representaive of the whole, then cutting the samples to pieces much smaller then protocol suggested, then taking the contamination issue with no seriousness, and fianlly fudgung with the numbers to make all labs dates seem in comparison…It was a sham and a shame. R.","date":"2013-05-13","mins":"4:57 pm","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-33196","author":"ron","post":"David Goulet :Can someone, less a novice on this issue then me, explain the ramifications of this latest revelation on the carbon dating. If we already have reasonable doubt about the dating due to improper sampling, what difference does it make if the resulting samples are 7 mg or 20 – if in fact 2mg might be sufficient for dating? In football terms it almost feels like piling on at this point. The ’88 dating is essentially useless, does it make much difference to know to what degree it was useless? Its another technicality, which raises in question the 1988 rcd. Furhtermore 2 or 3mg of carbon may be sufficient in todays world for proper weighting, but was definately not so in 1988! Even Prof Gove co inventor of the AMS method used, stated ‘clearly’; “5mg minimum was required”. None of the labs used sufficient material for any of the multiple tests taken, rendering the 1988 rcd essentially technically useless….Thats a Fact. Which leads to question why the labs would cut their Shroud samples down too several samples to begin with…As I’ve been preaching for many months, the 1988 rcd is trash, and no one should be considering a medieval dating of this Shroud, as that testing done in ’88 was the ONLY thing pointing to such a date. Case closed on the RCD. R.","date":"2013-05-07","mins":"4:53 pm","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-18613","author":"ron","post":"Taking what I can from the article above, I don’t believe there is much ‘NEW’ to be found in the documentary that has not already been covered in several books, papers, ecetera. But ‘IF’ this documentary covers most all that has been found and mentioned before, then it should be quite interesting to view, especially for those who have not taken the time to investigate all the ‘funny stuff’ related to the 1988 radiocarbon dating. I look forward to viewing this documentary in anticipation of possibly any new evidence. R.","date":"2012-10-30","mins":"3:13 pm","url":"https://shroudstory.com/2012/10/30/another-article-on-francesca-saracinos-la-notte-della-sindone-documentary/","cat":"carbon_14_dating","title":"Another Article on Francesca Saracino’s “La notte della Sindone” Documentary"},{"id":"comment-11349","author":"ron","post":"That is quite a simpleton answer to the fiasco. So the ‘authorities’ didn’t want extensive damage to the Shroud, so what? T Here were lots of other places samples could have been retrieved without extensive damage. Moreover, more extensive examination of the choosen area(s) was warranted, which never occurred. Yes I agree the sampling should have never gone forward at the exact point when the ‘authotrities’ decided to change the protocols, but they did. Who then is to blame for this very ‘unscientific’ approach? Both the ‘authorities’ and the Labs, with the labs themselfs already being warned and with knowledge that a ‘proper’ testing could not be weighted….These labs had alot to gain by doing these tests, whatever the results, but moreso if they could claim the Shroud a fraud. Remember AMS was relatively new to the scene, this test ‘of the century’ would put them all on the map and make some people famous. The Nature report is so full of questionable information, I am not alone in questioning it’s ‘peer review’; this I conclude from many writings to this issue. Who by chance in 1988 89 had the expertise in AMS radiocarbon dating to actually peer review the paper anyways?…I wonder. Ron.","date":"2012-05-14","mins":"2:07 pm","url":"https://shroudstory.com/2012/05/12/breaking-news-emanuela-marinellis-carbon-dating-paper-from-valencia/","cat":"carbon_14_dating","title":"Breaking News: Emanuela Marinelli’s Carbon Dating Paper from Valencia"},{"id":"comment-11323","author":"ron","post":"I agree Dave, it seems bizarre and stinks of rotten fish! Prof.Gonella was in charge or atleast dictating from ABOVE! How can he put the blame on Chaga? The whole c14 thing as I’ve said before was a FIASCO. Those to blame were both individuals in the diocese, seemingly, Gonella and also ALL involved in the c14 testing, yes I’m including Tite et al. And ALL labs here. Everything from the changing of protocols, to the elimination of the STURP preposals, to the single sample, to the ‘secret’ non filmed escapades in the ‘other room’ to the irregularities in the numbers in the Nature report, to the below threshold weight of the tested samples; One must be blind to not see a bizarreness to the whole thing, lending to the very possible conclusion of a conspiracy here!..It is very irritating that most do not see this. R.","date":"2012-05-13","mins":"7:39 am","url":"https://shroudstory.com/2012/05/12/breaking-news-emanuela-marinellis-carbon-dating-paper-from-valencia/","cat":"carbon_14_dating","title":"Breaking News: Emanuela Marinelli’s Carbon Dating Paper from Valencia"},{"id":"comment-11389","author":"ron","post":"Dave obviously we have read much of the same literature, at present I am re reading “The Rape of the Shroud” by Meacham. Just happened to finish reading Ch 3 4. The whole true story of events are written in there and by someone who was intimately involved with many of the ‘movers’ back then. Hall’s lab not only received a huge sum from some less scrupulous “businessmen” but also for finding the Shroud not authentic!! Hall also apparently received quite a “hefty sum” for allowing a certain broadcaster exclusive coverage of his dating of the Shroud. It’s pretty obvious where his intentions lay and I venture to state; It had nothing to do with finding or publishing the truth. I’d highly suggest to others here, if you haven’t already, to pick up Meacham’s book. It is a fascinating and eye opening read of the whole situation which occurred around the c14 dating and the “wrongly condemned and violation” of the Shroud. R.","date":"2012-05-16","mins":"3:00 pm","url":"https://shroudstory.com/2012/05/12/breaking-news-emanuela-marinellis-carbon-dating-paper-from-valencia/","cat":"carbon_14_dating","title":"Breaking News: Emanuela Marinelli’s Carbon Dating Paper from Valencia"},{"id":"comment-5843","author":"ron","post":"You mean Ramsey, when you say this guy I assume. Anyways be careful what you agree on as that analogy goes for any manner of reproduction….including whatever method you may believe caused the imprints….just saying ; ) R.","date":"2011-12-21","mins":"3:08 pm","url":"https://shroudstory.com/2011/12/21/chivers-in-the-telegraph-get-over-it-the-turin-shroud-is-fake/","cat":"carbon_14_dating","title":"Chivers in the Telegraph: Get over it. The Turin Shroud is fake."},{"id":"comment-11009","author":"ron","post":"Further carbon dating of the Shroud, I believe, at this point, would be wrong and fruitless. Until a better, more accurate method of testing and understanding of contamination are revealed. But at the same time there is no reason to NOT move forward in other testing that would have no effect on the Shroud whatsoever, as was put forward by the STURP team years ago. So many questions could be answered more precisely now; the blood, the pollen etc;. We now have a better idea of what to look for and can do so in a more rigorous and controlled way. If only the custodians would allow it. R.","date":"2012-04-30","mins":"2:31 pm","url":"https://shroudstory.com/2012/04/29/carbon-dating-the-shroud-of-turin-again/","cat":"carbon_14_dating","title":"Carbon Dating the Shroud of Turin Again?"},{"id":"comment-5823","author":"ron","post":"I read the article and browsed thru the comments. I suggest Chivers and Ramsey pay close attention to one commenter; PROSCIENTIST, is the name he goes by. It seems to me he’s the only one speaking truthfully and scientifically. I’m a little disturbed by Ramsey’s comments also, I guess he and his lab have alot to loose if people were to realize how BADLY the c14 tests were implemented.PROSCIENTIST makes some very interesting comments towards this particular fact and also to Chiver’s obvious ignorance to all Shroud scientific qualities. R.","date":"2011-12-21","mins":"8:29 am","url":"https://shroudstory.com/2011/12/21/chivers-in-the-telegraph-get-over-it-the-turin-shroud-is-fake/","cat":"carbon_14_dating","title":"Chivers in the Telegraph: Get over it. The Turin Shroud is fake."},{"id":"comment-5886","author":"ron","post":"Why does everyone feel it neccesary to defend these labs? Read Ramsey’s last statement above…(What utter bullshit!) He’s afraid, they are all afraid, WHY? because they all bumbled terribly the tests from the start. There is tons of evidence to this statement. Where is Joe Marino when you need him? Joe??? back me up here. These lab scientists would be embarrassed to hell if the truth was let out, (it would have ruined their careers back then and maybe still). The true facts have been written and put out there, but this evidence has been stifled. Think about the fact that the method of carbon dating used, at the time, was relatively new, even the person whom invented the method had concern to mention ‘certain’ protocols HAD NOT been followed. They never had a textile expert with them when choosing the sample. The samples were never PROPERLY examined or cleaned before testing. There were huge discrepancies in the age ranges, there was no ‘control sample’ as none could be found!! …etc, etc; It was literally the worst mess up in the history of C14 testing, yet everyone still defends these bumbling scientists. This test was a big deal and everyone knew it, it would put their “labs on the map”, make them famous! Why was the sample choosen, not scrutinized by the labs? Or anyone else for that matter? Everyone was silent?…It is as big a mystery as the Shroud itself…. Doesn’t anyone else find all this odd? R.","date":"2011-12-22","mins":"8:35 am","url":"https://shroudstory.com/2011/12/21/chivers-in-the-telegraph-get-over-it-the-turin-shroud-is-fake/","cat":"carbon_14_dating","title":"Chivers in the Telegraph: Get over it. The Turin Shroud is fake."},{"id":"comment-9117","author":"ron","post":"This should be a very interesting and controversial video. I wonder what networks here in North America will cover this? I don’t put much faith in some of them too…(cough) Discovery channel (cough). R.","date":"2012-03-09","mins":"10:59 am","url":"https://shroudstory.com/2012/03/08/clarification-on-the-much-anticipated-documentary-the-night-of-the-shroud/","cat":"carbon_14_dating","title":"Clarification on the much anticipated documentary, The Night of the Shroud"},{"id":"comment-6735","author":"ron","post":"How true! But that seems to be the ‘Troll’ method;…They will suck the marrow from your bones, and they will endlessly demand more evidence from unsuspecting ‘normalites’. I think it stems from a propensity to be lazy on their part, and to not search and research themselfs ; ) R.","date":"2012-01-09","mins":"5:59 pm","url":"https://shroudstory.com/2012/01/09/colinb-thinks-im-evading-the-question-this-is-enough-until-he-does-some-reading-on-his-own/","cat":"carbon_14_dating","title":"ColinB thinks I’m evading the question. This is enough until he does some reading on his own."},{"id":"comment-33521","author":"ron","post":"I you don’t understand, thats not my problem. I think I explained it pretty well in a recent post. Testing the Shroud would be completely unlike testing most anyother textile, as it has been introduced to a unimaginable contamination, different say to a mummy’s rapping that has sat in a tomb undisturbed for eons…..get it? Meacham and most all archeologists, and/or C14 scientists are well aware of this issue, aswell as the issue of sampling any textile, and as a matter of fact Meacham has made a big deal about this same issue in some of his writings. Which same as here, has fallen on deaf ears. R.","date":"2013-05-11","mins":"7:10 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating."},{"id":"comment-33523","author":"ron","post":"I agree completely and as to what Rogers had found or not; Maybe he missed it. It wouldn’t be the first time he missed something big; i.e the patchjob. I have read that carbon infiltration of linen fibrels would be next to impossible to actually view or distinguish. As far as I know we still can’t see quite down to the molecular level. Furthermore, for one to actually believe that a linen cloth could have been stored, or hung, or handled for ‘centuries’ alongside ‘oil burning’ lamps, (which by the way depending on the oil used can give off quite abit of smoke/carbon) and also burnt twice, (atleast), and did not consume some carbon in it’s fibrels, is simply proposterous, leaning on retardation. R.","date":"2013-05-11","mins":"7:28 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating."},{"id":"comment-33420","author":"ron","post":"Colinsferry; “What could end it all is headline that read “Pope Francis consents to re dating of the Shroud of Turin”. ” ….Obviously you haven’t been paying much attention to what others have been saying or either reading up on the RCD process very well. It is very unlikely a new C14 test would achieve anything worthwhile, since the MAJOR issue of contamination of the Shroud and how to deal with it has not been solved…Your ability to neglect or joke about the seriousness of contamination speaks volumes of your character or professional expertice….just saying. Ron.","date":"2013-05-10","mins":"1:08 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating."},{"id":"comment-3858","author":"ron","post":"I’m curious has to Free Thinkers “reasons” for not thinking the Shorud is authentic, although I agree 100% with his statement; “Sceptics would be well advised to never mention these badly bungled tests again”. Ron.","date":"2011-09-14","mins":"3:24 pm","url":"https://shroudstory.com/2011/09/13/comment-promoted-sceptics-would-be-well-advised/","cat":"carbon_14_dating","title":"Comment Promoted: “Sceptics would be well advised”"},{"id":"comment-4508","author":"ron","post":"I really don’t understand why Fanti, a scientist, would be going to such extremes to challenge any of the C 14 tests. Ex; “that something, not yet understood surrounds human bodies”. Geez!….Like I’ve mentioned before and mentioned above by our friend Yannick, it is well known that the C 14 test is not infallible and quite literally well challenged in many regards. There have been many examples of erroneous test conclusions over the years and most notably with fabrics including linen. It almost seems to me that very little credence is given to the ‘tested’ results completed by R.Rogers and released in his paper of 2005. Which I would add he did such testing, from the research and proposals of Sue Benford and Joe Marino. I don’t think we need to jump into the ‘supernatural’ to challenge any carbon 14 tests. I also think Libby’s point was that all factors pertaining to the article being tested must be known and that obviously was not the case with the Shroud or dare I say the Sudarium. Persnoally I don’t place must credence in the c14 datings of either, considering all other known factors of these relics, the datings make no sense or seem logical. Ron.","date":"2011-11-01","mins":"5:14 pm","url":"https://shroudstory.com/2011/10/31/giulio-fanti-on-the-carbon-dating-of-certain-relics/","cat":"carbon_14_dating","title":"Giulio Fanti on the Carbon Dating of Certain Relics"},{"id":"comment-17223","author":"ron","post":"The link and paper work and show just fine for me Richard. Try checking your settings and/or reset them to default…or update your Adobe Acrobat reader? By the way, what are you doing way back here in Jan 2011 posts? It’s good you did post here though, otherwise I wouldn’t have ever found these comments! Although some links don’t work any longer, a couple of comments here are GOLD! Especially nos. 3, 4 and 5. With a slight emphasis on Cazabs question posted in comment 3, which I believe was never ‘properly’ answered and in which, if it is true that all labs used UNDER THRESHOLD WIEGHT samples, …then on this basis ALONE, the testing done in 1988 can be dismissed entirely! R.","date":"2012-10-04","mins":"9:20 am","url":"https://shroudstory.com/2011/01/21/mark-oxleys-paper-is-a-must-read/","cat":"carbon_14_dating","title":"Mark Oxley’s Paper is a Must Read"},{"id":"comment-17243","author":"ron","post":"Richard, I believe it may have been I who referred you to the paper by Oxley. You can find that paper along with many others at http://www.shroud.com. Try opening the paper on the site, then just click ‘File’ on the Menu bar and then ‘save as’; if there is an issue with your Adobe it should ask you to upgrade. Just click ‘upgrade’ and ‘yes’ to download. Then ‘run’ the program. You should be able to read it then and it will be saved in the folder of your choice….hope that helps. ANYWAYS, the issue above dealing with the sample weights, amazingly, is very rarely mentioned by anyone, and I would think it being a ‘technical’ issue to the testing, or more precisely too ‘proper’ testing of the samples, goes to the heart of the c14 results and ‘technically’ is a major problem!…Some of the samples would have had less then 2mg carbon for testing!! Unless someone can substantiate that back in 1988, proper results could be achieved from such low carbon weights, the c14 results on this issue alone is not only suspect but nullified. R.","date":"2012-10-05","mins":"9:57 am","url":"https://shroudstory.com/2011/01/21/mark-oxleys-paper-is-a-must-read/","cat":"carbon_14_dating","title":"Mark Oxley’s Paper is a Must Read"},{"id":"comment-3857","author":"ron","post":"Mr Roberts, your statements truly baffle me.They really are odd considering you seem to be well educated. I base this from your style of writing. I for one may lack the education or the writing skills, but can still see your errors. You go from saying believers (bloggers) here are refutting all ‘perfect’ evidence to the Shroud’s medieval origins, to saying believers are misrepresenting peer reviewed scientific papers!….What a shame you believe these things in your mind. If you want to claim we must stay within scientific boundaries, THEN YOU MUST YOURSELF. Furthermore with this in mind, you must recognize that nothing at this point scientifically points directly to a medieval origin, quite the opposite actually. It is a shame and a huge disservice you pay when you and others would dismiss the hundreds of thousands of hours of scientific study done by dozens of world class scientists, simply due to your bias. The whole C 14 dating has been shown to be a scientific blunder by all involved, so not perfect science.Historically it seems, it’s even worse.Many historical writings, documents and illustrations are simply being ‘dismissed’ which can easily pull the origin of the Shroud back literally to the 4th century…So I ask you, whom is really using rhetoric here? Ron.","date":"2011-09-14","mins":"3:16 pm","url":"https://shroudstory.com/2011/09/06/mixing-up-faith-and-science-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Mixing Up Faith and Science on the Carbon Dating of the Shroud of Turin"},{"id":"comment-4612","author":"ron","post":"The forger may not have cared about being authentic, maybe he got a paper cut and bled himself on the thing. Comparitive blood studies will answer absolutely nothing, as it is well studied, all blood reverts to AB after so many years. Case in point, the Shroud and Sudarium. I give the chances at less then 1% for any of these items being authentic, including the Greek one….just my conjecture. R..","date":"2011-11-06","mins":"11:55 am","url":"https://shroudstory.com/2011/11/03/modified-geiger-counters-to-measure-holiness/","cat":"carbon_14_dating","title":"Modified Geiger Counters to Measure Holiness"},{"id":"comment-33438","author":"ron","post":"Yannick Clément :I think Ron is affraid that another C14 dating test would give a result different than 33 A.D. If we truly have a scientific thinking, we should be in favor of a new C14 dating because it would surely bring us much closer to the truth about the Shroud, whatever this truth can be… Your totally off Yannick, it’s obvious that you also do not understand the problem of contamination also along with Colin. What would be the use of another test if it cannot be done properly? Until they can find an absolute method that observes and can eliminate al I traces of contamination it would be a wasted procedure. Lets get something straight also; I have absolutely no fears about the dating of the Shroud or ot’s provenance….I am not blind. Ron.","date":"2013-05-10","mins":"4:21 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating."},{"id":"comment-11054","author":"ron","post":"Daveb of wellington nz :G at #7: “I don`t agree either with Charles Freeman and Daveb when they sort of say that a new C14 test is needed.” I made no advocacy for further C14 tests – that came solely from Charles. My message was the simple obvious statement that any further C14 tests would be pointless unless there was a rigorous truly representative sampling protocol, and I doubted that any further C14 tests would be likely. As yet I have not bothered to read the subject paper, although advanced statistical analysis is well within my technical competence. I am sceptical that any trend has any true significance concerning the Shroud, for the following reasons: 1) I cannot imagine that the very small corner sample taken can in any way be representative of the whole; 2) The work of Rogers in stating that the sample had significant levels of vanillin and cotton contamination indicates that the sample could not be representative; 3) The sample therefore appears to be a patch; 4) I have seen enough costly errors made during my technical career resulting from poorly informed extrapolation of non representative data; 5) Based on what else we can deduce about the age of the Shroud, I would expect to see a jump in the results rather than a persistence in the alleged trend, that is if C14 has any relevance to this artifact, which indeed seems to be in some question. I am intrigued that Gabriel sees C14 as an obsolete technique. I should really like to be informed of what other scientific dating techniques might be available, more appropriate, as from her comment I take it that she does seem to have some other techniques in mind. Would these techniques be immune from any skewing as a reult of the 2002 “restoration / conservation” activity. Presumably any such new methods attempted would also need the assurance of being adequately representative of the whole, and not just from itty bitty corners! Right on Dave! Forget all other things; Dave’s points 1 and 2 go to the heart of the matter here. I for one do not accept the 1988 c14 results as being legit, not at all. We must remember this was not 12 separate samples, it was 12 pieces of the same sample and definately “not representative of the whole”. This sample area was also ‘proven’ by STURP research, including infrared images of the area prior to 1988, to be unlike the rest of the Shroud surface, studies, everyone simply ignored!. Anyone who still backs or even contemplates the 1988 c14 dating as being a point against the Shroud’s authenticity, should really get thier heads out of their behinds and do some research on radiocarbon dating, seriously!! No expert in RCD truthfully, would ever accept the conclusions of the 1988 tests considering it’s complete non adherence to BASIC protocol. It’s a no brainer, the 1988 Radiocarbon dating was deficient, end of story. Moreover Rogers finding of lignin/vanillin in the fibrels is an important ‘clue’ to the Shroud’s real age, yet most will just disregard this evidence or claim Rogers was just wrong…It’s a bad joke. There is at this point in time absolutely ‘nothing’ that refutes this Shroud from being from the first century, (scientifically) speaking, and I strongly believe anyone who argues that point should have their head examined. Oh and here is another clue to the LACK of protocol or standards in the RC Ding done in 1988…Clue word; weight …None of the samples tested met the minimum standard weight required for PROPER TESTING! …I call that FAIL! R..","date":"2012-05-02","mins":"4:22 am","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin."},{"id":"comment-11503","author":"ron","post":"Geez Colin seriously, the picture you linked too is definately not post ressurection, it is Christ on the cross! I don’t see any nail wounds in the palms!!! Where do you see these? Yes this was no De Vinci, but he got his point across. So what about the ‘little circles’ sure they can be decorative in a regular design, but on their own in the middle of the sheet? Colin your just reaching for straws here. R.","date":"2012-05-21","mins":"4:04 pm","url":"https://shroudstory.com/2012/05/21/or-the-artist-of-the-fake-knew-of-the-pray-manuscript-and-incorporated-these-signs-into-his-forgery/","cat":"carbon_14_dating","title":"Or the artist of the fake knew of the Pray Manuscript and incorporated these signs into his forgery"},{"id":"comment-11497","author":"ron","post":"Jos, I would think it has to do with the fact on the ‘front’ image of the Shroud and particularly the feet area, it is very faint, almost indiscernable. They (artists) maybe didn’t want to add any conjecture to the images!.Basically just “draw what you see”. The only problem I have with Stephens’ post is that he, along with others, put too much weight on the forehead mark of the upper drawing. Can this actually be discerned as a blood mark, or could it just simply be a smudge? I personally discern what seems to be two seperate cloths in the lower picture, one bundled up and extending slightly beyound the Shroud to the Alpha symbol. I still to this day have not heard anyone mention any relevance to this, but it seems clear to me. I also have not had the luxury of viewing other drawings Stephen points to in the book sited, so I could be wrong on my point about the forehead marking. R.","date":"2012-05-21","mins":"11:40 am","url":"https://shroudstory.com/2012/05/21/or-the-artist-of-the-fake-knew-of-the-pray-manuscript-and-incorporated-these-signs-into-his-forgery/","cat":"carbon_14_dating","title":"Or the artist of the fake knew of the Pray Manuscript and incorporated these signs into his forgery"},{"id":"comment-11498","author":"ron","post":"Oh I forgot to add, I’m with Russ Breault on this, “that this illustration with it’s poker holes is like a DNA sample”, proving unequivocally that the Shroud is older then the C14 carbon dating tests would like us to think. Basically nullifying the tests results. R.","date":"2012-05-21","mins":"11:54 am","url":"https://shroudstory.com/2012/05/21/or-the-artist-of-the-fake-knew-of-the-pray-manuscript-and-incorporated-these-signs-into-his-forgery/","cat":"carbon_14_dating","title":"Or the artist of the fake knew of the Pray Manuscript and incorporated these signs into his forgery"},{"id":"comment-11548","author":"ron","post":"Oh and Colin about why he would show the ‘L’ shaped burn holes over other details, maybe it’s because those burn holes would be the most prominent thing one would see on the Shroud, at that time. R.","date":"2012-05-22","mins":"5:28 pm","url":"https://shroudstory.com/2012/05/21/or-the-artist-of-the-fake-knew-of-the-pray-manuscript-and-incorporated-these-signs-into-his-forgery/","cat":"carbon_14_dating","title":"Or the artist of the fake knew of the Pray Manuscript and incorporated these signs into his forgery"},{"id":"comment-11506","author":"ron","post":"Okay sorry the link took me to the first drawing and I assumed that was the one you were talking about. Image 4 does show the wounds in the palms, but in essence it means little has the artist could have misrepresented what he saw on the Shroud since it is quite hard to see where exactly the nail wounds are if your looking at the original “real life’ image, not a photo of the Shroud or a positive of it. Your still grasping at straws Colin ; ) R.","date":"2012-05-21","mins":"4:36 pm","url":"https://shroudstory.com/2012/05/21/or-the-artist-of-the-fake-knew-of-the-pray-manuscript-and-incorporated-these-signs-into-his-forgery/","cat":"carbon_14_dating","title":"Or the artist of the fake knew of the Pray Manuscript and incorporated these signs into his forgery"},{"id":"comment-11547","author":"ron","post":"Well if you look at figure 4, the artist also left out any nail wounds on the feet. So my one thought that the artist could not discern the feet or where the nails entered the feet, stands. As for the little circles it seems to me he uses them as decorative detail. Usually on clothing, belts etc;.but really without any care. So that is why I along with others believe the 4 holes conspicuously placed in the middle of the shroud and ‘L’ shaped, is depicting the burn holes and not decorative. Anyways the lack of lower body detail or accuracy to the Shroud raised another thought/ recollection. These drawings were done approx 10 12 years before the sack of Constantinople, now taking from the discription of the Shroud by the french knight in 1204 being raised in a church and most likely showing the image, but possibly only waist high, as depicted by several artists after the disappearance of the Shroud and called “The man of sorrows”. I think It plausible that’s all this artist had seen and was working from….So he had no idea about the lower extremities of the Shroud image?! R.","date":"2012-05-22","mins":"5:15 pm","url":"https://shroudstory.com/2012/05/21/or-the-artist-of-the-fake-knew-of-the-pray-manuscript-and-incorporated-these-signs-into-his-forgery/","cat":"carbon_14_dating","title":"Or the artist of the fake knew of the Pray Manuscript and incorporated these signs into his forgery"},{"id":"comment-11045","author":"ron","post":"Yannick Clément :Yes, that’s my opinion Ron. Unless someone can PROVE me that the Shroud come from some unnatural event, I will keep my feet on the ground and look for some chemical natural phenomenon(s) to explain the images. It’s not because I believe in the resurrection of Christ that I have to believe the image on his Shroud come directly from it. Read again all the STURP papers and you’ll see that possibility that the image could come from a supernatural event was almost absent of them (except maybe the paper of Jackson who tested many image formation hypothesis including radiation). And the argument that the hypothesis of Rogers cannot explain all the characteristics of the image cannot ruled out every possibilities that the image could have been formed naturally (involving some chemical phenomenon). I’m not sure that Rogers was reading to really discard his hypothesis on the basis you mention. The fact is that he didn’t had enough time to fully test his hypothesis… Also, did you ever thought that his hypothesis could only be PART of the solution and other chemical processes could have been present also ? There’s still many natural possibilities that have not been fully tested yet. Until that day come, I will still push in that direction… like almost every STURP member and as any good scientist should. I don’t believe any of the STURP papers touched on the topic directly and there is lots of evidence in many of those papers pointing indirectly to some sort of light phenomena. Lets hear some possible ‘natural’ causations for the image, if your so sure it was that….Problem is there is none, reason being, is that none have been thought up or if they have they have been dropped because early in their ‘process’ they would be found wanting and not worth pursuing. So lets hear it Yannick, keep your feet on the ground and let’s hear this extremely rare ‘natural phenomena’ which created the Shroud image without ‘direct contact’ thru the space of 4cm in parts and left no chemical trace. I tend to believe the clue to the image is the image fibrels and simply put; “as if the image fibrels just aged at an exponential rate” …what on earth could cause flax fibrels to ‘age’ exponentially? I wonder. R.","date":"2012-05-01","mins":"5:08 pm","url":"https://shroudstory.com/2012/04/30/paper-chase-new-paper-challenges-rogers/","cat":"carbon_14_dating","title":"Paper Chase: New Paper Challenges Rogers"},{"id":"comment-11039","author":"ron","post":"Thats your view, I along with many others would agree there is plenty of evidence. Even Rogers admitted his Milliard reaction would not account completely for the image ‘something else’ was needed and I am in the boat that a Milliard reaction could not account for the image at all, considering several clues including the fine detail of the image. R.","date":"2012-05-01","mins":"4:12 pm","url":"https://shroudstory.com/2012/04/30/paper-chase-new-paper-challenges-rogers/","cat":"carbon_14_dating","title":"Paper Chase: New Paper Challenges Rogers"},{"id":"comment-11214","author":"ron","post":"Yannick Clément :This is Fanti’s opinion. Fanti is NOT a chemist and surely not as worthy of the term “scientist” as Rogers was… Of course, anyone can believe Fanti’s conclusions BUT I prefer to trust someone who spend 5 days and nights with the Shroud and who was a true expert in chemistry. That’s my opinion. But I know it isn’t the one of the Shroud clique… Yannick thats not true, i.e; “Not being one the Shroud clique”. I think everyone respects R.Rogers work immensely, but his Milliard hypothesis doesn’t seem to work, but that is an hypothesis. Some or most of his other work/findings, such as finding a thin layer of impurities, whatever covering the fibrels or his lignin findings I think cannot be refuted. Thats my take on it anyways. R.","date":"2012-05-08","mins":"9:10 am","url":"https://shroudstory.com/2012/04/30/paper-chase-new-paper-challenges-rogers/","cat":"carbon_14_dating","title":"Paper Chase: New Paper Challenges Rogers"},{"id":"comment-11007","author":"ron","post":"Ever think Yannick that the use of light was the way God chose to do it? Are you against this notion because you subscribe to the vapour/combo theory?. The term and use of light when it comes to God is not new, even God states he is the light! So why not some type of glorious light to imprint his earth bound figure on a Shroud? As to John’s & Russ’s comments; and too the ‘nothingness’ argument, I believe before there was anything there was God….Lest anyone prove me wrong. 3.","date":"2012-04-30","mins":"2:20 pm","url":"https://shroudstory.com/2012/04/30/paper-chase-new-paper-challenges-rogers/","cat":"carbon_14_dating","title":"Paper Chase: New Paper Challenges Rogers"},{"id":"comment-11013","author":"ron","post":"WHAT? Is there something missing here? Z twist? R.","date":"2012-04-30","mins":"4:09 pm","url":"https://shroudstory.com/2012/04/30/paper-chase-new-paper-challenges-rogers/","cat":"carbon_14_dating","title":"Paper Chase: New Paper Challenges Rogers"},{"id":"comment-11008","author":"ron","post":"Right on Russ, I believe the same. R.","date":"2012-04-30","mins":"2:22 pm","url":"https://shroudstory.com/2012/04/30/paper-chase-new-paper-challenges-rogers/","cat":"carbon_14_dating","title":"Paper Chase: New Paper Challenges Rogers"},{"id":"comment-8845","author":"ron","post":"Colin, as for the link you posted, you realize the image is actually much fainter viewed real life right? To assume it may have faded over time is pure speculation. That the image must be viewed from several feet before it can be discerned? …These points amongst a dozens more evidences I can mention kills the “hoax theory” almost decisively. Would any artist be satisfied with something that can barely be seen? Also if you are going to start thinking this may be a fluke from a 16th pseudo photo, consider first the ‘LIGHTING’ which has no direction, instead from the body itself and also that this photo hypothesis has also been tried and failed miserably. R.","date":"2012-03-01","mins":"1:24 am","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","title":"Paper Chase: To know a veil by Philip Ball"},{"id":"comment-8828","author":"ron","post":"Rediculous, is saying it quite mildly!….Anyone who can make such a statement, in laymens terms; is a total ‘crackpot’. No one looking at the Shroud can (in a right frame of mind) refute that it is, or is meant to be Jesus of the Gospels. The facts stand as of today; The Shroud image formation has not been explained by science, WHATSOEVER. To date; All attempts to duplicate the image, including all it’s attributes, have FAILED, even the scourch hypothesis…..you listening Bod? ALL attempts to FALSIFY the Shroud have failed; that includes; Heresay evidence (D’Arcis), falsified microscopy findings (Mc Crone) and mostly the infamous Carbon14 dating, which, if anyone dares to claim radiocarbon dating is irrefutable science, especially taken on it’s own merit; I will call them an idiot to thier face. As far as I see it, there is no ‘evidence’ to cause me to believe this Shroud is not exactly what it purports to be. Furthermore, echoing Paul’s words below; I challenge anyone to replicate this amazing image and prove me wrong. R.","date":"2012-02-29","mins":"9:41 am","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","title":"Paper Chase: To know a veil by Philip Ball"},{"id":"comment-17583","author":"ron","post":"I won’t comment on Rich’s inabilities to answer your questions, but I will comment on the lack by anyone of the “rational scholars and enthusiasts” you mention to do their own ‘research’ on the matter… Why depend on poor Rich! These wnthusiasts cannot read for themselfs? For most on that site, i have noticed, have this type of understanding; quote; “The evidence for the shroud being a medieval fake is far too strong and homogeneous to be doubted by a few scraps of dubious pseudo science.” unquote. If that is not the most rediculously stupid comment I have ever heard, I don’t know what is, and goes to show the actual lack of intelligence offered by anyone there. It is useless even trying to discuss any logic with these Neanderthals, yet Richard cannot see this and is just wasting precious time on the effort, as I have just done here responding to just another Neanderthal. R.","date":"2012-10-13","mins":"6:10 am","url":"https://shroudstory.com/2012/07/27/savage-treatment-in-randi-land/","cat":"carbon_14_dating","title":"Savage Treatment in Randi Land"},{"id":"comment-3756","author":"ron","post":"I think Mr Schafersman should get his facts straight before commenting…”Got thier samples from an area of the Shroud studied for months”? What an IDIOTIC COMMENT and so, so far from the truth…Sampled what under the camera? I’ve never seen video of the actual C 14 procedure the cutiing of the sample area yes, but then the vatican representatives went off to a private room with NO video coverage.People should really read up on the actualities of the whole C 14 fiasco…Maybe Dan can place a link here to some important writings by Dan Marino on this topic. Ron..","date":"2011-09-01","mins":"11:19 am","url":"https://shroudstory.com/2011/09/01/steven-schafersman-writes-in-about-the-carbon-dating/","cat":"carbon_14_dating","title":"Steven Schafersman Writes In About the Carbon Dating"},{"id":"comment-33597","author":"ron","post":"The ‘athiest’s’ argument, which is not new by any means, is insensible and lacks logic. People may die because they ‘believe’ in something, i.e social causes etc, it happens everyday, but, people will not willingly die horrible deaths for something they KNOW IS NOT TRUE! Now if the disciples had just concocted the resurrection event, as the athiests propose, then that would be case here…Which is extremely unfathomable. R.","date":"2013-05-13","mins":"10:00 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?"},{"id":"comment-6574","author":"ron","post":"“I’ve only recently become aquainted with the most recent objections to the carbon dating, so may be ignorant of some details.BUT A QUICK SCAN,…” ~ There in lies the problem, with most all you’ve posted on this blog so far. Sciencebod, you seem like a very intelligent person, yet you will comment and experiment with very little ‘actual’ knowledge on the subject, the subject being the Shroud and it’s intricacies. As Dan has so eloguently stated; more study on your part is warranted. R.","date":"2012-01-05","mins":"4:01 pm","url":"https://shroudstory.com/2012/01/05/tom-chivers-has-an-opportunity-to-do-some-real-investigative-journalism/","cat":"carbon_14_dating","title":"Tom Chivers has an opportunity to do some real investigative journalism"},{"id":"comment-6732","author":"ron","post":"Yannick Clément :Rogers called them the “true believers”. You know how I called them ? The supernatural fringe !!! : ) Yannick I think Rogers called them “The Lunatic Fringe”, I believe he may have gotten that term from the Canadian rock band, Red Rider actually, atleast it would be cool to think so ; ). It was a great song. He was talking about anyone with a theory that relied on ‘Miracles’, which HE personally didn’t believe in…So What? That is one man’s opinion, nothing else. But he did have a GOOD point… Personally, yes I agree with you that the Shroud ‘should be’ looked at ONLY as a archaeological artefact when being scientifically studied, but in all honesty; Do you really believe that is possible? This is not JUST a Caesar or Tutankhamun tunic! As much as we hope it can be studied unbiasly, what this Shroud proports to be makes that almost impossible, for either side of the Shroud fence. R.","date":"2012-01-09","mins":"5:32 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them"},{"id":"comment-6791","author":"ron","post":"I think you’re missing the point Yannick, point being it may be ‘impossible’ for ANY observer of the Shroud not to be bias one way or another just because of what it PROPORTS to be; The burial cloth of Christ. Nothing more nothing less. I definitely believe it would be impossible to find even a handful of scientists that could be completely ‘neutral’ in the study of the Shroud, period! Who really cares or have ’emotions’ when it comes to Caesar?, but Christ, different issue…get my point? Secondly how can you possibly say “the Shroud is nothing more then a burial Shroud that points directly to the Passion and death of Christ” and NOT of the “Resurrection”…Seriosly Yannick, that is just your assumption, nothing more. You CAN NOT in any sense of the word ‘KNOW’ what the Shroud is, or make a statement as such with full conviction, as it is a nonsensicle statement. R.","date":"2012-01-10","mins":"6:13 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them"},{"id":"comment-6792","author":"ron","post":"Sorry typo error; should read as (nonsensical), …I should really proof read before hitting the post button ; ) R.","date":"2012-01-10","mins":"6:17 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them"},{"id":"comment-6658","author":"ron","post":"Now your an expert in Vatican thinking! Is that because your catholic? LOL. Well so am I, Roman Catholic actually and I am completely at a loss of most Vatican thinking! I know one thing for sure; the church believes in the resurrection! How God was able to accomplish it, I don’t think I’ve ever heard a sermon on that, or the churches view! I think your just pissed that your vapour theory for the image has basically fallen in priority, and actually has little strength. R.","date":"2012-01-07","mins":"9:04 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them"},{"id":"comment-6995","author":"ron","post":"And Yannick what I am saying is; I don’t think it is possible too see the Shroud from a “strictly scientific point of view” just because of what it PROPORTS TO BE!!….Didn’t even Rogers say; ” I could prove this the burial cloth of the historical Jesus” or something to that account in his final video? …So even Rogers understood the problems associated with the ‘representation’ of this Shroud. I also believe you are misrepresenting alot of the scientists studying this Shroud. Remember some have come to the conclusion/hypothesis of ‘some type of burst of energy’ caused the image, not from religious tendencies or from Hollywood depictions but from what several scientists have found and concluded HAS NOT caused the image….nothing more. R.","date":"2012-01-15","mins":"7:48 am","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them"},{"id":"comment-6657","author":"ron","post":"Yannick, It is in my opinion you can’t be further from the truth!! It was the Church or more precisely the custodians of the Shroud that CAUSED all this! They started it all before the carbon dating tests in 1988 when they decided almost at the last minute to change all the protocols including the number of samples and from where they would be taken. It was not just irresponsible and unprofessional but also very suspicious! Before the dust, they caused, could settle, they went ahead and ‘SECRETLY’ did the restoration on the Shroud without guidance from any world experts! Why the secrecy?…Through their arrogance they have most likely eliminated any chance of proper study on the Shroud ever again. What are they afraid of? Irresponsible media reports have been coming out all along for decades, from both sides. It can’t be that or that SIMPLE. The Vatican, custodians, whomever, have the power to commission a ‘Proper study of the Shroud’ where no unscrupulous scientist can conjure up some unscientific theory, yet they don’t. They should seriously think deeply about who is depicted on this Shroud and if left by him for ALL mankind, the consequences of their actions and possible agenda. Whatever it is. I agree with Dan, the article is a excellent piece written by Mr. Jones. R.","date":"2012-01-07","mins":"8:49 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them"},{"id":"comment-4196","author":"ron","post":"Interesting! It would be nice to be able to watch the whole documentary. It’s also very interesting how much about the 1988 C 14 fiasco is coming to light as of late, but I am sure most of the information has already been published with many people not being aware of it. Many will claim the tests were in error without blaming any of the ‘tester labs’, which to me is a blind statement to the truth. All the labs as well as the Vatican were at fault for a bumbled testing, right from the start. The fact that all protocols were dropped for the choice of samples by the Vatican to the fact that no chemical analysis were done on the samples by any of the labs, too the huge discrepencies found in the final numbers. Not to mention an anonymous donation to one lab of 1.5 million pounds! It (the 1988 c 14 dating) has all the attributes of a true conspiracy. The questions are WHY? and conspired by WHOM? Personally back in ’88 when the test results were splattered all over the media, I did not believe the results, as too much evidence pointed to ‘authenticity’. I could only feel at the time that something wrong had been done, but unfortunately many important people in the study of the Shroud lost interest, which to me was also unbelievable. How could so many put so much faith in a single carbon dating? Especially when anyone with half a brain understood that carbon dating methods are not infallible, even novices as myself understood that! Personaly I don’t believe any further carbon dating will bring us to any certain conclusions as the cloth as been tampered with way too much (2002 restoration) and is far too contaminated to ever get a true date. The only thing we can hope for, as our friend Yannick states is far more chemical and optical studies must be sanctioned by the Vatican and performed completely in the OPEN. Ron.","date":"2011-10-15","mins":"6:01 am","url":"https://shroudstory.com/2011/10/15/video-posted-by-rome-reports-questions-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Video Posted by Rome Reports: Questions Carbon Dating of the Shroud of Turin"},{"id":"comment-15516","author":"ron","post":"Gabriel, how or what have you actually read on the issue of the C14 testing done in 1988? If you were to read several papers and books on the matter, you will find that much of what is written in the linked page above is FACT. I won’t state that a ‘switch’ was performed but alot of the other points made, are in fact, TRUE. As I’ve stated several times before on this blog, the c14 testing was a complete fiasco and I arrived at this conclusion not on my own, but by researching and reading. All or most of where I acquired this info can be found at shroud.com or you can read “The Rape of the Shroud” by William Meacham. I don’t believe there is any proof to a substitution, but there is evidence of a stunning lax in protocols, procedures etc; Things such as the samples being split into smaller pieces by the labs, and actually too “below minimum threshold weight for proper testing”, no official photos of said samples when received at the labs, no proper examination of the samples before cleaning, BASIC cleaning methods used, “not neccessarily efficient for linen samples of a unknown provenance or history” , and finally to the unorthodox communications between labs before results were published or even while testing was in progress!! Moreover, and yes to the non peer reviewed release of the Nature paper. In actuality the final results have still not been released, even till this day, to the Turin Archdiocese! Papers you may want to read; ‘Evidence is not proof: A Response to Timothy Jull’ by Mark Oxley and ‘Radiocarbon Dating the Shroud of Turin: A Nature report’ by Remi Van Haelst, just to name a couple. These amongst others can be found at Shroud.com under scientific papers. R.","date":"2012-08-27","mins":"7:12 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","title":"Was this page removed because it was just too political?"},{"id":"comment-15559","author":"ron","post":"Thanks for the link Joe, btw didn’t you write a paper (outside of the patch hypothesis) on the c14 dating and it’s issues? I seem to remember reading something a while back, but cannot seem to find it today. Thanks, R.","date":"2012-08-29","mins":"10:49 am","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","title":"Was this page removed because it was just too political?"},{"id":"comment-15547","author":"ron","post":"The question is pretty straight forward, Who did the re evaluation? Seriously, if you haven’t done so yet please read the papers I mentioned above, but especially several papers by Remi van Haelst. This will give you an idea where I’m comng from and what I mean. Thanks, R.","date":"2012-08-28","mins":"6:08 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","title":"Was this page removed because it was just too political?"},{"id":"comment-15681","author":"ron","post":"Angel :What you state was true years ago, when honesty prevailed. Unfortunately, now with rampant corruption on a global scale, you might want to take a peer reviewed article with a grain of salt. The Pharmaceutical industry is an example. Quote from article (link below). Http://articles.mercola.com/sites/articles/archive/2010/05/18/how corrupted drug companies deceive and manipulate your doctor.aspx Bias #1: Unwanted Results are Not Published “But drug companies publish only a fraction of the studies they fund — the ones that promote their drugs. If a study does not have findings that are favorable to its product, it is unlikely it will ever make it into a journal for publication.” In contrast, studies that have favorable findings almost always make the cut. Further, even the Better Business Bureau was accused of taking money (selling its grades). Wolfgang Puck, Celebrity Cheft was given an “F” rating, because he refused to pay the BBB, as was the Ritz Carlton http://abcnews.go.com/WNT/video/better business bureau sell grades bribe corrupt brian ross 12136209 Now that we know corruption exists in this cross section of our global society, why would the dating of the Shroud be an exception? Money, the root of all evil, unfortunately still talks. The question remains, was money exchanged for an unfavorable Shroud date? Angel, I agree with you, and I am pretty sure the carbon dating test done in 1988 was never ‘properly’ peer reviewed…(I am not alone in believing this either). As for your last statement as to money being exchanged for a specific result. It is “common knowledge” something in the line of 1.5 million pounds was ‘donated’ to a certain party, after the fact, “inlight” of the results given. This fact was printed in the papers of the day, actually! But as for peer review, in some cases maybe it cannot be trusted at all, such as what you mention in the pharmaceutical, or medical industries and some others, as there is alot of money (profits) at stake or to make, so not so surprising! In the Shroud world however, there isn’t much money at stake, …maybe alot of bias though. I wouldn’t think any of the peer review papers that came out of the STURP research was infected by either, although some would claim so, but with no warrant. R.","date":"2012-09-01","mins":"2:15 am","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","title":"Was this page removed because it was just too political?"},{"id":"comment-15600","author":"ron","post":"Hi Joe, I stand corrected then, I have read both papers of which you linked and the chronology one is awesome, thanks for the response and links. R.","date":"2012-08-29","mins":"10:24 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","title":"Was this page removed because it was just too political?"},{"id":"comment-15540","author":"ron","post":"Gabriel, if you read my post properly, you would have noticed I said I won’t say anything about substitutions, as there is no evidence for this. But from a basic level, and the evidence of breached protocols, improper and (LAX) procedures, and just plain shoddy work, the original radiocarbon dating can and should be suspect and deemed irrelevant. Just the fact all samples came from the same area of the Shroud is enough to make the findings suspect!! But there is so much more; the C Hi value, the manipulation of numbers to ‘gel’ to 3 labs results and done as the procedures were ongoing, AND on and on…The results are ‘SUSPECT’ and proof of this has been shown quite well, and well before the reweaving was brought out and subsequently proven by Rogers. By the way, ASK YOURSELF; who was responsible for the “Trend” conclusions and testing announced recently?. It is not arguable, the facts show the c14 process done in 1988 was a fiasco. The process reeks of unprofessionalism and maybe even a touch of misconduct. Ask any archaeologist, or C14 technician about the 1988 testing and procedures, and they will tell you the results would never be accepted inlight of the issues mentioned, they would throw the results out! Moreover, infact c14 results can never be trusted on their own, all other evidence must be weighed, that includes all information brought forth by STURP and others to the provenance of the Shroud. Why do you think the STURP team was banished? It was obvious, the labs feared STURPS test results would challenge and even cause to eliminate any results found through carbon dating. R.","date":"2012-08-28","mins":"11:34 am","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","title":"Was this page removed because it was just too political?"},{"id":"comment-6580","author":"ron","post":"I’m with Gabriel on this!!,…Time to move on. It is in my opinion from my personal study, gut feeling and I shall I dare say God given ‘common sense’, the testing done in ’88 was tremendously flawed. It’s too bad certain people won’t own up to it and clear the ‘air’ finally, and allow for ‘proper’, modern testing to go forward. Don’t people realize we ‘may have’ the most important object in the history of mankind here? The implications of it being authentic is staggering. I wish those in control would realize this, stop pussy footing around and allow further study. R..","date":"2012-01-05","mins":"6:46 pm","url":"https://shroudstory.com/2012/01/04/what-did-christopher-ramsey-know/","cat":"carbon_14_dating","title":"What did Christopher Ramsey Know"},{"id":"comment-15693","author":"ron","post":"If you have the papers and have taken the time to ‘actually’ read them, which not knowing your abilities I’ll mention are not easy to read. It required a huge learning curve in my case along with much help, to understand Remi’s papers. But if you can understand these papers; You would realize the numbers in the original release of the Nature paper were “fudged”. Remi van Healst, ‘amongst others’ have pointed this issue out many times over the years and this seems to be simply ‘overlooked’ or ‘nearly never mentioned’ by anyone! So if the numbers were fudged in the Nature (supposed peer reviewed) paper, and the “statistical analysis” data you speak of must be one in the same as used in the Nature paper; It could then be STRONGLY concluded these statistical data would be suspect also!…Garbage in Garbage out!…Furthermore the trend is not important unless you are thinking there was a ‘switch’ perfomed. J.Marino and S. Benford illustrated quite well in their papers that there was definately an issue with dating trends on the samples taken and the dates issued by the labs… Why anyone, would still want to defend or take the ‘word’ of these labs as if they were beyond reproach, being so many protocols were thrown out and so many issues have been raised over the years, with peer review data literally proving there was issues with the sample area, is beyond me. As far as I am concerned I wouldn’t trust anything that comes out, including new statistics, especially if these involve the labs themselfs or anyone or anything connected to them. Thats like asking a professional thief if he stole anything. Let’s not forget the fact that the AMS labs were the new kid on the block in 1988, and in a desperate struggle to prove their worth over other ‘proven’ methods being used. These labs had spent millions on their new equipment and even though they were basically unproven and earlier ‘Test Runs’ showed their extreme limitations and falibility, whereas, their opponents had decades more experience and were proven methods, they still managed to grab complete control of the testing and the SPOTLIGHT. Does this not raise any negative thoughts in one’s mind? I’m not a conspiracy theorist, but this case reeks of it….So as stated before anything that claims to support the earlier findings, I’ll view with skeptism, sorry if thats not to your liking. R.","date":"2012-09-01","mins":"1:08 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","title":"Was this page removed because it was just too political?"},{"id":"comment-15560","author":"ron","post":"Thats some powerful ‘voodoo magic’ if it’s blinded millions to the truth, over the span of 25 years! It does make one wonder if there is some ‘devilish’ underpinnings to it all. R.","date":"2012-08-29","mins":"10:54 am","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","title":"Was this page removed because it was just too political?"},{"id":"comment-6372","author":"ron","post":"Yes, he definately has made a ‘huge’ mistake, and not only in not considering “other viable hypothesis” but in stating the original testing should not be in question!!…He was there, apparently new to the field, but there still. He knows quite well what was and wasn’t done correctly, yet he’ll still claim the testing was not in error…..total hogwash. There is definately an AGENDA behind the words. R.","date":"2011-12-31","mins":"10:43 am","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","title":"What’s in a name, Christopher Bronk Ramsey?"},{"id":"comment-6651","author":"ron","post":"I doubt VERY HIGHLY the Shroud was found with the strip already sewn back on in the Tomb!!. Reason; Joseph had bought the Shroud the day of the emtombment! It was brand new when it was bound to Jesus. That thinking is completely illogical Yannick. Do you think Christ sewed the strip back on himself? ….j/k ; ) The idea that the strip may have been sewn on relatively soon after it was found is logical thinking, as whomever aquirred the pieces would want to keep them safely together being it was of great importance to them. Laying the strip side by side with the Shroud, it would not be difficult to match up exactly almost thread by thread the proper location of where to attach the strip. It may also be possible it was resewn much later on reminiscent of the higher quality stitching noticed by Madam Fleury…..Where do you get the ‘possiblility’ there was another strip taken from the other side? There is absolutley no evidence anywhere to even consider this notion…let’s work with what is tangible here. R.","date":"2012-01-07","mins":"7:09 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","title":"What’s in a name, Christopher Bronk Ramsey?"},{"id":"comment-6652","author":"ron","post":"Seriously Max where do you get these notions? I think it states quite cleary in John, that the Shroud and the sudarium were found in the Tomb, this is quite CERTAIN, even in Greek or Koine Greek. Are you suggesting they weren’t found by the apostles and that Jesus was wearing them when he appeared to Mary M.? Do you suppose Jesus would still be wearing an ‘unclean’ garment in his state of transformation? …The only word I can think of here Max is nonsense, but I’ll use another one since I know that word bothers you…Hows rediculous? R.","date":"2012-01-07","mins":"7:21 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","title":"What’s in a name, Christopher Bronk Ramsey?"},{"id":"comment-6373","author":"ron","post":"Firstly, I’d just like to point out a fact which is not mentioned often enough and related to the Shroud’s measurements; It’s measurements of 4.4 x 1.1 metres also conform to the Jewish “Cubit’ in it being exactly 4 x 2 cubits in measurement…another evidence of it’s provenance? Secondly I think Mr Jones is correct in his assumption; there can be little doubt that Ramsey was a player in the RC dating…to what extend is the question, as apparently he was new to the lab at the time. R.","date":"2011-12-31","mins":"10:58 am","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","title":"What’s in a name, Christopher Bronk Ramsey?"},{"id":"comment-6403","author":"ron","post":"It is true what you say about the cubit, but it has been concluded the Hebrew cubits(plural) as two different measurements were used; 17.6 inches regular and 20.7 inches commerce or commercial. Variations from different locals and time could very but were ususally within an inch or so of eachother. They also used two different measurements as shown. I would think when the Shroud was manufactured they would use the higher commercial number of 20.7 inches approximately. Therefore we would have 41.4 ” inches width or 1.05 metres for the Shroud. Pretty close I’d say. Since the Shroud can also differ in size due to conditions, I think it would be safe to say it conforms quite closely to the cubit measurements of the Hebrew first century era. R.","date":"2012-01-01","mins":"3:21 am","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","title":"What’s in a name, Christopher Bronk Ramsey?"},{"id":"comment-10958","author":"ron","post":"Nope, it has been tried but they cannot replicate it when it comes to uniformity of the metal (shape) plus combination of thinness and strength of the metal, that is exactly what dumbfounds the experts. Anyways, there are many things done in the past not understood today. The pyramids, the 1000 ton block of the temple mount etc; As for the Shroud; until all ‘possible’ means known to science are attempted to create this image, no decisive conclusion can come of it, (scientifically). R.","date":"2012-04-29","mins":"2:47 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","title":"When History Trumps Science"},{"id":"comment-10938","author":"ron","post":"Paul :my point is it is not man made since no man today can not or has not produced the shroud and the argument that a 13th century man has done what a modern man can not do is ludicrous on its face. Is there any other ancient man made object that can not be made today? if so i would like to know what it is. Not going against your general comment, but to your question of ancient objects created that cannot be reproduced today; Ancient Greek armour, helmets to be exact to this day cannot be reproduced in a metallurgical sense, just as an example. R.","date":"2012-04-29","mins":"1:11 am","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","title":"When History Trumps Science"},{"id":"comment-6479","author":"ron","post":"Yannick, I never said it was a ‘clear indicator’, just meant IT as another ‘bit’ of information to go along with all the other bits of information known, showing the Shroud’s true age or location of origin. Please don’t put words in my mouth. I can not fathom a “medieval Jewish craftsmen” producing the Shroud in the ancient method of production. Quite unbelievable actually!. Plus doesn’t the point You yourself mention above about the “particular” seam (dating the Shroud to the 1st century), put this medieval Jewish craftsmen in serious doubt??? From two different studies done on the side strip by experts, I do not see it being added at the time of manufacture; The threads that run thru the strip match up with the threads on the Shroud almost perfectly. The consensus on the method of manufacture of such large linen sheets would be; that the sheet the size of the Shroud would have been cut from a much larger sheet. The seam would have then been added later. Also think of it aesthetically, these Linen sheets were expensive, who would buy an imperfect sheet with an unsightly seam along it’s full length? …unlikely… One study mentioned before, proposed the seam was just added for some type of hanging method contrary to Jackson’s theory, but I personally find that reasoning illogical, Why not put seams on both or all sides then? The fact that the threads run thru ‘almost ‘ perfectly I think shows quite well that the strip was originally part of the main sheet, was removed for some reason, then re sewn at a later time…that is my opinion from my readings and in going with Dr Jackson’s hypothesis. R.","date":"2012-01-02","mins":"5:17 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","title":"What’s in a name, Christopher Bronk Ramsey?"},{"id":"comment-10963","author":"ron","post":"Paul I know what your saying but your wrong in the sense that “not all methods possible have been attempted yet” and probably methods that have not been thought up yet either, but with that said, I agree as it stands today; It is a point towards the Shroud’s authenticity, especially with the blood evidence in mind. R.","date":"2012-04-29","mins":"6:23 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","title":"When History Trumps Science"},{"id":"comment-10995","author":"ron","post":"Thats all true Dave but consider some facts here; All scholars are in agreement; it took 15 to 20 years to complete the great pyramid. It took 2.3 million blocks (est). That would mean 12 blocks per hour were ‘placed’ every hour, 24 hours a day 7 days a week for the duration, for it to be accomplished. Thats also 300 2.5 ton blocks, or so, a day being quarried and cut to precise dimensions. A feat which experts today say even with all our technology we can not accomplish….that is what I meant. R.","date":"2012-04-30","mins":"9:34 am","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","title":"When History Trumps Science"},{"id":"comment-10994","author":"ron","post":"Unfortunately, we have no DNA evidence with the Shroud ; ).","date":"2012-04-30","mins":"9:23 am","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","title":"When History Trumps Science"},{"id":"comment-10892","author":"ron","post":"“If a scientist has the results of 99 tests which are in favour of authenticity, and only one which is not, he would not throw out the 99 and accept the one, but would examine the ‘one’ which is not in favour, to determine the possibility of error”…unknown author. Quote: “In archeology, we consider carbon dating results imaginary” Zahi Hawass, archeologist and secretary general of the Egyptian Supreme Council for Antiquities. R.","date":"2012-04-27","mins":"4:59 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","title":"When History Trumps Science"},{"id":"comment-10908","author":"ron","post":"Well Colin if you disregard those comments on C14 especially as you claim to be a scientist/chemist, then I would say you are either blinded by bias or a fraud. There have been many other archeologists that have commented the same and agree with Hawass’s statement. Any scientist, archeologist, anyone who has dealt with radiocarbon dating would agree with those comments. It is a true fact that RCD is error prone, highly subseptable to contamination and ‘based’ on some voodoo mathematics, not to mention relies on “basic assumptions” regarding c14, c12 levels prior to the 1950s…this is fact Colin, not stories or assumptions. People like you now have to deal with the ‘FACT’ that the 1988 RCD is INVALID and scientifically speaking have no argument against the authenticity of the Shroud. All you can do now, since you’ve failed to replicate the image attributes in any form, is try to nit pic at studies that have been done by some with maybe far more knowledge then you, which sorry to say seems pathetic to me. Thanks for coming out. R.","date":"2012-04-28","mins":"7:32 am","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","title":"When History Trumps Science"},{"id":"comment-8958","author":"ron","post":"Well Max I must say I agree with you that the scourch method of an image has not been proven to be impossible or even improbable. Most people are still talkng about draping the shroud over a bas relief or statue and not taking into consideration your actual method. But in saying that; I think it’s imparitive that one produce this scourch image before one can be ‘recognized’, and that means producing all the attributes science has told us about the Shroud image including the superficiality of both the complete front and the partial back side images. There is probably some hypothesis not thought up yet that could explain it, but as it stands today no method has reproduced the image to it’s full extent. As for the ‘electromagnetic’ radiation i.e. “miraculous flashes” hypothesis I also would state to you as I have to others here; Until you can claim to understand all there is to understand about nature or the universe, it is a little premature to exclude those ideas out of hand don’t you think?. R.","date":"2012-03-05","mins":"2:53 pm","url":"https://shroudstory.com/2012/03/05/you-must-be-kidding-colin-berry/","cat":"carbon_14_dating","title":"You must be kidding, Colin Berry"},{"id":"comment-8995","author":"ron","post":"How could you for a second believe you could understand or question whatsoever, what or how God would or wouldn’t do things? …seriously. The other way of looking at all your questions above Colin is; How did a humble linen cloth with a light scorch: (if thats what you’d like to believe), manage to exist two mellenia thru so much turmoil, catastrophies, (man made or by nature) and persecutions to still be here in 2012 to have a retired sciencebod trying to refute it’s provenance? Sometimes God gives us signs in a very subtle and humble way, it is up to us to recognise these signs and it is usually recognised by the heart first. R.","date":"2012-03-06","mins":"8:41 am","url":"https://shroudstory.com/2012/03/05/you-must-be-kidding-colin-berry/","cat":"carbon_14_dating","title":"You must be kidding, Colin Berry"},{"id":"comment-9033","author":"ron","post":"Colinsberry :My job as a scientist is largely done – at least in a proactive experimental sense – having provided the ideas that distinguish between mechanisms, notably conduction v radiation. I leave it now to a technologist who has time on his hands to convert those ideas into a tangible end product – though I suspect few would regard making a life size facsimile copy of the Shroud, complete with blood stains etc as a useful or desirable end product, except perhaps for some fleeting media fame. Why not ask Dr.Di Lazzaro and his ENSA pals with their uv lasers to produce an image – any kind of image – instead of being content with a tiny brown blemish on linen. And you accuse me of being a publicity seeker! Are you aware that every word I have spoken on the Shroud has been confined to this site, and to Tom Chivers’ and my own blogs? Since when has the blogosphere been high profile? Yo Colin, I think your reading me wrong here! …I never suggested in my comment you were a publicity seeker and I, in the past, have agreed with you about the UVU experiments not having much meaning. So don’t go shitting on me. I am merely trying to get you to do what you should do, and that is complete your hypothesis with a working model. If funds are a problem, I was not joking about contacting the people mentioned, they would probably be enticed by your hypothesis since their last theory is dead in the water…they would also probably see a profit in helping you. Plus I don’t think it would be neccessary to use a full size scale model or to even complete a dorsal/front image. I’ve mentioned it before; find a reasonable sized statue or relief and use that. Aslong as the image created can mirror the attributes of the Shroud image, that’s really all that counts. R.","date":"2012-03-07","mins":"3:28 pm","url":"https://shroudstory.com/2012/03/05/you-must-be-kidding-colin-berry/","cat":"carbon_14_dating","title":"You must be kidding, Colin Berry"},{"id":"comment-9020","author":"ron","post":"Well Colin we have all listened to your Hypothesis here for months now. It’s time to finally put the effort in and create your scourch image, with all it’s known attributes of course. Once competed have it varified and you’ll be rich and famous throughout the world!…On the other hand, if your not willing to varify your insistent claims, maybe it’s time to clam up, take up fishing or painting or something! But I for one, am tired of listening and not seeing any evidence. R.","date":"2012-03-07","mins":"10:39 am","url":"https://shroudstory.com/2012/03/05/you-must-be-kidding-colin-berry/","cat":"carbon_14_dating","title":"You must be kidding, Colin Berry"},{"id":"comment-9040","author":"ron","post":"Well Colin that is something you know you’ll have to contend with as just the image formation is not the end all here. There are so many other evidences on the Shroud opposing it being a fraud. The linen itself, most definately not of medieval manufacture, anatomically correct blood flows depicting precise crucifixion angles, scourge wounds identical to a Roman whip not seen since the 4th century etc; etc; All this and what you say makes no difference as all you have to accomplish is to scourch linen equally across the whole image to a depth of .0002 and only on the very top surfaces of the fibrels. This image must also show to be 3d under a vp 8 image analyzer and have a reasonably realistic quality when seen as a positive and I would say your point would be proven! If I missed anything here guys don;t be afraid to chime in, but that is all I think is needed to prove your hypothsis atleast making it porbable. What do you think of that Colin? R.","date":"2012-03-07","mins":"4:12 pm","url":"https://shroudstory.com/2012/03/05/you-must-be-kidding-colin-berry/","cat":"carbon_14_dating","title":"You must be kidding, Colin Berry"},{"id":"comment-9024","author":"ron","post":"I don’t want you leave Colin, that would be rude of me, I’d just like you to complete your hypothesis that’s all (practically). I would think if you were so sure in your convictions, you would want too. Maybe you could write Picnett & Prince, they’ve made loads of money off trying to dispel the Shroud’s authenticity, they may even sponsor you and then you could co author a book about it! Plus it’ll give you something interesting to do, other then wasting all your time on the internet. Think about it Bod. R.","date":"2012-03-07","mins":"11:40 am","url":"https://shroudstory.com/2012/03/05/you-must-be-kidding-colin-berry/","cat":"carbon_14_dating","title":"You must be kidding, Colin Berry"},{"id":"comment-8965","author":"ron","post":"Just noticed my error, my comment was directed at Colin, sorry Max. ; P R.","date":"2012-03-05","mins":"4:46 pm","url":"https://shroudstory.com/2012/03/05/you-must-be-kidding-colin-berry/","cat":"carbon_14_dating","title":"You must be kidding, Colin Berry"},{"id":"comment-15520","author":"ron","post":"Peer review may have it’s issues, but it is better then nothing. Think of it simply as someone ‘proof reading’ a paper you have written. But in this specific case it is understanding the numbers, what they mean, calculating, and if the conclusions are correct and can be reproduced, then it is passed. As long as it is done legitimately, it is the best we have right now. R.","date":"2012-08-27","mins":"7:34 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","title":"Was this page removed because it was just too political?"},{"id":"comment-9049","author":"ron","post":"Bod why do you always take what I say in a negative sense? I was thinking more in the line that yes it looks like a slight scorch left on the linen and I don’t see any trace of onion there, so I was thinking that it looks quite superficial, so, maybe there is something to it. Like placing a film over a bas relief ?//? Nevermind…..","date":"2012-03-07","mins":"6:15 pm","url":"https://shroudstory.com/2012/03/05/you-must-be-kidding-colin-berry/","cat":"carbon_14_dating","title":"You must be kidding, Colin Berry"},{"id":"comment-9046","author":"ron","post":"Well Bod enough talk “just do it” as the once very popular slogan goes ; ) Anyways about your onion experiment, and your link to a picture in your first post above; Notice anything peculiar in your picture? …No? …Well let me point it out; not only did you scorch thru the single layer onion skin but you actually scorched the linen somewhat, take a good look again. Does this give you any ideas? R.","date":"2012-03-07","mins":"4:55 pm","url":"https://shroudstory.com/2012/03/05/you-must-be-kidding-colin-berry/","cat":"carbon_14_dating","title":"You must be kidding, Colin Berry"},{"id":"comment-9041","author":"ron","post":"Sorry typo error; Not porbable but probable..","date":"2012-03-07","mins":"4:18 pm","url":"https://shroudstory.com/2012/03/05/you-must-be-kidding-colin-berry/","cat":"carbon_14_dating","title":"You must be kidding, Colin Berry"},{"id":"comment-8963","author":"ron","post":"Colinsberry :Why do people make such a meal about this superficiality thing, and make ludicrous claims that superficial scorching is impossible? One might as well claim that it’s impossible to brush against an electric iron without risking a third degree burn. There are at least 4 variables that can be independently controlled to get a light scorch affecting the most superficial part of a linen fibre – temperature, application pressure, application time, and presence or absence of a cool and/or damp underlay to act as heat sink. I have today reproduced an earlier experiment with some better controls – the one that showed one can selectively scorch a sheet of onion epidermis – just one cell thick – with no appreciable effect on an underlying sheet of linen. Superficiality is NOT a problem, neither in theory nor practice. Let’s move on shall we? As for radiation, it’s simply a non starter (although that has not deterred the distractionists and obscurantists from constantly invoking it is as the “likely” or “most promising” model, basically because it serves the purpose of further mystifying the Shroud, instead of demystifying. Radiation is ruled out for the simple reason that production of electromagnetic waves by some miraculous process does not result in an image if there is no focusing or collimating system in place. Neither is there any known means of producing ultraviolet radiation or x rays from a non incandescent or non irradiated material, e,g, a corpse, and even low energy infrared and visible light have their problems – they cannot scorch if there is nothing to absorb them. There’s a basic law of physics – no absorption, no action – and there’s still the absence of lens, mirrors etc to bring to a focus. Yup, it’s a scorch, and a superficial one, at least initially, affecting the thread crowns, and that is a signature of a contact scorch, probably from hot metal – but that’s not what folk want to hear. No problem if it’s ordinary folk – it being a free country. That so called scientists should be part of a huge distraction exercise is something else… My feelings towards them are one of disgust and contempt… I don’t believe I’ve heard anyone say creating a superficial scorch is impossible, and if so easily possible as you say, then produce one and shut everyone up! But that is not the only aspect your dealing with here Colin and you know that quite well, don’t you. I’ve said it before and I’ll say it again it’s one thing to scorch some linen, it’s another to do so with ALL the attributes accompanying that scorch. And that includes creating a scorch which doesn’t fluoresce, a scorch that will create a detailed image with 3 D distance information, a scorch that will not effect the blood covering the shroud or bas relief/statue, …So not so simple when everything is taken into account is it Colin? Anyways, this is only one aspect of the Shroud, there are numerous others to deal with that when one contemplates all of these aspects (as a whole) which we find on the Shroud, one wonders how anyone can possibly refute it’s authenticity?…That is my stand Colin, in opposition to yours and other skeptics and until someone can refute the Shroud with ‘proven’ scientific and peer reviewed methods, my mind will not change. R.","date":"2012-03-05","mins":"4:42 pm","url":"https://shroudstory.com/2012/03/05/you-must-be-kidding-colin-berry/","cat":"carbon_14_dating","title":"You must be kidding, Colin Berry"},{"id":"comment-8974","author":"ron","post":"Actually Colin I haven’t yet viewed an ‘attempted’ scourch image (yours included especially) with 3 D aspects as perfect as the Shroud, close maybe, but close only counts in horseshoes and hand granades. Your answer to the non flourescence sounds like a cop out to me, sorry….Actually I believe it may have been Ray Rogers that stated the 1532 fire and heat from the fire had definately affected the blood close to the burn marks but not anyother blood… So, R.Rogers peer reviewed paper is scarcely credible now, aren’t you lucky people didn’t view your peer reviewed papers that way?. There is no agenda to discredit and denigrate the three labs Bod, they did it to themselfs, the evidence is clear: So get over it. R.","date":"2012-03-05","mins":"6:00 pm","url":"https://shroudstory.com/2012/03/05/you-must-be-kidding-colin-berry/","cat":"carbon_14_dating","title":"You must be kidding, Colin Berry"}]
