[{"id":"comment-8846","author":"ron","post":"I am definately not a biblical expert by any means and don’t claim to be. Although my simpleton mind tells me the Lord would definately not create his book so ‘cryptic’ as for only the studied few to understand, but ‘simple’ for all to understand!!…Maybe some take things too far, as in arhcaeocryptography or whatever you wan to call it, which to me sounds like a futile attempt to find something that is maybe not there. I think the Lord would be using the KISS system to be honest!…As for clues to the Shroud being in the good book, maybe, but I wouldn’t be looking in Revelation for them….I’d look somewhere closer to the actual event for them….thats’ just my thoughts though, not meaning to put anyone down here. ; ) R.","date":"2012-03-01","mins":"1:52 am","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"},{"id":"comment-8864","author":"ron","post":"The Shroud is obviously and definately different then the written word. Not a well thought out analogy Max, and it’s quite clear why it’s still a mystery; As in my understanding, God expects a leap of faith. It sounds to me like you are trying to tell people you have the ‘true’ meaning to the Book of Revelation? …Maybe to your interpretation Max, just as all scriptures are interpreted differently by any and every person who reads them. But to state it is anything other then your own ‘personal’ interpretation I think would be an extreme showing of conceit, to be honest. R.","date":"2012-03-01","mins":"2:45 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"},{"id":"comment-8870","author":"ron","post":"Max Patrick Hamon :Allow me to disagree (once more) with you Ron.The Shroud of Turin might well be compared to/identified with a fifth Gospel written with the very flesh and blood of Rabbi Yeshua. Besides any genuine leap of faith cannot just rest on half truths, received ideas and the like that litters the Turin Shroud topic. As an archaeological truth quester, I am just trying to give “my opinion” as a different viewpoint on the Shroud even if it may go against the Christian or non Christian “well thinking” conservative consensus. Not a very easy task with people like you or Dave all too ready to ad hominem attacks! No wonder if I strike back! I have welcomed many an opinion other than mine on the Shroud since I got interested in the issue but it does seem you, most unfairly, prefer to only retain the opinions I totally disagree with. Are you harbouring any personal rancour against me, Ron just because twice or thrice I told you I thought you were totally wrong? To your final question; Absolutely not Max, as I’ve also told you twice or thrice I think your totally wrong and still believe so!….Actually Max, It’s not your viewpoint or what you say, it’s the way you say it, which is mostly in a very arrogant, condescending manner. R.","date":"2012-03-01","mins":"5:42 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"},{"id":"comment-27680","author":"ron","post":"I was hoping Barrie would be featured on some special this coming Easter. I always enjoy listening to interviews with Barrie. One always picks up some new tid bits from doing so, and he is always the most graceful guest…. Can’t wait : ) R.","date":"2013-03-18","mins":"3:17 pm","url":"https://shroudstory.com/2013/03/15/barrie-schwortz-on-beyond-belief-and-coast-to-coast/","cat":"event","title":"Barrie Schwortz on Beyond Belief and Coast to Coast"},{"id":"comment-17922","author":"ron","post":"Charles I thought the consensus is that tetradiplon simply means; Tetra (four) diplon (doubled)…Four doubled. Which would mean; one would double a long sheet four times. I don’t think ‘folded’ was or is the right translation in there. R.","date":"2012-10-20","mins":"6:17 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17930","author":"ron","post":"Charles Freeman :Ron: ‘Four doubled. Which would mean; one would double a long sheet four times.’Yes, this is the basic argument in my article (contra Wilson’s three doublings) I use the example of a napkin tho show that tetradiplon could apply to quite a small cloth. Folding is, of course, implied and perhaps my source was concentrating on the example of an actual cloth. Charles; “although there is no reason why the cloth should be long,” – To you maybe, but it seems to me, the use of the term tetradiplon or any term whatsoever, would logically suggest a much larger cloth being used, as opposed to a small cloth. Why would a small towel or napkin need to be doubled in four, or folded at all? I agree with you that four doubled would require four foldings. Furthermore this type folding would produce seven fold marks on the cloth. R.","date":"2012-10-20","mins":"10:53 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17427","author":"ron","post":"Freeman; “Did Rogers and LANL ever come up with a secure date? I thought Rogers proposed a very wide date range that was worse than useless in pinning down a specific date for the making of the Shroud.” Rogers proposed dating was from his observations of the lack of vanillin found on the main fibrels of the Shroud. It is not a precise dating method but a guide, and in essence from the lack of vanillin found on the Shroud and comparing too amounts found on other ancient linens, he calculated that the age of the cloth was “atleast” 1300 years old. Bringing it’s most recent probable age to the year 700 AD approximately and centuries older then the 1988 radiocarbon dating suggested….No mystery there. R.","date":"2012-10-10","mins":"2:55 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17436","author":"ron","post":"In all seriousness, I don’t need Phillip Ball to tell me if, or if not, the 1988 radiocarbon dating was flawed. The facts speak for themselfs, the 1988 c14 dating is immaterial now, as far as I’m concerned. With all we know of the dating in question, it seriously baffles the mind, that anyone puts any emphasis on it anymore. Furthermore, I could care less what Ball thinks of Rogers works, has he done any scientific research or study that can oppose Roger’s vanillin findings?.","date":"2012-10-10","mins":"3:59 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17424","author":"ron","post":"I think the lot of you obviously didn’t catch any of my previous posts pertaining to issues with radiocarbon dating. The MAIN issue is contamination and secondly provenance!! Even with new minor advancements in AMS, they still cannot be absolutely sure about contamination. Remember we are talkng a fabric here, which is by far the most difficult of artifacts to radiocarbon date. Just think of the contaminants this cloth has picked up! Centuries of candle and incense smoke, experiencing extreme heat and smoke from atleast two fires, proximity to other numerous other material etc; etc;…It would be a complete waste of time, at the moment, to radiocarbon date this cloth any further…. And I definately would suggest, it not be handed to ANY of the previous labs involved in the 1988 tests. That would be just plain stupidity. R.","date":"2012-10-10","mins":"2:08 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17425","author":"ron","post":"Forgot to mention, as I stated way back when this challenge was first brought forth; That I doubted Dawkins would respond, as he “barely acknowledges the Shroud” with any importance whatsoever!…Why would he bother? R.","date":"2012-10-10","mins":"2:19 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17444","author":"ron","post":"It is only a ‘marginal issue’ to those that are blind too or cannot comprehend the meaning of this Shroud. You may be right about the next Tabor documentary though ; ) R.","date":"2012-10-10","mins":"5:15 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17443","author":"ron","post":"Charles Freeman :So you agree that Rogers offered no precise date. As I am arguing for a new Carbon 14 dating, the 1988 test result is irrelevant. We would start again from scratch with the immense advantage of the more sophisticated methods that have been developed to deal with earlier problems of Carbon 14 dating. There have been real advances here while no one has,apparently, ever been able to use Rogers’ approach to achieve a date for cloth. Rogers never claimed to give a ‘precise’ date. A precise date cannot be achieved, presently, using the lignin/vanillin method. You should read his paper again. Rogers states clearly it is a GUIDE only. But this guide has, even with it’s wide range, shown the 1988 dating of 1325, to be way out of whack and by centuries. This is very clear. I agree the 1988 test is irrelevant, and I would add it is immaterial aswell. I tend to disagree that any serious advances have been made in AMS or especially in contamination issues, which from what I understand are still a huge thorn in the sides of radiocarbon technicians. There is a myriad of issues with RCD that still prevail, and still make it an unreliable method for testing ‘accurately’ items of no provenance and undetermined contamination, such as the Shroud. I don’t blame the Vatican for not even contemplating any further C14 testing, cause they’re right on, on that issue. R.","date":"2012-10-10","mins":"5:03 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17453","author":"ron","post":"Anoxie :I care what Pr Ramsey thinks of Rogers’ and LANL’s works. And why would that be? …He still will not admit to all the ‘seriously’ incompetent procedures and errors done back in 1988, and still believes any new tests would point the Shroud to the middle ages!….He is simply biased in favour of their early results, hense against any notion the Shroud could be older or authentic…This is clear from his statements…Personally, I wouldn’t trust him or his lab to do another Shroud C14 testing, if it ever happens. Remember, his name is on the original Nature paper. R.","date":"2012-10-10","mins":"8:34 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17637","author":"ron","post":"I’m afraid Chearles you have a dilusional idea of radiodcarbon dating. For one RC Dating on its own, would never, ever be taken as proof to any age. RC Dating must be compared to and with all other relevant information. I have a friend that works at a prestigious RC lab here in Toronto, with over 20 years experience in the lab. I am not abliged to give out the name of this person, but he has told me he believes when it comes to the Shroud a proper dating would be extremely difficult to achieve and he points to the issue of provenance, as being number one and contamination equally as important in problem area in the testing. Materials such as linen are extremely difficult to date as they can absorb c14 isotopes from various sources and these can inpregnate right into the fibrels making them next to impossible or impossible to be sure all contamination has been removed. He has stated to me and I have read this many times in my own research of RC Dating, that contamination is the main cause of numerous erroneous and odd dating that has occurred and STILL occurs on a regular basis. These anomalies are not fully understood in many cases but are usually blamed on contamination…Point is; They are still not at the stage of understanding where they can R Cdate a sample such as from the S Hroud with any certainty whatsoever…This is fact. R.","date":"2012-10-14","mins":"5:59 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17463","author":"ron","post":"Sorry Anoxie, it would seem I misunderstood your earlier comments. As to your question pertaining to Ramsey; I don’t know the answer either. Maybe you can write him for an answer. R.","date":"2012-10-11","mins":"6:34 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17138","author":"ron","post":"I sense a bit of paranoia in your words Davor. You gotta learn to chill. ; ) R.","date":"2012-10-01","mins":"6:12 pm","url":"https://shroudstory.com/2012/10/01/davor-aslanovski-to-attend-b-s-t-s-british-society-for-the-turin-shroud-meeting/","cat":"event","title":"Davor Aslanovski to attend B.S.T.S. (British Society for the Turin Shroud) Meeting"},{"id":"comment-17139","author":"ron","post":"Hahaha, nice one Dave. : ) R.","date":"2012-10-01","mins":"6:13 pm","url":"https://shroudstory.com/2012/10/01/davor-aslanovski-to-attend-b-s-t-s-british-society-for-the-turin-shroud-meeting/","cat":"event","title":"Davor Aslanovski to attend B.S.T.S. (British Society for the Turin Shroud) Meeting"},{"id":"comment-27090","author":"ron","post":"I agree Joe, it’s a shame. But, there is alot more then Roger’s ‘findings’ when it comes to the C14 tests done in ’88. The simple fact that people believe that C14 testing is infalible, and do not bother to educate themselfs in the truth about carbon dating and it’s shortcomings, is just as shameful. Especially with testing materials such as linen and more importantly the KNOWN issue of contamination…They just don’t WANT to see the truth. R.","date":"2013-03-11","mins":"3:56 pm","url":"https://shroudstory.com/2013/03/04/down-loadable-apps-books-holy-saturday-exhibition/","cat":"event","title":"Down-loadable apps, books:  Holy Saturday Exhibition"},{"id":"comment-22827","author":"ron","post":"As far as I know, no one else EVER claimed to be King of the Jews! Your thought that the concensus is the opposite is just plain rediculous, sorry. Common crucifixions did not as far as I’ve read, include the extent of scourging witnessed by the victim on the Shroud. This was a rarity amongst crucifixions. Common graves? How many bones would you expect to find, which hadn’t been carried off by wild animals? The concensus follows that crucifixion in this fashion did not last, and can be claimed to be within the first few centuries AD, at the latest. The point was originally that with all these ‘particular’ details mentioned, and put all together, what would the ‘chances’ be that some other unlucky soul suffered the ‘exact’ same. Statistically it is in Billions to 1, and that is conservative. To argue otherwise, is simply being blind to the truth. I am not alone when I say there is NO doubt the man on the Shroud is Jesus or a depiction of him, and not someone else. R.","date":"2013-01-27","mins":"11:44 am","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","title":"Eric J. Jumper to Speak on the Shroud of Turin"},{"id":"comment-22702","author":"ron","post":"Russ, I believe you may be right. Although I don’t believe many of the STURP team actually rejected the Shroud solely on evidence of the C14 dating, a few obviously did. I believe R.Rogers may have also been one who did, and for those few who did, it baffles the mind that the C14 dating result ‘alone’ could have convinced them of anything. These people were of exceptional minds, and I being a simple newb can see ‘clearly’ how unreliable the 1988 tests could be, or were, and also understand that basically; one C14 dating can not be taken as proof of anything. Gabriel, I don’t believe any of the STURP members claimed it was genuine, but they did reach the conclusion it definitely was not the work of an artist, i.e; a painting or an etching, or a bas relief etc;. Basically not a forgery of any kind. As Barrie Schwortz is fond of saying; “We can tell you what it isn’t, but we can’t tell you what it is” ; ) R.","date":"2013-01-26","mins":"5:38 am","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","title":"Eric J. Jumper to Speak on the Shroud of Turin"},{"id":"comment-22850","author":"ron","post":"NT scriptures suggest that Jesus was scourged ‘excessively’ and only because Pilot did not find him deserving of crucifixion, initially. This along with the use of some commonsense would seem the reasonable conclusion, as it would be very unlikely the Romans would want to bring any victim to near death before they were crucified.Crucifixion was supposed to be a long drawn out affair, afterall. As for your Kings, and with a quick Wiki read; Simon of Perea was beheaded, Lukuas apparently disappeared with no trace…so we can rule them both out as being the ones we see on the Shroud. Please list the others so we can eliminate them also as candidates. Furthermore, crucifixion victims in most of the Roman world were purported to have been left on they’re crosses to rot or to be devoured by animals as a deterent to others. Only in Judea, since the Jewish law would not allow for the bodies to hang overnight, were victims likely removed. So it is safe to assume they would be taken down, and since in only one instance has evidence of a crucifixion victim ever been found in tombs, out of hundreds of finds, it can and is safely assumed by most archaeologists, that most crucifixion victims would have been buried in mass graves, and likely open graves. As for your concensus, lets not forget this victim of the Shroud just happened to be removed from the Shroud within 36 hours, (this is assuming ofcourse it is a real burial Shroud and not a depiction, which most all scientific evidence seems to agree). Ron.","date":"2013-01-27","mins":"9:40 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","title":"Eric J. Jumper to Speak on the Shroud of Turin"},{"id":"comment-22703","author":"ron","post":"I believe the concensus is, (by anyone who has studied the image extensively along with Gospel scriptures), that the image could not be of anyone else but that of Jesus Christ. In fact I believe several have concluded that the chance this image could be of anyone else other then Jesus, is in the billions to one. R.","date":"2013-01-26","mins":"5:43 am","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","title":"Eric J. Jumper to Speak on the Shroud of Turin"},{"id":"comment-23223","author":"ron","post":"Daveb; “I think Ron may be incorrect in asserting that it was the regular practice to dump Jewish crucified bodies into a common or open grave, and that Jesus is the only know case of a decent burial.” – Dave I never asserted this conclusion, it has been concluded or surmised by many archaeologolists. This assertion comes from the fact that only in one case as evidence ever been found of a crucified victim from the many tombs in Israel. I did not mention Jesus, I was referring to the Givat Ha Mivtar findings as the only find. Since in hundreds of finds, evidence of crucifixion appears only once it is assumed most crucifixion victims would or must have been buried in mass graves. Although no mass graves have been found to date to back this assertion, there may be several reasons for this, including the graves may have been left open for a period and bones scattered. R.","date":"2013-02-02","mins":"6:43 am","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","title":"Eric J. Jumper to Speak on the Shroud of Turin"},{"id":"comment-18027","author":"ron","post":"Charles Freeman :I partially take your point but Fulbright weakens her argument for a Jerusalem source for the Shroud by giving, at the end of her article, examples of a similar weave to the Shroud from the Tyrol, southern England, Sweden, Dura Europus , Egypt and Pompeii, thus showing it was a common weave throughout Europe and as far east as Dura Europus. So what does this tell us? Just that, as Raes noted, it is impossible to date or allocate the place of manufacture of the Shroud from the weave alone so that approach needs to be abandoned. As DF has accepted the radio carbon dates for her, much older , samples without comment, I assume she would be happy to use them on the Shroud itself.Incidentally Google Images :’ Looms Greek vases’ will show that large pieces of cloth could be woven and there should be similar evidence in H. Ling Roth’s Ancient Egyptian and Greek Looms. I don’t know where the idea that only small cloths could be woven in ancient times ever came from. I don’t recall anyone ‘EVER’ using the 3 to1 herringbone weave ‘alone’ as evidence for the Shroud “to date or allocate the place of manufacture”, except that it certainly was not manufactured in medieval times, as by then it was not ecomical to do so and the looms themselfs had changed. I also believe archealogical evidence shows quite clearly, large and very large cloths were being created in ancient times, and with various stitch counts, weave patterns and even multiple type stock. I’ve read somewhere of cloths being loomed in ancient Egypt four times the width and twice the length of the Shroud! From what I recall, skeptic’s arguments in the past have been that cloths the size and complexity of the Shroud were not manufactured in ancient times. The evidence too the contrary of this, just strengthens the Shroud probable ancient provenance actually. R.","date":"2012-10-22","mins":"7:33 am","url":"https://shroudstory.com/2012/10/21/on-the-day-of-the-bsts-meeting/","cat":"event","title":"On the Day of the BSTS Meeting"},{"id":"comment-25842","author":"ron","post":"I lost my Decoder ring long ago, but in Benedict’s statements; “looking at this sacred Cloth through the eyes of faith, one may perceive something of this light.” and “Effectively, the Shroud was immersed in that profound darkness that was at the same time luminous”…Is he possibly hinting to all what he actually believes caused the image? …In essence the LIGHT of the resurrection? …I believe this is exactly what he is saying. R.","date":"2013-02-27","mins":"3:54 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral"},{"id":"comment-27031","author":"ron","post":"Yannick I think you are reading a little too much into that particular NT statement. Jesus did not send Mary Magdalen out to preach the word, but in particular, to tell the deciples what had transpired. If you don’t believe me, please read on a little ifurther n John 20, to John 20:21. This is where Jesus ordains the “12” with the spirit and to go forth and preach. Now one can ask was Mary among those in the room that evening? I don’t think so, as one would think if she was and if there were any others outside of the ’12’ there, it would have been mentioned…The mention of the ’12’ is simply a ‘title’, as we all know very well that Thomas and Judas were not there. Personally, I cannot find any reason why woman cannot be ordained, or why priests can’t marry. Several of the apostles were married I believe, so what’s the problem. Furthermore we have very little knowledge on what happened to Mary Magdalen and the several other woman that followed Jesus. Did they preach or just accompany the other apostles? It’s hard to say. But I think it unlikely they preached considering the ‘outlook’ towards women in that period. R.","date":"2013-03-10","mins":"8:35 pm","url":"https://shroudstory.com/2013/03/10/picture-of-veneration-in-a-ukrainian-parish/","cat":"event","title":"Picture of Veneration in a Ukrainian Parish"},{"id":"comment-25851","author":"ron","post":"Lets use some commonsense here Yannick!…’Actions speak louder then words’, remember that old saying? IF the(Church) did not believe this Shroud to be authentic, then ask yourself, why would they spend millions to protect it? If it is simply a cloth, it would or should mean nothing to them, even if thought of as a fine piece of art. Seriously I think you should read Benedict’s words a little closer. R.","date":"2013-02-27","mins":"5:18 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral"},{"id":"comment-27088","author":"ron","post":"Yannick Clément :Ron, there are many ways to understand a certain part of the Gospel. Jesus DID sent Mary to tell the Good News to the apostles and to me, that’s a missionary task AND THAT’S SAYS A LOT ABOUT JESUS POINT OF VIEW REGARDING WOMEN. The actual Catholic Church is far behind that view of Christ in my mind. Sorry but there is not “many ways” to interpret that specific comment! It is clear Jesus simply asked Mary to tell the apostles that she had seen him and he was alive,…nothing more. If you want to go adding to that, that is your prerogative, but it is wrong. There is no evidence that Jesus ordained any of the women or that he inpired them to go out and preach whatsoever. But who is to know for sure what transpired back then, in circumstances as these. No gospel of Mary Magdalene or anyone else exists of Jesus’s women followers, unless you want to accept the gnostic gospels as authentic or worse that you want to believe the early church destroyed them. As I stated before, I have no issue personally about women being ordained, but I do not make the rules and I certainly do not have the confidence to rule against what the church fathers have decided. I also don’t believe we have the right to say the church is behind the times….It could be said the other way in the sense that people are turning thier backs on church doctrine to suit their new “politically correct” view of the world. R.","date":"2013-03-11","mins":"3:30 pm","url":"https://shroudstory.com/2013/03/10/picture-of-veneration-in-a-ukrainian-parish/","cat":"event","title":"Picture of Veneration in a Ukrainian Parish"},{"id":"comment-18821","author":"ron","post":"Finally somewhere close! Niagra Falls, NY is only a couple hours drive. I might just make it out to this ‘Encounter’…Would really enjoy meeting Russ too. Here’s hoping I can make it on that date. R.","date":"2012-11-05","mins":"5:03 pm","url":"https://shroudstory.com/2012/11/03/shroud-encounter-coming-to-cresson-pa-and-buffalo-ny/","cat":"event","title":"Shroud Encounter Coming to Cresson, PA and Buffalo, NY"},{"id":"comment-9818","author":"ron","post":"I am in almost total agreement with the last two comments. Although, I wouldn’t agree that Dawkins is not a fool…Sure he may be making loads of money, but, he can’t take it with him! In light of the way he is acquiring all this wealth, I think he’ll have plenty to explain IF he ever makes it to the Pearly Gates…I won’t pray for him, but I will pray for the many many laymen souls out there that believe in his trash writings, and are being averted from the truth of our Lord….I’ll leave Hawkins to God. R.","date":"2012-03-31","mins":"8:43 am","url":"https://shroudstory.com/2012/03/31/speaking-of-issuing-challenges-to-dawkins/","cat":"event","title":"Speaking of issuing challenges to Dawkins"},{"id":"comment-8145","author":"ron","post":"Annie, very nice comment! but I don’t think the ‘real’ Shroud will be going along, just a copy, as the Shroud never leaves it’s place, or very very rarely anyways. If the exhibit is anything like their promotional film it should be something to see. That promo film was pretty powerful, especially it’s epilogue, …well done. R.","date":"2012-02-11","mins":"1:15 pm","url":"https://shroudstory.com/2012/02/11/upcoming-exciting-exhibition-on-the-shroud-of-turin-in-mlaga-spain/","cat":"event","title":"Upcoming, exciting exhibition on the Shroud of Turin in Málaga, Spain"},{"id":"comment-24925","author":"ron","post":"Ontario! I’m hoping you mean Ontario, Canada…and hopefully Toronto. I definately would not miss it this time around. R.","date":"2013-02-19","mins":"6:10 pm","url":"https://shroudstory.com/2013/02/19/upcoming-shroud-encounter-talks-with-russ-breault/","cat":"event","title":"Upcoming Shroud Encounter Talks with Russ Breault"},{"id":"comment-161337","author":"ron","post":"I remember reading that Madam Flury Lemburg, who did part of the restoration in 2002 stated she did not find traces of stitching in the area….but I may be mistaken. Ron.","date":"2014-10-11","mins":"11:09 am","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","title":"St. Louis, Friday Morning"},{"id":"comment-9848","author":"ron","post":"Susana, you said; ” this is not the life we’re supposed to value. Just because many innocents died that day, it doesn’t mean they were obliterated” ….Exactly! In my eyes I see it as; A moment of suffering for eternal life!…This is exactly what people such as Dawkin’s can never believe or accept due to their lack of faith and materialist ideals. I believe as you the innocents have been rewarded a billion times over for whatever suffering they may have occurred. Maybe Dawkins should start thinking about all the billions of deaths due to ‘materialistic ideals’ and idealists. Ron.","date":"2012-04-02","mins":"3:30 am","url":"https://shroudstory.com/2012/03/31/speaking-of-issuing-challenges-to-dawkins/","cat":"event","title":"Speaking of issuing challenges to Dawkins"}]
