[{"id":"comment-5858","author":"ron","post":"Hey there may be lots of folk out there that need just that little nudge! God does work in mysterious ways ; ) Did Dawkins really say that? …LOL R.","date":"2011-12-21","mins":"6:19 pm","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","title":"An unsatisfactory faith insists upon forensic proofs"},{"id":"comment-6039","author":"ron","post":"Does not Rev.Mullen ‘study’ scripture? All clergy will study scriptures and Why? …to ‘understand’ fully their meaning. The study of the shroud may be no different, it all depends on your view of the Shroud. Some have claimed in their belief the Shroud to be the 5th Gospel, in a sense I tend to agree. R.","date":"2011-12-23","mins":"2:19 pm","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","title":"An unsatisfactory faith insists upon forensic proofs"},{"id":"comment-5961","author":"ron","post":"I thought you said the previous comment would be your last comment, LOL ; ) R.","date":"2011-12-22","mins":"5:00 pm","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","title":"An unsatisfactory faith insists upon forensic proofs"},{"id":"comment-6088","author":"ron","post":"Yannick Clément :Quote : “The ‘assumption’ being, that it is from a “lack of faith” that people seek more “forensic proofs” or lets call it information from the Shroud.” If it’s not a lack of faith, it’s surely a lack of confidence… That’s why Jesus call us to try to have a child’s faith. A child is full of confidence and never ask for a proof to believe in something !!! We, the adults, then to lose this kind of faith as our rational part grow up. And then, we start to call for proofs in order to believe ! That’s not the kind of faith that was praised by Jesus. So, for the Shroud, it’s not at all an anti christian thing to study and reflect upon this relic (whether it’s in a scientific or spiritual way). Not at all. It can even strenghten our faith ! So, it’s good. But the problem would be that someone base ALL his faith in Christ upon this Shroud. That would be really dangerous… And this kind of faith would surely be very weak. That’s it. “It is an unsatisfactory faith which insists on forensic proofs” …Sorry. I don’t think it’s even a lack of confidence, it’s just ‘Study’ Yannick, thats it. Sure no one should be idolizing this Shroud, I agree, BUT, that is not what Rev.Mullen was implying. He basically implied that anyone who studies the Shroud ‘in depth’ lack faith, he didn’t say confidence, he said “unsatisfactory faith” and he is definitely wrong on that point. You, as well as I and most on this blog, are students of the Shroud are we not? Are our faiths challenged? or are we lacking confidence in our faith?….I think NOT. Jesus said; “Seek and you shall find”. R.","date":"2011-12-24","mins":"9:45 am","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","title":"An unsatisfactory faith insists upon forensic proofs"},{"id":"comment-5960","author":"ron","post":"Yannick I never said you have a bias against the Shroud or that you think different then you say. I was talking about Mullen and the Pope, respectfully. Actually I happen to know that the Pope does believe in the Shroud’s providence, I read it somewhere and he was quoted. Don’t ask me where cause I can’t remember. Hey I’m okay with whatever meaning you get from the Shroud, I’m glad you found it already and maybe it is as you say, but I’m not convinced thats all it is, hense I keep searching and I believe others feel the same. There may be more to it. Thanks Yannick, like I’ve said my faith is intact and has been since I was a wee little lad. But it was meant as in that I don’t need the Shroud. I think with most people; visual stimulation is of a higher degree then anyother sense. Especially in this age as you say, but I have heard that it is also moreso for men then woman. (I just read that, it is not me saying it) ; ) R..","date":"2011-12-22","mins":"4:59 pm","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","title":"An unsatisfactory faith insists upon forensic proofs"},{"id":"comment-5880","author":"ron","post":"It sort of bothers me a tad, that some folk would conclude because someone is ‘Interested’ in the Shroud: that includes all people involved in it’s study and interested in such, can somehow lack faith???. I’m talking most of us here also!…Sure the Church only agrees that it is a “reminder” of what Jesus did for us, but I believe that is just a politically correct answer. I’ll bet if you asked Pope Benedict what he really thought in private, his answer would be completely different!….Furthermore, If it is JUST a reminder, what is it doing here at all? Really? There are reminders everywhere, everyday, numerous churches with crosses etc; We’re not a simple minded bunch that jump to conclusions and Christianity is not by far a blind faith. Jesus made a statement to this ‘blind faith’, although I can’t seem to remember it well enough to quote it here. No one is making this Shroud a “criteria for faith”, but some believe it is real or think it may be, and thru study of it are trying to find it’s ‘meaning’… How is searching for “forensic proofs” on the Shroud any different from the Insistent historical and literal studies of the Bible? These studies are not that we do not believe, but that we want to understand. I get the impression Rev Mullen may have a bias against the Shroud, as many of the Church do, and it’s nothing new!. Personally, I have no quelm in wanting to understand ‘everything’ I can about the Shroud, especially when it comes to my faith!! In my eyes it just may be a beautiful ‘sign’ or ‘message’ left here by our saviour….Now whats wrong with that? My faith is intact with or without the Shroud. There is something about the Shroud which I cannot explain from the first time I gazed eyes on it, which has me in it’s grasp and has me wanting to know more about it’s providence, if such, but moreso of our Lord Jesus. R.","date":"2011-12-22","mins":"7:40 am","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","title":"An unsatisfactory faith insists upon forensic proofs"},{"id":"comment-6037","author":"ron","post":"I get what your saying Yannick, and I agree, we all strive to find that “Child faith”, which is not easy in this world. It is a fine course in which to lead our lives though!! …But I don’t agree in what Rev. Dr. Mullen procalims. I get a different sense of his words then you and I think he makes a mistake and very misplaced assumption. The ‘assumption’ being, that it is from a “lack of faith” that people seek more “forensic proofs” or lets call it information from the Shroud. That was my point and I think my analogy to the study of scriptures was a good point to this. R.","date":"2011-12-23","mins":"2:09 pm","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","title":"An unsatisfactory faith insists upon forensic proofs"},{"id":"comment-3450","author":"ron","post":"Yannick have you happened to read Dr Zugibe’s hypothesis on the body being washed in all your readings? This topic is highly contested, but to me makes alot of sense and can explain much of what you have talked about.I’m not contesting the humidity hypothesis with this statement but just adding an alternate cause for the blood or more precisely ‘most’ blood to show or be transferred to the shroud.I think it’s safe to assume that by the time they had reached the tomb, the body would have been covered in dirt or dust, with dirt encrusted on many, if not most of the wounds…Jesus did hang on the cross for atleast an hour after death and again laid in front of the cross for the same amount of time, this info (hypothesis) taken from my studies on the Sudarium of Oviedo.Anyways this could explain possible reopening of wounds and the ‘easy’ transfer of blood to the shroud.Much better then the humidity hypothesis, IMHO…As for your statement made in the earlier comment about the ‘Strips’, all I can say is, there have never been any other stips of cloth found to date and I would assume the deciples would have carried those off also.So it is a huge assumption, whereas with the shroud, the sewn strip and the sudarium we have tangible evidence to speak of. Ron..","date":"2011-07-27","mins":"11:17 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","title":"More on Flagrum Proportions and Measurements and Now the Side Strip"},{"id":"comment-3473","author":"ron","post":"Holy cow Yannick you got to learn to compress your thoughts/writings a little lol.I’m going to have to read your comments carefully and get back to you when I have more time.But I will attempt to answer your first argument presently on the scourging; 1.~I don’t see it being too hard to accept that even if Jesus was wearing a Tunic, a whip would not still leave whelts on the body, especially since the material of a tunic would be quite thin.There is the possibility of the tunic raising leaving the bottom most part of the legs bare(Especially during the times the lord fell).Seeing also that there were very few 3rd type whip wounds; (30) I believe, to me strengthens my argument in that it would mean very few lashes, 30 wounds with the 3rd type whip would calculate to specutively 10 or less lashes….What would be the reason for so few lashes if it was done at the same time of the scourging? It makes more sense to me that so few lashes would have occurred at a different time.But that is just my conjecture, nothing more. 2.~Seeing that the Romans didn’t care much about the Jews and especially one that was marked as a ‘criminal’, I have no problem in accepting the possibility the Romans whipped him during his ascent to Golgotha.(It is known, that many ‘victims’ of crucifixion never made it passed the brutal scourging).So to answer your second argument; No, I don’t think it’s far fetched to propose he was whipped on his way to Calvery. Read; New Image Processing of the Turin Shroud Scourge Marks (Faccini, Fanti), if you haven’t already~ ~To the article by Faccini, Fanti.I’m not in total acceptence as I believe they ‘may’ have made a fatal flaw and it has to do with the type1 and 2 scourge marks, as I do not believe there was a type 2 scourge, but that these marks were left by the type 1 alone (The Flagrum).Reasoning; I read that the actual thongs of the flagrum (an actual sample of a flagrum found by archaeologists) were made of unequal lengths and the replica they used did not have this feature.(Their replica the thongs were of equal lengths).The reasoning for the uneven thong sizes apparently was so that the thongs or more precisely the dumbells would not tangle (Those romans could be maticulous).This feature would also cause one or two of the thongs (themselfs) to make direct contact on each blow, possibly leaving the welt type marks Faccini and Fanti are taking for a second type of whip. Thanks for reading, Ron.","date":"2011-07-29","mins":"12:53 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","title":"More on Flagrum Proportions and Measurements and Now the Side Strip"},{"id":"comment-3480","author":"ron","post":"Hey no problem Yannick, considering your native language is French you are doing an excellent job communicating here, probably better then I, LOL.Anyways I am not against any of your propositions here, I’m on the fence on alot of things about the Shroud (details and understanding the mechanism) not in it’s authenticy ofcourse.I’ve breezed quickly over your comments about the humidity vs.washing debate and although I’m not convinced on it, you have pointed out some very telling points and have made me rehash and re think alot.Which just means I’ll have to do some more reading and contemplating before I can debate this topic any further.As for your very last comment when it comes to the details of this amazing Shroud, nothing seems to be ‘simple’.I think we can agree on that. Oh almost forgot, several topics back you asked me about my credentials, and to answer; No I am not a scholar or a prof, I am a simple tradesman and hold cards in two different fields, but since an early age I have been interested in many fields including history, science, art and in particular since about the mid 80s the Shroud, when after I first saw it.Which I must say has taken much of my free reading time. Ron..","date":"2011-07-29","mins":"4:09 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","title":"More on Flagrum Proportions and Measurements and Now the Side Strip"},{"id":"comment-3453","author":"ron","post":"Also forgot to mention another thing; To earlier comments made by you Yannick on the discussions of multiple types of whips used or not.You couldn’t see the logic in the Romans using more then one type of whip.Here’s my thoughts to that and a possible answer; It is quite possible and logical a second type of instrument was used to flog Jesus as he was carrying his cross to Golgotha, maybe explaining why the alternate type of whip marks are basically found on the lower legs.It’s highly doubtful they would have used the Flagrum at that time. Thanks, Ron.","date":"2011-07-28","mins":"4:06 am","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","title":"More on Flagrum Proportions and Measurements and Now the Side Strip"},{"id":"comment-3367","author":"ron","post":"I don’t understand what the argument here is? It’s obviously to me the flagrum shown in the video by Fr.Ricci, was created with dimensions (dumbell spacing) used from what they found on the shroud.I doubt very much he ever meant to say the marks on the shroud were ‘identical in measurement’ but I took it has in ‘design’ of the particular instrument.No one could possibly make that precise a statement and I think that should be understood…or maybe by using common sense?.Anyways, I have found thru much reading on the topic of the scourging that it is now believed that more then one type of whip was used, that it has been studied and shown quite reasonably that there were approx 40 lashes from the flagrum (3 prongs), leaving approx 120 marks.Other types of scourge marks were found along the legs that do not have the dumbell contusions and approx 30 of these have been found, if my memory serves me correct.Obviously this is not exact as it would be quite difficult to measure any over lapping strokes and because of the lack of clarity of the image.Also many types of actual Roman whips have been found and apparently the exact type as shown by Fr.Ricci (The Flagrum), is one of them and in a museum somewhere.My point is I see nothing wrong in the representation by Fr.Ricci in this clip. Ron.","date":"2011-07-21","mins":"5:35 am","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical"},{"id":"comment-3435","author":"ron","post":"I guess if we go by Dr Jackson’s hypothesis of the body being securred using the re sewn strip along the side of the Shroud, then it would be possible that contact was made on all areas where scourge marks are shown, but there are problems, although minor, with his hypothesis.One being there should be blood on the side strip, or atleast traces of blood you would think (Which to this day no one can confirm, and I’ve asked).I contemplated the negative images and how the blood shows white also, and also how the scourge marks show the same, BUT as we do not understand the image mechanism, we can not simply assume that they had to have contact to give out a white appearance.The ‘backlight image’ is very telling in many ways and even if the scourge marks were very thin or sharp details, imho, just the multitude of all marks along with the dumbell marks bunched together should have shown up (as in blocking the light), it’s pretty clear.But it’s fruitless discussing these things, as we do not have access to high quality images or the expertise.It would be nice to have access to the recently taken High Definition photos though wouldn’t it? Ron.","date":"2011-07-26","mins":"11:01 pm","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical"},{"id":"comment-3420","author":"ron","post":"I have a problem with the theory that the scourge marks were blood contact images; For one, there are many scourge marks showing where there was no contact expected i.e; calfs, lower back, right adjacent to the hands on the upper thighs, you must take into consideration the body was in extreme rigor and not flat and tenting of the fabric over parts of the body, such as the hands.Two; In back light photos taken of the shroud the blood on the arms, head, feet and side show quite well but no scourge marks are present…Just my observations and 2 cents worth. Ron.","date":"2011-07-26","mins":"8:35 am","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical"},{"id":"comment-3684","author":"ron","post":"I totally agree with Barrie’s statements, I am no expert myself but have conversed with pro photographer friends and they have stated in their judgement, there is no possible way the Shroud is a photograph and a simple look at the image tells you that…Just look at the lighting! …There is alot of talk about emulsions, and it is plausible that a medieval guru could have made an emulsion that could have dissipated over time, but highly unlikely.One important ‘technical’ ‘ingredient for the ‘photograph theory’ has been left out of the conversation here and it is the ‘LENS’, lens technology in the time mentioned for the possible creation of the Shroud was in it’s infancy.It is very unlikely to nearly impossible, to believe an artist of that era had access to a highly focused type lens, that would be needed to create the very fine detail we see on the image of the Shroud..","date":"2011-08-24","mins":"12:55 pm","url":"https://shroudstory.com/2011/08/22/razor-swift-the-shroud-of-turin-is-real/","cat":"flagrum","title":"Razor Swift: The Shroud Of Turin Is Real!"},{"id":"comment-8374","author":"ron","post":"It may sound simplistic, but I always seemed to find a correlation of the two strands as a depiction of the two blood traces seen on the hair on the right of the natural image. Also considering that maybe depicting blood was not a pleasant thing to do, so they just painted the two blood traces has hair???…Maybe extreme conjecture on my part, but who knows? R.","date":"2012-02-16","mins":"7:14 pm","url":"https://shroudstory.com/2012/02/16/more-over-at-stephen-jones-blog-on-the-vignon-markings/","cat":"image_theory","title":"More over at Stephen Jones’ blog on the Vignon markings"},{"id":"comment-8276","author":"ron","post":"I see absolutely no problem considering one would easily expect most ‘viewers’ would not be allowed within several feet of the “portrait”. Unlike today where one cannot get within meters of the Shroud. So basically the image would ‘show’ quite reasonably to most. It has been mentioned in some ancient writings, in the discriptions of the image, as being faint or as being like the ‘secretion of sweat’ but always viewable. So any argument that the image has faded over time (to any considerable amount) is strickly conjecture. R.","date":"2012-02-15","mins":"7:04 am","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin"},{"id":"comment-3475","author":"ron","post":"Hi Maria, Nice to see you posting here, I have read many of your posts on other sites and commend you on your knowledge and your defence of the Shroud…I couldn’t presume to be able to help you out, but I am as you perplexed on what would cause these anomolies.I can only hypothesize that the Shroud was tied as Dr Jackson proposes, but that it may have been tied not so tight and only in a fashion so to wrap the body and not necessarily to hold the body in a position.Plus the body was in extreme rigor and strongly in the position of the cricifixion, except for the arms obviously as they would have to been forced into their crossed hand position.This loose wrapping would leave the shroud basically draped, and in parts hanging loosely for the most part.Hense we get contact images on some areas and non contact images on others of the scourges.As my deductions are different from Yannick’s as I believe not all scourge marks are from contact. Ron.","date":"2011-07-29","mins":"1:18 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","title":"More on Flagrum Proportions and Measurements and Now the Side Strip"}]
