[{"id":"comment-8924","author":"ron","post":"Max we went thru this whole “accurate meaning of the Greek verbs” thing several weeks ago. Your argument to me lacked any substance, atleast enough substance to advocate your “naturalistic ritualistic” hypothesis. That doesn’t mean I completely refute your hypothesis, but that it seems unlikely someone can come to those conclusions from the vague information we have or should I say lack of information given to us in scripture. I think everyone is aware of Jewish burial rituals/customs, not precisely 1st century customs though, but close. Whether or not they were completed or not is not evident, and which rituals were followed is not apparent either, seeing as they would be different depending on the situation of the death, eg; Was he washed or not? Was he wrapped in several cloths or just one shroud? Was he annointed or not? We can only speculate on the answers to these questions and that is the point I’ve been trying desperately to convey to you….But if we are to take the Shroud as being the true Shroud that covered the crucified body of Jesus, then we can deduce forensically from the evidence, (and only to a certain extent) what had actually occured…the evangelists were much too vague to come to any solid conclusions on the matter. R.","date":"2012-03-04","mins":"2:17 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture"},{"id":"comment-8969","author":"ron","post":"Max I think you are a little mixed up here. First of all I am Roman Catholic and Yes I agree Jackson’s hypothesis may be probable, and answers alot of questions, atleast better then most others, but I believe his hypothesis INCLUDES the Shroud being ‘bound’ with the side strip, not just loosely draped/layed over the body, but also not necessarily bound ‘tight’…get it?. If it was not bound how would certain image areas be explained in Jackson’s hypothesis? Areas such the back of the legs for instance, an 8+ centimeter distance? …You should really watch the videos at Shroudtv.com on this aspect of the Shroud to fully understand Jackson’s hypothesis. As for the ‘tightly’ adjective again, it was your interpretation of certain words that got me off, especially with your firm insistence your interpretation was the only true interpretation. I believe you are so insistant because with this interpretation it suits your personal image hypothesis. There is no evidence for this except your conjecture…understand now? R.","date":"2012-03-05","mins":"5:26 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture"},{"id":"comment-8956","author":"ron","post":"Max I’ve never claimed/stated that Yeshua’s body was loosely wrapped or argued it was not bound. My argument has always been against your interpretation of the scriptures, which bring you to your conclusions. As I’ve stated before I believe he was bound by the side strip, adding the ‘tightly’ is the adjective I do not agree with or find any evidence for that in scriptures, you may, but I don’t agree with your interpretations thats all. As I’ve also stated and I think most here would agree with me; descriptions of the burial in scriptures are far too wanting for anyone to come to such a ‘precise’ hypothesis of the “inner wet shroud with an outter shroud…Get what I’m saying Max?, I can’t say it any clearer. R.","date":"2012-03-05","mins":"12:57 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture"},{"id":"comment-8911","author":"ron","post":"Daveb said; “It has to be shown to be a fake by some kind of weight of evidence process, and so far that hasn’t been done” …exactly, and herein lies the main problem with most all skeptics/ opponents to the Shroud’s authenticity, …well said Daveb. There is also the hypocricy of these skeptics/ opponents to the Shroud’s authenticity, in claiming to be the ‘scientific’, ‘rational’ thinkers lol, …what a bunch of turds. As for Max’s statement above; How about a naturalistic/ritualistic bias Max. Until you can claim to understand all the secrets of nature and the universe, I think it would be prudent to not exclude a supposed ‘miraculous’ image formation completely! It has been claimed by far smarter people then I, that there may be a new understanding of physics hidden in the Shroud!….Remember we are still very young in the understanding of things, to claim or assume otherwise is just plain conceit and utter nonsense. R.","date":"2012-03-04","mins":"2:45 am","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture"},{"id":"comment-8970","author":"ron","post":"Simply Max, I don’t agree….So lets agree to disagree on this matter, shall we. R.","date":"2012-03-05","mins":"5:37 pm","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture"},{"id":"comment-8794","author":"ron","post":"I’ll side with Daveb of Wellington on the percentage of evidence, but I can understand completely Russ’s point. I’ve found, (in my personal experience) when mentioning the Shroud or attempting to spark up even the slightest conversation about it, most people will just cringe. Furthermore, even if asking them to just look at it as an historic or archaeological artifact, it is still like your going to pry teeth out of their heads lol…so I get what he’s saying and I think it’s a good approach. Would sure like to see Russ get up here to Toronto some day! I wouldn’t miss it, if he did. R.","date":"2012-02-28","mins":"7:25 am","url":"https://shroudstory.com/2012/02/26/a-rather-silly-blog-with-a-not-sol-silly-shroud-of-turin-lecture/","cat":"history","title":"A Rather Silly Blog with a not so silly Shroud of Turin Lecture"},{"id":"comment-14429","author":"ron","post":"Daveb, …Exactly! One must also make reference to (obviously) more then just(one)fold mark and specifically to the 4 distinct folds found below the navel area. Jackson’s hypothesis makes good sense of the “Man of Sorrows” or more precisely to the Byzantine “King of Glory” icons, which appeared around the 1200s, and to the lack of folds expected of the Image of Edessa configuration. Jackson et al’s hypothesis of such is more then just “conjecture” or “assumptions”, it derives from extended and INDEPTH study of the Shroud over decades. This extensive research is not simply “I think I see” science as claimed by Yannick…which I must say is a very weak argument from someone whom has had no more insight into the Shroud then anyone of us and far, far less then Mr Jackson. R.","date":"2012-08-02","mins":"6:30 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-14416","author":"ron","post":"Nope, takes me too Shroud Enigma also, which doesn’t have the segment from the full video in question..","date":"2012-08-02","mins":"9:05 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-15277","author":"ron","post":"Yannick did you read my post? Did you not understand the NOT washing of wounds from life blood? Areas such as the hands, side wound and feet would not be washed. Hense any and all traces that flowed from those areas either. The flagrum wounds are a different matter and the washing would explain the humidity (water vapour) needed for the wounds to exude!! Why is that so hard to understand? How also if there was no flowing blood do you explain the side wound traces shown to have flowed naturally to the back on the Shroud or flowed down at the feet? These flows could only have happened after the body had been placed SUPINE on the Shroud and as the Shroud was definately not used dual purpose; as in carrying the body to the tomb. Pease answer this question plus explain no dirt found on most of the image….. R.","date":"2012-08-20","mins":"12:51 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-15268","author":"ron","post":"I just wanted to add to my last statement that the going hypothesis by Wilson and Jackson which is only a hypothesis, and no one knows ‘for sure’, exactly how the Shroud may have been folded to achieve the Mandylion or Image of Edessa portrait, but, the main issue is that it would need to be folded ‘four times’ and ‘showing the face in a landscape portrait’ to conform to the ‘tetradiplon’ description and ‘Image of Edessa’ portrayed over the centuries. There are many folds on the Shroud, (if one views the raking light photos), and some of these folds may have been deminished from subsequent folds or stretching. It is not an easy task to find the correct folds but Jackson et al, have tirelessly experimented and tested many methods in pursuing an answer, and should be respected for doing so, and not dismissed so easily by arm chair scientists. R.","date":"2012-08-20","mins":"11:34 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-15264","author":"ron","post":"Max Patrick Hamon :Ron you wrote: “I mean folding the Shroud four times to achieve eight layers.” If so you have to translate tetradiplon as “folded in four [SUCCESSIVE FOLDINGS]” = “Folded four times [onto itself] (my translation). However this does imply a slightly different folding than those of Jackson and Wilson that BOTH only imply.THREE (and not four) SUCCESSIVE FOLDINGS. Correct Max. As I said earlier it soes not exactly conform to Wilson or Jackson’s fold hypothesis, as in the number and location of folds. There would be one fold unequal to the other three….Which after some thought, could explain why Jackson cannot find that one fold. R.","date":"2012-08-20","mins":"11:18 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-15281","author":"ron","post":"I didn`t mean you Max!, it was a general statement to those that oppose hypothesis with no prior knowledge or especially experience in a matter…(Yannick). And Yannick I agree with Max, the complacent acceptance of your papers by others has swelled your head and made you `closed minded and `stubborn`. The fact that Max and I agree, AND also have refutted most of your ÌDEAS` remember, certainly shows in a way that you are incorrect in your reasoning….Deal with it and answer question dealt to you… R.","date":"2012-08-20","mins":"1:10 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-15291","author":"ron","post":"Yannick Clément :Ron, first of all, you’re no more expert than me ! So, don’t use this argument please. There’s no need to be an expert to interpret the facts and observations correctly (or incorrectly). Secondly, my paper is good and I know it but I doesn’t changed my way of thinking and the way I can debate those who emit hypothesis which I disagree ! I’m the same Yannick before and after, you can be sure about that. I still seek only the truth versus the Shroud. I never said I was an expert Yannick, or that one had to be to interpret facts. Read my post again (slowly) if you have to. The point was you irresponsibly refute hypothesis on a regular basis and try to get people to join your side. I have myself refutted some hypothesis but I don’t close my mind to alternatives all the same, or do I insist others believe my thoughts are the right thoughts. I just state my position on the matter. Example I may say I don’t believe the Maillard hypothesis and give my reasons for such, but I will not make comments as Thats a “I think I see” hypothesis. Again in all our discussion here you have not answered ‘properly’ any of my questions…typical. Two, just so you understand; You stated Jackson’s fold hypothesis is just that, an hypothesis with no confirmation….Our is it any different then Roger’s Maillard hypothesis? It is just an hypohthesis and definately has not been confirmed…Again with the blinders. R.","date":"2012-08-20","mins":"4:02 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-15292","author":"ron","post":"Sorry typo error above; should read as; How is it any different from Roger’s hypothesis. R.","date":"2012-08-20","mins":"4:04 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-15300","author":"ron","post":"Yannick Clément :Serum stains around almost every scourge wounds come from the process called “clot retraction” and it is only possible to get this when the blood has completely dried for at least 20 minutes. This is not coherent with a washing of the scourge wounds and a deposit of the body in the Shroud right after that. Sorry, but this is the reality Ron. The scourge marks on the Shroud come from exudates of blood clots that were in a “clot” form for at least 20 minutes… But if you don’t want to believe this is true, what can I do about it ? See, that is what I mean about you being with ‘binders on’. The scourge wounds would have been dry for hours! The DABBING of them with a sponge, for one, would NOT make the wounds liquid, but, would add a slightly humid enviroment, which would be needed for the process to occur, as stated by Adler. It would take only minutes for the damping to dry. Furthermore, whom can state precisely that it would take a minimum of 20 minutes for the “clot retraction” to occur, seriously. Especially when one no one has a good idea of the conditions. R.","date":"2012-08-20","mins":"7:14 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-14547","author":"ron","post":"Yannick Clément :In order to be very clear, I’ll ask my question differently : A foldmark that is not visible to the naked eye, can it really be considered a foldmark ? Yannick you are simply mis informed, the foldmarks are completely viewable using simple ‘raking light’ as testified by many of the STURP members even way back in 1978, no x ray or anyother special light is required to view the many fold marks found on the Shroud. You may also want to read Wilson’s books to really understand where Wilson stands on Jackson’s fold hypothesis. This is not simply a “I think I see’ situation. Jackson et al have spent considerable time and researched this far better then most. For you to just come along and refute it as “I think I see” is simply being ignorant on your part. Can you produce any evidence that this hypothesis is nonsense, other then what you might think? As for your ‘courtroom’ scenario, I strongly suggest you are wrong. Jackson et al’s demonstration in the video is very strong ‘tangible’ evidence to his hypothesis and would not deminish in a courtroom. R.","date":"2012-08-06","mins":"4:35 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-15362","author":"ron","post":"Forget it Max…I for one, give up! Yannick has shown that he just doesn’t LISTEN! We have given plenty of reasons for the wash hypothesis being atleast ‘probable’, yet he dismisses or ignores our specific points. He doesn’t understand we have NO issue with Adler’s work and as a matter of fact we have given a logical proposition to the origin of the humidity needed in the process of the wounds/blood stains on the Shroud as mentioned by Adler. He has not answered MANY questions we put forward, (important questions to contemplate that is) such as Where is the dirt on the entire body image?…Logic states it should be covered in dirt, but it is not. We mention dabbing a wet sponge, he talks about vigorous wiping. He makes it seem like Dr. Zugibe could not possibly be right and is human so he can make mistakes, but refers to his demi god, Barbet, whom couldn’t possibly be wrong in anything he says or ‘thinks he sees on the shroud image’ but Yannick forgets Dr Zugibe has done thousands upon thousands of autopsies, is working with decades more advanced medical knowledge than Barbet, not to mention photoanalysis technology light years ahead the 1930s technology. But no, according to Yannick Barbet’s hypothesis must must be right! R.","date":"2012-08-22","mins":"10:47 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-15336","author":"ron","post":"I don’t know why I bother. But I’ll say it again, the main wounds would NOT have been washed! So no oozing from them, due to washing anyways!! More likely it was a dabbing with a sponge, not a wiping with a wet cloth that was done. Secondly, they had plenty of time, if you understand Jewish law pertaining to burials during the sabbath, which allowed plenty of time for the body to dry, atleast reasonably, but left damp enough to allow a rise in humidity within the shroud once wrapped. It would take only several minutes for the body to be almost completely dry. Finally, I believe, what you think may be “in all logic” is not logic at all…Contemplate that please. R.","date":"2012-08-21","mins":"10:01 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-14874","author":"ron","post":"Your ‘insistence’ that there is no physical or chemical difference between the face region and the rest of the cloth shows your simple lack of reason. Has anyone or was anyone looking for this difference, EVER whilst studying the relic first hand? Is there not several reasons one can “think of” that could deminish any difference, assuming ofcourse they was a difference. It would seem to me that you are making a huge ASSUMPTION that they should be a difference actually. Your argument on this point I find rediculous. R.","date":"2012-08-13","mins":"6:23 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-14871","author":"ron","post":"Again Yannick you show blinders too only what you want to see or ‘read’. Wilson mentions one fold that can be seen in ALL photos, he does not mention the fact or is he speaking of the multiple folds seen under ‘RAKING LIGHT”. W Hy is it I have to repeat myself here? Raking light photos! Also except for one fold not found at the chest level of the frontal image all folds can be determined, again you are misinformed. Furthermore Jacksons et al’s studies shown on the video about the ‘contraption’ possibly used in Constantinople gives a fairly good reason as to why that fold may have been rendered impossible to see at present, plus the burn marks and patches may have obscurred most of this folds markings. AND I”LL SAY your interpretation of court room evidence is NIL, as Jackson’s evidence is viewable, approachable and repeatable. I think a jury would side with his hypothesis. Yes Yannick I’ll continue to believe in tangible evidence and not your ‘thoughts’. I see no evidence, testible or otherwise for your Milliard reaction lol. R.","date":"2012-08-13","mins":"5:59 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-14975","author":"ron","post":"Obviously you are not aware that the video on Youtube is not the full video. Parts have been editted! Furthermore, if you were so knowledgeable on the Shroud, as you say and believe, wouldn’t you be aware that there were raking light photos taken in 1978, which show many folds and creases?…Still don’t believe me? ask our friend Barrie Schwortz. Dr. Jackson et al. Would have these photos plus many more in his possession, including the life size high definition replica you see in the video…Do you have anything like this to base your conclusions from?…I don’t think so… Your comment that you can’t see the fold marks on the replica in the video is just unbelievably childish, seriously! Think! How possibly would you expect to see them in that situation? Why do you not understand they can only be seen ‘properly’ in ‘raking light’ photos,;(For the third time), and not direct light as on the video basement scene? I think this falls into the “I can’t see it, so it must be false” category. Also, Why would Jackson make such a claim of the visible fold marks, if his claim was not true, when it could easily be checked by other Shroud scientists with access to the same photos? …Please use some sense. R.","date":"2012-08-15","mins":"6:11 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-14986","author":"ron","post":"Correction, tetradiplon could be interpeted as ‘doubled in four’ but it is more probable, in this context, as being used in the base form of ‘folded in four’..","date":"2012-08-15","mins":"10:12 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-14976","author":"ron","post":"Max, seriously, and you claim others are posting mis information? Where do you get even the vague notion that the word tetradiplon can in any way mean “four times longer then wide”?? The word Tetra/diplon, simply means four/folded, or when translated into english ‘folded in four’, nothing else, not even ‘doubled in four’, as so often stated. Just simply ‘folded in four’. You can argue with me all you want on this, but my daughter, whom happens to live in Greece and since childhood, as studied Ancient and Koine Greek for years. One look at the word and she stated simply what it meant, with no hesitation. I tend to favour her neutral opinion on the translation. R.","date":"2012-08-15","mins":"6:27 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-14993","author":"ron","post":"Yannick Clément :If you want to talk about the context Ron (which is the base of any good historical research and interpretation), you should start to consider the fact that this expression is used in the context where Jesus is alive and well, during his ministry, well before his Passion and his death, and where he’s been given a cloth to wash HIS FACE. Seriously, how in the world a context like that can be interpreted as some kind of a reference to a burial shroud of more than 4 meters long ? It’s ludicrous. There’s no other word to describe this biased interpretation made by Wilson and others “shroudies”… Yannick I have a feeling you have no clue to the context of the original mention of the tetradiplon or the meaning of the phrase in which it is stated. I really think you should re read that phrase and understand that the author truly meant to say. R.","date":"2012-08-15","mins":"11:15 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-15025","author":"ron","post":"Yannick ever think with the Acts of Thaddeus, the author was just reflecting his idea of how the image he saw could possibly get on the Shroud? Or trying to describe the image? It is not the only time the image has been described as possibly bodily fluid or (secreation) placed on the cloth..","date":"2012-08-15","mins":"4:51 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-14995","author":"ron","post":"Sorry typo error, last sentence should read as; I really think you should re read that phrase and understand WHAT the author truly meant to say. R.","date":"2012-08-15","mins":"11:30 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-14994","author":"ron","post":"Max Patrick Hamon :Philologically speaking or stricto sensu if you prefer, the Greek word tetradiplon, refer to a sindon/rakos: – either “doubled in four” – or “folded four times [onto itself]” = folded in four [onto itself] – and/or “4 x1″ = “four times longer than wide” I wrote “doubled in four” was not a natural translation and was even misleading (cannot you read my English?). The most likely/natural translations are “folded four times [onto itself]” or “folded in four [onto itself]“, I do agree. Too bad you (or you daughter) didn’t even notice the two phrases strictly does have the same meaning! However when referring to a cloth “four times longer than wide” as the Turin Shroud, the meaning “4 x 1″ JUST CANNOT be totally ruled out (not even by your daughter!) as it might well have been the way a weaver could then have referred to the long linen cloth. Max the main point was your “four times longer then wide” makes absolutely no sense or does it relate in any way to the word tetradiplon, so I don’t see how you think it cannot be ruled out! Oh and ‘doubled in four’ and ‘folded four times’ does not have the same meaning, it’s actually two distinct ways of folding. I wish I could illustrate it to you and convince you of it. R.","date":"2012-08-15","mins":"11:27 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-14411","author":"ron","post":"Dave try youtube. I guarantee you’ll be more successful ; ) I actually just purchased the DVD after viewing the inferior quality on above mentioned, the quality of the DVD is awesome, and the video covers alot of ground. Well worth the mula spent. R.","date":"2012-08-02","mins":"7:39 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-15037","author":"ron","post":"Max Patrick Hamon :Correction: Your daughter’s translation “folded in four” is OK but it implies ONLTY TWO or THREE successive foldings not FOUR…. Sorry Max, but you are in error. It would definately imply four folds, and in the Acts of Thaddeus we can refer “tetradiplon” to the “sindon” as stated within the context of the phrase. Also either method of folding would show “a central opening for the head”…, I have practiced both methods and I am completely confident in my statement, thank you…My daughter is most definately not in error here. R.","date":"2012-08-16","mins":"2:51 am","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-15127","author":"ron","post":"Exactly Max. Fold the cloth four times and yes you’ll have seven fold marks only, but you will have 8 layers of folds. My daughters translations may not correspond with Wilson’s or Dr Jackson’s proposals of eight fold marks but it is an “accurate translation” of the word tetradiplon, which in it’s basic form simply means fourfolded or fourdoubled. People can derive whatever they want from these terms, as can be seen. But if done so in this manner i.e; folded four times lengthwise (14+ ft) in the proper manner, it will represent the face of the image in a landscape fashion, as proposed the Image of Edessa or Mandylion showed. Doubled in four does not imply 8 fold marks but eight fold layers also..","date":"2012-08-17","mins":"12:38 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-15213","author":"ron","post":"Where do you get the idea Jackson’s hypothesis points to a loosely wrapped shroud? Have you watched the video? He demonstrates in the video quite clearly how he interprets the wrapping of the body, which includes wrapped and bound. It has already been established that they had plenty of time during the burial to accomplish this and other rituals. (Have you not studied the conclusions from the Sudarium of Oviedo studies?). I agree with Max here on most things except details such as whether the Shroud was bound ‘tightly’ or ‘sufficiently’ to hold the body and we seem to be talking along the same lines about when it comes to the folding. R.","date":"2012-08-19","mins":"12:10 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-15140","author":"ron","post":"Sorry Max, missed this post earlier. I mean folding the Shroud four times to achieve eight layers. Three equal folds, then followed by final fourth fold OF the previous three. Hense giving you a doubled in four with eight layers. Hope that is clear. R.","date":"2012-08-17","mins":"4:44 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-14546","author":"ron","post":"Thats what I meant. Thnaks anoxie.","date":"2012-08-06","mins":"4:00 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-15133","author":"ron","post":"Don’t bother Max, we went thru all this months ago with Yannick, his mind is set. Although I’d like him to point us to which STURP conclusion mentioned the body was dry or it was not washed. The fact the burial may have been done in haste although not that much in haste as it has been concluded they had atleast an hour to prepare the burial. Since Sudarium findings put them in the tomb by 6 6:15pm and sundown was approx 7:15 7:20pm. Furthermore there would be several people not just 2 or 3 helping in the burial. Yannick also ignores the off image blood which shows evidence the Shroud was ‘wrapped’. The only question should be; How tightly was it wrapped? R..","date":"2012-08-17","mins":"3:43 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-17429","author":"ron","post":"I have read something of the same Dave, in that a burial on the eve of a holy day, (sabbath, special sabbath etc;) the body must not be left hanging overnight. Anyone attending to the burial were given special leave of the law and time to atleast place the body in a preliminary state to a final burial, (i.e not a completed burial), even if it meant working INTO the sabbath. These person(s) attending to the burial would be deemed unclean for 7 days and would have to attend to ritual cleansing twice within the seven days to be deemed clean again. Hense they would be allowed to work passed sundown and partially into the night, into the sabbath, but in haste. (Babylonian Talmud, if memory serves me correct) R.","date":"2012-10-10","mins":"3:19 pm","url":"https://shroudstory.com/2012/10/10/article-series-on-burial-in-ancient-israel-concludes-with-burial-of-jesus/","cat":"history","title":"Article Series on Burial in Ancient Israel Concludes with Burial of Jesus"},{"id":"comment-15138","author":"ron","post":"Yannick Clément :The idea of the washing of the body IS contradict by the FACT that the bloodstains came not from complete blood in liquid form but from exudates of blood clots that were humid enough to leave a mirror imprint on the cloth. DID YOU READ MY PAPER MAX ??? THIS IS A PROVEN FACT FROM ADLER HIMSELF AND IT CONFIRMED THE HYPOTHESIS OF BARBET MADE IN THE 30 S !!! Zugibe was simply off track on that topic… He was not God for sure and can have made mistakes about the Shroud. His hypothesis of a (partial) washing is just one of them. Zugibe’s wash hypothesis cannot be simply disregarded as easily as you like Yannick, much more so if you follow Adler’s comments. Zugibe has explained quite well how a light, maybe hasty washing of the body could cause open wounds to bleed again, and would or could cause the humidity needed for the smaller wounds to exude liquid from the blood….Areas of the body could be missed when washing hastily, this you must realize also…So his hypothesis does not go against any findings by STURP…Also remember anyone can make mistakes, and that includes your Barbet or even Alder. R.","date":"2012-08-17","mins":"3:58 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-9290","author":"ron","post":"I get what your saying Annie, that is why I think one should really watch the film “The Real Face of Jesus’. Not only for the wonderful final portrait of Jesus at or near the end, but sometime earlier when Downing shows how they clear the banding and the herringbone weave from the image, I can’t remember what they called the procedure, but when the software ran it’s course and the image was cleared of most all interference, the face showed such a loving power. Although obvious the torture received and shown all over the image, the image of the face seems to show a serene and majestic look. Not one of a tortured victim, but one of accomplishment. R.","date":"2012-03-13","mins":"5:00 pm","url":"https://shroudstory.com/2012/03/13/banding-maybe-jesus-looked-different/","cat":"history","title":"Banding: Maybe Jesus Looked Different"},{"id":"comment-15821","author":"ron","post":"Max on this, I agree with you 100%! R.","date":"2012-09-03","mins":"11:47 pm","url":"https://shroudstory.com/2012/09/03/believing-is-seeing/","cat":"history","title":"Believing is Seeing?"},{"id":"comment-15822","author":"ron","post":"I have recently found some very interesting information about the coin images or possible coin images on the Shroud. I will post here more on the subject, once I’ve checked the facts from some sources. R.","date":"2012-09-03","mins":"11:51 pm","url":"https://shroudstory.com/2012/09/03/believing-is-seeing/","cat":"history","title":"Believing is Seeing?"},{"id":"comment-7923","author":"ron","post":"Yannick you keep forgetting that Wilson’s hypothesis is just that; ‘an hypothesis’ of what writings and evidence he has found. How many of these “other historians” that you mention have done the research Wilson has done? (I’d say none)…How many times has the Shroud and the Mandylion been mentioned in the same list?? and as I’ve pointed to you before in one case the person whom had made up the list may have NOT actually seen one or the other! That is extrapolation, you make! …Again your back to the no blood on the Mandylion,…so what? It is clear the head wounds (blood) is not very discernable when viewed naturally or to distinguise the colour differences, you should know this very well from Barbet’s observations. Especially considering this was back in a time where there was no electric light, just candle light in dark cathedrals….pretty easy to surmise the artists didn’t pick up on the blood stains….so a weak argument on your part. I understand what you are saying in the sense of actual strong evidence such as the Pray Codex etc; but alot of times evidence is not so clear cut and deductions’ must be made in the investication of history. R.","date":"2012-02-04","mins":"2:21 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","title":"Ben Wiech’s video about the Justinian coin from AD 692"},{"id":"comment-7922","author":"ron","post":"Have you considered Yannick, that the “Mandylion’ which was described so often was actually a copy of the real Shroud that was found in the gates of Edessa? That the ‘real’ Shroud was hidden for various reasons, but the Mandylion was created to have something to show the public? ….just speculation. The word “Tetradiplon” is of great importance here, maybe not a common word, but a very discriptive word of what was seen or known. It can’t be disregarded just because it was not used afterward….THAT would be “Ludicrous’…and I don’t know how much clearer a description could be then “folded in eight”!! How would you describe it? Another thing is IF the shroud was folded in eight and covered as described in many drawings; How would anyone know it was anybigger of a cloth?. Not everyone or actually very few would have access to the Mandylion…these things must be taken into account. You have not done so/…that is clear. R.","date":"2012-02-04","mins":"2:02 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","title":"Ben Wiech’s video about the Justinian coin from AD 692"},{"id":"comment-7925","author":"ron","post":"“Somewhat contradicts the depictions of the Pantocrator, coin images”!, Yannick that is ludicrous to the extreme! Your theory carries very little weight whatsoever. C’mon Yannick, You would assume along with the cross, lance etc; they brought the ‘Burial Cloth” of Jesus to Constantinople with absolutely no mention? No veneration whatsoever?…the most important finding of all items? I would think more in line that the cloth being what it was; a direct proof of Jesus’s ressurection (to those whom held it), and an item which Jewish law forbid, to have found it’s way out of Jerusalem quickly and quietly, that means in secret, hense no mention of the Shroud or it’s image in any early writings. Where it was brought no one knows for sure, but we can assert from early writings (maybe just stories but most stories are based on some truths), that it was taken to Eddessa or Antioch (another theory). But the fact remains the pantocrator depictions started in the mid 6th century, not earlier and not as late as when the other items were brought to Constantinople. R..","date":"2012-02-04","mins":"3:02 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","title":"Ben Wiech’s video about the Justinian coin from AD 692"},{"id":"comment-7969","author":"ron","post":"Art Science :Hi Yannick, Oh I’m more than willing to admit pure speculation but its always a good way to start (I’m a pure novice to Shroud studies but sometimes coming from a different background might reveal something…most probably that I’m an complete idiot, but who knows!). I did a very brief google search for ancient coins trying to find collars or lapels with that distinctive flex. Well the first thing that struck me was how rare a frontal portrait was on an ancient coin (rough estimate 1 in 200). I was looking for a double line collar with a flex. I only found one double line so far (google “ancient coins front portrait” near the bottom of the page). I agree with your assertion that an artist could quite easily create such a collar without seeing the shroud, but on viewing the coins I’ve seen on google so far, it mightn’t be so daft an idea to query whether this might have happened. I’ll just state again what I find peculiar about this collar is that inflection….artists will normally use an economy of means to indicate form (ie a simple arc would have sufficed, so why the flourish of an inflection particularly if you are doing double close lines where you have to be careful to keep lines roughly same distance apart in a wax original). Just an idea! Art Science I think both your observations are well warranted and your not alone in your observations. Many others have noticed these ‘clues’ and your theory that the artist’s may have confused the creases as such, is also very telling and a most probable assertion; (At the very least it makes sense), seeing as we know the image would be very faint and covered below that point. This we know as fact from the many paintings we have of the Mandylion. There is also the main ‘clue’ in that the Mandylion was of a ‘landscape’ design as opposed to the more typical ‘portrait’ setting, as would ‘always’ be used by artists of any era. R.","date":"2012-02-06","mins":"1:15 am","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","title":"Ben Wiech’s video about the Justinian coin from AD 692"},{"id":"comment-7989","author":"ron","post":"I can’t seem to be able to open that document you talk of Dave ; ( …Nevertheless the whole topic of “No blood on the Mandylion paintings” is a nonsensical argument, that needs no explaination…Do ANY of the Pantocrator paintings show any blood? …absolutely not, so why would it be expected to be on any Mandylion depictions?…again this argument is nonsensical and not based on any logic. R.","date":"2012-02-06","mins":"1:22 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","title":"Ben Wiech’s video about the Justinian coin from AD 692"},{"id":"comment-7897","author":"ron","post":"In my mind I think it’s ‘Highly’ probable that what we have in the coins and in the pantocrator very strong evidence that it was the Shroud that was found in Edessa in the 6th century. During or just prior to Justinian’s reign. Evidence as in the depictions of Christ almost immediately afterward changed to what we now see in the pantocrators and in the coins 100 years later during Justinan II’s reign. Justinian I was the one who ‘rebuilt’ Hagia Sophia (where Christ depictions changed overnight, immediatley after the Edessa discovery), and had St Catherine’s monastery built. He was known to have sent many gifts to St. Catherine’s, maybe including the Pantocrator. I suspect it would be highly likely Justinian dispatched artists to Edessa after learning of the recovery, to either paint many renderings or maybe a “Template” in which all artists could follow. This seems evident considering the multitude of congruence in later depictions and too the Shroud we see today. R.","date":"2012-02-03","mins":"6:38 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","title":"Ben Wiech’s video about the Justinian coin from AD 692"},{"id":"comment-7898","author":"ron","post":"Oh almost forgot, about the two slightly different looking coins; I’ve read somewhere where those two coins are different denominations and different sizes, and evidently may have been created by two different stampers or forgeries…explaining the differences, but still quite obviously created from some ‘Master’ template..","date":"2012-02-03","mins":"6:50 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","title":"Ben Wiech’s video about the Justinian coin from AD 692"},{"id":"comment-7921","author":"ron","post":"I think your thinking is a litlle more of speculation and/or extrapolation then anyother I’ve heard. There’s alot of “I think” in there Yannick! With very litlle to back it up. You should consider all the ancient sources yourself and not assume no one else has studied this topic in depth. Forget all the squabbling that may have gone on in the past just look at the time lines and the FACT that the pantocrators and coins match up to Shroud we have today almost to a ‘T’ atleast in a court of law it would be 100%. Then think when did these first appear? When did they find the Mandylion (shroud)? …With very little “extrapolation” I can put the two together. Also the renditions of the cloth are much too perfect in congruence to have been done in any other way then with direct view of the Shroud or of a template of the Shroud. R.","date":"2012-02-04","mins":"1:46 pm","url":"https://shroudstory.com/2012/02/03/ben-wiechs-video-about-the-justinian-coin-from-ad-692/","cat":"history","title":"Ben Wiech’s video about the Justinian coin from AD 692"},{"id":"comment-40254","author":"ron","post":"Dan; “Well, no, the authors of the Bible weren’t good and accurate historians.” There are a lot of Biblical scholars that would argue you on that point. It has been said that Luke is one of the best historians of antiquities by several scholars. The Gospel writers did not write their works as historical writings, but because of their accuracy in details of the time, have incidentally done so. So many details, such as names, places, people’s titles, geography etc. That it is ridiculous to assume the writings were fictional or inaccurate. R.","date":"2013-08-01","mins":"11:57 am","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","title":"Bible Archeology: The mystery continues"},{"id":"comment-7303","author":"ron","post":"Wonderful change! I like the cleanliness and the fact everything loads faster…Many thanks to Barrie for continuing the best site on the internet pertaining to the Shroud! Congradulations. Oh and after reading The History of Shroud.com, everyone please read Barrie’s Christmas 2011 Editorial response and under New Shroud papers and Articles a great new paper called; “A new detail observed on the Shroud of Turin”….fascinating find. Again thanks Barrie R.","date":"2012-01-21","mins":"12:06 pm","url":"https://shroudstory.com/2012/01/21/bravo-wonderful-facelift-of-shroud-com/","cat":"history","title":"Bravo! Wonderful Facelift of shroud.com"},{"id":"comment-7927","author":"ron","post":"I added my comments in the thread linked above, sorry I didn’t know this thread had started. Nevertheless I think Yannick needs to open his mind a bit, not settle on his own “speculations and extrapolations”, that he derives from his readings. R.","date":"2012-02-04","mins":"3:18 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","title":"Calling all history buffs: Interesting comments from Yannick Clément"},{"id":"comment-7948","author":"ron","post":"Sorry but the fold marks are ‘very important’ evidence here, you can’t just disregard them because it goes against your ideas. I don’t think I or Deuce have been ‘fooled’ by any hypothesis, thats your interpretation as you have closed your mind to what you have concluded, AND IT SHOWS IN YOUR REPEATED STATEMENTS. R.","date":"2012-02-05","mins":"3:21 am","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","title":"Calling all history buffs: Interesting comments from Yannick Clément"},{"id":"comment-7949","author":"ron","post":"I am not the one with a closed mind here and I definately do not need to meditate on anything. I have read several books and papers on the matter, probably much of the same as you and I can tell you clearly there is much speculation in your comments. Your insistence that there was several ‘lists’ written mentioning the two artifacts and by eye witnesses is just on extrapolation you make from your interpretation of your readings. Reason; Your assuming these list ‘takers’ actually saw the items mentioned! Or were truthful in their inventory plus they were not very discriptive of what they listed, especially when it came to cloths…Then there is your insistence on the Mandylion not having blood markings; I have covered this twice already for you but you have ignored my comments, the answer can be very simple; these people (back then) saw the Mandylion very rarely and when they did it would not be thru a camera lens (with deeper contrast), but from a distance or in a dark cathedral and looking at the ‘actual image’ which is so faint most cannot discern the blood markings from other markings, this last statement is common fact when the cloth is viewed in real life!!…even your idol Barbet mentioned this fact. I have shown here how BOTH of your points can and have been shot down in a couple of quick sentences, and not by just me but by scholars, yet you will stand fast that your thinking is the ‘right’ thinking and all others here are wrong, closed minded and full of “speculation and extrapolations” lol….okay! R.","date":"2012-02-05","mins":"3:41 am","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","title":"Calling all history buffs: Interesting comments from Yannick Clément"},{"id":"comment-7928","author":"ron","post":"Very good points Deuce, one that is of importance is the ‘folding marks’ found by Dr Jackson in his studies and prove this Shroud was folded (for some time) in the described “Tetradiplon” fashion. R.","date":"2012-02-04","mins":"3:26 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","title":"Calling all history buffs: Interesting comments from Yannick Clément"},{"id":"comment-7930","author":"ron","post":"Actually I don’t think it was Dr. Jackson that first noticed the fold marks, but he and his team have thru further study shown strong evidence to these fold marks and their longevity. R.","date":"2012-02-04","mins":"3:30 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","title":"Calling all history buffs: Interesting comments from Yannick Clément"},{"id":"comment-8031","author":"ron","post":"I’ve read this paper before, but I can’t remember where I did. Very interesting read nontheless. It may be available at shroud.com for download also…I think ; ) R.","date":"2012-02-07","mins":"4:16 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","title":"Calling all history buffs: Interesting comments from Yannick Clément"},{"id":"comment-8006","author":"ron","post":"Thanks Daveb.","date":"2012-02-06","mins":"6:14 pm","url":"https://shroudstory.com/2012/02/04/calling-all-history-buffs-interesting-comments-from-yannick-clment/","cat":"history","title":"Calling all history buffs: Interesting comments from Yannick Clément"},{"id":"comment-40694","author":"ron","post":"I’m afraid David, that Yannick has the stronger point here. It is well understood that the Gnostics believed Jesus was immaterial, … not flesh. How would or could an image on cloth then be relevant to the Gnostics? One would think it would go to show against their beliefs Anyways to believe the Gnostics had some ‘lost’ method of producing the image, would assume a series of pretty huge coincidences, seeing as much of what has been found about the image, was not possible till just recently, technologically speaking. R.","date":"2013-08-07","mins":"4:32 pm","url":"https://shroudstory.com/2013/08/07/comment-the-real-history-is-nothing-like-what-christians-believe/","cat":"history","title":"Comment:  The real history is nothing like what Christians believe . . ."},{"id":"comment-40705","author":"ron","post":"Yannick Clément : Even if I agree with the first part of your answer Ron, I disagree with the rest because it is truly possible that the image (and the bloodstains as well) can have been formed on the cloth because of a totally natural process (or processes). So, if this would be true, we could still make the hypothesis of a natural forgery, meaning that someone could have taken the real dead body of a crucified man looking like Jesus of the Gospel in order to produce a false relic of Christ. Even if such a scenario is very improbable (personally, I estimate the probability as being under 1%), it is still POSSIBLE and no one have the right to completely reject this hypothesis for the moment. The door must be left open for it, even though it is only a very slim opening! Obviously you have no clue what I meant in the second part of my comment. If the Gnostics had managed somehow to produce this message by some natural means, it raises questions as to what we can see ‘of ‘ the image and see only through our modern technology…Many things which could not have been seen even by those whom supposedly created it..","date":"2013-08-07","mins":"5:07 pm","url":"https://shroudstory.com/2013/08/07/comment-the-real-history-is-nothing-like-what-christians-believe/","cat":"history","title":"Comment:  The real history is nothing like what Christians believe . . ."},{"id":"comment-40707","author":"ron","post":"Typo; “If the Gnostics has managed somehow to produce this IMAGE”….sorry..","date":"2013-08-07","mins":"5:10 pm","url":"https://shroudstory.com/2013/08/07/comment-the-real-history-is-nothing-like-what-christians-believe/","cat":"history","title":"Comment:  The real history is nothing like what Christians believe . . ."},{"id":"comment-25428","author":"ron","post":"Was the reliquary made of pure silver, or was it a hardwood box lined with silver? Does anyone know for sure? I would think that if the heat from the fire reached temps high enough (900 C) to melt the silver (lining) of the reliquary, then ‘internally’, the reliquary temperature would be very close indeed….I would suggest it was a miracle the Shroud was not completely destroyed ; ) R.","date":"2013-02-23","mins":"4:02 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","title":"David Rolfe we need you"},{"id":"comment-17419","author":"ron","post":"That is the most likely of reasons, one would suspect, or perhaps, Jesus simply asked them to collect them and to keep them safe and secure for posterity..","date":"2012-10-10","mins":"12:36 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-17298","author":"ron","post":"Well I think you may be mistaken, as I believe, when you state/claim ‘sindonology’ is a heresy, and in saying so, you are basically stating sindonologists themselfs are in the act heresy or of a sin, (which I cannot begin to understand how this can possibly be true), hense my quotes and their relevance. As to you to stating; “I’m not even going to go into the fact that persecutions did not happen *throughout* the early centuries.”; I suggest you reevaluate that statement and consider doing some more research into the early centuries. As to your last questions; I am quite sure much has been lost, take Edessa for example; almost everything has been lost or destroyed from the early centuries, some ‘things’ just coming to light recently, but to answer how finding any new ‘presumed lost secrets’ would change how Christianity would look today, would be PURE conjecture. I also believe that you err in your presumption that any new findings would or could ‘change’ how we view Christianity. Who is to say any new findings might not strengthen our present views? R.","date":"2012-10-07","mins":"3:59 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-17316","author":"ron","post":"Seems DA also forgets that the Sudarium Christi was also hidden in a well for 50+ years in the mountains of northern Spain! Maybe not forgotten, but reminiscent of a strange hiding place i.e; the arch of a large entrance gate, where the Shroud purportedly stayed for several centuries…and hidden by Christians nonetheless. R.","date":"2012-10-07","mins":"7:10 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-17501","author":"ron","post":"Well stated again Dave, and I second your descriptive statements to Dr Asslanoviki’s character. R.","date":"2012-10-11","mins":"1:08 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-17291","author":"ron","post":"Davor A; “It’s not my fault that you are unwilling to read the whole thing, or that Dan happens to think that the ‘heresy’ part is more important than this part:” …To your heresy part, I answer to you with this Jesus quote; “Do not judge, or you too will be judged, for in the same way as you judge others, yet you will be judged, and with the measure you use, it will be measured to you” – Matt 7:1 2 Also; “Why do you look at the speck of sawdust in your brothers eye, and pay no attention to the ‘plank’ in your own eye” Matt 7:3 As to your second part; ‘(…) first Christians thought so very little of this cloth that bore not only the image of their Lord but His most sacred BLOOD that they let it slip out of memory.’ …I quote Jesus again; “Do not give to the dogs what is sacred, do not throw your pearls to the pigs, they may trample them under their feet, and then turn and tear you to pieces” Matt 7:6 With that said, and the fact you claim to be an historian, mind you I understand simply an art historian; I still for the life of me cannot understand that you cannot place yourself in the shoes of the first Christians and the conditions or environments in that they must have endured? They were being persecuted! Tortured and killed! Anything to do with the faith was being destroyed by the pagen rulers who would endlessly conquer throughout the early centuries! With that in mind; How hard is it to contemplate that ‘Important’ relics such as the Shroud, were being hidden ‘securely’ and their location(s) ‘secretly’ guarded and ‘known’ only to the very few? This ‘secret’ again guarded and carried down generations, as well as humanly possible, but with the onslaught of invasions and persecutions, the likelyhood, being highly probable, those few with knowledge of the secret, simply being killed and the secret lost along with them? …Better to die in silence, then to give these pearls to the dogs… But I quess since I have no academic credentials or relevant training in the disciplines, I may just be blowing alot of hot air here. R.","date":"2012-10-07","mins":"1:39 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-17094","author":"ron","post":"I also think it is quite clear who would ‘benefit’ from the decision to eliminate any alternative testing… The AMS labs ofcourse; New to the scene, in desperate need of funding, and already established as not as precise a method as other methods of testing, (presently existing in their time). Substantial pre testing of the AMS system was performed in the early to mid 80’s and many ‘shortcomings’ from these preliminary tests arose…Especially hugely erroneous and widespread datings and with no conclusions as to thier cause!!…yet the decision was made to scrap all other relevant testing and go exclusively with the AMS testing system…(?) I have heard it expressed many, many times by scientists, archaeologists, scholars etc; etc; “If one has results of 99 tests which are in favour of authenticity, and only one which is not, one would not throw out the 99 and accept the one, but examine the one which is not in favour, to determine the possibility of error.” …Does this not describe the situation ‘precisely’ in the case of the Shroud? Ten years of extensive scientific study was thrown out in favour of a single unproven, erroneous carbon dating testing method! …I find myself slightly amazed that the Vatican and/or the Turin Archdiocese could have fallen into this trap, they are not idiots, yet they agreed to eliminate any STURP proposed testing (which I believe would have found almost unanimously the c14 dating at question), but futhermore, eliminated all pre set protocols for the actual c14 procedure. Leaving us in the present position of limbo when it comes to the authenticity of this Shroud….Unbelievable! Unfortunatley Daveb, I must disagree that it has back fired on them, as 24 years later, many people still believe that c14 is infallible and has proven the Shroud a fake, and this ‘unbelievably’ includes some of the upper scientific community. R.","date":"2012-09-30","mins":"8:55 pm","url":"https://shroudstory.com/2012/09/30/fascinating-account-of-a-2800-year-old-cloth/","cat":"history","title":"Fascinating Account of a 2800 Year-old Cloth"},{"id":"comment-17170","author":"ron","post":"Dave, I’m not speaking of c14 testing, I can clearly understand the reluctance to issue another radiocarbon test, and for several reasons. Mind you I find the Turin Archdiocese or whomever was reponsible for handling the whole thing back in 1988, equally at fault, they had the final decision in the matter! Am I not correct in this statement?…But, I am speaking of the proposed STRPII tests, which were never done in 1988 but dropped and which should have accompanied or precluded the c14 testing. There is no reason these tests cannot go forward, but ofcourse with much better control and tracking of any evidence or material. I have stated my belief that it is not the time for another c14 as yet, but many other non destructive testing can and should be done, the Vatican’s reluctance to do these is to me the mystery. BTW Merinelli’s paper brings really nothing new to the story, most all issues mentioned in this paper have been researched from many other papers and books written. But still a good paper for those who have not studied the issues before. R.","date":"2012-10-02","mins":"5:37 pm","url":"https://shroudstory.com/2012/09/30/fascinating-account-of-a-2800-year-old-cloth/","cat":"history","title":"Fascinating Account of a 2800 Year-old Cloth"},{"id":"comment-17109","author":"ron","post":"Gabriel thats true, and they are completely wrong in their thinking. What they should be asking, is for the ‘proposed testing’ made by STURP in 1988, or the so called STRPII, basically non destructive testing. But of course updated to more modern procedures and newly available testing methods. Until the problem of ‘contamination’ can be solved, a new radiocarbon dating should be placed on the back burner. Hopefully within our lifetime, a much better method of dating will be found. I cannot for the life of me understand the Vatican’s reluctance in allowing further testing in this manner, excluding c14 of course. What could possibly be the reasoning? Unless of course they like the fact millions still believe the Shroud is a fake and millions more do not even know it exists. R.","date":"2012-10-01","mins":"3:59 am","url":"https://shroudstory.com/2012/09/30/fascinating-account-of-a-2800-year-old-cloth/","cat":"history","title":"Fascinating Account of a 2800 Year-old Cloth"},{"id":"comment-17182","author":"ron","post":"You may be right Dave, but here’s the thing; From thier ‘restoration’ of the Shroud in 2002, they have basically everything that is needed to run a series of tests! As apparently, they vacuumed the complete Shroud, removed all charred areas (and most likely abit of uncharred threads most likely) and they have allowed ‘certain’ people minimal access to the Shroud for their own study purposes. Now with that in mind and them knowing quite well there was no scrupulous dealings from the actual STURP crew, and also they are very aware that refined scientific tests are available now, where the Shroud does not even have to be touched to get an extreme amount of information from it..Also, they should be aware, that they themselfs were partly at fault and had made some very seriously bad decisions back then, which led to all the issues. Have they not learned from their mistakes? Do they not have the means to put together a team of scientists and protocols to finally put an end to some questions here? Questions such as to the pollen or the arogonite dirt, or to the chromophore etc; I think it’s time these questions were answered. But thats just me ; ) R.","date":"2012-10-03","mins":"6:24 am","url":"https://shroudstory.com/2012/09/30/fascinating-account-of-a-2800-year-old-cloth/","cat":"history","title":"Fascinating Account of a 2800 Year-old Cloth"},{"id":"comment-16756","author":"ron","post":"Chris B :He is fully God and man. If he had a wife, then what need was there for him to be born of a virgin, whom we are told was free from original sin? It is heresy and attempts to deny the Son of God his rightful place. It shouldn’t be overlooked but condemned. Agreed! R.","date":"2012-09-22","mins":"3:22 pm","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","title":"Hot New Topic: The Wife of Jesus"},{"id":"comment-3362","author":"ron","post":"+1 to Sean Cheng’s questions, very interested in the dating of these. Thanks Ron..","date":"2011-07-20","mins":"9:35 am","url":"https://shroudstory.com/2011/03/28/herringbone-weave-within-stavronikita-epitaphios/","cat":"history","title":"Herringbone Weave within Stavronikita Epitaphios"},{"id":"comment-44221","author":"ron","post":"All I’ll say is; ‘It’s about time, Dan’, and I second Louis’s first comment; “This is a good approach and will help to improve the blog, but it should go hand in hand with the prohibition of personal attacks and mean insinuations.” (Although I am not myself completely innocent of doing the same, I try to keep it lite, and it is done usually in feeble attempts at humour.) R.","date":"2013-09-14","mins":"3:41 pm","url":"https://shroudstory.com/2013/09/14/intellectual-dishonesty-in-shroud-of-turin-research/","cat":"history","title":"Intellectual Dishonesty in Shroud of Turin Research"},{"id":"comment-12687","author":"ron","post":"Don’t bother Yannick, it’s obvious Colin has his sciencebod ‘nonscientific’ binders on. The fact he would even try to compare the two ‘completely different situations’ proves it. It actually is well known that materials such as cloth, linen etc; are known to be very difficult to carbon date, usually giving erroneous results. Plus the facts mentioned that the Shroud’s contamination history is not fully known, has been handled for millenia, burnt etc; escapes scienbod’s mind. One must also question the absolutely unconventional process of the 1988 carbon dating and the total lack of procedures and protocols followed, and furthermore the many questions raised by the non peer reviewed Nature paper. Considering Colin’s continuously cuttin up of other’s scientific work I have no issue in pointing out his very non scientific stance on this issue. If he is a true scientist he would agree the c14 dating done in 1988 was flawed and should be nullified till further tests can be done. R.","date":"2012-06-18","mins":"5:57 pm","url":"https://shroudstory.com/2012/06/17/john-the-baptist-relics/","cat":"history","title":"John the Baptist Relics?"},{"id":"comment-5045","author":"ron","post":"I can’t answer your question as it’s a good one but, I know they hold an International conference atleast once a year in different locals. Sometimes more then one. Anyways it would be awesome to be able to attend one of these, as I enjoy listening to many of the speakers that are listed. I would assume Barrie Schwortz will probably cover this conference quite well on his site, atleast I would hope so. Ron..","date":"2011-11-27","mins":"7:14 pm","url":"https://shroudstory.com/2011/11/24/international-conference-on-the-shroud-of-turin-in-valencia-next-april/","cat":"history","title":"International Conference on The Shroud of Turin in Valencia Next April"},{"id":"comment-17452","author":"ron","post":"Max Patrick Hamon :Then you can even rather clearly notice even accidental characteristics copied by the Comotilla catacombs fresco’s painter. Max, I admit, I see these ‘characteristics’ and quite clearly actually, and also possibly another face mixed in, one looking of an even younger child. It is quite eerie as Dave as described. But I question whether they can be seen on the natural Shroud itself? I’ve studied the Enrie photo you mentioned closely and can’t see it. But I await your revision. R.","date":"2012-10-10","mins":"8:14 pm","url":"https://shroudstory.com/2012/10/10/max-patrick-hamon-replies-to-charles-freeman/","cat":"history","title":"Max Patrick Hamon replies to Charles Freeman"},{"id":"comment-9382","author":"ron","post":"I don’t know about anyone else, but ” I see lettering” on the right side of the image face, starting from the step 1 picture and progressively gets more prominent. From step 1, I can see the letter E, maybe a C. By step two 2nd picture; epsilon, C and E are quite prominent. Maybe Fraile was onto something here, but a little off track? It would seem to me that if these markings are really there they are too flat to have been created during the formation of the body/face image, maybe somehow imprinted afterwards? …just simple conjecture. But no one can tell me those markings are not there, but they may just look like lettering and just be a remnant of banding etc; But as for the supposed banding along both sides of the face, I never agreed with this being caused by banding but moreso a remnant of the actual image formation, as in the fact the side imgaes are not present on the whole Shroud image, this can be the same, seeing as the cloth would have been laying more on a vertical axis across the sides of the face at this point, hense no image created? R.","date":"2012-03-16","mins":"4:57 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”"},{"id":"comment-9451","author":"ron","post":"My “idea” of what conspired, and from much of my readings, formulates pretty well with what Max as stated on what occured after Jesus died. The time of 2 2.5 hours fits in well with what has been deduced from research and findings from the Sudarium of Oviedo. These findings being; The Sudarium was placed upon the head of Jesus ‘shortly’ after death, whilst still on the cross. An hour or so later the body was removed from the cross and layed partially face down at the foot of the cross and stayed for approximately another 45 minutes, then the Sudarium was properly wrapped completely around the head of Jesus and the body was moved to the tomb, approximately another 10 minutes, where it was then apparently removed. This gives us a time of 2 to possibly 2.5 hours between death and tomb, if then we accept the time of death between 3 3:30 pm, that puts us in the tomb approximately at 5 to 6pm. Giving a minimum of one hour in the least of scenarios and 2.5+ hours for the max time for the burial preparations… As for Max’s wrapping hypothesis, I have problems with it, some I have mentioned before. I just find it unlikely they would have wrapped the body twice using two different clothes and if the first cloth had been soaked with water & spices or whatever had been placed on it, there should be chemical signs of this still noticeable today, which so far have not been found, to my knowledge. If one wants to use the term othonias as plural, one must accept there MAY HAVE been other cloths there also, as most likely there could have been another large cloth used to transport Jesus from the cross to the tomb, but would have not been used in the wrapping, as it would have been “unclean”. As for the ‘dust’ storm idea, (the darkening of the sky), although it sounds reasonable at first, one must wonder; If this storm was a regular occurence, regularly witnessed and even possibly given a name at the time, why such a mystical attitude given to it in scriptures?? Something definately “UNUSUAL” and not to the ‘NORM’ must have occured instead. That is my simple reasoning against the Sharav or Khamsin hypothesis. Why didn’t they just call it for what is was; a dust storm, the Sharav the Khasmin? Instead they just say the whole ‘SKY’ was darkened. Ron.","date":"2012-03-19","mins":"4:21 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”"},{"id":"comment-9480","author":"ron","post":"Also, Joseph of Arimathea being who he was would no doubt be aware of this ‘stipulation’ in the law, as would also the sanhedrin. I realize this statement may bring alot of rebuttal as scriptures mention the burial was done in haste, but like many things it is just a ‘thought’ which can possibly add some insite to the complexity of this topic….Maybe the burial was not done in such haste? R.","date":"2012-03-20","mins":"3:57 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”"},{"id":"comment-9458","author":"ron","post":"Dave don’t misunderstand me here, I believe there is “ample” evidence that the Shroud was wrapped. The Shroud would have been layed down, body placed in position then the Shroud folded over the head and layed over the front/top of the body to the feet.Then the sides may have been tucked in and folded over onto the body; (There is evidence for this on the Shroud). This is then where the linen strip or strips come into play and were used to tie about the body therefore holding the shroud and body in position. I just don’t agree with Max’s double wrapping theory, with a moist first wrapping, thats all. The fact there is no side images is a conundrum for sure, even if the shroud was just draped, and one issue that has stumped everyone basically, except maybe those that believe the image is the work of a forger. R.","date":"2012-03-20","mins":"12:26 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”"},{"id":"comment-9482","author":"ron","post":"Yannick Clément :If you look carefully at the Shroud Ron, you’ll notice pretty easily that the burial was most probably done in haste, just like it is said in the gospels… There you go again Yannick, assuming I haven’t looked at the Shroud carefully? and you are somehow more an expert then I? Sorry but I don’t see “pretty easy” evidence that the body was “most probably” buried in haste. Actually there are signs that it wasn’t, you can refute this as you have but it doesn’t change the matter….Just don’t assume you may have a better understanding of what IS shown by the Shroud. Ron.","date":"2012-03-20","mins":"5:24 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”"},{"id":"comment-36313","author":"ron","post":"I had no problem with part II downloading completely. Maybe try it again Dave. I too find the illustrations beautiful but moreso the sculptured ivory, just wonderful. Your mentioning of the C14 and it’s issues with testing fabrics/textiles is what I have been trying to get across here for months. I have done some extensive reading on the issue and from what I have understood, testing of the Shroud material would be a nightmare to C14 technicians, due to it’s ‘extreme’ contamination. Unless and until science can find a way to get around all that contamination, another testing would be fruitless IMHO, and a fairly good reason (on its’ own), not to accept the 1988 results. R.","date":"2013-06-06","mins":"2:52 pm","url":"https://shroudstory.com/2013/06/05/paper-chase-two-new-history-papers-by-pam-moon/","cat":"history","title":"Paper Chase:  Two New History Papers by Pam Moon"},{"id":"comment-9705","author":"ron","post":"Hi Dan, Thanks for posting the link to the Paper by Dreisbach. I do have a copy on my computer and again tried to send it to you by email, alas it kicked it back. I am not able to email you on either email accounts…Maybe inadvertently I was placed on your block list?…I am diagnosing things on my side though also. Thanks Ron.","date":"2012-03-27","mins":"5:23 pm","url":"https://shroudstory.com/2012/03/27/paper-chase-lazarus-jesus-by-kim-dreisbach/","cat":"history","title":"Paper Chase:  “Lazarus & Jesus . . . “ by Kim Dreisbach"},{"id":"comment-9490","author":"ron","post":"Dan :I have no idea. And I have no idea what you are talking about regarding held comments. Hi Dan and Colin, that was my post, as I clicked the post comment button a whole bunch of letters popped up and next thing I know it shows colinsberry R lol, …I tried emailling Dan but it kept coming back an error, the emails would not go thru. Anyways I had to go to work and forgot to post the issue here, …sorry! I think there may be a glitch somewhere. Ron.","date":"2012-03-21","mins":"6:23 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”"},{"id":"comment-9911","author":"ron","post":"Soooo, did anyone read this paper? What do you think about the two angels in the tomb, one at the head and one at the foot? A spy clue to the Shroud? ….I think so. Ron.","date":"2012-04-03","mins":"8:10 am","url":"https://shroudstory.com/2012/03/27/paper-chase-lazarus-jesus-by-kim-dreisbach/","cat":"history","title":"Paper Chase:  “Lazarus & Jesus . . . “ by Kim Dreisbach"},{"id":"comment-13993","author":"ron","post":"Thats your interpretation of what lies above the sindon Max. I interpret it differently, as in it being the bundled strips, which bound the Shroud to the body…It is all speculation though in either case. R.","date":"2012-07-19","mins":"5:10 pm","url":"https://shroudstory.com/2012/07/17/paper-chase-all-sorts-of-papers/","cat":"history","title":"Paper Chase: All sorts of papers"},{"id":"comment-13992","author":"ron","post":"Very well said Dave B, I agree with most all you state, but especially with your last paragraph. Thanks, R.","date":"2012-07-19","mins":"5:03 pm","url":"https://shroudstory.com/2012/07/17/paper-chase-all-sorts-of-papers/","cat":"history","title":"Paper Chase: All sorts of papers"},{"id":"comment-14007","author":"ron","post":"Max Patrick Hamon :Actually, basing the deciphering on the Byzantine iconography of the Empty Tomb, it just cannot be the bundled strips. The only alternative left to the mandylion as small face cloth is the (transparent) skullcap (now kept in Cahors). Max, How can you say for certain it cannot be the bundled strip(s)? Do you believe the side strip we see on the Shroud was not apparent when the Shroud was in Constantinople? Do you not believe the side strip would have raised much question or speculation even then, as to it’s purpose? R.","date":"2012-07-20","mins":"4:45 am","url":"https://shroudstory.com/2012/07/17/paper-chase-all-sorts-of-papers/","cat":"history","title":"Paper Chase: All sorts of papers"},{"id":"comment-13941","author":"ron","post":"I’m glad you pointed that particular paper out Daveb, I had intended to do so also and I agree it is a very effective response. Wilson1.pdf deals very well with several issues raised against the Shroud/Mandylion/Edessa hypothesis, such as the imprint being described as being from a “living Christ” or of the eyes being seen as “open” and specifically the blood. To the blood statement he mentions “if in good light” one may discern the blood markings. This is a point I tried to put forth before but was shunned. Wilson has seen the Shroud first hand, up close in semi darkness and in good light and with no glass covering. He would know FAR better then most what is discernable and what is not, most definately. It is probable early discriptions of the Mandylion (of just the face), that one could come to the conclusion as Wilson predicts…Wilson is not alone in this area as it has been mentioned by many others, such as Pierre Barbet, whom have had the liberty to view the Shroud in it’s natural form, that it is very difficult to discern details such as the eyes, the blood etc; but especially the blood as it becomes pronounced only slightly in ‘good light’. I believe this is a strong point one must consider and also strengthens Wilson’s Mandylion/Edessa cloth/ Shroud hypothesis. R.","date":"2012-07-18","mins":"3:55 am","url":"https://shroudstory.com/2012/07/17/paper-chase-all-sorts-of-papers/","cat":"history","title":"Paper Chase: All sorts of papers"},{"id":"comment-14027","author":"ron","post":"You didn’t answer any of my questions Max. I simply like to know how you can be so certain the bundled cloth is NOT linen strips…What other Byzantine art showed or didn’t show has no relevance in this argument as one must deduce that the artist of the PM must have had direct or secondary experience with the Shroud due to several points already established and almost certainly others didn’t. I’m not saying for sure it is bundled strips or that it is not the Sudarium, as I mentioned before it is all speculation. R.","date":"2012-07-20","mins":"1:24 pm","url":"https://shroudstory.com/2012/07/17/paper-chase-all-sorts-of-papers/","cat":"history","title":"Paper Chase: All sorts of papers"},{"id":"comment-14058","author":"ron","post":"Max Patrick Hamon : To see bundled strips is PURE speculation in the light of ALL 11th 12th & 13th C. CE Byzantine & Latin Empty Tomb iconography. Iconologically speaking, to recognize a head dress type in the small cloth folded into a “circleted (half transparent?) veil lying above/atop the burial sheet is the most likely. Again see Grimaldi 17th C. CE copy of the second mid 12th early 13th century CE “Umbella” Empty Tomb scene. Again you haven’t answered all my questions! and again I must stress Byzantine art of the 11 Th, 12 Th or 13 Th centuries have no baring whatsoever in this discussion. It is an assumption on your part that it does or can be connected to the PM, it being a simple ink drawing, drawn by an obscure monk in a obscure monastery and prior to most all other depictions. R.","date":"2012-07-21","mins":"3:34 pm","url":"https://shroudstory.com/2012/07/17/paper-chase-all-sorts-of-papers/","cat":"history","title":"Paper Chase: All sorts of papers"},{"id":"comment-14059","author":"ron","post":"Yannick Clément : Ron, the simple fact that you didn’t even look at my 22 arguments against Wilson’s hypothesis prove my point of the other day that you should look at yourself in a mirror before accusing me of being close minded ! ; ) Here in Quebec, I’m sure you know how we call the English Canadians (particularly the Ontarians)… Square heads ! LOL ! Please, don’t take my last joke too seriously… I just a joke. From a proud “Frog” from Louiseville, Québec !!! P.S. : I think Wilson would have a very hard time to give a rational and strong answer to many of my arguments… But nevertheless, I know very well that when you have a great imagination (like Wilson), you can always find a way to redirect things in the way you want !!! I’m not closing my mind! I am most certainly aware of WHAT your 22 points most likely are. As they have probably been repeated way too many times on here on many of your previous long winded comments!….Most of them ‘properly’ rebuked, yet simply ignored on your part, as mentioned by Max, myself and others also. So I see no reason to read your paper. R.","date":"2012-07-21","mins":"3:42 pm","url":"https://shroudstory.com/2012/07/17/paper-chase-all-sorts-of-papers/","cat":"history","title":"Paper Chase: All sorts of papers"},{"id":"comment-14069","author":"ron","post":"Selservingly? I can say precisely the same for you Max! except I admit I’m being speculative…Funny how you think your wasting your time, but still, will not answer my questions nor can you explain how your Byzantine Iconography can reflect on the Pray Codex whatsoever…..speculative thinking maybe? R.","date":"2012-07-21","mins":"6:24 pm","url":"https://shroudstory.com/2012/07/17/paper-chase-all-sorts-of-papers/","cat":"history","title":"Paper Chase: All sorts of papers"},{"id":"comment-14083","author":"ron","post":"As you stated above and return the favour; Look in the mirror. R.","date":"2012-07-21","mins":"11:03 pm","url":"https://shroudstory.com/2012/07/17/paper-chase-all-sorts-of-papers/","cat":"history","title":"Paper Chase: All sorts of papers"},{"id":"comment-14112","author":"ron","post":"Slight error in my previous post, 4th line should read as; Here is also a qoute from Mark Guscin, I would like to use in response to Yannick’s argument; R.","date":"2012-07-23","mins":"5:56 am","url":"https://shroudstory.com/2012/07/17/paper-chase-all-sorts-of-papers/","cat":"history","title":"Paper Chase: All sorts of papers"},{"id":"comment-14111","author":"ron","post":"Max Patrick Hamon :Yannick, According to you John Damascene (a church doctor) was so ignorant, he deliberately used the word himation (meaning a more than 4m long x 1m wide cloth) JUST to account for the way Yeshua’s face imprint was recorded on the Edessa cloth? Are you kidding? Lets also make mention and note of Leon Diaconus (c990) Constantinople, Deacon of the Imperial palace, whose version of the Abgar legend calls the Mandylion a Peplos, (i.e; a full length garment.) —— Here is also a qoute from Mark Guscin in response to Yannick’s argument; “Arguing that the Image of Edessa cannot be identified with the Shroud of Turin just because there are plenty of texts that describe the image as a facial image formed in life is rather like arguing that the planet Pluto does not exist, and bringing out a pre 1930 encyclopedia to prove the point.” R.","date":"2012-07-23","mins":"5:51 am","url":"https://shroudstory.com/2012/07/17/paper-chase-all-sorts-of-papers/","cat":"history","title":"Paper Chase: All sorts of papers"},{"id":"comment-14139","author":"ron","post":"Don’t be so smug Max. My statement was meant to back the fact that the Mandylion has been described in more then one mention or ‘wording’ that is was known to be a large cloth, as opposed to just using the ‘Himation’ discription. Furthermore my statement was more towards proving Yannick’s notions incorrect. R.","date":"2012-07-23","mins":"5:13 pm","url":"https://shroudstory.com/2012/07/17/paper-chase-all-sorts-of-papers/","cat":"history","title":"Paper Chase: All sorts of papers"},{"id":"comment-14210","author":"ron","post":"Yannick a Peplos is not just a full length garment but one that covers the full front and back and is fitted over the top…get the point?…covers both front and back, over the top. You are the one that is speculating and in excess, I would add Yannick. Guscin’s quote makes an excellent point, a point which has either gone over your head or you refuse to accept it. R.","date":"2012-07-25","mins":"6:51 am","url":"https://shroudstory.com/2012/07/17/paper-chase-all-sorts-of-papers/","cat":"history","title":"Paper Chase: All sorts of papers"},{"id":"comment-14140","author":"ron","post":"Read my Guscin quote Max. R.","date":"2012-07-23","mins":"5:15 pm","url":"https://shroudstory.com/2012/07/17/paper-chase-all-sorts-of-papers/","cat":"history","title":"Paper Chase: All sorts of papers"},{"id":"comment-13947","author":"ron","post":"I doubt Wilson would even bother reading your paper Yannick, let alone bother answering to any of your 22 objections, whatever they are. Note; I haven’t bothered reading it either. R.","date":"2012-07-18","mins":"12:03 pm","url":"https://shroudstory.com/2012/07/17/paper-chase-all-sorts-of-papers/","cat":"history","title":"Paper Chase: All sorts of papers"},{"id":"comment-15217","author":"ron","post":"Many good points Max! Although I don’t quite understand or agree with your hypothesis of the wrapping and possible image formation, many things you have said seem to make sense and seem to pass thru Yannicks brain without any thought. He seems to do the same with me, as he ignores simple points I’ve made. His notion that a conclusion; “the body was dry is FACT”, is irresponsible…as this has NOT been confirmed, hense many discussions on the topic. Your right that in both Adler and Barbet were not forensic scientists or medical examiners,…Zugibe was and with decades of experience dealing with corpses, hense his ideas should be respected and listened to and not so easily dismissed by the likes of Yannick, whom has absolutely no experience in the matter. As for other points made in this discussion; I have, through much research also remember reading, I believe from the Talmud, that when washing a victim of violence the areas of ‘life blood’ must not be touched, but with other areas of the body there was no issue. The idea of using, say, a dampened sponge to dab the body to cleanse it is quite reasonable and not against Jewish laws. There is also the issue that apparently in the case of a burial stretching into the Sabbath ‘concessions’ were sometimes made, hense allowing the preparers leave of the law. Meaning, one or two of the people involved in the burial preparations could continue past the Sabbath commencement and could make up for this in various ways. Max you are also correct in the fact that Yannick seems to contradict himself many times in his writings, and shows a lack of chronological knowledge dealing with the post passion studies. I also note some of his points seem to negate or go against his insistence for a maillard reaction! Lets’ remember some points here as to the condition of the body as it reached the tomb, it had been hanging on the cross for atleast 2 hours, it had been placed face first, slightly on the right side in front of the cross for another 45 minutes to an hour…What would the condition of the body be like after this? I would think it would be MOSTLY dry, including any sweat and covered in ground dirt, as the dirt would cling to the still damp blood covering, at the time, most all of the body. This dirt would cover most areas of the body; Where is this dirt on the cloth? They found dirt only on certain areas of the body; the foot, the nose and a single knee cap, where is the inevidibly certain dirt which covered the entire body?…One can then come to the conclusion here that the body must have been cleansed in areas not covered with life blood. Can one picture them dabbing the body clean, careful not to touch any areas of life blood, then allowing several minutes for this light dabbing to dry, whilst doing other things, before enwrapping the corpse? Therefore, leaving the body relatively clean of any dirt, sweat or blood in most areas, aswell as being only lightly damp before being enshrouded??…thoughts to this question would be appreciated. R.","date":"2012-08-19","mins":"1:32 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-14209","author":"ron","post":"…and you’ve taken it out of context also. R.","date":"2012-07-25","mins":"6:43 am","url":"https://shroudstory.com/2012/07/17/paper-chase-all-sorts-of-papers/","cat":"history","title":"Paper Chase: All sorts of papers"},{"id":"comment-16937","author":"ron","post":"Well I’ll tell you, skimming through those photos really makes you appreciate the work involved in the STURP research project and mostly, that they managed to pull it off in just 120 hours! But also, appreciated is how FAINT the Shroud image actually is, when there is no photo enhancement! R.","date":"2012-09-26","mins":"7:18 am","url":"https://shroudstory.com/2012/09/26/paper-chase-barrie-schwortz-the-shroud-of-turin-research-project-1978-scientific-examination-of-the-shroud/","cat":"history","title":"Paper Chase: Barrie Schwortz’ “The Shroud of Turin Research Project 1978 Scientific Examination of the Shroud”"},{"id":"comment-14208","author":"ron","post":"Yannick, although I respect Meacham highly and have had the pleasure of reading his excellent book The Rape of the Shroud , amongst many of his papers. But in his book he mentions the same thoughts on Jackson’s fold hypothesis. But it is just his opinion, and not an opinion backed by any research or study!…Now taking all things into account, including the FACT that NOT ONE PERSON on this planet has studied the Shroud quite as indepth or directly as John Jackson, leads my common sense and “a good brain”, to side ‘tentatively’ on the side of actual study and Jackson’s hypothesis. Your quite welcome to believe what you like. But your use of Meachan’s opinion shows your lack of common sense, without doubt. R.","date":"2012-07-25","mins":"6:41 am","url":"https://shroudstory.com/2012/07/17/paper-chase-all-sorts-of-papers/","cat":"history","title":"Paper Chase: All sorts of papers"},{"id":"comment-14159","author":"ron","post":"But it still exists ; ) R.","date":"2012-07-24","mins":"6:25 am","url":"https://shroudstory.com/2012/07/17/paper-chase-all-sorts-of-papers/","cat":"history","title":"Paper Chase: All sorts of papers"},{"id":"comment-6371","author":"ron","post":"Yannick, it makes sense if you ‘consider’ that the King of France wanted it so, that is to eliminate the Templars. It is a well known fact that he was hugely in debt to them and lets’ say jealous and wanting of their wealth and power! …Enough reason right there I would think. As for the templars descriptions given during the trials; Anyone think they may have ‘sworn an oath’ to not reveal it’s true identity? Therefore all the vague descriptions? If they confessed to possessing such a relic, undoubtably the King or even the Church would have demanded possession of such. As for the Templars and the Shroud, I personally am still undecided on whether they ‘possessed’ or just ‘knew’ and venerated it. I wouldn’t be so hard on Ian Wilson as he was going on the Friel’s supposed ‘find’, but as since recanted those ideas in a recent paper. I also believe Wilson’s argument for the Mandylion/Shroud theory does carry alot of weight and is backed by alot evidence; pictorially and literally. But as for the Templars, which I think is the main topic here, although it has been mentioned they had little or no part in the Constantinople sacking, which is probably correct; IT has been deduced that the Shroud was taken to Athens afterwards. From there it would have most probably be taken to Bescanon, but by whom? Remember the Templars were the ‘Fedex’ of the time, santioned by the Church for such duty and in most probability could, or would have been commissioned in the safe delivery of the Shroud and other ‘trophys’. Therefore ‘likely’ they ‘knew’ of it’s existence. Other then that there is very weak evidence to the fact they possessed it, but slight evidence that they knew of or could have temporarily possessed it, “in holding’ for a period and venerated it…..This being my CONJECTURE from my readings and study of course. R.","date":"2011-12-31","mins":"9:17 am","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008"},{"id":"comment-6418","author":"ron","post":"Typo correction name should read as; Frale..","date":"2012-01-01","mins":"1:29 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008"},{"id":"comment-6478","author":"ron","post":"I show no bias Yannick, unlike I can easily say about you on so many topics here…Diffusion vs. Light for one. As for the depiction of the face on the Mandylion; You originally, talked about any renditions not showing the blood or his suffering, not of the likeness, your changing the subject!…I’ll repeat; No paintings of the Mandylion, Shroud; show any suffering or blood wounds. (That I know of) Do you see any markings on any of the Pantocrator icons?…case closed. I would also disagree with you that some renditions of the Mandylion do not have similar traits to the face seen on the Shroud, this is definately untrue and you have to be near blind not to see them. Another thing is you don’t think of the possible fact that hardly anyone would have seen the Mandylion, ‘UP CLOSE’, has it was “most probability” always kept in a chest. Only very few actually viewed it close up. So NO, people were not stupid back then , just they had very little CLOSE visual access.Close enough to discern certain details that is. Robert de Clari mentions no such ’tile’ you talk of Yannick, read his statement again. I’m not saying I don’t believe you on the “many lists” I’m just asking that you post them! So we all can scrutinize them. P Lus you said earlier the Abgar legends and writings were irrelevant yet you use them here to back your point! I’m not even going to enter counterpoints to your King Louis paragraph, as you clearly make alot of assumptions and conjectures in there…especially in your third last paragraph. Don’t worry Yannick, I won’t get upset, but isn’t it a little premature or a little arrogant to say you are right, in your assumption? A Nd please I asked for point form ; ) …In other words keep it short and simple. It makes it hard to respond with long drawn out comments. Thanks R.","date":"2012-01-02","mins":"4:01 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008"},{"id":"comment-6618","author":"ron","post":"Yannick sometimes I find it can be impossible to debate with you. One issue is you seem to assume things, and BIG TIME; One; That you have full knowledge and understanding of the “Laws of Nature” and therefore energy cannot possibly come from a corpse, REALLY? Then I’d say your knowledge is far beyond all mortal humans! Science barely has a grasp of the nature of things, most is all theories. So because we don’t understand how something can be possible it automatically is supernatural and out of the range of science?…Bull!….Stay grounded if you like, but grounded also means ‘Constricted in imagination’ and without imagination, science would not exist. Remember when you stated at one time people thought earthquakes, floods were acts of God because they didn’t understand nature? …Notice any similarities in your thought? I see no danger in being ‘imaginative’ when dealing with science whatsoever and I’m glad I’m this way. Two; Robert di Clari, YES, never saw “a linen and a tile”, he states he ONLY saw the ‘containers’ or boxes which would have held them. So these items may not have even existed, just empty boxes. What we have here is just an eyewitness account of containers, nothing more!. Also the mention or possiblilty of the two artifacts existing at the same time ‘STARTED’ in Constantinople, not anytime before, in any writings whatsoever and as both items were never actually SEEN at the same time by any eyewitnesses, it makes it quite plausable that ‘maybe’ only one article actually existed and not both. Three; You assume your “authentic historian Poulle in France”, would be any better in deducing true history then Scavone or Wilson, WHY? Because he may have some letters after his name? Yannick you can be hypocritical also when it serves your means by accusing these men of being bias or pro shroud. These people have done extensive studies, most of what they say comes from authentic translation of many documents, which they list references too. I could state ‘quite easily’ here; Any historians that do not agree with these hypothesis are biased, ignore or misinterpret historical documentation and basically may be against Shroud authenticity! How does that sound? When it comes to the renditions of the face on the mandylion and/or verse the Shroud etc; You have confused the issue so badly at this point, I can’t even think of a rebuttal. LOL. You keep changing the issue, I’m now confused at your point…. Since English is a second language issue for you, I’m going to just chock alot of this up to misinterpretations and misunderstandings. R.","date":"2012-01-06","mins":"4:52 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008"},{"id":"comment-6420","author":"ron","post":"Yannick Clément :I just note one mispelling I’ve made in one important paragraph. So here it is again : Of course, in the pro Shroud circle, all we ear is the good side of the medal and we never heard about all those problems relate to this hypothesis… I repeat : it’s like a castle of cards to me because of it’s great fragility. Just an example : in MANY lists of relics written by eye witnesses who visited Constantinople from the end of the 11th century until 1204, we can read, in the same list, a mention of a shroud of Christ AND a mention of the Mandylion ! The only way Wilson and his supporters have been able to deal with this “contradiction” was to make believe that the Mandylion mentionned in those list is a simple copy of the original to perpetuate the Abgar legend and the Shroud mention there is in fact, the authentic Mandylion now unfold ! And what is highly important to note here is the FACT that this idea proposed by Wilson and others (that seem to be there only to defend this hypothesis) is NOT BASED at all on a reliable documentary source. NOT A SINGLE ONE ! WE GOT HERE Of course, in the pro Shroud circle, all we ear is the good side of the medal and we never heard about all those problems relate to this hypothesis… I repeat : it’s like a castle of cards to me because of it’s great fragility. Just an example : in MANY lists of relics written by eye witnesses who visited Constantinople from the end of the 11th century until 1204, we can read, in the same list, a mention of a shroud of Christ AND a mention of the Mandylion ! The only way Wilson and his supporters have been able to deal with this “contradiction” was to make believe that the Mandylion mentionned in those list is a simple copy of the original to perpetuate the Abgar legend and the Shroud mention there is in fact, the authentic Mandylion now unfold ! And what is highly important to note here is the FACT that Wilson and others based this SPECULATIVE idea (that seem to be there only to defend this hypothesis) is NOT BASED at all a reliable documentary source. NOT A SINGLE ONE ! WE GOT HERE ANOTHER PERFECT EXAMPLE OF A PURE SPECULATION THAT WAS IMAGINED IN ORDER TO DEFEND A WEAK HYPOTHESIS. I’d like to see these 11 important problems Yannick, in simple (point form) please. No drawn out interpretations. You mention several “lists” which place the Mandylion and Shroud in Constantinople at the same time!! Lets see them so we can scrutinize them here….Even if it is true, I can think of several reasons, these lists, or more accurately the people whom had written them could have been wrong or misguided…not so simple. You mention there is no paintings of the Mandylion showing Christ’s blood or suffering,…SO WHAT? What does this prove? Do any paintings show such, seriously Yannick. The Mandylion would have shown ‘Only the Face’, I have seen very few paintings, if any, depicting his facial wounds. Your point is useless. Oh by the way the points I mentioned above about the the KING and Templars are facts, not a made up “sexy’ story. R.","date":"2012-01-01","mins":"2:04 pm","url":"https://shroudstory.com/2011/12/30/paper-chase-dan-scavones-besancon-presentation-at-ohio-2008/","cat":"history","title":"Paper Chase: Dan Scavone’s Besancon Presentation at Ohio 2008"},{"id":"comment-15608","author":"ron","post":"Yannick Clément :Ron you wrote : “Most all crucifixion victims (excluding Jews)were actually left on their crosses to rot or be devoured by wild dogs, birds of prey etc.” In most parts of the Roman empire this is correct. But you should not forget the particularities of the Jewish tradition and the fact that they could not stand that a criminal could stay on the cross after the night had began. That’s probably why Jesus and the 2 other criminals didn’t stayed on the cross more than one day. And it’s a fact that is confirmed by most scholars that giving a criminal a normal burial in a family tomb was NOT at all common, even in Palestine. But it was for a Jew NOT to hang overnight, the Jewish religious authorities would care little, if it was a gentile or slave, or what have you. Also, it is not ‘probably’ why Jesus and the thiefs were taken down, it was EXACTLY why they were taken down! In the case of the thiefs though, (assuming they were not Jews), it was because it was the Sabbath moreso then anyother reason. If it was not the Sabbath a non Jew criminal would stay hanging. Most scholars and the ‘fact’ you mention is not confirmed and actually refutted by the only crucifixion victim’s bones ever found…A Jewish man’s bones found in a ossuary with a crucifixion nail still thru his heel! It may have well been common for crucified Jews to be entombed properly according to Jewish law. No one can say for sure one way or the other, even your scholars. R.","date":"2012-08-29","mins":"11:58 pm","url":"https://shroudstory.com/2012/08/29/paper-chase-distinctive-features-of-the-shroud-that-have-yet-to-be-explained-and-their-correlation-with-historical-jesus-research/","cat":"history","title":"Paper Chase: distinctive features of the Shroud that have yet to be explained and their correlation with Historical Jesus research."},{"id":"comment-15597","author":"ron","post":"There is very little historical evidence pertaining to crucifixion, so most historical comments are based from writings and speculations…The reason Jesus was lanced in the side was because they found he was already dead, otherwise they would have broken his legs (This is clearly stated in John20 ). They took Jesus and the thiefs down because it was against Jewish religious doctrin to leave one hanging overnight and especially since the Sabbath was dawning. Most all crucifixion victims (excluding Jews)were actually left on their crosses to rot or be devoured by wild dogs, birds of prey etc; Maybe in circumstances of multiple crucifixions would victims be taken down and dumped in grave pits. It would seem in Jesus’s case a special concession was offered, due possibly Nicodemus’s standing. R.","date":"2012-08-29","mins":"10:08 pm","url":"https://shroudstory.com/2012/08/29/paper-chase-distinctive-features-of-the-shroud-that-have-yet-to-be-explained-and-their-correlation-with-historical-jesus-research/","cat":"history","title":"Paper Chase: distinctive features of the Shroud that have yet to be explained and their correlation with Historical Jesus research."},{"id":"comment-15879","author":"ron","post":"Better check your facts Charles, Urfa IS situated in an semi arid climate zone. But you missed the point of my comment! Which was geared toward the possibility of a linen cloth, IF concealed in a sealed niche in a main gate (these gates could be quite high apparently) surviving centuries. As for mortar, Why not? Mortar (or a facsimile of) was commonly used in ancient times in the contruction of walls, gates what have you. Why is it so hard to accept it’s use in the sealing of an object of veneration high in a gate? If the ‘Shroud’ was concealed or sealed in the entrance gate, of either city, and I am not saying I stand by that assertion, it would definately survive many centuries. R.","date":"2012-09-05","mins":"7:42 am","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson"},{"id":"comment-15883","author":"ron","post":"I would be interested in reading some articles by these ‘Professional Historians’ we keep hearing about, but more precisely, any papers which have refuted Wilson’s hypothesis. If you could link us to some articles, it would be much appreciated, as in my Google searches, I haven’t been able to find anything on the matter and not one of these Historians have bothered to place any of their papers on shroud.com, which is odd. Thanks, R.","date":"2012-09-05","mins":"8:10 am","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson"},{"id":"comment-15880","author":"ron","post":"I should have also stated; As mortar was commonly used, it could be easily asserted it WOULD be used in the process of concealing something in a wall or gate. R.","date":"2012-09-05","mins":"7:46 am","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson"},{"id":"comment-15814","author":"ron","post":"I sense Mr. Jones frustration, and honestly, I don’t blame him! There are so many issues with Freeman’s paper that it ‘almost’ can be construed as a deliberate attempt to mislead his readers. The out of focus image above is possibly just another one of those attempts…Anyone think I’m being too harsh? To bad…Did anyone read the part in Freeman’s paper about the ‘folded hanky’ (tetradiplon), where it ends up as a square? LOL. Seriously Freeman’s paper is a joke and the fact he endorses Yannick’s many points, is an even bigger joke. As many of YC’s points have been ‘properly’ refutted by several people here, and not just me, and many many times over. Yet YC simply ignores these arguments, as I would suggest Freeman has also, and YC keeps writing…It makes me nauseated! …Seems to me, Freeman may have chosen to read only YC’s comments on this blog and turned a blind eye to all others. If Freeman’s paper is an example of ‘Historians/scholars writings, outside the Shroud world’ in attempt to discredit Wilson’s hypothesis, then this is a sad world we live in. R.","date":"2012-09-03","mins":"6:31 pm","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson"},{"id":"comment-15843","author":"ron","post":"Mr Freeman, with all due respect, I’m sorry but I cannot accept your explanation for the ‘fuzzy’ photo. For one you could have easily searched for a better depiction! Second; You simply failed to explain that the image was of a ‘wall panel’ which would explain completely, it’s shape not adhering to most all renditions of the Image of Edessa, that being; as a face on a rectangle (landscaped) shaped linen. R.","date":"2012-09-04","mins":"12:49 pm","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson"},{"id":"comment-15847","author":"ron","post":"Mr. Freeman, I don’t believe “imagination” comes into play here wahtsoever. ‘A picture speaks a thousand words’… I found a prestine representation just as quickly as Mr Jones did, with a simple Google search! Moreover, you haven’t addressed the second point whatsoever! Which by far is the most importance of the two. Furthermore, I would like to add to Mr Jones critic of your work and precisely to your comment as to the linen’s low probability of surviving “in damp” over hundreds of years; In addition to Mr. Jones referal to Wilson’s explanation of the Shroud being actually ‘sealed’ in the wall, (which you also did not make evident in your article), you obviously show a lack of knowledge in the fact that Edessa or Antioch are situated in a “semi arid” climate of “very low humidity or rainfall”. You also have not studied very well the attributes or qualities of Linen itself. Linen (flax), is probably the most enduring of fabrics created, it has a far greater endurance and strength to others, as in cotton or wool and one of the few that are stronger wet then dry. Many samples much older then the Shroud have been found intact and some in prestine condition. Case in point A linen cloth found in an ‘open air’ Qumran cave dating most probably to the 1st century AD, still in prestine condition and of a single one to one weave, not of the ‘stronger’ 3 to 1 weave we find on the Shroud…There can be no argument that the Shroud could have survived quite well for hundreds of years, let alone even thousands of years, if ‘SEALED’ in a stone wall or stone gate. R.","date":"2012-09-04","mins":"2:51 pm","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson"},{"id":"comment-15850","author":"ron","post":"Please excuse some typing errors above, thanks..","date":"2012-09-04","mins":"3:09 pm","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson"},{"id":"comment-13248","author":"ron","post":"Yannick you really think anyone would have kept the S Hroud in Jerusalem or Palestine till the 8th century, seriously? Palestine was conquered by the Persians’ in the 7th century. I’m sure without any doubt the Shroud would have been taken out, if there at all. It is more likely it was taken to a safe area such as Antioch or Edessa well before then. T Here is no FACTS of whether the Shroud was or was not in Edessa but that is why Wilson hypothesizes the Shroud may have been known as the Mandylion. Yes folded in 8, covered so only the face showed and then shown very very rarely to anyone. Whether the people in Edessa knew this was a full length Shroud or not, we can only guess, maybe it was never unfurled due too worries of sacrilege? Or maybe it was known that it was a full length burial Shroud but only by a certain few in the hierarchy and kept a secret for obvious security reasons….Only to be realized in 944 when forcefully taken from Edessa. The fact that the image of Edessa or Mandylion was never described as a burial Shroud or the fact blood markings were not mentioned could be solved by this hypothesis. And would explain alot..","date":"2012-06-30","mins":"7:54 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"id":"comment-13249","author":"ron","post":"Dan I seem to be having issues anytime I try to reply to any comments. It starts to pop the cursor out of box and I am unable to cursor to where I left off. This has been occuring for awhile now, making it almost impossible to finish my comments properly. It happens only if I try to use reply or quote, I’ve noticed. Thanks. R.","date":"2012-06-30","mins":"8:00 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"id":"comment-13788","author":"ron","post":"Yannick Clément :Jackson’s hypothesis concerning the folds is purely speculative for numerous reasons (the first one being the FACT that nobody can date a fold mark !!!). And because of this particular and, excuse me, completely ludicrous and non scientific hypothesis, Jackson’s bias regarding Wilson’s hypothesis is as obvious as the nose in anyone’s face… Max, I recommend you to read again carefully the fact #22 in my article. This is TRUE AND CORRECT SCIENCE, not science fiction based solely on speculations. And what this TRUE AND CORRECT SCIENCE tell us ? That there are absolutely no signs of any kind of physical and chemical differences between the region of the face and the rest of the cloth, not only at thread level, but even at fiber level !!! On this subject, let me remind you that the Spanish team of Sindonology have been able (very easily) to prove what was the side of the Sudarium that was always exposed to the faithful (probably for century) just by the amount of dirt and dust that was more present on this particular in comparison with the other side that was hidden to the eyes of the public (and consequently protected from air and sunlight). Why would it be different in the case the Mandylion hypothesis was correct ??? Come on !!! By the way, this particular hypothesis of Jackson concerning the folds remind me of another ludicrous hypothesis proposed by himself regarding the bloodstains on the Shroud !!! Effectively, in one paper he published in Shroud Spectrum in the 80s, Jackson was pretending that there was not only real bloodstains on the cloth but also “images” of bloodstains !!! Wow ! No doubt that we are right into the Twilling Zone here… : ) And I’m not even talking about his other hypothesis concerning the Shroud that was, in fact, the tablecloth for the Last Supper !!! Totally incredible… It’s the right word I guess. Yannick always keep in mind all hypotheses are somewhat speculative. Secondly you forget the afformentioned folds were noted by the STURP team before Wilson’s first book was even published!, so less likely Jackson ‘thought up’ his hypothesis from Wilson. The fact that folds cannot be dated is a sticky point, agreed, but not so relevant when the folds have been deemed; “fact” that they exist and prove unquestionably, that the Shroud was for some extended period of time, folded in such a way as it would agree with Wilson’s Image of Edessa ‘landscape’, ‘tetradiplon’ theory. Why do you ignore these facts? Another thing; Just because one hypothesis put forward by someone may prove wanting, does not mean all hypothesis put forward will follow. Anyways as for “images of bloodstains”; Jackson is not the only one who believes so, as some of the blood markings are seen on what some suggest are non contact areas. Can you prove them incorrect? …I highly doubt so. Also to state that because the Sudarium shows evidence of being dirtier on the ‘assumed shown side’ can relate or pertain at all to the Shroud is a HUGE assumption, if there ever was one. Especially when we know very little of how or where they were kept for much of their existence. The EDICES assumption that the dirtier side was the most shown side is completely speculative, there can be other very reasonable causes for this evidence. R.","date":"2012-07-12","mins":"5:16 pm","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"id":"comment-17758","author":"ron","post":"Charles Freeman :What evidence do you have that there is too much contamination on the Shroud for a modern laboratory to cope with? Have any of the testers of the Shroud raised it as a major issue? Has any other radio carbon expert? I think you must give some expert opinion on this from someone working in the field who can assess the history of the cloth if you want to sustain your argument. Remember that the amount of contamination of cloth between 650 and 2000 years old is likely to be minimal compared to that affecting a material object of 50,000 years old , towards the limit of effective radio carbon 14 dating. Again nonsense from one whom obviously has not studied or understands the issues with C14 dating of artifacts! A ‘material’ buried (sealed) in a tomb or in the ground for thousands of years would be much easier to test and far less contaminated compared to the Shroud. They would be much less prone to accumulate contaminates, C14 isotopes etc; verse the Shroud. A Shroud, which has been handled, moved around, and kept in numerous ‘unknown’ containers and enviromental conditions for hundreds if not thousands of years. A Shroud which has also been “undoubtably contaminated” by centuries of incense and candle smoke, and plain old pollution. Moreover, and must be mentioned; being exposed to ‘extreme’ heat in possibly ‘several’ fires? and/or atleast one well known fire, which would have immersed the cloth in 900+ degree temperatures? There is no comparison whatsoever with the Shroud and most all other C14 items ever tested. It is also well understood in the C14 world that porous materials, such as linen, are extremely prone to contamination and all experts agree; is by far the most difficult to clean and test accurately…Take for instance in the cases of mummy wrappings (sealed for millenia no less); the wrappings have dated much younger then the bodies themselfs, and in a couple of cases with dates in disagreement exceeding 1000+ years! …Let’s get real here, radiocarbon dating is not infallible, far from it, it cannot be relied upon to give reliably accurate dates, ON IT’S OWN, and is very subceptible to errors due to unknown contaminations…This is not only a reality but a FACT, even with today’s technical advancements. No serious expert in the field would claim otherwise. Although it may be the best method (arguably) we have today, it is not perfect and far from being precise enough to claim provenance of any object studied. R.","date":"2012-10-17","mins":"4:10 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","title":"Quote for Today: Diana Fulbright on Wishful Thinking."},{"id":"comment-17761","author":"ron","post":"Daveb of wellington nz :Forget C14! It will never have legs. Too much contamination. There also seem to be other problems in C14 dating of linen. Gabriel has mentioned a number of other tests. We know so little. Strontium has yet to be looked at, and yet could be so revealing. It’s persuasive to me for example that the cloth’s dimensions are exactly 8 x 2 Syrian royal cubits. Those weren’t the units used in medieval times. The cotton contamination is also Middle East provenance. It had to be somewhere! It’s funny how people will overlook such evidence. The Shroud conforming to the CUBIT measurement, the CLOTH fragments found intertwined with the linen fibrels that conform to known 1st century Egyptian provenance, only. The STITCHING of the seam, conforming to known 1st century stitching found at Masada 73 AD. The loom manufacture, conforming to 1st century Syrain design etc; …It’s laughable really, to me anyways, that people still question the origin of this Shroud. R.","date":"2012-10-17","mins":"4:35 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","title":"Quote for Today: Diana Fulbright on Wishful Thinking."},{"id":"comment-17760","author":"ron","post":"I should add; it would be a mistake to assume further C14 dating, with our present technology would be of any use, nor do I believe the Vatican feels any different. R.","date":"2012-10-17","mins":"4:20 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","title":"Quote for Today: Diana Fulbright on Wishful Thinking."},{"id":"comment-3292","author":"ron","post":"Although I agree with the conclusion of the article it still bothers me that people keep using the nails thru the wrists, not the palms as a big piece to the puzzle or as evidence, when undoubtably it has been proven that the nails could have been nailed thru the palms on an angle where they would come out at the back wrist area.One should read the findings by Dr Zugibe for the explaination of this.So in saying this; the Shroud DOES NOT depict a contrary method to earlier paintings or depictions of nails thru the palms. Thank you. R.","date":"2011-07-02","mins":"7:47 pm","url":"https://shroudstory.com/2011/06/29/great-new-article-in-open-salon-the-shroud-of-turin-resurrection-and-joe-kennedy/","cat":"news_&_views","title":"Great New Article in Open Salon: The Shroud of Turin, Resurrection and Joe Kennedy"},{"id":"comment-17780","author":"ron","post":"You don’t know about this Yammick? and I thought you were an expert! Try reading on the 1988 C14, findings and you’ll find the answer. R.","date":"2012-10-18","mins":"7:00 am","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","title":"Quote for Today: Diana Fulbright on Wishful Thinking."},{"id":"comment-3323","author":"ron","post":"Okay maybe I shouldn’t have used the word ‘undoubtably’ and I am no doctor myself, but I have studied it pretty thoroughly and with the help of my Personal Doctor, whom happens to be a surgeon and also a Shroudy figures Zugibe has it right…Common sense tells me (putting myself in the sandals of a Roman Centurian) that 1. Romans were very maticulous in everything they did from building roads to the technology of thier weapons.2.Now these Romans were crucifying people for centuries and in Christ’s time by the dozens or more each day.Point is they would know exactly how to hammer a nail and at what angle to get it right.Plus it is known they would use wood washers between the nail head and the body, this would make it practically impossible for any substantial movement to occur of the hands or feet.Anyways has you said we could go on for hours in this so let’s just say we agree to disagree on this particular topic ; ).","date":"2011-07-07","mins":"6:05 pm","url":"https://shroudstory.com/2011/06/29/great-new-article-in-open-salon-the-shroud-of-turin-resurrection-and-joe-kennedy/","cat":"news_&_views","title":"Great New Article in Open Salon: The Shroud of Turin, Resurrection and Joe Kennedy"},{"id":"comment-3506","author":"ron","post":"I do not agree with your second and third paragraph, in the sense that the Shroud shows only the ‘back’ of the wrist not the front (We can not see the entry point and no assumptions should be made).All artist depictions in history have always shown only the ‘front’ or palm view and with the nails driven thru the hands or palms.Artists were never very worried about accuracy as is easily discernable by any eye.ALSO, (This is not an argument for or against the ‘forgery’ hypothesis, this is an argument for the distinction of the nail entry point in historical paintings).This distinction though of the nails driven thru the ‘palms’, not the middle of the ‘hands’ may be accurate going by Zugibe’s hypothesis.As it has been ‘proven’ by Zugibe that the nail could have followed this path.Also if you have read Zugibe’s paper he gives good evidence as to why this method would be a stronger ‘holding’ point, comparing ‘exactly’ where the wound exits are showing on the Shroud, i.e pinky side vs index finger side of the wrist…this point is VERY telling.So going by what his theory states, the earlier understanding of the nails being thru the ‘palms’, not hands may very well be accurate in it’s depiction, even if it was not understood by the artists at the time, that the nail exits were from the wrists.As they were going by scripture and not by their own forensic knowledge. I just believe you are misinterpreting my view in this matter or I may not be explaining it properly…The exit wounds on the wrists is very good evidence that the shroud is authentic but only because ‘today’ forensically we understand that it is accurate.but it is not precise to use that point against early artist impressions/depictions. So I stand by my original statement. Ron..","date":"2011-08-01","mins":"9:31 am","url":"https://shroudstory.com/2011/06/29/great-new-article-in-open-salon-the-shroud-of-turin-resurrection-and-joe-kennedy/","cat":"news_&_views","title":"Great New Article in Open Salon: The Shroud of Turin, Resurrection and Joe Kennedy"},{"id":"comment-15183","author":"ron","post":"Rediculous argument, which you have stated before and counter acted easily; How do you explain the Stones of the Ten Commandments? They were created by God and given to the people. The Shroud can be seen as no different; Created by God as a ‘sign’ of his resurrection, his truth! Not made perfect but in such a way as a leap of faith is required to believe…So yes Yannick, I believe he would make an imperfect or slightly unfinished image, surely and simply, for our sake…Furthermore, don’t make the mistake of putting to much faith in theology, you may want to read what scriptures says about that. R.","date":"2012-08-18","mins":"1:39 pm","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","title":"Imagine the image as part of the resurrection and not the result of the resurrection"},{"id":"comment-14692","author":"ron","post":"“We need to stretch our thinking”…”Think of the image as being part of the resurrection and not the result of the resurrection” …Okay, Isn’t that what I’ve been trying to say for months here? The image is here and it most definately was not made by man, most probably not a “freak of nature” either. Furthermore yes, Why must it be a byproduct of the resurrection? Do we not trust that God could or would give us proof of his resurrection, proof that we cannot explain with all our conceited science? …I think yes, and I think we should humble ourselfs… That is my sermon for today. Thank you. R.","date":"2012-08-10","mins":"7:11 am","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","title":"Imagine the image as part of the resurrection and not the result of the resurrection"},{"id":"comment-14971","author":"ron","post":"Curious daveb, whom is your comment addressed too? R.","date":"2012-08-15","mins":"1:19 am","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","title":"Imagine the image as part of the resurrection and not the result of the resurrection"},{"id":"comment-14878","author":"ron","post":"Max Patrick Hamon :Whether deliberately or unconsciously, arch miraculists are and do everything for the Sindon Image to remain an ongoing enigma so that they can keep promoting their “God of the gap” approach. (see their list of so called proven facts, aprioristic approach and implied received ideas as they appear in Fanti’s paper) This is neither Science nor Archaeology but applied ideology. Max, just to clarify when I speak of facts, I speak of STURP conclusions, nothing else. Obviously you don’t read my comments with very much interest as your interpretation of them in some ways shows this. If you have considered ALL the evidence this image shows and still believe in your mind there is a ‘Naturalistic’ method for such, then that is your right, but I would suggest your missing something. You also fail to notice the main point in my comment, which was; Everytime one studies a certain detailed facet of the Shroud and believes he’s come to undertand it, another one shows up to throw in a wrench into it, as they say….Don’t you find this incredibly odd? R.","date":"2012-08-13","mins":"6:53 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?"},{"id":"comment-14736","author":"ron","post":"THANK YOU, Anniecee and Daveb for your insightful thoughts. R.","date":"2012-08-10","mins":"5:06 pm","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","title":"Imagine the image as part of the resurrection and not the result of the resurrection"},{"id":"comment-15505","author":"ron","post":"Max two things bother me with your hypothesis; 1. The off image blood at the elbow does not confirm any body movement, it can simply be the Shroud was tucked under the arm/elbow. 2. With your gradual mechanical separation of the cloth from the body; Would not this STILL be evident on the blood, especially if removal was gradual? The studies have found no sign on the blood traces, whatsoever, of separation from the cloth. R.","date":"2012-08-27","mins":"1:19 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?"},{"id":"comment-14689","author":"ron","post":"Max, Dave’s statement DOES NOT in any way imply a loosely bound Shroud. Read it again, he is trying to say the dorsal image shows no signs of resting on a rock base as there is no signs of skin flattening. Which even if the body was in rigor would still occur from the body weight…so get it straight ; ) R.","date":"2012-08-10","mins":"6:36 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?"},{"id":"comment-14695","author":"ron","post":"Dave, was I incorrect in my last statement in defence of your previous statement? Because I didn’t read any implication to body wrapping. Just the lack of evidence to body weight on the image…. I think it’s also pretty safe to say the body was lying supine and not on it’s side when the image was formed. It may have been held to one side during preparations, hense the flow of blood. This has been asserted by forensic studies by the way., but definately not lying on his side during the image formation. That would suggest a horizontally produced image, which seems very unlikely. R.","date":"2012-08-10","mins":"7:35 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?"},{"id":"comment-14699","author":"ron","post":"Max Patrick Hamon :Ron, a Medical examiner is definitely NOT an ARCHAEOLOGICAL BLOOD PATTERN ANALYSTS. BTW are you an archaeological blood pattern analysist to make such an assertion? No, never said I was, plus I never heard of one either ; ). I’m guessing you are going to tell me now that you are? Furthermore, forensic pathologists (experts) would definately have knowledge of this. Especially ones which have studied hundreds of cases and thousands of bodies….next… R.","date":"2012-08-10","mins":"8:27 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?"},{"id":"comment-14706","author":"ron","post":"Max Patrick Hamon :BTW I myself never read anything about a medical examiner having proved beyond any rational doubt that the sindon image was formed while the body was lying in suspine position. Either you are poisoning the well with a blatant LIE or you shall give me the link to such a research paper I’m poisoning the well and lying? C’mon Max let’s get back to reality here. I have read extensively on the Shroud and listened to many interviews with Shroud experts and the concensus by almost all involved is that the body was SUPINE when the image formation occurred. It’s pretty commonly stated Max!…Think, why on earth would they place/leave his body on it’s side? Many 1st century Judanian burials have been discovered, and from what I read they were all found in the supine position, no mention of a side burial. If you want to stay in lala land and tell us the body was on it’s side, then please explain the image we see and how possibly it was formulated whilst the body was on it’s side. R.","date":"2012-08-10","mins":"8:48 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?"},{"id":"comment-14708","author":"ron","post":"Yes..","date":"2012-08-10","mins":"8:49 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?"},{"id":"comment-14709","author":"ron","post":"Max Patrick Hamon :I see Ron and Dave are making totally or almost totally gratuitous assertions as they still don’t know their stuff. How long will they be unable to really discriminate between die hard recieved ideas, true facts, what is most likely to be true, half truths and mere speculative ignorance? Probably less time then you Max….Curious what drugs are you on? R.","date":"2012-08-10","mins":"8:53 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?"},{"id":"comment-14797","author":"ron","post":"Well Max with all the ways and ways, it is still an enigma! All scientifically tested facts found to date, all attemps to replicate, and all hypothesis put forward, so far, have not proven anything! We know what the image is not, but not what it is. But those are not the only reasons I believe the image is miraculous. I have my own reasons which I’ll keep to myself. Furthermore you could not be more wrong on one point, in that, I keep in touch with all scientific studies done and by my understanding of everything (all facts) that I’ve read and of the perplexing qualities of the image, I still get the sense there is not nor will there ever be a simply ‘naturalistic’ conclusion to the Shroud. We will be long gone Max and the Shroud will still baffle all those who study it, as it has done for the last more then a century of scientific study. R.","date":"2012-08-11","mins":"4:01 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?"},{"id":"comment-14788","author":"ron","post":"Max said ” Shall I repeat here, if the Sindon Image is ( as I do think after years of studies and research) just the result of…” Thats one big “IF” Max! Truly, I sense science will never find an answer to the Shroud. The Shroud is an enigma, which seems to stay one step ahead of our science…’Seemingly’ one figures out one thing, and yet another is there to perplex and bewilder!…Get the picture? R.","date":"2012-08-11","mins":"11:24 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?"},{"id":"comment-17781","author":"ron","post":"I don’t get my ideas from reading a single handbook. I have attained my knowledge from reading numerous papers and talking to professionals in the field. Now if you want to go on believing C14 is the holy grail of time stamps and has no issues, go ahead I cannot change the way you percieve information. R.","date":"2012-10-18","mins":"7:04 am","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","title":"Quote for Today: Diana Fulbright on Wishful Thinking."},{"id":"comment-15434","author":"ron","post":"Now this question translates well! …I have debated these ‘circles’ with others, including email conversations with Mark Guscin. Mark has stated to me that they most likely are irrelevant, that many other paintings have the same ‘circles’ painted in, most likely as decoration. He also mentioned if one looks closer, one can see white circles, also painted in, but are more faded and harder to see, basically making the seven (7) darker circles less meaningful. Stephen Jones on his blog has suggested they are depictions of the ‘poker holes’ one finds on the Shroud and that these holes may have been depicted on the ‘covering’ placed over the Image of Edessa/Mandylion. I have my own layman hypothesis on the matter, which I have put forth to Mr Guscin, in that I believe these circles ‘may’ represent the artist’s intention of relaying his knowledge, that the cloth is actually larger and folded with seven layers beneath the layer shown!..Pure speculation I know, unless one takes into account the several lines painted at each edge; left/right, that could be deduced as, or reminiscent of, multiple folds. The odd numbering of 3 ‘slanted’ on one side followed by four square on the other, seems to spark something I had seen on ancient architectural drawings dealing with levels, this is where I get my reasoning that the dark 7 circles can mean layers…The slanted 3 circles to me seems to negate the poker hole hypothesis as the poker holes are not slanted on the Shroud! I am presently trying to find these architectural drawings I referred to, so I may strengthen my point, but it may take awhile as it was years ago that I studied the topic. R.","date":"2012-08-24","mins":"11:18 am","url":"https://shroudstory.com/2012/08/23/scholarly-incompetence-or-dishonesty/","cat":"history","title":"Scholarly Incompetence or Dishonesty?"},{"id":"comment-15678","author":"ron","post":"Are you inmplying that ONLY you and Freeman have done HONEST, UNBIAS and THOROUGH research on the subject? Now I’ve heard it all!..I can assure you dear Yannick, I’ve done plenty of more research, read much the same as you, if not moreso and I am pretty sure I’ve done more research then Freeman on this ‘particular’ subject, noting from what I find in his rediculous paper. Moreover, I’ve done my research honestly without bias as I have no agenda, just the truth. But as in many things it is one’s PERCEPTION of the evidence that comes in play. I don’t agree with many of your points, which you use to prove your standing. Many of your points can easily be dismissed and due to YOUR lack of an open mind, insistence on ignoring others counter points etc;…So don’t go ASSUMING you may be more literate on the subject then others. I am sure others here will feel the same as me to your rediculous assumption. R.","date":"2012-09-01","mins":"1:19 am","url":"https://shroudstory.com/2012/08/23/scholarly-incompetence-or-dishonesty/","cat":"history","title":"Scholarly Incompetence or Dishonesty?"},{"id":"comment-15679","author":"ron","post":"As to my last comment, I just want to say; I’ve lost any respect I may have held for you, and not just based on your last comment, but moreso because of it. R.","date":"2012-09-01","mins":"1:29 am","url":"https://shroudstory.com/2012/08/23/scholarly-incompetence-or-dishonesty/","cat":"history","title":"Scholarly Incompetence or Dishonesty?"},{"id":"comment-15438","author":"ron","post":"Thats an interesting perspective Max and relates to the architectural design of the Sakli church itself….interesting. R.","date":"2012-08-24","mins":"11:39 am","url":"https://shroudstory.com/2012/08/23/scholarly-incompetence-or-dishonesty/","cat":"history","title":"Scholarly Incompetence or Dishonesty?"},{"id":"comment-15427","author":"ron","post":"Something gets lost in the translation here, I don’t understand what Carlos is asking or to whom the question and remark is addressed. Can it be translated more precisely? I’m always interested in Carlos comments is why I ask. R.","date":"2012-08-24","mins":"10:30 am","url":"https://shroudstory.com/2012/08/23/scholarly-incompetence-or-dishonesty/","cat":"history","title":"Scholarly Incompetence or Dishonesty?"},{"id":"comment-17052","author":"ron","post":"Lyfe :Stephen Jones was challenged on the Vignon markings in comments on Part Six of his critique of Charles Freeman (his post of August 23rd). Faced with examples of Vignon markings, from catacomb art, of the fourth century, Jones, at the end of the comments postings, suggested that the Shroud was copied in Antioch in the fourth century. (Stephen Jones prefers the Markwardt’s Antioch theory over Wilson’s Edessa theory for the early hiding of the Shroud.)The presence of Vignon markings in earlier Christian and imperial art has always been a problem for Wilson’s theory of the copying of the Shroud in the sixth century.I was amazed how limited Vignon’s examination of the Shroud was an hour with a group of others at midnight and ten minutes in the open air when there was a crowd around it not much time for a scholarly assessment! How long does one need to indentify markings? Especially if you already know ‘exactly’ what you are looking for and where? …I would suspect less then a minute, two or three at the most? The point is; the question has been answered, as in, Vignon DID actually view the Shroud in real life at various ranges and in various ‘lighted’ conditions. He was allowed a 10 minute private viewing, what more does one need!! Your nit picking is just rediculous. I don’t think the catacomb frescos show any ‘discernable’ Vignon markings to tell you the truth and I have studied them closely. The parted hair and some facial similarities may occur, but not much of anything in the sense of the Vignon markings. The similarities could simply be due to Jesus’s appearence being brought down through word of mouth, nothing else. Furthermore these catacomb depictions were not wide spread and it is very unlikely many people would be viewing frescos painted deep in the catacombs, very unlikely! Most all ‘wide spread’ renditions of Jesus up to the 6th century were still of a youthfull appollo type figure. Therefore, I don’t agree Wilson’s hypothesis is put in jeopardy whatsoever. R.","date":"2012-09-29","mins":"11:18 am","url":"https://shroudstory.com/2012/09/22/stephen-jones-is-up-with-part-10-of-his-critique-of-charles-freeman/","cat":"history","title":"Stephen Jones is up with Part 10 of his critique of Charles Freeman"},{"id":"comment-17090","author":"ron","post":"Lyfe :Stephen Jones ,in the posting above, includes the Christ Pantocrator from Sant’ Apollinare Nuovo in Ravenna. According to the Sacred destinations description this is dated to c. 500. So Jones accepts that the Vignon markings are in place by then which presumably fits with his fourth century date for the copying. Does Wilson include this image among his own study of the subject as one of those influenced by the Shroud? First of all, Vignon was studying these ‘markings’ WELL before he viewed the Shroud, so it is a big yes to him knowing ‘exactly ‘ what to look for. So again I’ll repeat; only minutes would be required to substantiate his findings!…Furthermore; some of the markings are apparenttly from faults in the weave or banding or whatever, but not of the image itself! So they would be noticeable moreso then the image itself. So I see no reason Vignon should be questioned on this or his integrity questioned. Secondly; Stephen Jones is allowed his interpretations, just as well as anyone else, but I think you may be wrong in what he concluded from the Christ Pantocrator in Ravenna which is ‘actually’ dated as late as 547 ad. Which puts it right inline with the discovery of the cloth in Edessa. So not the 5th century but the mid 6th. There are no renditions of Christ before this period which contain ‘discernable’ Vignon markings to my knowledge. R.","date":"2012-09-30","mins":"7:51 pm","url":"https://shroudstory.com/2012/09/22/stephen-jones-is-up-with-part-10-of-his-critique-of-charles-freeman/","cat":"history","title":"Stephen Jones is up with Part 10 of his critique of Charles Freeman"},{"id":"comment-17111","author":"ron","post":"YC; “Because we know for a {fact} that the Christ in Majesty of Ravenna (which is possible the artistic ancestor of the Pantocrator icons) was made BEFORE the apparition of an image “not made by human hands” in Edessa” {parentheisis mine}. Yannick you should really be more careful with your word choices. There is ‘absolutely’ no FACT in what you say. Lyfe; “Yannick. I think {everyone is agreed} that the Ravenna Pantocrator was made before Wilson says that the Image of Edessa was discovered in the wall in Edessa.” {parentheses mine} Who is everyone? You and Yannick, LOL. I think the both of you need to give yourselfs a good smack upside your heads. Both of you have come to your own conclusions, through a s*** load of speculation, to put it mildly! As to the dating of the Ravenna pantocrator; It could be hypothesized, that it could date even later then 547! As it was never established ‘conclusively’, it was created by the so called “Master of Sant Appolinare”. This was just speculation and conjecture…It is just as ‘likey’ the mosaic which is of a ‘Byzantine style’ was created years later, after Justinian I had secured Italy into his empire. Lets not forget it is well agreed that it was Justinian I who in ‘most likelyhood’ commissioned the making of the Pantocrator image and had commissioned the one at St Catherine’s in the Sinai, at relatively the same time period…Is this scenario speculation? Absolutely yes, but more logical and plausible then scenarios put forth by the two of you. Oh and by the way Wilson’s hypothsis to the dating i.e; ‘discovery’ of the Edessa cloth? He states in his book; sometime between 503 and 544, whether you want to believe his sources or interpretations are correct or not Yannick. So even if the Ravenna pantocrator was created in 526, it would not dispell Wilson’s hypothesis. R.","date":"2012-10-01","mins":"7:44 am","url":"https://shroudstory.com/2012/09/22/stephen-jones-is-up-with-part-10-of-his-critique-of-charles-freeman/","cat":"history","title":"Stephen Jones is up with Part 10 of his critique of Charles Freeman"},{"id":"comment-17116","author":"ron","post":"CF; “So why not accept the opinion of the experts that it is probably c. 500?” – …For one, the experts may be wrong and their ‘reasoning’ is simply speculation. Two, it seems more likely from the artistic style of the fresco, it is strictly Byzantine in origin. Also for reasons already mentioned, it seems more probable to be of a later date; i.e; 526 or possibly later as in 547? R.","date":"2012-10-01","mins":"10:10 am","url":"https://shroudstory.com/2012/09/22/stephen-jones-is-up-with-part-10-of-his-critique-of-charles-freeman/","cat":"history","title":"Stephen Jones is up with Part 10 of his critique of Charles Freeman"},{"id":"comment-17042","author":"ron","post":"Apparently Vignon did view the Shroud ‘itself’ in 1933, in normal interior ‘light’ of the cathedral, and at very close quarters for several minutes, plus he viewed the Shroud “outside” in daylight. A commentor asked the same question on Stephen Jone’s part 10 of his Freeman critique. Best go there for a more detailed answer. The markings then, it appears, can be seen on the Shroud itself when viewed in real life circumstances and not just from contrast enhanced photos. This apparent fact gives much credence to artists of the past abilities to see and copy these markings in thier paintings. It just dawned on me that Barrie Schwortz had extensive viewing of the Shroud in ’78 at very close and variable ranges. I wonder if Barrie can chime in on here about these markings! Now I wouldn’t expect he was looking for these in particular throughout his time there, but maybe he may have noticed them? It was also along time ago and maybe doesn’t remember. But I would be interested in Barrie’s thoughts on this, if any. R.","date":"2012-09-28","mins":"11:16 pm","url":"https://shroudstory.com/2012/09/22/stephen-jones-is-up-with-part-10-of-his-critique-of-charles-freeman/","cat":"history","title":"Stephen Jones is up with Part 10 of his critique of Charles Freeman"},{"id":"comment-17119","author":"ron","post":"I need to add; That personally, I would suspect a later production date, later then 547, possibly 554? R.","date":"2012-10-01","mins":"10:27 am","url":"https://shroudstory.com/2012/09/22/stephen-jones-is-up-with-part-10-of-his-critique-of-charles-freeman/","cat":"history","title":"Stephen Jones is up with Part 10 of his critique of Charles Freeman"},{"id":"comment-39066","author":"ron","post":"Lets try putting ourselves at the crucifixion, and also using the biblical narrative descriptions. Jesus’s body would undoubtedly be covered in blood stemming from the many tortures he received, (this would be undeniable). Jesus hung on the cross for hours and according to scripture a storm brewed up. If we take that into account plus the fact that Jesus’ body would have been left on the ground for a short period of time, he would undoubtedly be covered in dirt. Especially since the dirt would ‘stick’ to the damp, sweaty, bloodied body….Where is all this dirt? It is not evident on the Shroud. Wouldn’t it be mixed in with the blood?…From this single undeniable fact, I think it is pretty certain the body was ‘partially’ washed. Jewish customs of the time did not allow the washing of ‘life blood’ from the body but did so for other blood. The blood soaked cloths used during the cleansing would be left with the body as all blood must be buried with the body according to custom. R.","date":"2013-07-16","mins":"9:45 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series"},{"id":"comment-15618","author":"ron","post":"Sorry Lyfe but your NOT getting the point, first of all I don’t think Yannick has in any way refutted any of Wilson’s arguments. Many of his points have been argued, quite well and clearly by several here. Problem is, he just tends to ignore these arguments and repeats his issues over and over again. Example; he is still arguing the point about the eyes being ‘open’ and of ‘no blood shown on the copies of the Edessa cloth’?? …these points have been nullified easily more then once, yet he still sticks to them. Most all of his other arguments have been delt with all the same, some have been ignored because they are just too rediculous. But the MAIN point here is Yannick’s obvious vendetta against Wilson and his total lack of respect shown for the man!. Despite the fact that Wilson is one person who has done a great service to the popularity of the Shroud the world over, and of it’s many qualities and yes of it’s probable history. Wilson’s hypothesis may not be perfectly substantiated, …even IF someone PROPERLY refutes his work, he should always be shown RESPECT. This I’m afraid Yannick does not understand. Furthermore, Yeannick tends to judge Wilson incorrectly, as from what I gather, Wison is quite open to critisizm and has in the past openly accepted other different views to his hypothesis. Example; to the very early years of the Shroud’s existence and it’s possible location; Antioch vs. Edessa. Whether one agrees with his ideas or not, respect is still warranted and moreover, what Stephen Jones may say or do on his blog has absolutely no relevence to how Wilson should be treated. R.","date":"2012-08-30","mins":"9:14 am","url":"https://shroudstory.com/2012/08/23/scholarly-incompetence-or-dishonesty/","cat":"history","title":"Scholarly Incompetence or Dishonesty?"},{"id":"comment-39081","author":"ron","post":"Your assuming a storm brewing up indicates or supposes rainfall, not necessarily. Ever experience a storm comes in, the skies darken making it seem like night and the winds gust strongly for a short period, yet no rain fall? I have plenty of times in my life… I don’t believe the scriptures mention rain and one of our recently not active bloggers here, also suggested it may have been a sand storm, which apparently the area of Jerusalem was once known for getting hit with once in a while. R.","date":"2013-07-16","mins":"3:57 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series"},{"id":"comment-16380","author":"ron","post":"Firstly, I see no issue with Mr Jones interpretation of the folding. Desperate? Convoluted? Unnatural? ..Why? …It seems to me it would have been paramount during the folding to keep the face image ‘on top’ in every folding, and Jone’s fold interpretation definately does so, and it also works! It isn’t my interpretation of the folding mind you, but I can’t deny it works. Second; You need to get your head out of the sand when it comes to the radiocarbon dating. A radiocarbon (testing), on it’s own is ‘USELESS’, as all pertinent evidence must be weighted. A multiple of tests need to be performed even before a radiocarbon testing can be done, as should have been done before the 1988 testing, but dropped. One should remember the Shroud has been exposed to so much contamination over the centuries, it may not be possible to achieve an accurate test result! It’s not like it was sealed in a tomb for 2000 years, and even in that case, still erroneous results appear periodically. R.","date":"2012-09-17","mins":"4:24 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16418","author":"ron","post":"Matthias :I don’t really want to waste my time explaining why Mr Jones’ folding example is a joke.The original doubling of the shroud three times as shown in Dan’s images makes total sense, including keeping the face on top, even if it is 3 doublings rather than 4. Jones’ folding example just doesn’t look credible , in particular the “second doubling” which is not actually a doubling, it’s a kind of fold over back on itself.I of course did not imply that the dating would be done without all the necessary qualifications and assumptions Why waste your time even commenting then? Tetradiplon simply means a cloth folded in four or doubled in four…How this doubling is achieved is not of relevance really aslong as there has been four doublings and not neccessarily the whole cloth must be doubled in each fold…get the point? So it must be folded 4 times to give us ‘doubled in four’. Wilson’s depiction is in error, if one is to stick to the essence and the meaning of Tetradiplon. Furthermore for those who think tetradiplon can mean many things; you are wrong, there is only two possible translations as mentioned above. R.","date":"2012-09-17","mins":"5:42 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16413","author":"ron","post":"I don’t hear any “good and Intelligent” arguments from you, … especially intelligent. As Daveb described in his post, I hear only “endless repetitions and regurgitations..” Seriously do you Yannick or Charles actually ‘listen’ to other people’s counter points and arguments? It seems to me you both don’t and that it goes in one brain cell and out the other. Everyone of your points have been addressed, but you are too blind in your own prejudace against Wilson to see it. Please reflect on that..","date":"2012-09-17","mins":"5:28 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16421","author":"ron","post":"Furthermore to Matthias’s last comment and to the Radio Carbon Dating; You seem to misunderstand my point and the FACT that radiocarbon dating, even if all precautions are followed, can still give erroneous results! Especially when the provenence of an article is ‘unknown’, as is the case with the Shroud. R Cdating alone cannot and should not EVER be relied upon as a reliable final conclusion. This huge mistake was made back in 1988 89 and people fell for the media hype on the reliance of Radiocarbon dating….Lets not fall for it again. I truly believe, the Shroud is far too contaminated to be reliably tested, at our current level of technology. Not all probabilities of contamination can be addressed or even contemplated and although AMS type radiocarbon dating has seen improvements over the years, it is not so with contamination issues. R.","date":"2012-09-17","mins":"6:01 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16423","author":"ron","post":"This is very true Max, and something else must be understood; These four foldings do not necessarily need to be of equal length foldings…I believe we both touched on that Max, in the last discussion on the tetradiplon issue. R.","date":"2012-09-17","mins":"6:13 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16486","author":"ron","post":"Said as he puts foot in mouth ; P R.","date":"2012-09-18","mins":"6:09 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-17963","author":"ron","post":"Problem with early Christian martyrs striving for higher congruence has several problems, for one; Would they have known exactly how or where wounds were applied?, …this information is not exactly clear in scriptures. This hypothesis assumes ‘staging’, what persecutor would bother to go along with the scenario? i.e; excessive scourging, lance to the side, no breaking of the legs etc; One would need to assume someone would then purchase an expensive burial Shroud to wrap the victim in, …for what reason? Then assume they would have to have the knowledge of exactly how long to keep the body enshrouded to achieve an image, if that was the goal. To think that was not the goal, then why would the body be removed from the burial cloths at all? Now if one can believe firstly that a martyr would be given any special treatment by the Romans or Jews or whomever in this extreme manner is simply rediculous. R.","date":"2012-10-21","mins":"4:12 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","title":"The Central Dilemma of the Shroud?"},{"id":"comment-17599","author":"ron","post":"Carpet salesman? …Well I’ll take that over Pompous Lackey anytime, oh sorry I meant sycophant. Goodbye and Good riddance…No tears now, okay. R.","date":"2012-10-13","mins":"5:27 pm","url":"https://shroudstory.com/2012/10/13/the-beast-is-sindonology/","cat":"history","title":"The beast is ‘sindonology"},{"id":"comment-39139","author":"ron","post":"Read the scriptures closely, and an ‘infected scourge wounds theory’, although I’m not refuting it completely, is not necessary to explain why there would be so much blood still present from the scourge wounds; The Roman soldiers after they had scourged Jesus had mocked him as being the ‘ King of the Jews’, by placing a crown of thorns on his head and a article of clothing over his body (and his fresh wounds). When they reached the cross some time later, they pulled this cloth off his body. Pulling this cloth off the body would have undoubtedly opened up many of the wounds again. Maybe not all, but many. ” Re opened” wounds tend to take forever to close up again or to stop oozing, in my experience, and is a simple answer to all the blood or exudate of blood found from the scourge wounds. Like David Goulet mentioned above, I like the idea of God sending rain to cleanse the body of Christ, but, it would not explain the absence of dirt on the body by the time they had reached the tomb! If we take the studies on the Sudarium somewhat, and scriptures into account, and maybe a little common sense, Jesus hung on the cross for some time ‘after death’ and before taken down. He was then laid on the ground for a period of time, (possibly in the removal of the nails and/or from the cross). They did not have cobblestone or tiled ground, it was dirty/sandy or possibly muddy ground! He would have been covered in a excessive amount of dirt with no doubt. Enough dirt to cover most, if not all the body. Hence I still believe a ‘PARTIAL’ washing is evident. Washing does not necessarily mean scrubbing/ wiping, washing would have been a delicate procedure of ‘dabbing’ with a wet sponge or other cloth, which would be essential if trying to avoid lifeblood in the procedure. This could account somewhat for the dampness which existed within, once the body was enshrouded, especially since time was of the essence and the body would not have had time to dry. R.","date":"2013-07-17","mins":"2:43 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series"},{"id":"comment-17920","author":"ron","post":"I think the quote by John Walsh says it all. Moreover, we now know most definately, this Shroud image was not the work of a forger or the work of an artist, since all scientific evidence goes against it being so, especially the chemical, blood and 3 D encoding evidence of the image. So what are we seriously left with? …The possiblity that someone else was crucified and tortured in the ‘exact’ same manner as Jesus of Nazareth and somehow this victim’s image was impressed on the cloth, and then someone decided this obscure victims burial cloth must be saved for posterity? This notion is so preposterous, it makes me laugh. The chance of this Shroud image being of ‘anyone’ other then the historical Jesus has been calculated, several times no less, to be in excess of 83 million to one! Now if you consider over the span of centuries where crucifixion was actually performed, the numbers would be maybe in the few million victims?…and that is being generous, the odds go much higher. Seriously, anyone who can postulate this ‘someone else’ theory, should have their head examined. R.","date":"2012-10-20","mins":"5:49 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","title":"The Central Dilemma of the Shroud?"},{"id":"comment-17928","author":"ron","post":"Gab, you are forgetting that this Shroud and it’s Image dates well before the 15th century, which would eliminate any real or mocked crucifixions you mention. I don’t know about the realism of the Phillipine mock crucifixions either. I’ve viewed several videos on the practice and the scourging is very minimal, they don’t use vicious weapons as the flagrum and they nail thru the most soft areas of the flesh of the palms to cause very little damage, Hense not much coincidence too what we see on the Shroud..","date":"2012-10-20","mins":"10:29 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","title":"The Central Dilemma of the Shroud?"},{"id":"comment-17962","author":"ron","post":"Not really, Jesus was a Nazarene, hense known for their long braided hair styles. Beards were also the norm for Jewish men. R.","date":"2012-10-21","mins":"3:52 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","title":"The Central Dilemma of the Shroud?"},{"id":"comment-17964","author":"ron","post":"One major point everyone with their possible ‘someone else’ scenarios seem to be forgetting; This point has been scientifically observed by the way, and not assumed; The blood markings on the Shroud SHOW NO SIGN OF DISTURBANCE! Simply meaning there is no evidence of the Shroud being removed from whatever surface caused the blood stains! No signs it was ‘lifted’, ‘pulled’ or simply that it had ‘fallen’ away, no sign whatsoever! How does one explain this scientific observance, if any of the ‘someone else’ scenarios are proposed? R.","date":"2012-10-21","mins":"4:47 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","title":"The Central Dilemma of the Shroud?"},{"id":"comment-17960","author":"ron","post":"Why don’t you try contacting Mr. Walsh and asking him directly? This is simply hearsay, but even if he does believe as so now, it does not change the logic of his statement quoted above, now does it? R.","date":"2012-10-21","mins":"3:45 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","title":"The Central Dilemma of the Shroud?"},{"id":"comment-10758","author":"ron","post":"Colin’s mis interpretation of many of the symbols seen on this metal just goes to show my several previous comments that maybe a new pair of glasses are warranted is correct ; ) Blood stains turn to chains, firm body features turn to armour, etc; etc; yet clues such as herringbone weave, the naked body, the flagrum, the nails, the tomb seem to disappear in his analysis. It has been stated that the medalion was most evidentally created whilst de Charny was still alive and as the Lirey expositions were ongoing, this conclusion comes from the depiction of the coat of arms and their ‘specific’ positioning. This was covered in detail in Wilson’s latest book The Turin Shroud and backed by others. So the medallion would be pre 1356. Medallions were common place among pilgrims in the middle ages and apparently it was good luck to toss them into waters, hense the finding of this medalion in the siene river. Ron.","date":"2012-04-23","mins":"3:11 pm","url":"https://shroudstory.com/2012/04/23/the-cluny-medal-with-shields-of-geoffrey-de-charny-and-jeanne-de-vergy/","cat":"history","title":"The Cluny Medal with shields of Geoffrey de Charny and Jeanne de Vergy"},{"id":"comment-27678","author":"ron","post":"First time I viewed the Pray codex and the scene discussed here, I just had a instinctive feeling the ‘a’ simply symbolised ‘alpha’ and noticing the angel pointing directly to the alpha meaning, he has told the visiting ladies that the Lord is not here, that he has risen i.e a new beginning. Ofcourse this is just my interpretation with no scholarly works to back it up, but as I said it simply struck me as it’s pretty clear meaning….nothing hidden or secret. I believe in many cases people try to read too much into things. Remember Jesus’s words; “only thru the eyes of a child”. R.","date":"2013-03-18","mins":"2:55 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","title":"The Curious ‘a’ in the Hungarian Pray Manuscript"},{"id":"comment-17934","author":"ron","post":"He is laughing at our errogance. Anyone ever notice, when scientists, ‘the brains of our world’, discover one new thing on the Shroud, it just raises more questions and it always opens doors to several other possibilities? I believe this Shroud is so far ahead of our understanding, that we will all be gone and it’s mysteries will still persist, …even to future generations. R.","date":"2012-10-20","mins":"11:17 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","title":"The Central Dilemma of the Shroud?"},{"id":"comment-17932","author":"ron","post":"Or even know what one was! According to archaeologists,the flagrum and it’s use disappeared with the Roman empire in the early centuries, possibly up to the mid 4th century. R.","date":"2012-10-20","mins":"11:04 am","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","title":"The Central Dilemma of the Shroud?"},{"id":"comment-27697","author":"ron","post":"So Max are you implying the pray codex was written in Mark’s time? LOL, think about it Max, why would a mong place a lowercase ‘a’ right in the focus of a picture if it was to be a secret code. You mnay be a cryptologist, but I think you ‘may’ be putting just alittle too much into it. R.","date":"2013-03-18","mins":"5:40 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","title":"The Curious ‘a’ in the Hungarian Pray Manuscript"},{"id":"comment-27701","author":"ron","post":"Sure! It doesn’t matter if it’s lowercase or uppercase the message is still understood, as evidenced by several here interpreting it as such, and many others, no doubt. Secondly the alpha being alone without the omega implies the ‘beginning’ of a new era. So why would one need to add the omega? Seems reasonable to me, without putting too much into it…Ofcourse that is simply a humble laymen’s perspective. R.","date":"2013-03-18","mins":"5:49 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","title":"The Curious ‘a’ in the Hungarian Pray Manuscript"},{"id":"comment-27698","author":"ron","post":"Sorry typing error; sb; why would a monk place a lowercase ‘a’ right in the focus….","date":"2013-03-18","mins":"5:42 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","title":"The Curious ‘a’ in the Hungarian Pray Manuscript"},{"id":"comment-13600","author":"ron","post":"Well as been stated before on here; Wilson is not actually an historian, but a very good investigator/researcher, writer and learned pupil of historical procedures. Plus he gets alot of help from actual historians/scholars etc;. One needs to keep in mind his hypothesis is just that, an hypothesis, not a list of facts. People have the right to dissagree with him but when people try to totally disregard his complete work; as in making statements like; “His whole hypothesis is like a deck of cards…” , I tend to stop listening to thier argument at that point. I also agree Wilson has done an incredible job in bringing the Shroud mystery out to the masses and should be respected for that and his work. R.","date":"2012-07-07","mins":"10:24 pm","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","title":"The Shroud of Turin: A Modern Relic Cult?"},{"id":"comment-13610","author":"ron","post":"Thanks for the info. I have read Prof Pfeiffer’s paper and others but not Prof Jaworski’s. So what you are talking about here is what is also known as the ‘Veil of Manoppello’, …correct? Your statement that Wilson overlooked that both Yeshua’s burial cloth (the Shroud?) and the Byssus face veil (Vof M?) can be folded four/four times (doubled in four?) onto themselves, needs clarifying also. Are you talking about Wilson’s Tetradiplon (doubled in four) hypothesis? Because if you are, I would say there is no problem! As Wilson’s hypothesis states and has been shown (technically), and most probable, that the Shroud can be folded in this way and show the complete face image, impossible to do so with the Vo M or anyother veil being held anywhere. As for the Vo M I for one do not believe it is authentic and most likely a medieval work of art. Mind you an incredibly ingenious one! Reasons being that pigment, or what appears as pigment has been found on the image areas, and yes I am aware of some touch ups that have been found, but these are a different issue. Secondly, and this is strictly my laymen’s opinion; Looking at the Vo M image just seems to me to be not a natural image, but an artist’s rendition. This seems quite obvious to me and I’ve contemplated the image thoroughly, viewing may photos of it, but I have never had the pleasure to see it first hand. R.","date":"2012-07-08","mins":"3:23 pm","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","title":"The Shroud of Turin: A Modern Relic Cult?"},{"id":"comment-13602","author":"ron","post":"I recant part of my statement above as apparently, as I decided to read Wilson’s bio, he did manage a degree in History. Not sure if that actually classifies him as an historian though. R.","date":"2012-07-07","mins":"10:51 pm","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","title":"The Shroud of Turin: A Modern Relic Cult?"},{"id":"comment-13601","author":"ron","post":"Max, when you say Byssus face veil what exactly are you talking about? Can you post a link to this veil? Thanks, Ron.","date":"2012-07-07","mins":"10:28 pm","url":"https://shroudstory.com/2012/07/07/the-shroud-of-turin-a-modern-relic-cult/","cat":"history","title":"The Shroud of Turin: A Modern Relic Cult?"},{"id":"comment-27985","author":"ron","post":"Hoevan’s theory has holes in it. One: It is clearly stipulated in the Gospels that Jesus was wrapped in a ‘clean’ cloth. If it had been worn “by the young man who ran away naked”, it would definitely not be considered clean. Two: Hoeven mis identifies the Shroud as the napkin which had been rolled up by itself in the tomb….next theory. I don’t agree fully with Jacksons’ hypothesis of the Shroud possibly being a table cloth for the same reason as mentioned, that it would not be a clean cloth,…but I am not ready to totally dismiss it either. One really needs to ask the question; Where did Joseph get the sheet on the dawn of the Sabbath? He couldn’t buy it, all shops would be closed. Was it actually a burial sheet or something else? It seems a little extravagant for a burial sheet and especially as it is written that Jews of the time should be buried in a simple garment. Nothing extravagant. Thoughts?… R.","date":"2013-03-21","mins":"2:30 pm","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","title":"Was the Shroud of Turin a Tablecloth?"},{"id":"comment-7888","author":"ron","post":"“why are there traces of vermillion and madder on the cloth in sufficient concentrations to produce an image using medieval technique of grisaille”… Where does he get this information from? …This statement is a complete misintepretation of facts and has been completely ‘made up’ to mislead, as no such thing has been found. Your right Dan, those statements do not need addressing, instead for mention of most all being in complete error. It’s a shame such misinformation permeates the internet. R.","date":"2012-02-03","mins":"10:34 am","url":"https://shroudstory.com/2012/02/03/was-bad-archaeology-fooled/","cat":"history","title":"Was Bad Archaeology Fooled?"},{"id":"comment-14325","author":"ron","post":"Haha yes! maybe into a movie also; “Indiana Jones and the quest for the Shroud”, lol…. Anyways, I have seen a documentary on the History channel on the Spear of Destiny. The Nazis actually confiscated it from the museum in Vienna during the war and because so, the Shroud had been moved and hidden for that specific reason mostly, and most likely also for protection from bombing. I wish I could remember the name of the documentary as it was very interesting and went pretty deep into scientific studies on the spear, which apparently has a nail (presumably from the cross) incorporated into it. But more intriquing; they found at the base of the lance the Christian fish symbol etched into it. Unfortunately no c14 dating was allowed and the museum unbelievably had cleaned the lance in the early 70’s basically making it impossible to actually study it in more depth..","date":"2012-07-30","mins":"10:00 am","url":"https://shroudstory.com/2012/07/30/why-was-the-shroud-hidden-in-a-monastery-during-wwii/","cat":"history","title":"Why was the Shroud hidden in a monastery during WWII?"},{"id":"comment-28007","author":"ron","post":"Daveb; “I think Hoeven makes a credible case for it being a temple garment.” …Actually I don’t believe he does. I remember reading, (Don’t ask me where, I can’t remember), but trust I am not making it up, that temple garments were adorned along the edges with a “blue?” stripe, designating one of the temple…Where is this adornment on the Shroud? R.","date":"2013-03-21","mins":"6:43 pm","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","title":"Was the Shroud of Turin a Tablecloth?"},{"id":"comment-13223","author":"ron","post":"You forget Menedemus that even most all of the Byzantine scholars, themselfs are at odds with much of the interpretations…So your point is mute. Wilson on the other hand, doesn’t need to understand Byzantine Greek as he uses Byzantine scholars to do this work, …again your point is mute. One does not have to be an historian or a scholar to understand simple things like why the Shroud of Christ ‘IMAGE’ was not mentioned in scriptures or by early church fathers, atleast not openly mentioned. One also does not need much of a brain to understand why the Image of Odessa showed an ‘alive’ eyes open Jesus; Have you looked at the Shroud face image in natural form lately? It could easily be misinterpreted that the eyes are open or the blood traces NOT recognized as blood at all. The article above claims, in so many words, that the science put forth by many of the STURP scientists is “pseudoscience”, funny how peer reviewed papers are so easily dismissed as pseudoscience in this case. What about the pseudoscience of the c14 dating? It wasn’t even properly peer reviewed, yet the anti shroud crowd will use it as if it was carved in stone, plus I know of no scientists or peer reviewed papers written that oppose the so call pseudoscience peer reviewed papers, put forth by STURP….It appears to me, the “anti Shroud crowd” seem to be edging ever so close too hypocrisy. R.","date":"2012-06-30","mins":"1:07 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"id":"comment-13272","author":"ron","post":"Menedemus :Ron. ‘Wilson on the other hand, doesn’t need to understand Byzantine Greek as he uses Byzantine scholars to do this work, …’Well ,so long as no one takes him seriously as an original scholar and he does not distort or misrepresent what the scholars actually say that is fine. But I have yet to hear of any Byzantine scholar who endorses his view that the Shroud of Turin is the same as the Image of Edessa. The problem is that be seems to go far beyond the cautious findings of Byzantine scholarship and develops theories largely on his own initiative. Ron : “One does not have to be an historian or a scholar to understand simple things like why the Shroud of Christ ‘IMAGE’ was not mentioned in scriptures or by early church fathers, atleast not openly mentioned.”I beg to differ, Ron. These seem to be to be very complex scholarly issues the world of early images, as no doubt you will know from your close reading of the work of Hans Belting is a very difficult area. I don’t think the ‘anti Shroud community’ as you persist in calling them, insist that the Carbon14 dating is carved in stone. Most of them are independent scholars and have the natural caution of scholars. A typical position might be be that a medieval dating (perhaps some decades earlier than 1250 if there was genuine contamination that affected the date) is the most likely possibility but needs further work on it. As I understand Christopher Ramsey from Oxford ,et, al, it is that there is enough debate to justify a re resting but Ramsey still, as I understand it, thinks a medieval date will be the result again. The issue rather is that no one has come up with any evidence that a renewed Carbon 14 dating is likely to come up with a first century dating.Until they do, a preferred date somewhere in the Middle Ages is likely to have most of the scholarly consensus, not because these scholars are rabid atheists but because they are scholars working on the balance of probabilities from the evidence they have. The ‘Wilson’ hypothesis is one thing, but don’t go talking crap with the c14 dating. YES the anti shroud crowd take the c14 results as if they were FACT or written in stone, otherwise there would be very few arguments over the Shroud. I could care less what Prof Ramsey has to say has he was part of the original c14 fiasco, why would anyone take his word for anything? You should study radiocarbon dating and the method followed during the 1988 testing in depth, especially if you re iterate comments as in; “but Ramsey still, as I understand it, thinks a medieval date will be the result again” and “Balance of probabilities from evidence they have” ..What evidence? A screwed up C14 dating? Sorry but the balance of evidence from all reputable studies points this Shroud in the early period of the first mellenium, not Medieval…This ‘other evidence’ is a factor C14 bandwagon folk have dismissed blindly and any scientist or archaeologist in particular would agree is not proper science. R.","date":"2012-07-01","mins":"8:54 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"id":"comment-13271","author":"ron","post":"On the contrary Menedemus, de Clari’s description is very telling whereas “the Sindon is raised showing the “figure” fo our lord. Figure being an interpretation argued but in all likeliness correct, meaning it was a full body image. Fold marks found using raked light by Dr Jackson et al, have basically shown to little opposition that the Shroud had been raised on a ‘platform’ showing most probably from the waist up. I don’t recall anyother burial cloths being mentioned in Constantinople at the time or specifically in the Pharos Chapel. But if there was, a figure was not mentioned, except possibly the face image on the Mandylion, which by the way no one had mentioned seeing, only the box in which encased it.I won’t argue there may have been several other cloths pertaining to the lord, but what were they? No mention is clear. R.","date":"2012-07-01","mins":"8:33 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"id":"comment-13295","author":"ron","post":"H but the description that it was ‘raised’ and the term ‘figure’ implys a full body image, not just a face…these were my points. If you had understood that with the mention of the raking light evidence then you would understand the point I was making. Basically de Clari was looking at a full body image period. R.","date":"2012-07-01","mins":"9:11 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"id":"comment-13296","author":"ron","post":"If one accepts the reality of all scientific evidence showing that a actual body was enfolded in the Shroud, and this is quite evident and deduced by many forensic experts and other scientists, I will assume you’ve done your reading and know of whom I speak here. With that in mind; The fact that the victim of the Shroud was crucified in the Roman style, places the victim and Shroud before 340 AD when crucifixion was abolished. (Unless you want to believe some artist first tortured, then murdered a victim and showing absolute forensic knowledge of Roman crucifixion and a method of tranference to the cloth, still not understood by some of our best scientists). The stitching on the seam of the Shroud matches almost exactly to stitching found in Masada 70 AD and a rare form of stitching to boot. The weave or better stated the style in which the Shroud was weaved is from pre medieval period loom manufacturing, definatley not medieval. Cloth fibrels found by one of the c14 labs whilst doing their preliminarys, specific to very early first mellenium Syrain/Egyptian cloth…There is other evidence found on the Shroud but is controversial amongst the experts, but which can place the dating much more accurately and also place (pin point) it’s origin, but I’ll sit tight for now. R.","date":"2012-07-01","mins":"9:40 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"id":"comment-13343","author":"ron","post":"Well whomever did that study is in contrast to most known attributes of linen, ‘flax’ fibrels, and does not offer a reasoning for linen found outside of Egyptian tombs dating 8000 BC and 13000 BC still intact, amongst others. But also proves suspicious as in it is well know ‘scientifically’ that linen is very well NOT suseptible to bacteria, on the contrary it is very well known to fight off bacteria, microorganisms repell insects…So I find that report suspiciously ignorant of known facts. Also it does not deal with well preserved samples, as in encased…..plus the big zinger, yes the Shroud is here and tangible, and atleast 700 years old, how can that be argued….That report is nonsense, period. R.","date":"2012-07-02","mins":"5:46 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"id":"comment-13336","author":"ron","post":"There is no problem here. As I mentioned; other evidence (although argued evidence) can place this Shroud in Jerusalem, in tombs surrounding Jerusalem, in particular, basically dating it definately before 69 70 AD, the fall of Jerusalem to the Romans and apparently the end to Jewish tomb burials in Jerusalem till centuries after. There is also evidence which can place this Shroud tentively between 28 36 AD. But one must except this evidence. It is obvious more needs to be researched and studied at this point, and there may still be much to be discovered. Your “problems” with the conservation of the Shroud for millenia is in total error, obviously from a total ignorance of linen, as in it’s known endurance and longevity. You should really study on this wondrous material called linen and it’s attributes. If any garment material is too last 2 mellenia it is linen! Especially if encased and cared for, for the most part. Linen “completely unprotected” from the elements has been found in caves dating 15,000 years old, fibrels still intact! Linen will not suffer from insect infestations, linen actually becomes stronger when damp, linen can dispell water and comdensation readily…and on and on…There is a reason linen is the oldest of processed materials ever found, it is simply because it is one material of extreme endurance. Now consider this Shroud being encased for most, if not all of, it’s duration in hardwood caskets…it is not a mystery how it could last till today and in prestine condition. R.","date":"2012-07-02","mins":"4:16 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"id":"comment-13783","author":"ron","post":"Sorry I didn’t get back earlier, I am very busy as late. Furthermore, I don’t have the time to be linking much at the moment but a serious search on your part, yes on the internet, and you will find most if not all of what I mentioned. Quit easily I would add. Thank you R.","date":"2012-07-12","mins":"2:28 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"id":"comment-13380","author":"ron","post":"“Don’t argue because they primarily deal with underwater finds” ??? LOL. What a preposterous statement. How can you or anyone compare finding ANY element underwater to elements found on or in earth? LOL. Solid oak timbers, most metals etc; will dissolve under water after two thousand years, and we are talking linen here. Please lets keep this reasonable. Again if linen is so susceptable to the elements how does one explain the Shroud, even if one accepts the erroneous C14 dating, taking it back 752 years? Again maybe YOU should study up on flax/ linen and not depend on studies by underwater reasearchers. Did you know the Ancient Greeks used linen as body armour and several samples have been found buried in earth and still intact!. R.","date":"2012-07-03","mins":"7:06 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"id":"comment-10731","author":"ron","post":"I noticed Charles you have raised this point atleast twice now i.e.; “the problem of damp” and “longevity” of linen cloth. Let me enlighten you to some facts about linen… It is widely known that; Linen is stronger wet then dry. Flax fibers and yarns increase about 20% in strength on wetting, resulting in greater longevity compared to most all other fabrics. Silica, present in linen flax fibrels protects linen from rotting. Linen is highly hydroscopic, meaning it is capable of absorbing moisture as well as dispelling moisture quite quickly. Linen is naturally insect repellant. Finally linen is ‘known’ for it’s “spectacular” durability. Linen samples are of the oldest of material fabrics ever found; 6000 year old Egyptian samples in almost prestine condition have been found. 8000 yr old samples in Peru. Linen fibrels found in a ‘cave’ in what is today Georgia dated “36,000 years old” still intact! …and many more examples. The Shroud we know, most definately, spent much of it’s time encased and very well cared for. So to think it could not survive 2000 years is simply unstudied conjecture to say the least. The ‘raking’ light photos of the Shroud and subsequent fold marks found and studied by Dr Jackson et al. Along with a working model of a lift built by Jackson et al, and most likely the same used in Constatinople to raise the Shroud each Friday, is near indisputable. As the ‘evidence’ points exactly to this, along with the equal folds found which show at one time the Shroud was folded in eight where the face alone would show and in a ‘landscape’ style, reminiscent of many artist depictions of the Mandylion or Image of Edessa….This is very strong evidence, which cannot be easily dispelled. From your last statement, it dawns on me that you may have never actually read Wilson’s books or better yet his most recent book on the Shroud, as it will cut your last statement to ribbons. Ron.","date":"2012-04-23","mins":"2:57 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10761","author":"ron","post":"You sure your reading the right book? The 2010 edition. Wilson definately does not base his hypothesis on the appearance of the Edessa cloth in the King Abgar story but more so on eye witness testimonies given whilst the Mandylion was present in Edessa. Or maybe your just reading what you want to read. Ron.","date":"2012-04-23","mins":"3:19 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10753","author":"ron","post":"Yannick Clément :Ron, have you read all my good arguments against Wilson’s hypothesis ? I still wait for you to challenge them !!! : ) Why should I bother? I have many times in the past you just ignore them…Read Wilson’s book thats all I say. Ron.","date":"2012-04-23","mins":"2:07 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10730","author":"ron","post":"Yannick, I wonder from much of the mis information you are babbling; Have you even actually read and more importantly ‘read carefully’ Wilson’s recent book The Shroud A 2000 year old mystery solved??? As many questions you ask here are answered quite satisfactory in his book. R.","date":"2012-04-23","mins":"2:21 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10763","author":"ron","post":"Let’s forget Wilson’s ideas about the C14 dating he is not a scientist but a historian, whom has done extensive study over the past 40 years on the Shroud. Pretty funny how people can read a few books and feel they have enough knowledge too totally dismiss Wilson’s hypothesis out of hand….what a joke, really. Charles if you are truly a scholar in any field of arhcaeology how can you accept, as easily has the so called scientists/historians the SINGLE sample test done in 1988 which by the way went against all other known evidence at the time? To me those in ’88 which claimed a 95% conclusion to the results should be dishonoured for their misleading results….period. Even anovice should understand their errors. Ron.","date":"2012-04-23","mins":"3:31 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10810","author":"ron","post":"Charles I was never questioning whether you were a scholar or not, to be fair you only mentioned writing some books and that you had some archaeological experience in the past. So on that information and knowing you should have enough knowledge, I asked you; How can you accept the 1988 radiocarbon dating conclusion without question? Forget Wilson, forget de Wesselow, How can you or anyone in their RIGHT MIND accept a c14 dating from a SINGLE sample, from a SINGLE section of a cloth, where the actual provenance of the sample is NOT known, where several BASIC c14 testing protocols were not met and the results contradicted most all scientific evidence already known?….That was/is my question…..So far no one can answer this and to me it is a mystery, if one follows scientific protocol why they would accept this dating,…simply, if one does, I say they are ignorant of the c14 process and it’s limitations. R.","date":"2012-04-24","mins":"9:23 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10811","author":"ron","post":"Charles, if the book you are reading is a 2011 edition, unfortunately I don’t have that one, my edition is dated 2010, and I can’t refer to it at present as I lent it to my sibling. Anyways if your looking for evidence of the Image of Edessa prior the mid to late 6th century…good luck. Before the mysterious appearance of the relic in 540, I don’t think there is any mention of it anywhere as it is speculated it was hidden/missing. One must look at it simply; A relic appears in Edessa after the flood of I believe 540 or so, proported to have an image of Christ and ‘not made by human hands’..okay simple enough, just decades or years later all depictions of Christ change to a bearded mustached, long haired Jesus, copies are made and sent all over the empire. These images ‘copied’ from this Edessa image match with dozens of points of congruenty to the Shroud we have today. How much clearer can the evidence be, that this Image of Edessa was the Shroud? I strongly believe one does not have to be an Art historian to understand this and silly questions like do you see any suffering on these images, are just rediculous childish, nonsensicle questions as most all renditions of Christ never showed suffering or blood…one must must be blind or stupid not to see this. I will attempt to check the reference you made above as soon as possible but my recollection of Wilson’s writings includes eye witness discriptions of the Image of Edessa having blood secretions from the head and side. R.","date":"2012-04-24","mins":"9:45 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10816","author":"ron","post":"It’s funny how people will SHIRK the question I raise by trying to twist the words into this being a conspiracy theory! By the way don’t you find it atleast ‘odd’ that they did not video tape the 30 or so minutes they spent in the ‘other’ room? LOL. There is alot more too it then you are aware. I’ll point you to some reading later… Furthermore, your answer or non answer to my question forces me to believe, no, I am 100% sure you understand very little to nothing about radiocarbon dating itself and it’s prerequisites in the scientific sense, or what transpired during the 1988 c14 fiasco and LIE!….When I mentioned provenance of the sample, I simply meant that they know very little of what conditions the sample or Shroud has been kept over it’s life, where and how it was stored etc;. A technician carbon dating a strip of linen from say an Egyptian mummy knows this sample has been in this spot since it’s use, this information is vital too c14 and it was/is definately unknown when we speak of the Shroud. Basically many of the ‘BASIC’ protocols or procedures to proper testing were not adhered too and even many of the actual scientists involved back then contested the decision to using only one single area/sample from the Shroud. Which would not be ‘representative’ of the complete Shroud….even Prof Gove!, co inventor of the AMS system. I strongly suggest you research radiocarbon dating in depth. To understand why I ask my question and why I am dumpfounded that people with much more standing then I, do not come forward and raise this same question. Suggested reading; Evidence is not Proof: A response to Prof Timothy Jull by Mark Oxley 2011*. Radiocarbon Dating the Shroud of Turn: The ‘Nature’ Report by Remi Van Haelst. Chronological History of the evidence for the anomolous nature of the C14 sample area of the Turin Shroud by Joseph Marino and Edwin Prior…There is also an addendom paper to this. These can all be retrieved from http://www.shroud.com if you like. Ron.","date":"2012-04-24","mins":"11:57 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10827","author":"ron","post":"Forgot to mention; If the Shroud came to Constantinople in the 3rd or 4th century, how do you explain no mention of it then? None whatsoever! Don’t you think the actual burial Shroud of Christ would warrant huge fan fare? There is absolutely nothing in historical writings or art to make any Historian think the Shroud was in Constantinople before 944. But we know almost for sure something with the impression of Christ on a linen sheet was brought to that city from Edessa in 944, as the king sent a whole army to get it…Oh and just so you know; the climate in Constantinople is a much damper local then Edessa, you should really check your facts before stating them. R.","date":"2012-04-25","mins":"2:58 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10818","author":"ron","post":"What worries me is the total idiotic statements like “Well the carbon14 tests proves it is only 700 years old, and why should I question the results” or ” Until someone can refute these tests, I have no reason to question the labs results” It is this total ignorance to the science that bugs me. Skeptics will question where Rogers got his samples and question his ‘PEER REVIEWED’ paper, twice reviewed! and there is really no question to the provenance of his samples if one to were to investigate further, atleast not less then the ’88 samples, but then in the same breath take the ‘Nature’ paper at it’s word…it’s so sadly wrong, it is almost laughable…get my point? If people understood RCD and all it entails they would not BLINDLY accept these tests….simple. I will read Klien’s article as you suggest and get back to you. Thanks, Ron.","date":"2012-04-24","mins":"12:52 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10841","author":"ron","post":"I wouldn’t call that even a ‘reference’ at all. It is just too far departed from the time in question. So basically it is not worth even mentioning. Fact is there is ZERO evidence the Shroud was tranported to Constantinople before 944 , period. R.","date":"2012-04-25","mins":"3:35 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10843","author":"ron","post":"I would disagree with you on some aspects; One; NO fanfare! Ridiculous! This would undoubtably be the most revered icon as it has the ‘imprint’ of the Lord Christ himself along with his blood! If it had been opened and they viewed the whole body, the image would be miraculous in their thoughts, easily far out weighting anything else they had, as there would be to them no question of it’s provenance, unlike the blood or the pieces of the cross whatever. Nevertheless one would think it would have been atleast mentioned somewhere. The Edessa route although not fullproof still has the most potential for being the more plausible route, remember the army sent to them and returned with what supposedly was the “face image only” of the Image of Edessa, but the same night of it’s presence in Constantinople it was described with blood on the face and on the side, in a sermon…a bit more tangible don’t you think? I also managed to skim thru alot of Klien’s writings and it gives me no incentive to believe the Shroud could have been one of the many supposed relics which Constantine collected. Furthermore, I see no reason to accept Klien as a better source then Wilson as they both seem to get their info from the same sources; writings and such are identicle!. Remember Wilson does not work alone, he uses many people ‘specialized’ in areas of study to confirm his writings, in most cases. Also I think Wilson has Klein beat by about 30 years in experience. Ron.","date":"2012-04-25","mins":"3:53 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10877","author":"ron","post":"I see you have been sworted by the same rediculousness known as Yannick…” (sweat comes from when you are alive, not dead)” I guess you didn’t understand. Look at the Shroud, many would say the image looks as if it could have been made by sweat, and without all the knowledge we have today of the actual image details that is quite a reasonable assessment. It is not too far fetched to believe that that is exactly what they “supposed” back then, hense thier ‘impression’ the image was made while Jesus was still alive. Get it? Also very few would have had access to the Shroud/Mandylion as it was mostly kept locked away and taken out very rarely. It is quite reasonable to state only the very highest in standing would ever view it close up and even fewer on the occasion when they opened the cloth completely to view it’s full image. We also do not know for sure the Mandylion was in the list of relics in 1204, this has been covered before and I won’t bother going thru it again. Infact most of the crap Yannick has been repeating here has been covered before and delt with by many here. He and now you his sidekick seem to just ignore alot of points made by others…been there, done that….ciao. R.","date":"2012-04-27","mins":"1:38 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10848","author":"ron","post":"Yannick, please take note of the image at the top of this page. Thank you. R.","date":"2012-04-25","mins":"5:24 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10844","author":"ron","post":"Oh Charles to your comment that the Mandylion was always described or ‘thought to have’ been an image of Christ while alive, is actually pretty weak, as it could simply have been misinterpretted that way. As also several eye witness decriptions talked of it being ‘not made by human hands’ and like the secreation of sweat or bodily fluids, ….sound similar to anything we know of today? ; ) R.","date":"2012-04-25","mins":"4:27 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-12083","author":"ron","post":"Maggie, for your first question; “image formation”. That is the million dollar question… and no one knows! But if you’d like to read about the several hypothesis on how it was formed you can visit http://www.shroud.com or Dan’s site Shroudstory.com as thye both have an extensive amount of information and papers on the subject. As for Dreisbach, maybe Dan can answer that one, I believe Dan is well aware of his work. R.","date":"2012-06-08","mins":"6:12 am","url":"https://shroudstory.com/2012/06/04/yannicks-nice-surprise-folding-test-on-the-enrie/","cat":"history","title":"Yannick’s Nice Surprise:  Folding Test on the Enrie"},{"id":"comment-12111","author":"ron","post":"Sorry don’t understand what you are saying. Band? Took for granted image was continuous? Can you please explain. And yes the bent knees ids part of the reason but not the main issue. R.","date":"2012-06-09","mins":"8:40 am","url":"https://shroudstory.com/2012/06/04/yannicks-nice-surprise-folding-test-on-the-enrie/","cat":"history","title":"Yannick’s Nice Surprise:  Folding Test on the Enrie"},{"id":"comment-12146","author":"ron","post":"I can’t see how you could possibly make a precise measurement of what you say. I would assume there is alot of ‘quess work’ in finding the exact points. There are some blank spots probably due to the angle of the cloth and the fact the knees were raised slightly meaning the thighs would be elevated also, but I see no actual gap. Atleast not one that would bring me to conclude the image is not continuous….sorry. R.","date":"2012-06-10","mins":"10:44 am","url":"https://shroudstory.com/2012/06/04/yannicks-nice-surprise-folding-test-on-the-enrie/","cat":"history","title":"Yannick’s Nice Surprise:  Folding Test on the Enrie"},{"id":"comment-12082","author":"ron","post":"Partially it does! As when they allowed extra length for the dorsal side to fold over the feet, they took away from the frontal foot area, which is not complete (Part of the feet are missing including the toes on the frontal view)…and draping of course, plus one must understand the effect of ‘foreshortening’ as the body was not flat but bent at the knees, upper torsal and head in rigor mortis. You should read papers written by Dame Isabel Piczek to understand the foreshortening and how it effects the dimensions of the image. R.","date":"2012-06-08","mins":"6:04 am","url":"https://shroudstory.com/2012/06/04/yannicks-nice-surprise-folding-test-on-the-enrie/","cat":"history","title":"Yannick’s Nice Surprise:  Folding Test on the Enrie"},{"id":"comment-11916","author":"ron","post":"I can’t believe it took anyone this long to notice this! It is quite obvious the body was not placed central (lengthwise) on the Shroud. The green line at the feet of the dorsal image is way off anyways. As it is and has been proposed the dorsal, lower part of the Shroud was brought over the feet, hense we get the full foot marking including the toes, with space below. I mentioned something to this months ago in a debate with Colin over image size discrepencies. Guess it’s another one of those points that go unnoticed!. Anyways to truly understand the folding of the Shroud one should watch the BBC documentary; Material Evidence, reported by Rageh Omaar and Produced by David Rolfe. In the documentary they have a clip with Dr Jackson et.al showing how THROUGH YEARS OF STUDY they have come to the most likely method in which the Shroud was wrapped. After one views this demonstration the question of a ‘forgery’ will definately be dismissed, especially in accounting for the blood markings being on the Shroud previous to the image. I believe the clip with the Jackson demonstration can be viewed on Youtube, whilst I’m not sure it has been licensed. R.","date":"2012-06-04","mins":"6:05 pm","url":"https://shroudstory.com/2012/06/04/yannicks-nice-surprise-folding-test-on-the-enrie/","cat":"history","title":"Yannick’s Nice Surprise:  Folding Test on the Enrie"},{"id":"comment-11955","author":"ron","post":"I could care less really. Its the fact you make it sound like it’s something NEW and no one else could have noticed…It’s pretty obvious to some but not too others I guess..","date":"2012-06-05","mins":"4:54 pm","url":"https://shroudstory.com/2012/06/04/yannicks-nice-surprise-folding-test-on-the-enrie/","cat":"history","title":"Yannick’s Nice Surprise:  Folding Test on the Enrie"},{"id":"comment-11958","author":"ron","post":"Then why put the line in at all, at the end if it’s not correct? The precision is important when making a point, especially if the line in question gives an erroneous depiction of where or how the Shroud was folded…Get my point? The essence of your post was understood, but the ”showing” was flawed, thats all I’m trying to say…So in those terms you were off track. Which can bring on scepticism to the conclusion. I hope everyone picked up on my suggestion that they should watch the BBC video…as it will enlighten many to this discussion…and that was the essence of my comment. Thanks. R.","date":"2012-06-05","mins":"5:04 pm","url":"https://shroudstory.com/2012/06/04/yannicks-nice-surprise-folding-test-on-the-enrie/","cat":"history","title":"Yannick’s Nice Surprise:  Folding Test on the Enrie"},{"id":"comment-16485","author":"ron","post":"Yannick Clément :Ronny, all I hear from you is close minded comments that goes against every credible Byantine scholars. I don’t have anything more to tell you… What else can I do ? You choose to believe blindly in Wilson’s poor and something falacious arguments. Good for you. I haven’t heard anything in the least ‘credible’ from whomever you may mean by “Credible Byzantine scholars” as yet, just the same regurgetations as you yourself and Freeman have been spewing for what seems like an eternity on here. In these I will add, I find many self interpretations and speculations as well… As to Mr Freeman; I will not repeat my counter points or addresses, which have easily countered several of your and Yannick’s arguments. I am not in the habit of repeating myself (usually) but have been forced to on this blog, far too often I may add and due to some having very closed minds!You can search back in the posts, if you wish, and you will find my remarks. I will not endlessly repeat the same arguments here constantly, as YC seems to enjoy doing with so much vigor. Moreover, I am quite sure I am not alone on this matter, as I’ve noticed several others here have made their own logical and reasonable counter points to what you and Yannick have been asserting…and have themselfs, noticed their arguments have been IGNORED also! I’m sure they are getting as sick of repeating themselfs as I am, especially noting their attempts are falling on deaf ears. R.","date":"2012-09-18","mins":"5:59 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"}]
