[{"id":"comment-6195","author":"ron","post":"Yannick actually I think the probability of a ‘tortured’ victim being used to create the image is much lower then you speculate, more like .000001 chance, basically meaning it is as likely as a supernatural event. Many of the evidences found on the Shroud point us to this conclusion; undisturbed blood, image on non contact areas, certain distortions etc; But in saying this I also believe Mr.Jones may be wrong in that this latest experiment proves anything against a medieval forgery, but alas we don’t need anymore proof as I think it has already been proven many times over; scientifically, artistically, and materialistically. R.","date":"2011-12-27","mins":"6:49 pm","url":"https://shroudstory.com/2011/12/26/a-different-point-of-view-illogical-nonsense-on-the-turin-shroud/","cat":"other_blogs","title":"A Different Point of View: Illogical nonsense on the Turin Shroud"},{"id":"comment-6142","author":"ron","post":"I think Rob Hosking has his wires crossed actually, if he would take the time to study scripture he would realize “quite clearly” that; God gave man; “Free Will”. That basically means God will not interfere in our world, has no say in what people do to others, or to themselfs. He has shown us how to live, it is up to us to follow so, or not….pretty simple! But as to the ‘sufferers’, such as the child of abuse we have here, they will be appeased, a million fold in God’s house. R.","date":"2011-12-26","mins":"12:36 pm","url":"https://shroudstory.com/2011/12/26/a-different-point-of-view-illogical-nonsense-on-the-turin-shroud/","cat":"other_blogs","title":"A Different Point of View: Illogical nonsense on the Turin Shroud"},{"id":"comment-5639","author":"ron","post":"Better light 3 candles Dan! …I can just picture Hitchens debating ernestly with the Lord, on why he should allow him into heaven ; ) R.","date":"2011-12-17","mins":"3:33 am","url":"https://shroudstory.com/2011/12/16/rip-christopher-hitchens/","cat":"news_&_views","title":"RIP Christopher Hitchens"},{"id":"comment-16911","author":"ron","post":"You guys should really do more reading. Madam Flury Lemburg had absolutely nothing to do with the sample location choice, two little known textile experts were brought in and it was argued over for two hours where the sample would be taken from (last minute) and not even by the experts lol. These textile experts, basically, had NO prior experience with the Shroud. Absolutely no prior technical information was actually consulted, as in STURP photographs etc. It ‘seemed’ the choice was made blind. Prof Testore/Riggi cut a much larger sample from the cloth but kept more then half for personal use/study, LOL again…..The event was video taped, but as mentioned, not all of it! Why? is the big question here. Why would you video tape most of the proceedings then go to a seperate room, with only two individuals involved, one being Mr Tite and not tape ‘extremely important’ sample packaging?…the whole thing was a FARSE! As for Ms. Lemburg’s negating the patch theory; Funny how she wasn’t even aware of ‘French Invisible Reweaving’ methods, evidenced by her comments that all stitching would show signs on atleast one side or the other? Did she even look at the cloth through any instruments other then her own eyes? The patching or stitching was “independently observed” by atleast three independent sources, thru J.Marino and Sue Bedford’s investigations into the patching theory. Just to many unanswered questions, and very questionable dealings occurred during the whole C14 fiasco, if you ask me ; ) R.","date":"2012-09-25","mins":"6:34 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16934","author":"ron","post":"No problem, but why leave out fiasco or farce? …as, it is fact ; ) Did you ever get around to reading those papers I mentioned a while back? Seriously Rich if your going to debate anything, you should study up extensively on the subject. These things I just mentioned, I would think would be common knowledge to anyone serious about the Shroud or Sindonology. Remember knowledge is power….In almost every post I read on there by your ‘opponents’, I noticed major errors. It is obvious most are not well read on the subject, but you must be, if you want to be taken seriously…and shown respect. R.","date":"2012-09-26","mins":"6:31 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16942","author":"ron","post":"I must clarify my last comment a atd, in that I meant; shown respect and taken seriously by your opponents in the debate… R.","date":"2012-09-26","mins":"8:31 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16938","author":"ron","post":"Excellent post Carlos! I’d like everyone to focus on the Zurich sample photos, but more specifically the actual ‘test’ samples and more specifically, thier weights. According to H.Gove, co inventor of the AMS system for radiocarbon dating and also refering to the paper by Mark Oxley; ‘Evidence is not proof A response to Prof Timothy Jull’, the minimum threshold CARBON weight of a testing sample should be 5 mg minimum and “given the conversion factor between the weight of the Turin Shroud cloth and it’s carbon weight is 24%, the weight of the cloth to be tested must therefore be a MINIMUM of 20.83 mg…Please take note of the weights of the samples used by the Zurich labs. R.","date":"2012-09-26","mins":"7:35 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16730","author":"ron","post":"Well said Dave! I’ve ventured on JREF a few times and read many of the comments by these so called “open minded” folk, and all I can say is they are FAR from being open minded, let alone intelligent enough to attempt producing the image or even simply explaining it. They are nothing else but swelled headed athiests. Yes they are blind, blind to the real facts, shown in thier refusing to accept any scientific results done by any of the STURP team or others, calling them biased Christians lol. Whilst at the same time they defend the science of the radiocarbon dating, as if it was irrefutable! Or use writings from the likes of Joe Nickell to defend their arguments…This just goes to show, and quite well I would add, their total lack of intelligence, along with thier extreme bias. How can you debate with that kind of mentality? Who would even bother? R.","date":"2012-09-22","mins":"7:16 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16999","author":"ron","post":"Sorry Richard, I didn’t mean to say you were lacking knowledge or ability and I can sympathize with your memeory issue, as I suffer slightly of the same. I have also had an issue with organizing all my Shroud information, links etc….So I understand where your coming from. I have just recently started to better organize myself to help with my debates, with some helpful tips from Daveb! Anyways as to your discussions at JREF, I think I warned you very early about ‘those’ many seperate ‘roots’ developing. It is a tactic used by others to make the task of responding daunting to you. Sometimes it helps to just take note of objections for later discussion and focus on one aspect at a time…Seriously, I would go nuts trying to keep up and respond to several different arguments at once. Try forcing the discussion to one aspect at a time. If they don’t respond in kind, ignore their posts and only post your facts, without responses to them….Thats my suggestion. Oh as to the papers I mentioned; One is the paper by Mark Oxley mentioned above and the Remi Van Haelst papers, which can be found at shroud.com. Thanks R.","date":"2012-09-27","mins":"6:08 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-17056","author":"ron","post":"Daveb; “It is one matter to engage in honest and open debate about those affairs which are precious to us. However, it is a pointless exercise when it is only too apparent that the good will of an honest response is unlikely to be forthcoming, and one should not give one’s valuable time to such futility.” …That is precisely what I tried to impress on Richard right from the beginning of his journey. I have to say, you certainly have a elegant way of writing Dave, and…yet again, another excellent post comment. Thanks. R.","date":"2012-09-29","mins":"12:22 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16736","author":"ron","post":"Richard Savage :Ron, The ultimate goal is to get our debate in front of a neutral audience — people who haven’t made up their minds — and let them chose for themselves who is making the most sense.— Rich Well good luck with that. R.","date":"2012-09-22","mins":"8:29 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-11558","author":"ron","post":"John I am in total agreement with your comment. It is the Naturalist world view that cannot accept there are things we cannot explain and are beyond our present state of scientific or naturalistic knowledge. Hense the push for a natural causation as opposed to a ‘supernatural’ one. The Fatima story comes to mind here, as WITNESSED by one of my family. A drenched field with thousands of rain soaked people, in minutes were completely dry; ground, cloths everything completely dry!. This miracle as witnessed by many thousands goes beyond ‘Naturalistic’ thinking yet gets very little mention at all. R.","date":"2012-05-23","mins":"5:56 pm","url":"https://shroudstory.com/2012/05/23/becky-garrison-article-in-killing-the-buddha/","cat":"other_blogs","title":"Becky Garrison Article in Killing the Buddha"},{"id":"comment-13128","author":"ron","post":"I haven’t done a documented survey but I think things may be worse then the poll shows!. In my job I happen to meet alot of young people, mostly under 30, and I have found most don’t even believe in God let alone even think about religion. They seem pre occupied with the material aspects of the world and getting ahead and things such as video games, movies, latest fashions etc. Personally I have had quite a few of these kids show disdain towards me for even bringing up the subject of God!…Really makes one wonder where this world is heading. R.","date":"2012-06-28","mins":"6:49 am","url":"https://shroudstory.com/2012/06/28/almost-a-third-of-adults-under-30-doubt-existence-of-god/","cat":"news_&_views","title":"Almost a Third of Adults Under 30 Doubt Existence of God"},{"id":"comment-30227","author":"ron","post":"Dave, I believe the icon shown above is of the Pantocrator in St.Catherine’s monastery (Sinai), and dates to the mid 6th century. Which is the oldest of known Pantocrator images, of that we know. I agree with you that these images may not say anything about the formation process, except for the fact that a single flower image does appear (and quite clearly) on a VP 8 image taken very early on by Jackson et al. Making it quite possible the image was formed in the same instant as the body image, but not 100% percent. R.","date":"2013-04-10","mins":"2:15 pm","url":"https://shroudstory.com/2013/04/10/and-now-the-flowers/","cat":"other_blogs","title":"And Now the Flowers"},{"id":"comment-3399","author":"ron","post":"Here’s a another view; I know the Shroud is real and I knew it 100% the moment I first saw it.Don’t ask me how, I can’t explain it or prove it…To me the onus is on others to prove it isn’t authentic!…so far no one has or even come close.My faith in Jesus has been with me always or atleast since I can remember, so I don’t need the Shroud but it did strengthen my faith, especially in these days of so much fear mungering and hate from non believers towards religion in general but specifically towards Jesus Christ. The C 14 dating? I don’t think will ever prove anything or ever settle the matter.If it tests to 33 CE people will just say it doesn’t prove the image was there since then.Also with some, even if science could, or did manage to prove the Shroud to be ‘real’, it would not make a difference or open their eyes, sad but thats the way it is. Ron.","date":"2011-07-24","mins":"10:16 pm","url":"https://shroudstory.com/2011/07/21/more-on-crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"news_&_views","title":"More on Crazy Talk: Are Atheists biased or just uninformed?"},{"id":"comment-33078","author":"ron","post":"YC; “On a general level, I think it’s fair to say that, authentic or not, the Shroud will forever be important only in the eyes of a portion of Christians…” …and MAYBE, I would add, thats’ who it’s meant for. In this ever secular world we live in, it may be here to strengthen our convictions and to help those that may start to fall from the faith. The written word is strong but in the modern world, images speak volumes. R.","date":"2013-05-06","mins":"1:38 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-3422","author":"ron","post":"Hi Yannick, thanks for the compliment and I have to agree that studies must continue on the Shroud even if for no reason other then continued findings or ‘clues’ may draw more people to Christ, as it did for Nick in his case.Remember in my comment I said ‘some’ people may never see, but I’ll bet there are many that will and that’s one thing we can all pray for.Although there is the matter of the Church to do thier part and allow more studies to be made competently on the Shroud.As it is in my humble opinion, what God would want and possibly why the Shroud is here.As I believe the Shroud was ‘meant’ particularly for our time as opposed to earlier eras. Ron.","date":"2011-07-26","mins":"9:31 am","url":"https://shroudstory.com/2011/07/21/more-on-crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"news_&_views","title":"More on Crazy Talk: Are Atheists biased or just uninformed?"},{"id":"comment-33126","author":"ron","post":"Yannick, using the term ‘sign’ is a little weak considering the point mentioned by Daveb in his post above. I could say the “evidence” is smack dab in front of you, in that the body image and blood traces show absolutely NO SIGN of tampering…How is this possible? …It isn’t, and there is your proof/evidence of the ressurection. R.","date":"2013-05-07","mins":"3:53 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-17183","author":"ron","post":"Unfortunately, the interview is in video, sorry. But they have put a book out titled; ‘The God of the Mountain’ by Penny Cox Caldwell available on Amazon. Apparently it’s chock full of photos. They also have a website newly formed called; http://splitrockresearch.org if your interested. R.","date":"2012-10-03","mins":"6:49 am","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","title":"Blogger: Please don’t get upset if you are Catholic"},{"id":"comment-17146","author":"ron","post":"Angel :Louis, with current archaeology digs in the Middle East, additional “original” parchments may eventually be unearthed. The Isaiah scroll, found in the Dead Sea Caves is an example, not to mention The Nag Hammadi Library. I would venture to guess Syria and Saudi Arabia hold many archaeological treasures, yet the turmoil in that area prevents any type of exploration. The photo of Jabal al Lawz, the real Mt. Sinai found by Ron Wyatt in Saudi Arabia, certainly looks authentic, with respect to being the mountain on which God descended to give Moses the Ten Commandments. The scorched, blackened area on the top of the mountain appears to verify biblical history and Moses. Ron Wyatt was arrested and held captive by the Saudis for crossing over into their land to take photos. This story appeared on American TV. Have you seen the images on google? Best, Angel, you may be interested in this; On Youtube, key in; Mountain of God Jim and Penny Caldwell Interview It is an 8 part interview which follows their 8 years of explorations into Saudi Arabia and their fascinating discoveries in and around the suggested, true Mt Sinai, plus some interesting finds throughout the whole of Saudi Arabia….Pretty interesting finds to say the least. R.","date":"2012-10-02","mins":"4:39 am","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","title":"Blogger: Please don’t get upset if you are Catholic"},{"id":"comment-17053","author":"ron","post":"One is left bewildered by the lack of intelligence shown by anyone who could accertain from a single cloth found in a tomb and from it’s simple construction, that all burial cloths of the era must have been of the same construction??? Moreover, because this discovered burial cloth is not as complex or as fine a linen as we view in the Shroud, that the Shroud could not possibly have been used in 1st century Jerusalem???…Is it just me, or is this logic just simply RETARDED? I agree with Andy that Iceangel71 requires much more study on the subject. R.","date":"2012-09-29","mins":"11:57 am","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","title":"Blogger: Please don’t get upset if you are Catholic"},{"id":"comment-17337","author":"ron","post":"Louis, if you go to the Caldwell interview I mentioned above, which can be found on Youtube and view the whole 8 parts, you will get some answers to your questions. For instance the picture of the mountain with the blackened top, is in actuality not the top of that mountain, there is a higher peak as you’ll see in the videos shown in the interviews. Also the Caldwells found some very interesting archaeological and non archeaological evidence that relates directly to the bible descriptions of the area. For instance, a large gravesite with upright stone markers, stone markers in the thousands! An almond tree, I believe, approx drunk dimension ten feet in diameter, apparently allowing the age of the tree to possibly be in the thousands of years. A huge split rock, approx 4 stories high, split right down the middle with very evident signs of intense water flows from such rock into the valley below, in an area that sees less then an inch of water a year!…Those are just a start to all the things found there. It is also important to mention that the Saudis have the whole area cordoned off by high barbed wire fence and guarded 24/7 by desert patrols. No one is allowed access! The Caldwells do not claim to be archeaologists or claim anything to be authentic, but have done an extremely good job of filming, photographing and notation of much of what they found there, at the peril of imprisonment or even death. R.","date":"2012-10-08","mins":"2:23 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","title":"Blogger: Please don’t get upset if you are Catholic"},{"id":"comment-17339","author":"ron","post":"Correction; It was a Cedar tree with an 8ft wide trunk, but it should be noted a almond tree was also found on the mountain..","date":"2012-10-08","mins":"3:22 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","title":"Blogger: Please don’t get upset if you are Catholic"},{"id":"comment-17054","author":"ron","post":"Oh and I’m not upset, just bewildered ; ) R.","date":"2012-09-29","mins":"12:00 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","title":"Blogger: Please don’t get upset if you are Catholic"},{"id":"comment-11352","author":"ron","post":"Here is another question; Did Rogers find starch fractions/ carbohydrate impurities on the ‘actual image fibrels’ or non image fibrels? …> Has this been clarified? … Because if they were not found on actual image fibrels, it is quite possible the image formation mechanism eliminated the (impurity layer) and also managed to colour the primary cell walls. Ron.","date":"2012-05-14","mins":"5:13 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","title":"Comment of the Week by Thibault Heimburger"},{"id":"comment-15112","author":"ron","post":"Was goin to comment on this before when the comment was first posted, Excellent find Andy! This will definately cut down the time requirred in searching. R.","date":"2012-08-17","mins":"9:30 am","url":"https://shroudstory.com/2012/08/17/comment-promoted-or-one-could-use-shroudnm-comsearch-html/","cat":"other_blogs","title":"Comment Promoted: Or one could use shroudnm.com/search.html"},{"id":"comment-15168","author":"ron","post":"Sorry for the misunderstanding. GREAT SITE THEN ANDY! : ) R.","date":"2012-08-18","mins":"2:12 am","url":"https://shroudstory.com/2012/08/17/comment-promoted-or-one-could-use-shroudnm-comsearch-html/","cat":"other_blogs","title":"Comment Promoted: Or one could use shroudnm.com/search.html"},{"id":"comment-4380","author":"ron","post":"^ What she said x 2..","date":"2011-10-27","mins":"6:19 am","url":"https://shroudstory.com/2011/10/26/destroying-the-magic-of-the-shroud-of-turin/","cat":"other_blogs","title":"Destroying the Magic of the Shroud of Turin"},{"id":"comment-3421","author":"ron","post":"Your comments are so on the mark, Annie, but sad at the same time.I personally have observed the same decent in the past decades and sadly I also see our societies, or whole world for that matter, going to shite…Problem is people need to believe before they will ask. Ron.","date":"2011-07-26","mins":"8:54 am","url":"https://shroudstory.com/2011/07/14/faith-and-challenge-in-our-age-of-enlightenment/","cat":"other_blogs","title":"Faith (and Challenge) in Our Age of Enlightenment"},{"id":"comment-15486","author":"ron","post":"In layman’s terms it`s called “Having your blinders on“. It is quite clear Meyer has based his impressions of the Shroud exclusively from the writings of J. Nickell…An unfortunate decision. But one that many I`ve come across have done. I`ve dealt with many such people (Nincompoops, I like to call them) on youtube and other blogs. People who are too lazy or just too simple minded to understand; One must read from all sources of information before coming to a decision, which includes all pro and con opinions and viewpoints. One also wonders who these “scientific and technical“ people are, which Nickells “collaborated with“? Does Nickells have the scientific or technical background to actually make the claims he does?…I would think not, infact I know he doesn`t, but that doesn`t seem to matter, aslong as people stay rigid in their research practices. Writers such as Nickells, Freeman and such are a huge detriment to the true scientific, historical and archaelogical facts, concerning the Shroud, being spread to the masses and their arguments must be dealt with, with much diligence, or we will have a world filled with Nincompoops. R.","date":"2012-08-26","mins":"10:45 am","url":"https://shroudstory.com/2012/08/26/freethought-or-cafeteria-thinking/","cat":"other_blogs","title":"Freethought or Cafeteria Thinking?"},{"id":"comment-3360","author":"ron","post":"So basically when people say there is no historical evidence of the Shroud before the 14th century, what they are actually saying is there is no Western historical evidence? How can historians refute all the written, eye witness and pictorial evidence to the Shroud before then? I understand the confusion with the Mandylion but thru all my readings of dozens upon dozens of writings on the subject (mostly from Shroud.com) and In my humble opinion, there is more then enough tangible evidence to state; The Shroud and the Mandylion are quite possibly one in the same, that there are many writings proving the Shroud was in Edessa in 944 and since 545?, then Constantinople till 1204? and then in Athens as late as 1218? There is a period of 150 or so years that is blank but I have read several papers that basically show some quite intriguing evidence the Shroud was in northern France that whole period and quite possibly hidden for sake of miscommunication by the Church for even having possession of such an item.Anyways can someone explain to me why scholars/historians can turn a blind eye to these evidences. Ron.","date":"2011-07-20","mins":"8:49 am","url":"https://shroudstory.com/2011/07/05/good-capsule-history-of-the-shroud-of-turin/","cat":"other_blogs","title":"Good Capsule History of the Shroud of Turin"},{"id":"comment-3728","author":"ron","post":"It’s irrelevant, the strongest scientific conclusion is that the body which made the image was anywhere from 5 foot 8 inches to 5’11” tall. But as it has been said many many times; The dimensions cannot be calculated accurately as the linen will change in size, simply due to atmospheric conditions.Nickells is just being the asshat that he is, he stretches the results to sound rediculous.Also I would really like to see his reproduction of the Shroud, it’ll probably give me a good neede laugh. R.","date":"2011-08-29","mins":"6:35 pm","url":"https://shroudstory.com/2011/08/27/freethought-shroud-be-accurate-and-factual/","cat":"other_blogs","title":"Freethought Should Be Accurate and Factual"},{"id":"comment-7562","author":"ron","post":"Gabriel :I must admit that this is completely news for me but, Yannick, after your recent posts on the work by Pierre Barbet, the implications of not detecting on the blood stains a process of unwrapping the cloth from a body, are obvious and go very far. I have got a few questions: Has his conclusions been confirmed by someone else? Was Barbet granted direct access to the Shroud? Why his work is not so widely known ? It was Adler and Heller that ‘actually’ noticed there was no image under the blood (apparently) in 1980 81, not Barbet. Barbet was working from photo images only, he had no direct access to the Shroud or should I say fibrel samples from such, in his studies, that I am aware of. R.","date":"2012-01-26","mins":"2:57 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","title":"He’s back and it’s a doozy"},{"id":"comment-7563","author":"ron","post":"Sorry Gabriel, let me retract my statement, as I misunderstood your statement. But I would like to say the fact that the blood stains are very ‘exact’, for lack of a better word, is I think good evidence to the images showing no sign of disturbance expected if the Shroud had been pulled off the body. R.","date":"2012-01-26","mins":"3:05 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","title":"He’s back and it’s a doozy"},{"id":"comment-7529","author":"ron","post":"Very well said Paulette. I basically tried to say the same several weeks back, but alas it didn’t come out as eloquently. ; ) R.","date":"2012-01-25","mins":"3:34 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","title":"He’s back and it’s a doozy"},{"id":"comment-10653","author":"ron","post":"Thats not surprising, I find if ever you post a good comment which would require them too actually ‘check it out for themselfs’ or with irresputable information, they usually won’t post it. Free speech I don’t believe is a ‘motto’ on most of those blogs or forums. R.","date":"2012-04-20","mins":"6:27 pm","url":"https://shroudstory.com/2012/04/20/how-not-to-get-people-to-comment/","cat":"other_blogs","title":"How not to get people to comment"},{"id":"comment-205380","author":"ron","post":"I barely got through the four bullets and realized the author has absolutely no clue of what they speak! …Just more of the nonsense spewed by skeptics. Its’ no different then most of the nonsense you’d find which emanates on the Internet. Ron.","date":"2015-07-12","mins":"8:55 am","url":"https://shroudstory.com/2015/07/11/ignorance-with-wings/","cat":"other_blogs","title":"Ignorance with Wings"},{"id":"comment-8556","author":"ron","post":"Hope you’ll be working on your sandbox/heated sculpture experiment… See you in a week Colin. R.","date":"2012-02-20","mins":"6:56 pm","url":"https://shroudstory.com/2012/02/20/image-by-scorching-heat-or-science-by-hot-air/","cat":"other_blogs","title":"Image by scorching heat? Or science by hot air?"},{"id":"comment-10709","author":"ron","post":"How does a post disappear by itself? If you think his comment was dumb you have a serious problem bud. I’m waiting to read your dissection, I’m sure it’ll be filled with rediculous untruths, conjectures and basically nonsensical statements. Ron.","date":"2012-04-22","mins":"12:46 pm","url":"https://shroudstory.com/2012/04/20/how-not-to-get-people-to-comment/","cat":"other_blogs","title":"How not to get people to comment"},{"id":"comment-12075","author":"ron","post":"Colinsberry :“… how can you explain the very drastic change of intensity on each side of the face ??? Please explain this to me. ” Have you considered that the sides of the face are not well imaged for the same reason that the sides of the body are not imaged? Nowt to do with bleaching or other fibre or fabric pre treatment, and everything to do with the geometry of the cloth relative to the subject during the image imprinting process (a presentation normal to the subject surface being far more conducive to imaging than one that is tangential). Colin I am in total agreement. If these areas on the sides of the face were due to the banding, would they not run along the whole Shroud? …They don’t! …One needs only look at the full image Shroud, put their cursor on either side face area and follow up or down the Shroud and one would see these non image areas alongside the face are NOT caused by the banding and deduced pretty simply I would say. It is obvious they have everything to do with the draping….no question, otherwise we would see the same banding on the back of the head image. R.","date":"2012-06-07","mins":"5:49 pm","url":"https://shroudstory.com/2012/06/07/marcel-alonso-on-rogers-impurity-layer/","cat":"challenge","title":"Marcel Alonso on Rogers’ Impurity Layer"},{"id":"comment-10707","author":"ron","post":"Actually I watched a documentary that covered, amongst other findings the ‘chariot wheel find’ and it is almost certain it is an Egyptian chariot wheel, as it was compared to several wheels found in tombs; design, style and dimension wise it’s exact, but of course one cannot say it is from the Moses era or actual crossing of the nile story. But it is a chariot wheel. The author’s comparing the Shroud to evidence like this chariot wheel is or a piece of the cross is simply an absord comment. The ’53 Chevy Bel Air came with 2 or 3 spoke steering wheels by the way lol. R.","date":"2012-04-22","mins":"12:30 pm","url":"https://shroudstory.com/2012/04/22/isnt-that-the-steering-wheel-from-a-1953-chevy-bel-air/","cat":"other_blogs","title":"Isn’t that the steering wheel from a 1953 Chevy Bel Air?"},{"id":"comment-12081","author":"ron","post":"Chris at one time, I once thought the two areas in question were due too banding until I was made aware of the most likely way in which the Shroud was placed about the face/head area. Here again I cannot stress enough that people view the video I mentioned in my other comment where Jackson demonstrates how most probably the Shroud was bound to the body. R.","date":"2012-06-08","mins":"5:23 am","url":"https://shroudstory.com/2012/06/07/marcel-alonso-on-rogers-impurity-layer/","cat":"challenge","title":"Marcel Alonso on Rogers’ Impurity Layer"},{"id":"comment-12102","author":"ron","post":"I think you need to rethink the draping of the cloth over the face! Just as been mentioned before by Colin and is a fact side images do not show and these areas can be classified as side image areas. You may also want to review how the “ancient technique” of creating a Shroud was done. Plus I also think you should heed Colin’s last comment in his comment below. R.","date":"2012-06-08","mins":"10:04 pm","url":"https://shroudstory.com/2012/06/07/marcel-alonso-on-rogers-impurity-layer/","cat":"challenge","title":"Marcel Alonso on Rogers’ Impurity Layer"},{"id":"comment-10733","author":"ron","post":"My dad owned a ’53 Bel Air by the way. Forgot to mention that ; ) R.","date":"2012-04-23","mins":"3:04 am","url":"https://shroudstory.com/2012/04/22/isnt-that-the-steering-wheel-from-a-1953-chevy-bel-air/","cat":"other_blogs","title":"Isn’t that the steering wheel from a 1953 Chevy Bel Air?"},{"id":"comment-6826","author":"ron","post":"Yannick Clément :I just bonified what CO said with more informations about Barbet’s experiments and conclusions. For the speculation question Ron, I want you to read my posts again ! I’ve clearly said that Zugibe’s hypothesis can be true, but like many questions regarding the Shroud, since we’re left with hypothesis and speculations (as you say), then we must judge what hypothesis has more chance to be close to the reality. And the best way to judge between 2 different hypothesis is, as I said before, to used the Occam razor principle. And, as I said before, when we used this principle, Barbet’s hypothesis reach a higher point in a probabilistic scale than Zugibe’s hypothesis, just because his description of the way of nailing the victims hands to the cross is much more simplier and more easy to do. That’s all I said. I never pretend Zugibe’s hypothesis is 100% off track. I just say that Barbet’s hypothesis seem more simple and easy to do in the context of a Roman crucifixion. In other word, the way Barbet describe the nailing of the wrist (and don’t forget that he made real experiments of nailing a dead body) seem more “natural” than Zugibe’s hypothesis, and don’t forget also that the outcome is the same : the wrist is completely locked and the victim cannot remove his hands from the cross, even if he pull hard with his arms. I’m pleased that you were able to read his book and yes, it would surely be a good thing to read it again because it is brilliant and very interesting from a forensic point of view ! For the Stigmata topic, read the answer I gave to Chris below. Tomorrow, I’ll write Barbet’s opinion about that, which is very interesting. You never bonified anything, and you never claimed Zugibe’s hypothesis can be true, you basically attacked him with speculations of jealousy and lack of knowledge compared to Barbet etc; Let me point a couple of very intriquing points to you and I expect you to be honest; One Destot’s point is not actually in the wrist! but technically, in the boney part of the ‘palm’! Two look close at the exit wound on the Shroud, does it look like the wound is anyway near the desot’s point?…Absolutely NOT!. Anyone with eyes can see that…I see it clearly! Three the nerve we speak of does not even run thru the area Barbet suggested but closer to the thumb and the thickness of a Roman nail would most likely never touch the nerve as the nerve is too small. But the most important point is the location of the wound!…Look at some pictures of the Shroud wound and also anatomy pictures depicting the running of the nerve and where destot’s spot actually is, and notice it is not where the destot’s spot is, it is too close to the thumb side….Oh one more point I noticed; You talk about a simpler way and the nail going in at 90 degrees; Look at the wound opening and picture a nail striking straight thru; Where would it come out the other side? The boney part of the palm not the wrist. I expect you to check this out honestly. R.","date":"2012-01-11","mins":"6:09 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"id":"comment-6865","author":"ron","post":"Thats right Yannick what I believe and it carries as much weight as what you ‘believe’…But I never called Barbet a ‘Fool’ just said he ‘may’ be in error. Noticed I used the word may and not was or is! I really don’t care if one had a vendetta against the other. My point is use your own eyes and tell me where is the wound? Stop shirking questions here, you’ve done it way too often. R.","date":"2012-01-12","mins":"4:40 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"id":"comment-6738","author":"ron","post":"Complex as it may ‘seem’ to you, it would not be much of an ‘issue’ for one whom has done it countless times (such as a Roman soldier in a crucifixion detail)! Also as ‘simply’ the nail would be pushed into the area of the palm on a angle towards the wrist, where the thumb would start to retract into the palm and the nail then would follow thru the bone ‘opening’ quite easily. Zugibe also shows quite well, Barbet in error, as in Barbet’s theorized method the Nerve would not be severed to retract the thumb!!….So Barbet’s method is not so “probable” anymore is it? Plus we have hundreds of years of depictions of the nails thru the palms! Are we just supposed to simply discount this and the stigmata?? …I think that would not be prudent. R.","date":"2012-01-09","mins":"6:44 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"id":"comment-6868","author":"ron","post":"You again misundertand my question; I said drive a nail thru the wound opening we SEE! …I would say and it is quite obvious; If you do drive a nail at 90 degrees, straight thru the wound we ‘see’ on the Shroud the nail would exit from the palm of the hand not the wrist….get it? Your shirking my question again or pretending not to understand it. Secondly you keep mentioning Barbet’s experiment’s on cadavers. Take close notice to his hanging cadaver and take notice his nail entry point positions….notice anything? They are in the pinky side ot the wrist and definitely no where near the nerve. Don’t forget also that Zugibe did many experiments also…I’d guess you are just ‘forgetting’ all those in your thinking…..and please stop using “Occam’s Razor has it has been found it rarely is the case..","date":"2012-01-12","mins":"4:59 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"id":"comment-6875","author":"ron","post":"I’d say you obviously never crucified someone, you know very little about carpentry or driving nails thru objects and show a huge bias here to your belief in Barbet’s ‘implausible’ conclusions and to archaeologists almost total lack of ‘actual’ knowledge on crucifixion!….And please take a rest on the “Occam ” thing, it’s getting old and makes no sense here, as we all know nothing is simple when dealing with the Shroud only your conclusions. R.","date":"2012-01-12","mins":"5:48 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"id":"comment-6871","author":"ron","post":"Yannick Clément :I recommand that you translate the last comment of Co and you’ll see that Barbet’s hypothesis was confirmed by other experts ! So, forget about the possibility that Barbet was off track on this topic. His hypothesis is definitely possible !!! As for Zugibe’s possibility. But, like I said before, Barbet reach a high point on a probabilistic scale if we use Occam Razor. And if you pretend the contrary, then that could smell some bias… Just do this experiment : Show the exit wound on the wrist to anybody and ask them where the nail was driven on the other side to exit at that spot ? If they answer the base of the palms instead the wrist, we have to believe that they know nothing about anatomy !!! ; ) I’m sure if we would do the test, 8 or 9 out of 10 people would say that the nail was driven through the wrist area… And Ron, you know I’m right about that. My proposal smells of bias? lol what a joke Yannick, you are the biased one here, as you cling to what Barbet might have concluded; (Could this possibly be a racial bias because he was French?). I say to you and CO look at the wounds for yourself, don’t tell me I don’t understand anatomy, and explain to me how a nail driven 90 degrees into the wound we see will end up on the wrist on the other side? I need only look at anatomical pictures of this area to see it is “improbable”. Oh by the way I HAVE shown the picture of the wound to friends, one being a my personal doctor and a surgeon whom happens to be interested in the Shroud and he along showed it to several of his surgeon friends and you know what they said; Exactly what Zugibe claims…Explain that! …these are surgeons from a VERY highly regarded hospital here in Toronto with absolutely no bias, as most are non believers.. Let’s also not forget the median nerve, it’s local, and it’s actual diameter and also that the width of a Roman crucifixion nail is at it’s widest point 1 cm. (Keeping in mind the exit point shown on the Shroud); Look for yourself, with no Barbet bias and being honest, tell me the nail entered thru the destot spot at 90 degrees, severed the median nerve and exitted from the point we see on the Shroud? Using Occam’s razor I’d say it’s improbable and reminds me of the “magic bullet” in the Kennedy assasination. R.","date":"2012-01-12","mins":"5:35 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"id":"comment-6879","author":"ron","post":"W Here do you get the idea your method is easier? The “Barbet Nail” would have had to take a ‘magic’ path!! You obviously don’t understand Roman ways or thinking do you?. They were not in the habit of taking the easy way thru things, in all they did. Being efficient and exact was their way, not the simplest way. A Gain the wound is not in the wrist area, look for yourself! R.","date":"2012-01-12","mins":"5:56 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"id":"comment-6881","author":"ron","post":"Yannick Clément :When someone as his idea settled, no way you can change his mind ! You just described yourself to a “T”…you should do sopme soul serching there Yannick. R.","date":"2012-01-12","mins":"6:26 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"id":"comment-6987","author":"ron","post":"I can say the same for you Yannick, you don’t want to believe Barbet’s ‘Hypothesis can be wrong’ and you show strong bias here. Forget what Barbet or Zugibe have said, look for yourself as I’ve mentioned before; LOOK AT WHERE THE EXIT WOUND IS ON THE SHROUD!., with your own eyes and tell me the wound could be thru Destot’s spot? Barbet or Zugibe don’t have any better ‘eye’ perception then you or me so their conclusion of the ‘exit wound’ can be no better then ours. I see the wound nowhere near the wrist or Destot’s spot. I can see CLEARLY, if I were to place a nail straight thru that wound it would end up coming thru the back end of the Palm…If you or CO cannot see this, it is not of my error…sorry. I say Barbet’s hypothesis is NOT consistent with what we see on the Shroud, it is quite evident and if you say most medical experts agree with his hypothesis, I say they are all blind aswell. R.","date":"2012-01-15","mins":"5:47 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"id":"comment-6991","author":"ron","post":"Oh almost forgot, you said to Max you are a ‘free thinker’…good. Then if so, you would agree to my suggestion; Forget what you’ve read by Barbet or Zugibe or whomever. Get a good quality photo of the Shroud wrist wound, some diagrams of the anatomy of the wrist and hand, picture yourself putting a nail (1cm in width) at 90% thru the wound you see on the Shroud and then figure out where it would exit from, by yourself…It doesn’t take a medical expert, especially with the information we have now at our disposal, to deduce on our own where this nail exit point would be…Try it and then tell us what you think. R.","date":"2012-01-15","mins":"6:19 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"id":"comment-6990","author":"ron","post":"Bla, bla, bla…You keep repeating yourself with the same crap. If something doesn’t agree with your ‘PERCEPTION’ of things. You’ve argued alot here using Rogers and other’s hypotheses, yet these hypotheses have not been ‘INDEPENDENTLY REVIEWED’ as you so forcefully point out about and too others. You talk about Barbet as if he was a God and could not possibly be in error!…I say Bull to that!!. Look at Barbet’s hanging cadavor picture and the location he ‘deduced’ the nails went thru, if you then still believe after seeing that picture that he was correct, then I say you are either blind, totally biased or in denile. AND please, Please Quit accussing scientists or everyone of ‘religious’ bias or of seeking glory, just because their findings are not what YOU think….It’s kind of pathetic. R.","date":"2012-01-15","mins":"6:02 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"id":"comment-7030","author":"ron","post":"The translator doesn’t seem to work too well but I do understand your first line and I say BULLSHIT. I have a feeling neither you or Yannick have a clue what I’m saying, and your just going by what Barbet said. I say LOOK FOR YOURSELF where the exit wound is, not Zugibe’s or Barbet’s conclusions… Where do you see the exit wound? Where the exit wound is, is an ‘interpretation’ as it is not exactly clear but by ‘deduction’ and a ‘good eye’ one can get a pretty good sense of location. Remember Barbet and Zugibe and whomever else had to ‘DEDUCE’ where the exact position was by ‘eye’, from PICTURES of the Shroud (they didn’t have a cadavor where they could feel into the wound) so this leaves room for ‘interpretation’. Could they interpret this location better then you or I? I think not…Both you and Yannick are not listening very well because I have basically said these things before and have asked a couple of times already. Look closely where the wound appears, imagine a nail 1 cm in width driven 90 degrees straight thru as Yannick has strongly suggested is the true ‘simpler’ way and tell me the nail would come out the wrist. The way I see it, it would exit in the centre of the base of the thumb, still in the palm….this is quite clear in my OPINION and in this particular case my ‘opinion’ is as good as anyone elses because of the interpetation of the wound location….Understand? So forget Zugibe, forget Barbet look for yourself, that is what I have been saying all along!. R.","date":"2012-01-16","mins":"6:25 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"id":"comment-7032","author":"ron","post":"Yannick sometimes you are quite irritating, as you are completely biased in most all you say, you close your mind too what people say (If it goes against your ideals) and it is clear you shirk most real questions put forth to you. You misinterpret my words when it seems you have no answer to my questions or suggestions….I never said you think Zugibe AND Barbet were Gods, but that you act as if BARBET alone was a God and cannot possibly make a mistake. Again you have described yourself to a TEE with Barrie Schwortz’s statement , not me. I asked you to look for yourself at many things and for your interpretations, yet you ignore this and many things I have said…Why? Is it because maybe you see something that can change your outlook and contradict your beliefs? Yes Yannick I’ll go on in my beliefs, because that is my right but I do so with an open mind and as a ‘free thinker’ unlike you. Our correspondence on this blog is over. R.","date":"2012-01-16","mins":"6:46 am","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"id":"comment-3294","author":"ron","post":"Some points made are erroneous, first the archaelogists did find signs on the forearms bones which were possibly from nails driven between and scoring the bones. As for the nail thru the ankle; How does this refute the typical view of both feet together being nailed? or show that the feet were nailed to the sides of the beams? Place one foot flat on the floor, place your other foot across the top of the flat foot angled so one side of the foot points up, the nail could have been driven thru the ankle of the top foor and thru the top of the bottom foot into the beam easily.The spikes/nails were said to be approx 6 inchs in length. R.","date":"2011-07-02","mins":"8:44 pm","url":"https://shroudstory.com/2011/05/19/nailed-or-tied-to-the-cross/","cat":"other_blogs","title":"Nailed or Tied to the Cross?"},{"id":"comment-6788","author":"ron","post":"Is that what Co said? I must have lost something in the translation…. But even so, even if Barbet’s experiments prove his way is compatible (with what we see on the Shroud), you are FORGETTING one very important aspect; WE do not see the palm side of the wrist on the Shroud!! SO ANY conclusion can only be SPECULATION. You forget also that Zugibe, for whatever reason caused him to start his own experiments also used ‘Personal experience’ with wounds, models, and also did many experiments. I read the book ‘Doctor at Calvary’ many years ago, I will admit I should read it again as I have most likely forgotten much of what I read but in saying that and in taking both views; We must consider things such as artists depictions over the centuries and the stigmatas seen over the centuries as important clues to this, and not just discard them. In saying that it is in my opinion Barbet’s hypothesis may be in error. R.","date":"2012-01-10","mins":"4:47 pm","url":"https://shroudstory.com/2012/01/09/metaphors-or-mix-up/","cat":"other_blogs","title":"Metaphors or Mix Up?"},{"id":"comment-20980","author":"ron","post":"Seriously Max, what difference would that make…really? Take a good look at how he folds the shroud over the body and then tucks the sides in and folds the sides over, if the side strip mistakingly was left on the Shroud he used for this demonstration, (and we can not be quite sure about this from the video) it would not effect anything anyways. You claim to have come up with the side strip idea before Dr Jackson and I have no reason to question this, so in saying that I have a question; Have you noticed any ‘signs’ on the image that may back this hypothesis. Such as what Dr Jackson eluded to with the possible image disruption under the chin? Thanks, R.","date":"2012-12-22","mins":"5:04 pm","url":"https://shroudstory.com/2012/12/21/nice-short-summary-of-the-shroud-of-turin/","cat":"other_blogs","title":"Nice Short Summary of the Shroud of Turin"},{"id":"comment-9973","author":"ron","post":"Question here is; How on earth do you fight such ignorance? It’s a never ending fight that seems impossible to penetrate….People will believe what they will, that was a gift given by God~Free Will, and so be it then….Reason does not work with a blackened heart. Ron.","date":"2012-04-05","mins":"8:02 am","url":"https://shroudstory.com/2012/04/05/nonsense-break-the-blog-is-actually-called-the-fight-against-nonsense/","cat":"other_blogs","title":"Nonsense Break: the Blog is actually called  … The Fight Against Nonsense"},{"id":"comment-3436","author":"ron","post":"Probably was referring to Garlaschelli, sure seems like it, but he also shows his total lack of ‘understanding’ of the Shroud attributes in saying “That it can be trivially reproduced” or by not noticing the comic character reproduction by Garlichelli. It’s odd how someone who seems to be well educated, going by his first comments, can show such lack of knowledge in the same paper….go figure. Ron.","date":"2011-07-26","mins":"11:19 pm","url":"https://shroudstory.com/2011/07/26/quantum-diaries-and-the-shroud-of-turin/","cat":"other_blogs","title":"Quantum Diaries and the Shroud of Turin"},{"id":"comment-8428","author":"ron","post":"I sense the skepticism in his words, but definately no critical thinking. I wouldn’t want my kid in his class. R.","date":"2012-02-18","mins":"6:27 am","url":"https://shroudstory.com/2012/02/18/parenthetical-factoids-makes-for-lazy-teaching/","cat":"other_blogs","title":"Parenthetical factoids makes for lazy teaching"},{"id":"comment-9080","author":"ron","post":"Very nicely said Chris, this as always been my interpretation also. R.","date":"2012-03-08","mins":"1:09 pm","url":"https://shroudstory.com/2012/03/08/resurrection-as-proof-of-an-actual-god-man/","cat":"other_blogs","title":"Resurrection as proof of an actual God-man?"},{"id":"comment-7966","author":"ron","post":"Very nice comment Brendan! …and yes sciencebod has had that explained to him several times, (about aligning the image properly) I mean, but it never hurts to say it again ; ).","date":"2012-02-06","mins":"12:02 am","url":"https://shroudstory.com/2012/02/05/sandcastles-in-sciencebods-sandbox/","cat":"other_blogs","title":"Sandcastles in Sciencebod’s sandbox"},{"id":"comment-10845","author":"ron","post":"Your absolutely right in your scientific dicipline statement, in actuality if people had not delved further with thier speculations, where would we be today? No planes maybe, no cell phones, etc; People should watch some Michio Kaku videos, he’s an enlightened physicist. You tube; Mikio Kaku: SCI FI or SCI FACT, Part 1 is a good one. ; ) Ron.","date":"2012-04-25","mins":"5:01 pm","url":"https://shroudstory.com/2012/04/23/shroud-of-turin-relationship-to-nde-and-obe/","cat":"other_blogs","title":"Shroud of Turin Relationship to NDE and OBE?"},{"id":"comment-4019","author":"ron","post":"This news doesn’t surprise me one bit, I personally never put much strength in the theory that the speed of light was the apex in nature. The theory always reminded me of the speed of sound theory and we all know how wrong they were there. All this just goes to prove how little we ACTUALLY understand about anything.Yet those of study with thier swelled heads, would like us to believe they have the science of nature conquered…As for the formation theory being of a natural occurence; absolutely, it cannot be ruled out, but neither can something unnatural or dare I say supernatural, just because we cannot comprehend it in our present of ‘limited’ knowledge.Furthermore, with all the knowledge acquired thus far on the Shroud imprint, it’s qualities and it’s nature, to me shows; proofs or evidence for a ‘natural causation’ is lacking and very thin.But that is just my interpretation of things..","date":"2011-09-23","mins":"6:10 pm","url":"https://shroudstory.com/2011/09/22/scientific-conclusions-changing-again/","cat":"science","title":"Scientific Conclusions Changing Again"},{"id":"comment-9770","author":"ron","post":"As I’ve repeatedly mentioned, (maybe annoyingly at this point). How can people accept a ‘single’ 14 C test as being ‘conclusive’ evidence? Do people not understand 14 C testing? …from the very type of ‘same’ comments made by the likes of Cranky Catholic and many, many others…I would answer that, most emphatically, as NO! I think people have been ‘duped’ in the promise of radiocarbon dating and it’s relevance to ‘PROOF’ of anything. The conclusions reached in 1988 by the people involved in the 14 C dating and of it’s conclusive evidence was a STRAIGHTOUT LIE! and misconception…and they knew it. But a gullible world accepted it freely and still do. It’s a shame really. Ron.","date":"2012-03-29","mins":"5:18 pm","url":"https://shroudstory.com/2012/03/29/the-cranky-catholic-this-shrouded-season/","cat":"other_blogs","title":"The Cranky Catholic: This shrouded season"},{"id":"comment-10846","author":"ron","post":"He’s quite funny too!.","date":"2012-04-25","mins":"5:01 pm","url":"https://shroudstory.com/2012/04/23/shroud-of-turin-relationship-to-nde-and-obe/","cat":"other_blogs","title":"Shroud of Turin Relationship to NDE and OBE?"},{"id":"comment-36315","author":"ron","post":"Would purchasing any of the wonderful items from the Store help towards this effort? Thanks, Ron.","date":"2013-06-06","mins":"2:56 pm","url":"https://shroudstory.com/2013/06/04/the-high-price-of-success-at-stera/","cat":"kelly_kearse","title":"The High Price Of Success at STERA"},{"id":"comment-11108","author":"ron","post":"One can only hope this documentary/ film eventually becomes a world wide release. I for one would really like to see it….Alot of funky stuff happened back then that is not well understood or even known. This film, I hope, opens people’s eyes to the travesty of the radiocarbon dating which occurred or as William Meacham as declared it; ‘The Rape of the Turin Shroud’….quite literally ; ) R.","date":"2012-05-04","mins":"6:26 am","url":"https://shroudstory.com/2012/05/04/the-night-of-the-shroud-premiered-in-spain-by-rai-in-valencia/","cat":"other_blogs","title":"The Night of the Shroud premiered in Spain by RAI in Valencia"},{"id":"comment-11127","author":"ron","post":"Hi Maria, what would you say was the best point brought across by the film? …If you don’t mind me asking. Thanks, Ron.","date":"2012-05-04","mins":"1:22 pm","url":"https://shroudstory.com/2012/05/04/the-night-of-the-shroud-premiered-in-spain-by-rai-in-valencia/","cat":"other_blogs","title":"The Night of the Shroud premiered in Spain by RAI in Valencia"},{"id":"comment-9539","author":"ron","post":"Oops, I meant Randy : S, …sorry Randy. Thanks for the post. Ron.","date":"2012-03-23","mins":"5:54 am","url":"https://shroudstory.com/2012/03/22/the-secrets-of-mfol-revealed/","cat":"other_blogs","title":"The secrets of MFOL revealed"},{"id":"comment-9540","author":"ron","post":"Nicely said Dave! You somehow managed to put the whole thing in perspective, in just two paragraphs! Ron.","date":"2012-03-23","mins":"5:59 am","url":"https://shroudstory.com/2012/03/22/the-secrets-of-mfol-revealed/","cat":"other_blogs","title":"The secrets of MFOL revealed"},{"id":"comment-9525","author":"ron","post":"I agree wholeheartedly with Roger’s comments above, but alas I think I’ve actually mentioned this exact thing to Colin several times;…Produce a facsimile, and if not, stop implying it is possible and carry on to other things. Oh one also wonders where this “Medieval” magician managed to aquire so much 1st century linen to start….must have been a costly experiment for a poor artist to complete. Ron.","date":"2012-03-22","mins":"5:50 pm","url":"https://shroudstory.com/2012/03/22/the-secrets-of-mfol-revealed/","cat":"other_blogs","title":"The secrets of MFOL revealed"},{"id":"comment-7419","author":"ron","post":"I have a vague memory of reading the same. I believe the original c14 was ‘unauthorized’ and of the dating being ‘possibly’ early 2nd century…I think the testing occurred in the early 70s, maybe ’73?. By the way what does CYA mean? Also maybe if Dan reads this, Dan can help us out here if he’s read or heard anything on this early c14 dating. R.","date":"2012-01-23","mins":"12:09 pm","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","title":"The State of Skepticism: Ridicule works. Right?"},{"id":"comment-3497","author":"ron","post":"I see no correlation whatsoever, but nice concept!…Dan how do you find all this stuff anyways? Almost seems like you have tentacles geared to sourcing out anyhting relative to the Shroud lol. Thanks, Ron.","date":"2011-07-31","mins":"6:04 am","url":"https://shroudstory.com/2011/07/30/the-shroud-in-the-universe-seeing-images-of-god/","cat":"other_blogs","title":"The Shroud in the Universe: Seeing Images of God"},{"id":"comment-3347","author":"ron","post":"It’s laughable, yet sad how misinformed people are on this subject.This subject being the Shroud of Turin, not probably, but the most important historical relic of all time.It baffles me that so many people, considering what this Shroud may mean to all mankind, do not take the time to study it further, to enlighten themselfs on the facts and wonderment of this most amazing icon. Ron.","date":"2011-07-16","mins":"2:19 am","url":"https://shroudstory.com/2011/07/14/yahoo-answers-not-so-sharp-when-it-comes-to-the-shroud-of-turin/","cat":"other_blogs","title":"Yahoo Answers Not So Sharp when it comes to the Shroud of Turin"},{"id":"comment-7431","author":"ron","post":"Awesome find Chris, thanks. R.","date":"2012-01-23","mins":"3:08 pm","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","title":"The State of Skepticism: Ridicule works. Right?"},{"id":"comment-4644","author":"ron","post":"Beautiful comment Annie! Seriously you should consider writing a book on your thoughts. R..","date":"2011-11-07","mins":"1:30 pm","url":"https://shroudstory.com/2011/11/07/when-it-comes-to-the-shroud-i-am-right-and-you-are-wrong/","cat":"other_blogs","title":"When it comes to the Shroud I am right and you are wrong"},{"id":"comment-7342","author":"ron","post":"Gabriel :Yannick, I agree but only partially because if it only was that the image helps Christians evocate and meditate on the Passion that would also work with the thousands of other relics or even with the many copies of the Shroud. However, it seems as though in this case, they were saying something like: “ok, we admit it..in the past we have in many occasions promoted the devotion of false relics in the past, but believe us….. This time it is the good one!”.Something that has also to be taken into account, as some comments regarding a previous skeptic post pointed out, is the very close connection of the Catholic Churh with science and in general, the Academia (scientists, Universities…) The Church is always the last to believe in such things, so it is not surprising that in the past they showed the relic only sparingly. As I assume you have probably noticed though Gabriel, owing to your first post, they have been “showing” the Shroud at a drastically increasing interval. Practically every 10 years in the last 40. I wonder the same as you and I believe there is something to this, something we will never know and can only speculate too. R.","date":"2012-01-22","mins":"11:46 am","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","title":"The State of Skepticism: Ridicule works. Right?"}]
