[{"id":"comment-206338","author":"ron","post":"Dave I agree 100%; “The words have a clear enough application to the sufferings of Jesus” and one does not need to be a scholar to see this…As a child reading this for the first time, one has the instinctive knowledge of whom it was written…with no dilutions or bias of interpretation. “unless you change and become like little children, you will never enter the kingdom of heaven” Matthew 18:3..","date":"2015-07-22","mins":"2:08 pm","url":"https://shroudstory.com/2015/07/17/a-reflection-on-the-shroud-and-zechariah/","cat":"article","title":"A Reflection on the Shroud and Zechariah"},{"id":"comment-9863","author":"ron","post":"I’m with you Dan, it baffles me also that people are STILL making idiotic claims as in the article above. It tells you one thing though; How little these people have actually studied the Shroud. Articles and the Internet are just full of idiotic comments and misinformed claims, all which could be properly disputted if even a smidgen of research was done….It comes down to one word; Ignorance. Ron.","date":"2012-04-02","mins":"8:03 am","url":"https://shroudstory.com/2012/04/02/a-silly-why-the-shroud-of-turin-is-fake-article/","cat":"news_&_views","title":"A Silly “Why the Shroud of Turin is Fake” Article"},{"id":"comment-9974","author":"ron","post":"Dave, I believe “from close scrutiny of the body image and renditions as shown above” plus from measurements and angles taken by several scholistic studies, there IS slight deformation present; as the shoulders seem to have been dislocated when brought down in their rigor state, actually seeming to make the arms longer. Furthermore, taking in all aspects of the body posture; it shows a most typical position expected of one whom was crucified and entered rigor while still in the death position. One needs only draw a line horizontally across the rendition above and then turn the picture to the vertical to see this. It also shows details such as; there must have been a footrest used; showing from the angles of the feet, amongst other things. Anyways the position shown on the Shroud is easily attained if all aspects of the posture are recognised. Unfortunately many do not seem to have the capacity to see this. Ron.","date":"2012-04-05","mins":"9:27 am","url":"https://shroudstory.com/2012/04/02/a-silly-why-the-shroud-of-turin-is-fake-article/","cat":"news_&_views","title":"A Silly “Why the Shroud of Turin is Fake” Article"},{"id":"comment-10308","author":"ron","post":"Jerome, before you go calling people idiots, First; have you ever heard of rigor mortis?…NO then Do us and especially YOURSELF a favour; READ! There is a huge amount of information on the Shroud out there, SCIENTIFIC evidence written by dozens of forensic scientists, chemists, physicists etc; But also important is that you acknowledge the ‘credentions’ of the people writing whatever you read as ‘essential’ in your choice of reading! As an example; Don’t take the word of a ex magician, ex private eye, literary scholar over the findings of a half dozen ‘qualified’ forensic scientists…get me here jerome? Thanks, R.","date":"2012-04-12","mins":"7:47 am","url":"https://shroudstory.com/2012/04/02/a-silly-why-the-shroud-of-turin-is-fake-article/","cat":"news_&_views","title":"A Silly “Why the Shroud of Turin is Fake” Article"},{"id":"comment-7322","author":"ron","post":"“But ignorance loves ignorance just as money loves money”…How true and well said, and I must agree with most all of Annette’s rebuttal….One wonders though how all these sceptics of the Shroud can be so ignorant of the facts, do they not read? Do they not research the topic at hand, fully? and if they do, why are they so blind to the truth? …It’s a mystery too me, more so then the Shroud can ever be. R.","date":"2012-01-22","mins":"7:43 am","url":"https://shroudstory.com/2012/01/22/correcting-an-article-about-the-shroud-of-turin/","cat":"news_&_views","title":"Correcting an article about the Shroud of Turin"},{"id":"comment-10311","author":"ron","post":"Typo error above. ‘credentions’ should read as ‘CREDENTIALS’, my apologies. R..","date":"2012-04-12","mins":"11:45 am","url":"https://shroudstory.com/2012/04/02/a-silly-why-the-shroud-of-turin-is-fake-article/","cat":"news_&_views","title":"A Silly “Why the Shroud of Turin is Fake” Article"},{"id":"comment-29395","author":"ron","post":"Not only were the sampling pieces suspect but the testing itself was also. Don’t forget the ‘suspect’ sample [weights] being below the minimal threshold limit for ‘proper’ testing and a point made by Harry Gove for the testing used in 1988. The testing performed was also in it’s infancy and (known to have serious issues), and let’s not forget the Chi factor issue. There are several blatant reasons to disregard the C14 dating done in 1988. However skeptics tend to ignore these blatant facts and continue to ‘believe’ the test results. R.","date":"2013-04-04","mins":"5:35 pm","url":"https://shroudstory.com/2013/04/04/a-critical-review-of-giulio-fantis-new-book-unreliable-results-because-of-inadequacy-of-methods/","cat":"books","title":"A Critical Review of Giulio Fanti’s New Book:   Unreliable Results Because of Inadequacy of Methods"},{"id":"comment-3405","author":"ron","post":"Mr Bratcher, I believe you’ve misinterpreted Joe’s stand in the Shroud debate.I think he was being a little sarcastic.Joe Marino along with the late Sue Benford were instrumental in Shroud research with their independant paper published I believe in 2001, arguing that the C 14 dating was flawed due to the samples being taken from a medieval patch being invisibly woven onto the Shroud.This led to the late R.Rogers further studies ending with the now semi famous peer reviewed paper in Thermo Chimica Acta (2005). Anyways I’ll add some things to the list; *Jesus never existed, there’s no historical proof, so how could the Shroud be his? *The man on the Shroud is 6 feet tall! people in those times were only 5’5″, so it’s a hoax. *Scriptures say Jesus was clean shaven and had short hair, so the guy on the Shroud could not have been Jesus. *They found a burial cloth in a cave in Jerusalem, looked nothing like the Shroud, so the Shroud is a fake. LOL, Ron..","date":"2011-07-25","mins":"10:20 am","url":"https://shroudstory.com/2011/03/23/a-review-the-fallacy-of-god-a-religious-conspiracy/","cat":"books","title":"A Review: The Fallacy of God: A Religious Conspiracy"},{"id":"comment-13694","author":"ron","post":"Very well said Dave B! …Wish I could write like that ; ) R.","date":"2012-07-10","mins":"1:33 pm","url":"https://shroudstory.com/2012/07/09/new-article-on-the-shroud-of-turin/","cat":"news_&_views","title":"New Article on the Shroud of Turin"},{"id":"comment-11354","author":"ron","post":"When was this book published? It seems to be years behind in the facts about all the issues of the Shroud, plus it shows also, from various statements, the author has done very little indepth study on the Shroud’s attributes, let alone read any scientific papers to the matter. He just gets his info from other’s authored writings lol, what a joke. The problem is people believe this crud because it is written. R.","date":"2012-05-14","mins":"5:20 pm","url":"https://shroudstory.com/2012/05/14/a-veritable-giant-with-unusual-storklike-proportions-really/","cat":"books","title":"A Veritable Giant with Unusual Storklike Proportions: Really?"},{"id":"comment-3293","author":"ron","post":"Theres is actually a prestine image of a flower on one of the pictures taken with the VP 8 Image analyzer.It is a picture of the torso and face.The flower image is above and to the side of the face image.It is clear as day and impossible that it could be an anomaly of the linen threads or of a crease or fold.The image is too perfect to be anything but what it depicts, a flower. R.","date":"2011-07-02","mins":"7:55 pm","url":"https://shroudstory.com/2011/06/13/david-rolfe-interview-with-avinoam-danin-on-the-shroud-of-turin/","cat":"books","title":"David Rolfe Interview with Avinoam Danin on the Shroud of Turin"},{"id":"comment-9527","author":"ron","post":"Chris :Beware of the old leftist propaganda tactic of repeating a lie until it becomes the truth in order to achieve a political goal(s). I wouldn’t single out ‘leftists’ alone in using the ‘propaganda tactic’, it is universally used, my friend!…Not talking about the Shroud issue here in particular, or at all ; ) Ron.","date":"2012-03-22","mins":"5:58 pm","url":"https://shroudstory.com/2012/03/21/bart-ehrmans-new-book-did-jesus-exist/","cat":"books","title":"Bart Ehrman’s new book: ‘Did Jesus Exist?"},{"id":"comment-3449","author":"ron","post":"Hi Yannick, check out the link above in post #8, there are three images, the top left image in green showing the shroud image front head to thighs.Look to the left of the head just beside the burn marks. As for using Barrie to make your point you must consider Barrie is talking about photo images of the Shroud, not VP 8 images.I don’t think Barrie is responsible for any VP 8 images found anywhere or can claim to be an expert in them anymore then anyone else.So his conclusions would stem from typical photos and I agree with him, as I mentioned before; I have never noticed a single flower image on any ‘photos’ of the Shroud.That’s why I found it very interesting the flower image that basically ‘jumps out’ in the 3 D rendering. Also I don’t think it’s fair to chastise Wanger and Danin so quickly or to say they believe their findings are ‘proof’. I see their findings has possible ‘clues’ to the authenticity of the Shroud, nothing more, and I believe that is their stand.Although Barrie is right in that we must be prudent in such findings, it would not be very logical to dispell them too quickly either.We’ve agreed several times that further studies are required, much more, also chemical analysis ‘may’ render some interesting findings if areas where flowers, plants have been seen are tested.Pollen evidence can be very telling and relatively precise. But chemical studies will never prove or disprove the apparent coin images.I don’t see these potential images has being any different from all other characteristics of the Shroud as they can be very telling if found to be real, especially the coins.There has been much said about the coins, dozens of articles and papers, yet you cannot refute certain things, ‘definite roundel protrusions over the eyes’ seen especially clear in VP 8 images…background noise?, maybe, but that is just an assumption.My mind is still open to any conclusions on this subject and just find all the research fascinating. Ron.","date":"2011-07-27","mins":"10:32 pm","url":"https://shroudstory.com/2011/06/13/david-rolfe-interview-with-avinoam-danin-on-the-shroud-of-turin/","cat":"books","title":"David Rolfe Interview with Avinoam Danin on the Shroud of Turin"},{"id":"comment-3339","author":"ron","post":"I was just making the point that a 3d image of a flower IS visible and not an imaginary thing.Many people refuse to believe flower images exist AT ALL on the Shroud and although I have found it hard to see any of them from normal pictures of the actual Shroud, I have seen it clearly on a VP 8 3 D rendering….I agree this 3d flower image could have occured at any time, but it is there nonetheless!…This also must allow us not to refute too quickly other things said to be found on the Shroud; coins over the eyes for example, which by the way most VP 8 renderings of the face do show some kind of objects or protrusions over the eyes. Chemical analysis, yes I agree needs to be continued on a large scale but this is up to the Church. Mind you they have found pollens of many plants on the Shroud, but that is another blog..","date":"2011-07-11","mins":"12:34 pm","url":"https://shroudstory.com/2011/06/13/david-rolfe-interview-with-avinoam-danin-on-the-shroud-of-turin/","cat":"books","title":"David Rolfe Interview with Avinoam Danin on the Shroud of Turin"},{"id":"comment-3361","author":"ron","post":"I’m not trying to prove anything here! Especially that by seeing a flower image proves the Shroud is authentic.Just saying I see a flower image and it is quite clear to me, as clear as the nose or fingers of the same 3 D image.Why you folks don’t see it I don’t know, as it’s clear as day to me.As I said earlier I do not see the flower image on regular photos at all, or pretend too, but the first time I saw this 3 D rendering it popped out like a slap in the face.I wasn’t staring at the picture for hours putting myself into a trance, I saw it immediately.Also I think when Barrie made that statement he was talking more precisely about the ‘coin images’. I have never heard him refute the flower image(s).Even if he has and as he has access to much better photos then us, it still does not refute what I see….maybe its just a bad photo, I don’t know, but I know what I see and I have excellent vision. Ron.","date":"2011-07-20","mins":"9:09 am","url":"https://shroudstory.com/2011/06/13/david-rolfe-interview-with-avinoam-danin-on-the-shroud-of-turin/","cat":"books","title":"David Rolfe Interview with Avinoam Danin on the Shroud of Turin"},{"id":"comment-29530","author":"ron","post":"Giorgio :Ron, Dr. Gove maintained the C 14 data even with outlying factors some have proclaimed, is convinced the Shroud was not from the 1st century but closer to the stated dates the three labs announced. The point was not about Gove’s thoughts on the dating of the Shroud. It is well known he had a definite bias on the matter, and a strong hatred towards STURP (One just needs to read his book to understand this), but of the fact that he specifically mentioned the importance of the ‘minimal threshold weight’ of the samples being tested and it’s importance to proper results. All labs samples btw were apparently ‘UNDER’ this threshold weight. This FACT raises some serious technical issues on the whole matter. Gove’s specific point and he being one of the inventors of the AMS method (so he knew what he was talking about), should have raised eyebrows and raised some serious questions on the procedures that were taken. It dumbfounds me how anyone with even a slight knowledge on c14 procedures could still accept the tests done in 1988….They are null and void as far as this novice is concerned and people should stop defending the labs, has they definitely had an agenda/bias or atleast certain people involved did. R.","date":"2013-04-05","mins":"3:19 pm","url":"https://shroudstory.com/2013/04/04/a-critical-review-of-giulio-fantis-new-book-unreliable-results-because-of-inadequacy-of-methods/","cat":"books","title":"A Critical Review of Giulio Fanti’s New Book:   Unreliable Results Because of Inadequacy of Methods"},{"id":"comment-3356","author":"ron","post":"Your quite welcome, and as I mentioned in my e mail, I will continue to search for the ‘larger’ image of what I sent, which I would say shows it much clearer.The problem with the ‘background’ noise probability is that you would have background noise scattered thru out the image, wouldn’t you? The fact that there are flat spots or plains on the image where expected and except for where there are burns or actual known images and threading, tells me that it is not background noise or some other anomoly.I’m no export though, that is just a laymen’s point of view..","date":"2011-07-18","mins":"1:43 pm","url":"https://shroudstory.com/2011/06/13/david-rolfe-interview-with-avinoam-danin-on-the-shroud-of-turin/","cat":"books","title":"David Rolfe Interview with Avinoam Danin on the Shroud of Turin"},{"id":"comment-3351","author":"ron","post":"I think, if I could post that vp 8 image here, there would be no doubt you’d see a figure of a flower, you or anyone else. It’s really that clear and pronounced.Anyone who would deny they see this particular flower ‘image’ would be blind or lying.But as I said before I agree with you, until further testing, chemical and otherwise, I guess it’ll continue to be an anomoly..","date":"2011-07-17","mins":"1:08 am","url":"https://shroudstory.com/2011/06/13/david-rolfe-interview-with-avinoam-danin-on-the-shroud-of-turin/","cat":"books","title":"David Rolfe Interview with Avinoam Danin on the Shroud of Turin"},{"id":"comment-3354","author":"ron","post":"Episcopalian :Ron, can you send me the image that you are talking about. I can post it here if it is a jpg, gif, png, etc.. Send it to drporter@optonline.net. Dan Porter Done. Ron..","date":"2011-07-17","mins":"6:52 pm","url":"https://shroudstory.com/2011/06/13/david-rolfe-interview-with-avinoam-danin-on-the-shroud-of-turin/","cat":"books","title":"David Rolfe Interview with Avinoam Danin on the Shroud of Turin"},{"id":"comment-16829","author":"ron","post":"Price and Lowder, obviously have no clue what they are talking about or don’t care, it’s just another cheap shot book written to make money. Joe your mention that Matthew and Mark do mention a Sindon obviously was overlooked, along with the fact both Matthew and Luke were most likely not at the crucifixion or the tomb. But John and Peter were, John most likely accompanied the burial procession and was aware of the way Jesus was ultimately entombed. John’s mention of the burial cloth(s) and the Sudarium (being apart from the others), along with something ‘special’ about thier condition obviously led to his instant belief in the resurrection. The cloths were found in the tomb, that is undeniable and if Jesus’s body was ‘stolen’ it is obsurd to think the thieves would carry off with the body, not still wrapped in it’s cloths. R.","date":"2012-09-23","mins":"10:21 pm","url":"https://shroudstory.com/2012/09/23/downright-stupid-analysis-in-the-empty-tomb-jesus-beyond-the-grave/","cat":"books","title":"Downright Stupid Analysis  in The Empty Tomb: Jesus Beyond the Grave"},{"id":"comment-17107","author":"ron","post":"The reaping of the harvest parable, is a very ‘telling tale’ of God’s final judgement. Not all will be saved is very clear! Those who love the world and ‘worldly’ things over Jesus, and especially those who denounce Jesus and his message, will suffer the consequences. This IS the reality of Jesus’s message…No one should kid themselfs of any other reality. R.","date":"2012-10-01","mins":"2:37 am","url":"https://shroudstory.com/2012/09/23/downright-stupid-analysis-in-the-empty-tomb-jesus-beyond-the-grave/","cat":"books","title":"Downright Stupid Analysis  in The Empty Tomb: Jesus Beyond the Grave"},{"id":"comment-9071","author":"ron","post":"Good points RC, and thanks for the clarification below about the carpal bones. R.","date":"2012-03-08","mins":"8:16 am","url":"https://shroudstory.com/2012/03/05/even-more-on-archaeology-from-tabor-and-jacobovic/","cat":"books","title":"Even more on Archaeology from Tabor and Jacobovic"},{"id":"comment-9069","author":"ron","post":"I don’t know if using scripture can ever be described as being ‘dubious’, especially if one believes in scripture….Then there is the simple fact of an ossuary of Jesus actually existing makes no sense, in so many ways. Such as Why? Why would anyone have an ossuary created for one whom they believed had risen and were also preaching he had risen? Wouldn’t that be a little strange or counter to one’s ideals? Where did the carpel bone come from? as everything pertaining to the body including any blood which could be captured, would have been buried within the Shroud as required by Jewish law. Remember nothing was mentioned found in the tomb but a few cloths. So in this story, basically one is to believe someone found a carpel bone in the tomb (even though christ’s body had been raised in entirety), held onto it for a year then placed it in another tomb? Also although none of these members of the family were from Jerusalem, none of the ossuaries state those buried were from another location, which was customary to do so. The Mariamne ossuary (very dubiously depicted as that of Mary Magdelene) can basically be eliminated from any statistical calculation, which was my point. Just because a Jesus family tomb has yet to be found anywhere else doesn’t give any more credence to the Talpiot tomb and in fact there is no proof that anyone of Jesus’s family stayed in Jerusalem whatsoever, (that I am aware of) except James who was (apparently) stoned in Jerusalem. The James ossuary and using the patina has any kind of evidence is quite dubious as it may have come from the same area or even the same hill. Personally I’d like to believe the James ossuary in itself is real but unfortunately since it’s provenance is not known (being it was not professionally escavated) and the bones were discarded we will never know for sure….I was actually quite lucky to view the ossuary when it was here at the Royal Ontario Museum in Toronto. R.","date":"2012-03-08","mins":"7:43 am","url":"https://shroudstory.com/2012/03/05/even-more-on-archaeology-from-tabor-and-jacobovic/","cat":"books","title":"Even more on Archaeology from Tabor and Jacobovic"},{"id":"comment-9115","author":"ron","post":"Truthfully, I don’t think this argument can ever come to a conclusion, we must just settle on our own interpretations. As our friend Dave pointed out, this whole Tomb thing has been totally messed up from the start…For me, it would just be pure conjecture from this point on, to come to any conclusion(s). As in many archeaological finds, it is inconclusive and hopefully with some luck they will find more tantilising ‘finds’ in the future (and record them properly and professionally)…. This topic leads me to wonder; Why much, much more has not been found? In the decades of these Jewish burial practices one would think there would be tens of thousands of tombs and ossuaries to be discovered, and what about the ‘mass graves’?? One can only expect more is still to be discovered….I look forward to it anyway : ) R.","date":"2012-03-09","mins":"10:02 am","url":"https://shroudstory.com/2012/03/05/even-more-on-archaeology-from-tabor-and-jacobovic/","cat":"books","title":"Even more on Archaeology from Tabor and Jacobovic"},{"id":"comment-9019","author":"ron","post":"Although I agree with Daveb that this whole tomb business has been ‘screwed up’ and possibly since the beginning; ‘somewhat’, I will add. One must contemplate a couple of things; The carpal bone found in the ossuary bothers me, as scriptures clearly state ‘not a bone will be broken’, doesn’t it? Then one must understand the Jesus family tomb would most likely not be located in Jerusalem, and if it was, it would definately be noted on the ossuaries along with the names, as that was tradition e.g; (Jesus of Nazarath). The James ossuary has absolutely nothing to do with this tomb whatsoever (this was a rather dubious conjecture made by Simcha) as this was their ‘missing’ 10th ossuary which turns out was not missing at all, but a unmarked, empty and broken ossuary noted in the original tomb escavation, as stated in the video link I posted…I’m not making a definate statement here to my consideration of whether or not this can be the Jesus family tomb but just saying it seems improbable from all the evidence and also recognizing the mis representation of evidence put forth by a couple of dubious money+media hungry people. Oh and as for the statistics on names; remember Simcha et al, also make a dubious claim with absolutely no grounds; that the Mariamne ossuary is that of Mary Magdelane…pure conjecture! R.","date":"2012-03-07","mins":"10:15 am","url":"https://shroudstory.com/2012/03/05/even-more-on-archaeology-from-tabor-and-jacobovic/","cat":"books","title":"Even more on Archaeology from Tabor and Jacobovic"},{"id":"comment-8892","author":"ron","post":"Hi Daveb, for a very informative video in rebuttal of the Talpiot tomb Documentary by Cameron/Jacobovici and it’s proposed findings please go to You Tube and search for; The Jesus Tomb Unmasked. This video will show how preposterous the whole theory is. R.","date":"2012-03-02","mins":"10:39 am","url":"https://shroudstory.com/2012/03/01/fasten-your-seatbelt-more-archeology-from-tabor-and-jacobovic/","cat":"books","title":"Fasten your seatbelt: More Archeology from Tabor and Jacobovic"},{"id":"comment-5574","author":"ron","post":"Yannick Clément :You know what I think Ron, I think the Shroud is a SIGN. And, as I know, a SIGN always point to something else that is the goal ! And, in the case of the Shroud, the SIGN point directly to a person, Jesus Christ. So, it’s not the Shroud and his image formation mechanism (whatever it can be) that is important, it is the person depicted on the Shroud and the message he bring to all mankind. That’s what is important. If the Shroud would disappeared or been destroyed, that wouldn’t be a disaster because we know it was there and real. We know it was a SIGN that point into one direction : Jesus Christ and his message of Love. That’s what really matter to me. The Shroud is a material object, like the empty tomb was. It’s not important in itself. What matters is the man and the message he point to. And I would also say this : genuine or not, it’s not even so important because I’m sure that the Holy Spirit use this cloth for a good purpose which is this : bring many people closer to the real God reveal by Jesus Christ and especially by his death on the cross. As St Paul said : We believe in a Christ, and in a crucified Christ. That was the heart of St Paul message. A crucified Christ = Love for all mankind. That’s what is really important. Yannick I think you misinterpreted my statement and I was literally asking you a question of whether you think the image formation can be a sign on its’ own! …In My last statement, I was trying to say that non believers (most anyways) will not listen to most reasoning so maybe since they will listen to logic or science, God gave them a sign also in the shroud to prove what we believers already know. Just as Jesus had to literally show Thomas his wounds. Unlike you I think the Shroud is important and also the first Gospel, directly from God. R.","date":"2011-12-15","mins":"1:09 pm","url":"https://shroudstory.com/2011/12/14/forensic-chemistry-handbook-an-embarrassingly-unscientific-chapter/","cat":"books","title":"Forensic Chemistry Handbook: An Embarrassingly Unscientific Chapter"},{"id":"comment-5603","author":"ron","post":"You say “Faith by definition , doesn’t rely on any proof”…In a perfect world maybe! and a perfect soul. Even the disciples whom followed Jesus for years, in the end, needed proof. And God knew this (and also that man in general is just that cynical). Why did Jesus have to return and show himself to the disciples? Because he knew they didn’t have the ‘faith’ to ‘believe’, go forward, and spread his church…Why is Jesus not here? God cannot dwell on this earth, but he gave man free will, and he’s given man signs over and over again in so many ways. By leaving a sign to me does not seem like ‘forcing’ anyone. It’s basically; here’s a sign, a proof that I am here, now think about it. He wants everyone to have the chance to witness his love. I also do not see it as anything close to idolatry. You assume this my friend, if one can view the shroud, hopefully grasp it’s message, you see this as idolatry? …nonsense. This thinking stems from Church thinking, which personally I do not agree with (In this case). Read the 4th commandment again closely, please. Finally if what you say is true, why is the Shroud here at all? If believers don’t need it because they have faith and non believers will not see it for what it is, then again why the Shroud? R.","date":"2011-12-16","mins":"4:51 am","url":"https://shroudstory.com/2011/12/14/forensic-chemistry-handbook-an-embarrassingly-unscientific-chapter/","cat":"books","title":"Forensic Chemistry Handbook: An Embarrassingly Unscientific Chapter"},{"id":"comment-5526","author":"ron","post":"Although I agree 100% with your statement, don’t hold your breath for a ‘rebuild’! I think there is alot of powerful people who don’t want this to happen or for the ‘truth’ to come out!. This is the only real causation I can conclude after weighing all the ‘murkiness’ over the years….and I am not a conspiracy theorist or whakco, but something is definitely going on here. R.","date":"2011-12-14","mins":"9:29 pm","url":"https://shroudstory.com/2011/12/14/forensic-chemistry-handbook-an-embarrassingly-unscientific-chapter/","cat":"books","title":"Forensic Chemistry Handbook: An Embarrassingly Unscientific Chapter"},{"id":"comment-5627","author":"ron","post":"Yannick Clément :If you need proof to believe my dear Ron, you must be the saddest of man… You seem to be a little confuse about “sign” and “proof”. Read again the Gospels of the apparition of Jesus resurrected. Everytime, they had difficulties to recongnize him ! He wasn’t the same no more ! He didn’t impose is presence to them and they were still free to believe in him or not ! If he would have appeared to them exactly in the same human body form that he had before is death, that would have been a forced belief and he wouldn’t have respected the free will of his beloved disciples. God don’t force anybody to believe in him. If there was a proof of Jesus resurrection, it wouldn’t be respectfull of our free will… THE FACT IS : THERE’S NO PROOF. FAITH IS NEEDED. But you’re free to see proof where there’s just a sign… I am definitely not the confused one here my dear Yannick, I do not need any ‘signs’ or ‘proof’ to have faith, I have known Jesus since I was a wee little lad ; ). I was speaking of others who lack faith or others whose faith has waned. Seriously, I really think you should read the Gospels again (CAREFULLY) as Jesus did SHOW himself to all 11 apostles and many others, CLEARLY. Also ONLY FEW DID NOT RECOGNISE HIM AT FIRST. When he showed himself to the disciples including Thomas and had them insert their fingers into his wounds; How is that not “imposing” my friend?. He spent 40 more days and nights with them and others, all knew who he was. There was no question at all! …That is how they recieved his spirit and the faith to go out and preach the word without fear. To think otherwise is preposterous. R.","date":"2011-12-16","mins":"3:48 pm","url":"https://shroudstory.com/2011/12/14/forensic-chemistry-handbook-an-embarrassingly-unscientific-chapter/","cat":"books","title":"Forensic Chemistry Handbook: An Embarrassingly Unscientific Chapter"},{"id":"comment-5628","author":"ron","post":"Yannick Clément :Last comment about the risk of idolatry with the Shroud. What is idolatry in your mind ? Here’s my own definition : Idolatry is when you focus far more your attention on the physical sign than on the person this sign point to (Jesus Christ). You don’t see a risk of this with the Shroud ? I see it everyday here on this blog !!! That’s why the Church to “use” the Shroud to convert people or to promote his teaching… And it’s a VERY good thing that the Church act like that. The Shroud is nothing important. Jesus Christ is the center of our belief. Nobody should need the Shroud to believe in Jesus. Geez sometimes Yannick you can be pretty daft, sorry but it’s true. Not once did I say one must idolize the Shroud. But the Shroud is here and if you believe it is here because God created it, and wanted us to see it, then how can it be idolatry to accept it’s message, it’s ‘sign’. Not placing it ahead of God but seeing it as a sign of what he did for us and a proof of his love for us….Is that clear enough? If by the wonderment of this Shroud, meaning, it’s inability to be understood ‘scientifically’, it brings some to question thier worldviews and thus to try to find God, what possibly can be wrong with that? The Shroud does not force anyone to do anything, it is an inanimate object…For someone who claims to have faith in Jesus you seem to have a hard time believing this may be a direct gift from God….atleast it seems that way from your comments. R.","date":"2011-12-16","mins":"4:06 pm","url":"https://shroudstory.com/2011/12/14/forensic-chemistry-handbook-an-embarrassingly-unscientific-chapter/","cat":"books","title":"Forensic Chemistry Handbook: An Embarrassingly Unscientific Chapter"},{"id":"comment-5529","author":"ron","post":"Yannick have you ever considered that the ‘image formation’ or cause of, may be part of the message? The Shroud may have several messages all bound into one simple cloth! Only something God could pull off! …For Catholics, Christians, believers, it is sign of love and to stay the course in all the turmoil of our present ‘world thinking’. The image formation alone, may be a sign to all the non believers, skeptics, ‘science only brains’ out there, saying; Here you want proof? Wrack your brains over this for awhile….this is my interpretation ofcourse of it’s possible meaning. R.","date":"2011-12-14","mins":"9:53 pm","url":"https://shroudstory.com/2011/12/14/forensic-chemistry-handbook-an-embarrassingly-unscientific-chapter/","cat":"books","title":"Forensic Chemistry Handbook: An Embarrassingly Unscientific Chapter"},{"id":"comment-5650","author":"ron","post":"OMG Yannick seriously please read my posts carefully!. Once you do I would suggest YOU re visit the Gospels and particularly any mentions of Jesus’s appearances after the tomb. Then you will clearly understand that all the disciples knew and recognized Jesus, undoubtably!. Secondly no one has said the Shroud is a “miraculous object with special powers”, only a sign! Also if one believes that this Shroud has been left here by God, as I do, then in that sense it is a ‘Sign from God’…It possesses maybe special knowledge, that is quite obvious since it cannot be explained by our finest minds. So in that context, again; If that special knowledge can be noticed or can attract non believers minds to question his or hers ‘worldview’ and possibly have them think “hey maybe there is something to this Jesus thing”, it may cause them to start their own personal search for Jesus. Think of the Shroud same as the tablets of the Ten commandments, they were inanimate objects but created by God and for us to follow and learn from…same principle, same difference. No one would idolize the tablets themselfs, but the one who made them. R.","date":"2011-12-17","mins":"10:22 am","url":"https://shroudstory.com/2011/12/14/forensic-chemistry-handbook-an-embarrassingly-unscientific-chapter/","cat":"books","title":"Forensic Chemistry Handbook: An Embarrassingly Unscientific Chapter"},{"id":"comment-5528","author":"ron","post":"As for this blog topic; After reading the passages Dan has posted above from the book, I personally would not be able to trust anything else written in this book! If the author(s) could be that one sighted and dare I say ‘purposely ignorant’ of the true facts on just that one topic, what else would one expect from the rest of the book? …Hense I will never purchase it. R.","date":"2011-12-14","mins":"9:41 pm","url":"https://shroudstory.com/2011/12/14/forensic-chemistry-handbook-an-embarrassingly-unscientific-chapter/","cat":"books","title":"Forensic Chemistry Handbook: An Embarrassingly Unscientific Chapter"},{"id":"comment-38105","author":"ron","post":"Max I agree with you on the coin issue in most respects. I do not think the “coins over the eyes issue” can be dismissed as easily as some have so easily speculated. This includes Dan by the way. Max I have read, a while back that is, so I cannot find the reference; That several skulls were found in Jerusalem caves, one with a coin still in the skull cavity. But in this study it was excluded that a coin could, if placed over the eye socket, find it’s way out of the skull cavity unless the skull ended up in the upright position. So it was concluded the coin was placed over the eyes during burial. Also, I could find no issue in all my readings of ancient Jewish culture, in placing coins over the eyes. So my point is that it is not controversial that coins may have been used in a first century Jewish burial, and/or to possibly keep the eyes closed(?). The pagan ritual was to place a ‘single’ coin in the mouth, not over the eyes, is also another point I have read in archaeological findings. Your comments… R.","date":"2013-06-26","mins":"12:36 pm","url":"https://shroudstory.com/2013/06/21/getting-dizzy-reading-venerosos-the-chimera/","cat":"books","title":"Getting Dizzy Reading Veneroso’s The Chimera"},{"id":"comment-38112","author":"ron","post":"David Goulet : I also wouldn’t find it odd that a coin was placed on a Jewish body, but this wasn’t just any Jewish body – if we assume it was Jesus. It was that of a messianic figure (to his believers). He was put to death, brutally, by Romans on the command of Pontius Pilate – who was goaded into the act (according to the Gospels) by the Jewish authorities who claimed Jesus was no friend of Caesar (true enough). It seems then exceedingly strange that his followers would place an image of the governor who sentenced him to execution onto his body. It’s like saying ‘Rome wins’. Why would they do that? If it was just to keep the eyes closed, I’d think they’d have used anything, a stone, a stick…anything but a coin that had the face of the oppressor on it. Good point, but there is a chance that because of time restraints, lack of materials, whatever, they had to compromise in the situation. There is also the possibility that at the time of burial, no one was actually believing he was the messiah, (at least that is what scriptures tells us) hence no issue with using coins. R.","date":"2013-06-26","mins":"3:43 pm","url":"https://shroudstory.com/2013/06/21/getting-dizzy-reading-venerosos-the-chimera/","cat":"books","title":"Getting Dizzy Reading Veneroso’s The Chimera"},{"id":"comment-3296","author":"ron","post":"Yannick, It is a pleasure to read your comments.Have you seen the History channel Documentary “The true face of Jesus”? In the film it shows and talks about Dr Jacksons hypothesis for the 4″ strip sewn onto the side of the Shroud.I personally believe Dr Jackson is right on with his hypothesis and it does explain very well the term linen strips as mentioned in the NT.Furthermore you may be interested to read a paper by the late Albert R. ‘kim’ Dreisbach called Lazerus and Jesus, it can be found at Shroud.com, it is a very insightful article possibly explaining some of the passages in John 20,: and the reason the Shroud is never mentioned in the Gospels. R..","date":"2011-07-02","mins":"9:18 pm","url":"https://shroudstory.com/2011/05/16/jesus-of-nazareth-holy-week-from-the-entrance-into-jerusalem-to-the-resurrection/","cat":"books","title":"Jesus of Nazareth: Holy Week: From the Entrance Into Jerusalem To The Resurrection"},{"id":"comment-21266","author":"ron","post":"NONSENSE! No one can say, in the case of the Jospice mattress when exactly the image was formed, i.e during life or after death, no one!…You have just speculated wildly! Anyways the Jospice mattress in ALL commonsense, CAN NOT be compared whatsoever with the Shroud. The Jospice image has saturated into the material, the Shroud image is superficial. We are talking completely different material here; BIG difference. How can anyone even consider comparing the two is beyond me. Unless of course they are of the fundamentalist materialistic bunch, grasping at straws to find some kind of reference to the ‘Indefinable’ image found on the Shroud. R.","date":"2012-12-28","mins":"2:52 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"id":"comment-21083","author":"ron","post":"Gerard: “Why could not the moment of resurrection record the state of the corpse? Perhaps at the moment of dematerialisation? The image on the cloth shows a dead body. The image exists because of the resurrection event. Science has proven the first but so far has not disproven the second.” You hit the nail right on the head Gerard with this comment, and something I think Yannick among others need to really contemplate on. Best wishes over the holidays everyone. R.","date":"2012-12-24","mins":"10:15 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"id":"comment-11606","author":"ron","post":"Well I liked his line in the film, where he says we have two eyes, thats how we can catch a baseball ; ) R.","date":"2012-05-25","mins":"6:30 pm","url":"https://shroudstory.com/2012/05/25/lawrence-krauss-of-the-real-face-of-jesus-is/","cat":"books","title":"Lawrence Krauss of the Real Face of Jesus is . . ."},{"id":"comment-10996","author":"ron","post":"I got ‘nothing’ from this post, literally. ; ) R.","date":"2012-04-30","mins":"10:22 am","url":"https://shroudstory.com/2012/04/30/krauss-i-dont-really-give-a-damn-what-nothing-means-to-philosophers-i-care-about-the-nothing-of-reality/","cat":"books","title":"Krauss:  I don’t really give a damn what \"nothing\" means to philosophers; I care about the \"nothing\" of reality.\""},{"id":"comment-33298","author":"ron","post":"The sad part is, some people will actually buy his book. R.","date":"2013-05-09","mins":"1:14 am","url":"https://shroudstory.com/2013/05/08/joe-nickells-new-book-the-science-of-miracles/","cat":"books","title":"Joe Nickell’s New Book: The Science of Miracles"},{"id":"comment-8684","author":"ron","post":"I think it would be an interesting book to read, even for the more knowledgeable on the subject of the Shroud, but moreso for the novice. Which comes to the point; I think it would be a diservice to many people of the world, if it was not translated. R.","date":"2012-02-24","mins":"10:53 pm","url":"https://shroudstory.com/2012/02/24/new-book-coming-out-on-the-shroud-of-turin-in-portugal/","cat":"books","title":"New Book coming out on the Shroud of Turin in Portugal"},{"id":"comment-6375","author":"ron","post":"Just happens I received a certain book retailers gift card for Christmas, I look forward to reading Joseph’s book…It should be interesting to say the least. Ron.","date":"2011-12-31","mins":"11:08 am","url":"https://shroudstory.com/2011/12/31/new-book-wrapped-up-in-the-shroud-of-turin-chronicle-of-a-passion-by-joseph-g-marino/","cat":"books","title":"New Book: Wrapped Up in the Shroud of Turin, Chronicle of a Passion by Joseph G Marino"},{"id":"comment-27926","author":"ron","post":"Svein, kindly, before you go making comments such as; “I think it looks like a religious hysterical wishthinking hoax.” on this site, may I suggest you open your mind, leave any preconceptions behind, and then do some serious research on the matter. Your comment on the sweat cloth alone shows your total lack of knowledge on the matter. Thanks, R.","date":"2013-03-20","mins":"2:55 pm","url":"https://shroudstory.com/2013/03/17/new-book-recycling-jesus/","cat":"books","title":"New Book: Recycling Jesus"},{"id":"comment-6994","author":"ron","post":"To Helmut, with all due respect. “Religious stories of your Youth”? Alot of people thru the ages with much much more intelligence then you could ever claim, believed these “stories” and many have raised the same issue that Chris has: Why would these Apostles rather suffer terrible deaths then just refute their teachings? The answer is simple; They believed it to the point of dying for their beliefs! Would you die for what you say/believe here? Secondly you make the assumption that a burst of energy to create the Shroud image is proposturous, WHY? Because your mind is closed to ALL possiblilities, this is why!…This is not the true method of science my friend. Science has no boundaries and until we can honestly say we understand all things, we should not refute ‘possibilities’, just because we don’t understand them. As for Christ surviving the crucifixion, it is just plain ‘Idiotic’ to think so. All the evidence points to certain death. You have just blinded yourself to the truth. The evidence we all can see on the S Hroud is pretty straight forward. If he had survived and removed himself from the S Hroud we would have certain unmistakable traces of this, such as much more blood, more blood smeared all over the Shroud, “certain’ flattening on the dorsal image etc; etc; Let’s also not forget the crucifixion was accomplished by Roman crucifixion experts, what is the possibility they would have allowed Jesus taken from the cross, not being certain of his death?…I could go on forever here, but I think I made my point….Face it, your misleading yourself. R.","date":"2012-01-15","mins":"7:07 am","url":"https://shroudstory.com/2012/01/09/new-kindles-from-helmut-felzmann/","cat":"books","title":"New Kindles from Helmut Felzmann"},{"id":"comment-6307","author":"ron","post":"It is also amazing that people can read those passages and get the ‘notion’ that the Shroud cannot agree with the description of what was found in the tomb??? This one rediculous ‘notion’ has been beaten to death, and maybe in a sense proves ‘some’ may be blinded to the truth, as also mentioned in scripture. R.","date":"2011-12-30","mins":"2:51 pm","url":"https://shroudstory.com/2011/12/29/political-pistachio-some-scientists-claim-shroud-of-turin-is-authentic/","cat":"books","title":"Political Pistachio: Some Scientists Claim Shroud of Turin is Authentic"},{"id":"comment-24327","author":"ron","post":"I cannot comment on the book as I have not read it, nor can I put into writing my thoughts as eloquently as Hugh or Dave, but here is what goes thru my mind when I hear stories of Jesus traveling to India or anywhere else; Where is the archaeological proof of these travels? Why would these travels not be mentioned in the Gospels? Most importantly why would Jesus need to travel to these areas, if he was whom he claimed to be? I don’t believe for a moment, that there is anything he would have gained from these travels that he already did not know, things such as wisdom or knowledge or enlightenment etc;….Why is it so hard for people to consider that he simply bide his time as a simple builder, until it was his time to shine. R.","date":"2013-02-15","mins":"2:31 am","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","title":"The Evidence Strongly Suggests Nothing of the Kind"},{"id":"comment-24390","author":"ron","post":"The link does not seem to work Maria. Thanks, R.","date":"2013-02-15","mins":"4:01 pm","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","title":"The Evidence Strongly Suggests Nothing of the Kind"},{"id":"comment-10256","author":"ron","post":"Dumb is, what dumb thinks, lol…Mr.Johnson is right, I guess de Wesselow didn’t think about Saul of Tarsus and his hate for Christians. It would have been more likely, if the Shroud was all he saw that he would have had the people who had shown him the Shroud arrested and stoned to death for breaking a serious Hebrew Law; (being in possession of a three times unclean burial cloth). Unless one believes the Shroud ‘appeared’ to Saul floating in the air and speaking to him…NOT. I think it’s pretty obvious to anyone with even a slight knowledge of scripture and of the Shroud, that de Wesselow has not done much research ‘himself’ and just made this all up from a very uninformed imagination…From all the media he’s getting though, I’m sure his goal of making a quick buck will be fullfilled. R.","date":"2012-04-10","mins":"9:57 am","url":"https://shroudstory.com/2012/04/10/the-single-dumbest-idea-in-the-history-ofdumb-stuff/","cat":"books","title":"The single dumbest idea in the history of…dumb stuff"},{"id":"comment-11134","author":"ron","post":"I found another review of the book here: http://www.elizabethawhite.com/2012/04/23/the inquisitors key by jefferson bass/.","date":"2012-05-04","mins":"7:16 pm","url":"https://shroudstory.com/2012/05/03/the-inquisitors-key-a-pre-release-book-review/","cat":"books","title":"The Inquisitor’s Key: A Pre-Release Book Review"},{"id":"comment-3757","author":"ron","post":"I agree with you Dan, the right reasons should be taught and it is an important point. Also it should be taught that C 14 is NOT infallible, which it is not by far and there are many examples to back that statement up. Furthermore, it should be expressed strongly, that no single c14 dating sample should be looked at as 100% proof of anything. It must be understood; ALL information must be taken into account as a whole and that more then one sample is required from ‘different areas’ for c14 tests to be reasonably conclusive, which definitely was not the case with the Shroud. Ron.","date":"2011-09-01","mins":"11:36 am","url":"https://shroudstory.com/2011/09/01/the-shroud-of-turin-carbon-dating-in-a-school-textbook/","cat":"books","title":"The Shroud of Turin Carbon Dating in a School Textbook"},{"id":"comment-11390","author":"ron","post":"Reputable researchers…..LMAO. R.","date":"2012-05-16","mins":"3:03 pm","url":"https://shroudstory.com/2012/05/16/two-reputable-researchers-professional-skeptic-joe-nickell-and-forensic-anthropologist-emily-craig-really/","cat":"books","title":"“Two reputable researchers, professional skeptic Joe Nickell and forensic anthropologist Emily Craig” Really?"},{"id":"comment-6726","author":"ron","post":"I have to agree with Tersio’s statement and I realize Mr. Felzmann has the right to his opinion, but his opinion can and IS completely wrong!. It seems he has decided to refute all medical studies by no less then three world renowned forensic pathologists, which state this man depicted on the Shroud was “definitely dead”. One needs only look at the side wound to recognize this, as it shows quite clear blood flow, but most importantly a watery flow most certainly that of pericardial fluid from the pleural cavity…this is a certain “POSTMORTEM WOUND”, if the “shock” from the scourging, beating, nail wounds, head wounds and loss of blood weren’t enough!! The Shroud itself also shows no signs of resuscitation; exhale gases from the mouth or nose area for instance or any ‘distortion’ from movement caused by inhaling/exhaling….again I agree with Tersio; “This statement is completely obsurd” R.","date":"2012-01-09","mins":"4:25 pm","url":"https://shroudstory.com/2012/01/09/new-kindles-from-helmut-felzmann/","cat":"books","title":"New Kindles from Helmut Felzmann"},{"id":"comment-4558","author":"ron","post":"That may be true, but we should not also ‘assume’ a selection phenomenon. We all must remember that most all 3 D or pseudo 3d renderings, show quite clear that there are objects on the eyes, as you are quite familiar with Ray. What these ‘objects’ are is still a mystery and unlikely to be ‘noise’ or a remnant of the weave…and I should add; I hope that we have not seen the “best of the enhancements” as of yet. Great to see you on here too Ray! R..","date":"2011-11-04","mins":"10:41 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue"},{"id":"comment-4023","author":"ron","post":"I think the link to the article listed above may be broken or dead. I can’t seem to get to it anyways..","date":"2011-09-24","mins":"2:44 am","url":"https://shroudstory.com/2011/09/17/paper-chase-what-did-jung-see-in-the-shroud/","cat":"news_&_views","title":"Paper Chase: What did Jung See in the Shroud?"},{"id":"comment-3504","author":"ron","post":"This is a very interesting paper and as mentioned, it does draw us to meditate many things and would most definitely warrant much discussion.I’ll keep my thoughts about his hypothesis to myself at the moment though ; ) …I was hoping someday someone would bring up those two angels in the tomb, as I read an interesting paper written by the late Albert R.Dreisbach, titled; “Lazarus” and Jesus, 2005 I believe, which can be found at Shroud.com.Maybe an article Dan can post here as it is very interesting and I for one would love to hear others thoughts on it’s relevance, determination and conclusions. I for one do not believe there was ever any Angels at the tomb! I have believed this since I was very young in my catholic schooling days and we were discussing the writings of Paul and more precisely the chapters leading to the crucifixion and burial and onward.It just came to me as a surprise that all of a sudden John mentions Angels, when he had never before in his writings.His writings to me seemed very ‘grounded’ and historical minded to that point.So when the angels were mentioned it just for a better sense of a word ‘flipped a switch” in my head, I couldn’t explain it then and I actually pressed the issue with my teacher which didn’t go well to say the least.Anyways I had totally forgotten about that small incident in my life until I read this paper by Rev.Dreisbach and it just hit me like a sledgehammer when he mentions the Angels in his paper and thier ‘meaning’ in the scriptures to the actual Shroud.If anyone has not read this piece, I highly recommend you do. Thanks for listening, Ron.","date":"2011-08-01","mins":"7:34 am","url":"https://shroudstory.com/2011/07/25/paper-chase-the-shroud-of-turin-from-the-viewpoint-of-the-physical-sciences/","cat":"news_&_views","title":"Paper Chase: The Shroud of Turin From the Viewpoint of the Physical Sciences"},{"id":"comment-195557","author":"ron","post":"Thanks for the upload Dan : ).","date":"2015-04-07","mins":"2:25 am","url":"https://shroudstory.com/2015/04/06/audio-of-barrie-schwortz-on-coast-to-coast/","cat":"radio_and_podcasts","title":"Audio of Barrie Schwortz on Coast to Coast"},{"id":"comment-13784","author":"ron","post":"Well said Andy, there is also the issue in that no traces of myrrh or aloes have been found on the Shroud! Unlike such that was found on the Sudarium of Oviedo and on the blood to be more precise. The cloth body distance relationship is also a strong proponent to any gas diffusion or chemical reaction type formation, (keeping the high resolution of the image in mind). R.","date":"2012-07-12","mins":"2:45 pm","url":"https://shroudstory.com/2012/07/06/an-image-in-myrrh-resin-do-the-math/","cat":"video","title":"An image in Myrrh Resin? Do the math?"},{"id":"comment-11270","author":"ron","post":"David, pertaining to your second paragraph above, two questions about your aloe, myrrh hypothesis; If the body and blood were covered in myrrh and or aloes, it would have to have been done before the body was shrouded/covered. If this is so, why is there no sign of myrrh underneath the blood on the fibrels and how if covered in myrrh, did the blood soak into the cloth as a liquid, with no trace of either substance on the Shroud? Sorry this does not jive for me. It’s as speculative as the vinegar story above which is complete nonsense as Jesus refused to drink, according to scripture, plus he would have had to drink quite abit to have any effect to his bodily fluid composition I would think. R.","date":"2012-05-11","mins":"2:20 am","url":"https://shroudstory.com/2012/05/09/a-search-for-shroud-of-turin-on-google-returns-2650-videos/","cat":"video","title":"A Search for Shroud of Turin on YouTube Returns 2,650 Videos"},{"id":"comment-8524","author":"ron","post":"Personally, with the quality of this film’s production, it’s essential to buy the DVD. I watch it thru my PS3 which upconverts it to 1080p then to my large screen LED….I have to tell you there is alot of detail I’ve picked up, that I’ve never seen on pictures alone, of the Shroud. : ) R.","date":"2012-02-20","mins":"9:17 am","url":"https://shroudstory.com/2012/02/20/the-real-face-of-jesus-discovered-again-the-beat-goes-on/","cat":"video","title":"The Real Face of Jesus discovered, again. The beat goes on"},{"id":"comment-5465","author":"ron","post":"I’ve watched this documentary a multiple of times, as I enjoy pausing it at certain points and with the exceptional picture quality many details can be viewed nicely. Anyways I agree with Yannick, the whole Gnostic thing seems ‘OUT THERE’ and actually to me the whole thing is confusing with statements like ” the whole universe was severed in two, so we don’t actually see the whole picture”! Like I said, I don’t understand completely what they were trying to say, and how it can relate to the Shroud. Otherwise it is a fine documentary. I just wonder who wrote the script?, if you pay attention they use the word ‘actually’ about twenty times in the first 10 minutes or so. Also some of the details where flawed or not explained properly which could lead to ‘misconception’ by the layperson of the Shroud, pertaining to it’s history and details. But, also like as I’ve said it was a good doc, probably one of the best out there so far. The History channel should air it more often, that is one of my beefs. Although slightly flawed, it is a good product to get to the masses. R.","date":"2011-12-12","mins":"7:21 pm","url":"https://shroudstory.com/2011/12/12/the-real-face-of-jesus-still-a-top-rated-production/","cat":"video","title":"The Real Face of Jesus Still a Top Rated Production"},{"id":"comment-39370","author":"ron","post":"I love listening to N.T. Wright and his perspectives. His thoughts of life, after life after death and the 1st century Jewish perspectives on life after death, is one very strong point to the authenticity and truthfulness of the Gospel writers and to the realism of the resurrection, as no one in that time actually ever contemplated a resurrection of the kind….awesome stuff : ) R.","date":"2013-07-21","mins":"3:00 am","url":"https://shroudstory.com/2013/07/19/imagine-taking-easter-out-and-there-just-isnt-a-story/","cat":"video","title":"Imagine taking Easter out and there just isn’t a story"},{"id":"comment-5484","author":"ron","post":"I don’t think anyone viewing the program would accept the face which Downing and company created as being a perfect likeness, close maybe. Fact is, even Downing states in the program, he had to take some “liberties”, but that it is ‘in all probability’ the closest portrait ever created to date, and I’d have to agree with him. This is of course if one believes the image on the Shroud is the actual Jesus of Nazareth. As a matter of coincidence, back in the 90s I had a neighbor, he was a Jewish gentleman and actually a veteran of the 67′ war, anyways I noticed immediately when first seeing the ‘face’ on the program, an uncanny resemblance to my friend. The bone structure, eyes, even the beard, hair and eyebrows!…it was alittle weird to say the least, almost sent a chill up my spine, thats’ how close the resemblance was. I wonder if he’s ever seen the program….anyways, just thought I’d share that little tidbit. ; ) R.","date":"2011-12-13","mins":"12:06 pm","url":"https://shroudstory.com/2011/12/12/the-real-face-of-jesus-still-a-top-rated-production/","cat":"video","title":"The Real Face of Jesus Still a Top Rated Production"},{"id":"comment-5651","author":"ron","post":"My thanks to Russ Breault and Dan ofcourse, for posting the this next airing. I’ll make it a point to mention it to most all I know!….Just hope the History channel airs it up here. R.","date":"2011-12-17","mins":"10:50 am","url":"https://shroudstory.com/2011/12/13/the-real-face-of-jesus-to-re-air-on-history-channel/","cat":"video","title":"The Real Face of Jesus to re-air on History Channel"},{"id":"comment-10266","author":"ron","post":"Haha “air heads” …well said Susana, I haven’t heard that expression in awhile. Nowadays I think the term most widely used is dumb ***. ; ) R.","date":"2012-04-10","mins":"4:45 pm","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding."},{"id":"comment-3437","author":"ron","post":"Holy Geez, I couldn’t watch more then 8 minutes of that youtube video, those guys are just plain retards.”I’m willing to listen to any credible evidence” why not search and ‘READ’ for yourself? These guys did not even research a single ‘credible’ thing before their no.3 episode let alone any peer reviewed papers.Typical of alot of the new generation growing up now, they want everything handed to them and too lazy to do the work themselfs.Personally I would just ignore them, last count they had 70 hits on thier latest video, can anyone say FAIL. They are not worth your time Dan.Or even anymore mention. Ron..","date":"2011-07-26","mins":"11:47 pm","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding."},{"id":"comment-3454","author":"ron","post":"Dominico, your so right.AND the worst part is the audacity of Nickell’s to claim Frei was “a jack of all trades”, when he alone is A Jack of All Trades AND a ‘Master of NONE’.Frei was an expert, a pioneer in his field and highly regarded by many of his peers.Can Nickell’s claim the same? I think NOT…Personally I give no credance to anything the man says and anyone who does should really do a re think. Ron.","date":"2011-07-28","mins":"4:22 am","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding."},{"id":"comment-28988","author":"ron","post":"From Ron, Ray did a wonderful service for all who love the Jesus and as any workman for hire he should receive what is rightfully his. Thank you Ray..","date":"2013-04-01","mins":"12:12 am","url":"https://shroudstory.com/2012/10/22/the-real-face-of-jesus-ray-downing-suing-ae-owner-of-the-history-channel/","cat":"news_&_views","title":"The Real Face of Jesus: Ray Downing Suing A&E, Owner of the History Channel"}]
