[{"id":"comment-136227","author":"charles_freeman","post":"Good research, Hugh. These look like interesting articles..","date":"2014-07-08","mins":"8:47 am","url":"https://shroudstory.com/2014/07/08/a-long-cloth-mandylion/","cat":"art","title":"A Long Cloth Mandylion?"},{"id":"comment-136241","author":"charles_freeman","post":"These articles are fascinating and show just how easily legends develop into new forms and how difficult it is to distinguish between originals and copies. Brock tells us that the Paris manuscript, illustrated above, was probably made in Rome and has no less than 22 scenes..","date":"2014-07-08","mins":"9:37 am","url":"https://shroudstory.com/2014/07/08/a-long-cloth-mandylion/","cat":"art","title":"A Long Cloth Mandylion?"},{"id":"comment-136203","author":"charles_freeman","post":"The setting for this ‘Mandylion’ appears western in inspiration. If you look, for instance, at the side of Siena cathedral, completed 1261 you will see a similar patterning of dark and light stone. Note also the Gothic rose window in the illustration. So as the Veil of Veronica is first recorded in about 1205, I suspect that this, or a copy of it, is what might be shown, but as we know this is only one of the veils showing just the face of Christ. Have we any evidence that it si the Mandylion from Edessa?? Or are you suggesting that this might be the Shroud being exposed when in the west in the thirteenth century?? Presumably this is the Bibliotheque Nationale in Paris. Accessing the manuscript may give further clues as to which veil/icon/or whatever this is as it seems to be part of an ongoing story..","date":"2014-07-08","mins":"7:01 am","url":"https://shroudstory.com/2014/07/08/a-long-cloth-mandylion/","cat":"art","title":"A Long Cloth Mandylion?"},{"id":"comment-99029","author":"charles_freeman","post":"The Holkham Bible of c1330 (images easily found on the web) has a naked Jesus on the cross..","date":"2014-04-13","mins":"4:03 pm","url":"https://shroudstory.com/2014/04/13/another-enduring-belief-question-jesus-in-the-nude/","cat":"art","title":"Another Enduring Belief Question: Jesus in the Nude"},{"id":"comment-61426","author":"charles_freeman","post":"And we also have the story that the Veil was looted by Lutheran soldiers in the sack of Rome in 1527 and was seen being hawked round the taverns for sale but then miraculously re appeared in St Peter’s some decades later. (Hans Belting, Likeness and Presence, p. 220, who gives as his reference A. Chastel, The Sack of Rome, Princeton 1983, p.104. Belting thinks that it actually perished in 1527.) Just a story maybe but that is the problem with all relics, contradictory legends about them abound!.","date":"2013-12-18","mins":"5:34 am","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica."},{"id":"comment-198196","author":"charles_freeman","post":"One day,Hugh, we will have a conference dedicated to those who believe that we should be exploring the Shroud within its medieval context. Before this, we need a database of all the early depictions, both copies and pictures of expositions, and descriptions of the Shroud who saw it early on so that we have some substantial evidence to work from. I laugh when I hear that the Shroud is the most researched artefact in history – the many early depictions make up an immense area where no research has been done at all! And we need to ask a loom expert to the conference none seems to be around here. I agree with you that when you look at all the early depictions, while there are certain features such as the Crown of Thorns and the long hair at the back of the head that appear again and again and have now disappeared, there are discrepancies between the depictions that need further exploration. Bearing in mind that the loin cloth may well have been painted on after the Council of Trent decree of 1563, is it possible that the Shroud itself was repainted or should we be exploring two different shrouds, one faint ,one brightly painted so that it could be seen at expositions as you suggest? All open to discussion neither of us are locked in to what might eventually be found. That is the fun of being a historian..","date":"2015-05-03","mins":"4:49 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-197861","author":"charles_freeman","post":"Sorry, Russ, I cannot imagine a worse nightmare than one with me in the star role..","date":"2015-04-28","mins":"2:25 pm","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","title":"Having Nightmares"},{"id":"comment-144906","author":"charles_freeman","post":"‘ looks like Apollo’. Well Zanker’s point was that pagan models were used for the bearded Christ..","date":"2014-08-20","mins":"2:08 am","url":"https://shroudstory.com/2014/08/19/matching-faces-is-it-possible/","cat":"art","title":"Matching Faces. Is it Possible?"},{"id":"comment-191821","author":"charles_freeman","post":"And although the fire marks have now obliterated this, every depiction of the Shroud from the Lirey Pilgrim badge on, shows the elbows of the dorsal image either lying alongside the back, or more usually with a gap. And as you will see from try Ing this lying down you cannot even reach the palms of the hands to cross them front let alone the wrists. Whenever I bring this up in lectures it causes great amazement as there is an assumption that the two body images must match each other..","date":"2015-02-25","mins":"1:43 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","title":"Maybe the Nails Didn’t Go Through the Wrists"},{"id":"comment-131123","author":"charles_freeman","post":"It appears that at some point a Shroud ‘researcher’ who knew nothing about the iconography of depictions of the Resurrection mistook the tomb lid as an actual depiction of the Shroud. Quite apart from the mistaken belief that this was a shroud, the fact that the pattern was stepped pyramids and not herringbones and that the holes were circular and that the L went the wrong way for a copy of the ragged and uneven poker holes, for some inexplicable ( well to me at least) reason this became a bandwagon from which it it seems impossible to pull some people off. No matter that there would be no reason to depict the poker holes but not the images. No matter that depictions of cloth relics, such as the hundreds of cases where cloths with the living face of Christ ( Edessa, Veil of Veronica and others) are always shown with the images intact by the artist. Here the artist has struck out on his own and produced a Shroud of Turin WITHOUT the double images that distinguish it from the other Shrouds being displayed as relics of the burial in this period. No matter that there were circular holes drilled into the Sepulchre in the tenth or eleventh century ( the sources seem to differ on the date but they were there for all the Crusaders to see at the time of the First Crusade (1099, capture of Jerusalem) and thousands of crusaders would have flooded back to Europe with the knowledge that there were circular holes in the sepulchre which by the twelfth century had become part of the iconography). No matter that it would have been virtually impossible at this date for a heretical Catholic to get into the Byzantine imperial relic collections. No matter, no matter. And all to suggest that the Shroud was around, as were many other ‘burial shrouds’, by 1195. I do believe that anyone who swallows this is dreaming. Much of the debate seems to rest on the conviction that this IS the Shroud WHATEVER and so there MUST be some explanation for every piece of evidence that this NOT the Shroud. P.S. Those who have read Beldon Scott’s major study of the Shroud will know that the holes from the fire of 1532 did become an object of veneration in the belief that the fire had miraculously stopped or been stopped without damaging the sacred images. This, according to Beldon Scott, is why they were always depicted with such care by artists. But the poker holes were never seen as sacred..","date":"2014-06-19","mins":"3:13 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-131200","author":"charles_freeman","post":"Daveb. If ,for whatever, reason, you have to see the Shroud in the Codex, you have to do what you have done and claim that the artist for some reason of his own was not, unlike the usual illustrator, actually painting a narrative picture but somehow creating a cryptic message through symbols. But why should he go against the whole artistic traditions of his time why is he trying to pass on some secret message when he could simply have painted the Shroud as it was? No doubt you can reply by imagining some reason but you will simply be piling up improbability onto improbability. Your basic problem is that you HAVE to see the Shroud but you or no one else would ever have seen it if someone had not misled you in the first place. I wonder who..","date":"2014-06-19","mins":"8:12 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-131196","author":"charles_freeman","post":"Thomas – I think that if this is the shroud which I don’t believe for a moment, then it could be evidence that it was already in the west by this time. I don’t think ‘narrow’ is the right word for someone who is not convinced by the evidence it might be more appropriate for someone who is convinced despite the lack of any evidence!.","date":"2014-06-19","mins":"7:58 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-131610","author":"charles_freeman","post":"Daveb. I don’t favour any one theory over another, other than the probability, rising from my own work on relic cults, that the Shroud is medieval. My point in all my contributions is to highlight areas where the evidence does not stack up. The fact that all you can now say about the lower register of the Pray Codex is that the illustrator ‘hints at the [Shroud] symbolically’ says it all to me why should he not just show it as other illustrators show the Images of Edessa and Veil of Veronica why the secrecy? ‘Hints’ are not good enough and we are concerned with the Shroud AFTER the Resurrection not BEFORE as shown in the upper register. We have lots of examples of Christ’s body being laid out I have been communicating with a US scholar who has done extensive work on this. The Pray Codex is an excellent example of its time in showing no flowing wounds while a hundred years later these wounds, still bleeding, are beginning to be illustrated in these scenes. The blood on the Shroud (and I am being neutral here) is either because it is blood from an actual body or because it is somehow related to the blood cults of the thirteenth /fourteenth centuries. I am also trying to highlight the many areas of research that still remain to be examined so far as the Shroud is concerned, notably the documented trade/import (including the Crusades) of relics directly from Jerusalem (even from ‘the Lords’ tomb’) to northern France.It may well be that relevant documentation is lost but to dismiss this area of research altogether is simply unscholarly (might I even say ‘narrow?’). On what grounds do you reject it as not even worthy of further examination, especially as it is not incompatible with the possible authenticity of the Shroud? One of the major problems is that there are all too many shrouds out there all claiming to be the real thing and this is why I only would accept depictions or descriptions of a Shroud depicted with a double image as evidence of the one which is now known as the Shroud of Turin. One must also remember that we have documented examples of thousands of painted linens used in churches for various ceremonial purposes (and never claimed as relics) and this complicates research still further. As an old fashioned historian trained in a particular way to examine and assess evidence, I have to admit to finding Max incomprehensible – in a class entirely of his own!.","date":"2014-06-20","mins":"4:36 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-129101","author":"charles_freeman","post":"No, the is the first chapter that looks at the antecedents of the later sculpture. Please don’t comment unless you actually know the book..","date":"2014-06-13","mins":"10:13 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-131674","author":"charles_freeman","post":"Can’t wait..","date":"2014-06-20","mins":"8:41 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-131786","author":"charles_freeman","post":"‘ provocative’ Well, that is very sad because it means new ideas and approaches to the evidence or lack of it are condemned out of hand..","date":"2014-06-20","mins":"3:10 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-131797","author":"charles_freeman","post":"There is room for both those who believe that on the balance of evidence that the Shroud is authentic and those like myself who believe that this unlikely to work together to open new avenues of research and accept that others, once favoured, are now redundant – I would put the Pray Codex in the redundant box, partly because it adds nothing anyway. (I suspect Hugh is in the same camp as I am.). The presentations at the St. Louis conference suggest that research is stagnant and largely repetitive. What is likely is that the solution to the ‘ mystery’ of the Shroud will come from outside the Shroud community probably from someone working on other linen artefacts, medieval or earlier, or iconography. There seems no awareness in the Shroud community as to just how much expertise on things like medieval linens and a ancient weaving techniques h ave moved on. Many are still stuck in the technology of 1978 as if that decided the composition of the Shroud and its images for all time. With research within the Shroud community so stagnant it seems likely that someone who has had nothing to with the Shroud, will come up with some evidence, probably relating to some other issue, that convinces the wider world for or against the authenticity of the Shroud. And the Shroud community risks being left on the sidelines either way..","date":"2014-06-20","mins":"3:39 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-131974","author":"charles_freeman","post":"I suppose no one has seen any significance in the red wavy lines because bloodstains, especially those on the Shroud, do not go in wavy lines..","date":"2014-06-21","mins":"2:22 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-131970","author":"charles_freeman","post":"As we wait for the definitive version from Max or OK, we need to remind ourselves what it may tell us. 1) that the Shroud was made before 1195, but not how long before that. It would not be incompatible with a medieval dating. 2) the difficulties of a Catholic getting into a Byzantine imperial relic collection to see the exposed Shroud are so immense, that it would provide circumstantial evidence,no more than that, that the Shroud was in the west by that date. I am sticking to needing evidence of the two images as ,for me, that distinguishes the Turin Shroud from its many rivals. I think that is quite reasonable..","date":"2014-06-21","mins":"2:09 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-131993","author":"charles_freeman","post":"I do think all the diplomatic links are important to follow up especially as Bella III had an early life in Constantinople, so lots of useful research to be done here, but the Pray Codex is western iconography, not Byzantine ( compare Max and his Benedictine claims). Never neglect a possible avenue of research! Anyone who had seen the Shroud exposed east or west would have seen the two images and this was an age when people advertised relics, not concealed them. I don’t see a single piece of evidence linking the Pray Codex to the Shroud but those who do need to explain why this relic had to be concealed in such a mysterious way and on a manuscript that seems never to have been circulated. This is clearly not a royal commission – much too basic. The common sense position is that the Codex falls within the conventional iconographic depictions of the day when the wounds of Christ were not emphasised or even shown ( later they became the major feature of such depictions). This suggests that the illustrator was either drawing his own shroud or depicting one of the many that were being displayed in Western Europe that had no bloodstains or images on them. Unless, of course, we have the first and only recorded images of wavy bloodstains. . . ..","date":"2014-06-21","mins":"4:06 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-132004","author":"charles_freeman","post":"I have no idea what they are. They are in red, the predominant colour on the Shroud so we know the illustrator was using that as a general colour. The fact that there are two parallel wavy lines might suggest he was being decorative but I wouldn’t know. Perhaps an expert in these things would know whether wavy lines have a particular significance. I did not know that circular holes on a Resurrection tomb lid represented the actual circular holes on the Sepulchre lid in Jerusalem that were in place when the crusaders saw them it was an ex pert who told me. Perhaps the same will happen here. Bloodstains very unlikely especially as the five wounds of Christ shown on the Shroud and iconography from the thirteenth century are not illustrated on the body. The illustrator is certainly not copying what might be blood from the Crown of Thorns as surely he would have reproduced the same pattern. So for me blood stains are at the bottom of the list unless an expert can show me a similar case..","date":"2014-06-21","mins":"4:45 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-129139","author":"charles_freeman","post":"If you have evidence from both illuminations and sculpture that there depictions of the Resurrection scene with circular holes in the tomb lid and if you know that in the Sepulchre in Jerusalem there actually were circular holes in the tomb lid, then you tend to agree with experts such as Forsyth that one is a copy of the other. It defies the imagination that these are copies of the irregular poker holes, especially as the L goes in the wrong direction if the Shroud is viewed from the front (but perhaps after all it was viewed from the back which is why the artist did not see the images?). And how anybody can see herringbones in the tomb lid pattern is beyond me. Whoever had the imaginative genius to dream this all up in the first place? Max, Ian Wilson? – and who is going to be the first Shroudie to break ranks and admit that the emperor has no clothes? After all it hardly destroys the case for or against authenticity if it is admitted that there is no way that this can be the Shroud..","date":"2014-06-13","mins":"12:30 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-129040","author":"charles_freeman","post":"‘and the little circles are either mere decoration or some feature of the construction of the tomb and its lid’ See my latest contribution to the Dan Scavone discussion. William Forsyth in his book on medieval French sculpture, which I don’t have in my office at the moment, lists several examples of small circular, always circular, holes in these tomb lids which reflected actual circular holes that had been placed in the Sepulchre in the ninth century but which the iconographic tradition seems to have treated as if they were original. So no need to claim that they are the ragged (i.e. Clearly not circular) poker holes!.","date":"2014-06-13","mins":"5:39 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-130154","author":"charles_freeman","post":"The distinguishing feature of the Shroud is its double image that you cannot miss. There is absolutely no evidence of this double image anywhere on the Pray Codex so that rules it out for me straightaway and I cannot see, perhaps I have the wrong glasses, any other indication that this might be the Shroud – in fact almost all the evidence suggests cloths that are depicted are NOT the Shroud. Crossed hands over the pelvic area are very common in burials, certainly in Christian Europe they go back to the first millennium and eventually artists started to copy them in both east ( the epitaphios tradition) and west for the burial of Christ so there is nothing unusual here. In fact, the Pray Codex is well within the normal iconographic tradition. I am still intrigued to know whoever started the idea that this was the Shroud and why so many people jumped on the bandwagon. They clearly know nothing of the division between east and western Christianity after 1054 and how difficult it would have been for heretical Catholics to get into the Greek Orthodox relic collections and even then whoever it was missed the images but somehow saw the poker holes. Please. What do you lose in the debate over authenticity if you take out the Pray Codex?.","date":"2014-06-17","mins":"2:54 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-129052","author":"charles_freeman","post":"It’s in a footnote that lists all the examples of small circular holes that are shown drilled in the tomb lids that he knows. I don’t have the book with me as I lent it out but when I do I will reproduce the footnote.The book is specifically about sculptures of Christ being laid out, lamented over, etc, which are very common in northern France. The Pray Codex fits within the same iconography rather than being a unique depiction as some seem to suggest. There are other very similar layings out of the the corpse with its hands crossed as on the Shroud Forsyth has a number of sculptured examples. It took me some time to realise that some people actually thought that the tomb lid was the Shroud but these decorated tomb lids are quite common in depictions of the resurrection..","date":"2014-06-13","mins":"6:25 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-130188","author":"charles_freeman","post":"Icon or relic? In the Middle Ages there were a lot of artefacts , usually made for a religious purpose, that somehow acquired an aura of sanctity or were associated with miracles. They became objects of veneration and accepted by the Church as such, even earning indulgences. A good example is the fifteenth century banner of the Virgin Mary protecting the people of Perugia from plague, still on show in the Oratory of San Bernardino in Perugia. When paraded it became associated with the cessation of plague and so an indulgence could be gained by visiting it. The Church’s view from the 1390s, certainly to this day as endorsed by pope Francis, is that the Shroud has achieved ‘object of veneration’ status but no more than this, which is why in the 1390s there was no attempt to stop it being exposed at Lirey when it was still in the church there. (If the Church had believed it was an out and out forgery,they would not have allowed continued display.) When I read that the Shroud is either a deliberate forgery or authentic, I insert the third, and to me most likely possibility, is that it was made for some other religious purpose, achieved status possibly through causing (unrecorded) miracles, and then crossed the line between icon and relic, as Kennedy ,et. Al. Claim in the introduction to their edition of de Charny’s Chivalry. The Church authorities were simply pushing it back where it belonged without undermining its status as an object of veneration. As i have said before the Shroud of Besancon seems to have been in the same category as there is an account that it was associated with the revival of a dead man. The ref. Is F. Chamel, Le Linceul du Christ, Paris, 1902, p. 46, apparently citing the church’s Actes for the miracle..","date":"2014-06-17","mins":"6:23 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-130586","author":"charles_freeman","post":"The holes are not all problematic as we know that there were actual circular holes in the Sepulchre in Jerusalem that artists tended to copy. My goodness, there is a real desperation to see something, just anything, that might just overlap with the Shroud. It’s fun to watch from the sidelines..","date":"2014-06-18","mins":"2:19 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-130579","author":"charles_freeman","post":"Dream on, Daveb, dream on..","date":"2014-06-18","mins":"2:03 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-130595","author":"charles_freeman","post":"The most valid point of all is that the main feature of the Shroud is its images. This is what distinguishes it from the many other medieval shrouds that also claimed to be the real burial cloth of Jesus. So how could the illustrator of the Pray Codex leave them out? To me this is absolutely conclusive. Whether the illustrator had seen one of the more accessible shrouds, such as the one at Cadouin that was popular at this time, and copied that, I don’t know. But looking at the many other depictions of shrouds we see from the twelfth century on, I don’t think any specific one was copied but there were certain iconographic traditions that were followed. Call me cussed but I am not going to see a Turin Shroud anywhere unless I see the two images that distinguish it from the other shrouds around, several of which were also believed to be ‘the real thing’ and ,unlike the shroud that was claimed to be in ‘heretical’ Constantinople, were freely available to be seen by Catholic pilgrims..","date":"2014-06-18","mins":"2:49 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-130612","author":"charles_freeman","post":"‘To the left of the Stone of Unction is the burial site itself. This is an ancient structure covered by a dome called the Rotunda. At the center of the Rotunda is a wood and stone structure that has enshrined the grave for over 300 years. This structure is the edicule. Round holes have been drilled in the sides of the grave. On Easter festivities, tongues of fire burst out of these holes. Several days before this ceremony, the Holy Fire, pilgrims from all over the world position themselves so that they can get a glimpse of the sight.’ From a description of the tomb of Jesus in Jerusalem.These holes are supposed to have been drilled in the ninth or tenth centuries and thus would have passed on to the illustrator of the Pray Codex and other illustrators, who may,of course, not have visited Jerusalem themselves and would have picked up the tradition and put them in..","date":"2014-06-18","mins":"3:26 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-129100","author":"charles_freeman","post":"I know exactly who has my book, a friend who has been travelling in Northern France and was interested in these sculptures. You can always find your own copy in a library and check me out! It is very obvious that this is not the shroud – there is not even a hint on the Pray Codex of the images which are the defining feature of the Shroud! I can’ t imagine whoever thought it was the Shroud..","date":"2014-06-13","mins":"10:11 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-130613","author":"charles_freeman","post":"‘the sole objective of the HPM artist was not to accurately depict or record the shroud image’. Well, that explains why we cannot see it!!.","date":"2014-06-18","mins":"3:27 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?"},{"id":"comment-205996","author":"charles_freeman","post":"I think Colin needs to get over his obsession with me and concentrate on his own home lab..","date":"2015-07-17","mins":"1:23 am","url":"https://shroudstory.com/2015/07/16/nicely-summarized-colin/","cat":"art","title":"Nicely Summarized, Colin"},{"id":"comment-207352","author":"charles_freeman","post":"If you look at depictions of Christ being buried by the sophisticated artists of the fourteenth and fifteenth centuries they all show Christ’shair falling back..Leonardo would never have painted it straight down onto the shoulders as we see on the Shroud..","date":"2015-08-03","mins":"12:10 pm","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","title":"Not a Work of Art by Leonardo da Vinci"},{"id":"comment-140108","author":"charles_freeman","post":"Often relics are not repaired as the damage shows that they caught fire, or whatever, but through divine intervention they survived. This is certainly true of the 1532 fire marks that were preserved because they showed that the fire was stopped in time and they act as evidence of this. That is why the nuns repaired the Shroud with just a backing cloth and why you always see them in any depiction of the Shroud (Beldon Scott is, as ever, good on this) I leave it to others to suggest why other parts of the Shroud may have needed reweaving..","date":"2014-07-24","mins":"5:10 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","title":"Origin of the Gammadia"},{"id":"comment-188337","author":"charles_freeman","post":"And then we have the fresco of 1583 in the Vatican, Galleria delle Carte Geographiche, showing the ostension shortly after the Shroud arrived in Turin where the images are quite clearly visible from quite a distance – and people are gazing at it from several hundred yards back. (It is fig. 42 in Beldon Scott I assume everyone has got their second hand copy by now or else these discussions are hardly worthwhile.) This was clearly a case where, to borrow a phrase from the revd. Padre Cusano, it may have been seen better ‘further back’ or at a distance as de Beatis noted in 1517. I am mystified by this copy. The blessed Amadeo XI died in 1472 but was very much the patron saint of the Savoy dynasty and shown in other depictions so it no surprise to see him alongside Carlo Borromeo who put his stamp on the authenticity of the Shroud (for what reasons we do not know) and the Savoys exploited this for all they could. So that is standard. But it seems as if the frontal image is incorrectly on the right it is too faint to make out for sure and it looks as if the seam of the Shroud is running along the bottom – in other words they may have been holding it upside down. I prefer the clarity of many of the other depictions that Beldon Scott shows as they at least correlate with each other. I leave it to Colin to try and destroy my reputation if that is they way he works. No need for a response!.","date":"2015-02-02","mins":"7:49 am","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","title":"Picture for Today"},{"id":"comment-188434","author":"charles_freeman","post":"Henrik. It is an interesting idea that the image may have soaked through although where is the backing cloth? I think the confusion over this single picture in an out of the way church in rural Piedmont that has been restored from we know not what original does not make it a very good example to prove an argument either way. I stick to my belief that we need a database of as many depictions as we can get to build up the way in which the Shroud looked at different times in tis history. If there is evidence that the loincloth was added, that is evidence that it may have been repainted at other times in its history. All pure speculation, of course, but one must keep one’s mind open to these possibilities..","date":"2015-02-02","mins":"11:56 am","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","title":"Picture for Today"},{"id":"comment-188515","author":"charles_freeman","post":"Possibly. What is fascinating is the two earliest depictions we have of the Shroud with the loincloth are with Borromeo presiding as the central figure in 1578 and Francesco Lamberti, bishop of Nice, presiding in the Carlo Malliano engraving of 1579. Lamberti was one of the signatories of the 1563 Trent ban on lascivia which involved the covering up of nude religious figures, as was the fate of Michelangelo’s Last Judgement in the Sistine Chapel. Borromeo was the papal secretary in 1563 and heavily involved in Trent as well and was obsessed about covering up nude art when he became Archbishop of Milan. I don’t think either would have been seen holding up a nude body of Christ! And seeing how relics were cut up, shared around, closed off in reliquaries, etc, there would have been no impropriety in adding on a loin cloth in fact greater impropriety in leaving the figure exposed at the height of the Catholic Counter Reformation. But lots still to be researched on the iconography of the Shroud loincloths! There does seem to be a line along the bottom third of the Cloth but really the whole thing is too indistinct and the way the left hand legs are painted is so different from the other images that I don’ t know of anything can be made of it. I shall put the Vatican fresco of 1583 with its distinct images seen from afar as my counterblast!.","date":"2015-02-02","mins":"3:50 pm","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","title":"Picture for Today"},{"id":"comment-188762","author":"charles_freeman","post":"The loin cloth is on the depictions made at the time of Borromeo’s visit and everything is clear there. Better to stick with depictions actually made at the time rather than use ones painted outside Turin many years later by an unknown artist..","date":"2015-02-03","mins":"7:10 am","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","title":"Picture for Today"},{"id":"comment-192096","author":"charles_freeman","post":"Beldon Scott has done extensive work on the archives and I am sure that if there was any public reference to two Shrouds he would have spotted it and it is hard to imagine they concealed one as this would not be typical of relic cults where the emphasis was on public display. If as I believe , the loincloth was painted on in the 1570s, there may have been no,inhibitions about doing some further repainting. There are precedents for valued painted linens being touched up as these images, on the outer fibrils of the cloth, disintegrated so easily. I was looking at an exhibition of Indian textiles at the weekend and it was noted that the high rate of decay was such that there are few surviving from before the end of the nineteenth century mainly cotton in this case,of,course. Certainly there is documentation of thousands, if not hundreds of thousands, of medieval. Painted linens, now disappeared. All the more reason to treasure the Shroud ..","date":"2015-03-01","mins":"8:50 am","url":"https://shroudstory.com/2015/03/01/picture-for-today-fresco-in-pinerolo/","cat":"art","title":"Picture for Today: Fresco in Pinerolo"},{"id":"comment-132359","author":"charles_freeman","post":"The words ‘aloof’ and ‘arrogant’ were first used by another contributor to this discussion ! And he wasn’t on my side of the argument! I have tracked down the Forsyth book and should be able to give you a list of entombment scenes with circular holes in the coffin lid tomorrow. As noted before they appear to have come in from the Crusaders who had seen the actual circular holes in the Sepulchre in Jerusalem. I think that trumps Monsieur Poule’s explanation for them. The crucial question – why reproduce the holes, the damage to the Shroud, but not the images, the most important distinguishing feature of the Shroud ? I have to agree that it is beyond my limited imagination but perhaps not beyond yours..","date":"2014-06-22","mins":"4:32 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132363","author":"charles_freeman","post":"So the Shroudies are split three ways. 1) Ian Wilson and I assume most people. This is a standard rectangular coffin lid with markings. For some reason the illustrator has transferred the poker holes from the Shroud but nothing else from the surface of the Shroud onto it. (I can’t really believe that anyone can still think that the stepped pyramid lines represent herringbones.) 2) O. K. And his followers. No, the ‘coffin lid’ IS the Shroud despite the other cloths shown on it and the iconographic evidence that this what stone coffin lids look like in these depictions. Query is the shroud folded? Otherwise why are the poker holes running across its whole width? 3) Max. This is the Shroud but you can’t actually see it because of some cryptographic mumbo jumbo that I can’t understand. Not sure where Daveb fits in. I think you should fight your battles with your fellow Shroudies, O.K. Before you fight them with me..","date":"2014-06-22","mins":"4:52 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132471","author":"charles_freeman","post":"Ultimately it is not status or authority, it is actual evidence that matters and certainly I am not playing on my own intensive researches into medieval relic cults which show that relics if portrayed are usually displayed very clearly (examples illustrated in my Holy Bones). Once I have got the details from Forsyth (and other sources ) today I shall present evidence that there is a direct link between Hungarian clerics and Jerusalem and hence the circular holes known to have existed on the Sepulchre in the eleventh and twelfth centuries. (As I said before it is important to follow up the international Hungarian connections in this period.) We are all agreed, I think, that we are not dealing with a professional artist here and there is no evidence that this illustration was ever intended to be circulated. It was probably only for private meditation although I would defer to experts in these specific kinds of illustrations. (See my earlier point that if we take the Holkham Bible as an example (easily found on line), the nude Christ on the cross suggests that nudity ( but without showing the genitals) was acceptable within private books I defer to experts on this.).","date":"2014-06-23","mins":"4:53 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132382","author":"charles_freeman","post":"The object. Your guess is as good as mine..","date":"2014-06-22","mins":"6:13 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132381","author":"charles_freeman","post":"‘ The artist didn’t intend to portray the Shroud’. Something we can agree in at last !.","date":"2014-06-22","mins":"6:07 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132547","author":"charles_freeman","post":"A summary. Reflections of an arrogant and aloof English historian. The idea that the Shroud can be seen in the Pray Codex has always seemed to me absurd as the Shroud is not highlighted, there no sign of the distinctive two images and Christ is shown without bleeding wounds as he is laid out making it impossible for him to transfer blood to the shroud in which he was wrapped. The pose of Jesus reflected ordinary burials and was increasingly common in art at this time so no surprises here. Again a decorated tomb lid is hardly unique (see below). Perhaps if I stood far off and took my glasses off I could see a similarity between the stepped pyramid and a herringbone pattern, but close up, as the illustrator would have been working, this link is clearly impossible to make. Se we need to explain a stone or marble coffin lid with circular holes in it. The answer comes from Jerusalem. The tomb of the Holy Sepulchre was originally left as a rock tomb and in Byzantine representations of the entombment or Resurrection it was always shown like this. However in the first half of the tenth century, the Byzantine emperor Constantine VII covered the tomb with a marble slab but in order for pilgrims to see into it to the original rock he drilled three circular holes, or oculi. From the tenth century in the west , and only in the west, we find artists copying the marble lid and representing the scenes of the Resurrection with a sarcophagus with a lid. In 1099 the Crusaders captured Jerusalem and between then and 1187 it was open to western pilgrims as well as the original crusaders. In the twelfth century the marble lid was increasingly shown with the oculi, two, three or four. William Forsyth gives four examples from the twelfth century e.g. Before or at the same time as the Pray Codex. They are on a capital in the cathedral of Modena, on a relief at Monte San Angelo (in Foggio, Italy), on a lintel on the south portal of the west façade of Saint Gilles at Arles and on a capital on a portal in Chartres Cathedral. (He goes on to give later ones as well.) As he puts it ( P. 9 of his book on Entombment Sculptures): ‘ These oculi were known and copied in the west. The association with Christ’s tomb lead to their being placed on the front face of the sarcophagus, the western equivalent of the tomb bench. In some French fourteenth century ivories there holes become elaborately decorated motifs resembling rose windows.’ So when we see a coffin lid with circular holes in it, I think the inspiration for these is clear. But these are French and Italian examples. What do we know of a Hungarian connection with Jerusalem in the second half of the twelfth century? We have a very strong one. In 1169 or 70, King Bella III sent a large sum of gold to Jerusalem for the Knights Hospitallers in Jerusalem to buy land from which to have an income to support the sick. In the document Bella said that he and his wife would be making a pilgrimage to Jerusalem and some of the money should be retained to entertain him and his retinue. The Wikipedia entry says that they did make the pilgrimage but there is no reference providedand an earlier study (James Sweeney, Hungary in the Crusades, 1169 1218, International History Review III, October, 198) suggests that they never made it., so I shall leave the question open. However we do know that there was a high level Hungarian mission sent to Jerusalem with the money. One can assume that they visited the Sepulchre and saw the lid with the oculi in it. Jerusalem was lost in 1187 but Hungarians took part in the ill fated Third Crusade to reconquer it. (All this is in the Sweeney article.) In 1192 King Ladislaw of Hungary who had died a hundred years before, was canonised and he was presented as the idea of a warrior crusader knight. The excitement was such that in 1195 or 1196, the ageing Bella vowed he would join the next Crusade to the Holy Land. He died in 1196 before he could fulfil this vow but Jerusalem was right at the forefront of everybody’s minds in these years, the years of the Pray Codex. This is from two hours library research in the midst of a busy day doing other things but a stone coffin lid in itself confirms Jerusalem is the model as it appears in art just about the same time Constantine placed one over the tomb and the oculi goes with them. No need to look further, I think. The lesson is if you consider yourself a Shroud researcher, think for yourself and don’t follow Ian Wilson, who seems to have been behind this. The Pray Codex hypothesis. Which never had much going for it, is surely redundant. Let’s move on..","date":"2014-06-23","mins":"2:32 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132825","author":"charles_freeman","post":"Enter ‘google Images’ and search for ‘ Crusader Cross’ and you will find the red crosses that are on the sarcophagus. 1195 was the year when obsession with regaining Jerusalem swept Hungary and Bella made his vow to go on crusade ( see ref to Sweeney article above) So it is hardly surprising that one finds red crusader crosses on the Sepulchre that ,as the coffin lid and the oculi on the Codex, show was modelled on what could actually be seen in Jerusalem. Whether any other features on the Codex relate to Jerusalem or the Crusaders I don’t know but clearly that is its primary focus. I am sure that there will be people who insist on seeing the Shroud and perhaps even turtles in the Codex but it seems clear to me that the illustrator is linking Jerusalem and crusading within the traditional iconography of the burial and Resurrection scenes..","date":"2014-06-25","mins":"2:53 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132643","author":"charles_freeman","post":"Nabber: I am relying on Forsyth who is usually very precise so perhaps you can provide illustrations.Of course, I only included the twelfth century ones made at the same time as the Shroud, there are lots more later ones..","date":"2014-06-24","mins":"4:09 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132084","author":"charles_freeman","post":"I shall take the maths on trust. I shall simply back six horses running today at a hundred to one confident that the overwhelming probability will be that I shall make a fortune..","date":"2014-06-21","mins":"9:59 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132644","author":"charles_freeman","post":"Sorry not ‘Shroud’ – although it may indeed have been made shortly before 1195 if shown in the Codex – I meant Pray Codex..","date":"2014-06-24","mins":"4:11 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132627","author":"charles_freeman","post":"So where do you fit here,Max?.","date":"2014-06-24","mins":"2:04 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132649","author":"charles_freeman","post":"O.K. Read what I actually said : ‘I only included the twelfth century ones made at the same time as the Shroud’. No, it was a Freudian slip revealing my prejudice that the Shroud falls within the medieval centuries. BTW. I put ten pounds on six INDEPENDENT horses in six INDEPENDENT races each at a hundred to one and I lost the lot. So much for mathematical probability..","date":"2014-06-24","mins":"5:28 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132828","author":"charles_freeman","post":"I am sorry O.K but your reasoning seems to be on the level of ‘A dog has four legs,a cat has four legs. Therefore a dog is a cat’. E.g. ‘The shroud has a cut off image, the Pray Codex has a cut off image. Therefore the Pray Codex is showing the Shroud’ It’s not reasoning that is important here ,it is LOOKING at the Codex and trying to work out what influenced the illustrator, in this case a Hungarian working in 1195 at the height of a Crusade fever in Hungary when his king had just taken a vow to go on Crusade. I do wish people would not follow Ian Wilson with such complete lack of critical thought. He does seem to have been the one who really started this but those who follow him without checking his sources (and realising that in all his years of ‘researching’ the Shroud, he does not seem to have read any general books on medieval history or relic cults ) are just as much to blame. The Codex shows Jerusalem, folks, where these scenes originally took place!.","date":"2014-06-25","mins":"3:40 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132830","author":"charles_freeman","post":"And I think you also need to access pictures of the pilgrim crosses etched on the stairs leading down to the chapel of St .Helen within the Church of the Sepulchre as the pattern resembles the pattern of crosses on the Codex. It appears that The illustrator wanted to place the resurrection scene within the Church of the Sepulchre as he had heard about it or perhaps even seen it, there is not a hint of evidence that he was aware of the Shroud of Turin..","date":"2014-06-25","mins":"3:53 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132841","author":"charles_freeman","post":"I agree, David. The Pray Codex is irrelevant unless there is really no other evidence for the existence of the Shroud before 1355. You don’t need it otherwise. If it was on the Codex, it would only tell us that the Shroud was in existence somewhere that the Hungarian might have known about, east or west, more likely west, before 1195, so possibly early medieval, certainly a time when relic cults of this kind were very popular. That does not get us much further. But do look up the pilgrim crosses etched on the stairway of the St.Helen chapel in the Holy Sepulchre, Jerusalem – they might surprise you..","date":"2014-06-25","mins":"5:37 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132972","author":"charles_freeman","post":"But an art historian who is trained to use his eyes will look at the Shroud and see the predominant features, its size, the images and the bloodstains. There is no evidence of any of them on the Codex and the depiction of Christ’s body shows that the artist had no idea of their being any bloodstains at all at the moment of burial,let alone any that could be transferred to the Shroud. So my guess is that he would say that this is a non starter. O. K. Starts the other way round. He assumes that this is the Shroud and searches around desperately for any element of it that can be seen in parallel with the Codex. He comes up with just the things that an artist is unlikely to depict, the damage on the Shroud. And it is no good pointing out that the artist is representing the Church of the holy Sepulchre Jerusalem as he had seen or heard it to be , and as we know it to have been, with a marble lid over the rock tomb, with circular openings and, in the same church red pilgrim or crusader crosses. The Shroud was only one of many cloths claiming to be the real Shroud. There are more recorded in the west than in the east and it is especially strange that the artist would not want to distinguish it from these by showing the images , bloodstains, and size that everyone would notice at once and know exactly what his aim was.. We don’t lose anything by simply saying that there is no real evidence that this is the Shroud. It may well be that searching around can find an early depiction which matches the main features of the Shroud more closely. Accepting the dubious connection between the Shroud and the Pray Codex seems to have frozen any other kind of new research..","date":"2014-06-26","mins":"3:19 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132980","author":"charles_freeman","post":"O.K. ‘ I am not interested what the artist actually wanted to depict’. Yes, you have made this clear all the way along. The rest of us ARE interested in what he was trying to depict and personally I don’t think he had ever seen or heard of the Shroud as if he had, and believed it to be in some way special, he would have made SOME effort to put some of its distinctive features into his work..","date":"2014-06-26","mins":"3:52 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133050","author":"charles_freeman","post":"The issue is not whether the Shroud existed before 1355 or not, it is whether, existing or not, it is specifically shown in the Pray Codex. I can’t see it nor can I find it anywhere on the Bayeux Tapestry and anywhere else that I have looked for a double bloodstained image of Christ. Even so if it does not exist in the Pray Codex then there may be some other evidence elsewhere for its existence. So I would simply take it out of the argument – as the Shroud might or might not have been in existence by 1195. Perhaps it was made in 1100, perhaps made in 700 as carbon dating suggests the sudarium of Oviedo was made, perhaps even earlier. Perhaps it is 1330s after all. The Pray Codex does not help at all and the fascinating thing to me is that why it was ever picked out when one could surely find other illuminations with similar imaginative parallels. See how easy it was to fit the Pray Codex the cult that believes that Christianity came from ancient Egypt..","date":"2014-06-27","mins":"2:37 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133052","author":"charles_freeman","post":"P.S. The real concern in all this is that, judging from the St.Louis programme, no one seems to have found any new historical evidence for thirty years. Everyone is still arguing over unsatisfactory sources such as the Pray Codex and no one seems to be doing any systematic work outside this. So no one has brought up any research on the early direct contacts between Constantinople and Jerusalem ( before the Arab Conquests) , no one has done anything on the relics trade between Jerusalem and Northern France that is actually documented and includes relics from the ‘Lord’s Tomb’. And we are still arguing over the Pray Codex. ( Yes, I am to blame for wasting my time on it too.) Again no one is doing any work on the actual weave of the Shroud. It will probably be a chance event , like someone working in a conservation lab on medieval linens, who finds some key evidence that can be linked back into what we know of the chemistry of the Shroud and provide a date for it independently of the radiocarbon date. This is what happened with the Horses of St. Mark’s in Venice. No one could date them and the last big study said fourth century BC. Then the conservation lab in the British Museum working on gilded copies found conclusive evidence that the same technique of gilding on the horses was only developed in the second century AD and the issue was solved overnight. Watch out for the conservation labs, folks! There are real open minded experts who specialise in early weaving and images on cloths and it is the failure to make any comparative studies of the Shroud with other surviving textiles which is another enormous gap in what is supposed to be the most thoroughly researched artefact of all time!.","date":"2014-06-27","mins":"2:59 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133080","author":"charles_freeman","post":"As I said earlier it does not take much to undermine reasoning of ‘A cat has four legs, a dog has four legs, therefore a cat is a dog’ variety. I really felt, and still feel, that I don’t need to do any more. This is simply not a valid way of approaching the problem unless you can find a mathematician or statistician to support your strange way of using reason (so over to you on this). As Hugh has demonstrated, the links you make are all questionable so provide no basis from which to use mathematical logic. But, do not worry OK., have no doubts that Dan Scavone will still be using the Pray Codex at St. Louis and if he is still with us it will be taken out again together with all the same documents in 2025. This is ritual not research and the text is sacred..","date":"2014-06-27","mins":"7:04 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133088","author":"charles_freeman","post":"O.K.s argument reminded me of the attempt by the Oxford philosopher of religion, Richard Swinburne, to use Bayes’ Theorem to prove the existence of God and the Resurrection. It aroused a great deal of ridicule including the following from a website called Faith and Theology: “A conversation yesterday reminded me of Richard Swinburne’s 2003 book, The Resurrection of God Incarnate. Using Bayesian probability and lashings of highfalutin mathematical jargon, Swinburne argues that “it [is] very probable indeed that God became incarnate in Jesus Christ who rose from the dead” (p. 214). His mathematical apologetics for the resurrection boils down to the following argument: The probably of God’s existence is one in two (since God either exists or doesn’t exist). The probability that God became incarnate is also one in two (since it either happened or it didn’t). The evidence for God’s existence is an argument for the resurrection. The chance of Christ’s resurrection not being reported by the gospels has a probability of one in 10. Considering all these factors together, there is a one in 1,000 chance that the resurrection is not true. It’s almost impossible to parody this argument (since in order to parody it, you would have to imagine something sillier – a daunting task!). But let me try: The probably that the moon is made of cheese is one in two (since it is either made of cheese or it isn’t); the probability that this cheese is camembert is also one in two (since it’s either camembert or it isn’t); and so on..” Oxford University Press was assailed for its philosophical naivity in publishing Swinburne’s book and someone wrote in to say that within five hundred yards of where Swinburne was writing in Oxford there were probably a hundred mathematicians qualified to tell him he was talking nonsense. I rather fear the same for our friend O.K..","date":"2014-06-27","mins":"8:27 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133104","author":"charles_freeman","post":"I quite see your point, Max. The Shroud is there but we can’t see it if we are archaeologists, historians or art historians. If we can ever get to what your denouement about all this (it has been a long time coming but please try and write in clear English so we historians ,et. Alia, can understand what you are talking about) perhaps you will tell us who hid the Shroud in the Pray Codex and why they needed to do so. Thank goodness for the de Charnys and the Savoys who had no such inhibitions and hung it out for all to see..","date":"2014-06-27","mins":"9:41 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133143","author":"charles_freeman","post":"We do have the Shroud of Cadouin, nicely presented on the Qantara website, brought back from the First Crusade. As Cadouin was on one of the routes to Santiago the abbey got very wealthy on the proceeds of pilgrims visiting it. So if the illustrator was copying a specific shroud this might have been the one. Only in the twentieth century was it shown to be contemporary with the crusade – such conclusive denouements do sometimes happen to relics once believed to be genuine..","date":"2014-06-27","mins":"2:12 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133156","author":"charles_freeman","post":"Well if the Shroud was there, someone like this artist would not have been allowed in! Probably he did not copy any specific shroud but if he did more likely to be one on public display such as Cadouin..","date":"2014-06-27","mins":"3:14 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133163","author":"charles_freeman","post":"The shroud of Cadouin is a shroud and is not the naked Christ. I have given you a more plausible explanation for the circular holes on the tomb lid which represent the circular holes drilled by Constantine VII in his marble lid of the tenth century in the Church of the Holy Sepulchre in Jerusalem. The poker holes in case you had not noticed are irregular in shape and vary in size unlike the circular holes on the coffin lid..","date":"2014-06-27","mins":"4:23 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133172","author":"charles_freeman","post":"Constantine VII decided to cover the open rock tomb with a marble lid and then to allow pilgrims to view down into what he had covered he drilled circular holes. It was nothing t o do with letting gases out but allowing people to look in to the original rock tomb. This is what we seem to see on the Pray Codex..","date":"2014-06-27","mins":"5:32 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133226","author":"charles_freeman","post":"Colin. Yes, it is possible but in this case we have documentary evidence that Constantine put circular holes in to allow pilgrims to look through his marble lid into the original rock tomb. As said 100 posts ago, they were copied by sculptors who were showing the same scene in the Pray Codex. Examples were given long ago..","date":"2014-06-28","mins":"1:58 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133174","author":"charles_freeman","post":"I stick to what I have just written ,that there is no reason why he should have used any particular shroud as a model. Seeing that he placed the discarded sudarium in the lower register he was probably taking the gospel of John as a source. IF, repeat IF, he was taking his model from an actual relic of a shroud then, of course, he would have several to choose from but the shroud of Cadouin was probably the best known. There is nothing in the Codex to suggest he did which is why I prefer my first solution, that he was using the gospel source. Usually if a relic is shown its is shown clearly as one can see with the many representations of the Image of Edessa with its open eyes..","date":"2014-06-27","mins":"5:38 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132124","author":"charles_freeman","post":"‘The only important thing is that zigzag pattern is similar to the herringbone on the Shroud’ I can’t see any resemblance at all, and even less so if you look close up If you imagine the illustrator actually sitting down and drawing in the stepped pyramid design,then it is clear that he cannot possibly have believed that he was copying a herringbone there is not even a repeated pattern. This is one link of the six that clearly fails, as does the fact that he chose to end the picture where he did. Crossed arms is not a problem as it was a normal way of Christian burial as excavated examples show. If you are burying someone in a tomb you need to move their arms up over the body and then cross the hands simply to narrow the width of tomb you have to construct ( this can be found as far back as Egyptian coffin burials) but the link with specifically Christian burials is also likely. Perhaps the representation reflects actual burial practices. Another possible avenue is to compare illustrations that were not open to public gaze with sculptures and paintings that were. The Holkham Bible in the British Library of 1330 has a nude Christ on the cross, for instance. When we compare the crudity of the Pray Codex with illuminated manuscripts of the same period, it was clearly not designed for public display but probably for private meditation and there is no evidence that it was ever circulated. Max clearly believes that the illustrator was trying to conceal the fact that this was the Shroud anyway so this does not help us much..","date":"2014-06-21","mins":"2:28 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133237","author":"charles_freeman","post":"The wounds on t He body was the crucial point because no one could have seen the Shroud without seeing the bloodstains and so they would have had to put the wounds on to the body. This is one of the strongest arguments against the Pray Codex showing the Shroud. In fact ,if you look at the iconography of these scenes as a whole you don’t find Christ being shown with wounds, let alone bleeding ones , until a century later. If the Shroud is authentic it had not made any impact on iconography of the body of Christ by this period..","date":"2014-06-28","mins":"2:55 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132129","author":"charles_freeman","post":"The trouble is that we can all find what we want in this illustration. If I were into medieval links with ancient Egypt and the origins of Christianity ( which is indeed a cult subject for some), I would say that the illustrator was showing the stepped pyramid of Djoser at Saqqara, that the wavy lines are none other than the hieroglyph for water, which is indeed a wavy line, and that the left hand Mary is carrying a classical bust of Hermes Trismegistus, who was supposed to have the ancient knowledge of Egypt, under her right arm. It is a good game when you start to use your imagination..","date":"2014-06-21","mins":"2:54 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133870","author":"charles_freeman","post":"O.K. The massive attack is not against you, nor is it a MASSIVE attack against anyone. It is just that many of us cannot see any of the distinctive features of the Turin Shroud in the Pray Codex and that is enough to doubt that it was ever portrayed in it. It is as simple as that. No need to accuse any of us of moral turpitude!.","date":"2014-06-28","mins":"7:17 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134289","author":"charles_freeman","post":"The reason why there is no casket is because this is a representation of what was actually in Jerusalem, a marble lid placed over the rock by Constantine VII. In fact the absence of a casket is additional evidence that the artist was copying directly from The Church of the Holy Sepulchre including the circular holes that we know Constantine drilled into that same lid in order to allow pilgrims to look through to the original rock..","date":"2014-06-29","mins":"7:12 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134412","author":"charles_freeman","post":"O.K. Please tell me what position the Shroud was in so that the observer could see a set of poker holes in the same L position as on the marble lid. Please also tell me which of the four sets of poker holes you think he was copying. Presumably as he would. Have had free scope to place the holes where he wanted them he would not have needed to turn the L round. Thanks..","date":"2014-06-30","mins":"2:18 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134451","author":"charles_freeman","post":"I assume that O.K saw my earlier post asking about the position the Shroud was displayed when the artist saw the Poker holes, and which of the four sets of poker holes he chose to copy onto whatever he chose to copy them on to. I assume that O.K and his supporters would argue that the artist is making an accurate representation of what he actually saw..","date":"2014-06-30","mins":"6:19 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134484","author":"charles_freeman","post":"I am sorry O.K. Whenever you are challenged on the issue as to why the poker holes and the circular holes on whatever you think they are laid on, don’t marry up you just say we must expect inaccuracies!!!! Perhaps it is because these are NOT the poker holes. If you look front on at the poker holes on the Shroud they do not present an L shape in the same pattern as on the Pray Codex. This is why I am wondering whether you do not mean the top layer of the poker holes but a lower one down. As you know they diminish the further into the folded cloth that you go but when the Shroud is fully extended you can just see them all so we cannot be sure which of the four the your artist has picked out to reproduce.over to you to tell us what you think or perhaps if the artist is inaccurate anyway it doesn’t.’t matter but it makes your argument even weaker than it already is. I have asked Nabber to actually show the examples of circular holes that he seems to know about, but he hasn’t. These are the examples that William Forsyth, an expert on sculptures, know represent the oculi in Jerusalem. If Nabber is right that these are sometime reproduced in a greater number than three then there are no problems with there being four Jerusalem oculi on the tomb lid but we do need to see his examples. My suspicion , that Nabber can prove unfounded, is that he actually has not seen the originals. This is because from what limited information I actually put into my posting, it would take some time to actually go through all the sculptures concerned to pick out Forsyth’s examples. I know both the cathedrals at Chartres and Modena and both have a wealth of sculpture to pick through and it is difficult, from my preliminary searches in a university library ,to find a full set of photographs. I wonder how Nabber instantly knew how to find all four of Forsyth’s examples..","date":"2014-06-30","mins":"10:27 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134486","author":"charles_freeman","post":"To make it easier, I suggest that we go to Shroudscope, click in on the ‘poker holes’ and for O.K.to tell us which one of the four marked out images of the holes is the one he thinks has been copied by the Pray Codex artist. Taking the normal display pose of the Shroud – top left, top right, bottom left, or bottom right? Then we need to check whether the one he thinks is the right one could be represented by four CIRCLES in the pattern that can be seen on the Pray Codex. But if we are not expecting the artist to be reproducing them accurately anyway, this does not get us much further other than, as I have said earlier, making O.K.s argument even weaker than it already is. Anyone else is also free to have a guess which one is being reproduced. I have always assumed that the top right is the top one when the cloth is folded..","date":"2014-06-30","mins":"10:48 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134501","author":"charles_freeman","post":"O.K. I shall look forward to your (and to anyone else’s) choice of the poker holes. The basic argument is that we have a shroud with two images, apparently unique as I know of no other examples, which was heavily bloodstained but we see absolutely no sign of its size, the images or bloodstains in the Pray Codex. The artist has not even shown the wounds of Christ without which the bloodstains could not have soaked into the Shroud. All this when,as depictions of relics such as the Image of Edessa show, artists had no inhibitions about representing painted cloths as they appeared to be. We have documentary accounts of the marble lid placed over the rock tomb in the original Church of the Holy Sepulchre and eye witness reports of oculi in the lid. There is nothing in the Pray Codex, other than its inept artistry, that is outside conventional depictions of these scenes. However, there does seem to be a particular concentration on the Church of the Holy Sepulchre/crusader crosses that ties in with the crusading hysteria that apparently swept Hungary in the mid 1190s after the loss of Jerusalem in 1187. We need to get together all the examples from the twelfth century onwards that Forsyth provides to see whether we can say anything coherent from them about the positioning of the oculi in the marble lid that is illustrated in the Codex as the original is lost. Much though I would love to go and visit all these places. . . I can see from photographs of the fine Romanesque sculptures of Modena where the scene with the tomb is but alas it is not close up enough for me to see the oculi. I have no reason to doubt an expert such as Forsyth who has no axe to grind on this issue. Nabber tells us that he has examples of four or more oculi but we wait on him to provide them. If he is right that there are cases of four oculi then that is an argument in my favour but I suspect that as none of his are on a tomb he is looking at the wrong images so I am not counting on him for support. So there is absolutely no reason to read the Shroud into the Pray Codex. This is a simple argument, very typical of those made by art historians every day of the week. You have to find some firm foundation stones from which to build an argument and a vague reference to what you say admit inaccurate representations of a defect in a holy relic by an artist whom you admit had no intention of representing the Shroud in the first place are simply not good enough in the real world of academia. It is up to you go on abusing me if that is your way of conducting discussions. And all this to ‘prove’ the existence of a particular burial shroud of Christ which may, like many of its rivals ‘genuine’ burial shrouds of Christ, have been made in the medieval period but in this case before 1195 (e.g. Cadouin has now been dated through its calligraphy to 1095)..","date":"2014-06-30","mins":"12:09 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134549","author":"charles_freeman","post":"But the L is the wrong way round compared to the image on the coffin lid ( I am sorry but this lid really cannot be the Shroud itself unless it had a dose of starch at the moment of the Resurrection!) and the poker hole going out to the right is not a circle. I think you are better off with one of the other sets of poker holes as your inspiration, but as you say it could be any one of them which weakens your argument a bit. (Basically you are saying you prefer the one set of poker holes that is not of the same pattern as the L on the coffin lid but, if that doesn’t work, it could have been any one of the three others!!!). You must be the only person in the whole world of Shroud research who thinks mentioning the two images that are the central feature of the Shroud and distinguish it from the other burial shrouds we know about is ‘waffling’. Or perhaps you are so obsessed about this defect in the Shroud’s weave (probably caused by the spilling of incense on the folded cloth) being somehow important in defining it as a sacred relic that you have missed out on the images, the size of the cloth and the bloodstains,all of which make the Shroud , authentic or not, what it is, but none of which are shown on the Codex..","date":"2014-06-30","mins":"5:30 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134609","author":"charles_freeman","post":"The essential question is why he tried to hide the Shroud within the Pray Codex by illustrating peripheral defects of it instead of showing the dominant positive, from a spiritual point of view, features of it. It makes no sense at all. But Max is going to explain all! The lid pattern in no way resembles the pattern on the Shroud it is not even regular and the crosses are red Crusader crosses. The streaks could be anything. But ,yawn,yawn, we have been there before ..","date":"2014-07-01","mins":"1:43 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134619","author":"charles_freeman","post":"No, I am not being obstinate. I am just waiting for an explanation as to why the artist should seek to conceal what are defects of a sacred relic within a spiritual picture and ignore the dominant features of the Shroud, the size, images and bloodstains. None has been forthcoming but Max is promising to give one. At least he realises that this is a genuine problem that needs explaining. If you look at representations of the Image of Edessa or the Veil Of Veronica, you will see that the artist made accurate depictions of a face – even to the extent of copying the open eyes – so if ,as I don’t see any reason to believe, there is the Shroud here it is reasonable to ask why it Is concealed even to the extent of not showing bleeding wounds on Jesus’s body. Your argument suggests that the artist saw it, ignored the dominant features ( could he really have forgotten t He images and the bloodstains?), but saw the poker holes and reproduced them inaccurately ( as now seems to be accepted) on a marble lid. My approaches are just mainstream historical research methods don’t make a fool of yourself by seeing what is not there no one loses out by being cautious. It is the first time that I have been abused for saying the evidence is not good enough to satisfy a professional historian! But there is always a first for everything..","date":"2014-07-01","mins":"2:34 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132138","author":"charles_freeman","post":"Well there was a movement in the Middle Ages that tried to link the ancient wisdom of Egypt to Christianity and followers of this would no doubt use the Pray Codex for their own ends if someone had started them off and they had followed like sheep. My point is that we can all see what we want in this and other illustrations.or we can fail to see anything out of the ordinary at all..","date":"2014-06-21","mins":"3:11 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134745","author":"charles_freeman","post":"I can’ t remember how many supposed ‘genuine’ burial shrouds of Jesus there were around in the Middle Ages – certainly more in the west than in the east and they certainly start in the west in the ninth century. Most have, of course, vanished either in the Protestant Reformation or in the French Revolution. I have said clearly that I don’ think that the artist depicting the crumpled shroud or sudarium shown on the coffin lid was actually doing any more than reproducing what he had read in the gospels but he may have had a particular shroud, perhaps one of the vanished ones, in mind. There were lots to choose from. My point is clear – if we have perhaps twenty five ‘genuine’ burial shrouds from the ninth to the fifteenth centuries, a date for the Turin shroud of before 1195 may mean no more than it is from an earlier medieval group rather than a later one. I prefer to forget the radiocarbon date and work to find other means of placing the Shroud. As a result I just think the Pray Codex is irrelevant and am amused by the obsession that O.K has with it when it has so little to prove either way. But I do think someone needs to be showing all the reasons why this is not the shroud or we will have another generation of shroud researchers simply repeating the same old so called evidence year after year, decade after decade, with absolutely nothing new being discovered as seems to be the case with the St.Louis Conference. Is there any other field where ‘ research’ has not come up with anything new for thirty years? If the Shroud can be ‘seen’ in the Pray Codex there must be hundreds of other illuminated manuscripts which also illustrate the Shroud. All you need is a few holes and the mathematical methods of an O.K !.","date":"2014-07-01","mins":"3:46 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134726","author":"charles_freeman","post":"Not that it will do anything to sway anybody’s mind but I have found an article on the development of the threnos the burial and lamentation scenes ` from the ninth century, with many illustrations, by Kurt Wertzmann ( De Artibus Opuscula XL, Volume One, Text, Volume II, illustrations, 1961) that shows how classical scenes of the ‘Bewailing of Actaeon’ come into the iconography of these scenes. Actaeon was torn apart by hounds when he saw Diana bathing. Apparently the mutilated body of a man killed in his prime became equated with Christ. Wertzmann shows a sarcophagus (from the Louvre) of a naked Actaeon being laid out in a very similar pose to many Lamentation scenes and sees this as an important source from the tenth century in both east and west ,when there was a renewed interest in copying classical iconography for New Testament texts. Certainly provides a model for the nudity. But none of this is relevant to those committed to the Shroud being somehow hidden in the Codex. I am not emotional about the Pray Codex because even if somebody did prove to me that one could somehow see the Shroud in it it would, as I have said before, prove no more than that the Shroud might be one of the many earlier (such as the Cadouin shroud) rather than later medieval linens claiming to the the real thing. What fascinates me is how people are convinced that the Shroud is there when none of its predominant features can be seen anywhere and only its defects ( I have never in all my studies seen the damage in a relic being given prominence.) The failure to show any wounds on Christ rules out any possibility that the artist could have envisaged this as the Christ who was wrapped in the bloodstained Turin Shroud. Is this really the only evidence for the existence of the Shroud before 1260? I had not realised that things were quite so desperate!!.","date":"2014-07-01","mins":"1:59 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134825","author":"charles_freeman","post":"I agree that all those shrouds that are genuine, every single one of them, originated in the east, in no less than in Jerusalem itself but only a few of these went to the eastern empire, most ended up in the west. Your earlier response to the key point that if the artist had seen the shroud he would have put bloodstains on Christ’s body is typical of your debating style. It is actually a key point and I think irrefutable. Yes I also agree, from limited knowledge of the subject, that biblical exegesis might just have been as stagnant in the past thirty years as research on the Shroud. But it is a close run thing. But the key point is that all this has become ritual so long as everyone repeats the same mantras at every conference all is well. So although this blog has shown that sindon cannot be translated as burial cloth ,especially when a separate burial cloth is mentioned in the same text, and that tetradiplon cannot be translated in any way to support the idea that a cloth is only doubled three times to make eight layers, no doubt It will still be read it out as such and no one will challenge it, any more than they challenge the liturgy of the Mass. So I just wonder what is going to happen if someone working on ancient linens in a conservation lab comes up with irrefutable evidence that the linen of the Shroud can only be say seventh century ,or eleventh century or fourteenth century, what will happen then? Stephen Jones may yet be needed!.","date":"2014-07-02","mins":"3:27 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134755","author":"charles_freeman","post":"I am happy to accept defeat the moment when you can show me a shroud the size of the Turin Shroud, a dual image or bloodstains on crumpled shroud shown on the Codex. The fact that the body of Christ is without bleeding wounds is enough to show that it could not have stained the Shroud and that the artist cannot have been trying to depict the bloodstained Turin shroud. It is not unreasonable to expect someone who claims that the Shroud can be seen in the Pray Codex to present evidence of one of the dominant features that would strike anyone seeing the Shroud when it was exposed. Seeing a relic only through its blemishes would certainly be a first. Do you really think that anyone depicting the Shroud would only show the parts where there was damage? So over to you. I have set out some perfectly reasonable criteria on which we can make a judgement..","date":"2014-07-01","mins":"4:41 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134868","author":"charles_freeman","post":"“David Mo”The artist of the Pray Codex is particularly anarchic in adorning the sepulchre: two kinds of crosses, pyramidal forms, circles and red zigzags. I don’t think we ought to find a sense to this hotchpotch. O/K/Unless we accept that the Pray Codex is derived from the Shroud of Turin conclusion absolutely unacceptable by dogmatic sceptics.” Thus surely should be rewritten as David Mo. :The artist of the Pray Codex is particularly anarchic in adorning the sepulchre: two kinds of crosses, pyramidal forms, circles and red zigzags. I don’t think we ought to find a sense to this hotchpotch. O.K. Unless we start off with the preconception that the Pray Codex is derived from the Shroud of Turin a preconception absolutely unacceptable by dogmatic sceptics..","date":"2014-07-02","mins":"9:05 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135027","author":"charles_freeman","post":"I wonder where Daveb gets his ‘feeling’ that the Shroud is somehow there ,even if concealed. At least we are coming to a consensus that, if this was the Shroud, the artist felt he had to conceal that it was for some reason. It is up to those who can see what is not visible to many of us, some coherent reason why this concealment was needed..","date":"2014-07-03","mins":"2:18 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135054","author":"charles_freeman","post":"I think those who argue that the Shroud is there but concealed need to provide a coherent explanation of why it has to be concealed. You say you have but I don’t see anyone other than Max working on this and a lot of his material is incomprehensible to me. We await his authoritative summing up. Your argument would have some credibility if you could show other examples of concealment of relics. As David and I have both pointed out, it is normal to display relics clearly in depictions of them and not conceal them – the open eyes of the image of Edessa has always been one of the main reason why Wilson has lacked credibility in his claim that the Image is the Shroud so the onus is on you to prove your case as it would be the only example I know from all my studies of medieval relic cults of such a concealment. If the Turin Shroud was known about but only to a very few who understood the references then the Pray Codex would indeed have provided vital information about the afterlife of the Shroud, It was some kind of cult object but who were the people who wanted to keep it secret and why ? The Templars?.","date":"2014-07-03","mins":"5:12 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135082","author":"charles_freeman","post":"Yes, I know the Brittany Coast having sailed along it with my father in law and it can get scary when the wind gets up, so I am putting my life on hold while I get the life raft in order..","date":"2014-07-03","mins":"8:36 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135129","author":"charles_freeman","post":"If you start reading about medieval linens, especially those that were displayed in churches it is clear that there were a lot of them especially in Lent when statues and altars were covered up with so called Lenten veils, many of which, especially those laid out to cover the opulent altar coverings, had painted images relevant to the themes of Lent. .We have absolutely no evidence that what de Clari saw was the Shroud even if we accept that his word ‘figure’ refers to a whole body, he only refers to a ‘figure’ in the singular. It may even have been the Shroud of Besancon. This is definitely NOT the Turin Shroud because the painting we have of it is sixteenth century, painted by a painter visiting Besancon called Pierre Dargent, which is still in the Municipal Library there. When the BS was being painted in Besancon, the Shroud was in Chambery and then Turin. So how can you be sure that it was not the Shroud of Besancon, or another altogether, that de Clari saw?.","date":"2014-07-03","mins":"1:19 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135168","author":"charles_freeman","post":"O.k. We have absolutely no evidence that the shroud that de Clari saw survived the Fourth Crusade. It is pure speculation to make a link with the shroud displayed at Lirey with the Clari shroud. De Clari’s description could apply equally to the Besancon Shroud but again there is nothing to link that shroud to Constantinople. Anyway ,O.K., you obviously have some bigger fights on your hands – so I will leave you to slug it out!.","date":"2014-07-03","mins":"5:06 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135248","author":"charles_freeman","post":"We must be careful not to fall into the logical fallacy of ‘ all cats have four legs, all dogs have four legs,therefore a cat is a dog.’ So, in an age when relics were proliferating and there were lots of copy cats ( cf the Besancon Shroud), ‘There was a shroud with an image on it in the Blachernae Church in 1203 4,there was a shroud with an image on it in the church at Lirey in 1355, therefore one must be the other.’ There is simply not a shred of evidence to link the two and ,as the Crusaders landed just by the Blachernae Church the de Clari shroud was most likely destroyed in the fighting. The stories say that the much more important ‘relic’ of the church, the famous icon of the Virgin Mary, was saved by the people and not captured..","date":"2014-07-04","mins":"1:45 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135250","author":"charles_freeman","post":"The 1204 to 1355 gap may be an artificial one based on the belief that the de Clari shroud and the Lirey shroud are one and the same. So far not a shred of evidence has been found to fill the gap. Wilson had to let his imagination run riot( ‘if there is no evidence for something, bring in the Knights Templar and Barbara Frale’). I believe he then had to dump Ms.Frale..","date":"2014-07-04","mins":"1:57 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135326","author":"charles_freeman","post":"If you look at the iconography of these scenes you will see that the Byzantine tradition was to represent a cave and the western Catholic tradition to show a sarcophagus. The Pray Codex is ,of course, a western depiction..","date":"2014-07-04","mins":"12:16 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135441","author":"charles_freeman","post":"Perhaps the key point is that there has been this discussion going on about the Pray Codex ever since Ian Wilson proposed it, but I have never come across anyone outside the Shroud community who can see anything out of the ordinary there even if , and especially if, they are actually shown the Shroud. Those who claim that the Shroud is there ,and it seems everyone of these accepts that it somehow had to be concealed from the general public both in medieval times and to historians and art historians today, have failed to convince anyone outside their circle. Perhaps time to find some evidence that might actually convince a professional in these fields..","date":"2014-07-05","mins":"2:37 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135622","author":"charles_freeman","post":"Well, every main feature of the Shroud, the dual image, the bloodstains and the size of the Shroud are well concealed from me. Now we have a new theory that the artist was so bad he could not show the image on the Shroud because he was not good enough! isn’t this scraping the barrel a bit? We have many,many depictions of the images on the Shroud from the expositions of the sixteenth and seventeenth centuries so it could not have been that difficult..","date":"2014-07-06","mins":"7:27 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135596","author":"charles_freeman","post":"I would love to get the discussion back to what is this shadowy group that was sending out hidden messages about the Shroud that only a few, then and now, could spot in the Pray Codex. Now that there seems agreement among the ‘Shroudies’ that the Shroud is hidden in the Codex, we need some explanations for why it had to be concealed in Catholic Hungary in 1195, but apparently not a few years later in the Greek Orthodox Blachernae Chapel in Constantinople. The plot thickens!.","date":"2014-07-06","mins":"4:34 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135633","author":"charles_freeman","post":"O.K. We are still waiting for a mathematician to confirm your sums. I have only shown it to a couple of numerate people and they think you are talking nonsense from a mathematical point of view in that you don’t have a secure base of certainties/ probabilities from which to start work. Too much ‘ All cats have four legs, all dogs have four legs, therefore a dog is a cat’ reasoning! It is not so much your reasoning that is the problem, it is that you are resting this reasoning on false assumptions. You need to go back to Euclid who taught us that mathematical reasoning can only progress from undisputed foundations that everyone accepts.And yours are not accepted. So please don’t make out that we are morons. The objections to seeing the Shroud in the Codex are obvious ones none of its major features are there!!.","date":"2014-07-06","mins":"8:08 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135665","author":"charles_freeman","post":"Just find that mathematician who supports you!.","date":"2014-07-06","mins":"12:25 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135680","author":"charles_freeman","post":"The reason why there are so many comments is that you have posted an hypothesis that you have used mathematics to support and your calculations appear so nonsensical that you are bound to be challenged. You have relied too heavily on congruences that are not supported by similar examples of this kind of illustration, you have made up some probabilities from these and then somehow you have managed to make these six congruences which you rate as each only having one in a hundred chance of being probable into over 99 per cent probability overall. That is where I am told, and common sense seems to support, your maths is nonsensical. When a theorem is proved, it is passed round to experts to see if they support the reasoning – it is not accepted simply because it is expressed in numbers! Are you really so naive mathematically? As this posting is your initiative and yours alone, I don’t think it is unreasonable to expect you to provide some expert support. However, I have never heard mathematics being used by anybody to show whether a work of art, even such an inept one as this, does or does not represent something. I continue not to be able to see anything that resembles the Shroud unless it is hidden very well indeed which takes me back to my earlier questions of who would want to hide it in Catholic Hungary in 1195!.","date":"2014-07-06","mins":"2:15 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132035","author":"charles_freeman","post":"‘CAMOUFLAGED’. Yes and they have done it brilliantly – not sure why they needed to, of course. I am not great on maths but if there are six different elements each of which has no more that a hundredth chance of being right (in other words is almost certainly not the the Shroud), I don’t think you end up with a very high probability overall. The one in a hundred is purely arbitrary anyway so does not provide a very good basis to start with, why not one in a thousand? The link of any one element to the Shroud has not been proved. The cut off feet are hardly relevant, surely. The possibility that this is a herringbone pattern also seems to be zero. If you are depicting Christ being laid out for burial in a shroud and a face cloth as shown in the Pray Codex and you are comparing it with the Shroud, either as original or created, then the possibility of some overlap is bound to be high. The obvious example is the crossed hands (your A) that are known from actual Christian burials and come into art in both east (the epitaphios) and western tradition before 1190 so you can hardly claim this as a unique link with the Shroud it is just an overlap.. But I will pass on to the maths experts here to do the sums..","date":"2014-06-21","mins":"6:22 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135706","author":"charles_freeman","post":"O.k. ‘If the proof is correct there is no discussion’. So how do you explain the discussion? I don’t think we are being too hard on OK. Not a single person, authenticist or not, has come forward to support the mathematical reasoning of a posting that was his initiative alone. And in addition to being a mathematical genius, if as yet unrecognised, he also is telling art historians how to do their business..","date":"2014-07-06","mins":"3:36 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135854","author":"charles_freeman","post":"We are still arguing over inessentials. There is no sign of any of the distinctive features of the Shroud in the Pray Codex, the size of the Shroud, its dual images and its bloodstains. We know that the artist was not aware of the bloodstains as he did not show them on the body of Christ. The arguments for the presence of the Shroud have got weaker and weaker with time. We now have an inept artist who apparently knew of the Shroud, wanted to show it but didn’t have the space or ability to do so. It has even been accepted that the L holes are not even the right way round to represent the actual damage on the Shroud – which for some unknown reason became more important for the artist to show than the spiritual features that made the Shroud significant for the believer. And then there is the shoddy maths,as yet unsupported by anyone on either side of the argument. So while this is obviously a lid rather than a Shroud that has received more than its fair share of starch, this is really a sideshow. Just look at the Shroud, let’s say in its earliest confirmed depiction, the Lirey Pilgrim badge, with its very distinct images. Just look at the Codex with its laying out of Christ in a pose already represented in the west before this. No obvious similarities – or is the earlier laying out scene in the Klosterneuberg monastery example ( Austria) with crossed arms also based on the Shroud? And after all this, the Pray Codex does nothing either way to show that the Shroud is first century – even if it is there, it only says that it might have been made before 1195..","date":"2014-07-07","mins":"3:05 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135872","author":"charles_freeman","post":"One thing that has been underestimated or ignored in this debate is the degree to which an object which is not considered a relic is still accepted as an object of veneration.In the east, this was ,of course, typical of most icons, except for the few of the Virgin and Child that were considered to have been hand painted by Luke. So far as the Catholic Church is concerned the Shroud is a classic example. The Church authorities believed that it was a cloth on which the images had been painted but they still authorised it as an object of veneration – even when it was still in situ in Lirey. This tells us that they did not believe that it was a deliberate fake or they would have ordered it destroyed. The document I would love to discover is the one that tells us why the Church considered it a worthy object of veneration even though they believed it to be recent painting. Usually there would have been some definite miracle associated with it but alas this is unrecorded. Just one more aspect of the Shroud that deserves further research..","date":"2014-07-07","mins":"3:56 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135879","author":"charles_freeman","post":"Sorry, I should have made clear is that the reason I posted the above is that even if the Shroud was shown on the Pray Codex, it may only have been because it was already an object of veneration ( and accepted as such, like many icons) before 1195. This may have been because, as with many icons, some miracle had been associated with it, irrespective of when it was actually made. As those of you who have read the, essential for me at least, Beldon Scott, will know after the failed attempt in the 1350s to have the Shroud accepted as a genuine relic, it only re emerges a such when the Savoys have it and probably its acceptance by Carlo Borromeo in 1578 in Turin was the crucial moment when it aroused widespread support from the masses, despite the Church’s continual refusal, to this day, to accept it as any more than an object of veneration. The idea that I have come across that it is either authentic or a clever forgery does not hold water. Objects of veneration , spiritual artefacts usually associated with some apparently miraculous event, were very common in this period and this is clearly how the Catholic Church saw and continues to see the Shroud. It is just a pity that we don’t know what the miracles were..","date":"2014-07-07","mins":"4:15 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135925","author":"charles_freeman","post":"Daveb .you have failed to spot my point : that the Catholic Church has never accepted that the Shroud is a genuine relic but it has allowed and encouraged it to be venerated. The question is why. It certainly shows that the Church regards it as more than a mere forgery. The question is what it believed it to be in the 1390s. The question is also at what point it was first venerated. Kennedy’s introduction to his book on de Charny’s Chivalry suggests that it was an icon that Jeanne de Charny transformed into a relic while her husband was away on campaign. A possibility certainly and this would imply an earlier tradition of veneration. So my point so far as THIS posting is concerned is that even if, and I can see no sign of it, the Pray Codex showed the Shroud, it may mean no more that it had achieved the same status as hundreds of other icons. Are you saying that the papal document allowing the Shroud to be exhibited by Geoffrey de Charny II at Lirey on condition that it was announced beforehand that it was not a genuine relic does not exist or is a forgery or that such expositions did not take place? This seems to me to be the first document that sets in place the attitude the Church has had to the Shroud ever since and later documents fall within this tradition. The point is that here the Church asserted firmly that it was NOT the genuine burial shroud. No sitting on the fence here as you suggest. But I agree that the fundamental question as to why the Church accepted the veneration of the Shroud in the 1390s and did not condemn it as a forgery does need separate discussion ,not least to overthrow the old dichotomy that that Shroud must either be authentic or a forgery. Clearly the Church did not believe it was either and this needs further exploration..","date":"2014-07-07","mins":"8:31 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192262","author":"charles_freeman","post":"The basic point has always been that the Shroud shows extensive bloodstains and scourge marks. Anyone who had seen it would have shown something of these on the body of Christ in the upper register..","date":"2015-03-02","mins":"11:51 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192394","author":"charles_freeman","post":"Skeptic. Having seen many resurrection scenes in Italian art over the years where the tomb lid is painted so as to reflect the bursting out of the tomb by Christ at the Resurrection, it took me a long time to realise that people thought the lid was the Shroud itself! I had been looking at the cloths on the lower register, and trying to see whether there were any images on them, which,of course, there are not. You have to realise that being able to see the Shroud on the Pray Codex is possible only for those of faith. The rest of us see stepped pyramid shapes on the tomb lid, discarded grave cloths without images,a Christ without the bloodstains and scourge marks that several observers describe as being exceptionally vivid on the Shroud in the fifteenth and sixteenth centuries, and crusader crosses at a time in the 1190s there was an enthusiasm in Hungary for a crusade. Perhaps one day faith will be granted to us both but until then we have to linger in the world of disbelief, unloved outcasts, doubting Thomases, who cannot believe until we see the wounds themselves, either on the body of Christ or on the grave clothes on the Codex that will give us faith..","date":"2015-03-04","mins":"12:12 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192715","author":"charles_freeman","post":"PHLP. Well said. If we were discussing any other artefact from the medieval era or earlier, we would START with the assumption that it is not as it once was. I am not sure why this obvious point has never been applied to the Shroud which certainly looked very differently six hundred years ago. The issue is defining how it once looked and this is where serious scholarship on the Shroud should be directed. Goodness knows how much time has been wasted on trying to reproduce the existing images without recognition that they have deteriorated from what they once were..","date":"2015-03-07","mins":"3:32 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192717","author":"charles_freeman","post":"If you want to see a skewed tomb lid go onto Google images , find ‘crucifisso duomo Pistoia’ and you will find the important Crucifixion scene by Coppo di Marcovaldi of about 1260. There are side panels and you need to choose the one at the bottom right and there is a tomb lid at a very odd angle but not untypical. The Shroud is inside the tomb and the angel sitting on it with the Three Mary’s approaching..","date":"2015-03-07","mins":"3:52 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192790","author":"charles_freeman","post":"Yes,lots. Many descriptions by observers are quoted in John Beldon Scott’s book on the Shroud which is easily available from Abebooks and should be on the shelves of anyone interested in the Shroud. The fullest source for post 1578 depictions is the 1998 catalogue of the Savoy collection, now difficult to find I use the copy in the Cambridge University Library. Then there are many depictions in the Shroud Museum in Turin although the museum does not mention the obvious point that many show features of the Shroud now lost. Others have to be researched piecemeal. The British Museum has one from 1608, the Royal Library in Turin produced one I had not seen elsewhere of 1579 and presumably there are others. Add to these should be the copies of the Shroud, some of which may be faded if they are like the Shroud on cloth. Only when a full database of all these has been assembled and released on the web, will scholars be able to reconstruct how the Shroud images looked originally. Despite all the hype about the Shroud being the most researched artefact in history, these obvious sources of potentially vital evidence have been ignored..","date":"2015-03-08","mins":"10:16 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132254","author":"charles_freeman","post":"It’s a simple question between looking at the Pray Codex without preconceptions and placing it within the conventional iconography of its day or looking at a stepped pyramid pattern on the tomb lid and believing that it might actually be a representation of a herringbone pattern. It very clearly is not a herringbone pattern and it does not have the regularity of the pattern of the Shroud so the probability that it is a representation of the Shroud is close to zero. And not a trace of any the the distinctive images on the Shroud ( Max, of course, will get round that one by saying that this is the Shroud but it is completely concealed!) So whoever dreamt this up in the first place? Perhaps some old arrogant aloof Englishman??.","date":"2014-06-22","mins":"3:38 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192792","author":"charles_freeman","post":"Julian: Well, just to make my point. All these copies show long hair at the back. You cannot see it now and the back image is often shown today ( e.g. By Ian Wilson) as if the hair at the back was a pony tail. So here we have a clear example of how the deteriorated images on the Shroud today do not resemble those of the 1500s. This explains why you should START research on the Shroud by trying to assemble the features of the original images that are no longer there. The descriptions are helpful , e.g. Antonio de Beatis’s comment in 1517 that the Shroud images could be seen from a distance at that date( and it would appear from at least 250 years afterwards) This is the base to work from( as it would be for any other artefact but for some reason not the Shroud). We need to assemble the database in order to do this..","date":"2015-03-08","mins":"10:29 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132266","author":"charles_freeman","post":"But if everyone of the supposed connections is only the mind of the see er what can we do about that? It is quite clearly not a herringbone pattern on the tomb lid so why should anyone believe that it is unless they have a preconceived conviction that they have to find, no matter where, some ‘ evidence’ to support their preconceptions. There is no way you can get me to see a herringbone pattern on the lid!! But following your argument, we also need to look at other tomb patterns. If a stepped pyramid pattern is similar to a herringbone pattern , just how many other of these tomb lids actually show the Shroud in disguise? Perhaps they all do if we look hard enough..","date":"2014-06-22","mins":"5:42 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132270","author":"charles_freeman","post":"Of course following my argument that this is actually a cult object showing the links of Christianity with ancient Egypt, ,I might point out that an Egyptian Coptic cross is always two equal lengths, as here in the illustration, while Byzantine and Catholic crosses have a long central post with a shorter cross post. I am just showing how easy it is to construct an argument for almost anything if you want to. And there are actually people who do argue that Christianity was born out of ancient Egypt so perhaps I will get a cult following for pointing these similarities out!.","date":"2014-06-22","mins":"6:08 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132304","author":"charles_freeman","post":"Well you have convinced me,Max, I can’t see how I could have failed to apply the lateral neural inhibition to what was before me. BTW one of my subjects is medieval relics and if you look up my Holy Bones, Holy Dust on Amazon.com you will find some of the reviews. But I do Roman and Greek history too. I have been around a long time..","date":"2014-06-22","mins":"11:40 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132321","author":"charles_freeman","post":"O.K. Can you not read what I said? My point was that you can read what you want into these pictures and create any kind of scenario, even something as absurd as a link to Egypt. There is a stepped pyramid (see the famous stepped pyramid of Djoser) , a plausible Egyptian hieroglyph of water, a possible bust of Hermes Trismagistus and lots of Egyptian Coptic crosses. So that’s four elements from a single register to ‘prove’ that there was link between the wisdom of ancient Egypt and Christianity shown in the Pray Codex. Nonsense of course but can you prove me wrong?. Try googling ‘Hermes and Siena cathedral’ – where there is actually a fifteenth century pavement showing Hermes in a Christian setting. Hermes was said to have lived at the same time as Moses. It’s a GAME you can play with virtually any painting! You just need some imagination and you and Max have lots of it..","date":"2014-06-22","mins":"1:12 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132341","author":"charles_freeman","post":"I am sorry that I don’t have your imagination, O.K. I think you are starting with the desperate need, that comes from somewhere, to show that the Shroud was in existence by 1195, even if that proves no more than that it might be early rather than late medieval. I still long to know whoever dreamt this up in the first place. Not an aloof Englishman living out in Australia ,I hope!.","date":"2014-06-22","mins":"3:14 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-15941","author":"charles_freeman","post":"And what if the distinguished art scholar Hans Belting is right in his view that the Image of Edessa was actually created, like other ‘not made by human hands’ images, in the sixth century AD? (See Likeness and Presence passim.) A legend was then created to give it a credible status as a relic, as happened throughout medieval Europe. If Belting is right ,then Wilson’s thesis cannot even begin to get going. So who is prepared to take on Belting?.","date":"2012-09-06","mins":"3:07 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","title":"Quote for Today: Hans Belting and commentary"},{"id":"comment-15975","author":"charles_freeman","post":"The only reference Belting makes to the Turin Shroud in Likeness and Presence, p. 210 of the paperback edition , University Of Chicago Press, 1994, gives his view that it is a medieval copy of an earlier image ‘apparently venerated in Byzantium as Christ’s burial cloth’. In L and P he deals with a wide range of images attempting to find their source and it is impossible to represent the depth and knowledge he displays of early images here. There are fifty one sub headings alone in the subject index under ‘Christ, images of’. He takes one style of these images back to ‘eastern Syrian works of the third century ,as in a fresco in Dura Europos’. Of course, we are severely limited by the mass destruction of eastern images of Christ in the iconoclastic period. So, for instance we have a reference ( p. 62, Belting) to the usurper emperor Heraclius (AD 610) finding in Constantinople ‘the already existing cult of an unpainted image of Christ which he made his own; – he took it with him on campaign. This may have been the same image of Christ that had been discovered in a garden well in the village of Kamuliana in Asia Minor and brought to Constantinople in 574. It showed off its power by miracles in the village where it was found (including duplicating itself when pressed to the finder’s dress), before it was sent to Constantinople. Where did it go? Of course other historians have noted the importance of the representation of the emperors in Roman art as a model for the seated fully frontal Christ ‘ Subsequent [in this case after 350] depictions of the all powerful Christ in the apses and cupolas of Christian churches retain the iconographic elements of emperors of late antiquity’, as another authority on early Christian art, Johannes Deckers, puts it. Again the painted Roman coffin lids of Egypt , many of which have survived, are also seen as a source of painted icons they too show living faces as do all the early images of Christ. Belting shows how complex and varied the sources of the iconography of images of Christ are. Many of them are secular ‘templates’ adopted in Christian art well before the sixth century. The idea that images of Christ are all taken from a single piece of cloth in the SIXTH century has never had anything going for it the traditions are much older..","date":"2012-09-07","mins":"4:04 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","title":"Quote for Today: Hans Belting and commentary"},{"id":"comment-15976","author":"charles_freeman","post":"P. S. It goes without saying that Belting, like all other art historians that I know of, treats the Image of Edessa as an object in its own right and nothing to do with the Shroud..","date":"2012-09-07","mins":"4:09 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","title":"Quote for Today: Hans Belting and commentary"},{"id":"comment-16018","author":"charles_freeman","post":"Dave B. Thanks for yours. Having worked as a historian for all too many years, I am very cautious about sources. This is especially true of relics stories as it was the custom to create stories of where you particular relic came from and why it was genuine. By definition, most of these stories have to be false as not every burial shroud, piece of the cross, Girdle of the Virgin Mary, head of John the Baptist,etc, could be genuine! I can only quote Belting on the Shroud, with page reference, perhaps he has expanded on his theory elsewhere. I was much more interested in his arguments for the appearance of the Image of Edessa as a newly emerging Image, probably made in the sixth century, as, if he is right, then Wilson’s theory collapses. A) Guscin. No problem here as this is simply a standard account of the Image of Edessa that we know to have been in the emperors’ private chapel, the Pharos Chapel, from 944 to sometime after 1204. Such a precious relic would never have been moved especially not to a very vulnerable chapel on the seashore.. So there is no link to what de Clari saw in the Blachernae Chapel. B) This is so late and not corroborated by any other account. C). Another late variance on the original Agbar legends ( all LEGENDS, of course, not historical accounts) which can hardly be used to supplant earlier accounts of the legends that say it is just the face. So nothing very convincing here, certainly not enough to overthrow the traditional narrative which best accords with the sources that the Image of Edessa appears for the first time in the sixth century and is then given a legendary history in order to give it credibility. This is the best fit explanation unless we find some more specific documentary evidence. (In these cases where the evidence we would like is missing , we have to end up with a ‘best fit’, always provisional, of course.) As I try and explain in my original article, Wilson fails completely to find any evidence for the 500 years before the sixth century and the only ‘evidence ‘ he provides for the Shroud being the same as the Image of Edessa is, as I attempt to point out in my article ‘Tetradiplon Revisited’, rests on the tetradiplon cloth, WITHOUT AN IMAGE, with which Jesus wiped his face, according to the legend,being REFOLDED ‘tetradiplon’, but not a single source says that it was and there is a separate reference to burial cloths in the same text anyway. Wilson simply ignores it but surely he should list every time there is a reference to a burial cloth or cloths in the tomb. I can see why people wonder what his motives are. Does he really believe what he writes? Is he really satisfied that the evidence he provides is conclusive? Did he read the full text (here and in other cases) or was he simply being lazy? The distinction between cloths showing a living and a dead Christ is crucial in the context of the iconoclastic debates. The images of a living Christ, the Image of Edessa, the Veil of Veronica, and the image brought to Constantinople in 574, provided evidence that Christ wanted to have images of himself, something the iconoclasts denied. An image of a dead Christ would not help here but i completely fail to buy the view that the Shroud of Turin was somehow made to represent a living Christ. In fact, as I have said before, with reports of various images and shrouds around in both east and west, I know of no clear reference to what we know of the Shroud of Turin before the fourteenth century. As the distinctive element of the Shroud of Turin is a double image, I would expect a clear reference to that, then I WOULD be interested. Up to then caution, caution, caution – Wilson is far too speculative for me and seems completely unaware of the vast amount of material about other relics that we find from the fourth century, when relics appear to have been collected for the first time, that would make him realise that a burial shroud would have been unlikely to have been picked out for special veneration when there was so much else around to venerate. (See the early chapters of my Holy Bones, Holy Dust, How Relics Shaped the history of Medieval Europe p/b edition out soon!).","date":"2012-09-08","mins":"1:49 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","title":"Quote for Today: Hans Belting and commentary"},{"id":"comment-16041","author":"charles_freeman","post":"‘As the sun does not need the lamplight, so also the church of the congregation can do without the remains of the martyrs, It is sufficient to venerate the name of Christ, for the Church is his bride, redeemed by his blood’. Basil of Caesarea was one of the great theologians of the late fourth century and he spelled out the reasons why relics were not be specially venerated. He is echoed a few years later in the Latin church by Augustine who says miracles are no longer needed now the Church is well established and decries the custom already in place of hawking around relics for sale. By the end of his life ,however, Augustine is as keen on relics and miracles as anyone else. So ,just as in the Protestant church today, early Christians did not venerate relics and it is a much later phenomenon, essentially only appearing 300 , yes 300, years after the events of the gospels. There are a few reports from the late third century of martyrs’ bodies being venerated and then in the 320s we have the finding of the True Cross by Helena in Jerusalem. By the 380s we have Jerome wandering around the Holy Land and finding many of the relics such as the manger in which Jesus lay. By 420 relics are everywhere in the Christian world and once it was accepted that any part of a relic had the power of the whole, bodies could be divided up and distributed. That is why one finds parts of the first martyr Stephen in both eastern and western parts of the empire by 420. We have lots of documentary evidence by now of what the major relics were and where they were venerated. Not a single mention of a burial shroud being venerated as a relic but several legendary accounts in the sixth and seventh centuries of the burial cloths being seen in the tomb e.g in the Acts of Thaddeus, the very same text that Wilson used for tetradiplon the term which describes the cloth BEFORE Christ wiped his face on it, then the same text goes on to describe the burial cloths in the tomb so the burial shroud,in this legend, could not be the same cloth as that described as tetradiplon. Then there is Arculf’s account, late seventh century, in which Arculf visits Jerusalem and sees the main burial cloth still in the tomb and recounts the story of the sudarium ,a face cloth, cf.as in the Oviedo example, as a separate cloth. Wilson tells us about the sudarium, assumes that it is the Shroud temporarily moved from Edessa to Jerusalem(!!!) and then,of course, says nothing about the burial cloth in the tomb, in a similar way to the way he omits telling us about the reference to the burial shroud in the Acts of Thaddeus which destroys his argument that the Shroud was tetradiplon. So what are we to do? Does Wilson really believe what he is writing? He is expert at teasing out any text that might ,however many centuries it is after the event, refer to the Shroud but almost certainly doesn’t, but then misses the obvious references to the burial cloths as being in the tomb and being distinct from the Image of Edessa. So, Louis, I do think, in the absence of any documentary evidence , we DO need to find special reasons why the burial shroud would have kept as a relic in an age when relics were not being collected and when , in the age that they were, the fourth/fifth century, there is no mention among all the other relics listed of the veneration of a burial shroud. It clearly was not high profile compared to other relics from the Passion, the life of Christ and the Virgin Mary that are recorded at this time. (One of my concerns about Wilson is that despite writing about the Shroud since 1978, he shows no sign of being aware of the immense documentation about other, much more prestigious, relic cults that still survive from this period.) And even if one argues that it only first appeared to the public as the Image of Edessa, there is no evidence from any of the early texts to suggest that this was anything other than an image that was believed to come from the living face of Christ..","date":"2012-09-09","mins":"4:22 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","title":"Quote for Today: Hans Belting and commentary"},{"id":"comment-15994","author":"charles_freeman","post":"Dave b. Your point 2. Many relics simply appear in the historical record they do not need to have been brought from anywhere although,of course, legends that they have been brought from somewhere often develop. There is a hierarchy of relics, which shifts with time e.g. The Cross is an early fourth century favourite, the bones of Stephen , the first martyr, make a big splash in the early fifth century (both Constantinople and Augustine had parts of him), the Blood of Christ becomes important in late medieval Germany. Burial Shrouds simply don’t get very far in the hierarchy perhaps because of the taboos in showing Christ dead which lasted until c. 1000. They were simply not something you venerated when there was so much competition from more prestigious relics, and in the case of images, those showing Christ alive. One of Wilson’s many errors is to assume that the Shroud would have been so important that it would have been given special veneration over and above the thousands of other relics of which we have documentary evidence. It only seems to have been since 1898 that it finds it own place in the sun..","date":"2012-09-07","mins":"12:15 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","title":"Quote for Today: Hans Belting and commentary"},{"id":"comment-42557","author":"charles_freeman","post":"I have enjoyed several of Rowan William’s books but he is a theologian and a poet with outside interests mainly in literature. I shall stick with the community of specialists who have rejected Wilson’s Edessa story until I have read Williams’ detailed support of it..","date":"2013-09-01","mins":"5:07 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-42649","author":"charles_freeman","post":"One specialist I consulted said that as Wilson could not even read the original documents he could hardly be taken seriously, but the consensus, fatal for Wilson, that I came across, is the impossibility of the living face of Edessa being the same as the dead face of the Shroud. It is up to Wilson to convince the experts, not the other way round. Often contributors to this site complain that academics don’t take the evidence for the Shroud seriously. Certainly from what I have heard Wilson is one of the main reasons. If, so they say, he is the best academic historian that anyone can put up, one who cannot even read the documents in the original let alone show any specialist knowledge of Byzantine iconography (and this is a very crowded field just go through the Dumbarton Oaks Papers), then why bother with his hypothesis. If one can ditch Wilson ,then one can begin to research 1) The relics coming DIRECT from Jerusalem to Constantinople in the fourth and fifth century, including those procured by Pulcheria for the Blachernae Church. 2) The relic collections at Sense and Chelles, near Lirey, that contain relics from the ‘Lord’s Tomb’ that arrived in the eighth and ninth century from Jerusalem. (See earlier posting.) 3) The report of an image of the saviour on a linen cloth, in 570, at Memphis, Egypt. Important as it would have survived in the arid climate and so deals with the problem of preservation that would have been fatal for any linen cloth in a wall in the damp, in winter, climate in Edessa .(See my earlier posting.).","date":"2013-09-02","mins":"6:18 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-43894","author":"charles_freeman","post":"Obviously we need to look at the other examples Forsyth gives it is a pity that he does not illustrate them. It is the circular that clinches it for me but as I have never seen anything resembling the Shroud and its images in the Pray Codex anyway this is just putting a dot on the i. Whoever dreamt up the Pray Codex/Shroud connection anyway? Quite happy to be fundamentalist and arrogant on this one, Matthias. The onus is on those who can see the Shroud of Turin in the Pray Codex to prove their point, not the other way around..","date":"2013-09-12","mins":"3:27 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-43927","author":"charles_freeman","post":"‘Was the Shroud just another piece of artwork depicting these features, or was it the source of them?’ Very good question. Needs to be explored fully from both sides..","date":"2013-09-12","mins":"10:06 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-44705","author":"charles_freeman","post":"I was surprised when looking at Forsyth’s book on French sculptures of Entombments at how many fifteenth and sixteenth century have Christ in the burial pose with hands crossed..","date":"2013-09-19","mins":"9:20 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-42655","author":"charles_freeman","post":"Matthias. No, I can’t because I contacted people I worked with on previous occasions, privately, as I wanted some comments on my ‘Misguided Journey ‘article. It would be inappropriate to name them. If you don’t want to trust me don’t, but concentrate instead on finding a single Byzantine specialist, someone who deals with the iconography of Byzantine art, who backs Wilson’s hypothesis. I certainly have never come across one but I have found much of the opposite. But , PLEASE, I am doing some general research on the links between East and West in Christian art at the moment and I have come across several leads that seem relevant to those working on the Shroud and I am passing them on to this website. If you want the Shroud to become a dead subject, don’t even try and follow them up!.","date":"2013-09-02","mins":"7:23 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-42670","author":"charles_freeman","post":"This is the interesting question, that I am not qualified to answer, but others doubtless are, which is whether the images on the Shroud today have been exactly the same throughout its history,however long that may have been. I have pointed out cases where Wilson does provide misleading information – for instance, implying the ‘tetradiplon’ comes AFTER the passing of the Shroud to Jesus and so is a later wrapping up, instead of BEFORE (with no indication that it was folded up again) see my article on Tetradiplon. Generally it is rather that some texts, for instance, the sermon of Gregarius Referendum, do not say what he and others claim that they says. From what the linguistic specialists say, the references to the wounds in Gregarius never suggest that these are on the Shroud itself. More generally still, I would say that Wilson reads into texts things that are not there and that he relies too heavily on later texts at the expense of earlier ones. On faces. Yes, the scholarly consensus is that faces were the main form in which these ‘not made by human hands’ cloths appeared in the late sixth century. Belting, Kitzinger and others discuss why it was at this time. As Kitzinger ( and other specialists) seem to agree, the bearded Christ appears in fourth century Rome and so seems to have been adapted from there. On the Memphis example, I would suggest that the Latin ‘effigies’ might well refer to more than just a face. Obviously those who wish to can stay stuck with Wilson’s hypothesis, wonder why no academics take Should research seriously, and turn their backs on other possible ways in which an early relic might have reached Lirey. The trouble is that this will mean that Shroud research becomes a dead subject. No one with any knowledge of Byzantine iconography is likely to be drawn in and no one will start following up any other leads. However, I am clearly talking to a deaf audience which is disappointing as rejecting Wilson does not necessarily reject belief in the Shroud as authentic as Yannick has shown. I was sent the Sign by Penguin to review. Quite apart from De Wesselow’s bizarre explanation for the birth of Christianity, he had, after six years of research, added no material that I had not read elsewhere in secondary research, so I can hardly rate him very highly. I seem to have found more new (e.g. Based on primary sources) leads to follow up in three months, see above, than he has in all those years and I am not even trying! Why when so many people seem fixated by the Shroud is it impossible to find anyone qualified to take the research on? I am bowing out as I am having to prepare for an interview for a programme ‘Biblehunters’ on how how Christian manuscripts shaped the early church. No need to say anything about de Wesselow there. Should be eventually out on BBC 2and the Smithsonian Channel..","date":"2013-09-02","mins":"9:55 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-42847","author":"charles_freeman","post":"I do not qualify as an expert in Byzantine iconography and texts. I only had my article checked by experts of whom at least one is on Yannick’s list. In fact, I understood that the experts in this field are thoroughly fed up with being asked about Wilson’s pseudo history. It seems impossible to get across to some just how thoroughly Wilson is rejected by anyone who is a specialist in this area. What more can one say? One of Yannick’s experts, Averil Cameron, wrote a review of Guscin’s book that can be easily found online. …. And when there are so many more plausible leads to follow up….. Incidentally for my coming interview, we are concentrating on the early church in Egypt and what the surviving papyri say but nothing more has come up yet about the image on the linen cloth seen at Memphis in 570 but we are ending at AD 400 so perhaps that is not surprising. (Will see how I can get the links to my article restored they were working until recently.).","date":"2013-09-04","mins":"3:41 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-42574","author":"charles_freeman","post":"Reply to Matthias. Those that I checked my article with before I published it as I have worked in this area previously and have some contacts in Byzantine studies as a result. Wilson is generally regarded as a joke figure. Perhaps you should find one specialist who does support him!!.","date":"2013-09-01","mins":"10:23 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-43055","author":"charles_freeman","post":"The links to my article on ‘The Shroud of Turin and the Image of Edessa A Misguided Journey’ and ‘Tetradiplon Mystery Solved?’ are back online although I would develop the first now with much more information about how the images do not match up. However, this is only a sideline to other work I am doing and I see no reason to keep in what is essentially a closed debate in the sense that no one, other than Yannick, seems to want to listen to people who have been working in this very field for many years using and interpreting original sources, both icons and texts, and finding nothing whatever to support Wilson. So let’s leave it at that. As someone who normally has my own work peer reviewed (by university presses before publication) I know only too well how obscurantist some academics can be, but I see no reason to doubt the overwhelming consensus against Wilson in this instance. However, I will keep an eye open for other leads on the early history of linen cloths with images on them (as recorded in the arid linen preserving climate at Memphis) and early relic collections that have come directly to Constantinople and northern France from Jerusalem (even from’ the Lord’s Tomb’). These leads only come up incidentally when I am working on other things but if no one is prepared to ditch Wilson and follow them up, then, as I said before, this will become a dead subject..","date":"2013-09-06","mins":"4:42 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-43494","author":"charles_freeman","post":"Matthias. Maybe you are not convinced. But I do think that if we are not accepting documents at face value we should say so. So Wilson should have said, perhaps. ‘ I know that tetradiplon is only used to describe the Shroud BEFORE it was unwrapped for Christ to wash his face with it but, as this is a fable, the writer clearly meant that he wrapped it up again in the same way afterwards. As for the mention of burial cloths later in the same text independently of the face cloth, well these are only symbolic burial cloths so let’s not bother about them. And to show how i think the Shroud might have been folded tetradiplon,let’s not bother with the possibility (following other Greek terms using tetra as a prefix) that it might have meant doubled over to form four sections or, more probably, that it was doubled over four separate times. I shall provide a picture of the Shroud folded double only three times and I hope you don’t notice because if you do you will realise that a cloth actually folded tetradiplon would go through the face.’ I think that fits the way you believe the history of the Shroud should be recreated..","date":"2013-09-09","mins":"1:47 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-43078","author":"charles_freeman","post":"Hugh, I share your enthusiasm for digging out these things although I am not as interested in relating them to the Shroud in the way you are. I suppose a sceptic would say how can we be sure that the Shroud images are not taken from the iconography of the day rather than the other way round but I shall leave that to those working specifically in this field. The Pray Codex is certainly not Byzantine and no one can persuade me that the stepped pyramid design on the coffin lid is a herringbone pattern – and I don’t see why anyone would want to copy the weave but not the images on the Shroud ( not shown on the Pray Codex). Count me as a sceptic on this specific issue. I was in touch with someone who has been looking at how images of the Ascent on the Cross were transferred and transformed when they were imported from Byzantium into the west. Not the same subject as the body, of course, but possibly of interest. I hope you can share your findings and convince me that the Edessa/ Shroud confusion has not killed the subject! Whatever conclusions one comes to as to the authenticity of the Shroud, I am convinced that they are two distinct iconographic traditions, each worthy of study in their own right but not to be confused with each other in the way Wilson does. I am sure you know of the 82nd Canon of the Quinisext Council of Constantinople of 692 that recognises the right to depict Christ in human form ‘so that we may perceive through [the image] the depth of the humiliation of God the Word and be led to the remembrance of His life in the flesh, the Passion and His death, and of the Redemption that this brought to the world’. Here is a clear reference to the image being not merely his face while alive but something more substantial, possibly his whole body, shown in death. I think it represents a different iconographic tradition from the Edessa Image. A pity that so much was destroyed by the iconoclasts so that we may never clarify this..","date":"2013-09-06","mins":"11:23 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-43142","author":"charles_freeman","post":"Hugh you probably know Gertrud Schiller on the iconography of Christian Art, Volume 2 it has the best selection of iconographic images of the passion , burial, etc.(including several of the crossed arms), that I know of. I am sure that you are the right lines to be looking at a much wider set of images than the Pray Codex – having seen similar resurrections scenes with open coffin lids in other contexts it took me ages to realise that some people thought that the LID was the Shroud! I am sorry, Matthias and others, I am cautious by nature in this enormously difficult field of ‘Lamentation’ imagery and I simply have not got the right kind of glasses to single out the Pray Codex from among the other images of this burial scene and say that this is the Shroud. The two separate cloths shown in the lower register suggest that the inspiration is not the Shroud but the gospel of John..","date":"2013-09-07","mins":"2:46 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-43144","author":"charles_freeman","post":"P.S. The upper register of the Pray Codex echoes John 19: 38 42, (Joseph, spices,Nicodemus). I think one should start here, not with the Shroud. Also Mark 16/ Matthews 28( as well as John for the separate face cloth) for the lower register. This is what the illuminator is working from surely adapting the gospel texts within the already existing iconography, ii/e the crossed arms already seen in the Champleve enamel of 1181 ( Schiller number 573) As you will all know one of the objections to the Shroud’s authenticity made in the fourteenth century was that the gospels , esp. John, do not mention an image on the cloth. I shall only be convinced that any artist has given the Shroud a greater status over the gospels when I see a pre 1355 depiction of the burial scene with images on the cloth. Not before..","date":"2013-09-07","mins":"3:00 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-43179","author":"charles_freeman","post":"Matthias. No there is what is probably the face cloth lying on the coffin lid as John says it was lying separately wrapped up. It is not clear whether the rest of the Shroud is being held by the angel. I have never said that the coffin lid is a cloth it is a coffin lid as seen in other pictures of the period. There is a very good example by Duccio di Buoninsegna, of c. 1318, entitled The Three Marys. I think it is still in the cathedral museum in Siena but will come up under a search. I have seen other examples – there is one in the Museo Sartorio in Trieste for instance – but as showing the lid was quite common these are not always great works of art any more than the Pray Codex is. I stick to the simple rule. Until I see a Shroud with images of Christ’s body on it depicted in a painting from before 1355, then I would not consider it as a depiction of the Shroud whose distinguishing feature in every document referring to it is the images. The Pray Codex fails on this ground alone. You can’t have documents relating to the Shroud talking of images as a distinguishing feature and pictures relating to the Shroud NOT having images!.","date":"2013-09-07","mins":"10:54 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-43246","author":"charles_freeman","post":"I am just looking for any cloth that has any image on it. Don’t count me in until you have found one! I am with Hugh on the Pray Codex being part of a wider iconographic tradition and not a one off that had to show a mystical view of the Shroud that no one can recognise without specially tinted glasses..","date":"2013-09-08","mins":"3:38 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-43461","author":"charles_freeman","post":"There is a 3/1 herringbone linen weave in the Victorian and Albert Museum. It took me a lot of pinning down ( I had heard rumours of it but could could get no reply from the V and A) but the relevant museum numbers are 7027 1860 and 8615 1865 if anyone wants to follow that up. Not radiocarbon dated but suggestions from the print – superimposed on the cloth of fourteenth century origin. Obviously the V and A were not going to cut off a piece of such a comparatively rare cloth but presumably anyone interested can ask to see it..","date":"2013-09-09","mins":"8:44 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-43479","author":"charles_freeman","post":"Louis it may or may not add to research although am I the first in these recent debates to actually have the right museum number? I can understand why no museum wanted to cut off a piece of medieval linen in a cause that most probably thought was a meaningless sideshow. I do think the V and A should have asked Tite to go round and have a look though!! It was not far for him to go..","date":"2013-09-09","mins":"11:22 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-43477","author":"charles_freeman","post":"Matthias whenever challenged you use words like ‘fable’, ‘symbolic’ etc because, as is obvious to anyone who looks at the Pray Codex it does not show a long cloth with images on it. The Shroud comes into my general work on relic cults, etc as periphery. Among the vastly more interesting cults of medieval times, it hardly makes an appearance – simply a cult that sprang up in one small church, was condemned by a bishop, a so called relic that was hawked around a bit and passed on to the Savoy family who DID make it into a post medieval cult in the seventeenth century. Then it does come back into my attention as it was a major part of court rituals and I was lecturing on Baroque Turin earlier this year so I had to know about it in this context. So when I look at the Pray Codex, I note – a shroud which comes only up to the shoulders of Christ, as with most depictions of the period – crossed arms similar to the iconography of earlier depictions of Christ – no signs of blood on the actual body, a halo instead of a Crown of Thorns ,again typical of this period. – a coffin lid (compare Duccio) with a stepped pyramid design, not herringbone. – a separate cloth, possibly the face cloth mentioned in John, lying on the lid. No signs here again of any image on the cloth. – holes on the coffin lid which go up three , then one to the LEFT. The Shroud marks on the top layer go up three ,then one to the RIGHT.( I suppose this is part of your not being literal but it reminds me of the people who said that the pyramids represented a star pattern,until someone noted that that they had turned the stars completely the wrong way round ( and that other than the three major pyramids none of the other pyramids fitted). Red stains mean nothing unless they are on the Shroud. So I see no reason whatever to see the Shroud here,however much you try and argue that the artist has distorted the actual Shroud in some symbolic way. I know of many accurate representations of relics in paintings look at Carpaccio’s depictions in Venice of the reliquary of the True Cross, but I don’t know any where they are restricting an understanding of a relic to a few by not showing it literally. My frustrations, repeated all too often, is that people go on following or even creating leads for which there is no evidence (and as a result will not win over anyone,especially in the world of academia) when there are so many other leads that no one seems prepared to follow up..","date":"2013-09-09","mins":"11:13 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-43562","author":"charles_freeman","post":"Louis – would you like to ask them what they charge?! It won’t be cheap and as said earlier it might not add anything anyway. Does anyone have a research grant to research the Shroud?.","date":"2013-09-10","mins":"3:20 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-43821","author":"charles_freeman","post":"There was also an icon of the Virgin Mary that was used successfully to ward off the attack of 626. Hugh and Mathias, and anyone else interested. Finally I have found out about the holes in the coffin lid when looking for something completely different about medieval sculpture! It is from William Forsyth: The Entombment of Christ: French Sculptures of the Fifteenth and Sixteenth Centuries, Harvard UP 1970, page 9. ‘The three circular holes which occur on the front face of a number of representations of Christ’s sarcophagus in western art of the twelfth and thirteenth centuries are apparently copies of the three oculi in the tomb of the Holy Sepulchre in Jerusalem through which pilgrims could view the sacred rock or stone tomb in which Christ’s body lay.’ He quotes Daniel. A Russian pilgrim, from 1106 07. “And now this holy bench is covered with marble plaques and one has cut in the side three little round windows and by these windows one sees the holy stones.” In a footnote Forsyth gives a list of those representations he knows of including four 12th century examples – all, I think in stone carvings (none illustrated). These are clearly the circular holes on the Pray Codex coffin lid so no need to read in the Shroud holes here. The Pray Codex really does not have anything going for it please let’s move on!!!.","date":"2013-09-11","mins":"3:46 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair"},{"id":"comment-184031","author":"charles_freeman","post":"You need to have a close up of the sguiggles of blood on the head and compare them with the Shroud. You will also notice the blood running down the arms as the Shroud does and you also need to note the marks of the scourging covering the whole body, something rarely seen before 1300. So the link is very close. This is a London production but you can see the same blood on the Roettgen Pieta from Germany, a sculpture of roughly the same date, blood on arms and legs, blood running down from the Crown of Thorns. The patterns are very similar and are not known before 1300. I think the correlation is very close largely because we do not have earlier examples of these patterns of blood. I suppose you could argue that the Shroud was copied without the blood before 1300 and was then copied in London and Germany with the blood after z1300 but it is a long shot. I am not trying to lead people anywhere I am just setting out evidence that has not been introduced into the argument yet so far as I know. How else do things move on?.","date":"2015-01-17","mins":"8:11 am","url":"https://shroudstory.com/2015/01/17/squiggles-of-blood-on-the-head-almost-identical-to-holkham-bible/","cat":"art","title":"Squiggles of Blood on the Head Almost Identical to Holkham Bible?"},{"id":"comment-184092","author":"charles_freeman","post":"And of course this is a nude figure showing that such things were possible. I think the similarities between the Shroud and this Bible as well as a lot of the iconography of the period.e.g. The Man of Sorrows – does suggest that one would place it within this period. I cannot imagine how de Wesselow missed this. One has to contrast the representation of the man on the Shroud with the iconography of the period just before, e.g. The complete lack of bloodstains, and scourge marks on the body of Christ on the Pray Codex – but we have been here before and I did not convince anyone then! But if we go back to the body and ( non existent) bloods on the Pray Codex and compare it to the body and blood of the Holkham Bible, the. It is clear that t He Man on the Shroud fits better with the latter than with the former. Or perhaps once again I am wearing the wrong spectacles!.","date":"2015-01-17","mins":"3:23 pm","url":"https://shroudstory.com/2015/01/17/squiggles-of-blood-on-the-head-almost-identical-to-holkham-bible/","cat":"art","title":"Squiggles of Blood on the Head Almost Identical to Holkham Bible?"},{"id":"comment-16084","author":"charles_freeman","post":"Correction: although it is not entirely clear, Arculf may not have been referring directly to a shroud in the tomb – the points about the sudarium having been in Jerusalem all along still stands..","date":"2012-09-10","mins":"4:26 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16133","author":"charles_freeman","post":"Carlos. We do not have any other mention of the shroud in the Blachernae chapel and de Clari, the knight from Picardy did not happen to know what happened to it. He does have a separate reference to the Mandylion in his description of the Pharos Chapel, in his History, Chapter lxxxiii So we have to look at the other evidence for what happened to the Blachernae Chapel during the sack. The main link is with St. Mark’s in Venice. The Venetians looted a number of icons from the Blachernae Chapel and took them to St. Mark’s. The details are to be found in Hans Belting, op.cit, p.195 ff ,’San Marco in Venice and its Icons ‘ and more recently in Paul Stephenson, The Byzantine World (2010) Chapter 29, ‘Sacred Space between Constantinople and Venice’, esp. P. 419. Both show the link between icons in St. Mark’s and those in the Blachernae Chapel. So the first place to look for the possible transfer of the Shroud from the Blachernae Chapel would be Venice as we know the Venetians looted from the Chapel. Unfortunately, we do not seem to have a list of what they took and the connection is only known through a study of the icons themselves in Venice. Even more unfortunately a fire of 1231 in Venice destroyed much of what had been brought from Constantinople so the shroud may well have perished then if they had taken it. One must also remember the immense destruction and chaos in Constantinople in 1204. Try reading the (Byzantine) account of Niketas Choniates if you haven’t already. He shows that there was unrestrained looting by the crusaders and many relics must simply have perished in the flames, especially if they were made of cloth. Only those in the imperial palace were safe. One can hardly be surprised that many objects known to have been in Constantinople before 1204 are not recorded afterwards. Michael Angold’s The Fourth Crusade has an excellent chapter on what relics were known to have been taken from where and the hierarchy , starting with the cross, then phials of Christ’s blood,etc etc. No mention of a shroud among them (except in the Pharos Chapel in the palace where burial cloths of Christ are said to be of cheap cloth and to have smelt of myrrh). Either the Blachernae Shroud was not considered important enough to list or or it simply disappeared in the destruction. We cannot know and to assume that it was the Turin Shroud goes so far beyond any evidence that survives..","date":"2012-09-11","mins":"6:38 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16150","author":"charles_freeman","post":"I will leave it up to the experts to follow up the reference in Jaroslav Folda’s Crusader Art (2008), p. 72 that when Bishop Conrad of Halberstadt returned to Halberstadt from the Fourth Crusade and the Holy Land in 1205 he had with him, ‘pieces of the Holy Shroud and sudarium’ (alongside many other relics of the Passion). The original source Folda gives is the Gesta Episcoporum Halberstadensum. Professor Folda goes on to say that he is not sure whether Conrad got his ‘Shroud and sudarium’ from the Holy Land or Constantinople as we simply have the list of what he came back with. Michael Angold repeats the story ( The Fourth Crusade, p.232) but wonders whether the Conrad was just given ‘tokens’ of these and his other more prestigious relics by the emperor Baldwin from the collection in the Pharos Chapel as Conrad’s list is very similar to the list of relics we know to have been in the chapel but which were still there in 1205. Obviously it would be interesting to find out whether there was any veneration of a Shroud, and the other relics*, from either Constantinople or the Holy Land in Halberstadt after 1205. * It is important to remember ‘the other relics ‘as in the case of the Sudarium of Oviedo which was discovered alongside a mass of other relics purporting to come from the Passion and Crucifixion but conveniently forgotten in the rush to find the Shroud and only the Shroud. If the Oviedo sudarium is believed to be genuine then why not the piece of the Cross and the blood of Christ that was found in the same chest?.","date":"2012-09-11","mins":"12:44 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16142","author":"charles_freeman","post":"Addition: The chapter in Paul Stephenson’s book is by Thomas Dale. ‘Thomas E. A. Dale is a professor of Art History at the University of Wisconsin, Madison, where his research interests include Early Christian, Medieval and Byzantine art; Romanesque art (particularly representations of the body); San Marco in Venice; the cult of the saints; and cultural appropriation.’ What more could you ask in the way of expertise on the subjects we are discussing?.","date":"2012-09-11","mins":"8:22 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16151","author":"charles_freeman","post":"And once one gets searching, there are other references to Byzantine shrouds or sudaria. They are always listed as ancillary to the fragments of the Cross (the most popular gift by a Byzantine emperor to other rulers as it was considered the most prestigious of all relics). Here is another account with translation. The point I want to make is that Wilson’s account has blinded Shroud researchers to the many other references to burial shrouds of Christ. This is another example of a/shroud controlled by the emperor suggesting that pieces of it were given out. Basileus misit et multa sanctuaria, / Quae in templis seu bellis sat sunt necessaria / Nulla dona super terram his habentur paria: De sudario, de cruce, de corona spinea, / Qua delusit regem suum amaricans vinea. 1 Huiusquemodi thesaurum non corrumpit tinea.” “The basileus [ Alexios I] sent him [Henry] many saintly things, necessary in churches as much as in wars no gift on earth equals them: [fragments] of the shroud, of the cross, and of the crown of thorns, through which the vineyard that turned bitter deluded its king. Such a treasure is not corrupted by the moth.” From Benzo of Alba’s panegyric in honour of the emperor Henry IV, Holy Roman Emperor, 1084 1105..","date":"2012-09-11","mins":"1:57 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16165","author":"charles_freeman","post":"Yannick. ‘And if it was so and if the public showing of 1203 and 1204 was the very first time the inner part of the Shroud (with all the injuries, bloodstains and body image we can see) was publicly showed to the faithful, I don’t have any doubt at all about the fact that it probably had a huge influence on Christian art, even if other things could also have contributed for this change (like the epidemies that were going on in Europe during that era, the spirituality linked with the stigmata of St Francis of Assisi, etc.).’ If this is your interest, Yannick, there is a mass of recent scholarship to explore on the relationship between the sack of 1204 and western art. In addition to Thomas Dale, look at the work of Holger Klein, for instance, which is freely available on his Columbia website. I can’t see how the public showing of a shroud in Constantinople could have as much impact as the actual mass of relics and Byzantine art that came back to Europe after 1204 which people could actually handle and copy. See Klein on ‘Refashioning Byzantium in Venice 1200 1400’ and his exhaustive article on the transfer of relics from east to west from which I got the information of the transfer by the emperor of a piece of the Shroud to Henry IV. Incidentally I find that the treasury at the monastery at Halberstadt still has a paten brought back by Conrad from Byzantium in 1205. I was lecturing on early Byzantine ivories at the Victoria and Albert Museum last year , and there was a fascinating casket that I had not seen before. It was Byzantine but had been found in a monastery in Italy. It was assumed that it must have been one of the treasures that had been brought back in 1204. It was objects such as these that would have provided models to work from, as they certainly did in Venice it is hard to see how anyone would have been able to record an image on a Shroud within a church that would only have been lit by candles! Once again there is the danger of giving the Shroud a status that it does not seem to have had. Shroud(s) were among among hundreds of relics in Constantinople and certainly not the most prestigious .Every list that does mention a shroud places in down the list behind the Cross, Crown of Thorns and the actual blood of Christ.Parts of John the Baptist also outclassed it. The isolation and elevation of the Shroud as a sort of uber relic is a very recent phenomenon, not known in the medieval world..","date":"2012-09-12","mins":"4:46 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16188","author":"charles_freeman","post":"Artscience. Well, you have stated one of the reasons that is given for doubting the authenticity of the Shroud, that such a Shroud would have been noticed. Although, as in the case of most relics, we have mentions of several burial shrouds in Constantinople and in western Europe, not a single one is described as ‘a large cloth with an image, showing nail wounds in hands, and feet, side wound, real blood, indications of a crown of thorns, a summation of death and resurrection, plus an image of what Jesus looked like would be outclassed by any of these others (which are very easily faked).’ I would also expect some mention of the double image as this is a distinguishing feature of the Turin Shroud. We have to wait until the fourteenth century for such a mention. As I have said before, I don’t accept a single reference that Ian Wilson has been able to provide as referring to the Turin Shroud, some of them obviously refer to other shrouds that were around and some refer to the Image of Edessa which is never described as a ‘shroud’. The same would go for the ‘;shrouds’ that I have found mentioned. Note the misleading comments of Dan Scavone who says that ‘sindon’ is the N.T. Word for shroud. Well, it isn’t in any Greek lexicon or New Testament Greek dictionary that I know of. It refers to cloth ,especially fine linen, and that just describes the cloth Jesus was wrapped in. It doesn’t become transformed into a general word for ‘shroud, any more than if Jesus’ body had been laid out on a table the word ‘table’ would become transformed into the word for ‘bier’..","date":"2012-09-12","mins":"11:02 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16194","author":"charles_freeman","post":"Yannick, 1)No, I never suggested that the paten had anything to do with the Shroud. However, if one thing still remains from Conrad’s expedition to Constantinople in the treasury at Halberstadt it would be useful to see if anything else of his supposed haul is also still there. As you may know the Treasury of St. Mark’s in Venice still has a section devoted to relics from the Passion of Christ (the same as brought from Constantinople) but they are hardly mentioned in the guidebooks. So it would be worth looking and seeing what else is in the Halberstadt Treasury. If I am ever that way i shall certainly look in! 2) Your comment ‘But I have to say that I’m not aware of a sudarium that would have been sold to St Louis in this mega transaction. Who knows what happened of this sudarium ? And who can say that it ever existed for sure in Constantinople and could not have been confused with the Shroud of Christ that was there also.’ Good point , and one I have been making repeatedly we simply don’t have enough precise statements about exactly what was where and the word ‘sudarium’ is often used without a clear reference to the size of cloth that it refers to. You have done sterling work here in showing how Wilson misuses sources. As I have replied to Art science , there is no documentary evidence which CLEARLY refers to what we know as the Turin Shroud. Perhaps I am just being over cautious but it was the way i was trained as a historian. 2) Your comment ‘IF (note the “IF” because it’s the most important thing here) the inner part of the Shroud of Turin (where we can see the body image and most of the bloodstains) was showed publicly for the very first time in History during the time the Latin crusaders were at the gates of Constantinople in 1203 1204 and that many of these crusaders were able to see this completely unique, gruesome, crude and even scandalous image of a dead and suffering Christ, I’m totally convinced that this sighting would have had definitively a huge influence on the apparition of the Suffering Christ’s icons that first appeared in Europe (think about the Man of Sorrow icon for example that shows many similarities with the image we see on the Shroud!!!) once the crusaders returned home (with probably the Shroud itself with them in their “luggage”!!!!). ‘ I agree with the ‘IF” because we only have one record in a marginal comment by one crusader of a shroud with an image. Have you any evidence that anyone else saw this shroud, or that anyone could see blood or suffering on it? Is there any evidence in any of the chronicles of anyone affected by seeing a shroud so that they would have begun a new phase in art. ( One would need to read Professor Folda on this as this is his specialist subject and he is the acknowledged authority on the relationship between what the crusaders brought back and how it affected western art I haven’t seen his book yet.) Note my earlier suggestion (no more than that) that the first place to look for the transfer of a relic from the Blachernae Chapel would be Venice as the Venetians took icons from the Chapel but, as I have said, most of the relics the Venetians looted were destroyed in the fire in the treasury of 1231 so that even if the Blachernae shroud had escaped the destruction in Constantinople itself, it might have perished in the fire. Anyway the images of the suffering Christ go back much earlier than 1204. I would refer you to Rachel Fulton’s From Judgment to Passion, Columbia UP,2002. While the Gero Crucifix of 970 is normally seen as the first ‘suffering Christ’, I was more moved by the Old English poem Christ III. ‘And downcast in soul they shall also behold the ancient gashes and the gaping wounds in their God, even as His foes pierced His white hands and hallowed feet with nails and likewise made blood run from His side, where blood and water issued forth together in the sight of all, flowing before the face of men, while he was on the Cross’. If that is not an image of the suffering Christ, probably tenth century, I don’t know what is.You will find many more details of the emergence of the ‘suffering Christ’ in the tenth and eleventh centuries in Fulton’s acclaimed study. I agree with so much of what you have written on Wilson, you have shown how his arguments fail to stand up in any sense at all, so I am sorry I have to disagree with you here!.","date":"2012-09-12","mins":"11:41 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16266","author":"charles_freeman","post":"( I thought I had posted this once apologies if it appears twice in slightly different versions!) Max. Can you clarify, please, which building ‘chapel you are referring to in your post. The Blachernae was a district of Constantinople. The Church of the Blachernae was built on the site of a sacred spring by the empress Pulcheria in 451. She filled it with relics of the Virgin Mary and it contained the famous icon of the Virgin Blachernitissa that was said to have saved the city in 626 when it was attacked by the Avars. It was,of course, a public place with expositions of the relics, often in processions in the courtyard. I have always assumed that it was here that Robert de Clari saw his shroud with an image although I know of no other reference to this shroud and no else seems to have seen one either. We simply do not know how far we should trust his account without any corroborating evidence to support it. It seems to have been looted in 1204. I am awaiting a copy of Thomas Bale’s article on the links between icons now in St. Mark’s Venice and the Church. The Church was burned down in 1434 and there is now a 1960s chapel on the site where the spring is still venerated. The Palace of Blachernae was used by the later Byzantine emperors. Parts of it still stand and there are excavations going on. I visited it last spring to see whether there was anything worth bringing my study group to see but it is boarded off and there is no public access at present. It would, of course, have had its own private chapel, but I have no reference to it or what it contained. So please let us know which chapel you are referring to..","date":"2012-09-14","mins":"6:11 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16199","author":"charles_freeman","post":"Thanks for yours Yannick. We both agree on the need to do a lot of rethinking in this area and to follow up many leads that have still not been explored. The adulation of Wilson has made people lazy!! So it is a debatable questions as to whether the images of the suffering Christ are a development from an earlier tenth century tradition or were a new departure, in the form they took , in the thirteenth century. I shall look forward to reading Professor Folda in detail on this as always too expensive to buy my own copy so i shall have to track one down next time I am in the Cambridge UL!. Exploring relic collections on the ground is important because nowadays very few churches advertise what they have gathering dust in their sacristies. So I was delighted to find in the church of Catherine of Alexandria in Galatina , a finger of Catherine herself and not any old finger but the one with the ring which the infant Christ placed on her finger himself after he had appeared to her with His mother. It has been stolen from the body of St. Catherine in Sinai by a Norman noble who, as a good Catholic, believed that heretical Greek monks had no right to it! There is scarcely a mention of it in the literature but there it still was, several hundred years later, in a room adjoining the church. That is why I prefer to do my own research on the ground. Alas, I have no plans to go to Halberstadt. My next tour is Istanbul/Constantinople itself but, of course, nothing of relevance left to explore so far as the Shroud is concerned. Then I take a tour of north eastern italy and might just be able to look in on St Mark’s to see some of the icons they say were brought back from the Blachernae Chapel! Good researching – there is a long way to go but I think a lot of relevant material being covered by Profs. Klein, Dale and Folda. Both of us need to be on top of that if we want to take these debates further but alas I have too many other projects to continue contributing this blog. As a matter of principle I do not reply to Stephen Jones. For him to suggest that I will write anything, even if I know it to be false, just for money, places him beyond the pale..","date":"2012-09-12","mins":"1:53 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16268","author":"charles_freeman","post":"Max references please to the exposition of the Image of Edessa in the private chapel of the Blachernae palace in 1204. Normally at times of ‘great danger’ icons of the Virgin Mary were brought out – the only reference I know of of an exposition in a procession of the Image of Edessa was in a time of drought, not quite the same thing. Then it went as far as the Blachernae Church, as I understand it , before returning to its permanent home in the Pharos Chapel. But perhaps you can provide a reference to it being moved in the early thirteenth century the Image was such a famous relic it would surely have been documented. As I don’t buy the argument that the Image of Edessa was the Shroud of Turin, I don’t see any connection with whatever de Clari saw or did not see in the Church of the Blachernae..","date":"2012-09-14","mins":"6:34 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16270","author":"charles_freeman","post":"P.S. See Holgar Klein ‘ ‘Sacred Relics and Imperial Ceremonies at the Great Palace of Constantinople’ downloadable from Klein’s website which gives details of the exposition of those relics in the Pharos Chapel.","date":"2012-09-14","mins":"6:38 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16271","author":"charles_freeman","post":"Max ‘made the Church of their Blachernae their private chapel’ I am sure we would have had a record if they had taken it out of circulation. They would certainly have visited it in the way they did Hagia Sophia, another public space. You must have got ‘private chapel’ from somewhere – I am interested to know where..","date":"2012-09-14","mins":"6:42 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16273","author":"charles_freeman","post":"Max. Fine, they may well have but there is absolutely no evidence that they did and it is extremely unlikely!!! Please explain why this is an important point in any case, what does it add to the story?.","date":"2012-09-14","mins":"7:01 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16277","author":"charles_freeman","post":"Max no having seen the what remains of the Blachernae Palace I am sure it would have room for a private chapel that would be standard for the time. I just believe it would have been i INSIDE the palace and not in a public church so that these are two separate buildings.I am just interested that you have a REFERENCE to a private chapel and I wondered whether you were confusing two buildings in the Blachernae district. No evidence for the ‘sydoine’ being a symbol of the emperor please read Holgar Klein.See,for instance, how the emperors’ relic of St. Stephen played a large part in coronation rituals, no mention of a SHROUD having anything to do with any imperial ceremony unless you can show me one..","date":"2012-09-14","mins":"7:24 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16288","author":"charles_freeman","post":"Max : ‘I wrote the sydoine IMAGE/figure (of the resurrected?) Lord might well have been a(n) (most secret?) emblem of both the Byzantine emperor as representative of Christ and his power on Earth.’ (Emblem/symbol well I suppose there is a distinction!) Well,if it is it is very secret! And what is the point of the secrecy when the divine aura has to be promulgated to the public as we know that it was from texts such as De Cerimoniis. I think it would have been seen as blasphemous if the emperor had tried to link himself to the risen Lord. All the references suggest that the emperor was seen as a fully human representative of God on earth and clearly subordinate to him. The Image of Edessa was clearly of great importance to the emperors which is why it was kept so carefully and securely in the Pharos Chapel in its own case that only the emperor could open. I can see no evidence that it was the Shroud of Turin and a mass of evidence that it was never seen as a shroud but this has been argued over ad infinitum and I am not going to reopen it. But there is no problem with the emperor having a special relationship with the Image as there were a number of relics that were of special importance and used as part of the public display of the emperor.(Again Klein is good on this so I hope you bother to read him if you have not already.) Some go out on display, some appear in specific rituals ,e.g. The coronations (relics of Stephen), etc. The Robe of the Virgin was put on as a garment by the emperor Romanos when he went out to negotiate with the Bulagrian ‘tsar’ Symeon in 924. Then there was the relic of the True Cross that had an elaborate ritual in which it was processed around the city in July every year to ‘cleanse and and sanctify all places and houses of of the God guarded and imperial city’ and then brought back to the throne room where it was placed on the imperial throne before being packed away again. So the emperors manipulated a number of different relics in different ways. Nowhere that I know of ( but there are many accounts involving relics so I, or Klein, may have missed something) is there anything that is clearly described as a ‘shroud’ being involved with imperial ritual. I am afraid I don’t go along with all this ‘secret’ stuff. Too often pseudo historians use it to fill in the gaps so I am always suspicious!!.","date":"2012-09-14","mins":"10:09 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16295","author":"charles_freeman","post":"Max, You make it quite clear from your ‘might haves’ ( what i would call ‘highly improbabilities’ ) that you are simply speculating. No problem here so long as they remain speculations but the overwhelming evidence is against your ‘might haves’ and we have to live with ‘best fits which are always provisional and can be changed as new documentary/archaeological evidence emerges. That’s my world and the world of most practising historians. I don’t believe that the Shroud of Turin and the Image of Edessa are the same. No Byzantine scholar has ever been able to find any evidence that they should be. I believe that the Image of Edessa was created ,like many other similar figures, most destroyed, of course, in the iconoclastic period, in the sixth century. Belting has the argument but ,of course, he is supported by others. This is why the attempts of Wilson and others to find a history between 30 and 550 fails so lamentably – and laughably see my article on the Image of Edessa. There is no acceptable evidence yet found of any history ! No evidence that the Image of Edessa was ever folded into four. A LEGEND only says that the cloth was folded into four when it was without an image and BEFORE it was handed to Jesus. (Wilson gives the misleading impression in his The Shroud ( 2010) that it was described as tetradiplon AFTER the image was on it and sadly all too many have been misled by this, even myself at one point ( I now know better!).) No evidence that Jesus folded it BACK into four when Jesus passed it on. There are reasons why it MIGHT HAVE been folded before it was given to Jesus (see my article Tetradiplon Revisited). There are ways that it could have been folded into four or the edges doubled up when it was stored so that the face could be kept in the centre in a smaller box but unless we have access to the Image of Edessa we would not know. There is not a single reference to tetradiplon of the Image after it had been wiped on Jesus’ face. The tetradiplon text, the Acts of Thaddeus, makes it quite clear that the burial cloths of Jesus, which are mentioned later in the Acts, are distinct from the cloth that was originallly tetradiplon. So here, although this is purely a legendary account, there is no support in it, in fact the opposite, for the Image of Edessa and the Shroud of Turin being the same. But one can go on saying this forever without convincing those who wish to believe otherwise! Please note: I am saying ‘There is no evidence’. We can only work when there is evidence. Of course the emperor was the representative of God/ Jesus on earth, but the distinction between human and divine was made very clearly in the texts (otherwise you would never be able to depose an emperor). You seem to have misquoted me. What I said: ‘All the references suggest that the emperor was seen as a fully human representative [sic] of God on earth and clearly subordinate to him.’ What you seem to think I said: ‘Secondly, you can ‘think’ Byzantine emperors were not seen as REPRESENTATIVE OF CHRIST. ‘Methinks’ NOT A FEW Byzantine scholars will TOTALLY disagree with you. The imperial throne was ALWAYS placed BENEATH Christ ‘empty throne’ (THUS there was nothing blaphemous at all about it)’ As Christ was a consubstantial part of the Godhead, the emperor was clearly a representative of God/Christ /the Holy Spirit. I assumed that everyone would know this but perhaps I was wrong. I said nothing about the emperor not being a representative of Christ!! The blasphemy would come if he crossed the boundaries and aligned himself with the divine Christ. I am not sure what you mean by the emperor’s empty throne being placed benath Christ’s empty throne. The evidence we have of the Chrysotrklinos ( the octagonal audience hall of the Palace) is that the empty imperial throne ( occupied ,of course by the emperor on special feasts and ceremonies) was under an image of Christ believed to be a mosaic. (See J.M. Featherstone,’ De Ceremoniis and the Great Palace’, in P. Stephenson (ed.) ,The Byzantine World, Routledge, 2010, pp. 165 6.) I still don’t understand the context (s) in which you use the word ‘secret’. The danger is that if there is no evidence for something one says this is because it is ‘secret’. This way pseudohistory lies – not always, of course, but in the vast majority of cases I know of. (Particularly bad among the pseudohistorians of ancient Egypt!). Ian Wilson’s ‘secret history’ of the Shroud of Turin under the Knights Templar is an especially laughable case I really could not believe his text on this. (Paraphrase: We don’t know what happened to the Shroud. Therefore we must look for people who kept secrets. The Knights Templar had lots of secret rituals. Therefore it is likely the Shroud went to the Knights Templar and that is why we have no evidence of its existence.’ This is a classic of the genre!) Sadly even he has now had to denounce Barbara Friel his main ‘source’..","date":"2012-09-14","mins":"1:40 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16306","author":"charles_freeman","post":"Quite happy to be ignorant of all these things, Max. Conventional history has served me well for forty years and it seems to get as close to the truth as your more esoteric methods. So what is wrong with not being a crypto historian and archaecryptologist all the top history professors I admire have done without them. They are simply not part of the world in which us conventional historians work but good luck to you!.","date":"2012-09-14","mins":"7:31 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16320","author":"charles_freeman","post":"Max, You live in an esoteric world of your own to which none of us are privy. I doubt whether a single person reading this blog is able to enter into it. Good luck to you but you cannot expect people to answer questions from a perspective that is solely your own. I have been asking the simple questions such as ‘ What do you mean when you talk of the private Blachernae Chapel of the emperors? Do you mean a chapel within the Blachernae Palace or do you mean the Church of the Virgin Mary in the Blachernae district? I have no doubt that the emperors visited the Church of the Virgin Mary just as they did Hagia Sophia on certain feast days but I have never seen the Church referred to as their ‘private chapel’. In addition, I am not sure what the point you are trying to make is by referring to the ‘private chapel’. How does that add to the story? Relic processions are well documented in the list of ceremonies of the emperors and in other accounts. These were public displays and different relics appeared on different occasions. The problem we have with de Clari’s account is that despite quite a number of records about the icons/relics of the Church of the Blachernae no one other de Clari ever mentions a shroud. It certainly was not one of the important relics of the city or we would have known of it. As de Clari himself says, nothing more is known of it after the sack. It does not figure in any of the surviving lists of looted relics that Crusaders drew up. De Clari may have been mistaken as to what he saw in the gloom of the church, it may have been destroyed during the looting of the city. Without any documentary evidence to corroborate his account, the question must simply be left open as to whether it ever existed or, if it did, whether it survived the sack of the city. The Church of the Blachernae was after all one of the most vulnerable parts of the city and when one reads ( in Nikoletes Choniatas’ account) that even the altar of Hagia Sophia was ripped apart by the crusaders ( with marble from Hagia Sophia reappearing in St. Marks!) one must wonder what elsewas lost. I am sorry, Max, to be so mundane. The questions I ask are the simple ones!.","date":"2012-09-15","mins":"11:56 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16323","author":"charles_freeman","post":"‘Btw can you and /or “all the great professors you admire” explain to me the Turin Sindon image formation process?’ No and at present no one else can. Look at the endless arguments on this blog. It is a pity that the Shroud has been so mauled about by people who never had any background in ancient textiles and that samples were removed and left floating around without any conservation laboratory being in charge of how they were disseminated.Two problems follow 1) An enormous amount of knowledge about the Shroud has probably been lost or samples invalidated by the way they have been passed around.Many so called shroud researchers had no specific expertise in ancient textiles the Shroud of Turin was probably the first ancient textile they had ever handled!!! or had studied the way that linen interacts with different substances or they carried out their work in what they themselves called ‘home laboratories’ There are sophisticated textile conservation laboratories around but how much of the shroud research has actually been done in one! 2) Although with every year that passes, modern scientific techniques are more likely to explain how the image was formed, the Vatican has probably learned its lesson about letting the Shroud out again. I have no doubt that sophisticated analysis using the latest research techniques in one of the world’s top textile conservation laboratories with expertise in working with ancient linen would help clarify many of the issues over which there are interminable debates by people who have no proper access to the original materials..","date":"2012-09-15","mins":"2:07 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16331","author":"charles_freeman","post":"“Many so called shroud researchers had no specific expertise in ancient textiles…’ That is what I said,Carlos, not ‘all’ shroud researchers. For instance, not a single member of the original STURP team had so far as I am aware, and I am happy to be corrected, any expertise in ancient textiles. No preliminary examination of the physical condition of the Shroud was made in 1978 before a programme of analysis was developed by the external STURP group. ( I blame those who let them in suppose I wrote to the Director of the Louvre saying that I was a physicist with no knowledge of fifteenth century painting but I wanted access to the Mona Lisa and to be allowed to take samples off the surface it would be the job of the Director to tell me to get lost!) The STURP team just arrived and got to down to work under immense time pressure to get their samples. Whoever heard of a proper programme of analysis working under such conditions! And the STURP team then separated and isolated the samples from which a lot of the later work was done and we all know what happened when STURP made decisions about who should have them. Of course, some experts have worked on the Shroud and have done useful work. Mechtild Flury Lemberg , for instance, whom you cite, rubbished Ray Rogers on reweaving so this was progress, even if her work is not acknowledged by the Ray Rogers fans. My real point is that with every year that passes we develop new techniques of analysis and if these were applied to the Shroud in proper conditions by experts we are likely to solve the mystery of how the image of the Shroud was made. I am not saying that we will but there has been such progress in all these fields ,even since Flury Lemberg was working ten years ago, that we can have some confidence that the mystery will be solved along with a more precise dating (as this field also is rapidly developing). So over to the Vatican!.","date":"2012-09-16","mins":"4:41 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16082","author":"charles_freeman","post":"I am sure that all this has been said before. Robert de Clari was from Picardy , a ‘poor knight’ as he describes himself, and he brought back relics he had taken from the Palace at Constantinople which he gave to the monastery at Corbie in his native Picardy in two batches , 1206 and 1213. Michael Angold in his The Fourth Crusade ( p 13) suggests that de Clari’s account was written to justify his taking of the relics he gave to the monastery and that the account was lodged there. There is only one manuscript version of it that dates from a hundred years later, c, 1300. As Angold suggests there is no evidence that it was ever circulated very widely as it was never written for a wider audience. As has been widely suggested, the reference to the burial shroud in the Blachernae Chapel was only a marginal comment. We have absolutely no other mention of this relic and this suggests that it did not have a big following. It could not be the Mandylion or the OTHER set of burial cloths mentioned in the Pharos Chapel as these would not have been moved to an alternative shrine without a great deal of publicity ( These moves simply did not happen unless the relic was looted as did happen in some cases, e.g. The bones of St. Benedict from Monte Cassino if you had a relic you hung on to it!) de Clari would presumably have known that at this date the burial shroud on show at Cadouin was the one which was packing in the pilgrims and making the abbey there very wealthy. We now know that it is a fake, made in one of the caliph’s workshops, but it was brought back after the First Crusade directly from Jerusalem and obviously relics of the Passion that it was claimed were found in Jerusalem had a special cachet, as they had done ever since Helena had found ‘the True Cross’ there in the 320s and Arculf had seen both the burial shroud and the sudarium still there in the late seventh century. Wilson is clearly embarrassed by Arculf’s account but he repeats it omitting the reference to the shroud that Arculf saw in the tomb and arguing that the separate sudarium was actually the Turin Shroud that had been temporarily removed to Jerusalem because of an earthquake in Edessa. The fact that the Jerusalem sudarium was described as only eight feet long and that it floated above a fire that was set alight to see if it was authentic ( it was!) is explained by Wilson as that it was the Turin Shroud but this time folded into two. Well, you have to give him full marks for imagination. In his determination to show that this sudarium was the Turin Shroud Wilson also omits the part of the account which says that it had been in Jerusalem all along but hidden by a Jew after it had been stolen from the tomb..","date":"2012-09-10","mins":"4:05 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16346","author":"charles_freeman","post":"Carlos. It think it is standard practice to examine a textile such as the Shroud in detail before any work is done on it, just as the Mona Lisa would be examined very carefully before any conservation work was done on it. The older the textile is the more this preliminary analysis is needed because we are dealing with very rare survivals of any cloth (outside Egypt) from before AD 1000 This is to make sure that when you actually touch the fabric you know exactly what harm you are likely to cause. It is also important to have time when in fact 1978 was an enormous rush. There does not seem to any proper scientific procedure for dealing with the samples removed from the Shroud in 1978. Was Walter Mac Crone qualified or not qualified to analyse them? If he was not why was he given the job and by whom? How could Ray Rogers be sure of the provenance of his threads in 2003 and how does he know that they were not contaminated between 1988 and 2003? This was not a proper scientific way of going about researching the Shroud. No one was in overall control much of the wrangling would have been avoided if there had been a single TEXTILE laboratory in charge of the whole process which worked on the samples in house. The Shroud has to be examined as a whole in laboratory conditions. We are 35 years on from the STURP investigation, 25 years on from the radio carbon dating. In all the fields associated with the Shroud there have been enormous scientific advances and most ( stress ‘most’ ) of the inconclusive debates I see here still seem to depend on old samples or by people who have never examined the Shroud as a whole. Even if we have to wait another ten years for scientific analysis of the cloth to advance even further, I still think the mystery will eventually be solved. Until then, perhaps an open mind?? There are still problems to sort out. Are we sure that the blood on the Shroud and the Sudarium of Oviedo is AB? If so, most blood experts, so far as I can discover but this is not my field, believe that we have virtually no examples of AB before 900 and it really only becomes common with the mingling of Caucasian and Mongoloid groups after AD 1000..","date":"2012-09-16","mins":"10:43 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16353","author":"charles_freeman","post":"Carlos. I am not sure whether I have understood all you have written. I have no time for Peter D’Adamo and his diets so let us ignore him! We are talking about the specific AB blood group (not ABO). I do not know how secure the classification of the blood on the Shroud is but I am assured that there is general agreement that it is of the relatively rare AB group. Here is one account from a researcher of a particular family grouping. ‘The blood group AB represents less than 5% of the world’s population. Resulting from unions of European populations of group A and of Mongol population of group B, this group is very “young”, since it has been in existence for only 10 to 15 centuries. The first traces of group AB go back to just about the year 900. Research undertaken in Hungary, from a necropolis dating from the I Vth and VI Ith century to this date, did not placed any individuals belonging to the AB blood group.’ Other sources suggest that the mixing of bloods took place when the Hungarians occupied the Carpathian Basin c. AD 900 and that is why you have no record of any evidence of AB blood groups before 900. (Mongoloids (B) also mixed with Indian and far eastern populations (As) which is why you have AB groupings there.) The genetic mutation would have occurred in very few people at first and would only have spread as interaction increased which is why I have read other accounts that we should look at 1000 1100 for the appearance of a larger proportion of the AB blood type in Europe. I have no expertise in this field and I am open to any evidence that AB blood groups existed before 900. I have simply never seen any evidence that they did so I shall stick with the AD 900 date until I am informed otherwise!.","date":"2012-09-16","mins":"2:54 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-205898","author":"charles_freeman","post":"The same country , the US, can get a craft to Pluto and also be the home of a mass of creationists. In the Middle Ages they could build a Gothic cathedral and still turn up to Orleans to be given a cup of wine left over from the marriage feast of Cana..","date":"2015-07-15","mins":"3:11 pm","url":"https://shroudstory.com/2015/07/15/swipe-of-the-day/","cat":"art","title":"Swipe of the Day"},{"id":"comment-77440","author":"charles_freeman","post":"P.S. If we are putting forward the hypothesis that the iconography of Christ is taken from the Shroud, then as Paul Zanker has argued in his The Mask of Socrates (you can actually track down the text with illustrations online), the earliest representations of Christ with a beard are not in the east but in Rome. So if the short left leg is important and we see it also first in Rome c.750, I think I am building up a credible thesis that the Shroud came into the west quite early on. I still think that likelihood of the Shroud being authentic is small but here at least is a thesis that does not contradict its authenticity. It’s a long haul weaning people off Wilson’s hypothesis but I think it is important to stress that there are alternative and more plausible ways of showing how the Shroud if it were authentic could have ended up in Lirey. I think it is a pity that there are so many people with a genuine commitment to the authenticity of the Shroud who are not prepared to do any further research on it or, after all these years, spot the serious inadequacies of the Wilson thesis. I still have no idea what he means by ‘double in four’ when he shows a cloth doubled into eight, but he was using this meaningless phrase as early as 1974 and he is still using it. Has no one ever challenged him to explain what he means? Perhaps they will in Melbourne. If you pass by Wilson completely it does not necessarily mean that the the Shroud is not genuine!.","date":"2014-02-08","mins":"5:54 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame"},{"id":"comment-77038","author":"charles_freeman","post":"Certainly the tendency was to suggest Jesus was perfect as a human being and I don’t know of any depiction or legend that talks of him being deformed. You can’t really say that the crucifixion scene I quoted from Rome shows him deformed. Later, of course, from the thirteenth /fourteenth century, there is a stress on his wounds/blood but these always appear to have been inflicted on a body that was otherwise healthy..","date":"2014-02-06","mins":"12:13 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame"},{"id":"comment-77032","author":"charles_freeman","post":"“Doubled then doubled twice again (thus making 4 X 2 folds)” Well, I make that three times 2 folds. Wilson only shows three double folds: the first doubling makes 2 sections, the second doubling four sections, the third doubling eight sections and this is what Wilson shows. Perhaps Stephen Jones can explain what he thinks I know but don’t know. Perhaps he can go step by step through the doublings as he sees them. The word Tetradiplon is unknown anywhere else ( except that it is exactly how the famous Panathenaic cloth was folded). The prefix ‘tetra’ on the other hand, is very common – at least 150 examples in a standard Greek dictionary such as Liddel and Scott. We can see that the most likely meaning when compared to other examples of the use of ‘tetra’ is four doublings but it could possibly mean doubled so as to make four (not eight) sections. If Stephen can start by taking us through his doublings one by one, then that would be a start..","date":"2014-02-06","mins":"12:03 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame"},{"id":"comment-77011","author":"charles_freeman","post":"‘folded eight times in the form of the Mandylion portrait’. This certainly needs clarification. Does he mean eight fold? in other words the THREE double foldings that are need to achieve eight sections as Wilson illustrates them but without any explanation from Wilson as to how tetradiplon can mean three rather than four doublings? We really do need to clear up the confusing picture Wilson leaves on this, As is well known I think ‘tetradiplon ‘ used only of the cloth BEFORE it was unfolded in front of Jesus has a completely different significance ( it ties in with the tetradiplon folding used in ceremonies such as the Panathenaia festival and is this a means of giving the cloth Jesus used status before he used it). Again Wilson is confusing in suggesting that the cloth was folded ‘tetradiplon’ AFTER it had the face of Christ on it. I have no particular background on the slanted crucifixion foot piece. It will mean working through Schiller’s massive book on Christian iconography to see if it is standard iconography. A quick look the earliest I see in Schiller is a ROMAN example, a wall painting that is dated to 750 that does have a shorter left leg (illus 328). The famous Byzantine example from Mount Sinai of roughly the same date shows equal lengths of legs and a level board. All the Byzantine ones Schiller illustrates have a stable board so that seems to be the norm in the east but I am not an expert on this. Incidentally, if this is relevant and the Rome crucifixion depiction IS taken from the Shroud this would add to the possibility that the Shroud might have come to the west early. After all the Roman crucifixion scene is roughly the same date that the relic collection with relics from the Lord’s Tomb arrived in northern France! Wilson builds theories on less evidence than this!.","date":"2014-02-06","mins":"9:50 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame"},{"id":"comment-77033","author":"charles_freeman","post":"Yes, this seems to fit with the images that Schiller shows..","date":"2014-02-06","mins":"12:05 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame"},{"id":"comment-77034","author":"charles_freeman","post":"‘And the question is WHY? Remeber, there were strict rules in painting icons, and no room for experiments.’ That is simply not true.. I lectured on Byzantine icons for an hour on a study day the week before last and one of my key points was the way that standard themes, the Virgin and Child, the Annunciation, etc, were shown differently by different icon painters.","date":"2014-02-06","mins":"12:07 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame"},{"id":"comment-77198","author":"charles_freeman","post":"Anyone want to have a go at explaining how Wilson’s illustrated three doublings equates with tetradiplon.e.g FOUR doublings? If no one can provide a solution, I will assume that Wilson is being misleading here but I am open to hearing the other side of the story. We simply need someone to provide a sequence of the doublings. As I see it four doublings ends up with a cloth divided into sixteen sections and this would cut across the face of the Mandylion. As there is no evidence in the account (only in Wilson’s version of it in The Shroud, 2010, p.190 1) that the cloth was folded tetradiplon AFTER Christ wiped his face with it, I see no reason to follow Wilson and others on this anyway but I am happy for his case to be presented by those who support it. Wilson’s interpretation of the Acts of Thaddeus is as follows ” Although its initially off putting aspect is that it ‘explains’ the creation of the Image as by Jesus washing himself [off putting indeed, for some, fairly conclusive perhaps for others], it intriguingly GOES ON [thus Wilson gives the impression that this is AFTER Christ has washed his face]to describe the cloth on which the Image was imprinted as tetradiplon ‘doubled in four'” ‘Doubled in four’ seems an odd translation as the more normal translation if one compares this to other uses of ‘tetra’ in Greek would be ‘doubled four times’, but possibly ‘doubled so as to make four sections’. ‘Doubled in four’ makes no sense to me at all especially as Wilson’s illustration labelled ” ‘Tetradiplon’ or doubled in four’ shows a cloth doubled only three times..","date":"2014-02-07","mins":"5:08 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame"},{"id":"comment-77287","author":"charles_freeman","post":"Christopher Kelley ‘ Now if you fold a paper in half [FIRST FOLD], you have two halves. If you fold it again[SECOND FOLD], you have four; but if you fold the whole thing once more [THIRD FOLD], you have eight.’ Yes, but aren’t’ we meant to have FOUR (‘tetra’) foldings as on the Panathenaic cloth illustrated on the Parthenon frieze (in the British Museum) where the four doublings can actually be picked out?.","date":"2014-02-07","mins":"12:23 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame"},{"id":"comment-77428","author":"charles_freeman","post":"I am sorry, Christopher, I don’t buy it. If Wilson makes this case he needs a Byzantine scholar to back him. Until then I shall continue to argue that, so far as I am concerned , he is highly misleading.The lines are still open for anyone who can provide support for Wilson. We know that in the Greek world the most prestigious cloth of all, the cloth that was taken up to the Acropolis in the Panathenaic festival that was attended by Greeks from all over and went on until the fourth century AD was folded double four times. If you are in the British Museum you can go and see it on the sculptures and it is so beautifully sculpted that one can count the double folds, four of them. My guess, and it is only a guess, is that this form of folding linked to this prestigious festival meant that a tetradiplon cloth had a special significance and this is why the Acts of Thaddeus say that the cloth as PRESENTED to Jesus (but contra to what Wilson suggests was never said to have been refolded as such, any more than the Panathenaic cloth would have been refolded after it had fulfilled its ritual function) as tetradiplon. It is a much more likely explanation than anything Wilson can offer. ‘Anonymous’ has, of course, made the other point that Wilson conceals from us , that there is a totally separate mention of Christ’s burial cloths in the very same text so whoever wrote the Acts knew that there was the Image of Edessa and the burial cloth as separate items. Of course, nothing in this says anything either way about the authenticity of the Shroud as we have it today so that is not the issue there. I stick to my thesis that ,IF the Shroud were authentic, the most likely route to Lirey would have been with the relics known to have come direct to northern France, including some from the ‘Lord’s Tomb’, in the second half of first millennium..","date":"2014-02-08","mins":"4:22 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame"},{"id":"comment-189682","author":"charles_freeman","post":"Does Max realise that by posting lots of small and sometime incomprehensible postings , he clogs up the comments list above, so that no one knows what else has been posted under other headings. Why can’t he sort out everything he wants to say on a separate sheet, correct all his typos and then copy it over as a single posting..","date":"2015-02-06","mins":"8:16 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-189960","author":"charles_freeman","post":"I stick to my original suggestion of some time ago that Max is having everyone on..","date":"2015-02-07","mins":"4:26 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-191584","author":"charles_freeman","post":"Subject to support by an expert in textile conservation,I can only repeat what I said earlier. We know beyond any doubt from medieval manuals and the few surviving medieval,painted linens that painting took place only on the outer surface of a cloth sealed with gesso. We also know that with folding and unfolding the pigments could disintegrate. A place called Barley Hall has apparently done some experiments with this but they never replied to my e mail. The question then becomes: ‘if the pigments have been in place for five hundred years and then disintegrate what is left underneath?, Presumably the cloth has been affected depending on the density of the pigments so that one is left with shadowy images that will vary in consistency with the density and perhaps types of pigment of the original paint. My suspicion is that they will vary so light painted areas will appear darker and heavily painted areas lighter so,perhaps,providing us with the apparent negatives. But in addition to this we have the artist creating a mirror image. So now one needs to find a textile expert who may know of similar examples. The best case of the pigments disintegrating that I know of is the Zittau Veil the pigments came off when steamed but I don’t know whether the remaining shadows where the pigments were are negatives or not. This is a plausible hypothesis and so needs to be tested out, just as the Oxford lab tested out John Jackson’ s hypothesis about carbon monoxide affecting the radiocarbon date and finding that it did not. So to go back to the original questions: my hypothesis is that the artist WAS trying to create a mirror image but that the apparent negative image is what is left when the pigments came off after five hundred years of covering the weaver: so nothing to do with the artist himself..","date":"2015-02-22","mins":"3:49 pm","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-191620","author":"charles_freeman","post":"Has Isabel Piczak training and experience in dealing with the analysis and conservation of ancient/ medieval painted linens? That’s the person I am looking for. Without someone with hands on experience of such linens and what happens to their pigments over time I don’t see how we can get very far..","date":"2015-02-23","mins":"1:54 am","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-185993","author":"charles_freeman","post":"We have to rule out that the copies have not faded. If linen paintings were not so vulnerable we would today have hundred of thousands of them of all shapes and sizes and with every kind of image today. That is what the inventories both of domestic houses ( the York study) and churches and monasteries have so many of them, all, with a very few exceptions now disappeared. I still think that the images on the engravings, lithographs, etchings ,etc would not have shared similar features if these had not been visible to the different artists who had to provide copies. The blood was important – apparently the members of the Savoy family used to kiss the wounds before the Shroud went on display. We are lucky to have the Shroud – the Savoys could hardly throw it away if, in my view, it began to deteriorate in the nineteenth century. In England it would, of course, have been burned at the Reformation along with the lucrative Blood of Hailes and other relics purporting to originate in the life of Christ..","date":"2015-01-24","mins":"12:55 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-191621","author":"charles_freeman","post":"The original painting, in my view, has all over scourge marks because these were an iconographic innovation of the fourteenth century noted by Professor James Marrow of Princeton University ( though not with reference to the Shroud but to other examples – he notes that they were inspired by Isaiah 1:6). Originally there was no loin cloth as can be seen from the Lirey Pilgrim Badge, the Lier copy and the illustration of the Shroud in the 1559 prayer book of Marguerite de Valois now in the Royal library of Turin. The loin cloth was added probably at the demand of Bishop Francesco Lamberti of Nice and Carlo Borromeo both of whom were involved in the Council of Trent decree of 1563 which banned lascivious ness in religious art and involved the covering up of nudes, such as Michelangelo’s Last Judgement in the Sistine chapel. This would explain why there are scourge marks under the later added loin cloth ..","date":"2015-02-23","mins":"2:34 am","url":"https://shroudstory.com/2015/02/22/very-disturbing/","cat":"art","title":"Very Disturbing"},{"id":"comment-186003","author":"charles_freeman","post":"P.S. Yes, Hugh is right. My argument for the Shroud having been created for a Quem Queritis ceremony does not depend on the images being faint or not. It would have been a much smaller congregation and so long as some sort of effort was made to show the imprints ( and in many cases the clothes probably have had images at all or perhaps just a pattern of bloodstains) then the ritual needs would have be satisfied. Yet, when we read of church inventories that have a hundred or more painted linens, many simply to hang up in the church, then there would be no need to create some kind of exotic technique specially to create the images on the Shroud. The expertise would have there but so is the evidence that these paintings were very vulnerable to decay and disintegration leaving we know not what traces of their presence. Yet I still think the evidence is a) that they were more vivid than they are now b) that there were features on the Shroud now lost but even if the surface of the Shroud was , in some inexplicable way, unchanged over the centuries, it could still be used in a traditional Quem Queritis ceremony without anyone complaining..","date":"2015-01-24","mins":"1:49 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-186357","author":"charles_freeman","post":"We are at the beginning of serious research and we have lots to work on even if there is no access to the Shroud itself..","date":"2015-01-26","mins":"6:32 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-184919","author":"charles_freeman","post":"The Villers book is available second hand on Abebooks at a very reasonable cost so perhaps you can get your own copy and learn a great deal about painted fabrics from the article and the others. It would make the debate a lot more relevant and sophisticated. Yes, there is a photo in the article,of the Veil as it was before the war and then afterwards so that you can see the contrast between the central area where the pigments have come off and the surrounding panels where the paint is still largely intact. Then there is a photograph of one of the panels where the pigments have come off it is of the Visitation and you cannot help noticing how similar the shadowy images of Mary and Elizabeth are to the shadowy images of the Shroud. It is without doubt an avenue for further research. This is one of the many areas where research on the Shroud is in its infancy. You will no doubt remember the quite extraordinary statement in the STURP paper on the Physics and Chemistry of the Shriud that they had not examined any paintings on linen! Never too late to start..","date":"2015-01-20","mins":"4:23 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-186817","author":"charles_freeman","post":"I am so glad we are moving the rich collection of depictions, accurate or otherwise, of the Shroud into the debate. Progress in a new direction at last..","date":"2015-01-28","mins":"2:16 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-186952","author":"charles_freeman","post":"I have looked up the full text (in English) of the Antonio De Beatis the original is in fact in Italian not Latin as I imagined it would be from the chaplain of a cardinal. The full text in translation is published by the Hakluyt Society, 1979 (there had apparently been an ‘unreliable’ French translation in 1913 but the 1979 translation is the first in English). There is a full account of the visit together with a legend that it had been brought back by a Savoy from the First Crusade. I was interested to read on past the description to find ( p.141), ‘They say that the dimensions of these divine imprints are found to be different every time they are taken, and that they are as clearly visible from a distance as from close range.’ It was exhibited to pilgrims on Good Friday and for three days in May from the (Chambery) castle wall and pilgrims would gather to see it in a meadow outside the town walls. De Beatis goes on to tell us that the Savoys used to take it round with them but plague broke out in Chambery when they did so and now that it was securely kept at Chambery and the outbreaks of plague had ceased. I never imagined for a moment that the images as they originally were could not be seen from a distance and this seems supporting evidence..","date":"2015-01-28","mins":"10:20 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185086","author":"charles_freeman","post":"‘Restricted to the same images as the rest of us’. So have you access to the catalogue of the Savoy collection and Beldon Scott, plus the others I have? I have about fifty images of the Shroud mostly by artists of the seventeenth century and then up to 1750. So are these the same images you are using? As I have made clear I am trying to recreate the images on the Shroud as they originally were, a fairly standard approach to such matters! By opening up a database to everyone , I lay myself open to being shown to be wrong. I am quite happy to take the risk. To rule out even trying to get a database together shows a really closed mind!.","date":"2015-01-21","mins":"8:07 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185138","author":"charles_freeman","post":"Yes, a limited part of the total evidence that needs to be accumulated if Shroud studies are to move on. The controversies over what the Shroud photos do or do not show and how far some have been manipulated show that this is a confused area..","date":"2015-01-21","mins":"11:52 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185148","author":"charles_freeman","post":"Young’s research shows that there was considerable variety in the linens ( always linen to conform with the gospel accounts) that were presented to the congregations and one can assume that there was no one standard image although shared knowledge e.g. To put the wound on the left side must have been passed around. Some may have been just the sudarium and some may just have had bloodstains. There clearly was not a standard Quem Queritis image. The Mozarabic rites that go back to the seventh century in Spain talk of Peter and John going to the tomb and seeing ‘the recent imprints of the dead and risen man on the linens’. Yes, these were intended to be imprints – everyone would have known that a body with sweat and blood on it laid on a cloth would leave some sort of imprint, if only bloodstains, and it would be a negative of the body itself and the artist depicting it might well have decided not to use as many colours as the top class artists of the day ( judging from the few top class painted linens that have survived). After all everyone seeing the cloth would have known that it was not the real thing but a symbolic representation ‘our’ parish or monastery shroud brought out once a year at Easter .( ‘Representation’ is the word often used of the Shroud image although there is a linguistic barrier here). However, as this was a revered cloth, carried in procession, laid on the altar, etc , it would have achieved some form of spiritual significance and have been treated with reverence, probably locked up between Easters. In some cases miracles would have been reported and then the cloth would have been given even more status and one might even get a pope allowing pilgrims an indulgence. ( As is the case in similar objects we have a banner made in 1464 in Perugia, carried in penitents’ processions that became associated with the cessation of plague and so, like the Shroud, got an indulgence even though everyone knew it was recently made.) This is the way these things tended to work even if we don’t know exactly what gave the Shroud sufficient status to earn that indulgence. There is lots of material on how particular objects were transformed into apparently genuine relics although nothing survives of this for the Shroud except the prominence, I think, of Jeanne de Vergy in the attempt. My favourite is the opportune discovery of the body of Mary Magdalene at St. Maximin in Provence in 1279 when there was already a Mary Magdalene body at Vezelay. Here Charles of Salerno won out by saying he had a vision of where to dig and the body would be recognised by the amphora of Christ’s blood that Mary had gathered at the cross and a green shoot growing from her tongue. And this indeed was what was dug up. The poor monks of Vezelay had nothing to challenge this and their shrine soon lost out to St.Maximin where pilgrims still come to this day..","date":"2015-01-21","mins":"12:31 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185211","author":"charles_freeman","post":"Are you sure that the illustrated copy, above, is of the Shroud which was in Chambery at that point. The wound is on the wrong side and the bloodstains of the Shroud are not reproduced, but perhaps you have documentation to say that it is. One area to research is whether there was in fact a Spanish template for Quem Queritis cloths with a double figure on it and it may even be that the Shroud is a copy of that template there seems to have been a double image in the cloths mentioned in the Mozarabic rites that go way back before the fourteenth century. So much still to research!.","date":"2015-01-21","mins":"5:59 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185039","author":"charles_freeman","post":"Thomas, as you know I rely heavily on the depictions and descriptions of the Shroud that put together give a very strong case for the more prominent nature of the images as they were originally. It is surely wrong to neglect these particularly when observers note the Crown of Thorns in place and one can also see it in numerous depictions. Let us take one small point. If you look at the Lier copy and every depiction of the Shroud in the seventeenth century that I know of then you can see that the hair on the dorsal image reaches around the back of Christ’s head. Yet you cannot see that today and Ian Wilson always shows a pony tail. So this is convincing evidence that the Shroud image today is not as it once was. ( the pint is made by comparing the way the hair is shown to confirm that different artists were seeing the same thing.) In this it would be typical of almost every ancient artefact we know unless it has been kept in very special conditions or made of something more solid than linen and pigments. So it makes sense to take as the secondary aim of all Shroud research – what did the Shroud look like when it was ORIGINALLY made. This is the focus of my own research. The primary aim is,of course, to establish what kind of loom the Shroud was woven on as the weave comes before the images and if you can date the weave then you have a basis to work from for the creation of the images. I have not yet found a weaver specialising in ancient textiles who thinks it is anything other than a typical weave of a medieval treadle loom so it is over to the authenticists to challenge this. It is the width, a standard medieval treadle loom width, and the length that gives it away. I have no problems with Hugh, in his recent editorial, and in the review of my article ,in saying my article is not definitive. We do need a database of all the copies and the depictions of the Shroud before we can fulfil the second aim of defining what the Shroud once looked like. This seems so basic! I have searched high and low for other liturgies that involve the display of a painted linen cloth with images of the buried Christ on it. The Quem Queritis ceremony certainly did but there may be others. And everyone ducks the sudden appearance in the fourteenth century of the all over flagellation marks that are seen in sculpture and painting. I have provided, courtesy of Professor Marrow, an explanation of this based on scriptural inspirations. You need to provide evidence that ancient scourging did in fact cover the whole body front and back. To take up a point Hugh (?) made in his review of my article, once the pigments started to flake off or disintegrate ( as they do appear to be in the 1868 exposition when the Shroud had to be shown in a frame for the first time,) then they would gradually all come off perhaps in one of the thirty year storage periods of the nineteenth century. Normally the linen would then be thrown away but the Savoys could hardly throw away the Shroud. And I suppose they could hardly repaint it although we do know that some painted linens were touched up when they began to fade. So, as I said in an earlier posting, we are at the stage of research on the Shroud, with many false avenues taken so far, that the Egyptian pyramids were in the 1880s. The first task is to assemble the evidence of the Shroud in the past in a way that is open to scholars to examine and compare..","date":"2015-01-21","mins":"4:16 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185212","author":"charles_freeman","post":"P.s. Still no answer to my query as to why there is long hair and the Crown of Thorns on all the representations of the Shroud in these early centuries but they are not there today. The obvious answer is that they were indeed there but have decayed but perhaps you have a better explanation..","date":"2015-01-21","mins":"6:01 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185628","author":"charles_freeman","post":"Well, it was there by 1517 when Antonio de Beatis specifically mentions it in his description of the Shroud, ‘ images impressed and shaded in the most precious blood of Christ and show most distinctly the marks of the scourging, of the crown on the head, of the wounds to the hands and feet and especially the wound to the side … All in a manner that would strike terror and reverence into the Turks, let alone Christians.’ I am sure the Turks would have been mightily impressed by those faded images! David Mo is right we need a lot more research on these so called copies. Once again it is always assumed in Shroud research that an image on a cloth is miraculously preserved as it was when it was first created but images on linen will fade if they are exposed to a lot of light how can we be sure of this in any one case without further examination? There does seem to be a faint line across the forehead of the Lier copy which may be the remains of the Crown. The Crown is ,of course, shown in numerous other depictions of the Shroud and in some of the copies. ?All invented. Do you think the Getty Foundation might fund that database?.","date":"2015-01-23","mins":"3:30 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-186317","author":"charles_freeman","post":"I don’t have the original Latin to hand , someone must have, but when you see the crown depicted on so many ot Her engravings it does fit and the attempt here to explain it away does not make much sense when there is visual evidence that correlates with the description of a Crown. So is the argument that there was not and never was a Crown of Thorns on the Man on the Shroud, shown front and back on both images? Even most of the (perhaps faded , that needs some thinking about) show it..","date":"2015-01-26","mins":"2:37 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-186319","author":"charles_freeman","post":"The full quote ( but, of course, only in English translation of the Latin original ) is’ shows most distinctly ( N.B.) the marks of the scourging, of the cords about the hands, of the crown on the head. .’ I think it is pushing it a bit far from this to say that the Crown was NOT there especially when there are so many depictions of it. Each copy, engraving, woodcut, lithograph, etc is unique in so far as it was made by a different ( and in most cases of the engravings, etc we have a named artist) artist and a date as most of these depictions, unlike the copies, were of particular exposition. We cannot divide the copies as somehow being better evidence than the depictions. Some of each will have vital information. The only way forward is to put them all together on a database and get specialists working on them. But images on cloth do fade far faster that engravings..","date":"2015-01-26","mins":"2:56 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185056","author":"charles_freeman","post":"The depictions. The fullest set is from the catalogue of the Savoy collection, 1998 although some of these were apparently destroyed. I have checked through my 35 photocopies ( hard to find the catalogue but the Cambridge University Library has a copy) and every single one shows the long hair and the Crown of Thorns in place. Then there are the examples on display in Turin in the Shroud Museum i assume they will have more in storage. Then Beldon Scott has made his own collection – many illustrated in his book on the Shroud. But there must be many more I tracked down one from 1608 in the British Museum and the Royal Library in Turin sent the HT picture researcher one we had not asked for that I had never seen before so I assume they will have others in the Library. Gathering these depictions together would not be difficult for a Master’s /Ph D thesis, the problem would be arranging and paying for the copyrights so that the whole lot, plus the copies, could be put on the web and made open to anyone interested as in Mario’s Shroudscope. Then we really would be able to get a move on!.","date":"2015-01-21","mins":"5:33 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-184281","author":"charles_freeman","post":"Article on Zittau Veil (in Villers) a painted linen veil from 1472. ‘In total, the cloth must have been suspended in the church, taken down and packed more than 200 times, before being stored for nearly 160 years, After its rediscovery (1840)it was rotated on wooden cylinders and then stored for another fifty years. . . .A photograph from the beginning of the twentieth century shows that the veil must have been in good condition until the Second World War , ..; from our point of view the cloth was in a nearly intact state.’ (Then the paintings on the central panels disintegrated when it was used to cover a stream bath leaving only shadowy images like those on the Shroud.) Of course, the pigments on the Shroud appear to have long since gone, suggesting that the rolling unfolding,etc, did eventually lead to them disintegrating. Yes, we do have records of painted linens disintegrating after being folded but here is a good example of one that did not disintegrate despite being folded and unfolded over centuries. The trick ,so far as I can see from other examples, is to make sure that the sealing layer, however it is done, is very thin and does not penetrate the surface of the cloth ( ring any bells, anyone?) Pam’s other point about the identity of the artist. No, these were seldom recorded we are lucky when they are in this period not until the sixteenth century that artists, with a few exceptions such as Giotto, had status greater than ordinary craftsmen. And if you read the articles in Villers ( and why not Pam if you want to comment on paintings on medieval linens) you will find examples of enormous sophistication which make the artist of the Shroud look like an amateur. Just look at the linen processional banner of the Intercession of Christ and the Virgin ,attr, to Lorenzo Monaco, c.1400, explored in the article by Charlotte Hale, p.31 onwards. From what STURP found the calcium was consistent across the whole surface. This fits,of course, with a medieval sealing, but means that the Shroud must have been laid out flat without anything on it to let calcium settle naturally from another source across the surface..","date":"2015-01-18","mins":"9:57 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185899","author":"charles_freeman","post":"I am not sure why I should reconsider ‘this’ – ‘ presumably my HT – article on the basis of the Noalejo shrouds. We have to rule out for a start that they themselves have not faded over time. Then you have to place them against the mass of descriptions, one of which I have provided, others in my article, that show what an impact seeing the a shroud had on observers with its prominent bloodstains, plus the many depictions we have of it which show features such as the Crown of Thorns and long hair at the back that have clearly disappeared. Do you really think that enormous crowds of pilgrims would have come across Europe for a single day of exposition when many of them must have been several hundred yards away if they could not see the images? It really. Is a non starter to use ancient copies of the Shroud, which may have faded themselves, and ignore the far greater mass of evidence that suggests otherwise to argue that the Shroud images were originally faint. The basic problem is the assumption that the Shroud today is exactly as the Shroud has always been, seven hundred, or two thousand years ago. If it was it would truly be miraculous, transcending the normal laws of nature and decay even after it has been subject to hundreds of foldings, unfolding, having rosaries thrown at it ( the pilgrims waiting for their return can be seen in the Tempesta engraving) and stored we know not in what conditions between expositions. A miracle indeed!.","date":"2015-01-24","mins":"2:32 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-186119","author":"charles_freeman","post":"I am sure that I shall have to reconsider some parts of my argument when we have specialist input that we have not yet had. However, I shall stick to two central points: 1) We are still at the beginning of serious Shroud research in many areas as so much previous research has been badly focussed and so many areas have still not had specialist academic input. 2) The Shroud now is not as it once was and we should be focussing on discovering how it looked originally. This would bring Shroud research into line with research on other ancient artefacts. I have never come across another artefact, especially one of vulnerable material, which is assumed to be totally unchanged over centuries..","date":"2015-01-25","mins":"5:13 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185913","author":"charles_freeman","post":"I assume that all those who are contributing to this learned debate on how the images on the Shroud looked originally will have their Beldon Scotts to hand. If you can’t get hold of the catalogue of the Savoy collection, it is the fullest panorama of the evidence we need to discuss the issue and second hand copies are available on Abebooks. The great architect of eighteenth century Turin, Filippo Juvarra,contributed an engraving of the ostension of 1737 ( now in the Royal Library in Turin). It is on page 257 of Beldon Scott. The crowd is massed in good order in the Piazza Castello ( they had tightened up the procedure since the chaos shown in Tempesta’s engraving of 1613) and I suspect that it is the architectural setting that most interested Juvarra there is a wonderful Barogue viewing pavilion but he presents the whole facade of the platforms. So the Shroud is at quite a distance but you can still see the images on it. Would Juvarra, and so many other artists, really have shown the images if they could not be seen and why would the Savoys arrange this ordered viewing by an enormous audience if hardly any of them would have been able to see the images. It does not make sense to me. Of course, Juvarra’s is only one of many depictions showing the images more clearly than they are now and with features that have not vanished with time. As I always say to anyone who asks me how to recreate the images on the Shroud today: ‘Have you got five hundred years to spare?’ It needs time and constant handling/ exposure to the elements to create faded images on cloth or to allow the pigments to disintegrate leaving only shadows where the paint once was..","date":"2015-01-24","mins":"3:48 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-186324","author":"charles_freeman","post":"I think there would have been some documentation of this. We know that Tempesta, who was known for the accuracy of his engravings,see his Rome of 1593, a copy of which is still in Turin, was in Turin at the request of the duke, to see several expositions and although we only have documentation of 48 expositions between 1600 and 1700, it is suggested that they might have been every year. We also know,see Beldon Scott, that visiting ‘saints’ were allowed to see it and de Beatis, see challenged quotation above!, arrived with his cardinal and instructions were given for them to see it( in Chambery, of course). So I don’t think you needed a statue as well. I do increasingly wonder whether, in line with similar painted linens, that there was not some repainting done from time to time see the loincloth issue. There are two full scale copies of the Shroud that I know of in Turin. The first is in a side chapel of the Church of San Lorenzo just in front of the royal Palace. This is the one people are normally taken to see. There is another in the church next to the Shroud Museum in the west of town. I was told by the curator who unlocked the church for me to see it that it had been given to the church as it was there that the Shroud had been stored after the fire of 1997′.","date":"2015-01-26","mins":"3:36 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-186472","author":"charles_freeman","post":"I don’t want to cut in in front of Hugh but a simple point needs to be made. We are exceptionally lucky in having a very rich collection of representations of the Shroud as it once was. Some of these, invariably by unnamed artists, are copies on textiles which may or may not have faded with time. Some are on lead, the Liery Pilgrim Badge. Some are engravings,some etchings, some lithographs. Some are competent, some are amateur. Some show some features such as a Crown of Thorns, others, if only a minority,do not. Virtually all them how the hair on the back of the head as falling down across the whole nape of the neck, something that can no longer be seen today. In some cases we know that the artit or engraver was exceptionally competent. Antonio Tempesta, for instance, was famous for his engraving of Rome of 1593 which can be accessed through the Metropolitan Museum, New Yrok, website. So famous was he that the Savoys asked him to Turin and he produced a composite view of the exposition ( it is composite in that it includes the Shroud coming in its carriage to the site where it was displayed as well as the display itself .) it is hard to imagine that in this one instance he was faking what he saw. I have consistently argued that this enormously rich resource for the study of t He Shroud needs to be assembled on one database so that it is accessible to anyone, specialist in art history or not, to study. It is quite extraordinary that it has been completely neglected. There will be features once on the Shroud that can be seen on both copies on textiles and engravings but if we persist in putting copies against engravings we will get nowhere. Some of each are competent ,some of each are incompetent as with any other works of art. So please let’s move on and hope that someone will come forward to finance this work..","date":"2015-01-26","mins":"3:44 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185983","author":"charles_freeman","post":"It is not just that the images are more clearly defined it is that they consistently show features that are now lost.This suggests that the images are not now as they were then which is the crucial point from which I conduct my own research and encourage those who ask me to do likewise. It is the same method I used in my book on the Horses of St,Marks. Yes, we can learn a lot from looking at them today but we must take them back to their original context and condition if we are to understand their origins. In fact, I am only following the normal approach to ancient objects. I am not sure why Shroud researchers start the other way round in believing that what exists today is somehow more meaningful than what existed centuries before. Perhaps it is because none of them have ever systematically studied any other ancient object. I am glad we, or at least Hugh and I, can argue from Beldon Scott. Figure 163 shows the same ostension as the Bolckmann does but from close up while his is from a great distance It is difficult to argue,contra Beldon Scott, that the image on the Shroud is not there when it is very much there in detail in Boglietto’s etching of 1683 which is a good example as it clearly shows the Crown of Thorns, the long hair on the neck and the thumbs in a similar way to other depictions. Not all depictions are detailed enough to show the now vanished thumbs but so far as I can see most show them pointing out at an identical angle suggesting that is how they once were on the Shroud. Why would Bolckmann be the only person to show a depiction lacking the images (and it is not clear that they are not there) when everyone else seems to have reproduced them? Were all the other artists conned over a period starting from the very distinct images of the Lirey Pilgrim Badge onwards despite the change of owners. Whether etchings, engravings or lithographs, whether 1578, 1683 or 1842 they all show strong images. It is only in the ostension of 1868 (B.S. P.296) where we clearly see a deterioration in one image and the artist Perrin had no problem in showing part of the front image as faint and the rest similar to early depictions. So why did all the others have this problem and what would be the source of the Crown of Thorns and long hair in the back if they were not there? 1868 was also the first ostension where the Shroud had to be placed within a frame – a sign that they knew that it was deteriorating. Beldon Scott is good on how the influence of the French court ( Louis XIV) made the ostensions very much more ordered than they had been in the chaotic days of Tempesta..","date":"2015-01-24","mins":"12:08 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-133225","author":"charles_freeman","post":"As I have just said ,O.K there is nothing in the Codex to show that he did use the Cadouin Shroud it is simply that there were others on display in the west and he could have seen one. As I said, he is more likely never to have used a specific model at all but followed the gospels as he did with the Three Mary’s. Max has confirmed the point I made 150 posts ago that getting access t o the imperial chapel in Constantinople would only have been for the elite. The western shrines accepted all pilgrims, did the Church of the holy Sepulchre in Jerusalem even when it was back under Muslim control..","date":"2014-06-28","mins":"1:54 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"}]
