[{"id":"comment-248","author":"charles_freeman","post":"I loved the Hebrew letters blog. Do you have the right glasses to see these things, I certainly don’t but if you look long enough at the internet images I assume the Hebrew lettering will be clear so long as one doesn’t get any blobs in the wrong places ,then all you need to do is get your Beginners Guide to Hebrew, work out a phrase, find a biblical equivalent and once again scholarship moves forward. You need to go onto Robert Carsgill’s website. He has had a wonderful time outing James Tabor and his mates who have found a tomb with the earliest evidence of Christianity, The Jesus Discovery. A crude drawing of an amphora on a base was interpreted by them as a fish with the head of Jonah coming out of it. They were murky photographs and every time Carsgill challenged something of theirs, a new photo appeared with slightly different lines drawn on it. At the end, wait for it, they reinterpreted what had once been seen as a stick body of Jonah as the Hebrew letters J O N A H. You couldn’t make it up!.","date":"2012-05-01","mins":"4:34 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","title":"It’s clever, some might say pretty, but is it science?"},{"id":"comment-239","author":"charles_freeman","post":"Dear Colin, Good to find your website. I am an historian who has worked extensively on medieval relics ( Holy Bones, Holy Dust, How Relics Shaped the History of Medieval Europe, Yale, 2011 reviews on Yale’s US website). If you think the pro Shrouders’ science is crazy, you should see their history! The attempt to find a narrative for the Shroud from 30 AD to 1350 is just hilarious. They confuse images of the living Christ with the Turin Shroud, they end up in hopeless non sequiturs, at one point Thomas de Wesselow, the author of a new book The Sign, who claims a Ph D in art history, confuses three different images/ burial cloths, each documented separately, into one, our friend the Turin Shroud. I think the presumption must stand that the 1988 radio carbon 14 dating is broadly right until someone comes up with a coherent reason for overthrowing it. Of the hundreds of relics from Christ’s life, Passion ,Crucifixion and Burial – right up to the stone that was rolled away, let alone bodies ( two of them) of Mary Magdalene and most of the clothes of the Virgin Mary, that littered medieval Europe, none have yet been found to be genuine so the Shroud would be a real first! I have been doing some battles on Amazon.co.uk and Amazon.com with The Sign (you will find my review and I have commented on others), but I think I am becoming a bore on the subject and must get back to real history. So this is just to wish you well!.","date":"2012-05-01","mins":"10:13 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","title":"It’s clever, some might say pretty, but is it science?"},{"id":"comment-241","author":"charles_freeman","post":"Thanks, Colin. Ian Wilson’s Edessa Image theory is so way out that when I saw someone who had actually done some original research and seen through it, I felt it important to support them. (Although I don’t know what else Yannick believes he is spot on with this one.) There is no evidence that anyone took much notice of any of the competing burial shrouds during the Middle Age, yet the Shroud community assume that if even a cloth is mentioned it must be THE SHROUD. As you say, they have got everything the wrong way round. If someone notices that the Shroud ‘s face has similar features to Byzantine iconography, then it is worth investigating whether Byzantine images were the inspiration. In the Shroud community,it is assumed that all the icon painters were copying the image on the Shroud ( but opening the eyes and putting on some clothes on it)! I doubt whether one can really turn this round. Good luck, Charles..","date":"2012-05-01","mins":"1:51 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","title":"It’s clever, some might say pretty, but is it science?"},{"id":"comment-244","author":"charles_freeman","post":"P.S. It would have to be by someone passionate about the care and preservation of ancient textiles whether they are two thousand or seven hundred years old. Looking at it from such a perspective the treatment of the Shroud and material removed from it has been outrageous EXCEPT for the procedures for the 1988 testing which seem to have been within normal scientific parameters (filmed, textiles experts, a conservationist, representatives of the testing labs all observing the process) though I leave that for you to judge..","date":"2012-05-01","mins":"3:12 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","title":"It’s clever, some might say pretty, but is it science?"},{"id":"comment-243","author":"charles_freeman","post":"David Rolfe actually did a review of The Sign on Amazon.co.uk. It didn’t come across clearly what his position was but I replied to it, alongside a fascinating character called Trini who has it in for me. I wonder why. There are two books still to be written on the Shroud. One is to suggest that it may have originated in the East, even as early as the seventh eighth centuries, drawing on Byzantine iconography, possibly coming into Europe with the Crusaders, in the same way that many other relics are known to have come. I suspect others have researched this but there is a mass of documentation to explore. The cloth may originally have been woven in Arab workshops even, as the Veil of St.Anne ,the mother of he Virgin at Apt in the Vauclose is known to have been ( the Arabic lettering is still on it and it was four years old rather than 1100 as it needed to be when it was brought back). The second is to explore the fiascos surrounding ‘scientific’ research. If you trawl the websites it is amazing how many bits and pieces of the Shroud are flying around. How did Raymond Rogers get material for his 2005 paper? He is good enough to tell us himself in his ‘peer reviewed’ paper. ‘On 12 December 2003, I received samples of both warp and weft threads that Prof. Luigi Gonella had taken from the radiocarbon sample before it was distributed for dating. Gonella reported that he excised the threads from the center of the radiocarbon sample.’ Now this is fifteen years after the radio carbon 14 sample was taken and Gonella was present but apparently not authorised to take any sample himself, but clearly he was able to do so, or at least provide what Rogers assumed was original material. Then sadly Rogers died and attempts were made to get hold of his material by another STURP member. ‘When I first received the materials from the Rogers family, I noticed that one important sample was missing, Raes #1, the apparent end to end spliced thread that Rogers had identified. More than a year passed before I received the contents of Ray’s computer and it was only then that I discovered that Ray had given the sample to several of his LANL colleagues for scientific analysis just two weeks before he died. Fortunately, Ray had included their names, so I immediately contacted Bob Villarreal at the lab, introduced myself and asked him about the missing sample, which of course he still had in his possession. At that point (and much relieved that I had found the sample), I asked him if he would be willing to continue the work he had begun several years earlier with Ray. He enthusiastically agreed and over the past year I made some additional samples available to him and his team. This paper presents the results of their analyses of those samples.’ Then in an interesting interview online Shroud researcher Joseph Marino tells us that he has an actual relic from the Shroud, although he was disappointed to find that it was only from the backing cloth. Who is charge of distribution of fragments of the Shroud? It seems that you have to sign up as pro Shroud before you are allowed to have any. How does anyone keep a check on what is where and whether it is being contaminated or not? I assume that most of these come either from the Raes sample but how has that got into the public domain so that Rogers got hold of some? or the 32 pieces of sellotape taken in the frenzied five day examination of the Shroud in 1978 in a hall where fragments of pigment were apparently floating down from the ceiling frescos. The 32 pieces of sellotape was then passed on to one Walter Mccrone and we all know how that ended. There IS a book here!.","date":"2012-05-01","mins":"2:59 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","title":"It’s clever, some might say pretty, but is it science?"},{"id":"comment-246","author":"charles_freeman","post":"I am more than honoured to accept the upgrade! I used to be an International Baccalaureate examiner in critical thinking skills and I had to know how scientists, worked, or attempted to work, to find the truth. Alas a tempting offer but I am very tied up with my own projects a third edition of my Egypt, Greece and Rome and two book proposals I am working on already.Still we might have got somewhere. I only got into this because I was so infuriated by the nonsense that was being passed around and I suspect you are the same. The Da Vinci code world is not really my favourite habitat..","date":"2012-05-01","mins":"3:40 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","title":"It’s clever, some might say pretty, but is it science?"},{"id":"comment-249","author":"charles_freeman","post":"Sorry it is CARGILL..","date":"2012-05-01","mins":"4:37 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","title":"It’s clever, some might say pretty, but is it science?"},{"id":"comment-250","author":"charles_freeman","post":"Colin, I have to confess I have a very wicked side to me. But once you have read about Tabor do you think it is worth our friends getting in touch with him to see if he can find them an ossuary with the Turin Shroud on it, with in Hebrew ‘This is the Turin Shroud ‘on it? Wilson would have to rush out a new edition..","date":"2012-05-01","mins":"4:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","title":"It’s clever, some might say pretty, but is it science?"},{"id":"comment-214027","author":"charles_freeman","post":"The presence of real blood could be confirmed by replicating the tests in a forensic laboratory. Until this is done there will inevitably be doubt whether this is blood or lot, especially as the 1976 tests done in Modena did NOT find blood. Forensic experts have never heard of blood this red if it were the result of blood from a shocked man it would be well known from criminal cases. Please don’t assume that we are ignoring evidence for some reason , it is simply that the evidence is at present insufficient to say that this is blood. Bring out the samples for testing in an independent forensic laboratory if you are confident that this is blood. It might still, of course, be medieval blood added to cash in on the lucrative market in blood relics..","date":"2015-10-31","mins":"6:23 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214126","author":"charles_freeman","post":"It is not unreasonable to suggest a medieval origin for the blood as there were relics of the liquid blood of Christ as well as numerous dried ones in the fourteenth century and they were often very lucrative. This is my speciality area and I would refer you to the definitive book on the subject ‘ Wonderful Blood’ by Caroline Walker Bynum. I gathered all the Heller and Adler papers and a top professor of Physiology from London University read them for me. He found them totally unconvincing and felt that they had misinterpreted what were animal proteins. So they would have failed his peer review abysmally. I have never found any of my forensic contacts who have seen blood this red, in one case from thirty years of experience.You need to firm up your evidence that you can get old blood this red. Perhaps English blood is different! But best of all get a 2015 laboratory to do the tests again and then we would have a definitive answer. I am doing my own independent work on the Shroud and can only go on what I am told by independent experts. If I ever publish again( and I am happy for the moment with the responses I have had to the History Today article) then I can set out the expert opinions I have received on the blood..","date":"2015-11-03","mins":"2:30 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-213925","author":"charles_freeman","post":"Bob. Have you any other examples where the enormous discrepancies your process would cause have been recorded? Or are you assuming a one off Resurrection event?.","date":"2015-10-30","mins":"11:11 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214129","author":"charles_freeman","post":"Thomas. You are right. In the gospel of John, the only one to mention the side wound, it does not say which side it was on. By the sixth century, the Rabbella Gospels, the convention had grown up of placing it on the right side. The artists of the ceremonial cloths were recreating the marks of the body as transferred onto the linen and so they placed it on the left. We have another example on the Besancon Shroud and there were doubtless many more now lost.There needs to be a lot more research on the Spanish evidence as the Mozarbic rites talk of early cloths with double images the key evidence we need to pin down precursors of the Shroud images. It is all too easy to assume that these are copies of the Shroud but the originals may have been in Spain and the Turin Shroud an offshoot. With virtually every painted cloth lost, we may never know but it is worth following up. If Professor Michelle Brown is right the illustrations in the Holkham Bible (London, 1330) were used as a template for artists and these show Christ naked on the cross and with wounds on his head very similar to those on the Man of the Shroud even down to the same kind of squiggle. I am not saying that the Holkham Bible was the template for the Shroud but that this iconography, and even more so the all over front and back scourge marks was typical of the early fourteenth century. It is just some of the subsidiary evidence that fits with the original production of the Shroud as a painted linen. If you have Beldon Scott, and it amazes me that people who claim to be Shroud researchers don~’t have it at their fingertips, you will see the lithograph of 1868 that show the images partially disintegraqted..","date":"2015-11-03","mins":"4:12 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-200372","author":"charles_freeman","post":"The first time I heard about the too red blood was through Barrie Schwortz saying that for him it was the last big issue. He presumably had as much photographic evidence as well as that from personal observation to be sure of his facts. I thought it odd that he was persuaded by one test when presumably like the rest of us he could have asked any forensic expert what they thought or at least got a second opinion. If then bloodstains are two thousand years old ,as some appear to believe, then it is sad that they survived on the Shroud for two thousand years and were then lost by STURP within thirty..","date":"2015-05-27","mins":"4:57 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-213995","author":"charles_freeman","post":"Bob, thank you for your detailed reply. However we have other linens with images on them and so the Shroud is not unique in that respect. One of the best examples of images on a linen cloth similar to those on the Shroud is the Zittern veil In Saxony where the pigments of an originally painted surface were steamed off by looters in WWII leaving discoloured linen behind. You are assuming that the images on the Shroud were caused by a body but the so called blood evidence has never been replicated and is disputed by experts on the grounds that it is too red for dried blood. It could, of course, have been added in the medieval period when cults involving the blood of Christ became very lucrative so even if new tests do show human blood this does not mean that it is first century. Personally I cannot see how a cloth laid on a body could produce images such as those that we see..","date":"2015-10-31","mins":"10:44 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-200424","author":"charles_freeman","post":"Daveb as numerous specialists have pointed out to me, a full size cloth from the ancient world would be so much rarer a survival than one from the medieval world ( which is rare enough to be of interest in itself) and so the onus is on the authenticists to prove their case rather than the other way round. Have you read the fascinating paper on Palestine textiles by the organic materials specialist from the Bari Conference – one of the nine they published? It seems to have been overlooked here and even includes a reference to a much later example of the Flury Lemberg stitch. Christians did not give spiritual power to and collect relics before the fourth century, there were hundreds of thousands of medieval relics so a relic first recorded in the medieval period is more likely to be of that period. It only needs one expert associated with linen conservation to give specialist support to the idea that this is a linen discoloured by having had gesso and paint on it for several centuries before these disintegrated. Then we would have a solid working hypothesis. I am working on it but would prefer to publish in a recognised specialist textile journal with a specialist co writer to give me wider credibility. Meanwhile the balance of probability is overwhelmingly against the survival of such a large cloth over two thousand years unless it had been in a tomb in Egypt. If it had been first century, we would have had some excited textile specialists crawling over a unique three in one herringbone weave , not otherwise known until third century silk damasks, of this size. This is why I like the Bari paper which sets things into perspective..","date":"2015-05-28","mins":"8:43 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200399","author":"charles_freeman","post":"I was approached on Tuesday by a TV producer who wanted to know about the history of the Shroud. Naturally I told them to get Beldon Scott and master that before going any further. If it was history that they were after I would be happy to help further. What would one say ,if asked, which I was not, was the status of the STURP tapes which as you will all know were a representative cross section from different parts of the Shroud image and non image areas. From the above we can learn that the total sample may have been broken up with some parts going back to Turin but that after MC Crone, Rogers, Adler, etc, had worked on them they were useless and so presumably were not available for replication of the original tests..","date":"2015-05-28","mins":"1:18 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200648","author":"charles_freeman","post":"David I am sure we all hope the the Pope might authorise a new examination of the Shroud which would,in the spirit of the 1973 6 examination ( the findings of which tend to get overlooked) actually include people who deal with the weaving and conservation of ancient textiles. STURP ‘s greatest failing was to assume, without any examination of the matter, that the images on the Shroud now are as they have always been, seven hundred or two thousand years ago( for obvious reasons the further back you date the Shroud the more likely it is that the images were originally different from what they are now). Yet there is much that can be done without revisiting the Shroud itself. The Shroud is exceptionally well documented and there are many early depictions of it by a variety of engravers, painters, etc. We can assemble a database of all these for specialists to pore over at their leisure. With work on painted linens continuing apace, there is also a lot to be done on bringing together all the new research and examples to see how they might illuminate features of the Shroud. It was through this kind of research that the dating of the Horses of St. Mark’s was finally authoritatively settled. No one could dismiss the evidence of similar dated gilding on copper. Yet, a new close up examination of the Shroud itself would be best of all. Over to you, pope Francis..","date":"2015-05-31","mins":"4:14 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200361","author":"charles_freeman","post":"My experts will be acknowledged in any academic articles I write, but so far there has been a consistent assessment that this is not dried blood. There is no reason to believe that it is blood until the tests on Shroud samples are replicated in a forensic laboratory. …..but I don’t have access to the STURP tapes..","date":"2015-05-27","mins":"2:50 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-19051","author":"charles_freeman","post":"The possibility is there but in the present state of knowledge the presumption is that an AB blood sample dates from after AD 900, That presumption may,of course, be overthrown,.","date":"2012-11-15","mins":"2:48 am","url":"https://shroudstory.com/2012/11/14/early-evidence-of-ab-blood/","cat":"blood_studies","title":"Early Evidence of AB Blood"},{"id":"comment-19046","author":"charles_freeman","post":"Well my actual point was that there was no evidence of AB blood groups that I knew of before 900 Ad. This study does not seem to provide any.You can have mingling without a self sustaining new genetic group emerging for our purposes it is the early AB evidence that we are after ..","date":"2012-11-14","mins":"10:01 am","url":"https://shroudstory.com/2012/11/14/early-evidence-of-ab-blood/","cat":"blood_studies","title":"Early Evidence of AB Blood"},{"id":"comment-201290","author":"charles_freeman","post":"Well, at least we have established that the hair is not as you would expect from a body lying down. It is a point that is not usually recognised yet it is, of course, of enormous relevance. I know what I think – others will have their own explanations..","date":"2015-06-08","mins":"1:18 am","url":"https://shroudstory.com/2015/05/26/fascinating-video-from-dave-hines/","cat":"blood_studies","title":"Fascinating Video from Dave Hines"},{"id":"comment-200251","author":"charles_freeman","post":"“Silence the voice of the skeptic once and for all.’ It’s amazing what having a home laboratory will do for you. (Cf. C. Berry.).","date":"2015-05-26","mins":"11:57 am","url":"https://shroudstory.com/2015/05/26/fascinating-video-from-dave-hines/","cat":"blood_studies","title":"Fascinating Video from Dave Hines"},{"id":"comment-200323","author":"charles_freeman","post":"Yes, Dave I do know the section from the Easter Preface of the Mozarbic rites ( Spain) but this only tells us that later grave clothes .e.g. Those used in these rites, probably had images on them, though in this case there is a risen Christ as well as a dead one, so clearly not the Shroud. (NB. In inventories we often find cloths said to be painted with images of the risen Christ presumably used during Easter ceremonies,) We will see what happens when you unwrap but I can’t see how the imprint will be anything like the Man on the Shroud One of the arguments for an original painted surface has always been that there is no sign of the imprint of an actual wrapping over a body and that the head and hair of Christ and the bloodstains are those of the conventional depiction of Christ, in this case standing. Of course if you use a model made of hard material this is what you will get, but in a real body the hair would have fallen back. But don’t let me divert you from your experiments. . . ..","date":"2015-05-27","mins":"3:39 am","url":"https://shroudstory.com/2015/05/26/fascinating-video-from-dave-hines/","cat":"blood_studies","title":"Fascinating Video from Dave Hines"},{"id":"comment-41899","author":"charles_freeman","post":"It is not a case of liking or hating Ian Wilson. Yannick has shown in detail on this site why his thesis does not hold up in historical terms and I endorse Yannick’s findings. The real tragedy is that Wilson has diverted attention away from other leads. Did you know, for instance, that we have important early medieval relic collections at Sens, 90 kilometres from Lirey, and Chelles, 185 kilometres from Lirey. 31 relics of the collection that remain at Sens and whose dates of arrival are dated to between AD 600 and 1000 are tagged as coming from the Holy Land. Three of the eighth century relics still in the collection are said to be from the ‘Lord’s Tomb’ in Jerusalem. Chelles has five relics whose arrival is dated between 700 and 800 that are tagged as coming from the Holy Land including ‘a stone from Calvary’. These are detailed in Michael Mc Cormick\\s study ‘The Origins of the European Economy’, Cambridge UP 2001. Mc Cormick was trying to find evidence of trade between Europe and the Holy Land and he realised that relics provided relevant material. However, Shroud researchers should be following up these leads. They may lead nowhere but they certainly cannot be ruled out if one is trying to find out the possible routes an early relic might have reached northern France. Then what about the sudarium and shroud reported to have been taken by the prince bishop of Halberstadt, Conrad of Krosigk, from Constantinople in 1204? Instead of going on about the Knights Templar when he has absolutely no evidence that they ever had the Shroud, why did Wilson not follow up this lead and why has no one else (so far as I know)? It is documented in Michael Angold’s The Fourth Crusade. Was it the one from the Blachernae Church? I, and Yannick, and perhaps others ,cannot possibly understand why anyone supports Wilson when his history is so inadequate and there are so many potentially more fruitful lines of research that have been ignored..","date":"2013-08-24","mins":"1:59 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-41956","author":"charles_freeman","post":"Fine. Angold mentions just ‘the shroud and the sudarium’ so he is misquoting.We still have yet another report of a cloth, or fragments of one, purporting to be the authentic burial shroud of Christ. My point remains. Among mainstream historians, Wilson’s hypothesis, call it what you will, has little or no standing, but it does appear to have diverted attention away from other early medieval relics in northern France that had direct links with Jerusalem and even with Christ’s tomb. I leave it to others for whom the Shroud is a central part of their lives to follow up these interesting possibilities..","date":"2013-08-25","mins":"1:44 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42051","author":"charles_freeman","post":"The reason why so many people ( outside the community of his fans) distrust Wilson is that any further research on his hypothesis often shows that he has been misleading. I don’t know how to put images on this blog and perhaps Dan can follow this up. Take Wilson’s The Shroud: Fresh Light on the 2000 year old Mystery, 2010. Turn to page 28 where at the bottom of the page is a picture that Wilson has given a caption to as follows: ‘How the theoretical body was laid in the Shroud. Reconstruction after a painting by the seventeenth century artist G.B. Della Rovere’. Note that the painting itself is not illustrated but if you bring it up on a search engine you will find that Wilson has reproduced something completely different. Della Rovere showed the elbows of Christ bent and the right hand over the left. Wilson shows the arms straight and the left hand over the right! Della Rovers shows the legs straight down on the ground, Wilson has them bent upwards. This means that the soles of Wilson’s feet are almost full on the ground while Della Rovere’s are at a higher angle. Della Rover, following the conventions of the day, has put on a loin cloth. Wilson leaves it off. Now Wilson could simply have said that he was putting a theoretical reconstruction of the burial but it was HIS choice to say that it was ‘after della Rovere’ when it is most certainly isn’t. Can any of Wilson’s fans explain why? I can only say that for myself I never accept anything that Wilson says without checking further. I am sure that Yannick and I have different approaches to other issues but I can see why he gets so frustrated when no one seems prepared to criticise Wilson. To go back to my original point, by slavishly following Wilson, many other areas of research that provide DIRECT links between relics from Jerusalem and northern France have been ignored..","date":"2013-08-26","mins":"7:10 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42067","author":"charles_freeman","post":"I am sorry, O.K. I do not take your point. You can access my Holy Bones, Holy Dust, How Relics Shaped the History of Medieval Europe, Yale UP, 2011 (reviews on the Yale US website) and see that I have done a great deal of serious research on many medieval cults and used a large number of sources, original and later. I am looking for credible evidence and there are many scholars who provide this. I simply disregard authors such as Wilson who are not credible. I am simply warning people off him but i I can live with it if you don’t want to listen. Wilson must have known that his depiction of the della Rovere painting had nothing to do with what della Rovere actually painted, so it is not a ‘tiny and unimportant error’ of the type that all of us make it was some form of conscious decision which, whatever Wilson intended, is misleading to anyone who is doing serious research. I repeat : I know why Yannick gets frustrated. Please provide, with illustrations, proofs of my ‘flawed statements’. Perhaps we are talking of a different della Rovere painting..","date":"2013-08-26","mins":"10:32 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42138","author":"charles_freeman","post":"If anyone posts the two pictures side by side you will see what I mean. Why did Wilson bring della Rovere into it at all? Why not just say that from the images today this is how the burial might have been? Della Rovere is basically irrelevant unless the Shroud had gone missing and we wanted to know what it might have looked like..","date":"2013-08-27","mins":"11:19 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42196","author":"charles_freeman","post":"I am going to bow out by remaking my original point, which is nothing to do with stiff necked academia, but with the way that unquestioning belief in Wilson (who, to my mind, is a very poor and often misleading historian), has stopped other paths being investigated. I work in the wider field of relic cults which is why I keep coming across material that seems relevant to Shroud researchers but, so far as I know, has been neglected by them. So do you all know (perhaps you do) about the accounts of Antoninus of Piacenza, c. 570, who reported from Egypt (Memphis) of a ‘pallium lineun in quo effigies salvatoris. . .que imago singulis temporibus adorator et nos adoravimus.’ This is important as one of the problems of tracing an early shroud is that of the high rate of disintegration of linen outside Egypt,yet here is an early example of a LINEN cloth with an IMAGE of the saviour on it WITHIN Egypt. The article you need is Ernst Kitzinger ‘The Cult of Images in the Age before Iconoclasm’, Dumbarton Oaks Papers, Vol.8 (1954), pp 83 150, quote comes on p. 96. I am not going to stand up and defend academia which as we all know can be narrow and obstructionist of any new ideas. I AM going to criticise Shroud researchers who are so blinkered that they cannot possible look at alternatives to Wilson when there are many to follow up (see my original post on the relics from Jerusalem in churches close to Lirey). I must get back to my own researches!!.","date":"2013-08-28","mins":"4:21 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-17374","author":"charles_freeman","post":"James Tabor’s latest book was completely taken apart in March especially by the American Schools of Oriental Research (ASOR) website. In the ensuing discussion he was shown pretty convincingly to have doctored his photos to fit his thesis that he had found the first Christian tomb. Do not touch..","date":"2012-10-09","mins":"1:30 pm","url":"https://shroudstory.com/2012/10/08/james-d-tabor-taken-aback-claims-about-the-shroud-blood-x-and-y-chromosomes/","cat":"blood_studies","title":"James D. Tabor Taken Aback:  Claims About the Shroud Blood X and Y Chromosomes"},{"id":"comment-17375","author":"charles_freeman","post":"The Book is The Jesus Discovery (Simon and Schuster, 2012) and here is one extract from a review reproduced on the ASOR blog by Eric Meyers of Duke University. Tabor’s main argument was that he had ‘seen’ a fish on an ossuary which mainstream scholars had seen an amphora! He eventually became the subject of much ribaldry when some of his less reverent critics began seeing all kinds of things in the photos he reproduced. My own feeling is that he has landed himself in complete ridicule although, as always in these cases, he still has credulous admirers. Go to the ASOR website, access the blog and search James Tabor for a fuller assessment by the leading scholars. ‘The book is truly much ado about nothing and is a sensationalist presentation of data that are familiar to anyone with knowledge of first century Jerusalem. Nothing in the book “revolutionizes our understanding of Jesus or early Christianity” as the authors and publisher claim, and we may regard this book as yet another in a long list of presentations that misuse not only the Bible but also archaeology. The image in the book (on page 91, fig.30) is very washed out, and any fish imagery is hardly identifiable let alone as that of a fish spewing out a human [Jonah claims Tabor]. In fact, the image in the book is so poorly reproduced in my copy that one suspects it has been intentionally altered so that no one could see what the the image really is.’.","date":"2012-10-09","mins":"1:45 pm","url":"https://shroudstory.com/2012/10/08/james-d-tabor-taken-aback-claims-about-the-shroud-blood-x-and-y-chromosomes/","cat":"blood_studies","title":"James D. Tabor Taken Aback:  Claims About the Shroud Blood X and Y Chromosomes"},{"id":"comment-17627","author":"charles_freeman","post":"Thanks,Kelly. This is useful. I shall follow up these articles when I am next in the Cambridge University Library. It is a pity that the author does not cite where these skeletal remains and mummies came from but no doubt the articles will make this clear. It is also a pity that the most recent of these articles is already 23 years old and we have had immense advances in the study of DNA since then!! As I understand it some EGYPTIAN mummies which were once thought to be AB have now been reclassified as A following more sophisticated analysis. I wonder whether these are the ‘mummies’ referred to in these dated articles. It is not clear in the second part of the article what we are referring to. If we are talking just about the emergence B blood groupings then most accounts accept that they emerged many thousands of years ago. No problem there, It seems as of the Harvard specialist is referring just to the emergence of B. But it is not clear from this when the mingling of B with A took place to produce AB in the regions closest to Galilee. That is the question we are after. Most accounts assume that it was very much later than the first century AD even though the evidence does suggest that the date of AD 1500 for the emergence of AB is too late AD 900 and ‘a thousand years ago’ seem more readily quoted with ,as I cited in an earlier posting, the Hungarian plains the most likely place of the mingling of As and Bs as this is where the highest percentage of A Bs in Europe are to be found. I am still waiting for my Hungarian medical friend to respond as I assume that the references to the research are in Hungarian. Perhaps he will be able to provide an English summary. ( He was a prominent surgeon until he retired so he should be able to give us some accurate material if he can find it.) There is the separate question of when the AB grouping first emerged in other areas in India and the far East where A and B groupings also mingled. I can’t find any research on this. I assume that technically speaking AB can emerge wherever there is sexual contact between As and Bs although there would presumably have to be quite a number of contacts before you get an embedded AB population which can sustain itself. I look forward to more expert input..","date":"2012-10-14","mins":"10:52 am","url":"https://shroudstory.com/2012/10/13/just-how-old-is-the-ab-blood-type/","cat":"blood_studies","title":"Just how old is the AB blood type?"},{"id":"comment-17649","author":"charles_freeman","post":"Thanks, Kelly. I will contribute anything I find from Hungary. It seems strange that that significant AB finding from israel has not been followed up since 1977. There must be some further work done by someone somewhere. Thanks, Gabriel for the for the Korean evidence..","date":"2012-10-15","mins":"4:31 am","url":"https://shroudstory.com/2012/10/13/just-how-old-is-the-ab-blood-type/","cat":"blood_studies","title":"Just how old is the AB blood type?"},{"id":"comment-29010","author":"charles_freeman","post":"Vojnet. ‘We were all created with type AB blood the truth is that blood type AB has always existed.’ Please give your source. ( I assume that you accept that there is an AB blood grouping that is completely distinct from A, B and O if not please explain.) ‘Misinformation campaign’. Please give details of this campaign, where it originated and why anyone should have launched it. Most of the evidence for the emergence of AB c. 900 AD seems to have come from Hungarian burials. Did the Hungarians have a special reason for a misinformation campaign? ‘The cloth has been dated to about the first century AD’. No accepted dating to the first century has yet been achieved. Even Fanti’s latest attempt is only an averaging of two different results neither of which was first century AD and his samples are of dubious origin. He cannot be taken seriously until the source of his samples are known more clearly, his results are replicated elsewhere and his ‘averaging’ methods approved by other scientists. .’..500 years ago when the poisoning began’. Are you saying that the only blood group known before 1500 was AB? does the archaeological evidence from pre 1500 burials support this view? Please explain what you mean by ‘poisoning’. Thanks, your answers may help take the debate forward..","date":"2013-04-01","mins":"12:17 pm","url":"https://shroudstory.com/2012/10/13/just-how-old-is-the-ab-blood-type/","cat":"blood_studies","title":"Just how old is the AB blood type?"},{"id":"comment-10626","author":"charles_freeman","post":"It might help the discussion to say that medieval relics of Christ’s blood were very common. There is an excellent book on all the blood cults: Caroline Walker Bynum’s Wonderful Blood that concentrates on blood relics in northern Germany. I don’t know if any of these have been analysed for blood types. Some are said to have been gathered off Christ while still on the Cross. They were very controversial as one theological view was that if Christ was truly resurrected ,then all elements of his body would have gone up to heaven with him and there would have been nothing physical left of him on earth. So by this view, and it is only a theological one, there could have been no physical remains on the Shroud..","date":"2012-04-20","mins":"5:32 am","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-209419","author":"charles_freeman","post":"John, if you take the carbon dating out,you still do not have scientific evidence of an earlier date, certainly not the first century. It just leaves a blank. My approach is that you must start with establishing the date of the weave as without the weave you cannot have any images. Ever since Raes left the date open in 1973 6,(‘the type of weave [of the Shroud] is not particularly distinctive and does not enable us to determine the period in which it was produced’.) there has been a mass of new work on ancient weaves see the enormous compilation of recent evidence in Textiles and Textile Production in Europe, from Prehistory to AD 400, ed. M.Gleba and U. Mannering, Oxbow Books, 2012. Nothing shows anything like a cloth with the dimensions and three in one herringbone weave of the Shroud. See also Orit Shamir’s study of Palestinian weaves where he can find nothing matching the Shroud. Yet we do have medieval examples of this weave and this dimension of cloth. Balance of proof???.","date":"2015-09-01","mins":"5:44 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209439","author":"charles_freeman","post":"Sorry, John, I am too busy following the latest works on weaves and painted linens, especially Passion iconography, they seem to hold the key to the Shroud but please let me know when Rogers’ work has been replicated by a specialist in these areas..","date":"2015-09-01","mins":"2:01 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209461","author":"charles_freeman","post":"John the weave is not primarily an artistic issue you cannot begin to think about the images until you have defined the nature of the cloth on which they rest. We have had a vast amount of new research on weaves in the last forty years and obviously any serious scholar is going to research these to relate them to the weave on the Shroud. The problem here is the complete lack of any evidence to support a pre medieval weave in the Shroud. The problem rests with those who claim that it is first century. Until I have found a weave in linen that supports an earlier date I am sticking with the medieval period..","date":"2015-09-02","mins":"12:53 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209498","author":"charles_freeman","post":"Thomas, you need to start with the Cambridge History of Western Textiles and acquaint yourself with the different kinds of looms, notably those used in the ancient world and the revolution of the medieval treadle loom. Once you have faced the challenge of findin G a loom from the ancient world that was able to weave a cloth of over four metres ,you need to look at weave patterns. I have given a reference already above to an authoritative volume that deals with recent work on textile fragments up to Ad400. And there si the latest work on Palestinian textiles that I have also referenced above and which was actually publicised on this site. The difficulty I in all these authoritative works is finding any combination of weave and loom from the ancient world, that matches the Shroud. For the medieval period we have no problem with length on a treadle loom and we know of a similar three in one herringbone weave in linen. This is why Imgo for a medieval,origin of the Shroud. Over to anyone to find an equivalent form the ancient world!).","date":"2015-09-02","mins":"4:58 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-208970","author":"charles_freeman","post":"I am sorry if I missed Barrie’s reference to Drusik that he provided for me. None of us can read everything and I for one have stopped reading Colin completely as he is always changing his mind. I am sure he will tell us when he has finally found the end of the rainbow. I had come across Drusik in Rogers and Schwalbe’s paper on the Shroud and was interested in him because he suggested that the calcium carbonate may have been on the top of the linen and influenced the discolouration that we now have on the Shroud. This fits with other evidence that this was originally a sealed and painted cloth and, unlike anyone on the STURP team, Drusik may actually have known something about painted linens and what one can expect to find when, as happened eventually in most cases, the painted/ gessoed surface disintegrated. I am still waiting for the scientific evidence that dates the Shroud to before 1000 AD. It seems to be assumed that there is some but it is never properly set out. I would be more interested in Fanti’s dating if his three methods had come to the same result. The fact that the three dates were so disparate suggests that he has not found a reliable dating method also there is the problem with his samples and his averaging methods seems a bizarre way of dealing with three widely differing dates, only one of which at most, may be accurate. Again Rogers’ guess at an earlier date based on vanillin,etc., is not supported by any replicable method of dating. So if there is any replicable SCIENTIFIC evidence for a date from the first century, perhaps it can be put on record..","date":"2015-08-25","mins":"4:18 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209002","author":"charles_freeman","post":"J. Druzik of the Los Angeles County Museum of Art I assume that he is the same one as the Drusik that Barrie mentions, ‘’suggested that if the large calcium concentrations had been present in the cloth before the image was formed, it might be expected that it would have buffered certain types of reactions and, thereby, assisted in confining the discoloration to the tops of the thread crowns.’ From Rogers and Schwalbe. Physics and Chemistry of the Shroud. This needed to be followed up as it fits with the possibility, no more than that,that the discoloration took place under a gessoed surface in which calcium carbonate was an ingredient..","date":"2015-08-26","mins":"3:47 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-208994","author":"charles_freeman","post":"First group to have access to the Shroud?. I thought the 1973 6 Commission was the first. Barrie reminds us that e scope of the STURP investigation was very limited. Any systematic study of the Shroud as a whole must start with the cloth itself, its weave,etc, as without the cloth there would be no images to look at. STURP never pretended to do that. STURP always seemed to assume that the images on the Shroud as they are now, are as they have always been. I think this was a major omission as they make no attempt to deal with the evidence from earlier documentation and depictions that suggest the surface was originally very different. This was simply ignored. And with much more sophisticated equipment can any of the STURP findings now be replicated with material from the original tapes?.","date":"2015-08-26","mins":"1:34 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-208997","author":"charles_freeman","post":"The three in one herringbone is a recognised weave today used for the inaugural vestment in silk of Rowan Williams as Archbishop of Centerbury. A BBC researcher found a Welsh weaver who said she could produce one similar to the Shroud on her treadle loom. Whether she asked too much money or whatever, the BBC could not find the funding to go ahead! It would have put the weaving issue centre stage to have shown one way in which the Shroud would have been woven on a medieval travel loom so I am sorry that it did not go ahead. Any crowd funding available from anyone?.","date":"2015-08-26","mins":"2:13 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209003","author":"charles_freeman","post":"P.S. Naturally quite a lot of people have contacted me via History Today to make comments on my article and one of them still felt very angry about what he called the suppression of the 1976 Commission report..","date":"2015-08-26","mins":"3:51 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209377","author":"charles_freeman","post":"John in his gospel does not say which side the wound in the chest was. It was only later convention that established it on the right side ( e.g. Rabula Gospels, c. 585, often said to be the earliest representation). This can be used either way by authenticists and non authenticists the wound in the right represented some earlier tradition, or the artist of the Shroud was purely following convention by showing the negative image of the wound on the left side of the man on the Shroud..","date":"2015-08-31","mins":"1:16 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209310","author":"charles_freeman","post":"The Galatians were defeated by the Attalids of Pergamum, and Pergamum was not incorporated into the Roman empire until 133 BC, so no need to look at Roman sources for wounds on the Dying Gaul. There is no reason to suspect was anything but a wound received in battle..","date":"2015-08-30","mins":"11:06 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209342","author":"charles_freeman","post":"This is an Hellenistic statue and you need to consider it within the particular tradition. The Romans developed an obsession with Greek statuary and copied the famous ones as they did here. No need to try and develop a link in any way to the Shroud..","date":"2015-08-31","mins":"2:30 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209378","author":"charles_freeman","post":"I am simply making the point that the Dying Gaul is a pre Roman Hellenistic statue that was copied by the Romans. John’s account of the lance was widely represented in art from the sixth century onwards the gospel was obviously the source for this. Nothing to do with Wilson, whose knowledge of the ancient /Byzantine world is very sketchy..","date":"2015-08-31","mins":"1:52 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-22462","author":"charles_freeman","post":"Hugh if you read the original study, you will find, so far as I remember, that the supposed AB population were a small group from the same family buried together. Kelly. As not a single one of the many thousands of medieval relics has yet been proved to come from the first century, the presumption is that such relics are not authentic unless very strong evidence is provided otherwise. I am waiting for some so that i can launch a second, more sensational, edition of my book on medieval relics!.","date":"2013-01-23","mins":"10:21 am","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","title":"Positive for AB is not the same as AB positive"},{"id":"comment-22516","author":"charles_freeman","post":"‘If the blood on the shroud is 1st century, and if it really tests AB, then it comes from the commonest type of blood there was.’ No, it doesn’t, because this is a study of only 46 bodies (and I will provide the family links when i next access the article in Cambridge) which has never been replicated while the study of the Egyptian bodies has, so far,as i know, now been reclassified to show that they were A, although I will have to check my source for that. (I am not sure that the reclassified Egyptian mummies are the same mummies quoted in your source.) We need, after 35 years in which techniques have improved enormously, to apply the same retesting on the Israeli sample but, as it does not seem to be quoted in later studies of early Jewish genetics I assume that it has not been taken seriously. It remains extraordinary that no one else can find any evidence of AB before AD 900. If testing of earlier samples is as unreliable as suggested then the israeli case can hardly be taken seriously. Your argument would imply that AB has diminished over the years to the c. 4 per cent we have today. I think we are often getting confused between ABO ( A,B and O, the original blood groupings, and the distinct, and probably much later, AB.).","date":"2013-01-24","mins":"8:27 am","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","title":"Positive for AB is not the same as AB positive"},{"id":"comment-21818","author":"charles_freeman","post":"I am still trying to find out whether there is any evidence for AB before 1000 AD. So far the only case I have been offered is one very small sample from Israel from a paper in 1977 but more recent works on Jewish genetics do not seem to mention it and I have no evidence that it has been confirmed by any later testing. So as no one seems to have come up with any early AB material AS YET, I shall keep to my PRESUMPTION that an AB type suggests a date for the blood of after 1000 AD..","date":"2013-01-10","mins":"6:07 am","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","title":"Positive for AB is not the same as AB positive"},{"id":"comment-22376","author":"charles_freeman","post":"Everyone agrees that A,B and O are ancient. It is AB ,which is distinct from them, that we are interested in, if that is the blood on the Shroud. The Hungarian evidence suggests that AB is not known there before AD 900 and is related to the genetic intermixing of A and B groups, with AB, understandably,only became a genetically embedded blood group two or three hundred years later. Bodies of the local population before 900 have been analysed for their blood grouping and so far no evidence of AB has been found. This is not conclusive but we need to do better than one sample from 1977 why has it never been replicated? why is it not quoted in later studies of genetic material from Israel? At the moment it remains alone so far as I know which is why I have continually asked everyone i know for other examples of early AB and I have not been given a single one. Until I have been, I am entitled to put the AB blood typing of the Shroud alongside the other evidence that it was made, by means as yet unknown, in the medieval period. I am ready to change my opinion if countervailing evidence is provided and if I am convinced I stand to make a lot of money from rewriting my book on medieval relics with an authentic example of a relic purporting to come from the first century. After all all these relics, from the Cross , nails, Crown of Thorns, burial shroud , bones of the apostles, the Virgin Mary’s slippers and girdles, actually existed at one point the question is whether any of them have survived. As any archaeologist working in this area (regional and with this kind of artefact) will tell you, it is unlikely especially as the evidence from early Christianity shows that, as with most Protestant communities today, the preservation of relics was not considered important. As that great Church Father, Basil of Caesarea, complained when relic collecting BEGAN in the fourth century: ‘As the sun does not need the lamplight, so also the church of the congregation can do without the remains of the martyrs. It is sufficient to venerate the name of Christ, for the Church is his bride, redeemed by his blood’. The Protestant reformers agreed which is why they destroyed relics without compunction and that included those such as the bones of Thomas Becket that we know were genuine it simply did not matter to them because they, like the early Christians, did not see relics as relevant to the way they worshipped God. So my request remains open for examples of AB blood groups before 900 and I shall go on asking my history of medicine contacts who will not necessarily even know why I am asking them. No examples provided as yet..","date":"2013-01-22","mins":"6:59 am","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","title":"Positive for AB is not the same as AB positive"},{"id":"comment-189044","author":"charles_freeman","post":"The pincers are one of the so called arma, instruments shown in the Passion of Christ. For those of you who have Beldon Scott, you can see them in the surround of Vittorio Amedeo Barralis’ engraving ‘Sacred Anatomy of the Image of Our Lord Christ Imprinted on the Holy Shroud, 1685 (fig. 126, p.178) – the original yet another from that underexplored treasure house of images of the Shroud, the Royal Library in Turin. They are shown alongside a hammer and what appear to be nails. This engraving is interesting as the artist was creating a meditation on the wounds of Christ as shown on the Shroud and is one of the few to concentrate on and reproduce the flagellation marks. Of course, pincers are seen in other representations of the arma and so one cannot make any kind of special link with the Shroud – Barralis was simply adding them in alongside other of the arma and Beldon Scott notes that this was the result of liturgies centring on the Shroud by the Theatine order to which the architect of the Shroud chapel Guerino Guerini belonged. There is apparently a relic somewhere of the chain which bound Jesus after his arrest before he was brought before Pilate. I have not been able to track down where it is but clearly people knew it existed as I have found it among a list of the recorded relics of the Passion without any further information as to its whereabouts..","date":"2015-02-04","mins":"4:37 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-189049","author":"charles_freeman","post":"The Arma Christi Rolle of c, 1440 now preserved at Stonyhurst College, in the UK, has illustrations of the arma and under the pincers is the following poem (translation, of course) that is itself dated earlier, to the end of the fourteenth century. ‘The pincers that drew the nails out Of feet and hands all about And loosened the body from the tree Of my sins loose they me.’ So even if the pincers are shown before the Crucifixion took place, they are very much around in imagery of the Passion of Christ and it is interesting to find them alongside an engraving of the Shroud. Google images ‘Passion Christ arma’ will bring up more examples although the pincers are not always illustrated among the arma..","date":"2015-02-04","mins":"4:53 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"}]
