[{"id":"comment-38418","author":"charles_freeman","post":"Quote from John Jackson ‘A New Radiocarbon Hypothesis’ , Turin Shroud Center of Colorado, May, 2008,(para one). ‘One hypothesis is that the linen sample used in the radiocarbon dating actually came from a medieval ‘re weave’.While this hypothesis has been argued on the basis of indirect chemistry, it can be discounted on the basis of evident bandings in the 1978 radiographs and transmitted light images of STURP. These data photographs show clearly that the banding structures (which are in the Shroud) propagate in an uninterrupted fashion through the region that would, ten years later, be where the sample was taken for radiocarbon dating.’ I assume that the radiograph in the Rogers article of 1982 is from the STURP collection referred to by Jackson and we must leave it to them ( or John Jackson) to publish it so everyone can have a look..","date":"2013-06-30","mins":"5:04 am","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","title":"A bit of interweaving in the Arizona sample?"},{"id":"comment-38417","author":"charles_freeman","post":"For those that can access it there is a very good good radiograph of the top left hand corner (as you look at it) of the Shroud , exactly the spot where the Raes sample and the radiocarbon 14 samples came from but larger than that .eg. About 40cms by 30cms as Fig. 7 in Rogers and Schwalbe’s article ‘Physics and Chemistry of the Shroud of Turin’ in Analytica Chimica Acta, Vol. 135 (1982). Rogers and Schwalbe used it to show that the banding, which is clearly shown, went across the seam which runs along the top of the cloth through into the main body of the Shroud. There is a clear line at the bottom of the radiograph e.g. On the left side of the Shroud,, where the Raes sample was taken from, but the radiocarbon 14 samples that actually went to the labs are much further in, beyond this line. If there was reweaving then it did not disturb the bands that run from the top of the Shroud well into its main body. But isnt’ this what John Jackson said in his article claiming that the rc dates were contaminated by carbon monoxide? It is ironical that Rogers himself used a radiograph in 1982 that seems to be evidence against his own argument twenty years later but perhaps other can see reweaving that Jackson and I cannot see. Anyone able to post this radiograph which i assume is the property of STURP ( no acknowledgment is given in the 1982 article)?.","date":"2013-06-30","mins":"4:55 am","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","title":"A bit of interweaving in the Arizona sample?"},{"id":"comment-173646","author":"charles_freeman","post":"I wish I knew where the money was in being an anti authenticist.. My last lecture was for free with the proceeds from tickets going to the restoration fund for a local medieval church. As I believe the Shroud is medieval, the lecture was perfect for the occasion and appreciated as such by an audience most of who were interested in such things, but there was no money to be had for it. So far I have earned £200 for signing over the copyright of my History today article and that’s it. So perhaps PHLP can tell me who will pay anyone who believes the Shroud is not authentic. ( Actually I don’t like the word ‘ authentic’ as it implies that there is something. Inauthentic about a grave cloth created , as I believe, for one of the most important liturgies of the year,that on Easter morning.).","date":"2014-11-29","mins":"4:30 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-38284","author":"charles_freeman","post":"There is a lot of background material in Maureen Fennell Mazzaoui’s The Italian Cotton Industry in the Later Middle Ages 1100 1600, Cambridge University Press, 1981. She makes the point, p. 80, that cotton and linen fibres were never woven together to make yarn but separate linen and cotton threads were used in a variety of cloths (detailed pp.166 7). Also there were times when the linen and cotton weavers formed a common guild. The book is valuable in that it takes the story back much earlier to Roman times (Chapter One). Despite there being no reference to the Shroud there might be material here that is relevant to your researches..","date":"2013-06-28","mins":"4:05 am","url":"https://shroudstory.com/2013/06/27/an-modest-inquiry-from-john-klotz/","cat":"carbon_14_dating","title":"A modest inquiry from John Klotz"},{"id":"comment-192869","author":"charles_freeman","post":"The all over flagellation marks on the Shroud, not recorded in any actual system of flogging, are the over looked issue that supports the radiocarbon dating. They appear after 1300 when artists incorporated Isaiah 1.6 into the iconography. James Marrow of Princeton is the expert on this although he seems not to be aware of the Shroud he provides lots of similar examples though. This iconographic dating is right in the middle of the radiocarbon date and can thus be said to support it..","date":"2015-03-09","mins":"2:43 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193014","author":"charles_freeman","post":"Matt. You need to read up the argument in Marrow’s lengthy study of this. He shows clearly that the influence was Isaiah 1.6. He also notes how three other OT texts were used as premonitions of the flagellation, each mentioning a different instrument. So he could then explain why the iconography of the day showed all over flagellation marks with different kinds of markings. However, he does not mention the Shroud. Then along comes Barbara Faccini who quite clearly has not read Marrow and lo and behold in her study of the flagellation marks on the Shroud she find three different kinds if markings. In other words there is a good case to be made out that the images on the Shroud were typical of a fourteenth century iconogrsphy that relied on OT texts, not the Shroud itself, as inspiration. Unless, of course, we add Professor James Marrow of Princeton University, acknowledged expert on the iconography of the Passion. To our list of scholarly incompetents..","date":"2015-03-10","mins":"12:54 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193015","author":"charles_freeman","post":"So Joe needs now to go further. 1) which of these sources shows that threads of cotton, not just fibres, were spun or woven into the Shroud? 2) How and why had the cotton got there? Is there any reason to believe new cotton was woven in alongside new linen – if so why? 3) what percentage of cotton is there in the make up of this area of the Shroud? Would it have any significant effect on the radio carbon date? 4) if the cotton is only to be found as fibres, what do you thunk of Raes” view that it drifted in during the spinning or weaving process at a time when cotton and flax were being woven in the same workshops?.","date":"2015-03-10","mins":"1:07 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193084","author":"charles_freeman","post":"There is explanations consistent with what has been found. 1) The flax with which the Shroud was woven was spun in a a place where cotton was also being spun (we know that this happened) and fibres of cotton became embedded in the yarn. Different bands of the yarn may well have had different proportions of cotton as they would have been spun at different times and even in different workshops 2) The yarn was woven on a loom which had previously been used for weaving cotton and at the edges of the weave there were therefore traces of cotton fibres that were not found further into the cloth. Either of these possibilities explains the varying proportion of cotton fibres across the Shroud although if it is really difficult to spot the cotton fibres, we cannot know for the Shroud as a whole how much cotton is where. I have never understood how Rogers was able to dismiss so easily the possibility that there were cotton fibres elsewhere on the Shroud. When was the necessary examination done? If the cotton was within the structure of the weave it would not have been found on the STURP tapes. There is nothing inconsistent with the possibility that the Shroud was spun and woven at the period when there were massive imports of raw cotton which were treated in the same workshops as flax, e.g. After 1200. The failure to spot cotton fibres as yet in other parts if the a shroud does not mean that these parts were not also woven after 1200. You are working from a preconceived belief that the Shroud is earlier than 1200 if you insist otherwise..","date":"2015-03-10","mins":"7:18 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193093","author":"charles_freeman","post":"P.S. And one must also explain why they added a mix of new cotton and new linen in a so – called invisible weave. It makes much more sense if the cotton fibres drifted in during one the processes , spinning or weaving, and, in view of the enormous increase in the use of cotton in medieval times it is much more likely to be then. I don’t understand how the presence of cotton fibres implies the addition of new linen to am existing weave. Raes 7 , a selected sample, does not mean that the radio – carbon samples had twenty per cent cotton – in fact the cotton fibres that were spotted and removed from the samples were minimal. I prefer to stick to the common sense explanation that these were fibres that drifted in and were certainly not added deliberately by a sinner or weaver..","date":"2015-03-11","mins":"1:03 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193386","author":"charles_freeman","post":"Thibault. There is no ‘high’ amount of cotton within the weave anywhere, certainly no evidence of anything that might make a difference to the R c dating. The amount found and removed from the Oxford sample has no significance for the dating. Again, it is you who has told of the difficulty of teasing out cotton fibres from the linen, so there remains no evidence that the rest of the Shroud has no cotton fibres in it when tapes (where are they now and who has access to them?) were only applied to the outside of the Shroud and not to its inner structure. There remains the problem of why anyone would want to add cotton fibres to the Shroud. An accidental drifting in of the fibres during spinning (?the apparent splice) or weaving seems many times more likely than a deliberate placing of them among linen,new or otherwise, for no apparent reason. These are fibres not threads. How would one have handled them? Rogers was arbitrary in assuming there was a dye. It suited his argument to believe what he had found was a dye but he provided no supporting evidence. What he found was also used in straightforward painting of textiles. Flury Lemberg dealt with the Rogers’ hypothesis, her views based on actual examination of the WEAVE, not some stray threads Rogers had gathered in, to see if there was any sign of this apparent reweaving.. As she makes clear there was not. There remains nothing, and this is the crucial point, that dates the material of the weave outside the medieval period..","date":"2015-03-15","mins":"12:44 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193108","author":"charles_freeman","post":"Yes, David, the problem of why cotton should have been inserted deliberately in such tiny quantities appears to many of us insuperable..","date":"2015-03-11","mins":"5:26 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193132","author":"charles_freeman","post":"What I meant was that we know that it was common to spin and weave them in the same workshops. One reason was that the skills required to spun flax and cotton were so similar that there was one guild of cotton and flax spinners, for instance at Cremona, so that they did not make a rigorous separation of the two materials. The other was that linen threads and cotton THREA Ds ( not fibres!) were often woven alternatively in cloths known as fustians. Raes who was an expert on this made the same point. First we need evidence of a woven part of the Shroud with cotton THREADS in it. Then if that evidence is found we need an explanation of why the threads were woven into the Shroud at all. If the reweave is largely in linen, why would there be any cotton added to it especially as this would make nonsense of an invisible reweave? Then there is the old question of why repair this part of the Shroud and not other areas which actually needed it. ( Remember Flury Lemberg made the point that she saw no reasons why this corner of the Shroud needed attention.) It makes sense to stay with the simple explanation that cotton fibres drifted into the Shroud either when the flax was being spun or when the yarn was being woven. I hardly think it is worth doing but if access is even given to the Shroud again, it would be interesting to make a study of the proportions of cotton in the different bands of the weave. Again I have never understood how Rogers knew there was no cotton elsewhere on the Shroud – I didn’t realise anyone had actually looked under a microscope to see – it would have been a long job to cover the whole Shroud! It is surely time to see the presence of the cotton fibres as irrelevant in terms of challenging the radiocarbon date..","date":"2015-03-11","mins":"12:03 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-47891","author":"charles_freeman","post":"Perhaps someone can quote from Rogers’ article the part where he shows that the threads themselves are different from the rest of the Shroud and the evidence he provides for this. I have found it difficult to find. He just seems to assume it rather than provide evidence of his own. Has anyone found enough cotton threads to make a difference to the date? The gum that he notes could have been added at any time to an original cloth as, apparently, this was a standard way of protecting cloth that might otherwise have decayed again can someone quote the evidence that he provides to prove that the gum was a dye and not simply a means of strengthening an old cloth..","date":"2013-10-18","mins":"10:13 am","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-47926","author":"charles_freeman","post":"Thanks for this, O.K., but gum arabic was, apparently, used when cloth needed to be sealed from decay (and this would,inevitably be any time after the weaving, so where does Rogers’ get the idea that it was a dye from? Then he introduces ‘probably done intentionally on pristine replacement material’. Yes, this is ,of course, his crucial argument but what Independent evidence does he produce in support of this. I cannot find any evidence in the actual article but perhaps he just accepts Benford and Marino on this and does not feel that he needs to add to what they have already said. In short, it is hard to see what evidence he provides from his own samples of threads to back up his argument but perhaps someone has spotted something I haven’t. As noted elsewhere John Jackson rejected Rogers’ argument ( photographic evidence shows no evidence of reweaving) and Mark Antonacci also found it lacking. So I wonder whether this article should be given the status it has when it has been challenged by so many others who are themselves happy to accept the authenticity of the Shroud on other grounds than those proposed by Rogers..","date":"2013-10-18","mins":"4:18 pm","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-48011","author":"charles_freeman","post":"Who has provided a ratio of old versus new threads in any sample from the Shroud? Who has found an actual cotton thread? Why use cotton THREADS, if there are any, rather than linen threads to make repairs? My point about Roger’s paper not being secure is that there are too many questions left open and assumptions made without sufficient evidence to evaluate them. Rogers tries to cover a lot of ground but only provides ten references for the whole of his paper. It just left me with questions that are unresolved..","date":"2013-10-19","mins":"8:00 am","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-47992","author":"charles_freeman","post":"Gum coating. If , as I understand it , gum is added when there is a need to preserve part of the cloth from deterioration, this, where the cloth was held by sweaty clerical hands when exposed, is exactly where you would expect to find it as a later addition. There would have been no need to cover the whole cloth. Perhaps we need to add to the list of tests, one for gum at the other corner of the Shroud. I am still not clear why gum arabic can be seen as a dye if anyone can find examples where it is used as a dye in other circumstances then I would be convinced but it seems to have been Roger’s own idea. The cloth that the gum was used on could have been of any date, of course, but the gum itself has nothing to do with the date of the cloth to which it was applied. It might be contemporary, it might be hundreds of years later that the original..","date":"2013-10-19","mins":"4:41 am","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-159431","author":"charles_freeman","post":"We don’t get very far by challenging what is some evidence from the 14 dating and the earliest documentation that we should be looking in the medieval era unless a better method of dating is proposed. I was fascinated with the way in which a number of ‘ respectable ‘papers published the Fanti ratings, cleverly placed to appear before Easter, without checking them and then the story faded completely as soon as everyone realised he had three different dates, of which only one at the most may have been correct, adjusted one but not the two others and then averaged them to produce his answer. The radiocarbon date wins out over this any day. But I agree that we must build a raft of other evidence if we wish to support a medieval date. The earliest documentation is certainly helpful as I know a number of other cases where the earliest documentation and the date of the object concerned are similar. There is still a mountain of work to be done on the earliest descriptions and depictions of the Shroud and for conservationists to see whether what we are actually looking at is an image that has now faded from what it was originally. The sceptics have the immense advantage in that ANY date other than between,say BC 20 and AD 33, means that the Shroud is not the authentic burial cloth..","date":"2014-10-05","mins":"3:01 am","url":"https://shroudstory.com/2014/10/04/an-abstract-for-today/","cat":"carbon_14_dating","title":"An Abstract for Today"},{"id":"comment-159186","author":"charles_freeman","post":"The calibration of these ancient dates has always offered problems, often because the problems of contamination over so many years is more acute. I recall reading quite a lot about the distinct problems when you reach 50,000 years (50 ka) BP. Adjustments of these dates, here it appears one to two thousand years in 30,000 are significant and ,rightly,are taken seriously here but unless the specific reasons for the discrepancy relate to the Shroud testing I cannot see the relevance. Even it they were it would only shift the Shroud dating at the most forty years one way or the other ( and remember that it could be one way or the other so it might place the Shroud later not earlier – it does not fundamentally discredit the testing process as such.).","date":"2014-10-04","mins":"6:11 am","url":"https://shroudstory.com/2014/10/04/an-abstract-for-today/","cat":"carbon_14_dating","title":"An Abstract for Today"},{"id":"comment-46113","author":"charles_freeman","post":"I have seen tables referring to the effects of contamination in which a small amount of contamination can affect radiocarbon dating substantially but the ones I saw were only relevant for much older material, up to 50,000 years old, and showed no effect for more recent dates. Perhaps Jackson saw different tables – from the ones I saw it would be impossible to extrapolate their findings to cover a cloth only 2,000 or less years old because they were specific only to much older materials. I am sure that Jackson, if he reads this, can confirm his original source..","date":"2013-10-04","mins":"4:54 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46114","author":"charles_freeman","post":"To fill out my reply no.19, I came across a 1966 study – googling ‘effects of contamination on radiocarbon dating’ will doubtless bring up more recent work that shows that if you have material whose ‘true’ age is 900 BP and ‘contaminate’ it with fifty per cent modern carbon, then the resulting date is 440 BP, in other words you get a date roughly half way in between as one might expect. However, suppose you have material whose ‘true’ age is 30,000 BP and then ‘contaminate’ with fifty per cent modern carbon, the date comes out at 5,400 BP, not the c. 15,000 BP you might expect. So when people quote the effects of contamination on radiocarbon dates, it is essential that you know what dating period they are working in.The effects are enormous for older material but not for more recent materials..","date":"2013-10-04","mins":"5:10 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-84420","author":"charles_freeman","post":"Suppose we had never had a radiocarbon date, then we are left with four other dates, one Rogers, three Fanti, but so far as I can see they are all over the place. It may be that only one of them is right and perhaps none of them are. If they are subject to the same level of scrutiny as the radiocarbon dates have been, then surely none is as yet acceptable. I also cannot see how Fanti’s findings can be refuted without him handing over his sample for alternative testing. He seems to be onto a winner here if he hangs on to them!.","date":"2014-03-03","mins":"7:35 am","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","title":"As long as these results are not refuted . . . [they] have scientific validity?"},{"id":"comment-185633","author":"charles_freeman","post":"I echo Hugh in asking for the source of the quotation as in the exhaustive discussion we had on the Codex I don’t ever remember anyone coming up with it. There was a discussion on whether the holes on the sarcophagus lid on the Codex are an attempt to reproduce the holes drilled in the lid placed over the original tomb in the (? tenth) century, a point given some support by the Crusader crosses on the Codex at a time, the 1190s, when there was Crusade fever in Hungary. But he Pray Codex has become an article of faith for which some Shroudies would be prepared to go to the stake. I still wait for an explanation of how someone saw the Shroud with the two images of a bloodstained and scourged man and then reproduced the poker holes but failed to show any of the wounds and scourge marks on the body of Christ that was being laid out our or any sign of images on the discarded grave clothes. The real question that fascinates me is why authenticists cling to the Pray Codex when they continually tell us that the evidence for the authenticity of the Shroud is overwhelming. Why then need the Codex which, even if it did show the Shroud, only takes its history back to the 1190s and no further – almost within the range of Hugh’s carbon dating?.","date":"2015-01-23","mins":"3:43 am","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","title":"BSTS Article by Hugh Farey"},{"id":"comment-196940","author":"charles_freeman","post":"I haven’t seen any direct references to any works of art in any STURP publication, such as the Holkham Bible and Roettgen Pieta which show close resemblances to the pattern of bloodstains and all over scourge marks of the Shroud. Anyway I will continue with my own researches and hope for eventual publication of them to make my argument clear..","date":"2015-04-20","mins":"12:46 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-196928","author":"charles_freeman","post":"Yes, but no one on STURP knew anything about medieval art – or at least I have never seen anything in any STURP report about the medieval iconography of the Passion. I am quite happy to accept that the original pigments had largely fallen off by 1978 but we still have the pattern of bloodstains and the scourge marks and can relate them to what was being painted at the time. For whatever reason STURP did not check this out..","date":"2015-04-20","mins":"10:13 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-196960","author":"charles_freeman","post":"No, they are not linen but they have similar patterns of bloodstains and artists who painted on linen also painted on other surfaces and vice versa. You can find both of them on Google images. Look at the depictions of the head of Christ in the crucifixion scenes of the 1330 Holkham Bible and you will see very similar squiggles as well as blood flowing down the arms. The Roettgen Pieta also had blood flowing down the arms and both show signs of overall scourge marks. So here we have a manuscript illumination, a sculpture and a linen cloth all showing similar iconography. I have some way to go before I have anything to publish but this beats the Pray Codex for similarities any day..","date":"2015-04-20","mins":"4:02 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-196898","author":"charles_freeman","post":"Good idea, Jos. Perhaps the retesting of the remaining samples can be held at the same time that three other laboratories test samples from different parts of the Shroud. Then we would have a wide variety of test results. It is also important to see whether any of the 1978 STURP tests can be replicated using fresh samples from the Shroud surface. So long as they remain unreplicated they have little validity. I continue to argue for a public database of all early descriptions and depictions, copies ,etc of the Shroud so that this important and neglected aspect of Shroud research can be open to scholarship. Judging from my own problems in paying for the copyright for online pictures this will need some funding and probably work at a university art history department. And it is vitally important to relate features of the Shroud to similar features ,e.g. Iconography and images, on other painted surfaces. Again this has never been properly done. Lots to do!.","date":"2015-04-20","mins":"5:14 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-196926","author":"charles_freeman","post":"P.S.The (Catholic) journal Tablet reported on 8 May, 2010 in an article Shrouded in Mystery that there had been a an earlier carbon 14 test in 1988 in which the Vatican had secretly checked out what the result would be. Apparently the source for revealing this test was Father Rinaldi. The result confirmed the later 1988 tests..","date":"2015-04-20","mins":"10:09 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-196923","author":"charles_freeman","post":"Yes, as a historian who has worked a lot with medieval iconography, I am more interested in relating the iconography of the Shroud to that of painting in the fourteenth century,as it looks as if we can pin down the bloodstains patterns and scourge marks to 1300—50 and so create a more precise dating for the Shroud than the radio carbon dating achieved..","date":"2015-04-20","mins":"9:59 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-74512","author":"charles_freeman","post":"So why did John Jackson and Flury Lemberg not spot the anomaly, and Wilson agree with them that there was no reweaving? I still want to clarify the problem of the cotton. There simply is not enough cotton used to sway the carbon 14 date so if there was a reweave that swayed the date it could not have been as a result of a cotton reweave. But why would they have mixed cotton and linen in the reweave? I suppose they might have found some perfectly matched linen in order to do the reweave, but then, with a deadline to meet, it ran out! ‘Darn’ said one invisible weaver to another , I might not be able to see you, but I think we are going to be in real trouble if we don’t finish by midnight, that is when we become visible again, so we will just have to fill in the bits we haven’t finished with cotton and dye them to match – and just hope nobody notices!!.","date":"2014-01-25","mins":"4:14 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74560","author":"charles_freeman","post":"‘Because they did not look for it ?’ I can’t speak for John Jackson but I do know that many people claim to respect his opinion as someone who has examined the Shroud in minute detail. You clearly have not read Flury Lembeg’s article (‘The Invisible Mending of the Shroud, the Theory and the Reality’) because she refutes the reweaving theory from her own intensive examination of that corner of the Shroud. The areas for the radiocarbon dating that were examined microscopically found some fibres of cotton which were removed. They were a tiny proportion of the whole and would not have much affected the dating if they had been left there, if there were indeed a different date from the main part of the cloth.So far as I know no one has examined the cloth in sufficient detail to see whether there are cotton fibres scattered around the rest of the Shroud. I would assume that some would be found but if Gilbert Raes was right and the cotton came in from a previous use of the loom more cotton fibres might be found in the parts of the Shroud woven nearest the loom. We still have the problem that adding up all the cotton fibres that have been found that they are not enough to affect the R14 date so I cannot see why the presence of these cotton fibres is at all relevant to the debate. I suppose that if fibres are found in other parts of the cloth and embedded in the yarn, it might be argued that this suggests a medieval date for the weaving as we know cotton and flax were processed in the same medieval workshops but let’s leave that until there has been a microscopic examination of the Shroud. I notice I have some leads from Joe Marino follow up and wonder whether they will answer my basic question why are these minute cotton fibres relevant to the carbon 14 dating? Please, please someone answer me! I don’t think Gabriel Vial’s findings from his own examination of the cloth have been given the prominence they deserve. Hugh has noted them. It is that there were wide discrepancies in the thickness of the yearn used in weaving the Shroud this was certainly not a top level cloth as Wilson seems to believe. If you look at a top level linen table cloth or napkin you can see how the yarns are the same thickness. In comparison the Shroud is rough and ready and simply for this reason there are anomalies throughout the original weave. Vial also noticed places where the weavers had made mistakes. Please read his article in the 1989 CIETA Bulletin. As i said before there is no perfect area of the Shroud that can acts a model for judging the rest. So I leave the question: Why is the presence of cotton fibres on the Shroud an issue so far as the carbon 14 dating is concerned?.","date":"2014-01-25","mins":"1:55 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74562","author":"charles_freeman","post":"I have now reread Joe Marino’s and Sue Benford’s paper and seen the I Tube again. There is some vague talk about cotton fibres being used in the reweave but nothing about the percentage of the sampled cloth that they make up. An impression, backed by no evidence at all, is left that the reweave was largely cotton but we know from the microscopic examination of the C14 samples that is not the case. Both Arizona and Oxford were able to spot the tiny number of cotton fibres and remove them. I am afraid I am more convinced that ever that the cotton thesis is a red herring there was never enough cotton in the C14 sample to make the slightest difference. If you want to sustain the ‘cotton reweave’ claim, please provide us with a PERCENTAGE, with supporting evidence, of how much cotton was in the samples actually tested in the labs you can base it on material from the surrounding area if you want. Over to anyone who can enlighten us. BTW Joe – as someone who has actually been inside one of the pyramids, I love Sue’s theories about pyramids, especially as related to the Shroud..","date":"2014-01-25","mins":"2:24 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74648","author":"charles_freeman","post":"No one is denying that there are cotton fibres ( N.B. For the hundredth time, not threads), around and Gilbert Raes assumed that they were prevalent in his edge because they may have drifted in from a loom used for weaving cotton. We know that cotton and flax weavers worked together in the medieval period so the presence of tiny cotton fibres is hardly surprising. Thibault has analysed several of the Raes threads and has done valuable work at confirming that there are cotton fibres around but, as he shows, they only form a small part of the total linen. He provides no more than speculative evidence that there are cotton fibres further into the Shroud, into the area where the radiocarbon samples were taken. He seems to have found a thread or two that may have had the fibre drift in before or during the spinning, and so give the impression of being embedded. (N.B. Thibault your articles don’t come up on my Mac but they do on my wife’s Mac! This was the case some weeks ago too so I transferred your articles then onto my computer.) I am not surprised Flury Lemberg misunderstood Rogers’ article it is very difficult to understand largely because it is so speculative and and has so few references to back his assertions, especially on vanillin. He suddenly talks about ‘pristine replacement material’ without saying what independent evidence of his own he has for this. No wonder, Flury Lemberg took him, and Benford and Marino to task, asking simple questions such as ‘if there is reweaving ,where did it begin and end or was it an identical path to that taken out for the sampling’. But I come back to the question I asked at the beginning: what percentage of cotton is assumed to be in the C14 samples. Although I cannot find the evidence to back this in his articles ( please quote such evidence if I have missed it), Thibault has at least come up with a clearly stated conclusion. ‘The anomalous C14 corner is made of many “modern” (16 th century ?) blended cotton/linen THREADS mixed with few ancient linen threads (from the Shroud main part). In the “modern” blended threads both linen and cotton fibers are “modern”.’ ‘Many ‘ and ‘few’ seems rather vague but if we take Benford and Marino’s 60 per cent new, 40 per cent old (which seems to give rather too high a figure for ‘few’), Thibault seems to be asserting that 60 per cent of the threads in the radiocarbon sale are blended linen/ cotton threads. I hope he will give fuller evidence for this blend and not why it has never been spotted by anyone. Thibault asked : ‘Microscopic examination? By whom ? By the labs? No.’ I could refer him to an article by somebody called Thibault Heimberger that reads as follows ‘In 1988, the textile experts looked at this area with binocular microscopes and later the laboratories [by this I assume he means all three of them] performed some observations with the microscope on their samples.’ Is it really possible that three laboratories missed the blended threads? They were ,after all, just testing what they had been given and there would have been no skin off their noses if the Shroud had proved to be a linen/cotton blend after all such cloths were often made with alternative cotton and linen threads and they would simply have reported it as such. Has anyone else seen them? If there are blended threads in the C14 samples , what percentage of the blend is cotton? We return to Thibault’s analysis of one Raes thread, R7. ‘Conclusion: there are many cotton fibers in the outer part [sic] of R7. However, it must be noticed that the total number of cotton fibers (23/96=24%) is certainly an overestimation because 1) it is difficult if not impossible to count exactly the number of fibers gathered in groups 2) many of the cotton fibers are small [sic] and certainly come from long cotton fibers which had been broken (perhaps during the handling process: cotton fibers are obviously more brittle than flax fibres).’ So if 24 per cent is an overestimation, let’s settle for 20 per cent, still probably too high. There is no evidence to support this at all but let’s assume that R7 is typical of the blended threads that Thibault argues make up the ‘modern’ repair. If we take the ‘modern’ threads at 60 per cent of the sample, and the cotton as making up 20 per cent of the ‘modern’, then we have a cotton content of some 12 per cent of the total sample. Yet, this was missed by the microscopic examination Thibault accepts that the labs undertook. Then there is the problem of why 20 per cent of cotton (and remember this is probably way too high) and no more was added to the linen. What would be the point of this if the majority of the addition was linen? I go back to my original conclusion that the cotton had drifted in as fibres, some of which were present when the flax was being spun, but overall the cotton is a red herring so far as radiocarbon dating is concerned because it formed too small a proportion of the total to sway the date in any significant way..","date":"2014-01-26","mins":"6:49 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74685","author":"charles_freeman","post":"‘He [Rogers] tested his the samples from the main body of the Shroud and found no (or only trace) Vanillin.’ One of the many problems with Rogers’ papers, is as Hugh pointed out, his lack of references to key assertions. (Why did the peers who reviewed it not pull him up on this?) Can we have the reference please for these tests on the whole Shroud and confirmation that they specifically tested vanillin because I have seen it stated that no texts specifically for vanillin have ever been done on the Shroud. In the debates recorded on Shroud .com for 21st January, 2006, John Jackson again went into the fray (against Rogers, as he had done over reweaving did these two have problems with each other?) and argues that the vanillin might have been destroyed in the fire of 1532 within a few seconds. I have no idea whether vanillin is so easily removed by heat but if it were we would have no means of knowing whether there was vanillin on the Shroud in 1531 or not. It might still have had its full complement. I am not a scientist but have read enough science to know that many of these debates contain no science at all, just vague assertions which when challenged simply melt away without any coherent responses. That is why I was so relieved that Thibault has actually put forward a clear statement regarding the content of the ‘patch’; that it had ‘many’ bonded linen/cotton threads, even if I would have preferred if he had been able to quantify what he meant by ‘many’. I can only assume he means 60 per cent unless he tells us otherwise. At least that is something we can look for in photographs of the Shroud and test out his hypothesis..","date":"2014-01-26","mins":"12:43 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74699","author":"charles_freeman","post":"In this discussion I have been asking for evidence of any reweave and in particular trying to clarify if there was any evidence of enough cotton fibres for them to have any relevance in the C 14 debate. So far no one has come up with any evidence for there being more than a small amount of cotton and if Thibault is right this was a small part of what was overwhelmingly a LINEN reweave. So one asks why deliber Ately weave in any cotton at all? Answers please! it is much more likely that Gilbert Raes who was a specialist and allowed to take off his own sample was right in suggesting that these tiny fibres just drifted in and were never deliberately added. I am not sure why Louis suddenly asks me about the protocols I have never raised them as an issue and cannot see why they are relevant to the issues I have raised. Conclusion.Was the cotton deliberately added or not? So little has been found and only in fibres. A deliberate addition would surely have been in whole threads. I side with Raes on these having just drifted in and this means that they are totally irrelevant to the C 14 debate..","date":"2014-01-26","mins":"2:41 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74710","author":"charles_freeman","post":"But one of the problems of Rogers’ paper is that he created the idea of the cotton being dyed. If Thibault is right and the cotton is embedded in linen it would have been impossible and unnecessary to dye it. In fact unless the reweave was totally cotton there would be no point in dyeing at all. This is where Rogers went wrong in his speculations. Where he seems to have been right is in saying that the encrustations would have been dissolved in the clarning process, I suspect , but I have no evidence for this, that gum Arabic was added to seal the cloth against decay and needed to be applied at the top here because it was where the linen was most threatened by the sweaty hands of the clergy. In short , it is impossible to envisage a situation where cotton fibres would have been dyed (how do dye a tiny fibre anyway, let alone one bonded with linen)and the sooner we drop this unwarranted assertion by Rogers and move on the better!.","date":"2014-01-26","mins":"4:43 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74790","author":"charles_freeman","post":"Lyfe thanks for putting that together! I think that it is important to state that this is not some mad idea of my own but relies on experts in ancient textiles who actually examined the Shroud and they all agree. Gilbert Raes took a sample back in the 1970s, first discovered the tiny cotton fibres and used his expertise to suggest that they had drifted in from a workshop where cotton and flax were being woven together. In 1988, the church may have finally decided where the sample came from but the choice was confirmed and supported later by the two ancient textile experts who were present, Professors Vial and Testore. In 2002, Mechthild Flury Lemberg, in charge of the restoration of the Shroud , also saw no reweave and published a paper pointing out that in her expert opinion there had never been any need to reweave that area anyway. (She specifically endorsed the work of Vial, saying that this was after all his specialist area.) She challenged the supporters of Rogers, Benford and Marino to show where the reweave began and ended. Flury Lemberg was supported by John Jackson, a big name among those who believe in authenticity, who showed from the photographic evidence that the banding was intact and so,again, there had been no reweaving. I don’t have much time for Ian Wilson but some see him as the super guru of Shroud studies and he also supports the idea of there not being a reweave. So the weight of expert opinion is overwhelmingly against any reweave. This makes the whole idea of dyed cotton redundant and if Rogers had thought through his speculation that the additions, ‘encrustations’ he called them, were dye he would have realised that it would not work in practice when there was so little cotton as a percentage of his proposed reweave. But he was an ill man and can be forgiven! What is extraordinary is how uncritical those who read his paper have been. No one seems to question the idea of a dye and see how flimsy, or non existent, was his evidence that the encrustations were a dye, rather than, say, a sealant. But enough said responses to this seem to be to cough and change the subject. Although I have been to Turin three times, gone through the Shroud Museum, been taken by the custodian to the chapel behind the museum to see the life size copy of the Shroud there ( as well as the life size one in the chapel next to San Lorenzo), I have never seen the original so i will rest my case on those who have seen it close up AND who dealt with ancient textiles as their professional career..","date":"2014-01-27","mins":"3:49 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74795","author":"charles_freeman","post":"Lyfe one more point as you seem actually to have taken my argument on board! .When he examined the Shroud in 1988, in the two hours while they were choosing the sample , Gabriel Vial looked over the whole cloth and took photos and then wrote an article in his findings for the French textile magazine CIETA Bulletin who published it the next year, 1989. He showed that the thickness of the yarn used for the weaving varied considerably. This meant that that the nature of the weave varied according to how the different thicknesses of the yarn just happened to be entered into the weave. It could be, but I have no evidence that this is the case, that the apparent discrepancies between parts of the Shroud are actually the result of this. He also noted areas where the weavers had made mistakes. An important paper..","date":"2014-01-27","mins":"4:04 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74062","author":"charles_freeman","post":"John Klotz. ‘I am sorry, but sometimes when I read the blogs and the comments of the pseudo skeptics, I hear mice squeaking at lions.’ John we have been here before but let’s at least use language with precision. A ‘skeptic’ is someone who has doubts about evidence it is a perfectly honest position to be in and is the default position of scientists and historians as well as many other academic disciplines. A ‘pseudo sceptic’ is someone who pretends to be sceptical about, say, ‘x’ but who actually knows that ‘x’ is true. That is not a very honourable position. So please only use ‘pseudo sceptic’ when you have evidence that someone knows something for certain but pretends they are sceptical about it. I, as a professional historian, live with scepticism simply because most historical evidence is fragmentary, contradictory or difficult to interpret.The Shroud is a prime example of this!.","date":"2014-01-22","mins":"5:06 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74059","author":"charles_freeman","post":"Please don’t forget the contributions made by John Jackson and Flury Lemberg to this debate both were sure ( Jackson on the evidence from banding, Flury Lemberg from her personal close up examination in 2002), that there had been no reweaving..","date":"2014-01-22","mins":"4:22 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74077","author":"charles_freeman","post":"‘The whole carbon dating affair wreaks of medieval skullduggery.’ I love it!.","date":"2014-01-22","mins":"9:10 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74220","author":"charles_freeman","post":"No one has ever shown that the cotton has been woven into the Shroud. Gilbert Raes pointed out that cotton and flax were often spun and woven by the same workers and so cotton fibres may have drifted into the spinning and weaving process. As there are so few cotton fibres found on the Shroud it would need an intensive examination of the Shroud to see whether they were all over the Shroud but as Jull said some of these fibres may have drifted in anyway from bags in which the Shroud was folded. I think Raes suggested that there were more cotton fibres on the edges because they would have been left over fibres in the loom from earlier cotton weaving. As linen and cotton were both readily available in medieval Europe and the textile workers tended to work in either, I have never understood why these ‘invisible weavers’ would not have used flax to make any repairs.Please can someone who supports the cotton reweave illuminate us about this. It also needs stressing that not a single cotton thread has been found, only fibres, and this is compatible with what Raes and Jull have suggested a drifting in of fibres from elsewhere, perhaps as early as the spinning process...","date":"2014-01-23","mins":"7:32 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74239","author":"charles_freeman","post":": ‘When LANL has conducted FTIR analysis, they could only find cotton, not linen.’ Please elaborate what this cotton was and where it came from. ‘When Thibault has intesively studied R7 he has found cotton, mainly around the thread, but into the core too, eliminating an external contamination.’ I think everyone is agreed that some cotton FIBRES may have drifted in as early as the spinning process because as Raes argued ( and it was his specialist area) cotton and flax were often spun in the same area. In fact in Cremona, northern Italy, the linen and cotton guilds actually merged. ‘Have cotton fibers drifted from bags which contained the Shroud into the core of Shroud fibers in the radiocarbon area ? Mr Jull is not running out of imagination but i don’t buy it.’ This is only a suggestion much more likely that Raes is right and that they drifted in an an earlier stage but to suggest that in all its frequent unravellings and displays, nearly every year in the open air in seventeenth century Turin, the Shroud was never in contact with cotton is going too far..","date":"2014-01-23","mins":"10:06 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74248","author":"charles_freeman","post":"Anoxie well here is the 1988 protocol please let me know which one of these refers to cotton: ‘On April 17, 1988, ten years after the S.Tu.R.P. Project had been initiated, British Museum scientific director Michael Tite published in Nature[26] the “final” protocol: the laboratories at Oxford, Zürich and Tucson would perform the test; they would receive one sample weighing 40 mg., sampled from a single portion of weave; the laboratories would receive two more samples, clearly distinguishable from the original one—a decision calling on the ethical dependability of the laboratories; samples would be delivered to the laboratories’ representatives in Turin; each test would be filmed; there would be no comparison of results (nor communication) between laboratories until the results be certified as definitive, univocal and complete; the proportional counter method would not be used because it required gram quantities rather than milligram quantities of shroud material.’.","date":"2014-01-23","mins":"11:37 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74264","author":"charles_freeman","post":"Anoxie I am sorry I don’t get the point no one suggests anything but that the Shroud is overwhelmingly linen. What I am interested is in the following: ‘When LANL has conducted FTIR analysis, they could only find cotton, not linen.’ I just want to know what this analysis was, what is was done on, etc, as I , and perhaps others reading this discussion, know nothing about it and it seems very mysterious as no one has yet proved that cotton makes up more than a tiny, tiny part of the Shroud and that only in fibres. This analysis might suggest otherwise so please let us know about it!!.","date":"2014-01-23","mins":"2:15 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74267","author":"charles_freeman","post":"Also, although cotton was known in Roman times, it was much more common in the medieval period when vast quantities were being imported into Italy and spun into yarn there. If we have too much cotton in the Shroud someone might even suggest the whole thing was woven in medieval times. The basic point is, of course, that no one has found cotton thread or explained why the so called invisible weavers would have used it instead of flax if they were seeking a perfect fit even down to the banding. I think the cotton thesis is all a red herring – or a red (rose) madder herring perhaps, and can be safely disregarded as having anything to do with any reweaving..","date":"2014-01-23","mins":"2:22 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74222","author":"charles_freeman","post":"‘Charles has cited John Jackson & Flury Lemburg. Jackson was pursaded by the uniformity of banding that there was no reweave. Was not one purpose of the materials to mask the reweave by ensuring such uniformity. I suspect that Flury Lemburg was very likely unfamiliar with the skills of the specialists that Marino & Benford consulted.’ Are you suggesting that these elusive invisible weavers were actually able to reproduce banding so perfectly that the STURP photographs did not show the reweave? They really were geniuses, especially as they may have been working in cotton rather than the original flax. It may well be that Flury Lemberg was unfamiliar with the specialists consulted by Benford and Marino. They work with modern techniques (did any of them know anything about ancient textiles? I think not any more than anyone in the STURP team did), she works with ancient textiles and weaving methods. They were given some photos to look at, Flury Lemberg worked on the actual cloth. I know which I prefer!!.","date":"2014-01-23","mins":"7:42 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74223","author":"charles_freeman","post":"P.S. Gabriel Vial also stressed with photos, the very wide variety in thicknesses in the yarn used on the Shroud, a point Hugh has also made. This means that one can hardly expect consistency in the Shroud’s weave anyway! There is no standard perfect Shroud weave against which any other part of the Shroud can be judged. (Photographs in his article ‘Le Linceul de Turin Etude Technique, CIETA Bulletin 67, 1989,pp.11 24.).","date":"2014-01-23","mins":"7:48 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74302","author":"charles_freeman","post":"Yes, the key point is that expert restorers/ reweavers would never have used cotton to repair linen when flax was equally available. So those who make a great play about the cotton either need to explain why they might have done so in this case or give an alternative explanation for its presence. If Raes was right about it coming in in ancient times in theiddle East then anywhere where we find cotton would be part of the original cloth. But perhaps he was not right in dating it to ancient times. Please can someone who supports the idea that the cotton is part of a reweave explain why it would have been used instead of flax!.","date":"2014-01-23","mins":"6:59 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74350","author":"charles_freeman","post":"Joe – so is only the cotton the reweave? You can’t have it both ways. If they decided to use cotton for the reweave instead of flax because it could be dyed then we can ascertain the exact extent of the reweaving from the cotton that has been found on the Shroud as by your argument no linen would have been used in the reweave because it would have been impossible to fit it in. If so the cotton would not have been in sufficient quantities to affect the radiocarbon date.Or was there a reweave using both linen and cotton if so you need to explain why they used both. I really would appreciate a direct reply from you or someone else as there is a crucial unresolved problem so far as the cotton enthusiasts are concerned. Thank you ..","date":"2014-01-24","mins":"3:42 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74360","author":"charles_freeman","post":"Well, I just don’t think there was ever a reweave and I side with Jackson, Flury Lemberg and, dare I say it, Wilson on this hence Hugh as well. I think the cotton is a chance contamination as there is no sigh of any thread despite some desperate attempts to find some. There is no evidence that the encrustations that Rogers spotted were dye that was his own unsupported speculation. I understand that the British Society for the Shroud does not take a pro or anti authenticity stance. So as an objective editor i am sure that Hugh will present and welcome papers from both sides of the debate in fact it would be betraying the aim of the society not to take sides if he did otherwise. It looks as if he will be able to commission some very interesting articles that will move some of these sterile debates on. Good luck to him.","date":"2014-01-24","mins":"5:18 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-51410","author":"charles_freeman","post":"The Vatican will want to show itself independent and unlikely to respond to demands for specific tests proposed by outsiders. If it wants to keep to the idea that what the Shroud is is purely a scientific matter, it will presumably farm it out to a laboratory that has high scientific credibility. It is clear that even if that lab came up with a radiocarbon date of 1350 and unambiguous evidence that there was no blood on the Shroud but there were pigments that showed that the image had been painted there would still be some people who would not accept that. But why should the Vatican bother about that? They would gain much more from being shown to be open to science and ready to accept that nothing in Catholicism depends on the Shroud, or any other relic, being authentic. That would fit with the new Francis persona. And if the tests did come up with a first century result they would not lose anything either. The important requirement is that the lab that does the testing is known to be as good as one can find so that the wider world of science respects the result and the Church can reap the benefits of being seen to be open to the wider world..","date":"2013-11-15","mins":"5:14 am","url":"https://shroudstory.com/2013/11/14/colin-berry-is-writing-to-the-vatican/","cat":"carbon_14_dating","title":"Colin Berry is Writing to the Vatican"},{"id":"comment-74204","author":"charles_freeman","post":"Worth throwing these into the discussion in case they get overlooked. John Jackson, 2008: ‘While this hypothesis [the reweaving theory] has been argued on the basis of indirect chemistry [the Quad Mosaics?], it can be discounted on the basis of evident bandings in the 1978 radiographs and transmitted light images of STURP. These data photographs show clearly that the banding structures (which are in the Shroud) propagate in an uninterrupted fashion through the region that would, ten years later, be where the sample was taken for radiocarbon dating.’ In other words the undisturbed banding showed that this was the original cloth and had not been rewoven. Flury Lemberg, ‘The Invisible Mending of the Shroud, the Theory and the Reality’, 2005. Having argued in this paper that invisible reweaving was always detectable by the trained eye, in particular because it could not be concealed at the back of a cloth, Flury Lemberg noted that the fabric of the Shroud was in a good state of preservation and when she examined the corner where the radiocarbon sample had been taken, she reported that ‘its weaving structure is cohesive and untouched even at the corners. Therefore at no time has the need to reinforce the corner parts arisen!’ Flury Lemberg concluded that ‘neither on the front nor on the back of the whole cloth is the slightest hint of a mending operation, a patch or some kind of reinforcing darning to be found.’ If Lyfe is right in saying that Wilson also rejects the reweaving theory then there is a lot of evidence against it, among the authenticists as well as sceptics. Hugh seems in good company..","date":"2014-01-23","mins":"4:02 am","url":"https://shroudstory.com/2014/01/22/comment-promoted-clarifying-details-on-the-reweave-theory-development/","cat":"carbon_14_dating","title":"Comment Promoted:  Clarifying Details on the Reweave Theory Development"},{"id":"comment-75909","author":"charles_freeman","post":"David is right. I am often reviewed by anonymous reviewers. I have discovered unofficially one or two of them (never from the press/editor that commissioned them) and it is often a surprise to find out who they are. On one book I have one peer reviewer saying ‘this book must be published’ and another saying ‘it will be a waste of time publishing this book’. Luckily the first prevailed and the book has been quite successful! I did get one reviewer who said he would be happy to be identified and he provided an endorsement! But, as I am sure Benford and Marino will have quickly realised, rightly or wrongly, specialist journals do expect you to show that you have some academic background in the subject on which you submit an article. The better journals have more than enough articles by specialists clamouring to be included, especially in the UK where the list of publications is used to assess university departments..","date":"2014-02-02","mins":"5:28 am","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?"},{"id":"comment-87280","author":"charles_freeman","post":"‘in 1978 STURP searched and found no other significant cotton elsewhere’. Daveb – do you have a reference for that? It seems to be stated as such by Rogers without any reference but perhaps it is in the Physics and Chemistry of the Shroud article somewhere. STURP only had the samples the team took back to the US and if, as Rogers seems to argue, the cotton was embedded in the main weave of the Shroud and then dyed, there is no reason why any cotton should have got onto the STURP samples or, if so, only by chance. Did STURP have time to look specifically for cotton on the rest of the Shroud in 1978? If not where does this statement about a search come from?.","date":"2014-03-11","mins":"5:14 am","url":"https://shroudstory.com/2014/03/09/comment-promoted-on-the-hacking-hypothesis/","cat":"carbon_14_dating","title":"Comment Promoted:  On the Hacking Hypothesis"},{"id":"comment-75912","author":"charles_freeman","post":"STURP never pretended to have an expert on radio carbon dating on their books ,any more than they claimed to have an historian of relic cults or a specialist in ancient weaving. On what grounds should they have been included when there was a specific job requiring specialist knowledge that none of them pretended to have? I fail to see what they would have added as Hugh says where would STURP have taken the sample from? After all, the relationship that STURP had was with the Savoys owners, there was no reason why this relationship should have been transferred to the new owners, the Vatican. I was taken to task in this blog for saying that STURP existed after 1981, so what was STURP’s status in 1988? They still seem to be around in some form for this year’s coming conferences. I agree with High that the STURP members were not religious fanatics ( although Rogers apparently claimed, i think in Gove’s book, that some of them were) it was just that they had limited specialist skills when one takes the Shroud as a whole..","date":"2014-02-02","mins":"5:35 am","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?"},{"id":"comment-75899","author":"charles_freeman","post":"From what I have read of Benford and Marino’s papers, it would seem more appropriate that they should have been submitted to a journal specialising in ancient textiles/ weaving, such as the Bulletin of CIETA, and there are others ( there seems to be quite a coterie of those involved in ancient weaving techniques with journals/ newsletters ,etc.). I have never seen anything in what they have written that deals directly with radiocarbon techniques as such but rather with weaving which is a different specialist area. Obviously to be taken up by a specialist journal, Benford and Marino would have been expected to show some specialist knowledge of their subject. It would perhaps have been easier if they had found another co author, someone who had specialised in reweaving techniques, for instance, who could give them credibility in this area..","date":"2014-02-02","mins":"4:21 am","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?"},{"id":"comment-127937","author":"charles_freeman","post":"I think that there was a paper by someone called Faccini that was delivered at one of the conferences that suggested three different kinds of scourge marks.No doubt someone can provide the link. BTW I was at a medieval conference on Saturday and the afternoon papers were billed as half an hour long, as in the St.Louis Conference. The very first paper was 45 minutes and this threw things out! There will have to be some very strict cutting off of speakers at St.Louis especially if there is to be time for questions. Yet, some of the Abstracts seems almost half an hour long in themselves!.","date":"2014-06-09","mins":"6:34 am","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","title":"Conspiracy Theory Part 4"},{"id":"comment-38286","author":"charles_freeman","post":"You need to read Maureen Fennell Mazzaoui’s The Italian Cotton Industry in the Later Middle Ages, Cambridge UP ,1981. Far from cotton being virtually unknown before 1350,the growing of cotton took off in the Po Valley in the twelfth century and by the end of the thirteenth the Italian cities were EXPORTING their cotton throughout much of Europe. This may have no relevance to research on the Shroud but native Italian cotton could have been added at any time from c.1100 Mazzaoui suggests (p.29) that the import of cotton plants in Italy may have been related to the Crusades and once imported there seems to have been a ‘phenomenal growth rate’, her words, in the early thirteenth century..","date":"2013-06-28","mins":"4:23 am","url":"https://shroudstory.com/2013/06/25/cotton/","cat":"carbon_14_dating","title":"Cotton"},{"id":"comment-59914","author":"charles_freeman","post":"The sentence before the one quoted by Benford and Marino ends ‘but the most demanding and successful technique was tapestry’. It then goes on with the sentence that begins ‘Tapestry woven coverlets. . . .’ This section seems to be about tapestries not linen weaves so perhaps one needs to take the point with caution. What is clear from this paragraph and the one before it is that the author of this chapter, John Peter Wild (Jenkins is only the editor of the whole volume), is talking of how clothing was enhanced by the selective application of colour but one cannot see the different colours of the Shroud today – perhaps they were clearer in the first century. Is there any other evidence of burial cloths being in banded colours? So far as one can see this paragraph is about coverlets, hangings and clothing. More work to be done here..","date":"2013-12-15","mins":"1:47 pm","url":"https://shroudstory.com/2013/12/15/disappearing-shaded-bands/","cat":"carbon_14_dating","title":"Disappearing Shaded Bands"},{"id":"comment-60784","author":"charles_freeman","post":"I still want to know how we know that the Shroud was bleached before or after the hanks of yarn were woven. I also don’t understand the references to dyes has anyone, other than Ray Rogers, argued that the Shroud was dyed as suggested above ‘ the banded dyed linen in the Shroud’. Normally linen is not dyed because the dye does not take. The more I read those posts the more I feel we are in desperate need of basic introductions. Eg. Here on bleaching and blending, by experts who have had nothing to do with the Shroud. I may be the ‘supposedly educated man’ referred to above but I happily confess to knowing nothing about how ‘different methods of bleaching might leave different artifacts of one kind or another’. I just don’t feel awkward about admitting my ignorance..","date":"2013-12-17","mins":"6:41 am","url":"https://shroudstory.com/2013/12/15/disappearing-shaded-bands/","cat":"carbon_14_dating","title":"Disappearing Shaded Bands"},{"id":"comment-60119","author":"charles_freeman","post":"No because, as I understand it, bleaching seems to have been done at times during the long history of linen ( since 6,000 BC), to make the linen look whiter, especially when the flax was dark. I don’t think it went in phases, now we bleach, now we don’t..","date":"2013-12-16","mins":"3:39 am","url":"https://shroudstory.com/2013/12/15/disappearing-shaded-bands/","cat":"carbon_14_dating","title":"Disappearing Shaded Bands"},{"id":"comment-60476","author":"charles_freeman","post":"John. I simply do not know other than that, as I said, bleaching was done , and is still done today, to make linen whiter. Of course, it makes a difference – the linen becomes whiter!! I don’t known what you mean by ‘an ancient pre medieval bleaching process’. I think everyone will be helped if you can explain this and also explain how the bleaching on the Shroud differs from, say, ‘ a medieval bleaching process’. I am happy to confess ignorance because I know nothing about different bleaching methods at different times of history. If you can point to an authority on this it would be helpful. I assume from what you say that STURP found remains of the bleach but as I am not a chemist I am not sure exactly what the signs of this would be. I hope Hugh is noting all these discussions so that he can draw up a list of issues that none of us know much about so that he can commission experts to write about them for his Newsletter!.","date":"2013-12-16","mins":"4:31 pm","url":"https://shroudstory.com/2013/12/15/disappearing-shaded-bands/","cat":"carbon_14_dating","title":"Disappearing Shaded Bands"},{"id":"comment-122643","author":"charles_freeman","post":"On the frequency of the expositions the key text is Beldon Scott’s Architecture for the Shroud. I haven’t a copy with me at the moment but it lists the known expositions by century after 1578. The peak was the seventeenth century, possibly sixty expositions and maybe even more. By the nineteenth century expositions were rare, only three I think between 1842 and 1898. I am surprised this book is not referred to more often as it has a much fuller history of the Shroud than I have seen anywhere else. Beldon Scott says he is neutral on the authenticity – he is more interested in the use of the Shroud for display/ propaganda purposes..","date":"2014-05-21","mins":"10:54 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"id":"comment-122207","author":"charles_freeman","post":"From the fourth century, it was believed that one piece of a relic had the power of the whole so we find bishop Ambrose of Milan, for instance, freely giving out pieces of relics and this became common practice. No reason why the Shroud should have been immune and it is clear that rectangular pieces taken from the corners of the Shroud (c.1530?) were not replaced. There were thousands of relics looted from the ‘heretical’ Greeks in 1204 and the pope (Innocent III) could do nothing about it. They were settled throughout Europe without any problems. The Shroud was exhibited perhaps fifty or sixty times in the seventeenth century, when the cult of the Shroud reached its peak, so it would be likely that there would be some repairs needed where the linen was held by the priests. The depictions of the expositions suggest that by 1868 they were no longer unfolding it In public I am still waiting for anyone who has examined the Shroud close up to tell me where the reweaving actually took place. It seems very hard to find it!.","date":"2014-05-20","mins":"4:02 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"id":"comment-210136","author":"charles_freeman","post":"Hugh, have you got a copy of the 1989 CIETA Bulletin with the article by Vial? He points out several places where the weaver made a mistake. It is presumably easy to do ( to make the mistake and for a professional textile expert to spot it!). It is an important article based on his looking at the cloth during the 1988 selection of the sample. For me the most interesting point is the considerable variation in the thickness of the threads he has a photograph illustrating this. This meant that there would never be an even weave..","date":"2015-09-11","mins":"1:40 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209752","author":"charles_freeman","post":"Surely the fundamental point is that Flury Lemberg examined the suspect corner of the Shroud in 2002 and could not see any reweaving. Neither has any other textile specialist who has actually examined the weave for reweaving. The discrepancies in the widths of the threads noted and photographed by Vial in 1988 and published by him in his CIETA paper of 1989 account for some of the irregularities in the weave. You need to start from what you can actually see on the Shroud,not from some threads. This is the fundamental flaw in Rogers’ approach. End of story. Gove describes the arrival of the Gonella threads to be handed to Rogers and notes that Rogers did not know whether they were actually from the Shroud or not. I cannot give the page ref .now as I have been in St.Maximin in Provence today viewing the skull of Mary Magdalene..","date":"2015-09-06","mins":"1:16 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-208917","author":"charles_freeman","post":"If you don’t have professional qualifications, you can’t be listened to, if you do have relevant professional qualifications you speak garbage anyway, so the debate is frozen and the Shroudies continue to be isolated from any new ideas of whatever relevance or quality. The rest of us , in touch with wider academic thought on painted linens, medieval weaves,etc, just get on with things! No need to share our findings here as they won’t be listened to !.","date":"2015-08-25","mins":"3:31 am","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","title":"Food for Thought: An Important Paper on Radiocarbon Dating"},{"id":"comment-209759","author":"charles_freeman","post":"Thanks, Giorgio. It is clear that the troubled relationships/ rivalries between various individuals and the immense problems of assessing the provenance of the threads makes the foundations of Rogers’ research very unsatisfactory. At the most Rogers put forward some hypotheses that could be supported or refuted by an actually examination of the Shroud weave itself. Flury Lemberg specifically refuted them no reweave could be seen. I leave the discussion over what could or could not be seen on the threads that Rogers had accumulated from wherever and whoever to those with the relevant scientific qualifications. Once again, end of story..","date":"2015-09-06","mins":"3:51 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-135591","author":"charles_freeman","post":"Since from the 1390s to this day the Church has accepted and supported the display of the shroud as an object of veneration and so had never pronounced anything that is incompatible with a date in the fourteenth century, what would it lose in credibility by the KGB faking the date? Linick was obviously a wizard programmer if he could insert a programme in both Oxford and Zurich which could pick out the Shroud even before the sample had been chosen. If Jones’ naming and shaming was not so blatant, distasteful and unwarranted, this would be a highly entertaining blog for those who enjoy sci fi..","date":"2014-07-06","mins":"3:40 am","url":"https://shroudstory.com/2014/07/05/stephen-jones-continues-his-computer-hacking-conspiracy-theory/","cat":"conspiracy_theory","title":"Stephen Jones  Continues his Computer Hacking Conspiracy Theory"},{"id":"comment-135493","author":"charles_freeman","post":"In so far as he is addressing the integrity of Ramsey and and Jull, Stephen Jones is making claims that are potentially libellous. I think his ideas are so crack – pot that they won’t be taken seriously by anyone but one can get into trouble, in UK law at least, by repeating libels. The sample switching hypothesis was equally crack pot ( honest opinion so not libellous) so it is not surprising that the reputation of Tite was not affected by it..","date":"2014-07-05","mins":"11:14 am","url":"https://shroudstory.com/2014/07/05/stephen-jones-continues-his-computer-hacking-conspiracy-theory/","cat":"conspiracy_theory","title":"Stephen Jones  Continues his Computer Hacking Conspiracy Theory"},{"id":"comment-129038","author":"charles_freeman","post":"Or just as likely he misread 1235 for 1325 and he was just about on target..","date":"2014-06-13","mins":"5:32 am","url":"https://shroudstory.com/2014/06/13/the-beat-goes-on/","cat":"hacking","title":"The Beat Goes On"},{"id":"comment-129033","author":"charles_freeman","post":"I think the easiest explanation is that there were three hackers who had all been told by the KGB to aim for 1325 but the Oxford one made a mess of it and didn’t get the right date..","date":"2014-06-13","mins":"5:10 am","url":"https://shroudstory.com/2014/06/13/the-beat-goes-on/","cat":"hacking","title":"The Beat Goes On"},{"id":"comment-204843","author":"charles_freeman","post":"Please note that my hypothesis is that the original images on the Shroud were painted but the paint disintegrated as it did in the vast majority of painted linens. This appears from depictions of the Shroud to have taken place in the nineteenth century when, for the first time in 1868, the Shroud had to be placed in a frame as well as the images being shown, in alithograph of this same exposition to be partially faded the frontal image from the shoulders down.. What we have left, under the remnants of gesso calcium carbonate as discovered by STURP is the discoloration of the surface of the linen after centuries of being underneath the paint and gesso. This original thickness of the pigments inevitably discoloured the linen in different shades that gives the impression of a three dimensional image. So please no repetition of I think it IS a painting. Rather I think it WAS a painting..","date":"2015-07-07","mins":"8:30 am","url":"https://shroudstory.com/2015/07/07/the-hacking-of-the-carbon-dating-wikipedia-and-the-media/","cat":"conspiracy_theory","title":"The Hacking of the Carbon Dating, Wikipedia and the Media"},{"id":"comment-215981","author":"charles_freeman","post":"It should be fairly easy to see if the dye has only been applied to the cotton. First pick out the cotton from the linen not a very difficult task if it was used in a reweave and then see if the extent of the dye can be linked to it. . . . ( I don’t see why the invisible weavers would have used cotton for the reweave that they would then have had to dye who not repatch with linen and dye that? but this is not my subject I prefer to keep to documented relic routes!)..","date":"2015-12-09","mins":"7:26 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216020","author":"charles_freeman","post":"Was there any dye on the cotton fibres found on the Oxford and Arizona samples? I have never read that there was. I wish that someone would actually reproduce what they think t He Shroud sample is made up of, how much cotton, how much linen, whether this was original or added, what was dyed or coloured, the whole sample or just part of it, and then set out a scenario which brings us to the carbon date which, for those who think the Shroud is first century, needs quite a difficult combination of textiles of different dates to arrive at. Anyone prepared to have a go? ..","date":"2015-12-09","mins":"11:39 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216021","author":"charles_freeman","post":"P.s. Has anyone related the ‘frosty’ surface to the presence of calcium carbonate found by STURP ?.","date":"2015-12-09","mins":"11:41 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216425","author":"charles_freeman","post":"I can’t understand how the three labs and Donna Campbell missed all this dyed cotton.","date":"2015-12-13","mins":"5:15 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216457","author":"charles_freeman","post":"Hugh. Do you mean’would be clearly visible’ And the aragonite/ calcium carbonate/ gesso scenario looks very promising as a subject for further research..","date":"2015-12-14","mins":"2:23 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216472","author":"charles_freeman","post":"And the V and A have the only other known three in one herringbone weave in linen dated to the fourteenth century, but you have to make special arrangements to visit it in a store. My wife worked in the textile department at the V And A some years ago but it is quite difficult to get the expert opinion you want. Still you can e mail them and sometime you come across a respondent is really helpful, other times you don’t even get a reply. The Metropolitan Museum in New York have also worked on medieval painted linens. You have to search around for info. Although Archetype Publications in the UK have relevant but expensive titles. I gave an introductory talk on painted linens the other day to a medieval historic churches group and someone suggested I write on book on them. No hope! You need to be able to mix the disciplines of art history, medieval displays ,church liturgies and the way linens were used in churches, and scientific understanding of sealants, pigments and gessoes to get anywhere productive and I am not qualified to do that!.","date":"2015-12-14","mins":"7:59 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216470","author":"charles_freeman","post":"Yes, I wanted to clarify what you said no invisible reweaving. End of story, or it should be but it won’t be! The more you read about gesso and primers the more clearly is that the variety of sealants on linens before they were painted is considerable, depending,I suppose ,on what was available. I did understand Cennini to mean that you expertly applied a very thin layer of gesso, left after scraping, so as to maintain flexibility. Everyone acknowledged the precarious nature of painted linens which is why they were so cheap inventories show that they were valued at about one twentieth to one tenth of a similarly painted wooden panel but you can’t fly a panel and a cloth was easier to carry about. In many recorded cases, of course, the linens represented a cheap way of getting something for a specific one off ceremony where long term durability did not matter. As I have continually said, we need an expert on these linens to get involved. Many studies of banners ( flexible ones) do mention various forms of sealant so that we know if happened and the ingredients of some have been analysed. The question is whether we can relate the aragonite , the calcium( carbonate?) , to a sealant of some kind. The suggestion that the calcium was found across the whole cloth including non image areas is suggestive of some overall sealant, and this might provide the base for the images that we see so clearly in depictions of the Shroud especially after 1578 when visibility from afar was such an important part of getting the crowds in. ( See Beldon Scott on displaying the Shroud.) So long as no one else can provide any kind of other explanation for the images , I am sticking in this area as it seems the most probable explanation and ,as I have said numerous times before, I expect we will get some further support or dismissal within the next few years. Just off to California to see my son. David Sox had been in touch wanting to meet but he is away just the week I am there!.","date":"2015-12-14","mins":"7:06 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-75918","author":"charles_freeman","post":"Medieval relics are often contemporary with what they are supposed to be and very often genuine. Thomas Becket’s body was kept in Canterbury cathedral where we his was murdered and therefore we can be sure that his bones, until they were destroyed at the Reformation, were genuine. It’s the relics that claim to come from before 1000 AD that are the difficult ones! There are some intriguing cases where bones supposed to have been of Christian martyrs are actually found to be pre Christian Fanti’s dating of the Shroud(by one of his methods) to many years before Christ is surely within this genre. Was it Carsten Thiede who claimed to have found an early manuscript of St. Matthew’s Gospel that he dated with reference to a manuscript found at Herculaneum to the 60s AD (Vesuvius eruption AD 79). Experts in this field soon told him that the manuscript in question was convincingly dated to the first century BC and so, if he was right that the scripts matched, he had truly beaten the field in having a Christian gospel that dated from before Christ!.","date":"2014-02-02","mins":"6:21 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-75989","author":"charles_freeman","post":"There are a few cases from Coptic Egypt where the Belgian Royal Institute for Cultural Heritage (IRPA/KIK) reviewed the radiocarbon dates from 400 textiles and found problems with one per cent of them. so I suppose three or four of the 400. The only one the report gave as an example of rejection was one where two radiocarbon dates were 285 years apart and this was considered unacceptable. The sample was retested and a third date was finally considered acceptable ( some of the textiles were dated from the archaeological context in which they were found ).(This helps answer OK’s question.) There has also been a lot of retesting of material from Tell el Dab’a (the ancient Avaris) in Egypt. This is because of discrepancies of a hundred years that have arisen in attempting to date the eruption on the island of Thera (Santorini) that other dating methods date to c 1628 BC but some material at Avaris believed to be associated with the eruption carbon dated to c. 1500 BC.More recent tests apparently show that the radio carbon was perhaps out a hundred years in 3600 3500 years but there have been problems with some of these older dates anyway. There are genuine problems areas peat is one because samples can easily be mixed and it is difficult to unsort later peat that has become mixed with older peat. My limited experience of being on digs,many years ago, where samples were being elected for carbon dating is that one made very sure that samples were original/ uncontaminated before they were sent off to an expensive lab. I can’t ever remember that more than one sample was sent from a single artefact – the trick, as the effort to select the Shroud sample showed, was to get it right the first time. Cloth , as in the Coptic examples, is easier than peat to spot problems in because later material or material of a different textile can easily be spotted under a microscope and so one can be much surer than one has an original sample. And textiles are easier to clean from contamination than peat! This probably explains why the Coptic examples (mostly AD 400 1000) have proved so accurate. The discrepancies tend to be in the order of a few percentage point the discrepancy argued for the Shroud is way outside this – we are hardly dealing with the conventional and well known minor, but important, discrepancies of a hundred or two hundred years discussed above..","date":"2014-02-02","mins":"11:39 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-75990","author":"charles_freeman","post":"Yes, these discrepancies do arise (see my earlier posting) but how can you be sure that the sample was of these two martyrs who may have been mythical anyway? The report I have read on them simply assumed that the myth of the martyrs attached to some old bones..","date":"2014-02-02","mins":"11:42 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76172","author":"charles_freeman","post":"‘Just ducking in but to those worshipers at the altar of Zurich, Oxford and Arizona carbon results, your god is dead. It’s about time you figured it out. I will point out just how despicable they were when I publish. By most ethical standards it was IN FACT corrupt.’ A word to the wise. Just make sure you understand how UK libel law works before you publish here, John. It could be expensive as the onus will be on you to prove your case..","date":"2014-02-03","mins":"7:52 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-75939","author":"charles_freeman","post":"O.K. One case that is well known is the third century AD martyrs Felix and Regula whose purported bones (in Zurich, I think) dated from 50 BC. I can’t say I am really surprised, the relic world was full of old bits and pieces that were ancient and to which legends attached although usually testing shows them to be much later rather than earlier than the date they are supposed to be..","date":"2014-02-02","mins":"8:09 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76412","author":"charles_freeman","post":"‘Since I have now been threatened for libel for something..’ ‘Also, because the Shroud is a matter of pyblic issues and I believe the particpants in the carbon dating were public figures there is a requirement of proving malice. It can be done.’ No one is threatening you for libel, John. It is only that the way you express yourself about other people looks like you might write something libellous and wiser souls than you are warning you to concentrate on the actual issues not the personalities. Actually I don’t think anyone is going to take you seriously enough to bother to take you to the courts – I now see Hugh has made the same point. It is simply am unpleasant way to conduct an academic debate..","date":"2014-02-04","mins":"6:16 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76413","author":"charles_freeman","post":"John : ‘Otherwise, I have no time for fools, whatevr their acade=mic qualifications. Oops. It is it libel to call a fool a fool the UK.’ I doubt it, but it may make you look all the more ridiculous as this debate goes on..","date":"2014-02-04","mins":"6:18 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76471","author":"charles_freeman","post":"‘fraud to contradict the conclusions established in favour of the authenticity of the shroud during the course of all the preceeding research.” ” All the proceeding research”??? I thought that the 1976 enquiry came out against authenticity and certainly STURP have never pretended to have established it. Anyone able to fill us in on what ‘all’ this research actually is?.","date":"2014-02-04","mins":"9:43 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76533","author":"charles_freeman","post":"‘I would say that STURP’s “conclusions established in favour of the authenticity of the shroud” was more in the sense that they didn’t find any concrete evidence that it was a medieval forgery’ But there may yet be such evidence so this is hardly conclusive in favour of authenticity we need some actual solid first century evidence that builds up a case for authenticity and that ,so far, has not been found. The evidence is largely circumstantial. I stick with my question about ‘all proceeding research’..","date":"2014-02-04","mins":"1:45 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76682","author":"charles_freeman","post":"“This kind of weave was special in antiquity because it denoted an extraordinary quality,” she says. (Less fine linens of the first century would have had a one to one herringbone pattern). ” Yes, Flury Lemberg is quite right but what she does not add is that no example is known from pre 250 AD. The relevant article on 3/1 is Daniel De Jonghe ‘From the Roman horizontal loom to the 3/1 twill damask loom of the early medieval period’, in Penelope Walton Rogers, et.al. (eds.) The Roman Textile Industry and its Influence, Oxford, 2001, pp. 137 147. The Masada stitch has been explored extensively in these posts and shown to be ,in fact, a common stitch used even up to this day, even by my wife when she was a theatre costume designer and used the same stitch to put together different materials. Wilson was thoroughly misleading on this, perhaps because he has never done any sewing!.","date":"2014-02-05","mins":"4:25 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76759","author":"charles_freeman","post":"‘The point is they had the technology for complex weaves.’ No one doubts that just look at the complexity of the Ramesses Girdle now in Liverpool. We are looking for examples of a specific 3/1 weave and, as yet, no others exist before about 250 and these in silk damask, other than apparently one workshop making 3/1 tunics in Egypt in the second century AD. It amazes me that people who claim to know so much about the Shroud have not done any wider reading on the issues but seem to recycle a number of ambiguous comments again and again. ‘Possibly Mrs Charles Freeman is relying on a sketch from Ian Wilson, which perhaps does not adequately convey the features that Mme FL seems to have observed.’ No, she looked at photocopies from the excavation reports after I had checked out from F L’s comments which was the right stitch.Having seen the mess up Ian Wilson made of reproducing the Della Rovere depiction of the body of Christ , even getting the arms the wrong way round, and his interpretation of the tetradiplon folds that show a cloth folded in double only three, not four, times, I would not work from him but rather the original work of professionals..","date":"2014-02-05","mins":"11:40 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76788","author":"charles_freeman","post":"Louis,I have not seen them but the V and A references are apparently ‘7027 1860’, ‘8615 1863’. It seems quite difficult to find out more although you should be able to make an enquiry to the textile department. I got one answer on a completely different topic when one of their staff gave me a list of articles of the medieval textile trade..","date":"2014-02-05","mins":"2:26 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76809","author":"charles_freeman","post":"‘If indeed Charles is correct in asserting that there are no other 3:1 twill weaves in the Middle East before 250 AD,’ I only said that there were no SURVIVING examples but ,as I understand it, there is concurrent evidence that the looms able to make 3/1 were a later development..","date":"2014-02-05","mins":"4:06 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76950","author":"charles_freeman","post":"Louis. No, and as we have already discussed in an earlier posting, a Z twist for the yarn does suggest that the yarn was spun in Europe rather than the east, a tradition that continued well into the Middle Ages. One must remember that the end of the first century BC and the first century AD were an age of enormous expansion of trade after things had settled after the civil wars. Then there was the spread of Roman officials, legions ,etc. The excavators at Masada found Z spun threads that they assume came in with Roman soldiers from Europe (the weaves of these also correlated with European examples). But this is all assuming that the Shroud is authentic, starting from there and THEN trying to fill in all the problems that arise from that..","date":"2014-02-06","mins":"4:58 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-174576","author":"charles_freeman","post":"Coyne does not stick to my hypothesis. He continues to refer to the Shroud is a fake while my argument has always been that it was never intended to deceive anyone but was used in the Easter ceremonies and, as such, would have been treated with great reverence. No forger would ever have produced a cloth with images on it when there was no reference to such images being on the grave clothes in the tomb. What other people later made of the Shroud is and continues to be another story..","date":"2014-12-04","mins":"2:27 am","url":"https://shroudstory.com/2014/12/03/jerry-coyne-pope-francis-endorses-the-fake-shroud-of-turin/","cat":"carbon_14_dating","title":"Jerry Coyne:  Pope Francis endorses the fake Shroud of Turin"},{"id":"comment-48744","author":"charles_freeman","post":"Interestingly there is just a case involving the dating of the eruption on the island of Thera. Initially, radiocarbon dates from Egypt that seemed to reflect the layer of destruction came up with c. 1500 BC. Then a number of other tests, evidence from tree rings, etc., came up with the 1620s BC and corelated well with each other. Now some of the Egyptian tests are being redone and, as I understand it, the material is also being redated to the late seventeenth century. So it seems that the initial radiocarbon dates were out by a hundred or so years over 3,600 years. A recent study by the Belgian Royal Institute for Cultural heritage ( IRPA/KIK) analysed the radiocarbon dates of some four hundred Coptic textiles from before AD 1000 and considered that about one per cent of the dates were untrustworthy..","date":"2013-10-26","mins":"4:47 am","url":"https://shroudstory.com/2013/10/23/jones-none-of-the-three-laboratories-dated-its-sample-to-between-1260-and-1390/","cat":"carbon_14_dating","title":"Jones:  “none of the three laboratories dated its sample to between 1260 and 1390”"},{"id":"comment-178957","author":"charles_freeman","post":"Do we know whether ‘Rome’ or ‘Turin’ has formally rejected the carbon dating? As late as 2000 Gonella was vigorously defending it (in the published proceedings of the Shroud Conference of that year in Turin). I can’t imagine that Gonella would have gone into print having made such a vigorous defence of the dating without asking someone higher up in Turin. It is important to get this right. I have never found any evidence of any formal repudiation or are you suggesting that Rome /Turin have simply, unwilling to back Gonella, not made any formal acceptance of it. Lindow man is not a valid comparison. ‘ He’ was one of those peat contaminations, a well known class of its own as peat is so vulnerable to disturbance – completely different from a textile that has been microscopically examined to identify and remove an errant cotton fibre (Oxford) and then cleaned before testing..","date":"2014-12-24","mins":"1:16 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","title":"Just Published:  What Went Wrong with the Radiocarbon Date?"},{"id":"comment-179074","author":"charles_freeman","post":"Well, as you may know, Joe, I don’t think it was ever intended to be a fake but to be part of the Easter ceremonies celebrating the Risen Christ and venerated as such from the day it was made. Like so many other objects of veneration it gained added significance in the eyes of some with time. The Church is simply continuing a traditions of seven centuries of veneration even since Clement VII recognised that a pilgrimage to see an exposition deserved an indulgence ( (1390). As the Church made clear then and still does, this does not make it authentic but rather a means of meditating on the Passion of Christ. Whether individual members of the Church regard it as authentic is another matter. Have a peaceful Christmas..","date":"2014-12-25","mins":"3:02 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","title":"Just Published:  What Went Wrong with the Radiocarbon Date?"},{"id":"comment-16443","author":"charles_freeman","post":"Vivine. So how do you rate (or did Currie rate) the textile expert Mechthild Flury Lemberg’s rejection of Ray Roger’s, and others,’reweaving’ theory based on her own meticulous examination of the cloth? There are two reasons for placing her credibility higher than Rogers. 1) Textiles were her specialist field. 2) She was able to examine the shroud as a whole and would have spotted the reweaving if there had been. The quotations below are from her article that can easily be accessed on the British Society for the Turin website, Issue No.65, pp 10 27. ‘The theory that repairs had been done to the corner areas in the Middle Ages, unfortunately is based on a false presupposition. The necessity of repairs to the corners has been postulated without ever examining the need for it. The real reason for the theory has been the desire to find a plausible explanation for the unsatisfying result of the carbon 14 analysis. Similar wishes, although understandable, have lead all too often in the history of the shroud to untenable theories. . . . Though the Turin shroud is burdened with the dust of centuries and with greasy dirt deposits on the corners its weaving structure is cohesive and untouched even at the corners. Therefore at no time has the need to reinforce the corner parts arisen!. . . Equally lacking any trace of evidence on the shroud is the hypothesis that a patch fixed onto the same minute spot which had been removed as a sample has falsified the result of the analysis. Where exactly had the patch been attached? How big was it? Was it so small that it covered only the sample area? Answers to these questions are lacking in the hypothesis of Benford/Marino and Rogers. They can only be given in a competent way by textile experts. One of them, who was present when the sample was taken, the late Gabriel Vial, confirmed repeatedly that the sample was taken from the original cloth! This affirmation seems to be unacceptable to a natural scientist [I assume she means Rogers et.al.] even if it comes from such an excellent textile scholar as Gabriel Vial who moreover made this judgment in his very own field of expertise.’.","date":"2012-09-18","mins":"5:35 am","url":"https://shroudstory.com/2008/08/19/los-alamos-national-laboratory-team-of-nine-scientists-prove-carbon-14-dating-of-the-shroud-of-turin-wrong/","cat":"carbon_14_dating","title":"Los Alamos National Laboratory team of nine scientists prove carbon 14 dating of the Shroud of Turin wrong"},{"id":"comment-195249","author":"charles_freeman","post":"Yes, Hugh, you are being far too generous but I am not criticising you as I know that if you, as a scientist which I am not, ever finds a single piece of scientific evidence that dates the Shroud to before AD1000 you will report it. Until then, those of us whose interest lies in the wider world of medieval relic cults will concentrate on finding the medieval contexts in which the Shroud originated..","date":"2015-04-03","mins":"5:23 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-195262","author":"charles_freeman","post":"John. I have accessed your article but please tell me where I cited, eight times, the quotation from Flury Lemberg that you say I quoted.I amy well have done at some point but i think not. If you cannot, please remove your comment. It is the 2007 paper of Flury Lemberg that i have cited which shows clearly that unless the radio carbon sample was taken from exactly the same piece of cloth as an apparent reweave, there is/was no reweave. John Jackson confirmed with photographs of the bandings made in 1978 that there was no reweave as if there was it would have disrupted the bandings. Have you cited the 2007 article? If not you are providing a misleading picture of the whole controversy as you are depriving your readers of evidence from a textile expert who has examined the Shroud close up. This puts her streets ahead of non experts who have not been able to check out the actual weave.This is the way we historians work. Lawyers may have different criteria. I have no problem with the existence of Jesus, or his crucifixion and burial in a shroud of some kind. So there was originally a mass of objects associated with the Passion. The question is whether any of these have happened to survive. It is not impossible but we must have clear scientific evidence of a pre AD 35 dating before we take any of the many hundreds of Passion relics as authentic. In my recent research in Italy, i was shown a fragment of the True Cross it had only been in the church since 1500 true or false? In a room in a former monastery I was asked to keep silent because it contained relics of the Virgin Mary true or false? In Lucca they have the Volto Santo, a wooden cross carved by no less than Nicodemus. He fell asleep and the face of Christ appeared miraculously on it it is honoured by a vast candle lit procession every year in September, true or false? In Prato they have the girdle that the Virgin Mary threw down to Thomas as she was assumed into heaven true or false? We await scientific evidence to support the authenticity of any of these or the many hundreds of other Passion relics..","date":"2015-04-03","mins":"7:39 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-195285","author":"charles_freeman","post":"Max. You ignore John Jackson’s clear rejection of the reweave theory from his photographic banding evidence of 1978. He was left with proposing a contamination theory, the presence of carbon monoxide, that was then checked out by Oxford and found wanting. I have no idea what his present position is but his rejection of the reweave is on the record. Flury Lemberg made the sensible point that if there is a reweave then where is it? She made clear that it would have been impossible to conceal even a so called invisible reweave, especially at the back of the cloth being rewoven. It is just possible that the experts who chose the sample just happened to cut neatly through the exact patch that had been rewoven and removed it, leaving no trace either side of the cut that there was any discrepancy. If the rewoven path had been wholly WITHIN the sample then it would have been noticed by the various microscopic investigations of the the labs. Methinks you should reread Flury Lemberg’s article more carefully or perhaps simply ignore it and hope no one notices..","date":"2015-04-03","mins":"12:00 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-195482","author":"charles_freeman","post":"John. In her article that you continue to ignore, Flury Lemberg sensibly asks where the reweave was. It clearly was not in the section that she examined that was left after the radiocarbon sample was removed or she and the other experts who examined the Shroud at this point would have spotted it.(And John Jackson specifically asserts that there was no reweaving from his own photographs of the banding.) So, leaving aside Jackson’s pre 1988 evidence for a moment, it must have been WITHIN the radiocarbon sample but no one has spotted it there.The only other alternative is that the sample team cut out the reweave section so cleverly that no one could see the original joins of old and new on either side of the cut. The basic point is that from Jackson onwards, no one has actually been able to spot and show with any kind of photographic evidence that there was a reweave. Even if there was one, which clearly there was not, there would be no reason why a fourteenth century weave might not have needed to be patched up in the sixteenth century. It is a logical absurdity to suggest that if there was a sixteenth century reweave it would necessarily have been of a first century cloth..","date":"2015-04-06","mins":"4:59 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-195618","author":"charles_freeman","post":"John. I am not interested in what Flury Lemberg did or did not say way back in 1986. I am interested in what she did say in 2007, after her close up examination of the Shroud, when she confirmed that there was no reweave in the area where the sample was taken from and she then asked the question: where was the reweave, how far did it extend,etc? No answer to her question has,so far as I know,ever come. Flury Lemberg does not need effusive praise from me she has got it from her colleagues in the world of ancient textiles (see Wikipedia biography). It is hard to imagine,how those who have read/seen the evidence of John Jackson from his own photographs of 1978, could argue that there was a reweave, so the onus is on you to show where it was. Perhaps you can start with Jackson’s 1978 photos of the banding and mark in where you can see the signs of the reweave. I cannot find any reference in Donna Campbell’s very careful examination that she saw any reweaving in the Oxford sample please quote where she did say that there was. Fibres are not enough reweaving is, by definition, about woven cloth, not fibres. The stitch issue was sorted out on this very blog where it was shown that the stitch in question is a common one used throughout history and to this day. I see absolutely no reason to believe that there ever was a reweave not a single expert who has dealt directly with the Shroud or woven samples from it has ever seen it. If they had we would have had a photograph of it by now..","date":"2015-04-07","mins":"10:37 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-192509","author":"charles_freeman","post":"Yes, confronted by John Klotz, Goodacre will presumably very easily find a number of experts in radio carbon dating who will tell him that there is no reason to doubt the dating (as I have they are around). He will no doubt ask which of the critics of the dating who have confronted him have similar expertise. I can’t imagine that no one will refer him to the paper of Flury Lemberg which refutes Rogers after her close up examination of this corner of the Shroud, something never achieved by Marino or Benford. Anyway no harm in John in trying..","date":"2015-03-05","mins":"10:46 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-192535","author":"charles_freeman","post":"No, not without their express permission but if Goodacre wants to find them, it would not be difficult. I suspect, in fact, that he would not have been ready to go public in this way without having consulted experts already and as someone with an academic reputation to defend he would have trod carefully before making such a coherent response. With the failure of Flury Lemberg and every other expert who has examined the Shroud close up to find any reweaving and with the total failure of anyone to be able to provide evidence of contamination remaining in sufficient quantities after the cleaning process, the presumption that the carbon 14 dating is correct remains in place. This is what he will be told and as the responses even on this site to John Klotz show, Klotz’s own ‘evidence’ is in itself hardly likely to,convince him otherwise..","date":"2015-03-05","mins":"1:13 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-192537","author":"charles_freeman","post":"No, surely he is simply saying what the mainstream academic opinion among the radio carbon community is on this issue. I am assuming that he consulted members of this community, some of whom are fully aware of the controversy but have not been convinced by the opponents of the dating. Does anyone know an hands on expert in this field who does not believe the dating was correctly done? Surely Flury Lemberg showed convincingly that there was no reweaving in this area of the Shroud – and what was this massive contamination of?.","date":"2015-03-05","mins":"1:20 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-192558","author":"charles_freeman","post":"It is easily found online under Flury Lemberg ‘ The Invisible mending of the Shroud, the Theory and the Reality’. I think it is standard reading for those who want to know whether Rogers’ hypothesis is supported by an actual examination of the cloth which would have shown the reweaving if there had been any. Flury Lemberg seems to have had unanimous support from textile experts who have also had the chance to actually examine the Shroud. If Goodacre has not seen this article ,someone will soon put him onto it and he will surely privilege it above theories by people who have never examined the Shroud close up in this corner. There is also John Jackson’s dismissal of the reweaving on the grounds that the banding from his photographs continues uninterrupted through the so called rewoven patch. Goodacre will probably know these articles already but he will soon be put onto them if he has not already. So far as I know there has been no refutation of either in my experience they have simply been ignored by authenticists..","date":"2015-03-05","mins":"4:11 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-192593","author":"charles_freeman","post":"We are lucky with the Shroud as it still exists and there have been experts with direct access to it – such as Flury Lemberg in 2002 who have been able to compare the radio carbon section with the whole and find that Rogers’ hypothesis and any that involve reweaving do not stand up as she states clearly in the article I have quoted. She has expertise in textiles and direct access that Marino, Benford and Rogers ( in this instance) did not have so how would you challenge her?.","date":"2015-03-06","mins":"1:54 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193137","author":"charles_freeman","post":"Once you have sealed linen with gesso, but not before, you can have very precise details as you know the paint will not flow into the material. It stays on top of the gesso surface. We have some wonderful examples of painted linens where the details are as precise as here. Just look at some illuminated manuscripts from the medieval period and you will see the incredible detail in which artists of the period were able to work. I was talking to someone recently who reproduces illuminated manuscripts and there are techniques at no one is able to do nowadays. One should never underestimate a period where apprentices started at ten or twelve and often worked hour after hour year after year at some very specific skill. For instance, some craftsmen apparently did nothing but apply gesso to textiles before they were painted on..","date":"2015-03-11","mins":"1:49 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-48616","author":"charles_freeman","post":"John Klotz. “The pseudo skeptic. That is someone who claims to be seeking the truth, but is really seeking instead to prove his or her own prejudgment.’ I agree with John (yes,agreement!) that such people exist but it seems to me that you find them across the spectrum of Shroud studies. They are easy to spot because whenever anyone puts in material that challenges them, they get a bit hot under the collar. If the Shroud was put into a top conservation laboratory, such as that in the Metropolitan Museum, New York or, if it is still running, Florence (set up after the 1966 floods), most of its ‘secrets’ would be revealed, or at least the problems clarified, in a couple of weeks with technology that is streets ahead of anything known in 1978 or 1988. Until then we are dealing with a lot of ambiguous evidence much of it produced by people who are working in disciplines that have nothing to do with ancient weaving. So as far as the Shroud is concerned ‘we see through a glass darkly’ because we do not have enough evidence to do more. In my own work on the medieval church, I frequently come across inventories that talk of collections of linens and silks with images on them. An inventory of the contents of the basilica of Saint Urbain in Troyes in 1468 listed 26 silk cloths with images on them. Yes, silk here, linen in other cases. Charles V of France (ruled 1364 78) owned 57 chapelles, sets of vestments or altar cloths, some of them, like the only survivor the Parement of Narbonne, painted in grey on silk for use in Lent. That is a thousand objects. Yet the mere mention of an image on a cloth is often taken to refer to the Shroud! (See Ian Wilson’s reference to the veneration of a cloth by the Templars, for instance.) We need to be much more critical of such claims until better evidence is found to link them specifically with the Shroud. Until then, I for one, will simply treat them as different cloths as we know that many such existed..","date":"2013-10-24","mins":"12:15 pm","url":"https://shroudstory.com/2013/10/24/meanwhile-part-2-works-for-me/","cat":"carbon_14_dating","title":"Meanwhile, Part 2:  “Works for Me”"},{"id":"comment-10911","author":"charles_freeman","post":"Dan I am sure that you would support, and I hope make strong moves to use your influence, to campaign for a new radio carbon 14 dating. After all, in the past twenty five years r c dating has become more scientifically accurate and it should be able to avoid the criticisms of the 1988 dating. Maybe it would also pinpoint a more precise date within or outside of the 1260 1390 period. Those of us who stick to the presumption of the 1988 dating standing do so a) because in relation to the three possible alternatives, a swapping over of samples by the Cardinal and Tite, some form of contamination ( many different contaminants, soot, sweat, carbon monoxide suggested) or an invisible rewoven patch selected as the sample, critics of the testing disagree so violently among themselves – e.g see Antonacci’s critique of Raymond Rogers’ 2005 paper that the independent observer cannot be convinced that a single clear refutation of the 1988 testing has been proposed by the critics b) There is not a hint in any of these critiques that resolution of the problems proposed would lead to a radio carbon 14 dating in the first century. Only those who are absolutely committed to supporting one date or the other have anything to fear from a retesting and as STURP has been among the main critics of the 1988 tests, it is presumably their primary responsibility to call for a new test by at least three independent radio carbon 14 laboratories. STURP would presumably provide observers who would be present alongside textile and radio carbon 14 experts to make sure that representative samples of the whole Shroud are chosen. As shroud or burial cloths undoubtedly did exist in the tomb of Jesus in c. 30, there is just a possibility they survived and I for one would not rule that out..","date":"2012-04-28","mins":"11:32 am","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin."},{"id":"comment-142264","author":"charles_freeman","post":"I don’t understand the argument that disregarding the original protocols makes the science of the tests as they were actually done invalid. As a historian, I would prefer to find other ways than the merely scientific to ‘date’ the Shroud. I would happily just leave out the radiocarbon dating altogether and concentrate on finding documentation and iconographic evidence to support ( or ruling out) a medieval date. Although I have not yet found any evidence of a double image, I am having fun, among getting on with other projects I am involved in, in learning about all kinds of obscure aspects of medieval ceremonial, use of painted cloths in churches ,etc. Etc. The problem I find with all the attempts to refute the radiocarbon dating is that they don’t offer any evidence that a retesting of every part of the Shroud with every protocol known to man observed,etc,etc., would end up in that crucial date range of say 50 BC to AD 33..","date":"2014-08-04","mins":"2:19 pm","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli"},{"id":"comment-100758","author":"charles_freeman","post":"Yes, one has to remember that blood cults featuring real blood were very common especially in Germany from the thirteenth century onwards. I have a whole chapter on them in my ‘Holy Bones’. So Hugh is right to say that the presence of blood, even human blood, on the Shroud says nothing about authenticity in itself as there are other relics or phials of Jesus’s blood ,etc, documented amend they can’t all be authentic. There also remains some doubt that the red on the Shroud is actually blood. Certainly the professor of physiology I consulted on this said he was not convinced by the articles I sent him. So surely the questions here should be left open until further analysis is done..","date":"2014-04-18","mins":"11:17 am","url":"https://shroudstory.com/2014/04/16/okay-we-will-need-to-wait-several-weeks/","cat":"carbon_14_dating","title":"Okay, we will need to wait several weeks"},{"id":"comment-48254","author":"charles_freeman","post":"John Klotz. ‘Pardon me, but that is precisely the scientists other than the C 14 labs are doing in the study of the Shroud. The C 14 labs rely on one disputed fact: the C 14 tests of one corner of the Shroud. It is anomalous and all of your bloviating can not change that fact.’ I do think that for the sake of fairness that you need to mention that there are experts such as Mechthild Flury Lemberg who would not accept as a ‘fact’ that this part of the Shroud is ‘anomalous’. (See her ‘The Invisible Mending of the Shroud, the Theory and the Reality’.) After an intensive examination she could find no evidence that the corner of the Shroud was different from the main part of the Shroud. Her objections was over whether there was too much contamination in this area for the Shroud to give accurate radiocarbon results. So I am not sure in the present state of play ‘fact’ is appropriate..","date":"2013-10-21","mins":"11:16 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","title":"Quote for Today: Stephen Jones on journalists and their readers"},{"id":"comment-48282","author":"charles_freeman","post":"‘Anomalous’. One also has to take into account that the original weave of the cloth was not uniform. Gabriel Vial, who examined the Shroud for the radiocarbon dating of 1988 and took his own notes on his examination of the Shroud, has an interesting article in the CIETA Bulletin of 1989 where he notes that there were two types of faults in the original weaving and that there was a major discrepancy in the size of threads used. He gives, with a photograph, two adjoining threads, one of which is two and a half times as thick as the other. So far as I gather the use of different thicknesses of thread is haphazard. So this means that is there is a variable structure to the original Shroud that needs to be taken into account BEFORE we begin to discuss reweavings or whatever. Vial also writes that ‘traces of cotton are probably purely accidental’..","date":"2013-10-21","mins":"1:54 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","title":"Quote for Today: Stephen Jones on journalists and their readers"},{"id":"comment-48348","author":"charles_freeman","post":"So we have myself as a historian ( who has written the only full length study of medieval relics, one published by a university press, Yale, see reviews of my Holy Bones, Holy Dust on their US website and you can make your own assessment) we have physicists and we have an acknowledged expert on ancient textiles ( MF L), a biochemist, and a lawyer (?John Klotz), talking about the weave of an ancient textile. Who trumps whom?.","date":"2013-10-22","mins":"4:25 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","title":"Quote for Today: Stephen Jones on journalists and their readers"},{"id":"comment-48343","author":"charles_freeman","post":"John, I see no reason to reply to your somewhat intemperate comment! I am simply drawing your attention to an article which many people think is relevant but you happen to think is nonsense. Your privilege..","date":"2013-10-22","mins":"3:51 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","title":"Quote for Today: Stephen Jones on journalists and their readers"},{"id":"comment-90082","author":"charles_freeman","post":"I shall hold my breath on the reweave theory until someone who specialises in ancient textiles can show from an actual examination of the cloth where the weave begins and ends and how it is differentiated from the rest of the Shroud. If Rogers was right ( and I really do have my doubts) the reweave should be shown through the presence of cotton fibres or threads something relatively easy to spot. But yes, 25 years on from the testing and thirty five years on from STURP, a re examination of the cloth using modern technology is bound to provide new answers or confirm old ones..","date":"2014-03-17","mins":"12:44 pm","url":"https://shroudstory.com/2014/03/16/so-was-the-small-arizona-piece-in-doug-donahues-custody-ever-made-available-to-barrie-schwortz/","cat":"carbon_14_dating","title":"So, was the small Arizona piece in Doug Donahue’s custody ever made available to Barrie Schwortz?"},{"id":"comment-90106","author":"charles_freeman","post":"No she was more worried about contamination as a source of discrepancy in radiocarbon dating. . See: Mechthild Flury Lemberg, ‘The Invisible Mending of the Shroud, the Theory and the Reality’ (2007) which you can pick up online..","date":"2014-03-17","mins":"1:53 pm","url":"https://shroudstory.com/2014/03/16/so-was-the-small-arizona-piece-in-doug-donahues-custody-ever-made-available-to-barrie-schwortz/","cat":"carbon_14_dating","title":"So, was the small Arizona piece in Doug Donahue’s custody ever made available to Barrie Schwortz?"},{"id":"comment-143873","author":"charles_freeman","post":"Daveb: ‘I think we need to know a great deal more about the cloth itself.’ I could not agree more.Let’s start with involving someone who knows about ancient and medieval weaving who can tell us what kind of loom could or could not produce a herringbone three in one linen cloth..","date":"2014-08-14","mins":"7:18 am","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-144012","author":"charles_freeman","post":"As 99.9999 per cent or more of ancient textiles ( and these included all clothing) are lost, it is hard to say anything more than that the Shroud, if it is indeed first century, is a unique SURVIVAL. I am more interested in knowing about the looms ,ancient or medieval, that could have produced it and I am aware that this is a highly specialist area and I would defer to expert opinion. Still there is much basic work to be done. Contrary to what Ian Wilson tells us ,the Shroud is not a particularly fine linen cloth. Examples of linen with 40 to 70 warp and weft threads per cm are known from Egypt, Palestine and Syria in this period, much greater quality than the Shroud. (See the good article on weaving in the ancient eastern Mediterranean in the Cambridge History of Western textiles ( p, 110 for the figures). Again if one looks at examples such as the Ramesses Girdle, now in Liverpool, of c. 1200 BC, which, even with computer help, has proved almost impossible to reweave, the Shroud is not especially complicated. So when one says that the Shroud is unique, it does not mean that one should say it is something special as a cloth so long as much finer and more complicated cloths from the ancient Mediterranean are known to exist. For me, the key problem is survival. Although I believe that the Shroud is medieval, if a first century date does come up on a radiocarbon redating, I would assume that it was kept somewhere among the large and vibrant early Christian communities of Egypt where the damp would not have got at it. I am frustrated by the way so called Shroud researchers are not prepared to look outside the Edessa/Constantinople route, when there are so many alternatives to it to explore. The Shroud would not have survived long cooped up in a brick wall in damp 9 even subject to flooding0 Edessa!!.","date":"2014-08-15","mins":"5:17 am","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-144381","author":"charles_freeman","post":"Well, our friend Gary Habermas seems to have already got a first century radiocarbon dating for the Shroud see his lecture and the comments on it..","date":"2014-08-17","mins":"1:02 pm","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-144023","author":"charles_freeman","post":"Thomas. If I believed that there was sufficient evidence that the Shroud was first century , I might decide to take the time out to plot the various routes that a first century cloth might have reached northern France either direct from the Holy Land with other relics known to have come from the ‘Lord’s Tomb’ in the first millennium, or via Egypt where the problem of the preservation of the Shroud would have been ameliorated by the climate. Both important avenues of research that might provide some evidence that even I would accept as possibly supporting authenticity. However, I have to earn my living which is why my energy this year has been concentrated on getting the third edition of my Egypt, Greece and Rome onto the market and setting up tours in the Mediterranean. Besides, one really has to be an expert in Greek to analyse the primary sources from Egypt and early Christianity in general. I am just surprised that authenticists, many of whom, unlike myself, seem to spend their lives full time on the Shroud, have accepted the Edessa/Constantinople route for so long without considering the alternatives. There is the massive problem of getting the Shroud to Edessa where Christianity developed quite late when we have very early Christian communities in Egypt who might well have taken it in IF they had considered relics important. Perhaps Hugh can dig out some scholars who have the expertise and linguistic skills to do the research!.","date":"2014-08-15","mins":"6:35 am","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-144025","author":"charles_freeman","post":"P.S. Tradition says that Christianity in Alexandria was founded by the evangelist Mark in AD 33 (and ,of course, his supposed tomb was preserved there until the Venetians stole the body). Almost certainly too early but it reflects a tradition that the foundation was very early and why not take the Shroud there to a climate where it would have been safe from damp? Worth looking at, don’t you think?.","date":"2014-08-15","mins":"6:39 am","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-144031","author":"charles_freeman","post":"P.P.S. As many of you will know first and second century Christian texts (some papyrus) have been found in Egypt, confirming not only that Christianity was very early here but that early documents were preserved. Come on, I am not an authenticist but I have no problems in telling those of you who are where to start looking!!.","date":"2014-08-15","mins":"7:23 am","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-155097","author":"charles_freeman","post":"I was fascinated to see that, according to his Abstract, Mr. Skurka has obtained a radiocarbon date far in the future – AD 2,400. Is this theoretically possible?. I would love to know the figures..","date":"2014-09-24","mins":"12:16 pm","url":"https://shroudstory.com/2014/09/24/superparamagnetism/","cat":"carbon_14_dating","title":"Superparamagnetism"},{"id":"comment-73027","author":"charles_freeman","post":"Yes, he needs to be careful. The radiocarbon dating labs are serious professional organisations whose prestige depends on their credibility. An accusation of fraud against any one of them or any named living individual involved in the testing might well bring Mr. Jones some unwelcome attention. In English law the onus will be on him to prove the fraud. As some may remember he accused me of knowing that the Shroud was authentic but deliberately writing articles to say that it was not in order to make money. As a freelance academic whose professional life depends on me being respected as such, I assume I could have taken him to court. If I had, he would have had to prove that I knew the Shroud to be authentic (how could he have done that?) and that I had made money from something I had written about it. As I have never had a penny paid for anything I have written about the Shroud, I think i would have won the case hands down. But then the judge would have turned round and said – ‘Well, who is this Jones guy? Does anyone take him seriously? Certainly he does not seem to have many visitors to his site and is very reluctant to accept alternative points of view. So really you can’t say that your reputation has been damaged, Mr. Freeman. I will just award you £1 to make the point that he was in the wrong and issue an injunction to tell him to stop making such claims.’ So perhaps it would pay Mr Jones to have professional legal advice before he goes further with his series..","date":"2014-01-11","mins":"6:30 am","url":"https://shroudstory.com/2014/01/10/surely-youre-joking-mr-jones/","cat":"carbon_14_dating","title":"Surely You’re Joking, Mr. Jones"},{"id":"comment-73029","author":"charles_freeman","post":"Stephen Jones ; ‘All that I can do is to set out the evidence for:. . . 2) the bias and dishonesty of those involved in the dating.’ Careful careful, Mr Jones. Just check first whether any of them are still alive..","date":"2014-01-11","mins":"6:36 am","url":"https://shroudstory.com/2014/01/10/surely-youre-joking-mr-jones/","cat":"carbon_14_dating","title":"Surely You’re Joking, Mr. Jones"},{"id":"comment-73036","author":"charles_freeman","post":"Agreed, Paulette, especially as the issues over the carbon dating have already been explored in depth over 25 years. What is this series of articles going to add and what is his agenda/ audience anyway? I often feel that Mr. Jones might do well to take complete break from the Shroud and develop some other interests!.","date":"2014-01-11","mins":"8:13 am","url":"https://shroudstory.com/2014/01/10/surely-youre-joking-mr-jones/","cat":"carbon_14_dating","title":"Surely You’re Joking, Mr. Jones"},{"id":"comment-88593","author":"charles_freeman","post":"Dan does an excellent job at providing so much up to date material on the Shroud which I for one, even though very doubtful about the authenticity of the Shroud, find interesting. However, in order to maintain the credibility of the website , a judgement has to be made over what to publicise. Stephen Jones’ hypothesis is simply science fiction do we need to bother about it any further?.","date":"2014-03-14","mins":"4:14 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","title":"The Computer Hacker Hypothesis is Short on Factual Material"},{"id":"comment-215031","author":"charles_freeman","post":"There is a mass of new material on painted linens as scholars turn their attention to them. So few are left as the surfaces disintegrated with folding and with the wear of time, probably about twelve good ones from the thousands that are recorded in church inventories. The Shroud seems to be a typical linen that was once painted with the linen surface being discoloured by centuries of gesso and paint being placed over it in the way that the medieval manuals laid down. Sadly Charlotte Villiers, an expert on painted linens, who saw the Shroud as just this, died tragically young I would have loved to ask her why she came to this conclusion about the Shroud. My own view is that Garlaschelli is being unnecessarily complicated as if the Shroud was somehow unique and not typical of its time when painted originally. I am in no rush to have my hypothesis proved as new research is continuing apace and I think that within the next five to ten years the Shroud will fit into the once painted linens category with experts agreeing on this. We will see. For the time being I am happy to leave it up to the experts, in this case those who deal in a daily basis with ancient weaves and the conservation of the few painted linens that survive. The weavers tell me that the Shroud is a typical product of a medieval treadle loom as if there was no argument about it the 113cms width is the give away as this was a common width in medieval cloth – the six linen strips of the Zittau Veil of 1472 sewn alongside each other come to a total of 6.80 meters! As so often, time , developing technology and expertise will come up with fresh approaches I think they will end up with a fourteenth century origin but what’s the rush when there is so much new work on ancient linens under way which will probably provide a definitive answer..","date":"2015-11-23","mins":"4:00 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215051","author":"charles_freeman","post":"Mario you would end to ask the experts in the conservation of painted linens but it would seem to be a gradual process o f disintegration depending on the original quality of the gesso and paint. The sealing surfaces of the centre of the Zittau Veil dissolved as a result of being steamed leaving images very similar to the Shroud images underneath.(This is why we need to make a comparative study of the two cloths as this would seem to hold the solution to the images on the Shroud.) STURP ,of course, found ‘large’ quantities of calcium carbonate which is an ingredient of gesso still on the Shroud and this would suggest that it simply disintegrated over the centuries. But I leave all this to those who deal with such linens. Flury Lemberg was a textile specialist, we need conservationist experts who deal in painted cloth surfaces to become involved..","date":"2015-11-24","mins":"3:04 am","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215059","author":"charles_freeman","post":"According to one of my Shroud contacts, Michael Tite is still lecturing and includes the Shroud. I am told that he says in his lecture that it was he who insisted on textile experts being present at the sampling to rule out any possibility of any reweaving in the sample..","date":"2015-11-24","mins":"9:24 am","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-214973","author":"charles_freeman","post":"The reweaving theory is not proven John Jackson says it cannot be seen from his 1978 photographs of the bandings. John Klotz presumably accepts Flury Lemberg on what remains of the cloth so implies that the reweaving must only be within the sample but exactly within it or is there some original and some the new weave if so this would not explain the consistency of the dates from different parts of the sample as shown in Hugh’s helpful chart. It is about time for those supporting the theory to respond to Flury Lemberg and state exactly where they think the reweaving is and whether it is a total reweave or a mixture of old or new. The tiny amount of cotton fibre identified within the sample certainly rules that out as part of the reweave you cannot,of course, have an invisible reweave using a different material. I do like the idea of the invisible weavers creating a weave that they and presumably no one else can see as they sewed. Some feat! The onus is on the reweavers to firm up if they want to be taken at all seriously..","date":"2015-11-22","mins":"11:13 am","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-214975","author":"charles_freeman","post":"No I have read it and am unconvinced that any reweaving took place. I was referring to the photo from 1978 that Jackson used to say that there had been no disturbance of that corner. It was then that he put forward his carbon monoxide theory which Oxford tested out without success. Please firm up where you think the reweaving took place, and how far it extended and whether it was in linen or cotton. As the Flury Lemberg article says there is no one who has actually examined the weave close up who has seen any, reweaving at all. You must produce evidence, not speculation by people who have no expertise in ancient textiles and may never have seen the Shroud close up..","date":"2015-11-22","mins":"1:46 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215066","author":"charles_freeman","post":"No Mario, I have not but that is irrelevant because removing modern gesso just put on is something different from medieval gesso folded and unfolded as the Shroud was over centuries. The calcium carbonate found by STURP needs a better explanation than the ‘ accumulations of dust’ that STURP postulated. I think that within five or ten years time this whole debate may have become irrelevant as it may well be that advances in the study of formerly painted linens will explain the images as discoloured linen from centuries being under gesso and paint. The iconography of the images, especially the all over front and back scourge marks, fits so neatly with the fourteenth century that that is another vital clue. Then the radiocarbon date will make sense and not be seen as an aberration. But it will be the conservationists who make the breakthrough and there is nobody here , including myself, who has the right qualifications to pronounce on this. It is just that it is a growing area of speciality so soon someone will come into the debate and sort us all out with a definitive explanation of why the linen is discoloured the way it is..","date":"2015-11-24","mins":"4:29 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-214978","author":"charles_freeman","post":"So what are you suggesting Robert? That there was a reweave but it did not show up in the bandings and Jackson was therefore wrong to say firmly – in his paper on Shroud .com ‘A new radio carbon hypothesis’ that the reweaving hypothesis was discounted? i am simply asking for some firming up of the argument that there has been some reweaving. It goes no further than speculation in anything I have read so far. Choose. 1) there was a reweave which is totally invisible however close you look at this corner of the Shroud or at photographs taken before 1988. But surely if it is invisible, you are unable to say whether it exists or not. 2) there was a reweaving within this corner of the Shroud which extended beyond the radio carbon sample but cannot be seen by textile experts who have examined the Shroud close up before or after 1988. 3) there was a reweave which by sheer coincidence was within the sample area which is why it could not be seen on the Shroud by experts after 1988. It was reasonably consistent in the mix ( or there was a total reweave of new material within the sample area but not outside it around 1325) so that each of the three sub samples came out with dates close to each other as high has shown. Please say which you favour or provide an alternative..","date":"2015-11-22","mins":"3:11 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-214979","author":"charles_freeman","post":"Sorry! Hugh not high!.","date":"2015-11-22","mins":"3:12 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"}]
