[{"id":"comment-138391","author":"charles_freeman","post":"David Roemer certainly should be given ‘academic’ reasons for the rejection of his paper. If, as he asserts, he has been told that it has been rejected on the grounds that it does not promote the authenticity of the Shroud, then the participation of a body such as the IEEE does seem strange. One would hope that the organisers and the IEEE would clarify the situation as it does need to made clear what the status of the conference is. If only those committed to the authenticity of the Shroud can submit papers, we need to know that..","date":"2014-07-15","mins":"3:05 am","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","title":"Bari Conference:  A scientific event unprecedented in Puglia"},{"id":"comment-138115","author":"charles_freeman","post":"Have they a speakers’ list and abstracts yet? It will be interesting to see what the ‘advances’ are. I shall be especially interested to see if Professor Fanti can get any wider scientific support for his dating procedures..","date":"2014-07-14","mins":"10:08 am","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","title":"Bari Conference:  A scientific event unprecedented in Puglia"},{"id":"comment-138124","author":"charles_freeman","post":"I am glad to hear that there will be something on textiles as this is an area where little research seems to have been done while new ancient textiles are being discovered by the day, so potentially there is room for ‘advance’ here. First earthquakes, now lightning sounds interesting..","date":"2014-07-14","mins":"10:34 am","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","title":"Bari Conference:  A scientific event unprecedented in Puglia"},{"id":"comment-138395","author":"charles_freeman","post":"I see that according to the blurb on the IEEE website attendance is only scheduled at 25 but the conference is open to ALL those interested in scientific research on the Shroud with no mention of any prior commitment to its authenticity..","date":"2014-07-15","mins":"3:33 am","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","title":"Bari Conference:  A scientific event unprecedented in Puglia"},{"id":"comment-193513","author":"charles_freeman","post":"The tapes taken by STURP are the only significant set of samples from the Shroud to exist outside Turin. ( If they do by any chance have the blood of Christ on them they would be ,of course, be extraordinarily important relics, of equal importance to the Shroud itself.) Even though, as merely the recipients of surface material, they are limited in what they can tell us, I wonder whether they could be made available to a world class laboratory for testing with microscopes that will be vastly more powerful than those of 1978. Anyone who has read both Mc Crone and STURP must come to the conclusion that, at the very least, there is conflicting evidence of whether there were originally pigments on the Shroud surface or not. To ask for further tests is only common sense so long as a representative set of the original 1978 tapes have been properly conserved and not contaminated by inappropriate handling or storage. It is normal for ancient objects to be retested as more sophisticated methods of testing became available..","date":"2015-03-16","mins":"11:12 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-138129","author":"charles_freeman","post":"Thanks, Louis. It is good that contributors have to highlight the way in which their papers contain ‘advances’ as this will avoid the repetition of material that has already been published..","date":"2014-07-14","mins":"10:47 am","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","title":"Bari Conference:  A scientific event unprecedented in Puglia"},{"id":"comment-193518","author":"charles_freeman","post":"John Green. Well let’s just hope that those tapes were given to professionals to conserve. Even though the tests on them were done over thirty five years ago at least we know how to conserve such materials and so there should have been no further deterioration since then if they have been taken proper care of. Any museum with a large collection of textiles would have been able to give advice. There would have been serious deterioration of the Shroud before then as there was no proper understanding of conservation and the Shroud was frequently exposed in the open air and seems to have been handled witch bare hands. The problem of knowing what has deteriorated on the Shroud over the centuries is, of course, the key one but is still to be addressed..","date":"2015-03-16","mins":"12:31 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193531","author":"charles_freeman","post":"Let’s hope the Turin authorities do keep them in proper conservation conditions. Adler’s family was quite correct to return them as in case of further scientific analysis everything needs to be in the same place, not scattered around the world, so that proper comparisons can be made between the materials that were once on the Shroud and those that still remain there. It beggars belief that no one thought of this at the time. For obvious reasons it is not acceptable academic practice to scatter around pieces of an ancient object without insisting that they must be properly conserved and can be reunited with the original from which they were taken. I have every right to be frustrated with what appears to have happened with the scattering of evidence as anyone else studying the Shroud. I assume John would rule out any further tests on the tapes wherever they may be on the grounds that science has not advanced since 1978 so there is no point in having a new analysis of the tapes. John. While a professor of physiology who read for me all the papers I could find on the STURP blood findings declared them totally unconvincing, anyone who has read Caroline Walker Bynum’s Wonderful Blood will know the fascination with blood relics in the fourteenth century. There was a lot of Christ’s blood around, some of it dried, some liquid, many with stories of who collected it Mary Magdalene was a favourite. Some of it fell from consecrated hosts (e.g. The Bolsena miracle) and under the doctrine of transubstantiation was, of course, authentic, the real blood of Christ. To rule out the possibility that blood was added to the Shroud, either in the belief that it was the real blood of Christ, or to make it more awesome, is wrong. However as an expert in criminal investigations who had seen dried blood over thirty five years told me when looking at close ups of e blood stains. ‘ I can tell you for certain that that is not dried blood’ and when I asked him whether the blood of a terrified man differed from that of anyone else, he said that he had seen many blood stains from murdered bodies and there was no distinction. I may only be a historian who is a specialist in relic cults but I do at least seek independent expertise in areas that I have no specialist knowledge in and it would seem that the experts are not convinced by the STURP findings. But that is their expertise, not mine, which is more to do with the actual blood cults on which I have written a chapter in my relics book..","date":"2015-03-16","mins":"2:40 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193532","author":"charles_freeman","post":"P.S. Excuse my own frustration. I believe that the Shroud was made in the fourteenth century and is probably the only survivor of the Quem Queritis Easter ceremony. As such, quite beyond its spiritual significance ,I believe that it is very valuable as a lone survivor from what was once an important medieval liturgy and the birth of medieval drama. So it is saddening to think of bits and pieces of it having been taken off and lost either in Turin or in the US. It deserves veneration in its own right. However, if it is authentic then each and every part of it has,under the Catholic doctrine of relics, established as early as the fourth century, the same power as the rest ( which is why you can cut up saints’ bodies). So those tapes have for Catholics an immense importance, equal to that of the Shroud itself. I am surprised that you have not had Catholics who believe that the Shroud is authentic trying to get hold of them for their own churches. Perhaps you have I recollect Joe Marino saying somewhere that he though he had a piece from the Shroud..","date":"2015-03-16","mins":"3:03 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193537","author":"charles_freeman","post":"Well the professor of physiology did read their papers in detail! and I doubt whether Adler or Heller had thirty five years of experience with bloodstains. What matters in the end is getting a mass of evidence from different disciplines that coheres to give a convincing narrative for the origin of the Shroud. As STURP and its followers freely admit they themselves have not got such a narrative as they cannot provide any interpretation of the images nor have they any sustainable evidence that dates the Shroud earlier than the medieval period. So the way is open for others to make their own narrative as I have done with my History Today article. Who will decide who has the best case? In the end it may be for instance, someone who is an expert in ancient and medieval weaves who can tell definitively that the Shroud was woven on a loom not known before 100 O AD. It may be a specialist in medieval painted linens who can find comparative examples of linens whose images have disintegrated leaving shadows very similar to those in the Shroud. It may be an expert on medieval iconography who concentrates on the all over scourge marks and sees parallels with other fourteenth century examples. STURP and their supporters are just as entitled to seek expert opinion as I am but they seem to stay within a 1978 context as if there were no contemporary experts in these issues around or as if science had stood still. This has never been the way that knowledge progresses..","date":"2015-03-16","mins":"4:46 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193571","author":"charles_freeman","post":"I am only replying to the mention of my name. In his review of Mark Antonacci’s The Resurrection of the Shroud, (2001) Rogers says that there was little evidence of any Saponaria on the Shroud. In any case Saponaria (soapwort) is used to this day as a cleansing agent so if there was any originally on the Shroud it could have been applied at any time. Most medieval textiles have disappeared from natural causes or deliberate destruction. It was never because they abandoned using Saponaria or we would have examples of earlier survivals when it was used. The Egyptian survivals result from the unique arid climate of Egypt. Just because there are mentions of it in Pliny’s Natural History and in the works of Greek writers means nothing as it was precisely these works that were used as manuals In the Middle Ages. So let’s find the Saponaria first before speculating further..","date":"2015-03-17","mins":"1:25 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193683","author":"charles_freeman","post":"For me the Shroud is deserving of veneration for several reasons It was originally created for a spiritual reason to commemorate the Resurrection of Christ at Easter and was the central focus of worship in the Quem Queritis ceremony during which it was carried in procession and laid on the altar, It has attracted veneration for almost seven hundred years and this gives it spiritual aura and,as the Church has stated, it is a symbol of the Passion of Christ and deserves respect as such. For those interested in the birth of medieval drama it may be a lone survivor of the re enactment of Easter morning, the forerunner of the Passion Plays and thus of great importance for this reason. I remain frustrated by those who claim it was a deliberate fake. Who would have been taken in by a cloth with images on it?.","date":"2015-03-18","mins":"7:48 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193597","author":"charles_freeman","post":"John – you talk as if the academic community as a whole believes in the authenticity of the the Shroud. So long as the 1978 tests cannot be replicated and the evidence is not provided by STURP or their representatives for it to be replicated, these tests have almost no scientific validity and are quickly dismissed by those who take the bother to read them. My focus is on convincing the academic community that there are alternative ways of looking at the Shroud. I have begin the process with my HT article and the feedback has been good. So far I have had no serious opposition to my ideas and some good support for them so that eventually I hope to be able to work up another article. However, it will be specialists in areas of weaving, iconography, painting on linen who will be the ultimate judges of whether I am relight or not..","date":"2015-03-17","mins":"7:52 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193588","author":"charles_freeman","post":"I seek out experts to reassure myself that I am on firm ground on specific issues before, in my case, publishing my own articles. These are informal contacts but In these cases are highly regarded people. My article in H T is open to refutation as a public paper but HT tell me that they have had lots of hits, that it was among the most hit articles of the year but they had virtually no hostile responses. I have had some very positive responses from medievists with supportive material I might be able to use publicly in future work with full accreditation to this who support my interpretations..","date":"2015-03-17","mins":"5:31 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193614","author":"charles_freeman","post":"The main reason that I call on experts is that I don’t make a fool of myself particularly when talking of scientific issues. I have a professional reputation to defend, it has taken me years to build up and I am not going to risk it by publishing anything that will be ridiculed within the academic community, university presses and others who pay me money for my ‘expertise’. So writing on the Shroud, I made sure that I had a respectable journal but one where my article would be widely read, as it has been. I knew I could rely on HT to check it out for themselves but I had the whole read by an Oxford professor in medieval Christianity to make sure that it was academically respectable. I was warned that I might get hostile feedback from Shroudies for the article but the editor tells me that there has been virtually none. I have had one single letter forwarded to me unopened by HT and it was simply the face of the Shroud with a written caption offering me blessings. Instead I have had responses from many academics who have been supportive and I would be able to use material from some of them in future articles. As to blood, I have made it clear here that it would not surprise me in the least if there were blood human or otherwise on the Shroud. From the thirteenth century onwards there was a much greater emphasis on the sufferings of Christ and these were shown in various ways, by showing the Crown of Thorns still in place not only on the Cross but also in the deposition and burial, by emphasising blood stains and showing blood flowing along the arms, and by emphasising scourge marks that covered the whole of Christ’s body. As often happened, many people jumped on the bandwagon and began producing relics of the blood of Christ, some of which were enormously popular. So it was that the monastery at Hailes was able to build their major building on the proceeds. So there was a lot of ‘Christ’s blood’ around and one would not be surprised to find some blood added to the Shroud. I had the following checked out : 1) the tests for blood at the forensic laboratory at Modena. The tests done there should have shown up human blood if there had been any but they did not. Apparently it would be extraordinary but not totally impossible for the laboratory to have missed it. 2) the articles by Heller and Adler and other supporting articles I could track down. These were read by a professor emeritus in physiology and were found totally unconvincing. For me this is quite sufficient and the fact that no one has taken the tapes and replicated the tests backs up his opinion. The professor noted that they probably mistook animal proteins. He offered to pass on the papers to a haematologist but could not believe there would be a difference of opinion. 3) the same professor remarked that this was too red for dried blood and this has been confirmed by someone who has dealt over many years with bloodstains. I am quite happy on the basis of this to risk my reputation in the academic community within which I work by saying that, while human blood on the Shroud would hardly be surprising in the fourteenth century, no significant replicated evidence has been found to support that there was. I shall just have to live with the contrary opinion of the lawyer John Klotz and I will try not to lose sleep over it..","date":"2015-03-17","mins":"12:09 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-17399","author":"charles_freeman","post":"I am totally mystified by the Challenge unless David Rolfe can provide Richard Dawkins and his assembled team of textile experts with a scientific laboratory at the Challenge’s own expense and permission to take the Shroud there for a full examination. Otherwise it is like asking a doctor to diagnose an illness of a patient without seeing the patient..","date":"2012-10-10","mins":"6:34 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17423","author":"charles_freeman","post":"Surely this would be a completely independent test by laboratories that had nothing to do with the original 1988 test. As I understand it , Ramsey does support more testing but still believes a date will be found within the medieval range. ( I think that this was in an interview for a documentary.) As there is some continuing debate over whether the 1988 sample was representative of the whole, it would make no sense to retest part of this again. Samples from other areas of the cloth need to be chosen. Did Rogers and LANL ever come up with a secure date? I thought Rogers proposed a very wide date range that was worse than useless in pinning down a specific date for the making of the Shroud. A doctor friend was telling me of the immense strides in diagnostic blood analysis in the last ten years. When were the last tests done on the blood? This is certainly another area where the latest techniques need to be used. I still believe that this challenge is flawed unless access to the Shroud is granted. With the rate of scientific advance even if we do not solve the mystery of the Shroud image now, we certainly should in the next ten years but we can’t if there is no access to it. Final question. As there are samples from the Shroud outside the control of the Vatican (e.g. From the 1978 examination) , would these be offered to Professor Dawkins by those who control them?.","date":"2012-10-10","mins":"2:08 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17916","author":"charles_freeman","post":"Diana , I look forward to your detailed refutation of my argument as you have not yet addressed the central points I made.Your posting seems to be somewhat impressionistic. I have used Wilson’s illustration because it is all over the internet it was from one of these uses that I was referred back to his book. My approach is speculative but only because Wilson’s is impossible for the reasons I have point out. I do actually provide an example of a cloth fold four times while he can only manage three to produce a cloth divided not into four (see further below) but into eight. Early Christianity (one of my fields) is littered with examples of austere Christians complaining of less austere Christians following pagan customs especially in celebrations. Pope Leo I complains of Christians worshipping the sun from the steps of St. Peter’s, others complain of the continuing pagan festival feasts around the tombs of the martyrs (see Ramsey Mac Mullen’s The Second Church on this), there are complaints of ‘pagan’ candles being lit at martyrs’ shrines, the whole idea of transferring vast quantities of money , gold and mosaic into church buildings is essentially pagan certainly not Christian – as Jerome complained!! What about the Esquiline treasure =, a Christian marriage chest with a naked Venus on the top!! So the overlap is greater than you seem to imply, but , as you will have seen, I raised the question of whether the pallium, which has been described as folded, is another ceremony transferred from a pagan precedent. So my argument is not ‘utterly absurd’. A pagan world becoming Christian still lived in pagan mindsets just as much of modern Christmas celebrations have absolutely nothing to do with the Christian story. We may not have another record of tetradiplon , but if you have studied your lexicon you will know that using tetra as a prefix was very common. I still work from my great grandfather’s 1865 lexicon but I gave up counting after I had read through eighty examples – I think there must be some 150 as i was only half way through. I am surprised that no one, so far as i know, has been through this before so that some comparisons between tetradiplon and other ‘tetras’ can be made. So if you take tetra together with some action you get tetraelix, ‘four times wound or twisted round’, tetrapalinon, ‘ a fourfold lace or string; or tetrapalos ‘ploughed four times’, There are many examples of tetra being used of objects divided into four but as Wilson has a cloth divided into eight this does not help him he should have stuck to two foldings!. I leave it to the Greek scholars to take this on further (none that I referred my article to have suggested my translation is wrong) but there are certainly enough examples to suggest that tetradiplon is likely to refer to four ACTS of doubling and we have the Parthenon example to show that cloth was actually subject to such acts of doubling in a major ceremony. I have to close now as I am on the road lecturing in Italy – on site with a group of 25 at the early Christian mosaics at Aquileia next Wednesday! until the middle of November..","date":"2012-10-20","mins":"4:43 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17927","author":"charles_freeman","post":"Ron: ‘Four doubled. Which would mean; one would double a long sheet four times.’ Yes, this is the basic argument in my article (contra Wilson’s three doublings) although there is no reason why the cloth should be long , I use the example of a napkin tho show that tetradiplon could apply to quite a small cloth. Folding is, of course, implied and perhaps my source was concentrating on the example of an actual cloth..","date":"2012-10-20","mins":"8:36 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17919","author":"charles_freeman","post":"P.S. One of the scholars of Byzantine literature who knows the original texts in Greek replied to me as follows: ‘It is still not clear to me if tetradiplon means “folded four times” or “folded in fourths.” The latter would imply folding only twice. Wilson’s theory involves three foldings, resulting in eight sheets. The only explanation I can think of how this explains the word tetradiplon is that he’s referring only to the third folding in which 4 sheets are folded over to form 8. In other words, 4 X 2 = 8.’ But I don’t think Wilson says anything about referring to ONLY the third folding. One must remember that Wilson is not a scholar of ancient Greek and one must refer to those who are on these matters. He seems to have been caught in an impossible position, neither folded into fours, nor folded four times (as the Parthenon cloth was). I can only repeat what I have said, and more eloquently than I , Yannick Clement, that until one clears away the deadwood of Wilson/Scavone and Guscin one is never going to make any further progress in Shroud studies..","date":"2012-10-20","mins":"5:41 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17929","author":"charles_freeman","post":"Ron if you look in your Greek lexicon ( at least if it is similar to my exhaustive 1865 edition) you find that ‘diploe’ is actually translated as a ‘fold’ or ‘doubling’ so my highly erudite informer may have been thinking of this. There seems to be an awful lot of work as yet undone on ‘tetra’ prefixes which will help a fuller understanding of tetradiplon. But as there is an example of a cloth folded double four times, we know that such foldings of cloth did take place in ceremonies. That is incontrovertible from the relief. Whether this links in with the use of the word in the Acts of Thaddeus is, of course, speculative. We just have to start from the failure of the Wilson hypothesis and play around with alternative possibilities..","date":"2012-10-20","mins":"10:50 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17945","author":"charles_freeman","post":"Ron. I assume you have read my article so that you know what we are talking about. I am pleased to find something we agree on because if tetradiplon is translated as ‘four doubled’ as you suggest this rules out Wilson’s hypothesis that only describes a three doubled cloth. – tridiplon, I suppose. Let’s take it gently. 1) If you have a handkerchief to hand , lie it flat and then fold it double four times. You will be able to do it. So tetradiplon, if translated as ‘four doublings’ , is possible for even a small cloth. So unless we have some other information we would not know the unfolded size of any cloth described as tetradiplon. 2) We have a LEGENDARY account of Jesus wiping his face with a cloth that was described as tetradiplon before he wiped his face with him with no reference to it being folded tetradoplon afterwards. It is legendary because it describes an event taking place in the first century BC before the death of Jesus, so before AD 30, when there is no evidence for Christianity in Edessa before the end of the second century. So like all legends this is imagined. If this was simply a face cloth ,the writer of Acts of Thaddeus must have imagined it as small when folded but big enough to contain an image of a face when unfolded. We know nothing more about his imagination other than that he lists the burial cloths of Jesus separately later in his account and here he seems to have drawn on the gospel accounts to supplement his legendary account. 3) We have an ACTUAL illustration of a cloth that is folded tetradiplon from the relief on the Parthenon so we know that such foldings did happen. That is what we have to go on..","date":"2012-10-20","mins":"4:44 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17965","author":"charles_freeman","post":"110 3) continued: In this case we can see what the original cloth would be in size by working out, in relation to the characters on the frieze, the size of the cloth as shown and then working from there to calculate its full size when unfolded. The peplos would, in this instance, be quite large. The interest is, of course, that this shows a cloth folded tetradiplon BEFORE being used in a ceremonial role and the Acts of Thaddeus also describe a cloth that is tetradiplon BEFORE it plays a part in the ceremony of wiping Christ’s face. I am not saying that I am right in this case , although i have had strong support for my thesis from those I circulated it to before publishing it, but as soon as one rejects the Wilson hypothesis as being a non starter there are lots of avenues to explore. But, and this is the topic at hand, will the British Shroud meeting be a place when anyone opens up new avenues of research or will it be one when the old arguments are simply recycled and everyone pats themselves on the back. Will the impossibility of Dawkins accepting the challenge until he is given access to the Shroud be raised? Will there be any agreement even on what scientific facts about the Shroud there are for him to go on?.","date":"2012-10-21","mins":"5:05 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17946","author":"charles_freeman","post":"Sorry, first century AD!.","date":"2012-10-20","mins":"4:46 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17438","author":"charles_freeman","post":"Yes,it is a marginal issue. We know that there was once a burial shroud so It should make no difference to anyone’s faith as to whether it happened to survive or not. I doubt that it did but I would be intrigued if it were proved that it had. As the only surviving cloth of this size from this region,it would certainly deserve better care than it gets in Turin. I am sure the stone that closed the tomb must be still around as it would take some moving away from Jerusalem! No doubt James Tabor will find it in time for his next documentary..","date":"2012-10-10","mins":"4:21 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17437","author":"charles_freeman","post":"So you agree that Rogers offered no precise date. As I am arguing for a new Carbon 14 dating, the 1988 test result is irrelevant. We would start again from scratch with the immense advantage of the more sophisticated methods that have been developed to deal with earlier problems of Carbon 14 dating. There have been real advances here while no one has,apparently, ever been able to use Rogers’ approach to achieve a date for cloth..","date":"2012-10-10","mins":"4:12 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17409","author":"charles_freeman","post":"Louis, And you think that science has not advanced since these studies were made? Modern methods would achieve a vastly more sophisticated analysis of the Shroud and it would be right for Dawkins to refuse to accept the challenge on these grounds alone..","date":"2012-10-10","mins":"9:26 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17461","author":"charles_freeman","post":"Yannick. In my book Holy Bones, Holy Dust, How Relics Shaped the History of Medieval Europe, just out now in paperback, I fail to find a single medieval relic that dates back to the first century, although all the artefacts, cloths, etc listed in the gospels certainly existed at some point. There is no record that early Christians collected relics before the fourth century, having a very similar attitude to them that most Protestants have today, and most must have perished due to natural causes in the humid atmosphere of Jerusalem. However I would stand to gain immensely if the Shroud is ever proved to be authentic as it would enable me to write a revised edition of my book with a sensational new cover that would probably earn me good money. My own feeling is that if retested the Shroud would come back with a medieval date, possibly a bit earlier. With modern methods of removing contamination,it is impossible for so much contamination to remain that it would skew a 1350 (say) date back to the first century. The first century date is what matters,any other date, say AD 500, just confirms that this is a later creation. We know of many relics that first appear in the ninth century ,for instance, and you know of two separate tests on the Oviedo sudarium that took it back only to AD 700 (I only knew of one of these tests so it is useful to know that there is a second that confirms the first). If you are looking for large cloths the size of the Shroud, the best examples are the cloths made in Islamic workshops in the ninth to eleventh centuries. Several of these were brought back to Europe by Crusaders notably the shroud of Cadouin.I have had one useful conversation with a textile expert who thinks this is a possible source for the Shroud and would explain why there may be traces of plants, etc, from the Middle East on the Shroud. Unfortunately I have been unable to make contact with the French expert on Islamic cloth whose name i was given to explore this further. I don’t know how the Islamic cloths were woven and the first step would be to see if they used the same methods as shown on the Shroud. The Romans were cruel in their methods of execution , later generations no less so and it is not impossible that ,taking the gospels as a source, someone recreated an actual crucifixion of some unfortunate man and then wrapped him up so as to sell the bloodstained cloth to a gullible crusader. Further testing of the blood on the Shroud is essential. If an AB blood grouping is confirmed this has to be squared with the evidence that this grouping is not known before AD 900. I am sticking to a medieval date as the best fit without ruling out the small possibility that the cloth is a lone survivor of an earlier period. I promise you ,Yannick, that if the Shroud is proved to be authentic I shall acknowledge you by name in the new edition of my book! (But I won’t promise to share any royalties with you!).","date":"2012-10-11","mins":"3:39 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17491","author":"charles_freeman","post":"Gabriel. I think the AB blood grouping of the Shroud is well reported.I have argued that this test should be done again with the latest techniques of blood analysis to confirm this result – and,of course, find out very much more about the blood and genetic inheritance of the person wrapped in the Shroud. In an earlier posting on this site I cited the Hungarian evidence that showed how AB grouping first appeared quite late, post 900. This was done from careful analysis of burials in an area where the mingling of Mongoloid and Caucasian groups took place which led to the emergence of an AB grouping from what were previously blood groupings of B and A. I am sorry I have not the time to find which posting it was on but perhaps someone else remembers it. If I find it I will repost it here, of course. If anyone else has conclusive evidence of any AB blood grouping from before AD 900 it would be good to know as i have never seen one. The mingling of Mongoloid and Caucasian groups took place in the areas where they came into contact and there are several of these including the Far East which are perhaps earlier. One can still see the major concentrations of AB, always a small percentage of the whole, from a map of blood groupings..","date":"2012-10-11","mins":"12:45 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17532","author":"charles_freeman","post":"Yannick Clement seems to know most about the carbon 14 dating of the Oviedo Sudarium. We need to know whether just the cloth was dated or the blood stains as well. If the blood stains are shown to be AB and are dated to AD 700 then we do indeed have the earliest reference to an AB blood grouping that I have ever heard of and this would be significant. As the mingling of A and B groups as a result of documented migrations from the east are rare this early this might also give a clue as to where the ‘donor’ of the blood on the Sudarium came from. There would be very few places indeed where the emergence of AB groupings would have been possible. I have been told that although one might find examples fo AB from AD 900 it was not until more extensive minglings of A and B blood groups between 1000 and 1100 that it becomes more common. As said in another post, the evidence comes from the plains of Hungary where the first recording mingling of A and B blood groups which led to the emergence of the AB blood grouping seems to have taken place in the ninth and tenth centuries. As i understand it, analysis of bones from earlier burials have shown no trace of AB before this. I am lucky to have a Hungarian friend who lectures on medical history and I have asked him for help on this as I suspect that much of the research is in Hungarian. Suppose the Shroud was AD 1350 there would be no problem about the AB blood grouping as , even though it was carried only by a small minority of the population and most prominent in areas where A and B groups intermarried, there were still a significant number with this blood grouping around. If the blood on the Shroud is shown to be much earlier it becomes, to me, a much more interesting question so I look forward to hearing more from the experts on this. I leave it to others to discuss the theological problems arising from the analysis of the blood of a man who is assumed to have had a human mother and a divine father. If we have an authentic shroud then conservative theologians would presumably be forced to admit that we have the DNA of God. I leave it to them to sort this one out. Let us await on more expert input.","date":"2012-10-12","mins":"3:38 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17517","author":"charles_freeman","post":"Yannick, I have now read your paper with interest. I have seen so many conflicting discussions by scientists and pseudo scientists on the Shroud and, as I am not a scientist myself , I am quite happy to accept as a good possibility that the Shroud contains an image of a man who has been crucified , either Jesus himself , or someone tortured to death by someone who had the gospel description of his death. The real question then is the date of this occurrence. I am simply not convinced by the argument based on the Vignon markings that the Byzantine images of Christ are derived from the Turin Shroud. I have recently been writing the third edition of my Egypt, Greece and Rome that includes art. I argue there , conventionally (it is a conventional book based on standard sources designed for beginner students in universities) , that the fully frontal faces of Christ are derived from imperial art. You can see this in the San Pudenziana mosaic in Rome of c. 390 ( some say later, possibly 420) where Christ is shown in full, front on and with a beard,as an imperial magistrate. In the Ravenna mosaic,where I follow scholars such as Robert Cormack in dating it to probably AD 500, this point is made even clearer as Christ is draped in imperial purple. So the model for the Byzantine Christs seems to be the emperors, not a burial cloth. This ‘liberates’ the Turin Shroud and means that it can be of any date, from the first century AD up to its first mention in the fourteenth century.So then we need to apply other tests and here we seem to agree on a new carbon 14 dating. I still think that this is by far the most likely way of settling the issue. Even taking a worst case scenario if another date well after AD 30 is achieved I think this will be adequate proof for me that the Shroud is not authentic. I also want to get to the bottom of two other issues. 1) If the bloodstains are AB, then we need to square this with the evidence that AB only appears in the historical record after AD 900. The best evidence for this comes from Hungary and , in reply to another post from Gabriel,I am now waiting for a Hungarian doctor friend of mine who lectures in the history of medicine in Hungary to give me his views on AB. I am not able to comment on how accurate the AB testing is although I am assured that it is. Even so I would argue for another testing of the blood using the latest techniques which are miles ahead, apparently, of even those of ten years ago, As I have said elsewhere we need to know everything we can about the blood group and genetic inheritance of the blood (however many theological problems that arise from it would it show the DNA of God the Father?) 2) Although I think it is unlikely to lead anywhere, i would like to do a comparative study of the Shroud with the linen cloths of similar size that were woven in the caliphs’ Egyptian workshops between the 9th and 11th centuries. We know of two that came to Europe from these looms that still survive and there were were probably many more in view of the heavy traffic of crusaders and pilgrims going to and from the Holy Land. Many were very gullible and brought back fakes believing that they were the genuine relics found on the sites where they have been used. There would have born evidence of these ‘relics” origins, possibly in the shape of pollen,etc, that can be traced back to Middle East sources. It is argued that the Shroud also bears such evidence and so a Middle East origin at the time of the Crusades is a possibility that, at the very least, needs to be ruled out. However, you and i stand together on the issue that first brought me into this discussion, the impossibility of Wilson’s arguments ,all of which fail as soon as they are analysed. I note that even Stephen Jones has now abandoned his attempts to discredit my original article on the subject..","date":"2012-10-11","mins":"4:11 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17534","author":"charles_freeman","post":"Yannick. There is clearly some confusion over the dating of the Sudarium although it is interesting that the same date recurs that correlates with the first mention of the Sudarium. When i researched the Sudarium for my book on relics, I understood that the Sudarium was not first seen until the chest was opened in 1075. It was the CHEST (unopened) not the Sudarium that dated back to the seventh century. The sources were often later than the opening of the Chest. As I have said before, the chest was said to have contained many more prestigious relics of the Passion. I wonder where they got to. At the time they were higher in the hierarchy of relics that shrouds or sudaria were. I am sorry if I have missed this in your many postings but where do you think the Shroud was when it was first copied and can you confirm the date when you feel it was copied. Thanks. That will help us explore the context in which the Vignon markings may or may not have spread..","date":"2012-10-12","mins":"4:18 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17410","author":"charles_freeman","post":"At the very leas , advances in radio carbon 14 dating since 1988 require another testing of the Shroud..","date":"2012-10-10","mins":"9:28 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17531","author":"charles_freeman","post":"Thank you. I am quite open to correction but leaving aside the chap who links blood groups to ideal diets, it is commonly said that AB is only a thousand years old. I look forward to hearing what is now the revised account with details of the earliest recorded case of an AB blood grouping. Dr. Yamamoto needs to say in what specific ways that those dates do not fit with ‘ the current theory’ of evolution. Does he specifically deny the 1000 year date for AB? Yes, we all need scientific backing for the emergence of AB from whomever is qualified to give it. I spent two hours in the internet some time ago on the issue and only found references to the circa a thousand years ago date for the emergence of AB but nothing to an earlier date. I now have a Hungarian medical historian ( sadly he is in the States lecturing at the moment so there may be a delay) working on it as most of the work done on this still seems to be in Hungarian as it was on the plains of Hungary that the mingling of A and B groups that led to AB seems first to have taken place in the ninth and tenth centuries. Well, that seems to have been the view until now but our knowledge of blood samples is always increasing day by day!.","date":"2012-10-12","mins":"3:21 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17541","author":"charles_freeman","post":"Yes, i agree that we should ignore Adamo =he had an axe to grind. My preliminary research is focussing on the Hungarian evidence that seems to be the best for the emergence of AB in Europe. (As said earlier i am liaising with a Hungarian friend who is a surgeon/medical historian in the hope of pinning this down further.) There were other areas ,of course, where Mongoloids and Caucasians intermarried in China , Korea, southern India and across central Europe from Finland Poland, Czechoslovakia, Hungary, Turkey etc.. Obviously AB has nothing to do with race because it arises from a mixture of different racial groups.That was always a non starter. Since 1000 there have been further migrations of AB and so there are populations of AB blood groupings in areas of migration, especially from central Europe. It would be interesting to know how many of the Israeli AB population had their origins in Jewish migrations from central Europe. Still no evidence of any AB grouping before AD 900 – apparently when it was first found in Hungary we need to keep searching for evidence. I shall stay with the emergence of AB 1000 to 1100 years ago until i see clear evidence of an earlier dating of the emergence which I shall be happy to accept. No one that I can find seems to be able to challenge this date but there could always be a first!.","date":"2012-10-12","mins":"7:08 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17547","author":"charles_freeman","post":"Dave B. You left Hungary out of your table where the incidence of AB is the highest in Europe at 8 per cent. This is precisely why studies of the emergence of AB have been concentrated here. It is clear from the incidence that there was a swathe of central Europe from Finland in the north to Turkey in the south where Mongoloid B people met with Caucasian A people and that eventually sexual mingling took place leading to the new AB grouping. This why you have ,second to Hungary, Turkey at 7.2 per cent, and Czechoslovakia and Poland at 7 per cent AB. ( In contrast if you go further west, France and the UK are only 3 per cent ,Spain 2.5 per cent, Ireland 2 per cent AB) It was the occupation of the Carpathian Plain by the Magyars in 895 that is seen by some as the crucible where the mingling took place which is why a date of c. AD 900 is often given as the start of AB groupings with these becoming more intensive between 1000 and 1100 (which is why some accounts talk of a thousand years since the emergence of significant AB groupings). One genetic website states as follows:’The blood group AB represents less than 5% of the world’s population. Resulting from unions of European populations of group A and of Mongol population of group B, this group is very “young”, since it has been in existence for only 10 to 15 centuries. The first traces of group AB go back to just about the year 900. Research undertaken in Hungary, from a necropolis dating from the I Vth and VI Ith century to this date, did not placed any individuals belonging to the AB blood group.’ I am trying to track down this research but, as I have said before, I am open to any AB dating of blood groups before 900. I just haven’t found any.. It would be good to settle this issue one way or the other as it is of crucial significance for deciding on the authenticity of the Shroud , although I would like further blood testing to make absolutely sure that the blood on the Shroud/Sudarium really is AB.","date":"2012-10-12","mins":"11:02 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17628","author":"charles_freeman","post":"Thanks for yours , Yannick. I think that the first thing to do is to assemble all the examples pre AD 800 of faces of Christ that are assumed to have Vignon markings and place them on a map with colour coding by date ( e.g. To 50 years). You will have to accept than many will have decayed with time and others destroyed by iconoclasts but you may have a big enough sample to begin work. As I understand it Stephen Jones accepts the earliest Vignon markings as being of a Christ in the Catacomb of Marcellinus in Rome. Does one include the San Pudenziana Christ in Rome of c 390 420 as having Vignon markings? It seems generally assumed that the Ravenna Christ of c. 500 also has Vignon markings. Can you see the point I am making – that the earliest examples of Vignon markings may be not far from each other in Italy and thus, if the Shroud was the source, this would suggest it was in Italy that early. E.g, before 500. The earliest examples that Wilson can come up with are post 550. Of course, with the fall of the Roman empire the west was partly cut off from the east but our study might show conclusively that Vignon markings appeared in Italy before they did in the east and this would be significant. I don’t understand Vignon markings because i cannot see them in the Turin Shroud but others obviously can spot them without difficulty so perhaps they can work together to compile the images that they believe contain the markings and let us have the result on a map..","date":"2012-10-14","mins":"11:10 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17629","author":"charles_freeman","post":"Contamination is a problem well understood by radiocarbon laboratories and there are increasingly sophisticated ways of dealing with it. It is not such a problem with the Shroud as seems to be assumed as the massive amount of contamination needed to give a first century sample a fourteenth century date would now be spotted well before the sample was tested.It was simply be too prominent to be missed by modern methods. As i understand it a modern laboratory would be able to assess the degree to which contamination might affect their readings and include this in their report on the variation in date. If the question was ‘Is the Shroud fourteenth century rather than fifteenth century?’ contamination might be an issue but hardly if it is a question of whether the Shroud is first century or fourteenth century. I am now on the fringes of archaeology but have had some contacts with radio carbon dating of objects that i have been interested in for my books especially the dating of the Thera eruption.. I am amused by the assumption in some of these posts that scientists working full time over many years in radio carbon laboratories whose reputations depend on getting dates right are treated as if they were unaware of the remaining problems in radio carbon dating unlike some experts on the Shroud who may never even have visited a r c laboratory!.","date":"2012-10-14","mins":"11:24 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17634","author":"charles_freeman","post":"No one denies the problem of contamination. It is perhaps the major issue that labs deal with because of its potential to skew dates. That is precisely why so much effort is put into assessing its impact in specific cases. The key issues for the Shroud are first, authenticity – does a r c test rule out a date as early as the first century?. If it does we then come on to the most probable alternative date or range of dates..","date":"2012-10-14","mins":"4:41 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17651","author":"charles_freeman","post":"Well, you have to ask the experts to show you the recent work on correlating dates so as to provide ever more secure radio carbon 14 dating. It is radio carbon 14 dating in 2012 that is important and goodness knows how much more sophisticated the procedures for dealing with the biggest problem of all, contamination, have become since 1988. There are full time scientific professionals working over many years dealing with just this problem of contamination. One big leap forward has been in dealing with waterlogged material where the water dissolved the C 14 do leading to a false, older, reading. This can apparently,according to the section on radio carbon14 dating in Bahn and Renfrew’s Archaeology ( 2012) now be dealt with. I have seen several papers on the 1988 testing that suggest the impact of contamination may have skewed the result but no one seems agreed on what specifically the contamination was and no one has been able to show that, after the cleaning process undertaken by the three different laboratories, so much contamination remained that it brought a 1350 reading to a first century cloth. More than this, even though the anti contamination programmes in the three labs were different ,all still ended up with dates in the medieval era, long,long past the first century. I assume that some evidence of contamination would show up on the photos of the Shroud if it were significant does it? It is isn’t a question of whether someone is a Shroudie or not because this is a purely scientific question. A first century shroud did exist – is the Turin Shroud it or not? No one’s faith is going to be changed if it is not as the Vatican has always made clear..","date":"2012-10-15","mins":"4:47 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17655","author":"charles_freeman","post":"Despite all the problems with r c carbon14 dating, especially contamination, which all the experts acknowledge and work hard to overcome, have you a single incidence of a r c dating so way out that produces a result only a third of the true age e.g. 1350 rather than AD 30? The contamination alone, if of 2010, would have to be twice the quantity of the first century cloth and if the contamination was earlier it would have to be even more than that. Yet one of the points John Tyrer makes is that the blood was the only liquid that seeped further down into the cloth, suggesting that contamination further into the cloth is limited. For me, it does not add up. I agree with Ron that a precise date of the Shroud might be difficult to achieve but we are not primarily interested in precision, we are first and foremost concerned whether imprecise date ranges rule out anything as early as the first century.That’s what I am interested in for starters and then, if so, one needs to follow up other leads. I still think the large cloths from the Middle Eastern workshops of the caliphs (ninth to eleventh centuries0 are important to rule out too before we go further. Many of them were brought back by Crusaders thinking that they were first century relics so a comparative study between the weave of the Turin Shroud and the weave of these cloths is important but it never seems to have been done..","date":"2012-10-15","mins":"8:15 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17680","author":"charles_freeman","post":"Louis, I agree that there are cases where r c carbon 14 dating has gone beyond what other evidence suggests is the ‘correct’ date. I have had to study the issue with the dating of the Thera eruption because it is one of the case studies for my introductory ‘textbook’ to the ancient Mediterranean, Egypt, Greece and Rome. Here radio carbon and other forms of dating come to the late seventeenth century BC but this conflicted with the Egyptian chronology of c 1500 BC. This is a classic study case for students of archaeology especially of ancient chronology because several different dating methods are being used against each other. There has been an immense amount of new radio carbon dating in Egypt to try and sort this out. As Bahn and Renfrew state in their Archaeology, p. 155, ‘A major new programme of radiocarbon determination using well stratified finds associated with specific pharaohs has recently yielded dates earlier than previous historical estimates. . . And makes more likely the early date of around 1610 BC for the eruption’. So gradually thanks to the ever greater sophistication of radio carbon14 dating, its application to a wide range of materials and its correlation with other dating methods – tephra studies, ice core studies, dendrochronology, (which, of course, help confirm that the radio carbon14 dating is accurate) are producing a consensus for the later seventeenth century for the eruption. But the discrepancy in an event that took place 3,600 years ago was only 125 years at the most enough to be a worry and require intense extra investigation (because of the threat to traditional Egyptian chronology) but nothing compared to the 1350 AD versus AD 30 discrepancy claimed for a much more recent piece of material. (Remember that r c dating is used back to 50,000 years ago and so a lot of the problems that seem to be raised by disputants here are with the extreme age of the samples. Compared to these, the problems of dating a piece of cloth only 600 2,000 years old are elementary.) On the Islamic cloths, two examples we have in Europe (brought back from the Middle East by Crusaders) are the Veil of Anne at Vaucluse (dated to c. 1095) and the Cadouin Shroud, both are similar in size to the Turin Shroud (which is why they are of immediate interest) but, so far, I have had no information on how they were woven or how Islamic cloth in general was woven in these workshops. I have recently been in istanbul at the Museum of Islamic Art and they have a wonderful collection of Ottoman weaving but i didn’t see anything earlier than the thirteenth century.(Of course the Ottomans had nothing to do with the Crusades but ‘Turkish ‘rugs were common in Europe after the sixteenth century as their great quality was recognised and the Museum has examples of them in Renaissance paintings).","date":"2012-10-16","mins":"6:42 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17734","author":"charles_freeman","post":"On Islamic cloth this is from the Qantara website on textile production post the sixth century AD. The issues that any serious researcher on the Shroud,and there are many who claim to be such, need to be aware of are 1) That good sized cloths (Cadouin Shroud 281 cms by 113 cms). The Veil of Anne at Apt ( 310 cm by 152 cms) were being brought back as relics by Crusaders both these cloths are now dated to c.1095.They are obviously only a tiny proportion of what was being produced in linen, wool and silk as the paragraph below makes clear. 2) The apparent presence of pollen,etc, from the Middle East on the Shroud is another potential link to these workshops. So far as I can see no one in Shroud studies has seriously researched this area. The only textile expert I have talked, in the Victoria and Albert Museum textile department, thought there was a lot of potential here. “Faced with a technically weakened West after the Barbarian invasions and the protectionist silk trade of Byzantium, Muslim lands developed their own textile art and to a very high degree that matched their vibrant interest for the art. The circumstances were ripe: The conquests of the first centuries had joined in one block Spain, the Maghreb, the Byzantium Near East and the Sassanid Empire. A vigorous manufacturing activity thus fell into the hands of the Arabs—in Alexandria, Tyre and Antioch with their trade in twill—and that of the Fayums who specialised in linen cloth used as a ground weave in tapestries. This area of the trade thus opened up; natural resources circulated freely and a flourishing exchange of repertories and procedures ensued, along with the cultivation of textile fibres and plants used in dyeing. Egypt and North Africa developed a culture of indigo and Spain saffron. Traditional textiles such as wool and linen began to evolve as new textiles entered into the picture such as cotton and silk, which propagated from East to West. Silkworm breeding in Byzantine Syria, launched by Justinian (6th c.), was acclimatised in the Spanish Levant and in the North of Sicily. In Andalusia it gave birth to an industry of luxury goods based in Almeria. The weaving of lampas, which appeared in Baghdad in the eleventh century, slowly entered the textile trade in Syria, Egypt and Spain and replaced that of the Samit. The Latin West followed suit. With the vibrant growth of cities following the Muslim expansion, the luxury of the courts and the needs of the army and the navy, textile production expanded rapidly. The new capitals of Fustat, Kairouan, Raqqada, Sabra Mansuriyya, Mahdia, Fez, Madinat al Zahra, Cairo—and much later Marrakech—were among the centres that consumed and created textiles, having also the highest concentration of specialised labour. In the markets, the muhtasib (the controller), his manual always handy, would keep a close watch on the quality of the textile goods in an effort to stabilise prices. His large lexicon of fabrics covered information from procedures, the places of fabrication and sales to details about decorative motifs. And while these terms are not exhaustive when it comes to identifying all of the techniques employed, they do reveal the impact and importance of this art in Muslim culture, a civilisation that is sometimes referred to as the civilisation of textiles.”.","date":"2012-10-17","mins":"4:39 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17681","author":"charles_freeman","post":"Thanks, Diana. I have always been amazed by the Vignon markings issue. I came to Christian art via ‘pagan’ art so the development from one to the other was always natural to me and understandable. In my recent article ‘Tetradiplon The Mystery Solved?’ I reproduce one of the Fayum portraits. I am afraid I cannot claim to be a Professor, except in Italy where the local guides whom I employ for support when I am taking a study group there insist on addressing me as ‘Professore’! I am a freelance but my work tends to be published by university presses (OUP and Yale). I am open minded on the earliest date of AB. Obviously as soon as you had distinct A and B groups, AB was possible. I am sorry that the very high AB finding in the sample Kelly Kearse reports in Israel from 1977 does not appear to have been replicated. These samples from 35 years ago need to be retested. I am surprised that so high a percentage has not been the subject of further investigation as it is out of line with any other percentage for AB in a population, although i assume that in this case the skeletons may have been related to each other..","date":"2012-10-16","mins":"6:53 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17701","author":"charles_freeman","post":"With thanks also to this recent (what a nice surprise !) paper by Kelly Kearse on the bloodstains on the Shroud. I had been cautious about accepting the AB grouping as it did not seem to have been replicated but Dr. Kearse has now provided an acceptable imprimatur for AB. So we are now back to the first emergence of AB in Europe. In summary. A general view for which there seems to have be some evidence from Hungary, the area where the highest incidence of AB ( 8 per cent) is reported today, is AD 900 or AD 1000. There is the single 1977 report of a very high incidence, over fifty per cent, of AB in a very small sample of skeletons tested in Israel in 1977. There has been so much excavation in the Jerusalem area that it is amazing that there is nothing supporting this very early AB finding since 1977 and no other report of AB from before AD 900 (assuming that the one report of AB from Egypt has now been discredited) unless contributors to this blog can provide one. ..","date":"2012-10-16","mins":"10:44 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17754","author":"charles_freeman","post":"Yannick, Thank you for your supportive comment. I don’t think I need as much praise as that – the Wilson hypothesis was always a hopeless one. It was simply remembering another depiction of a cloth and then being lucky enough to discover that it was folded in a way that could be called, without hesitation, tetradiplon that allowed me to put two and two together. I don’t claim that my hypothesis is right, only that Wilson’s is clearly a non starter so one must begin to look elsewhere for the reason why the author of the Acts of thaddeus chose to use this rare word. Alas, I am just preparing for another lecture tour and won’t be back until 31st October – I may not be able to consider your other ideas before I go. Would it not be good if the meeting of the the British Shroud enthusiasts could come up with some genuine new material that we can all consider?.","date":"2012-10-17","mins":"1:36 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17774","author":"charles_freeman","post":"Yes,Yannick, I could not agree more with you. The Wilson/Scavone/Guscin deadwood has to be cleared away – perhaps leaving a few splinters where there they have raised relevant points that deserve further discussion. Goodness knows what a breath of fresh air would come into Shroud studies ( which to my mind are only one small part of my own field,the wider world of medieval relic cults) if everyone could start again with a clean drawing board. You have done a good job in showing up the hopelessness and misleading nature of much of Wilson’s work ( I leave the explanation for his motives alone does he really believe what he writes? I simply don’t know does he really not know about the parts of the texts he uses to support his claims that directly conflict with them or has he suppressed them thinking that no one would check up on him?). You have also made the important point again and again that Wilson has long been discarded and derided by the conventional world of Byzantine scholarship. Perhaps the penny will drop and Shroud researchers will start finding effective NEW avenues to explore. Will Sunday’s meeting simply be a repetition of the ‘Wilson is right’ scenario? I don’t hold up much hope when de Wessleow who seems to have swallowed Wilson’s claims uncritically is a key note speaker! I hope that someone challenges him to say what new original findings he came across in the six years research he claims to have done on the Shroud he must have found SOMETHING new to tell his audience beyond the fact that he doesn’t think it is a fourteenth century painting! I shall be out and away lecturing in Italy until the 31st so I shall wait and see what happened..","date":"2012-10-18","mins":"4:50 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-205638","author":"charles_freeman","post":"Very strange, especially as I spent some time with a researcher and producer from BBC HISTORY the other day, but the BBC is so big that everyone operates independently of each other..","date":"2015-07-14","mins":"7:48 am","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","title":"Does it Matter if the Shroud is a Fake?"},{"id":"comment-211142","author":"charles_freeman","post":"I am sorry but I thought it was common knowledge – although I first read of it in one of Barrie’s articles – that the Enrie photographs distorted the images because of their film and thus were unreliable sources. In a recent two page article of mine on the Shroud published in the (Anglican) Church Times to coincide with the papal visit to Turin, they used a close up of the face on their front cover which showed it looking completely different from the Enrie photographs and ,it seemed, from the Durante photographs. But, of course, no one should be working from photographs. I don’t expect many takers from this site for my own lectures on the Shroud but for medieval churches trying to raise sums for restoration in Suffolk, they are free and the organisers keep what they charge for their funds. The last one raised well over £ 700. The Santo Stefano model is a full size three dimensional model made, I think, in some kind of plastic..","date":"2015-09-25","mins":"12:31 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"id":"comment-211394","author":"charles_freeman","post":"Thanks,Giorgio. A professional photographer has been giving me lessons and that is her first mantra. A photograph never tells us what is really there. Yet, I was still surprised to learn, via Barrie’s article, quite how hopeless that Enrie photographs were for discerning the ‘reality’ of the Shroud..","date":"2015-09-28","mins":"1:43 am","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"id":"comment-211101","author":"charles_freeman","post":"I am grateful for Barrie for his interesting comments in one article on the orthochromatic film that Enrie used and the way it distorted the images on the Shroud. In the Santo Stefano complex of churches in Bologna there is a chapel dedicated to the Shroud which is still using a Jackson / Jumper computerised three dimensional model of Christ based on these distorted images. I was able to give my group a mini lecture comparing it with the famous terracotta Lamentation of Niccolo dell’Arca in a neighbouring church which has another three dimensional figure of Christ laid out for burial. Niccolo makes you think about how a dead body would actually look if it were laid out for burial..","date":"2015-09-24","mins":"3:30 pm","url":"https://shroudstory.com/2015/09/24/facebook-barrie-schwortz-on-inidanappolis/","cat":"exhibition","title":"Facebook:  Barrie Schwortz on Indianapolis"},{"id":"comment-215164","author":"charles_freeman","post":"I originally made the point that Michael Tite apparently said in his lecture that it was he who insisted on there being textile experts to ensure that this area was not a reweave. You need to explain why these specialists got it wrong and no one who was present had any issues with the sample. So far as I can see those with a problem with the sample were not there, were not experts in medieval weaves,and have not themselves examined this corner of the Shroud. Nor have they been able to provide even photographic evidence to suggest that the sample area is unrepresentative of the whole..","date":"2015-11-27","mins":"1:48 am","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","title":"Finally, An Explanation for the Exclamation Mark!"},{"id":"comment-215246","author":"charles_freeman","post":"We also have to remember that any reweaving,not that any has actually been found in the sample area, does not lead to a first century date. I get shirt collars mended after five years, a 1350 Shroud might well need mending in 1530. The odd thing is that that the areas that needed patching up were not patched up or only in such a way that the patching was obvious. I know of no case where a relic was touched up in a way that new material fitted with the original. I am not sure why this would ever be done, they would have wanted to preserve the identity of the original, not try to add something similar to it that might deceive anyone. In the case of the Shroud they seem to have wanted to preserve signs of a past history, the poker holes and the firemarks, not conceal them. The reweave theory never made any sense..","date":"2015-11-28","mins":"11:43 am","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","title":"Finally, An Explanation for the Exclamation Mark!"},{"id":"comment-215251","author":"charles_freeman","post":"So long as no one can see any signs of reweaving this is a futile exercise. The integrity of the Shroud was not an issue when the corners were cut off, possibly by none less that Margaret of Austria, to hand around. The reweave theory comes out of the sky and has no connection with any reality. Again and again, we have been awaiting evidence in support of it but it has never come..","date":"2015-11-28","mins":"2:22 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","title":"Finally, An Explanation for the Exclamation Mark!"},{"id":"comment-49294","author":"charles_freeman","post":"Thanks Joe but autumn is my lecturing time in the Mediterranean and I already have tours booked in for 2014 including Istanbul aka Constantinople! As I have said here before, Shroud studies seem stuck until the Shroud is given a couple of weeks or more in a top conservation laboratory where they have the latest equipment. There are, meanwhile, areas, such as the other routes to Europe from Jerusalem that seem unfairly neglected. In recent years new developments in technology have sorted long standing problems such as the Horses of St. Mark’s now dated firmly to the second century AD and the Antikythera mechanism (first century BC astronomical device) is now revealing more of its secrets thanks to new developments in imaging. So it is really more of a matter of persuading the Vatican to get in touch with one of these labs ( especially ones who specialise in textiles) and finding the funding. There has been little work down on the Shroud since 1988 so there would be a lot to reveal. Too much looking backwards, too little looking forwards!.","date":"2013-10-31","mins":"4:12 am","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-49296","author":"charles_freeman","post":"P.S. When people say that if the Shroud is not authentic, it must have been the creation of an exceptional mind, I put them on to the Antikythera mechanism to show that we often underestimate the ingenuity of earlier generations. Truth will out at some point..","date":"2013-10-31","mins":"4:17 am","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-49326","author":"charles_freeman","post":"John, I agree that this testing is not likely to happen but , while labs such as the Metropolitan Museum of Art in New York, would presumably charge for their experts to fully examine the Shroud, they are not primarily commercial. The simply point remains is that we have the Shroud and we have technology that is vastly more sophisticated than anything yet used to assess the Shroud and I shall be interested to see the results if the two get together as there will be a wealth of new data for everyone to work on. At present, there is a tedious reworking of old material and old debates based on out dated technology. I hope the conference organisers make a real effort to get some new ideas in while we are waiting for further testing on the Shroud by the relevant experts if that does ever take place! Interestingly when i was leading a tour of Tuscany that included several relic shrines two years ago, my local Italian guide told me of several examples where the Vatican or local bishops had allowed a full scientific, no strings attached analysis of certain relics..","date":"2013-10-31","mins":"10:28 am","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-49183","author":"charles_freeman","post":"No doubting my sincerity, John. Have been around as an academic historian for many years and get employed as such by respectable people!.","date":"2013-10-30","mins":"6:46 am","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-49215","author":"charles_freeman","post":"Trying to think where John’s Trojan Horse might be relevant here. I suppose if someone submits a paper to the conference, gets it accepted, and then produces something explosive instead,that would fit the bill. What other kinds of Troy might there be? Anyway the discussion has gone back to Rogers and his threads so we have lost THIS thread. I would like to see a formal statement on what grounds papers are accepted or rejected, how the choice is made,etc, simply for transparency as these papers do get published and are often cited as authoritative. We need this for both conferences if they are to have any kind of credibility. If they are primarily get togethers for people who believe in the authenticity of the Shroud then this should be made clear..","date":"2013-10-30","mins":"11:31 am","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"},{"id":"comment-210021","author":"charles_freeman","post":"Matthew, of course you can’t force anyone to believe the Shroud is authentic why would you want to anyway? There was a burial cloth in Jesus’s tomb at one point around c.AD 30. Is the cloth now in Turin it or not? It is a scientific question, as Barrie Schwortz continually reminds us. One of my contacts, who came my way as the result of my History Today article, who was working on a presentation on the Shroud told me that she could not find a clear case for the Shroud being first century anywhere. So perhaps your contribution might help her. She told me that Shroud.com does not help inquirers because it never sets out the case. I have set out my own views in my History Today article as I think the nature of the weave, the evidence for this being originally a painted cloth, the iconography of the images which are typical of the fourteenth century all concur to make it ,not a fake, but a fourteenth century creation for some other purpose which the De Charny’s tried to pass off as authentic. At least my views are openly out there, clearly expressed, and have attracted a lot of interest and support but I am not forcing you or anyone to support them! My argument stands independently of the C14 tests although they do fit with them but I can disregard them without damaging my central argument..","date":"2015-09-10","mins":"1:49 am","url":"https://shroudstory.com/2015/09/08/new-youtuibe-presentation-is-the-shroud-of-medieval-forgery/","cat":"presentation","title":"New YouTube Presentation:  Is the Shroud a Medieval Forgery?"},{"id":"comment-209942","author":"charles_freeman","post":"The latest study of Frei that I know of is the below: Boi, M. 2014. ‘Palynology: Instrument of research for the relics of the Shroud of Turin and the Sudarium of Oviedo.’ https://shroudofturin.files.wordpress.com/2015/05/palynology cis.pdf.","date":"2015-09-09","mins":"5:06 am","url":"https://shroudstory.com/2015/09/08/new-youtuibe-presentation-is-the-shroud-of-medieval-forgery/","cat":"presentation","title":"New YouTube Presentation:  Is the Shroud a Medieval Forgery?"},{"id":"comment-209978","author":"charles_freeman","post":"So what are Marinelli’s qualifications in this field? We can see from Boi’s paper that this is a very specialist area..","date":"2015-09-09","mins":"12:30 pm","url":"https://shroudstory.com/2015/09/08/new-youtuibe-presentation-is-the-shroud-of-medieval-forgery/","cat":"presentation","title":"New YouTube Presentation:  Is the Shroud a Medieval Forgery?"},{"id":"comment-209985","author":"charles_freeman","post":"Matthew don’t rule out the possibility that the pollen was brought back from the Holy Land by pilgrims – just as people are still bringing back water from the River Jordan. The fact that Frei’s pollen was overwhelmingly concentrated on one tape is indicative of the fact that it was placed on the cloth deliberately rather than drifted in at random.Cynics say,of course, that Frei placed it there himself.. . . . Lots of other similar medieval examples e.g. Soil was brought back from the Holy Land to form the Campo Santo , the burial ground in the centre of Pisa. It does seem ,however, that scholarship,e.g. Boi, and the examples Hugh gives, suggests that the pollen evidence cannot be trusted..","date":"2015-09-09","mins":"1:41 pm","url":"https://shroudstory.com/2015/09/08/new-youtuibe-presentation-is-the-shroud-of-medieval-forgery/","cat":"presentation","title":"New YouTube Presentation:  Is the Shroud a Medieval Forgery?"},{"id":"comment-210025","author":"charles_freeman","post":"P.S. I was interested to read on p. 59 of David Sox’s The Shroud Unmasked that during the 1978 tests there were several requests to touch articles on the Shroud. In particular, there was an English lady (unnamed) who brought a bunch of flowers and one of them, a rose, was indeed laid on the Shroud and returned to the lady. This cannot have been the only case where this happened and , as happened in many similar cases, one should expect to find later additions to the Shroud from all this touching. It makes any analysis of material gathered from the surface very problematic. But this point has already been made of the pigments – assumed by some members of STURP to have been later additions from painted cloths. I have my doubts (if the pigments fell onto the Shroud ,why did they not fall off again when it was next exhibited) but at least the principle that surface materials may be later additions is here accepted. The real problem with additions to the Shroud is that in the late sixteenth and throughout the seventeenth century, the Shroud was brought out and displayed almost every year so most earlier material would have fallen off if it were loose..","date":"2015-09-10","mins":"3:59 am","url":"https://shroudstory.com/2015/09/08/new-youtuibe-presentation-is-the-shroud-of-medieval-forgery/","cat":"presentation","title":"New YouTube Presentation:  Is the Shroud a Medieval Forgery?"},{"id":"comment-17975","author":"charles_freeman","post":"Thanks for posting this, Dan. I appreciate the space you give to a sceptic who nevertheless appreciates that there are mysteries surrounding the Shroud that leave many aspects of its provenance and creation open. I have consistently argues that the Wilson /Edessa trail is a false one without sufficient evidence to sustain it. I feel that it has been accepted far too uncritically. However, by discarding it we open up new possibilities of research that have not,so far as I can see, been properly explored. Wilson has acted as a deadweight on research. I leave aside the scientific aspects as I am not qualified to judge them but the following are possibilities. 1) If the Shroud originated in Jerusalem, one needs to explore the other routes by which it may have come into Europe these would include its arrival among the relics we know we transferred DIRECT from Jerusalem to Constantinople in the fourth and fifth centuries. We also need to look more thoroughly at the relic lists of the Fourth Crusaders to see if there is anything in them than could be seen as a Shroud as well earlier references to cloth being given by the Byzantine emperors as gifts at least one of which is referred to as a shroud. Then there are the many relics brought direct to Europe from Jerusalem after its capture in the First Crusade (1099) such as the Shroud of Cadouin (though this is known to be eleventh century). The reports of pollen from the Middle East on the Shroud are relevant here. 2) There is a lot of talk about weaves, linings and stitchings. These need to be brought together to provide a clearer picture of when similar weaves to those of the Shroud were being produced and by whom. It is commonly said that similar weaves and stitchings from the first century are known I would like to see pictures of these but also place them in the wider context of similar weavings from other centuries. 3). The sudarium of Oviedo was only part of a cache of relics that were together in a chest in 1075. Do the others still survive? What light would they shine on the sudarium if examined properly? 4) There are 150 Greeks words, at least, beginning with tetra almost every one relates to ‘four’ .Would an analysis of these bring us closer to understanding tetradiplon? Similarly there seem to interesting possibilities in examining the uses of Greek words beginning with ‘dipl’ such as ‘diploe’, etc. There are many more areas to research. There are many contributors to this blog who say they are ‘shroud researchers’ (although it is depressing to see how many of these seem to be repeating Wilson’s hypotheses without producing any insights of their own – I was especially frustrated by de Wesselow’s claim that he had worked on the Shroud for six years but I have not found any genuine new research in his book, The Sign!) so I hope they can take on these points. Although I have my own doubts about the early dating of the Shroud, none of these avenues of research is incompatible with the Shroud being authentic. It just needs the readiness to break out of the Wilson mindset to breathe new life into the subject..","date":"2012-10-21","mins":"11:40 am","url":"https://shroudstory.com/2012/10/21/on-the-day-of-the-bsts-meeting/","cat":"event","title":"On the Day of the BSTS Meeting"},{"id":"comment-18015","author":"charles_freeman","post":"Dave B. Thanks for this useful article. There still seems some surprise about early weaving although this has been one of the main activities of communities since the earliest times (the earliest archaeological evidence for a woven cloth now goes back 25,000 years) and very well documented even when examples do not survive e.g. The vast number of depictions of woven clothing on Greek vases the size of which can be easily measured, just as can the peplos of 430s BC shown on the Parthenon frieze. Looms are shown on vases and there are lots of literary references to wool workers in the Greek world from Homer onwards (and much earlier in the Middle Eastern sources where textile making was probably the largest industry). Everyone wore clothes that were woven. I don’t know what Diana Fulbright does not draw on the mass of this other evidence but only on the tiny and probably unrepresentative samples that survive. That is why i argued above for the wider context. By the time of Jesus weaving was considered to be the mark of the virtuous stay at home woman and the emperor Augustus (died AD 14) insisted that his wife Livia should be at home supervising the in house weaving. The problem is the same forms of weaving persisted for generations so that Gilbert Raes, as quoted by Diana Fulbright , states: “The type of weave [the herringbone pattern of the Turin Shroud] is not particularly distinctive and does not enable us to determine the period in which it was produced”. That is the problem although the Shroud is fine linen the weave does not stand out as especially distinctive. As Prof. Fulbright shows, via Flury Lemburg, that the Shroud weave is known in the Tyrol as far back as 800 BC and there are certainly medieval examples ,so one has a long time span. I notice that Prof. Fulbright appears to use radio carbon dates for cloth up to 6000 BC without comment – so there is SOMEONE who believes it is a relevant way of dating cloth..","date":"2012-10-22","mins":"4:19 am","url":"https://shroudstory.com/2012/10/21/on-the-day-of-the-bsts-meeting/","cat":"event","title":"On the Day of the BSTS Meeting"},{"id":"comment-18018","author":"charles_freeman","post":"I partially take your point but Fulbright weakens her argument for a Jerusalem source for the Shroud by giving, at the end of her article, examples of a similar weave to the Shroud from the Tyrol, southern England, Sweden, Dura Europus , Egypt and Pompeii, thus showing it was a common weave throughout Europe and as far east as Dura Europus. So what does this tell us? Just that, as Raes noted, it is impossible to date or allocate the place of manufacture of the Shroud from the weave alone so that approach needs to be abandoned. As DF has accepted the radio carbon dates for her, much older , samples without comment, I assume she would be happy to use them on the Shroud itself. Incidentally Google Images :’ Looms Greek vases’ will show that large pieces of cloth could be woven and there should be similar evidence in H. Ling Roth’s Ancient Egyptian and Greek Looms. I don’t know where the idea that only small cloths could be woven in ancient times ever came from..","date":"2012-10-22","mins":"4:48 am","url":"https://shroudstory.com/2012/10/21/on-the-day-of-the-bsts-meeting/","cat":"event","title":"On the Day of the BSTS Meeting"},{"id":"comment-17977","author":"charles_freeman","post":"Louis yes they say they are open to all on their website, but I seem only be able to find articles that support the authenticity of the Shroud in their material, so the image that they project is pro authenticity. Perhaps a full ‘minutes’ of today’s meeting will contain contributions by sceptics and one will be reassured that they are genuinely open to all. Wasn’t the Dawkins challenge always a non starter. He won’t be allowed to examine the Shroud but no scientist would ever take up the challenge without being able to examine the Shroud, assess the tests they would want to do, many of them involving new techniques, and then do them before making a judgement..","date":"2012-10-21","mins":"2:08 pm","url":"https://shroudstory.com/2012/10/21/on-the-day-of-the-bsts-meeting/","cat":"event","title":"On the Day of the BSTS Meeting"},{"id":"comment-126280","author":"charles_freeman","post":"I hope that in his paper on the Shroud in Constantinople Jack Markwardt considers the hypothesis that the cloth seen by de Clari in the Blachernae Chapel might be part of the original collection of relics brought by Pulcheria, the sister of the Byzantine emperor Theodosius II, directly from Jerusalem in the early fifth century. That might be an important new avenue of research. A small point. Search though I might ( in lexicons and biblical reference works) I have never found the Greek word sindon translated as ‘burial cloth’ as it frequently is by Dan Scavone and here again in his abstract. Perhaps someone can ask him to provide the correct reference to its use as such..","date":"2014-06-02","mins":"10:19 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126292","author":"charles_freeman","post":"Andrea. Point taken (though it is often described as the robe of Mary) but I think it is important to stress that the Blachernae collection of relics had nothing to do with the imperial collection in the palace at the other end of Constantinople. The collection had different sources and I hope Markwardt stresses this. Of course there is no reason why even if an earlier history for a cloth with an image of Christ’s body on it in the Blachernae chapel can be found what was described by de Clari as if it were a single image is the Shroud of Turin with its double image. Personally I am not convinced at all by the Constantinople link for the Shroud but I do hope that we can have some fresh ideas for research at this conference and not simply a rehashing of old ones..","date":"2014-06-02","mins":"11:50 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126314","author":"charles_freeman","post":"I agree, Andrea, in that no one seems to have thought of setting out some of the problems associated with Shroud research and then asking independent experts in other fields to come in and give their thoughts. There are lots of historical avenues, particularly relating to early relic collections in France and links between medieval France and Jerusalem, that still have not been explored. Is there any paper on linen weaving? this is another crucial area. It is worth thinking why these important areas are not actively incorporated into the programme. But I am sure everyone will enjoy the get together!.","date":"2014-06-02","mins":"2:25 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126396","author":"charles_freeman","post":"O .K. I am not presenting an argument – it is simply that these were very different shrines with different functions and collections. The collection of relics in the imperial palace was well protected and survived the 1204 sacking. The Blachernae chapel was open to the public with regular processions and displays of its relic collections ( as seen by de Clari). It got sacked in 1204 as it was so exposed on the coastline and a long way from the centre of town. There is absolutely no evidence or reason for moving a relic from the safety of the imperial palace ( where the emperors jealously guarded their impressive collection)to the exposed Blachernae in these troubled years. Access Holger Klein’s website and read his long article on the imperial relic collections. Anyway there is no reason why Jack Markwardt should not make a presentation that reflects the evidence as we know it. I would assume that he knows Klein’s work and perhaps that authority on the relics of Constantinople might even be prepared to be consulted. This is what I meant earlier about involving independent experts. Apart from researching the direct links between Northern France and Jerusalem in the relic ‘trade’, there really does need to be some more work done on linen weaving as it seems to have been neglected recently but new evidence of ancient and medieval cloth is accumulating all the time and , again, there would surely be someone who would be prepared to share what is going on..","date":"2014-06-02","mins":"11:48 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126409","author":"charles_freeman","post":"One day I will research the Hundred Years War – starting with Jonathan Sumption’s massive history to see whether relics were transferred as plunder. Margaret de Charny claimed that the Shroud came to her grandfather as ‘a spoil of war’ and he was fighting these wars against the English in a prominent position in the early 1350s so these would most likely to have been the ‘war’ in which the Shroud was a spoil. As there were many important relic collections in this region and,as the earlier 1204 crusade showed, relics could be looted in war and taken off to new homes, this is not impossible. Certainly worth including as an area of new research for the Roundtable to consider..","date":"2014-06-03","mins":"1:37 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126412","author":"charles_freeman","post":"Another point to clarify. De Clari saw a shroud in the Church of Mary in Blachernae – he makes this quite clear. This was an ancient shrine dedicated to The Virgin Mary and embellished with relics of the Virgin and a famous icon of her by Pulcheria, the sister of the emperor Theodosius II. The original shrine and its relics are lost but a modest modern shrine is on the site today. In his abstract, Dan Scavone appears to have mixed this up with the Blachernae Palace Chapel. The Blachernae Imperial palace still exists in ruins it is currently closed for excavations I nosed around there a couple of years ago in the hope of taking a group to visit it. Presumably it had a chapel but this is distinct from the ancient shrine. I read somewhere that the palace was built so that the imperial family could have closer access to the shrine..","date":"2014-06-03","mins":"1:58 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126491","author":"charles_freeman","post":"O.K. As there is not the slightest piece of evidence that any of the jealously guarded relics in the imperial palace were transferred outside the palace, surely it is futile to speculate why such a transfer might have taken place. Let’s just accept the de Clari saw a cloth with perhaps only a single image of Christ on it (cf. The Besancon Shroud) in the Shrine dedicated to the Virgin Mary, theotokos in the Orthodox tradition, in the Blachernae district of Constantinople. There is absolutely no reason to link it with any relic in the imperial collection. Looking at the crammed programme put out, hardly even time to eat anything or have a comfort break over three days, there seems remarkably little opportunity to question the speakers. How is anyone going to be able to evaluate the papers? I hope there is space for critical responses unless the main point of the conference is simply to reinforce the idea that the Shroud has to be seen as a mystery beyond any critical ,iconographic or historical explanation..","date":"2014-06-03","mins":"10:27 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126524","author":"charles_freeman","post":"Sorry,OK ,nothing that would convince a historian. De Clari does not report any crowds there and it was in the hippodrome that the emperors rallied support. Probably the cloth had probably been exhibited on a regular basis for centuries just as the icon of he Virgin in the same church had been. If you read Holger Klein ( and you must if you want to speculate about the relics in Constantinople) you will see that there’d were other relics that were paraded by emperors in the streets at times of crisis, e.g. Fragments of the True Cross and favoured icons that were always placed higher in the hierarchy of relics than any of the burial linens. Methinks it is you who are fitting the story to your agenda!.","date":"2014-06-03","mins":"12:24 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126546","author":"charles_freeman","post":"OK. What we need is evidence. There is no evidence of any transfer. Do you know how far out of town the. Blachernae chapel is? How ever would an emperor expect to rally support there? Th e emperor would appear in the hippodrome next to the imperial palace to rally support in the largest arena in he city. The relics would be paraded in the streets around the hippodrome. In both cases you are in the centre of town. We all agree that there was a cloth with, perhaps only a single, image on it in the Blachernae Church. If your Polish translator believes that this cloth is the Shroud then we need the evidence that the same cloth was transferred or looted from there and ended up in Lirey. Perhaps he has this evidence. This still does not mean, of course, that the Blachernae Shroud was originally in the imperial palace as, although there is no evidence for this, it could have been bought to the Blachernae Church much earlier and directly from Jerusalem as the robe of the Virgin Mary was. We must not overlook the fact that before the Arab conquests Jerusalem was part of the Byzantine empire and that in 420 the arm of the martyr Stephen was also brought directly from Jerusalem into Constantinople. We simply do not know..","date":"2014-06-03","mins":"2:20 pm","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-126683","author":"charles_freeman","post":"O.K. You may not know this but it is a real problem for a historian if no evidence exists that an event took place. It is not my conference but faced with so many presentations ,I wish the organisers had insisted only on papers that said something new! This is especially true of the history papers. And there is no space for any report from Bari on what they discussed there in the month before even though some of the organisers from Bari will be present in St. Louis. Perhaps they will be the same papers given by Prof.Fanti and others, but perhaps there will be new evidence that deserves further discussion in St. Louis. And no real discussion by anyone other than in one paper that the Shroud might after all, with new research that no one has yet noticed, to be shown to be medieval..","date":"2014-06-04","mins":"2:03 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-194705","author":"charles_freeman","post":"If Ray is to offer a comprehensive survey of the possible origins of the Shroud he needs to add to the ‘ masterful forgery’ hypothesis, the possibility that the Shroud was originally created for some other purpose and then adopted as a relic. This was so common an occurrence in the Middle Ages and, in fact, most so called ‘ authentic’ relics started this way, so it should not be omitted when alternatives are discussed. The forgery hypothesis has always faced the problem that without any mentions of images in the gospel accounts and with no images shown in the iconography of the burials of Christ, few people would have been taken in by a faked burial cloth with images. This partly explains why the single cloth at Cadouin which actually did come from the Holy Land and had no images on it was the number one burial Shroud for much of the Middle Ages.( It was eventually found to be an Islamic cloth, probably tenth century.) Interestingly, although we know that the Savoys bought the cloth from Margaret de Charny in 1453, the Savoys created their own legend to give it a history in the Holy Land (details in Beldon Scott’s book on the Shroud)..","date":"2015-03-28","mins":"10:54 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-194722","author":"charles_freeman","post":"Ray, there are alternative explanations which explain why the image of the head of Christ is of a man standing and why there is no sign of any of the contours one would expect if the Shroud had ever actually laid on a body. I am sure you can track them down and incorporate them into your lectures if you want your audiences to have a comprehensive survey of Shroud research..","date":"2015-03-28","mins":"3:48 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-194835","author":"charles_freeman","post":"I don’t think that the images on the Shroud as they exist now are a painting, rather the discolouration of the linen after centuries of having been covered by pigments that have now disintegrated. Whether any of the original pigments were still there in 1978 is disputed between STURP and Mc Crone but all may have disappeared by then so it is not an important point. Far more important is the evidence of the images on the outer fibrils only and the ‘large’ quantities of calcium Carbonate used to this day to seal linen before the paint is applied to the outer fibrils ( thanks STURP) There is also significant evidence from earlier depictions of a painted surface. The iconography of the pattern of the bloodstains and the neat cross cross of 372 flagellation marks on front and back, a flogging that it would have been impossible to survive or even to implement, fits well with the medieval iconography of the crucified Christ of the early fourteenth century. It all fits together well enough to satisfy my own fussy standards..","date":"2015-03-30","mins":"4:02 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-194937","author":"charles_freeman","post":"Just as one should ask forensic experts who have dealt extensively with bloodstains whether they have ever seen,in any context , in their working lives, dried blood which is red, so too one should ask experts in linen retting whether they have ever found calcium added during retting ( although flax could also be dried in the sun so this would not be an issue in this case). I was intrigued by Kelly Kearse’s suggestion in another posting that there might be evidence of rabbit protein. It was not clear to me as a non scientist what his point was but rabbit skin glue is, of course,the traditional component of gesso so if rabbit protein is there,in addition to the calcium, it might be something to do further work from ( for me at least others might like to believe that research on the Shroud has already come to a definitive conclusion and they can sit back and moan at those of us who are still actively researching )..","date":"2015-03-31","mins":"1:31 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-49791","author":"charles_freeman","post":"‘We will never be able to prove or disprove the shroud’s authenticity’ Interesting. Can one be sure that there will never be a test that proves that the Shroud is no more than six hundred years old?.","date":"2013-11-03","mins":"3:26 pm","url":"https://shroudstory.com/2013/11/02/russ-breault-in-decatur-alabama-this-sunday/","cat":"event","title":"Russ Breault in Decatur, Alabama this Sunday"},{"id":"comment-194958","author":"charles_freeman","post":"Thanks, Kelly, for the clarification..","date":"2015-03-31","mins":"7:48 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-49102","author":"charles_freeman","post":"Can anyone enlighten me on these conferences? When I read papers from those held in the past they only seem to include papers from those who believe the Shroud is authentic,in fact they even seem to be used primarily as a meeting place for old friends (nothing wrong in that). So if someone sends in a paper arguing in favour of the radiocarbon dating or a haematologist sends in a paper disputing that there are bloodstains on the cloth , do they get rejected or accepted on scientific merit? It is a pity that there never seem to be actual debates perhaps I am wrong but it seems to be largely papers read out. I would certainly like to see a DEBATE on the alternative routes from Jerusalem that a burial cloth might have reached northern France in view of the fact that we have early relics close to Lirey that were said to have come from ‘the Lord’s tomb’ as well as all the crusader evidence of cloths being brought back to France from crusades earlier than the 1350s. These seem to have been relevant but completely neglected in favour of the Edessa route (that as a historian, I can find no merit in but could be included as one of the alternatives by someone who believes in it)..","date":"2013-10-29","mins":"8:59 am","url":"https://shroudstory.com/2013/10/26/st-louis-conference-dates-announced-october-9-12-2014/","cat":"event","title":"St. Louis Conference Dates Announced: October 9-12, 2014"},{"id":"comment-162215","author":"charles_freeman","post":"Professor Fanti is a scientist who appears to believe that science can only get you so far and there is much that remains unknown. Most scientists would agree, but the vast majority, looking at the progress of science over the past years, are convinced that some but perhaps never all of the unknown will be discovered by science. Fanti prefers to insert the miraculous at an early stage. However, the manifest problems over his dating methods, the vast range of dates, the lack of validity in his methods, the adjustment of the most awkward of his dates but not the other two, the mysterious averaging process of three disparate dates, has meant that he could not be taken very seriously. That is why his dates that caused so much publicity even in mainstream sources when he first published them, then vanished quickly without trace..","date":"2014-10-14","mins":"12:30 am","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","title":"\"Just the facts, ma’am.\""},{"id":"comment-128411","author":"charles_freeman","post":"Perhaps we can solve here the reference that establishes ‘sindon’ as a burial cloth. It is regularly translated as such by Dan Scavone but I cannot find such use in any lexicon or Bible commentary that I have. Normally it is ‘linen cloth’ or ‘fine linen’ and no more than that (the derivation appears to be from Sind in India). The ‘fine linen’ can, of course, be used in many contexts such as a burial cloth, the garments of the priests, altar cloths,etc but I know of no direct translation as a burial cloth. It is an important point for Shroud researchers because if we are reading a Greek text that uses the word ‘sindon’ it is important to know whether it might be referring to a burial cloth. I am not going to reopen tetradiplon. If it means doubled four times that is, of course, sixteen layers as seen on the cloth on the Parthenon frieze. It only takes three doublings to achieve eight layers..","date":"2014-06-11","mins":"3:39 am","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-128570","author":"charles_freeman","post":"Martial and Jerome were, of course, writing for the Latin speaking west which did adopt some Greek words and may have used them in different contexts but this is not relevant when we are speaking of Greek or Syriac texts in the eastern part of the empire. The Acts of Thaddeus were in Greek and sindon would have its normal Greek meanings,.","date":"2014-06-11","mins":"3:48 pm","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-128566","author":"charles_freeman","post":"Edessa would have been most unusual if Latin had been spoken there as in the east it was hardly used outside the administration that had to issue all decrees in a Greek translation to make itself understood. It was the administration that turned to Greek in the seventh century thus linking itself to the language of the Byzantine elite. When I researched this in depth a few years ago I was actually quite surprised at how little Latin was spoken in the east..","date":"2014-06-11","mins":"3:28 pm","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-128729","author":"charles_freeman","post":"It looks, from these assembled comments, that one cannot translate sindon as burial cloth except in very specific circumstances: in Christian texts referring to the empty tomb, possibly only the gospels. This would not apply to the the tetradiplon cloth in the Acts of Thaddeus as the same text refers specifically to the burial cloths of Jesus later in the text as separate from the tetradiplon cloth that was unwrapped for Jesus to wipe his face on. I still think tetradiplon is used to give ceremonial status to the cloth that was given to Jesus and that the term refers to four doublings , e.g. Sixteen layers as shown in the ceremonial cloth handed over on the Parthenon frieze. I can’t see how the word can be manipulated to achieve eight layers and Wilson’s depiction is, as already pointed out in a posting on this site some time ago, misleading..","date":"2014-06-12","mins":"4:55 am","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-128768","author":"charles_freeman","post":"Thanks, I have read it and remain unconvinced. There is no way that the Image of Edessa can be the Shroud and every professional Byzantine scholar who has read the evidence agrees with me..","date":"2014-06-12","mins":"8:06 am","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-128773","author":"charles_freeman","post":"What I can’t understand is why Dan Scavone seems to be repeating this paper at the conference when one can read it beforehand and the conference is already overcrowded. I don’t know of any significant evidence in favour of the Shroud’s authenticity but if one applied Occam’s Razor to the problem of how a relic from Jerusalem might have reached northern France by 1350 ,one would start with the many direct (and documented) contacts between the two regions rather than construct a tortuous journey with a five hundred year gap at the beginning and a 150 year gap at the end with an unsubstantiated linking of the Shroud with the Image in between. But there you go..","date":"2014-06-12","mins":"8:44 am","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-128884","author":"charles_freeman","post":"I am not into brawls – I am into evidence, or the lack of it, and searching out all possibilities. We know that relics from the Lord’s tomb came to Northern France, not far from Lirey in the first millennium and although there is no evidence that a shroud was among them, there is no reason for discounting the possibility. Again we know of many relics coming into France from the Holy Land during the Crusades. Again no reason to rule out the possibility that a Shroud was among them – or should I say another shroud as that of Cadouin is well known. I still think that a medieval origin for the Shroud is more likely but I find myself in the odd position of being the person who is advocating research that might actually lead to it being found to be authentic – if only the Edessa/ Constantinople red herring could be thrown back into the sea, well actually the Bosphorus!.","date":"2014-06-12","mins":"5:48 pm","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-129012","author":"charles_freeman","post":"De Charny is unlikely ever to have seen the chapel at Lirey as he was totally occupied with diplomatic and military missions for the king in the years until his death at Poitiers in 1356. Kaeuper and Kennedy’s introduction to de Charny’s Chivalry (1996) suggest it was Jeanne who transformed what had been an icon into a relic. This would make the Shroud analagous to the Shroud of Besancon whose status changed when a man was apparently brought back from the dead in its presence.This simply made it a object of veneration which is the same status the Church gave in the 1390s and still gives to the Shroud. The question of a fake does not come into it as there were many objects that were never believed to be the originals but which were associated with miracles.I suspect that this is how the Shroud began its spiritual life and this is certainly what Kaeuper and Kennedy argue. I am quite happy for daveb to offer a critique of my ‘Misguided Journey ‘ if he wishes to do so – I am not sure whether he has read it yet. I cannot see why i should think I am wrong until there is some alternative evidence provided that trumps mine. Again and again when I checked Wilson’s sources I found that they were wrongly used. His claim that the word tetradiplon was used of the Shroud AFTER Jesus wiped his face on it instead of before is just one instance in his 2010 book. And it does not take long to dismiss the Pray Codex there is a stepped pyramid pattern on the tomb cover, not a herringbone, and the holes are circular not ragged as the poker holes on the Shroud are. The ROUND holes are found in several depictions of the tomb lid as there were actually round holes drilled into the Sepulchre in Jerusalem which were copied by artists. I suspect that the reason why no one has followed up the French connections is that no one was aware of them. I refer you to Michael Mc Cormick’s Origins of the European Economy, Cambridge, 2001. He studies the early relic trade in France in detail and on page 303, he lists relics that are found at Sens, only 90 kilometres from Lirey, that came in from Jerusalem the eighth century. There are three specific relics listed as having come from the ‘Lord’s tomb’. This shows that there was a direct link between Jerusalem and northern France in the relics trade including relics from the tomb. Now if that is not evidence that deserves further exploration i don’t know what is. To describe it as “merely a distraction and chimera’ is ridiculous.And why is Daveb so frightened of new research he would not last long as a historian!.","date":"2014-06-13","mins":"3:12 am","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-128531","author":"charles_freeman","post":"Thanks for the erudite reply, Hugh! I think this solves it satisfactorily so far as I am concerned. The Acts of Thaddeus, as is well known to those who have read the whole text, refer to two cloths. The first is the sindon tetradiplon that was unwrapped for Jesus to wipe his face on. It would seem that sindon could not be translated here as burial cloth as it has no relationship with the empty tomb of the gospels. The second reference to a cloth in the Acts specifically refers to the burial cloths from the tomb and this confirms that the first sindon cannot be Jesus’ burial cloth. Yet Dan Scavone may yet surprise us all by bringing up a meaning of sindon that does allow it to be translated as ‘burial cloth’ in the first context..","date":"2014-06-11","mins":"12:38 pm","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-128219","author":"charles_freeman","post":"There is a real problem here. Paper after paper is going to be rolled out in St. Louis,one half hour after another ( in some cases the Abstract seems half an hour long in itself!) In this case, and presumably there will be others, the subject matter is hotly controversial. So how is anything coherent going to come out of the conference?.","date":"2014-06-10","mins":"10:30 am","url":"https://shroudstory.com/2014/06/10/anticipating-the-conference-mark-antonacci-on-testing-for-radiation/","cat":"st_louis_2014","title":"Anticipating the Conference:  Mark Antonacci on Testing for Radiation"},{"id":"comment-128425","author":"charles_freeman","post":"One need not to be too pessimistic if the organisers are on top of the problem. Book festivals have similar tight programmes but everyone is warned long before that they will be cut off just before their allotted times ends. ( I once had a large clock face waved at me!) if the presenters know this they will adjust their presentations to last less than half an hour. If the speakers are allowed to go on then it will be like having an oversized stone at the bottom of a pyramid, the whole thing will be thrown out. My worry,however, is that, judging from the Abstracts, many of the presenters seem to have enormous amounts to get through ( as most authors at book festivals do if given the chance!) but there should be ample time to get them to slim down before October if the problem is recognised.e.g as virtually everyone of Dan Scavone’s texts is already known he might concentrate on just one or two and examine them properly or only discuss those which have not been revealed before..","date":"2014-06-11","mins":"5:06 am","url":"https://shroudstory.com/2014/06/10/anticipating-the-conference-mark-antonacci-on-testing-for-radiation/","cat":"st_louis_2014","title":"Anticipating the Conference:  Mark Antonacci on Testing for Radiation"},{"id":"comment-126784","author":"charles_freeman","post":"I am certainly interested in his ‘geographical circumstance’ and ‘ locale’ , unspecified in the Abstract, as I shall be interested to see which ‘locale’ of Europe he locates the creation of the Shroud in and why. This was still a continent of diverse cultures and traditions (e.g Gothic architecture seldom travelled south of the Alps) and presumably he thinks one of them more likely to have inspired the Shroud than the others..","date":"2014-06-04","mins":"11:33 am","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins"},{"id":"comment-162057","author":"charles_freeman","post":"Yes, I was quite disappointed that I couldn’t make any comment on that posting. My wife was quite surprised that I had grown over four foot in a single night and did hope that Jack had credited her for the picture, taken in front of a door of our medieval parish church. I think the door behind me is medieval but there is no point in radio carbon dating it as some later carpenter has probably invisibly mended it..","date":"2014-10-13","mins":"2:39 pm","url":"https://shroudstory.com/2014/10/11/chart-of-conference-well-so-far-anyways/","cat":"st_louis_2014","title":"Chart of Conference. Well, So Far, Anyways"},{"id":"comment-161353","author":"charles_freeman","post":"Mechtild Flury Lemberg wrote an article on the reweaving – I haven’t got the reference as I am in Greece that showed her full examination showed no sign of any reweaving. She insisted that it would have been impossible to do a reweave without it being visible at least from the back. She took Rogers, Benford, Marino to task for failing to explain where they thought the reweaving might actually be presumably it had to stop somewhere but they provided no evidence where. She certainly could not find it anywhere unless it was completely within the sample area. I don’t think I am misrepresenting her but she came across as very dismissive of Rogers..","date":"2014-10-11","mins":"12:07 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","title":"St. Louis, Friday Morning"},{"id":"comment-162635","author":"charles_freeman","post":"It is not so much myself you must question, Piero. The publication of Fanti’s dates was a classic case of how news operates today. ( See Nick Davies’ book Bad News.) A story is released – in this case just before Easter. Newspapers reprint it in order not to miss out without doing any research on Fanti, or the mathematics and science behind the story. Then they do the sums, realise that you cannot have three such different dates from a credible method of dating, that changing one date but not the others doss not work, and that it is meaningless to average three dates when only one at the most ( and maybe none of them) Is valid. So the story is no longer taken seriously but no one apologises for printing it without checking it first. It is then not surprising that Fanti can find no supporters in the mainstream academic world and rude people called him Professor Fantasy. There is a real problem about Shroud research in general. It is very isolated from the real world. Was there any attempt at the St. Louis conference to invite a wider sceptical audience or was there just the assumption that the case for authenticity was so obvious there was no need to bother? Jack M. Whose paper I look forward to reading does seem to have realised that much of the history of the Shroud does need to be rethought even if he has to frighten the audience by posting up a ten foot picture of me!.","date":"2014-10-15","mins":"12:37 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"}]
