[{"id":"comment-215489","author":"charles_freeman","post":"De Clari says nowhere that the cloth he saw in the Blachernae church was the most precious relic in Constantinople. In this particular church it was the famous icon of the Virgin which, it was claimed, saved the city from capture in 626. De Clari does not mention whether the cloth he saw was subject to the major processions before the crowds that the icon was. The relics in the Pharos Cahpel in the imperial palace were much more important than any of the ‘shrouds’ mentioned in the documents. You can find,online, the important survey of these relics by Holgar Klein,’ Sacred Relics and Imperial Ceremonies at the Great Palace of Constantinople’. You will see that no shroud comes anywhere among the relics that were incorporated in the major imperial ceremonies. It was the public processional display of a relic that marked its importance, that or its incorporation into one of the major imperial rituals such as the coronation of the emperor. The Savoys did manage to incorporate the Shroud into their ducal rituals, both religious and familial ( e.g weddings.)..","date":"2015-12-02","mins":"11:23 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215523","author":"charles_freeman","post":"Joe some relics were on permanent display as they still are in many Catholic Churches.The fact that it was brought out on a Friday but is nowhere else listed or mentioned in any other relic list suggests that it was not seen as especially important. As I have said it was the icon of the Virgin which was this church’s top relic and it was exhibited in procession. Remember also that the Blachernae church was outside the walls of Constantinople. It was an important shrine because of the icon which had been there since the fifth century but we would have known from the documentary record if the shroud there was considered important. Just because de Clari saw what appears to have been a single, not a double, image does not make it important Do read Klein as he is good on what WAS important among the prestige relics of the imperial family..","date":"2015-12-03","mins":"2:17 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-206275","author":"charles_freeman","post":"The three in one herringbone is still used today for church vestments and it was this weave that was chosen for the chasuble for the inauguration of Rowan Williams as Archbishop of Canterbury. The reason is that the silk shimmers in the light. Extensive studies of this weave shows no example before a few silk fragments in the third century AD which had, of course, to be made on very special looms. The standard ancient twill is 2/2 but shrouds.e.g. Those from ancient Israel tend to be plain weave, as detailed by Omit Shamir in the article on Israeli textiles posted on this site recently. Hugh is right that fabrics of extraordinary quality were produced in the Middle Ages, far finer than the Shroud. The density of the weave is not exceptional among other painted cloths where 38 threads in both warp and weft can be found.e.g. Finer than the Shroud weave. Linen was the downmarket fabric, compared to ,say, silk. The Cistercians deliberately had their vestments made in linen as part of their rejection of the opulence of normal church vestments. We have quite a lot of prices from inventories and a painted linen was worth about as tenth as much as the same picture painted on board. So I am not sure how Stephen Jones has come to believe that the Shroud would have been expensive n comparison to other fabrics. Three in one herringbone is much easier to weave on a medieval treadle loom as it is easier to manipulate with your feet the several heddle rods needed. N.B. The Holkham Bible (1330), naked Christ, all over scourge marks, similar patterns of bloodstains on the head. Michelle Brown, the authority on these illuminated manuscripts, thinks the Bible may have acted as a pattern book for lesser artists to copy. Interesting..","date":"2015-07-21","mins":"8:43 am","url":"https://shroudstory.com/2015/07/21/a-rare-piece-of-cloth/","cat":"history","title":"A Rare Piece of Cloth"},{"id":"comment-208721","author":"charles_freeman","post":"Mark Guscin talks of the ‘features typical of the Image of Edessa; long hair and beard, oval shaped face and large open eyes'( pp.293 4) and he appears .e.g on p.317 to suggest that these might be original to the Image of Edessa. I am amazed that his advisers did not point out the emergence of the bearded image of Christ much earlier in Rome. It is easy to access the digital version of Paul Zanker’s The Mask fo Socrates. Zanker dates the earliest surviving depictions of a bearded Christ to AD 300 and in illustration no. 162 you can see a good example from that date. By the sixth century the bearded image has transferred to the east.e.g Zanker’s illustration no 166, St.Catherine’s ,Sinai, and it would seem that the face of Christ on the Image of Edessa derives from this. There is no Zanker in his Bibilography. I was also surprised that Guscin did not stress that tetradiplon only refers to the cloth when it did not yet have an image on it. There is no documentary evidence to show that it was folded with the image on it. Wilson has misled many here. As I have mentioned before, it seems strange that Guscin describes the Image as vanishing in 1204 when it was always in the un looted Pharos Chapel throughout the sack. I also think Guscin is being rather rigid in assuming that references to images of Chirst in Edessa always refer to what was taken to Contantinople in 944. Not only were images of Christ quite common from the fourth century but often there was a sequence of the same relic. This was inevitable when so many were lost or destroyed. Replacements either carried on the sacredness of the one they replaced ( e.g. The Volto Santo in Lucca) or were said to be the old one lost but then miraculously found again ( e.g. The rediscovery of the lost body of St Mark in a column in St.Mark’s.) One must at least consider that the Image of Edessa may have had different versions in sequence , perhaps some on wood, some on cloth..","date":"2015-08-22","mins":"8:19 am","url":"https://shroudstory.com/2015/08/10/a-superbly-detailed-exploration-of-the-image-of-edessa/","cat":"history","title":"A superbly detailed exploration of the Image of Edessa"},{"id":"comment-206306","author":"charles_freeman","post":"You may well struggle, Thomas, but most public relics (as against private collections where it was easy to dupe the unwary) had started their lives as something else and were adopted by those hoping to set up a shrine. In many cases the owners of the Shrine genuinely believed that they had the real thing although the Shroud is unusual in not having a back story (compare the chest of relics from Christ’s Passion found at Oviedo, for instance). The dukes of Savoy created one which told how the Shroud had been given by the patriarch of Jerusalem to the Lusignon family and that ti came to Chambery via Cyprus. However, we have no evidence that the Lirey shrine attracted any of the elite and it was quickly suppressed until Geoffrey the Younger managed to find a way of exhibiting the Shroud with official ( papal) approval in the 1390s. It was this kind of compromise that allowed relic shrines to continue at a time when papal approval was needed for a new shrine to become ‘legal’. I think genitalia, the seat of sin according to Augustine, were more likely to be banned than buttocks although these did come in for censure at the Council of Trent in the more prurient climate of the Counter Reformation...","date":"2015-07-22","mins":"4:17 am","url":"https://shroudstory.com/2015/07/21/a-rare-piece-of-cloth/","cat":"history","title":"A Rare Piece of Cloth"},{"id":"comment-208756","author":"charles_freeman","post":"De Clari obviously was not looking at the Image of Edessa which is described in 944 as very faint and difficult to see. He saw a whole body which was obviously easy to see. Like many images on cloth the Image had clearly deteriorated by the time it g Ot to Constantinople – all the sources agree on that. Even kept locked up in its case it would not have got any better. The sources ,that Guscin quotes,make. It clear any viewing was restricted there is not a scrap of evidence it went anywhere else before Louis IX bought it in its box. Guscin has done important work in showing that the Image is not the Shroud if some of us ever needed convincing on that point. I am surprised his examiners/ advisers did not get him to discuss the documented version that the image went to The Sainte Chapelle, an itinerary that many distinguished Byzantine scholars support ..","date":"2015-08-23","mins":"5:26 am","url":"https://shroudstory.com/2015/08/10/a-superbly-detailed-exploration-of-the-image-of-edessa/","cat":"history","title":"A superbly detailed exploration of the Image of Edessa"},{"id":"comment-208782","author":"charles_freeman","post":"Clarification. By ‘ documented version’ I meant the original documents e.g the one by the crusader Villehardouin that categorically states that the Chapel of the Pharos where the Image of Edessa was preserved in its box was handed over intact to the new Latin emperors in 1204( which gave them the right to sell the relics). There is no documentation that any of the many relics recorded in the Pharos Chapel had been moved from there before the Fourth Crusade. Guscin only quotes secondary sources on the Sainte Chapelle transfer. He does not quote the many documents that Andrea Nicolotti has found that refer pretty clearly to a box with the cloth in it in Paris. Nicolotti also quoted the deed of transfer. There is not a shred of evidence that the Image went anywhere else despite the attempts by some to link it to the similar looking Veil,of Veronica. If one wanted to earn anything from a relic it really had to be either in a superb reliquary or clearly visible in its own right. It is clear that the Image of Edessa had faded from its original state even by 944 and so was never exhibited in Constantinople. This probably explains why it was so low on the list of relics by the thirteenth century the Crown of Thorns really could be shown off!.","date":"2015-08-23","mins":"11:02 am","url":"https://shroudstory.com/2015/08/10/a-superbly-detailed-exploration-of-the-image-of-edessa/","cat":"history","title":"A superbly detailed exploration of the Image of Edessa"},{"id":"comment-210915","author":"charles_freeman","post":"Donnelly’s assessment is very much in line with what recent ancient textile experts tell me the Shroud is the typical work of a medieval treadle loom. The 113cm is a pretty standard width, compare the six linen strips of the Zittau Veil, another treadle loom product, which average just this,6. 80 m in total..","date":"2015-09-22","mins":"1:33 am","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","title":"Another Overwhelming Evidence Argument?"},{"id":"comment-166649","author":"charles_freeman","post":"I don’t know whether Barrie has read my article or not but he seems to confuse depictions of expositions that are the basis of my research and copies of the Shroud which I don’t deal with. Some of these copies are so different from the Shroud that I suspect they may be other examples of grave cloths rather than intended to be copies of the Shroud. This might be an important lead in that it will help with one of the biggest problems – why two images instead of one. There appear to be some Spanish cloths that might be double images and mistakenly seen as copies of the Shroud rather than independent paintings. Another area where there is lots to be done. Of course, I would argue that the artist of the Shroud was drawing on traditional iconography ( much of it such as the overall flagellation very recent) rather than traditional iconography being inspired by the Shroud. Still the Herald has told where my article can be found so that readers will doubtless access it to make up their own minds – if these are not already closed!.","date":"2014-10-29","mins":"3:27 pm","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"id":"comment-166805","author":"charles_freeman","post":"Most of the points raised by Dave B are covered in my article. A lot of it is concerned with placing the iconography of the Shroud alongside fourteenth century equivalents..","date":"2014-10-30","mins":"3:04 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"id":"comment-166836","author":"charles_freeman","post":"Thomas as I make clear in my article, the artist was recreating an image that might have been left if the Shroud had contacted the body and so he attempted a negative, primarily by moving the wound from the conventional right to the left. As I discuss in my podcast, the similarity between the pattern of bloodstains on the Shroud and those on fourteenth century examples such as the Holkham Bible ( 1330) and the Roettgen Pieta are so close ( drops around the Crown of Thorns, blood running along the arms) that I wonder whether there was a template that artists copied when making these Shrouds. It may even be possible that the painting is in fact an imposed pattern but it seems clear from the early descriptions that the quantity of ‘blood’ on the Shroud ( see examples in my article) was so great that it may have been added separately. I agree that two images, which, as I say in my article, could not be from the same body unless it had longer arms than any others known to anatomists,needs further research. (One of the consistent features of early depictions is a space between the elbows and body on the back image lie down in this pose and your arms won’t meet in the front!) Double images are quite common in Byzantine art so that is one starting point. It is also a possibility that some of the so called copies of the Shroud are not copies at all but independently made double images these seem to come mainly from Spain so research needs to concentrate there. Again and again I make the point that there are many areas of research on the Shroud that have not yet begun. We have a long way to go before we know whether my proposals have academic support or not. The first reactions I have from medieval experts have been supportive I don’t think there is anyone commenting on this site who has any academic background in medieval iconography and ritual but there are people who have..","date":"2014-10-30","mins":"5:15 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"id":"comment-166795","author":"charles_freeman","post":"They did not keep it secret – see your Beldon Scott who details the expositions. It was not until it was moved to the new Savoy capital in 1578 that they had a big enough display area to make a ceremony of the exposition. Beldon Scott is excellent on this. My article is rooted in medieval iconography and ritual. STURP knew nothing about this and there are no references in any STURP report to these areas. I have found nothing in any STURP report that places the Shroud within that small but crucial period of 0 to 30 AD. But their finding of calcium carbonate and an image on the outer fibrils fit well with what medieval craftsmen manuals advise for preparing a surface for painting..","date":"2014-10-30","mins":"2:38 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"id":"comment-166806","author":"charles_freeman","post":"P.S.Forgery. The time the Savoys got the Shroud it had already been accepted by the Church as worthy of veneration with an indulgence attached. For the historian of relics one of the fascinating things is to see how an object of veneration was transformed into an actual relic as happened here. I do wonder whether people commenting here have actually read my article as one of my main themes is that that Shroud was never the forgery of a burial cloth but produced for a completely different function – probably the Easter ceremony of Quem Queritis where a grave cloth had to be held up in front of the empty tomb to show that Christ had risen. See the Lirey pilgrim badge for the way it was done note the empty tomb under the Shroud..","date":"2014-10-30","mins":"3:08 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"id":"comment-166796","author":"charles_freeman","post":"Well you might laugh for all you are worth but this is what the medieval manuals advised as the means of putting on gesso. If you put it on with a brush then it is hard to remove excess, if you put it on with a knife you can scrape off the excess. The aim was to keep the gesso layer as thin as possible across the outer surface of the cloth..","date":"2014-10-30","mins":"2:41 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"id":"comment-17486","author":"charles_freeman","post":"That is because he left the burial cloths in the tomb and after his resurrection he had returned to life so one would never depict him still in a burial cloth!.","date":"2012-10-11","mins":"10:46 am","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","title":"Charles Freeman:  Tetradiplon – the Mystery Solved?"},{"id":"comment-17498","author":"charles_freeman","post":"Well, I have found it and this is certainly not a depiction of the Turin Shroud and it does not look much like a himation either so I am not sure what the point you are making is. Please explain..","date":"2012-10-11","mins":"12:53 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","title":"Charles Freeman:  Tetradiplon – the Mystery Solved?"},{"id":"comment-17367","author":"charles_freeman","post":"Max. No, I do not suggest a larger cloth. I am only concerned with the METHOD of folding and I am not suggesting that the Image of Edessa was as big as a peplos. The example I use in my illustrations in my article is of a table napkin. I think the Image of Edessa was probably larger than this but the illustrations of it that survive ( which may not represent it as it really was,of course) are not much bigger than a table napkin. It would, of course, have been quite small when it was folded up tetradiplon to be given to Jesus to unfold before he wiped his face with it. The illustrations of the Image of Edessa show clearly that whoever painted them did not believe that it was a folded cloth and there is no other evidence that it ever was folded after Jesus’ face was imprinted on it ( as those who read my full article will discover)...","date":"2012-10-09","mins":"9:35 am","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","title":"Charles Freeman:  Tetradiplon – the Mystery Solved?"},{"id":"comment-17495","author":"charles_freeman","post":"If the body is clothed in a himation then this is not the Turin Shroud which covers the head – a himation certainly does not. So is Nicholas de Verdun making the argument that the burial cloth of Jesus is a himation and thus cannot possibly be the Turin Shroud as we know it? It would help if you could provide the link to the article you cite. Thanks..","date":"2012-10-11","mins":"12:50 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","title":"Charles Freeman:  Tetradiplon – the Mystery Solved?"},{"id":"comment-17508","author":"charles_freeman","post":"The gospel sources ( see John Chapter 20) make it clear that the burial cloths were found in the tomb BEFORE Jesus was seen resurrected. So when he was seen by Mary Magdalene he was either naked or dressed in some conventional clothing of the time. We would have surely been told if he was naked so I assume the latter and he may have been wearing a himation. What is absolutely clear, if this gospel source is to be believed, is that Jesus could not possibly have been clothed in the cloths in which he was buried unless he magicked them out of the tomb and got them on AFTER Peter and the other disciple had seen them lying in the tomb!.","date":"2012-10-11","mins":"1:31 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","title":"Charles Freeman:  Tetradiplon – the Mystery Solved?"},{"id":"comment-17380","author":"charles_freeman","post":"Yannick yes ,I completely agree with you. I think the author had heard of the ceremonies in which a cloth had been folded Tetradiplon as in the Parthenon ceremonies and thought it would be a good embellishment to the legend to add in the term here. Who knows whether Leo the Deacon had the same idea when he used the term peplos? So I agree with you that this is most likely purely a literary creation and that in reality the Image of Edessa was never folded except when it was stored..","date":"2012-10-09","mins":"4:03 pm","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","title":"Charles Freeman:  Tetradiplon – the Mystery Solved?"},{"id":"comment-17391","author":"charles_freeman","post":"Thanks, Yannick. Yes, we are on the same lines. As you will see from my full article, I think that the mention of the tetradiplon folding was purely imaginary on the part of the author of Acts of Thaddeus although I make the point that even a table napkin CAN be folded tetradiplon so that the author of the Acts of Thaddeus could have known that the Image of Edessa was quite small but still could be IMAGINED as folded tetradiplon. I have been trying to get the exact reference for peplos made by Leo the Deacon but it is clear that I will have to find it in the Cambridge University Library I am just between leading tours to Istanbul and Trieste so I don’t think I have time to get there ( 70 miles from me) but if I get further i will let you know. Several books cite the use of the word by Leo but we should try and track down the original if we can as we all know that some citations in books about the Shroud prove not to be what they say they are when the original is checked! It is, of course, only an interesting sideline in my argument why did this particular word get used over five centuries after the end of the ceremony of the peplos on the Parthenon? As we know references to a larger garment always refer to garments worn by living people,never to a shroud. Good researching!.","date":"2012-10-10","mins":"4:37 am","url":"https://shroudstory.com/2012/10/09/charles-freeman-tetradiplon-the-mystery-solved/","cat":"history","title":"Charles Freeman:  Tetradiplon – the Mystery Solved?"},{"id":"comment-15768","author":"charles_freeman","post":"May I summarise why I entered this debate. My book Holy Bones, Holy Dust, How Relics Shaped the History of Medieval Europe was published by Yale University Press in 2011, the paperback is due out next month. If you go the Yale University Press US website and access the book and then click on reviews you will see that it has been well received by the academic community (after all, it is published by a university press),including the Catholic press. In the medieval world the Turin Shroud was one of many thousands of relics claiming to be from the first century it did not stand out from the others and I did not discuss it. I knew a little of Ian Wilson and knew that among the historians I had read on relics he was never taken seriously. He could be ignored. However, I was then sent a copy of Thomas de Wesselow’s new book The Sign in the hope that I would review it. Dr. De Wesselow is billed as a brilliant Cambridge art historian and it appeared that he was a man of high academic credibility. He claimed that he had spent several years working on the Shroud. I disagreed, as everyone else had, with his thesis that the Shroud helped create the early Christian communities, but I was amazed to read that after all his years of study he agreed with Ian Wilson all the way through. So Ian Wilson who is not taken seriously by anyone in the academic world was being given an imprimatur by ‘a brilliant Cambridge art historian’. This is when I decided that I would set out the main objections to Wilson’s theories, which as Yannick Clement is pointing out again and again, collapse as soon as they are properly examined. I have since written a second article ‘The Tetradiplon Revisited’ in which I pay tribute to Yannick Clement and others on this very site for alerting me to the way that Wilson has misguided us about ‘tetradiplon’. Stephen Jones used a Wikipedia article about me which he claimed I had written myself. I had not, I knew nothing about it and it is very limited. I have written a short biography which is in the Authors’ section of Yale University Press LONDON ( e.g. Not the US site). I am sorry that Stephen Jones has been so misleading about me. I accept his withdrawal of his comments that I am a ‘hired gun’ who would even write what I knew to be false in order to make money.This is a serious accusation when I have to try and sell books to university presses ( I am also published by Oxford University Press)!! I hope he is more careful in writing his blog in the future. He can, of course, continue his long attack on my articles but,as one commentator has already said, his work on this is ’embarrassing’. I see no reason why I should respond to him..","date":"2012-09-03","mins":"3:11 am","url":"https://shroudstory.com/2012/09/02/charles-freeman-the-manifold-problems-with-wilsons-hypotheses/","cat":"history","title":"Charles Freeman:  the manifold problems with Wilson’s hypotheses"},{"id":"comment-172341","author":"charles_freeman","post":"Well, my argument was already put up there in brief and rather than pretend to be anonymous or use a false name, as seems to be possible, I provided a clear summary of my argument with my name attached. ( I did not realise that I had left the ‘s’ off until I had posted it but it is quite obvious it is me.) Of course, I expect critiques of my argument, as is the case with other information posted on this site..","date":"2014-11-21","mins":"4:27 am","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","title":"Charles Freeman’s theory now in Wikipedia"},{"id":"comment-172426","author":"charles_freeman","post":"Art science. Thanks for an interesting posting. With the Shroud,of course, you have several hundred years during which the Images were subject to all kinds of treatment. I don’t think there is any evidence that, other than the bloodstains, the pigments penetrated below the surface as they should not,of course, if Ceninni’s instructions had been followed. My own feeling is that the presence over several hundred years, perhaps into the nineteenth century, of the painted surface images , may have left shadows below. It is a pity we do not have several hundred years to experiment. One of my illustrations in the lecture I have given is a panel from the Zittau Veil in which the figures ( originally painted on linen cloth in 1472) are amazingly similar to those of the Shroud in their ghostlike appearance. I think my audience who had thought that the images on the Shroud were like no other were quite surprised to find that there were comparative samples although I need to find many more to consolidate the point. The Zittau pigments came off when the Veil was used as a steam bath cover by Russian soldiers in the Second World War. So perhaps you could try steaming your painted cloth. However, you still have the problem that the surface images have only been on a short time and it may be that the similarities between the Shroud and the Zittau Veil were because both had had the pigments covering the outside of the cloth for several hundred years and this left an impression that we can see when the pigments and gesso had disintegrated. However, I know of someone trying to recreate the Shroud as if it were a medieval painting but we still have the period of finding that five hundred years! And yes oil paints were not used so you would have to mix up the pigments with tempera. There is no problem with the quality of painting on linen. Caroline Villers (ed.) book on medieval textile painting has wonderful examples among the few survivors where the paint has, often thanks to the cloth being put onto a wooden backing, survived..","date":"2014-11-21","mins":"5:17 pm","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","title":"Charles Freeman’s theory now in Wikipedia"},{"id":"comment-172431","author":"charles_freeman","post":"Look at the fantastic quality of the Four Scenes from the Passion of Christ by Niccolo di Pietro Gerini. All painted on linen and of superb quality, preserved only because they were placed on panels.Probably only twenty other examples have survived as the rate of attrition for linen paintings is so high. As the paint/ gesso is applied only to the outer fibrils ,they are very vulnerable if not secured to a panel!!.","date":"2014-11-21","mins":"5:37 pm","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","title":"Charles Freeman’s theory now in Wikipedia"},{"id":"comment-172342","author":"charles_freeman","post":"P.S. I was scrupulous in following Wikipedia guidelines in terms of accuracy and neutrality. I say nothing about whether my argument is supported or not. I am quite happy for any editor who has actually read my article in full to make their own summary to replace my own and, so long as it does not misrepresent what I have written, I shall be happy..","date":"2014-11-21","mins":"4:47 am","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","title":"Charles Freeman’s theory now in Wikipedia"},{"id":"comment-172534","author":"charles_freeman","post":"Art science. I am looking forward to hearing how the Shroud that they are making works out although I suspect it will take some time to produce. Yes ,there are lots of issues to explore which is why it is important to gather other faded linens for comparison with the Shroud. I I have no other photos of the Zittau Veil but it was worked on by a conservation team and you may be able to track them down. When I hear people saying how would one reproduce the Shroud as it is now, my reply is why would one want to do this? I want to reconstruct the Shroud as it was when it was first created wherever and whenever that was! Then we would surely learn a lot more about it. ( Compare the Antikythera Mechanism there would be no point in reproducing the fragments we have now, but there is a lot of point in trying to work out what it was like when it was made. Ditto the Shroud.).","date":"2014-11-22","mins":"9:41 am","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","title":"Charles Freeman’s theory now in Wikipedia"},{"id":"comment-172422","author":"charles_freeman","post":"Well, I have just lectured to an audience of sixty and have shown them other faded linens that were once painted, similar to the Shroud, lots of depictions of the shroud in the sixteenth and seventeenth centuries that show features that are now vanished ( so how were they put on if they were not painted?)and the evidence from the gesso on the outer fibrils only and no one had any problems with the painting hypothesis. And this was a sophisticated audience..","date":"2014-11-21","mins":"5:01 pm","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","title":"Charles Freeman’s theory now in Wikipedia"},{"id":"comment-172430","author":"charles_freeman","post":"Similar to the Shroud e.g show ghostlike figures after the pigments had disappeared. The Zittau Veil ( painting disappeared after the veil was used as a cover for a steam bath) has some good panels for this. Existed in imagination. No ,the trick is to show a series of paintings by different artists over 125 years and show that there are certain things, like the Crown of Thorns that are shown in similar detail again and again. Sophisticated audience. You weren’t there so how can you judge? We do have really quite intelligent people around where I live and they won’t be hoodwinked easily..","date":"2014-11-21","mins":"5:32 pm","url":"https://shroudstory.com/2014/11/21/charles-freemans-theory-now-in-wikipedia/","cat":"history","title":"Charles Freeman’s theory now in Wikipedia"},{"id":"comment-144700","author":"charles_freeman","post":"Dave you need to read Paul Zanker The Mask of Socrates you can find it online without payment to sort out the bearded Christ in Rome where the earliest examples tend to be. (It would follow that if you support the Vignon markings, you would also need to support the Shroud being known early on in Rome and if you support the view that Peter took charge of the Shroud in Jerusalem then it makes sense that he would have taken it with him to Rome.) I am not an authenticist but have no problems in suggesting avenues of research that can be pursued by authenticists and non authenticists alike. I find ‘the Image of Edessa is the same as the Shroud’ idea totally unconvincing , even more so when the other ways in which a relic from the first century that would have been very vulnerable to damp might have reached northern France have not even been explored. I discount any theory that requires the Shroud to have been hidden away especially in a wall in an area that is humid. Then as now it needs constant care and if authentic, would have needed to have been with a stable Christian community from the earliest times Alexandria, Rome and others known to us are possibilities..","date":"2014-08-19","mins":"4:48 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route"},{"id":"comment-144220","author":"charles_freeman","post":"Thanks, David. Despite frequent claims that the Shroud is the most researched artefact in history, there are still a lot of areas, among them those raised here, where research has not yet even begun..","date":"2014-08-16","mins":"1:33 pm","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route"},{"id":"comment-144053","author":"charles_freeman","post":"‘Researchers have seen similarities between the Shroud image and the multitude of icons said to have been based on the Mandylion or the Image of Edessa, and this would seem to be a principal reason why the Edessa route has persisted in Shroud lore.’ If this is indeed the reason,then you have to deal with the great authority on Roman images, Paul Zanker’s contention in his The Mask of Socrates that the bearded Christ first appears in Rome about AD 300 and can be seen, for instance, in the example in the church of San Pudenziana in Rome of c. 390. Sceptics would, I assume, say that the image on the Shroud was actually derived from previous depictions of the bearded Christ rather than the other way around. I leave the question open for discussion. As I have made clear, the ingenuity of weavers from very early on was impressive weaving is after all the main skill of daily life and aristocrats, then as now, wanted only the best. The same was true of the Middle Ages and Renaissance you only have to look at the pictures of aristocratic sitters to see what amazing things weavers were capable of. Nothing particularly special about the Shroud here. ( I was only making this point because Wilson persists in saying that the Shroud was especially fine when it clearly is not in comparison to the finest linens of the first or second centuries.) The problem for earlier textiles is survival and if one is beginning from the first century then it is inevitable that one considers environments in which linen survives this is how new avenues of research get started they may lead nowhere ,of course, but if one ignores them completely then the subject stagnates. I am really amazed at how little new thinking seems to be emerging from the St. Louis conference although I shall, like others, wait and see. Meanwhile I applaud Hugh for trying to get new thinking out there. Good research starts with imagination. Suppose the Shroud is authentic, then work through all the different environments and communities where it might have been preserved. I see no particular reason to privilege Antioch above other possibilities from the speculative ‘evidence’ that Markwardt can provide in support of his thesis..","date":"2014-08-15","mins":"11:01 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route"},{"id":"comment-144144","author":"charles_freeman","post":"Dave: the evidence is so limited that speculation rules. If, as some argue, it was Peter who took possession of the Shroud, then, of course, it would be far more likely that he took it to Rome with him than left it concealed in Antioch (the Markwardt thesis) where the damp would have most likely got it( remember there is no sign of damp damage on the Shroud). Those who are attached to the Vignon thesis would then be able to explain why the first representations of the bearded Christ come from Rome rather than the east. So yet another area for further research, especially among the art of the catacombs! However, personally. , I haven’t seen any evidence that upsets my default position that the Shroud is medieval it is too easy to link an ‘icon’ to e Shroud without any other supporting evidence as you will see from catacomb art ,there are no shortage of icons around and they can’t all be the Shroud!.","date":"2014-08-16","mins":"3:00 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route"},{"id":"comment-144148","author":"charles_freeman","post":"P.S. You also have a wealth of information about the transfer of relics from the catacombs to the rest of Christian Europe so even more scope for research. I continue to be amazed that no one have even considered these avenues of research. I doubt that they would necessarily lead anywhere but if you buy into the “Peter took possession of the Shroud” thesis, then the Rome to northern France route is more likely than the Antioch/ Edessa/ Constantinople/Lirey route which is full of gaps. If Christians were, as the evidence suggests, venerating the tomb of Peter as early as AD 150, then they would have been likely to have been venerating the relics that he brought with him and the Christian communities would have preserved them through the next centuries in the catacombs. Still the problem of damp but at least there would have been a community consistently giving them care. This is an alternative to Alexandria and Egypt where again there were strong early Christian communities ( going back to the first century as the surviving papyri of early Christian texts show) who would not have had to worry about the problem of damp! But all these are speculation, it is just that some are more probable than others and I put the Edessa route as among the least probable..","date":"2014-08-16","mins":"3:23 am","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route"},{"id":"comment-144409","author":"charles_freeman","post":"The real issue is the narrowness of the research ,e.g ( sorry to be a bore on this) focusing only on one route by which the Shroud might have reached Lirey when there are options that are much more probable than the Edessa route that has so many gaps in it – not a good thing for linen cloth that needs to be protected from the damp! So focus research on areas such as Egypt where the damp is not a problem or areas where there were early Christian communities that survived over long periods, e.g Egypt again, and Rome. The latter satisfies the Vignon marking fans better than any eastern possiblitilty. If research was widened then the Shroud might win out , but certainly not yet when much of the so called research is simply repeating the same old points. The only new info. In Habermas’ lecture was the AD30 radiocarbon date and even that looks like turning out to be a red herring. I think we should concentrate on the areas where no research has yet been done!.","date":"2014-08-17","mins":"5:42 pm","url":"https://shroudstory.com/2014/08/17/evidence-of-the-resurrection/","cat":"history","title":"Evidence of the Resurrection?"},{"id":"comment-207387","author":"charles_freeman","post":"In an age when provenance was vital for getting a relic accepted, it would be extraordinary if Lirey did not advertise where they had got their relic from when this would have given it enormous prestige and a chance to get it accepted as authentic. But perhaps this crucial point will be covered in Part Two. Remember too that in 1389 the French king Charles VI issued an order to have the ‘handmade and artificially depicted’ cloth seized and transferred to another church where it would not be the subject of ‘idolatry’. No doubt this can all be fitted into the story too..","date":"2015-08-04","mins":"6:30 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207806","author":"charles_freeman","post":"Not the oldest Abgar text, a very late one ,in fact.. ‘The divinely transformed state of my whole body’ is certainly not a description of the Shroud, which shows the body before any ‘divine transformation’ but would appear to refer to a representation of the body of Christ AFTER the Resurrection. These representations, on painted cloths hung up in Easter Week, are mentioned frequently in medieval inventories but I don’t think there are any survivors..","date":"2015-08-09","mins":"12:33 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207845","author":"charles_freeman","post":"Mark Guscin notes the destruction of Constantinople in 1204 and lists some of the relics taken back to Europe. On p.97 he states ‘No mention is made of the Image of Edessa in any of the lists of relics and treasures taken back to Europe. It seems to have quite simply vanished.’ The reason it was not taken back, at least in 1204, is that it was in the Pharos Chapel in the imperial palace that was not looted in 1204. So we can assume it remained there and its subsequent history needs to be charted from then on with this in mind. ( I favour the sources that say it did go to the Saint Chapelle.).","date":"2015-08-10","mins":"3:16 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-167694","author":"charles_freeman","post":"Having read manuals such as the fifteenth century Cennino Cennini’s on preparing linen for painting and learning that you seal the cloth on the outer fibrils only with a knife, a highly skilled operation and then reading the STURP report that the images on the Shroud were on the outer fibrils only, I knew I had my evidence for painting. STURP did not have any expert on medieval painting on their team nor did they consult any so one can hardly take their report seriously. However, my main evidence for painting comes from the early descriptions an depictions of the Shroud it may be that the endless handling and exposing of the Shroud ended up with all or almost all of the pigments falling off leaving only the faded images we have today. The ignorance comes from those who have not studied how linen was painted on in the medieval period..","date":"2014-11-01","mins":"1:50 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-170546","author":"charles_freeman","post":"David you are falling into the trap of imagining that the Shroud as it is today Is as it was first created..","date":"2014-11-11","mins":"1:56 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-170569","author":"charles_freeman","post":"And if Ian Wilson, Mark Guscin and Dan Scavone are right, the Shroud was not lying undisturbed in a dry Egyptian tomb but out and about all over, rain and shine for well over a thousand years. Even all those insects that left Max Frei’s pollen on the cloth must have done something to change it. And that was before the fully documented accounts of its handling after 1355. Even more of a miracle that it experienced no chemical change. I am not saying that there are not many issues about the Shroud still to be resolved. We still don’t know how they organised the thousands of stones of the pyramids to be carved so precisely that they created a perfect pyramid but that does not mean that the pyramids were built in 12,000 BC. You get on with working out how it was done within the time period that lots of other evidence makes conclusive.. Similarly with the Shroud until there is firm evidence for an early date for the Shroud and an explanation of how it remained unchanged for so long, I am staying medieval and into an original painted surface, whether much remains of that or not today. Lots of interesting questions there still to resolve, notably why, in contrast to most accounts of images of Christ on a cloth that describe a single image , here it is a double image. Possible roots in Byzantine or Visigothic art is one suggestion. But as so often I have to rely on expert opinion here..","date":"2014-11-11","mins":"4:04 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-170559","author":"charles_freeman","post":"I am waiting for a single piece of evidence that dates the Shroud to before AD33. Please don’t give me the Fanti conjuring tricks with numbers he is one reason why the Shroudies are not taken seriously in the wider academic world. As said above, he is embarrassing and this is why it is hard to find his numbers even on pro authenticity websites. If you can provide the evidence not only for this date but for the theory they the Shroud has remained chemically unchanged for two thousand years so that what we have now in Turin is exactly the same as what was found in the tomb , well yes this would indeed be a miracle, an object that had defied time and, yes, I would believe in miracles. If you can’t date the Shroud this early then we have to look at other ways of explaining the images. For me the most likely is a painted image , made as the medieval manuals suggest on the outer fibrils of the cloth (and I am delighted that STURP support this interpretation that the image is on the outer fibrils only – and yes, they have not come with any sort of date either). If you don’t think the images were originally painted, then please AGREE among yourselves on an alternative method, not just fantasise..","date":"2014-11-11","mins":"3:15 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-167762","author":"charles_freeman","post":"I think all of you just need to read the articles before you comment on them. How do you explain the all over flagellation marks on the Shroud when we know that they first appear in medieval iconography of other paintings only in 1300? How do you explain the fact that the ‘bloodstains’ on the Shroud have an almost identical pattern to the Holkham Bible of 1330. An artist was copying them from similar works of art of his time. You also need to look at the examples of t He faded cloths that I provided in my article to show that painted linens can fade as the Shroud has. Provide an alternative explanation of how a fourteenth century iconography was created by a first century body..","date":"2014-11-01","mins":"7:13 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-167842","author":"charles_freeman","post":"Still no evidence that my article has yet been read, Dan even posted up the wrong article altogether, find time Colin!. No point in discussing further unless it is discussion of what I have actually written. The art historian Bendor Grosvenor is certainly happy with it and this is where I am circulating it among the experts who may or may not agree with me give it a year to get round and we will see..","date":"2014-11-02","mins":"3:22 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-167857","author":"charles_freeman","post":"Thanks for the publicity, Dan. It does not mean, of course, than anyone actually reads my article but every posting of yours helps it get around to people who may not have seen it..","date":"2014-11-02","mins":"4:44 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-167854","author":"charles_freeman","post":"Quite right, David, but one need to look for an ancient artist. There is no ancient record of a flagellation that covered the whole body.and, as you note, it would have been a much messier business than what is seen in the neat crisscross sing on the Shroud. It was only, as the art historian James Marrow argues, that inspired by Isaiah 1. 6 , which they took to be a premonition of what Christ would suffer, did they begin to depict the flagellation as covering the whole body. Marrow dates the change to 1300 there is another possible example in the Church of San Domenico in Orvieto that another scholar has dated to 1290. By 1330 it is part of conventional iconography of the flagellation and the Shroud is right in there as typical of the iconography of that period..","date":"2014-11-02","mins":"4:37 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-167876","author":"charles_freeman","post":"Barbara Faccini’s interesting analysis of the scourging marks ( available on Shroud.com) stresses how three different instruments were used. If there had indeed been three different instruments they would not have been as distinct from each other as Faccini suggests they would have merged into each other – but Faccini is able even to distinguish them from each other so easily as to list the percentage of each. This suggest an artist placing them deliberately as a pattern and, as I suggest in my article, this echoes Marrow’s point that three different Old Testament sources were used to provide different instruments that the artist felt that he had to reproduce. Is anyone really saying that a cruel Roman flagellation would really have ended up with the neat crisscrossing we see on the Shroud today?.","date":"2014-11-02","mins":"6:23 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-167925","author":"charles_freeman","post":"Of course they are faint! They were painted seven hundred years ago so they do need imaging to make the distinctions between them which were much clearer when they were painted. Remember that,despite the fading, Faccini did get so far as being able to give percentages to each of the three instruments but she shows no sign of knowing about the Old Testament texts that inspired each of the three, Of, course , there is some overlapping but if you google Faccini ‘s article that she wrote with Fanti and look at the images of the scourge marks you can see that they cannot be the result of an actual flagrum tearing into flesh. Any Roman flagellation would have torn deeply into parts of the body, not left superficial marks as we see here. The overall patterning fits with the iconography of the fourteenth century for reasons I have given in my article. Originally I would never have mentioned my article on this site as my target is professionals in the fields I deal with but, taking in mind that all publicity is good publicity, I am grateful to Dan by continuing making posts about it..","date":"2014-11-02","mins":"1:18 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-167949","author":"charles_freeman","post":"Google Fanti and Faccini’s paper. Look at the illustration of 372 flagellation marks, note that not a single one of them seems to break the skin. As evidence of an actual physical flagellation this could not be possible, a few of the blows must have broken the skin, especially when the flagrum was designed to torture rather than just be a rod for beating. As evidence of a painted surface, no problem the artist simply daubed on the marks, inspired probably by the Old Testament texts that suggested the three different types of instruments that Faccini was able to distinguish (see my article). Now you have a choice, the marks of a real flagellation or a painted flagellation. I just happen to think a real flagellation is so improbable on the evidence on the Shroud that I go for a flagellation that has been painted on. When, as here, the flagellation covers the whole body back and front, I side with the art historian and expert on Passion iconography James Marrow who says this is a development of the fourteenth century. I will happily consider any alternative ways of producing the scourge marks that are offered by the ‘experts’ on this blog. In so far as some of these postings appear on the web in a Google search, I have little alternative but to put my case as strongly as possible in the hope that, even if not for readers here, others will access the November issue of History Today, even if they only access the text version freely available which lacks the crucial illustrations of the print version ( that show how typical the flow of blood is of other fourteenth century depictions of the body of Christ). So I am happy for Dan to keep the story going with new postings!.","date":"2014-11-02","mins":"3:51 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168136","author":"charles_freeman","post":"Yes, David is right. This is a symbolic representation of a flagellation that is designed to fit in with the Old Testament texts that became an inspiration to theologians and then artists in the late thirteenth and early fourteenth centuries see my article for the relevant texts. Lots of supporting evidence – see the Holkham Bible flagellations of c.1330 and the Roettgen Pieta also fourteenth century. They are easily available online. This is the world of the top art historians such as James Marrow (whose work put me in the right direct Ion) and p it is with them that the future of my article lies as they are in a position to confirm or deny it and have the authority to do so. If contributors to this site really want to challenge me they need to get their evidence together and submit it to one of those journals where it will be taken seriously..","date":"2014-11-03","mins":"4:09 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168170","author":"charles_freeman","post":"Colin,Have you read my article yet? What we do have is fifteenth and sixteenth century descriptions of the blood images that show that they were much more vivid than they are now, enough to really shock the observer. We have a description of 1449 by a Benedictine monk to say that they were painted. I quote them in my article for those (?Thomas) who would like to know what they say. The shock effect of the blood images is typical of the blood cults of the fourteenth century. What is really important is to compare the patterns of blood flow on the Shroud( see the Shroudscope depictions) with those,say, on the Holkham Bible of 1330 and you will see that they are virtually identical. The illustrations in the print version of the History Today article make the point perfectly. You will also find other similar blood flows in the Roettgen Pieta and Man of Sorrows depictions of the fourteenth century. The Shroud is spot on ,so much so, that i wonder whether there was not some kind of template the artist worked from. The Tempesta engraving (1613) shows that the Crown of Thorns was on the Shroud, now vanished but as the Crown is also mentioned in independent fifteenth century descriptions of the Shroud we have confirmation that it was originally on the Shroud, and this again is typical of the fourteenth century where they show the Crown in place AFTER Christ has been taken down from the Cross.. So read the descriptions in my article and explain what you think accounts for the very vivid ‘bloodstains’. The number one explanation I have been given so far is paint, probably, if the vividness of the colour is taken into account, vermilion, but perhaps you have an alternative explanation, Colin? What remains on the Shroud today after so many centuries of expositions is anybody’s guess. There is circumstantial evidence that with the images being on the outer fibrils only and calcium carbonate being found by STURP in ‘large’ quantities that this is the remnant of the gesso painted just as the medieval manuals such as the one by Cennino Cennini, advise. A professor of physiology who has read the STURP reports on the ‘blood’ has told me that what STURP thought were bloodstains are more likely animal collagen, used to cement the calcium as a selant. But we will need an expert microscopic examination to see what the accidents of time have left of the original surface. I am not qualified to assess what Mc Crone found and other than quoting it in my article I leave it at that. My argument does not depend on what may or may not be left on the Shroud, it would be a matter of chance what has survived, but I shall certainly be interested in more up to date testing is ever done..","date":"2014-11-03","mins":"6:23 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168210","author":"charles_freeman","post":"Thanks, Colin, I look forward to hearing of the scientists who support your interpretation. I assume we are agreed that this is a fourteenth century creation of some sort. That is a good starting point. What we have to establish,is, however the images were created in the first place, how the artist or creator managed to match the iconography of the fourteenth century, blood flows, all over scourging, Crown of Thorns left in place, so completely. If we have the Holkham Bible, there to see online and in the British Library, we have what is almost a a template of the flagellation and blood flows seen on the Shroud. Would you suggest that the creator of the Shroud used a similar depiction as an inspiration? But what I don’t understand is why, when painting on linen was very common – thousands of examples are recorded in monastic and church inventories, why your ‘artist’ would need to resort to such an arcane procedure as you suggest. Surely he would have stayed with the recommended procedure, apply gesso to the outer fibrils of the cloth and paint on top that may well have become detached from the Shroud as time passed. You will see from my article two examples of faded linens very similar to the Shroud although we would have to look more closely at them to make sure. As you will see I have put out the call for conservationists who work with medieval linens to see if we can dig up some more comparative examples. The trouble is that most faded linens are not put on display and the only reason why I know about the two I mention is that parts of the original images remain intact..","date":"2014-11-03","mins":"8:56 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168226","author":"charles_freeman","post":"Glad you are still working on it,Colin. It is a bit like the Pyramids. There are those who believe the pyramids were built in 12,000 BC, there are those who find the mass of evidence correlates to the middle of the third millennium BC and this has long since been accepted by academic scholarship.The latter still have lots to argue about, there has only recently been a detailed survey of the whole Gizeh plateau that has brought up lots of new evidence, and there is still, as I repeatedly say in My article, so much of the basic research on the Shroud that has not yet started. We need a proper data base of all the depictions of the Shroud from expositions for a start – it amazes me that this has never been done. There is some evidence even that the Shroud may have been repainted but until we have the long sequence of perhaps fifty or sixty artists depictions we are limited in what we can say about how the Shroud originally looked. The evidence of the prominence of the bloodstains is certainly unquestioned as it is what everyone who saw the Shroud was overwhelmed by in a way that is not true today..","date":"2014-11-03","mins":"10:10 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168294","author":"charles_freeman","post":"Colin, well there we would disagree as I believe that the Shroud, while having the same framework, would have been drenched in blood stains, as the descriptions in my articles suggest, and have features such as the Crown of Thorns that are have now disappeared. The first task is to get a database of all the descriptions and all the depictions of expositions and see how far one can come to a reconstruction of the Shroud as it once was. I am am amazed that this has not been done as it is fairly standard practice in cases of artefacts that give every appearance of significant ageing as the Shroud certainly does. But one aim of my articles is to get someone to work on it constructing the database would make a good Master’s dissertation for a budding art historian..","date":"2014-11-03","mins":"1:45 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168243","author":"charles_freeman","post":"Louis – who don’t you read my article it is all there! There were virtually no bloodstains on burial scene of Christ in say 1200 as the body of Christ on the Pray Codex shows. By 1330, they are very obvious, even overflowing ,even after Christ is supposedly dead see Shroud of Turin and the Roettgen Pieta, etc. Etc.. BTW Colin. Are you assuming that the images on the Shroud today are as they were in 1350?.","date":"2014-11-03","mins":"10:58 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168359","author":"charles_freeman","post":"‘Artists did not necessarily think like each other’. A crucial point because if we have the same feature e.g. The Crown of Thorns’ shown similarly by a number of different artists making depictions at different times, we can be more secure that it was really there, even if faded today. What we don’t want is artists copying each other. Again vital to build up a data base..","date":"2014-11-03","mins":"4:54 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168225","author":"charles_freeman","post":"Calcium carbonate and calcium sulphate. See Susie Nash’ book on the Northern Renaissance – she says that calcium carbonate was used in gesso north of the Alps, calcium sulphate south of the Alps, an interesting pointer to where the Shroud may have been painted..","date":"2014-11-03","mins":"10:01 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168330","author":"charles_freeman","post":"The St. Clares’s nuns saw that ‘the crown’ on the dorsal image was ‘ like a hat ‘ and indeed a ‘.’hat’ can be seen clearly on t He Tempesta engraving. De Beatis says in1517 that the ‘crown on the head’ could also be seen distinctly and again you can see it in the Tempesta engraving a hundred years later. This is the way by putting together the independent descriptions that agree with each other ( and ,of course, there are many other depictions with the Crown in place on the head) that we can slowly build a reconstruction of how the images on the Shroud looked originally. The key point ,of course, is that depictions of the crown left on after Christ was taken down from the Cross only appear in the fourteenth century possibly earlier but only rarely. So how was the Crown of thorns put onto the Shroud? Embroidered on? I think painted on is much more likely as painting on linen was very common. It is just that most have been lost – the survivors tend to be those that were pasted onto wooden panels. Unless the Shroudies think the descriptions of the Crown of Thorns are fabricated in medieval times, you have to accept that Christ was indeed buried with the Crown of Thorns still in place. But as depictions of the burial of Christ with the Crown are common in later medieval iconography but not before would put them as one more piece of the medieval jigsaw..","date":"2014-11-03","mins":"3:14 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-144061","author":"charles_freeman","post":"Real problem in assuming that the ‘icon’ is the Shroud but let’s see if he presents anything stronger in St. Louis. I hope he does not just repeat what he said in 2008 too many unexplained gaps..","date":"2014-08-15","mins":"1:14 pm","url":"https://shroudstory.com/2014/08/15/jack-markwardts-antioch-theory/","cat":"history","title":"Jack Markwardt’s Antioch Theory"},{"id":"comment-144313","author":"charles_freeman","post":"One can do an enormous amount of research in six years two Ph Ds if you work at it, so one would hope for much more to support his theory if it has legs on it. As ‘icon, can mean any likeness, from paint Ing on a catacomb wall, to a wooden panel to a statue, then I just hope he does not go on assuming that a mention of an icon of Christ means the Shroud! It is just worth remembering how many icons of Christ still exist in the catacombs..","date":"2014-08-17","mins":"2:49 am","url":"https://shroudstory.com/2014/08/15/jack-markwardts-antioch-theory/","cat":"history","title":"Jack Markwardt’s Antioch Theory"},{"id":"comment-144347","author":"charles_freeman","post":"I have no idea what icon he might have been referring to, the evidence is simply not there.I see absolutely no reason why it should be the Shroud when the Greco roman world was awash with images of all sorts. Athanasius was writing in an age when there is a myriad of legends about early Christianity. Many cities created an early Christian past to gain status. So don’t take any of this too seriously no professional historian does..","date":"2014-08-17","mins":"6:07 am","url":"https://shroudstory.com/2014/08/15/jack-markwardts-antioch-theory/","cat":"history","title":"Jack Markwardt’s Antioch Theory"},{"id":"comment-144380","author":"charles_freeman","post":"The reason why professional Christian historians don’t take these stories of the first century seriously is that they are reports from three hundred years later (as here) and it is clear that many of them emerged as legends in the fourth century to give status to Christian cities when Christianity was able to operate openly. Virtually every Christian city from the later Roman empire that i take tours to has a back story of its first bishop and legends surrounding him but no one can find any independent evidence,except in a few case, to back them. If the icon existed I agree that it might not be’ just any old icon’. It would be an icon venerated for some reason but I cannot understand why it should be the Shroud. The mass of early icons we have are of Christ alive or after the Resurrection. The earliest one we have of him shown actually dead is eighth century ( from St, Catherine’s Sinai), so we would normally say that an early icon is of Christ alive or after the Resurrection as the catacomb icons ) wall paintings ) show.. You need to scour the works of Athanasius to see if he he held a Shroud in any veneration so far as I know he did not (but there is a lot to read!). What we can’t say is that the mention of an icon from the first century means the Shroud and if Markwardt rests his case on that he is going nowhere fast..","date":"2014-08-17","mins":"12:57 pm","url":"https://shroudstory.com/2014/08/15/jack-markwardts-antioch-theory/","cat":"history","title":"Jack Markwardt’s Antioch Theory"},{"id":"comment-70841","author":"charles_freeman","post":"‘They were Z spun, which is not characteristic of the weaving technique in the country during this period.’ ‘The traditional spinning in Israel was S spun and therefore it is assumed that the textile was imported.’ These finds seem to support the traditional view about Z spin I don’t know where Gorny got his idea from although there are cases, not relevant so far as the Shroud is concerned, where the spin is S but two threads are twisted together with an Z twist. I don’t know the Tunic of Argenteuil but perhaps someone can tell us whether it is the spun yarn or the twist of separate yarns that is Z in this case. If the latter I believe that a Middle East origin is quite possible..","date":"2014-01-01","mins":"10:43 am","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","title":"Paper Chase:  Z Twist Again"},{"id":"comment-70842","author":"charles_freeman","post":"?Late Ottoman – so nineteenth or early twentieth century AD?.","date":"2014-01-01","mins":"10:46 am","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","title":"Paper Chase:  Z Twist Again"},{"id":"comment-48766","author":"charles_freeman","post":"There is lots of doubts about the reliability of these accounts it’s a major feature in recent scholarship – see for instance Bosworth’s work on Alexander. The difference is that for the Christian accounts ,we can normally trace them back to one source while the writing of Roman history and the history of Alexander uses a lot of different sources that correlate with each other to provide an outline within which interpretations can be made, e.g. Extensive archaeological evidence for Rome’s early history as well as other written and epigraphic sources..","date":"2013-10-26","mins":"8:31 am","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","title":"Paper Chase: Thomas & The Hymn of the Pearl"},{"id":"comment-48743","author":"charles_freeman","post":"After the granting of toleration to Christians by Constantine in the fourth century ( remember Eusebius was writing then),many cities created a Christian past that took them back to the first century, often, in the west, by claiming that they had a bishop who had been inaugurated by Peter. Most of these stories are, of course, apocryphal but still very powerful e.g one that the evangelist Mark slept on an island in the lagoon at Venice. St. Oronzo of Lecce was supposed to have met the messenger bearing Paul’s letter to the Romans, who landed on the coast near Lecce, been so convinced by it that he sought out Paul and was converted by him and so became the first bishop of Lecce where he is still honoured by a statue in the main square. The Abgar legend would seem to be one of these. Treat these legends with care after the fourth century there was intense competition among Christian communities to prove that they were there first! In most cases, outside the obvious places like Rome, Antioch and Alexandria, we have virtually no supportable historical evidence before c.200..","date":"2013-10-26","mins":"4:34 am","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","title":"Paper Chase: Thomas & The Hymn of the Pearl"},{"id":"comment-15865","author":"charles_freeman","post":"Dave B:There is actually no evidence that the Shroud was ever in Antioch, let alone Edessa, but as this point has been made over and over again by professional historians, I am not going to repeat it again. There is an immense gulf between professional historians and amateurs such as Wilson. Among my professional jobs as a historian was to act for many years as an Examiner in History and Theory of Knowledge ( Critical Thinking) for the International Baccalaureate so it was part of my job to sort out the good aspiring historians from the duds and good arguments from bad.I note that Dave B you have no background in history so perhaps you can just take my word for it that Wilson hasn’t a clue how to use evidence. If he sees the word ‘icon’ or ‘image’ he assumes that it is the Shroud as if there were no other images and icons around. He would have failed any academic exam on these grounds alone because learning how to use evidence accurately is a starter skill, assumed to have been mastered by 18 year old budding historians. Wilson must know that his ideas have no academic support but he just goes on repeating them I leave it to others to discuss his motives for doing this. Perhaps he really does go to bed each night thinking that the Image of Edessa and the Shroud of Turin are one and the same. It is a pity that he shows no sign over all these years of having mastered Greek or read in the wider field of relic cults he has had since 1978! So far as I can see he simply repeats the same arguments over and over again as if there was no other professional work going on in Byzantine studies or relic cults that completely undermines his arguments. I can only repeat the consensus of professional historians that there is no documentary evidence for the existence of the Shroud before the fourteenth century not a single mention of a cloth with a double image anywhere. Quite happy to admit that my choice of the Mandylion was a poor one there are lots of alternatives showing a head that is clearly separated from any body and not a hint anywhere that this was a shroud rather a mass of evidence that it was a cloth dating from the sixth century AD which had a legendary past added to it to give it credibility..","date":"2012-09-05","mins":"4:17 am","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson"},{"id":"comment-15887","author":"charles_freeman","post":"Our friend Andrea Nicolotti is the place to start, and he will surely suggest many other works, but I would suggest that you read Hans Belting on the Mandylion in his Likeness and Presence, as he provides the evidence for it being made in the sixth century alongside others of the same kind (most of which disappeared in the iconoclastic controversy).You have to dig about a bit to find what you want in L and P but I don’t think you can find anyone more ‘professional’ than Belting.If the Image of Edessa is sixth century, as the evidence overwhelmingly suggests, then Wilson’s thesis collapses anyway Averil Cameron showed up the linguistic problems of Wilson’s analysis , as have many others, in her 1980 lecture although it is difficult to find a copy now. Wilson’s counter attack, made many years later in which admits he did not have much Greek (!) – hardly impressive for Cameron, one of the world’s foremost Byzantine scholars failed to address the problems she raised. She was right not to bother to reply although she has outed the inadequacies of Mark Guscin’s book on the Image of Edessa. As Wilson provides no acceptable evidence for a pre sixth century existence, it is not surprising that no historian has bothered much with this aspect of his thesis – what would there be to refute? You can read the end of my article on the subject but i could not find any evidence worth dealing with and I am sure it is the same for others. Davor, Andrea and others will provide a fuller check list, I think ..","date":"2012-09-05","mins":"9:01 am","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson"},{"id":"comment-15871","author":"charles_freeman","post":"Carlos. Excuse my not answering in Spanish my daughter is the Spanish speaker in the family not me! Most relics purporting to come from the first century, from the life and Passion of Christ, the Virgin Mary, the apostles and Mary Magdalene are represented by multiple, competing copies, e.g. Many pieces of the True Cross, lots of girdles worn by the Virgin Mary, several heads of John the Baptist,two bodies of Mary Magdalene, many phials of Christ’s blood, a number of burial shrouds, a number of images of the living Christ ( e.g. The Image of Edessa). In many cases the descriptions are not precise enough to know what they consisted of and hundreds of thousands of relics were destroyed in the Reformation by Protestant Christians. We are lucky to have copies of the Image of Edessa ( almost certainly created in the sixth century see Hans Belting on this) that show clearly that it was an isolated head of a living Christ to which a legendary account of its origins in the first century was added. All one can say in the case of the Turin Shroud is that there is no mention of a shroud that seems to be it before the fourteenth century. There are many references to other burial shrouds of Christ, of course,although none, except the one at Cahouin , which had a large following, seems to have gripped the imagination in the way that,say, the Veil of Veronica or the body of James at Compostela did. It was just one of the many thousands of specific relics that did not attract a following, except marginally in the sixteenth century, and certainly, in the hierarchy of relics, the Turin Shroud could not compete with the Cross, Crown of Thorns or blood taken from Jesus on the Cross. Wilson makes the very fundamental mistake of assuming that any image or icon mentioned is the Turin Shroud. He writes as if no other images or icons existed and that burial shrouds were given a high status within the hierarchy of relics there is no evidence that they were.This distorts his narrative but, as others have pointed out, he even distorts the material he does use in order to make his very weak case. But how often does one have to go on repeating this – we have Yannick Clement, who believes in the authenticity of the Shroud, myself ,a more general historian who has written the only full length history of medieval relics on the market, and Byzantine specialists such as Davor all saying the same thing – the same thing that has been put forward by professional historians for many years now without anyone from the academic community coming up in Wilson’s support. Scientific work on the Shroud suffered from earlier examinations by STURP in 1978 being undertaken without any preliminary assessment of the Shroud by textile experts before it was examined by a group of self appointed scientists none of whom had any experience with ancient textiles, outside a conservation laboratory and with samples removed at will and then scattered around the place, ( I am told that the guardians of the samples only give them out to those who already support the authenticity of the Shroud, but i don’t know if this is true or not others may be able to help here.) No wonder there are endless inconclusive discussions about how the image was formed, everyone is arguing from a botched job..","date":"2012-09-05","mins":"6:26 am","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson"},{"id":"comment-15872","author":"charles_freeman","post":"Sorry, Cadouin Shroud, CF.","date":"2012-09-05","mins":"6:29 am","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson"},{"id":"comment-15824","author":"charles_freeman","post":"So long as Ron’s comments make people actually read my articles ‘Charles Freeman Shroud of Turin and the Image of Edessa A Misguided Journey ‘ and ‘Tetradiplon Revisited’, I have no problems. Incidentally the fuzzy photo is only because that was the best my Iphone could do when i came, completely unexpectedly, on a representation of the Mandylion no attempt here to deceive anyone! What is Andy on about ‘the bishop’ ? I actually say in my article that such comments about fakes need to be taken with caution because rival shrines often tried to discredit each other after all there were several shrines claiming to have the burial shroud of Jesus and , although this was not the case here, you tried to slam your rivals by saying yours was the genuine relic and theirs was the fake and they would do the same back to you! However, if Andy had read my articles he would know that the ‘fake report’ hardly plays any part in my critique of Wilson..","date":"2012-09-04","mins":"3:25 am","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson"},{"id":"comment-15845","author":"charles_freeman","post":"You may not, Ron, it just happens to be the truth. It is not often that one comes across a Mandylion face to face as it were in a totally unexpected place and I was determined to record it. I was not techy enough to know how to get my Iphone to take an unfuzzy picture. Only the most fevered imaginations could think that I had set out to deceive anyone but I applaud your and Stephen Jones’ imagination. It all adds to the fun..","date":"2012-09-04","mins":"1:37 pm","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson"},{"id":"comment-15854","author":"charles_freeman","post":"According to Ron :”You obviously show a lack of knowledge in the fact that Edessa or Antioch are situated in a “semi arid” climate of “very low humidity or rainfall”. ” Precipitation for Urfa, formerly Edessa. Mean Monthly Value Inches3.532.92.11.20.10.10.10.11.31.73.61.6 This is not a semi arid climate of very low rainfall – the winters, as I have said above, are quite damp. Please don’t accuse someone of ignorance until you have established the facts for yourself. But what is the point of arguing – I feel I am just banging my head against an Edessa brick wall, which may or may not have a cloth concealed behind it sealed in in mortar..","date":"2012-09-04","mins":"5:53 pm","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson"},{"id":"comment-15853","author":"charles_freeman","post":"What evidence does Wilson provide that not only was the Shroud of Turin concealed in a wall for several hundred years but actually SEALED IN IN MORTAR? Please refer to the original Greek text I am sure Davor will help you out if you get stuck (in a wall or elsewhere). If you read Wilson thoroughly he refers to the floods that swept Edessa – actually that coastline is quite damp in winter, summer is different but we have to keep our cloth dry all through the year..","date":"2012-09-04","mins":"5:41 pm","url":"https://shroudstory.com/2012/09/03/part-7-of-the-jones-freeman-brouhaha-about-ian-wilson/","cat":"history","title":"Part 7 of the Jones & Freeman Brouhaha about Ian Wilson"},{"id":"comment-17752","author":"charles_freeman","post":"What evidence do you have that there is too much contamination on the Shroud for a modern laboratory to cope with? Have any of the testers of the Shroud raised it as a major issue? Has any other radio carbon expert? I think you must give some expert opinion on this from someone working in the field who can assess the history of the cloth if you want to sustain your argument. Remember that the amount of contamination of cloth between 650 and 2000 years old is likely to be minimal compared to that affecting a material object of 50,000 years old , towards the limit of effective radio carbon 14 dating..","date":"2012-10-17","mins":"1:30 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","title":"Quote for Today: Diana Fulbright on Wishful Thinking."},{"id":"comment-17773","author":"charles_freeman","post":"Please Ron give me the title of a handbook on radio carbon 14 dating that you have read that has been published in the last ten years and tell me the page numbers that sustain your claims. The Egyptian radiocarbon 14 datings have been subject to enormous amounts of new work recently (see Bahn and Renfrew, Archaeology, p.155). Even if there was a 1000 year discrepancy on a mummy of 2000 BC this would be twenty five per cent , so even if the same discrepancy was applied to the 1350 dating of the shroud it would skew the results 135 years either way at the most. I challenge you to provide a single example of a radio carbon 14 dating from the past ten years where an object has been dated at a third of its real age. Just one will do, but from your comments you seem to assume that it would be a common event so you must be able to provide some evidence in support of your claim. I agree with you that other forms of dating are important – that is just exactly how the accuracy of radio carbon dating is established. You take objects whose dates are known , give them a radio carbon 14 dating and then if the dates correlate with each other , you know that r c is working as it should. This is how many of the discrepancies and problems of r c dating have been spotted and ironed out. There are thousands upon thousands of r c datings available whose accuracy have been confirmed. You seem to suggest that an accurate r c dating is a one off event! (Again i just wonder which handbook on r c dating you have been using as your source.) Shroud studies are a spin off of my work on medieval relics but at the moment very much on the back burner. Two outstanding issues are there to be solved if I have time from my ‘real’ work.. 1) If the Shroud blood is AB when is the earliest example of AB from another source that we have. 2) With the evidence of large cloths being imported into Europe from Islamic sources by Crusaders in the late eleventh century, can we match the weave of the Shroud to what we know these workshops were producing. I have now tracked down an expert on Islamic textiles and he he has agreed to give me lunch when i am back in England..","date":"2012-10-18","mins":"4:15 am","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","title":"Quote for Today: Diana Fulbright on Wishful Thinking."},{"id":"comment-17833","author":"charles_freeman","post":"Does Ron mean wool? I am equally mystified but why can’t Ron tell us if we are all humble enough to admit our ignorance?.","date":"2012-10-18","mins":"5:43 pm","url":"https://shroudstory.com/2012/10/16/quote-for-today-diana-fulbright-on-wishful-thinking/","cat":"history","title":"Quote for Today: Diana Fulbright on Wishful Thinking."},{"id":"comment-15611","author":"charles_freeman","post":"Dan. I have no objections to you reproducing Stephen Jones’ attempted critique of my articles on the Free Enquiry website. They are good publicity for the articles themselves which often cover much the same material as Yannick Clement here and other scholars on the manifold problems of Wilson’s hypotheses. They keep debate open. However, I do urge caution. As earlier posts of his critique on your blog show Jones has had to rewrite one of his misrepresentations of my work (Your blog August 8th) and on July 11th a poster, David Mo, showed up the inadequacy of Jones’ argument. So far as I am concerned he has consistently failed to tackle the actual points I have made but that is his problem not mine. Unfortunately Jones has now over reached himself as can be seen below (from the Comment provided by him on his latest critique on his blog). There is no payment asked or received for my articles. I do not know my arguments to be false (as I have said they are not much different from those of Yannick Clement and other scholars who have dealt with Wilson’s work) and if he had made any attempt to research me he would have seen that my last two books have been published by Yale University Press and cover both the early history of Christianity and the history of relics. This is why I came into the discussion in the first place. I am waiting for six months to see whether there are critiques of my articles that need answering and if so I will do so. Meanwhile I will it leave it up to you as to whether you wish to associate yourself with Stephen Jones by publishing his articles in light of the unwarranted attack he has made on my integrity (below). If he had made it in a national newspaper in the UK he would have been suable for damages and then I might have made some money! Thanks. Jones’ latest contribution: He [Freeman] is merely a “freelance” `gun for hire’ who presumably was PAID MONEY by the atheist publication Free Inquiry and/or its “The Skeptical Shroud of Turin Website,” run by arch atheist and Shroud anti authenticist Steven Schafersman to write his two `hatchet job’ articles on the Image of Edessa for the gullible, true believers in the Shroud’s inauthenticity, `sceptical’ (so called), readership of Free [so called] Inquiry! Freeman is deliberately writing WHAT HE KNOWS TO BE FALSE for Free Inquiry’s “The Skeptical Shroud of Turin Website to MAKE MONEY..","date":"2012-08-30","mins":"4:26 am","url":"https://shroudstory.com/2012/08/23/scholarly-incompetence-or-dishonesty/","cat":"history","title":"Scholarly Incompetence or Dishonesty?"},{"id":"comment-15713","author":"charles_freeman","post":"I accept Stephen Jones’ ‘apology’. I have been a professional historian for thirty nine years first pay cheque came in September 1973! and have written over twenty books with several hundreds of reviews (Probably nearly 150 on Amazon alone they can easily be found.) So Stephen Jones’ and other critical comments are part of life and don’t worry me. I only intervene when there is clear inaccuracy as here, especially one which may affect the professional reputation I have spent many years earning. I do not always write for money and most blogs pay nothing as here. I choose my projects carefully. I am not a ‘hired gun’ and will write an article for nothing as in this case if I feel I have something to contribute. I believe in the arguments I present so ‘WHAT HE KNOWS TO BE FALSE’ is another inaccurate statement, that could equally be seen as damaging to my professional reputation. Historians have successfully sued in the British courts for much less. The rebuttals of Wilson have been widespread across the academic community and anyone who works on the material and reads the work of historians who specialise in Byzantine history and literature comes up with many of the same points. I was not surprised to find that Yannick Clement has found the sources Wilson uses as inadequate as I have and he is opening the debate wider among a community who are often unaware ‘of the manifold problems with Wilson’s hypotheses’..","date":"2012-09-02","mins":"3:05 am","url":"https://shroudstory.com/2012/08/23/scholarly-incompetence-or-dishonesty/","cat":"history","title":"Scholarly Incompetence or Dishonesty?"},{"id":"comment-17113","author":"charles_freeman","post":"The reason why that mosaic is given an earlier dating is that it is in the same sequence commissioned by the heretical (Arian) Theodoric who died in 526.They redid many of the mosaics but left some of those, including the Christ, that they found inoffensive. As I understand most Byzantine experts, Lyfe quotes Robin Cormack who is about as good as you can get, date the Christ to c. 500 because the church was consecrated just afterwards and they theory is that they would not have consecrated it without finishing the mosaics. I don’t know where Wilson gets his 502 date from. It goes beyond any evidence that the first source, Evragius suggests for the appearance of the Image. So why not accept the opinion of the experts that it is probably c. 500?.","date":"2012-10-01","mins":"9:43 am","url":"https://shroudstory.com/2012/09/22/stephen-jones-is-up-with-part-10-of-his-critique-of-charles-freeman/","cat":"history","title":"Stephen Jones is up with Part 10 of his critique of Charles Freeman"},{"id":"comment-17133","author":"charles_freeman","post":"Well I don’ think Cormack deals in speculation. Google him and then let us know why we should prefer your version over his..","date":"2012-10-01","mins":"4:07 pm","url":"https://shroudstory.com/2012/09/22/stephen-jones-is-up-with-part-10-of-his-critique-of-charles-freeman/","cat":"history","title":"Stephen Jones is up with Part 10 of his critique of Charles Freeman"},{"id":"comment-17136","author":"charles_freeman","post":"The problem you have to overcome is that the Christ is of the same workmanship asthe scenes from the life of Christ on the side walls. Now these are ‘Arian ‘ because they show Christ ageing with time. So they are from the Arian reign of Theodoric who died in 526. Scholars such as Cormack prefer an earlier date because they argue that all the mosaics would have been completed before the consecration of 504. So , Ron, YOU are the one who has to challenge this view. Please give specific reasons from your personal knowledge of the Christ mosaic why you go against scholarly opinion in thinking that it is so much later..","date":"2012-10-01","mins":"4:38 pm","url":"https://shroudstory.com/2012/09/22/stephen-jones-is-up-with-part-10-of-his-critique-of-charles-freeman/","cat":"history","title":"Stephen Jones is up with Part 10 of his critique of Charles Freeman"},{"id":"comment-16642","author":"charles_freeman","post":"N. B. As I posted this as no 62 out of 100 comments as a direct reply to Art Sciences earlier comment and it risks getting lost, I am reproducing it at the end as well. I would add that anyone who insists that tetradiplon applies to a burial cloth after an image was placed on it must provide documentary evidence that contradicts the plain words of the Acts of Thaddeus. Art Science ‘I find it strange that Charles seems to say the tetradiplon description is rubbish much like the confused hearsay sequence of how the image got on there.’ No Art Science, i have never said that ‘tetradiplon’ was rubbish. It is a strange word and it needs an explanation as to why the author of the legendary Acts of Thaddeus used it. First one must clear the decks.1) Tetradiplon is ONLY used of the cloth when it was handed to Jesus. 2) Wilson is misleading in The Shroud (2010), p. 190, when he suggests that the word tetradiplon is used to describe the cloth AFTER Jesus had wiped his face on it. Whatever the reason or motives for his ‘mistake’, Wilson has confused many people on this. 3) The Acts of Thaddeus, if read in full, make it quite clear that the author distinguishes between the cloth on which Jesus wiped his face ( the tetradiplon cloth, if you like) and the burial cloths of Jesus that are described separately as being in the tomb AFTER the face cloth had already arrived in Edessa. THIS MAKES ALL THE DEBATES OVER HOW THE TURIN SHROUD MIGHT HAVE BEEN FOLDED REDUNDANT. It had to be folded somehow to preserve it when not on display and it could have been folded in all different kinds of ways over the centuries of its life, probably different ways at different times. What seem to be happening here is people seeing folds that fit in with a tetradiplon folding when the word tetradiplon was never applied to the burial cloths in the tomb So we come back to why the word tetradiplon was used of the cloth when it was handed to Jesus. One guess, that I explore in my Tetradiplon Revisited ( which comes up as about number six if you put in the word ‘tetradiplon’ into Google), is that the author wanted to give a special status to the cloth that Jesus chose to wipe his face on. We know from festivals such as the Athenian Panathenaia that a peplos was specially woven, then folded (see the illustration in my article) and then handed over to be placed on the statue of Athena. There is some evidence that in Christian times a similar ritual was carried out for the pallium given to bishops.It was originally handed over as a folded piece of cloth but, eventually instead of a folded rectangle, the bishop was given a simple strip, So it is not impossible that a similar ritual was in the mind of the author of the Acts of Thaddeus. He simply wanted to embellish the legend a bit and he may have been aware of ceremonies in which folded cloths were handed over BEFORE they were used in a ceremony. I leave this suggestion open but it is a line of enquiry that better fits the existing evidence than anything that looks at folded burial cloths.","date":"2012-09-21","mins":"4:31 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16658","author":"charles_freeman","post":"Max. I agree with Beltung that the Image of Edessa was one of many similar images appearing in the late sixth century that then had legendary accounts attached to them to give them credibility as relics. In this the Edessa legend would be similar to hundreds of similar legends in the later Middle Ages that became attached to relics that could not possibly be what the legends said they were. The only reason for bringing Wilson into the debate as he seems to have given the impression to many people that the Acts of Thaddeus uses the words tetradiplon to describe the cloth after the image was on it and he omits the reference to the burial cloths as cloths which are different from the cloth that was folded tetradiplon before it was handed to Jesus. So any account of the folding that ignores this is bound to be challenged. Do you accept that Wilson has been misleading , deliberately or not, on this issue? If you do then I am happy to stop mentioning him by name. If people go on discussing tetradiplon as if Wilson is right then it is a different matter although I have said all I need to say here. If you have evidence that a burial shroud was described as tetradiplon I am sure we would be happy to hear it and why not as much philological, iconographic, literary and archaeological evidence as you will on the Image of Edessa but your conclusions do seem much more convoluted than they need be ..","date":"2012-09-21","mins":"7:21 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16688","author":"charles_freeman","post":"Thanks, Yannick. If we can get rid of the stranglehold Wilson has on many aspects of Shroud history, then we can explore other avenues. I am not saying my hypothesis about tetradiplon is right but it does make some sense and is an avenue along which we need to do further research. In particular, I would like to track down the sources that talk of a pallium being folded before being handed to a bishop on his consecration.On the Parthenon relief ( see my article) it is hard to see how many folds there are but wouldn’t it be interesting if one could show there were four! ( i assume that the Panathenaic festival continued into Roman times.).","date":"2012-09-21","mins":"12:47 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16719","author":"charles_freeman","post":"Max. This posting is specifically about ‘tetradiplon’. You have a tendency to go off into other areas and it is often unclear from the fragments you give us what you really believe. It is certainly complicated and hard to grasp. Why don’t you write a short history of the Turin Shroud as you see it showing how you believe it relates to other medieval images and see if you can publish as a one off on this or another shroud site. Then you can refer to it when you want. I assume you have a copy of Belting’s Likeness and Presence. Why not start with Chapter Four: “Heavenly Images and Earthly Portraits: St Luke’s Picture and ‘Unpainted ‘ Originals in Rome and the Eastern Empire.” The chapter kicks off with a a section on ‘Unpainted Images of Christ and Relics of Touch’. Most images from the sixth and seventh centuries were ,of course, destroyed in the Iconoclastic period..","date":"2012-09-22","mins":"4:49 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16720","author":"charles_freeman","post":"Tetradiplon on the peplos on the Parthenon Frieze? On this coming Monday I have to be in the British Museum and I shall try and find time to see the Parthenon Frieze on display there. I shall be looking at the relief that I reproduce in my article ‘Tetradiplon Revisited’ of the newly woven peplos that was brought to the Acropolis , ceremoniously folded. And then placed around the statue of Athena at the culmination of the ceremonies of the Panathenaia. Now find the relief and look carefully at the cloth. There is a final double folding being put in place in place, so is this the fourth folding of a cloth that has already been folded three times? Hard to say but I think I can pick out five different layers in one of the halves being folded. The fact that the sculptor has depicted more than four on a cloth that has been folded doubled each time suggests that this MIGHT be a depiction of a tetradiplon cloth. If so the folding BEFORE it is placed on the statue of Athena, fits well with the use of a tetradiplon cloth being presented to Jesus BEFORE he wiped his face with it in the Acts of Thaddeus. As those who have read the article will know, I suggest that the presentation of a pallium might have followed a similar ritual in the Christian era. Interestingly one, late , description of the Image of Edessa also describes it as a peplos. Need we look further?.","date":"2012-09-22","mins":"6:04 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16724","author":"charles_freeman","post":"P.S. The Panathenaia was still being celebrated in the third century AD so the idea of the four folding of the peplos, if such it was, was presumably still current and, like many pagan rituals, may have been adopted within Christianity in a different context. E.g the pallium..","date":"2012-09-22","mins":"6:24 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16723","author":"charles_freeman","post":"Max. This is an impossible question to answer ( and also completely irrelevant to this posting which is why I have not bothered to reply) because most were destroyed in the iconoclastic period you need to look at the references I have provided for you. We know of the image of Christ on linen discovered at Kamuliana in Asia Minor and we know that there was a duplicate of this because it passed on its image to the dress of the woman who found it. (Belting ,p.53) Both were displayed in processions in 560 and then transferred to Constantinople in 574. So there are two for you and I suspect that there many more because cloth decays so easily that most such cloths would have vanished even if they had not been deliberately destroyed by the iconoclasts. We simply do not know how many of the recorded images were specifically on cloth.We know that one reason that the Image of Edessa was especially venerated in 944 was because it was one of the few survivals of earlier images..","date":"2012-09-22","mins":"6:21 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16733","author":"charles_freeman","post":"You wrote: “This is an impossible question to answer”. Thank you. Like most questions about the past!!!.","date":"2012-09-22","mins":"7:44 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16748","author":"charles_freeman","post":"No, I can’t in this instance can you? it is impossible in most cases to know why an author chose one word rather than another. However, i do think my use of the relief from the Parthenon frieze does mark a step forward whoever sculpted it was working within twenty yards of where the ceremony took place every year (and every four years on a grander scale) so it is bound to be an accurate representation even though it might be difficult to show the right number of folds on a shallow relief. Anything more than four in one of the halves being shown folded suggests that the fold being shown was the fourth one and so the peplos might well be described as tetradiplon. ‘Too bad you can do without archaeocryptology. I had a few e Xoteric answers…’ This is the problem with you ,Max. We would like to know what e Xoteric answers archaeocryptology has given you about the Shroud. If you want to be taken at all seriously, you must stop making all these cryptic statements and write a proper article explaining how you would describe the history of the Shroud from AD 30. Otherwise you will just be treated as some kind of irrelevance. You clearly have skills than no one else possesses but unless you use them you will get nowhere. Go for it!.","date":"2012-09-22","mins":"1:13 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-17134","author":"charles_freeman","post":"We would love to know more about your theory. Why don’t you assume that we are all ignoramuses who need the history of the Shroud to be spelt out for us ? I still haven’t a clue what you are talking about. So go for it, Max!.","date":"2012-10-01","mins":"4:27 pm","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-17352","author":"charles_freeman","post":"Yannick and others who were interested in my views on Tetradiplon: my article Tetradiplon – the Mystery Solved? Is now up on the Sceptical Shroud website. I hope that it is found interesting..","date":"2012-10-09","mins":"1:05 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16464","author":"charles_freeman","post":"Ron et. Alia, Anyone looking at tetradiplon has 1) To explain why the word is only used of the cloth BEFORE Jesus wiped his face with it and not afterwards. One possible reason is to give the cloth status (as in calling it ‘sindon’ or ‘fine linen’) in what is a legendary, not historical, account in any case. See my article Tetradiplon Revisited for examples of this.This is highly speculative but not impossible. 2) Why Wilson wrote (The Shroud(2010), p.190) ‘Although its [the Acts of Thaddeus] initially off putting aspect is that it ‘explains’ the creation of the Image as by Jesus washing himself, it intriguingly GOES ON [my emphasis] to describe the cloth on which the Image was imprinted as tetradiplon’, when, in fact, the word tetradiplon was used only BEFORE Jesus wiped his face. Was Wilson being misleading or careless in giving the impression that the cloth was tetradiplon AFTER Jesus had wiped his face on it? 3) Why this same Acts of Thaddeus goes on to give a separate reference to burial cloths in the tomb, something that Wilson omits to tell us perhaps he never read that far. Anyone who analyses tetradiplon only through Wilson’s account and without reading the original Acts of Thaddeus is likely to be misled, as I was in the first instance. Ron’s comment to Yannick and myself :’Everyone of your points have been addressed, but you are too blind in your own prejudace against Wilson to see it.’ I am sorry I have not seen these points being addressed. Please refer me to where they have been, or if not, address them now. Thanks..","date":"2012-09-18","mins":"10:46 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16641","author":"charles_freeman","post":"Art Science ‘I find it strange that Charles seems to say the tetradiplon description is rubbish much like the confused hearsay sequence of how the image got on there.’ No Art Science, i have never said that ‘tetradiplon’ was rubbish. It is a strange word and it needs an explanation as to why the author of the legendary Acts of Thaddeus used it. First one must clear the decks.1) Tetradiplon is ONLY used of the cloth when it was handed to Jesus. 2) Wilson is misleading in The Shroud (2010), p. 190, when he suggests that the word tetradiplon is used to describe the cloth AFTER Jesus had wiped his face on it. Whatever the reason or motives for his ‘mistake’, Wilson has confused many people on this. 3) The Acts of Thaddeus, if read in full, make it quite clear that the author distinguishes between the cloth on which Jesus wiped his face ( the tetradiplon cloth, if you like) and the burial cloths of Jesus that are described separately as being in the tomb AFTER the face cloth had already arrived in Edessa. THIS MAKES ALL THE DEBATES OVER HOW THE TURIN SHROUD MIGHT HAVE BEEN FOLDED REDUNDANT. It had to be folded somehow to preserve it when not on display and it could have been folded in all different kinds of ways over the centuries of its life, probably different ways at different times. What seem to be happening here is people seeing folds that fit in with a tetradiplon folding when the word tetradiplon was never applied to the burial cloths in the tomb So we come back to why the word tetradiplon was used of the cloth when it was handed to Jesus. One guess, that I explore in my Tetradiplon Revisited ( which comes up as about number six if you put in the word ‘tetradiplon’ into Google), is that the author wanted to give a special status to the cloth that Jesus chose to wipe his face on. We know from festivals such as the Athenian Panathenaia that a peplos was specially woven, then folded (see the illustration in my article) and then handed over to be placed on the statue of Athena. There is some evidence that in Christian times a similar ritual was carried out for the pallium given to bishops.It was originally handed over as a folded piece of cloth but, eventually instead of a folded rectangle, the bishop was given a simple strip, So it is not impossible that a similar ritual was in the mind of the author of the Acts of Thaddeus. He simply wanted to embellish the legend a bit and he may have been aware of ceremonies in which folded cloths were handed over BEFORE they were used in a ceremony. I leave this suggestion open but it is a line of enquiry that better fits the existing evidence than anything that looks at folded burial cloths..","date":"2012-09-21","mins":"4:19 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16466","author":"charles_freeman","post":"From the Acts of Thaddeus. ‘And He knew as knowing the heart, and asked to wash Himself; and a towel [tetradiplon] was given Him; and when He had washed Himself, He wiped His face with it. And ‘His image having been imprinted upon the linen, he gave it to Ananias, saying: Give this, and take back this message, to him that sent thee: Peace to thee and thy city! For because of this I am come, to suffer for the world, and to rise again, and to raise up the forefathers. And after I have been taken up into the heavens I shall send thee my disciple Thaddæus, who shall enlighten thee, and guide thee into all the truth, both thee and thy city. And having received Ananias, and fallen down and adored the likeness[ sic], Abgarus was cured of his disease before [sic] Thaddæus came.’ Thaddeus does arrive in Edessa, after the Crucifixion and tells the story [in the same text]: ‘And they took Him, and spit upon Him, with the soldiers, and made a great mock of Him, and crucified Him, and laid Him in the tomb, and secured it well, having also set guards upon Him. And on the third day before dawn He rose, leaving His burial clothes in the tomb [sic]. And He was seen first by His mother and other women, and by Peter and John first of my fellow disciples, and thereafter to us the twelve, who ate and drank with Him after His resurrection for many days.’ Two separate cloths in the same text, one a the burial cloths in the tomb, the other ‘tetradiplon’ but only when it was handed to Jesus for his to wipe his FACE with no record suggesting that it remained folded..","date":"2012-09-18","mins":"10:55 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16398","author":"charles_freeman","post":"And it is worth remembering that the burial cloths are mentioned in the same text as cloths separate from the one on which Jesus wiped his face. In his The Shroud (2010) Wilson is misleading in suggesting that the description tetradiplon refers to the cloth AFTER Jesus had wiped his face with it, not BEFORE as the text suggests. As Yannick suggests, this whole debate is meaningless..","date":"2012-09-17","mins":"11:29 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-171101","author":"charles_freeman","post":"It’s in the Victorian and Albert Museum in London. They acquired it in the 1860s. I have been told that it is in storage and have been given the way I could get to see it. However, there would be no point in my going to see it unless I had an expert on medieval textiles with me. What this programme will come up with is anybody’s guess. They already have weavers involved. Similarly the producer told me that they would be approaching art experts about the painting. I shall be as interested as anyone else to see what emerges. I don’t know how this producer became so involved with the Shroud I had never heard of him before he contacted me – but he does seem to take that painting line. He told me That once they had finished they would try and artificially age the images. I asked him whether he had five hundred years to spare…...","date":"2014-11-13","mins":"3:54 pm","url":"https://shroudstory.com/2014/11/13/the-14th-century-3-in-1-herring-bone-weave/","cat":"history","title":"The 14th century 3 in 1 herring bone weave"},{"id":"comment-165076","author":"charles_freeman","post":"As I am totally tied up with leading my tour group, and have contributed many comments to this theme, I am now opting out. I need to concentrate on getting it around other sources. As I have said, it will be at least a year before we know whether my article has been accepted by specialists in the areas it covers or not and, while several hav E already been of help to me, I must concentrate on discussions with them. There only seems to have been one comment that the open minded Guardian removed and that was by one John Klotz..","date":"2014-10-24","mins":"1:47 am","url":"https://shroudstory.com/2014/10/23/the-guardian-notes-the-history-today-article-by-charles-freeman/","cat":"history","title":"The Guardian Notes the History Today Article by Charles Freeman"},{"id":"comment-69802","author":"charles_freeman","post":"Dan – my sympathies with your sciatica I had a bout last year and then when it was gone I did a bad lift and had another bad bout. I post this openly, out of topic, in case it is of use to anyone else. I got excellent advice and help, partly because my father in law is a doctor who had v.bad back problems himself. 1) Get a professional to check out that it is not something needing more serious attention (unlikely). 2) Keep with a good chiropractor/ therapist. 3) They will do no doubt tell you the right exercises for your particular glitch keep walking as much as you can. 4) Amazing how the pain goes when you get on a bike as it fixes your back in position and keeps you healthy if you are unable to move otherwise. Also get a good back rest. 5) Psychology apparently a big difference between those who give in and those who keep going despite the discomfort the latter are the ones who get through. I was told I had one of the worst problems my chiropractor had seen but now I only get a small twinge when i am sitting too long in the same place – but I do do a good walk every day with arms swinging! Good luck!.","date":"2013-12-29","mins":"6:15 am","url":"https://shroudstory.com/2013/12/28/the-sciatica-effect/","cat":"history","title":"The Sciatica Effect"},{"id":"comment-51873","author":"charles_freeman","post":"I think this just number juggling – as Hugh says the Assyrians had been dead and gone for several centuries. So what would these measurements have to do with the first century Roman empire in any case? I suppose that it is possible that Assyrian cubits went on as a unit of measurement but we would need some documentary or archaeological evidence for this. So perhaps we can hear from one of the enthusiasts for these cubits what they are trying to tell us. Then we have the problems of finding weavers who worked in Assyrian cubits who also used Z twist thread. Meanwhile the Shroud is the Shroud even if we can measure it in Mexican bean lengths..","date":"2013-11-18","mins":"9:23 am","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-51924","author":"charles_freeman","post":"Medieval English cloth was measured in ells. 1.14 metres so if the Turin Shroud is just one ell wide that looks good. Now let’s work it on the length. 4 ells is 4.56 metres, just too long. But we nearly got to one by four! However, the length of the ell did differ from country to country so perhaps a bit of juggling around and I will get it right. But ultimately so what? – it proves nothing at all other than I can search around a number of cloth measurements, ancient or medieval, until I find one that fits the Shroud which may never have been made to a standard measurement in any case. P/S. Archaeological work in Jerusalem has defined a Hebrew cubit at around 44 cms so it would appear that if the conservative Temple authorities were supervising the measurement of cloth it would not be in Assyrian cubits anyway. Don’t you think that by keeping the Assyrian cubits in without any caveats is being rather misleading? One gets the feeling that people are expected to believe that this in some way ties the Shroud to first century Jerusalem when it does not..","date":"2013-11-18","mins":"4:03 pm","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-51926","author":"charles_freeman","post":"Length of ells. Hugh is right that originally the ell was similar to a cubit but gradually the length seems to have doubled so Hugh’s 8 times 2 is my nearly four by one. The width of cloth was determined by the treadle loom that comes in about 1000 AD and is so much more efficient (you can use your feet as well as your hands)that it spread fast. The problem was that one could seldom weave more widely than 1.20 or 1.30m with one weaver, unlike the broader cloths of antiquity often over two metres wide because two weavers worked the shuttles. So I assume that the longer ell developed as a typical measurement of the width of cloth from a treadle loom. Length was not such a problem because roller bars allowed finished cloth to be accumulated and cloth lengths of up to 25 or 30 metres are known. One just cut off what what wanted as one still can from the rolls of cloth in a traditional haberdashery ( or at least in our fabric shop down the road we can!)..","date":"2013-11-18","mins":"4:12 pm","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-51941","author":"charles_freeman","post":"O.K. You are still stuck on this approach, for which there is absolutely no evidence, that the Shroud was made to a standard measurement. `Cloths were usually made to fit the purpose for which they were intended although the width and length were often constrained by the type of loom used! I am just joking around with some figures to show you can prove anything from measurements. The classic case is the measurements of the pyramids which have proved all kinds of things even the standard measure of grain used in Britain and, thanks to a kink in the passage way of the Great Pyramid, the outbreak of the First World War. Once you have seen this thing done before, you don’t take it very seriously.My favourite case is the fourth century statue base at Delphi in Greece where the marks left by the looted statues were said to be identical to those of the feet of the Horses of St. Mark’s. Problem solved the horses were fourth century BC until they were actually proved to be five hundred years later. Measurement can be important , for practical purposes such as building a pyramid where it is vital, but for burial shrouds that have to cover a variety of different shapes of human bodies it can hardly be important. Oxford English Dictionary ‘Ell: A measure of length varying in different countries. The English ell 45 ins, the Scotch 37 2, the Flemish 27in.’ I shall start on my calculations. . ..","date":"2013-11-18","mins":"5:09 pm","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-51877","author":"charles_freeman","post":"Cubit measures include the Roman cubit of 444 mm, The Egyptian short cubit of 450 mm, the Greek cubit of 463 mm the Assyrian cubit of 494 mm, the Sumerian cubit of 500 mm, The Egyptian royal cubit of 524 mm, the Talmudist cubit of 555 mm and the Palestinian cubit of 641 mm (from AE Berriman “Historical Metrology” London, 1953.) Now if you can’t make ONE of these fit the Shroud …….. It could ,of course, be x units of Palestinian cubits long and y units or Roman cubits wide to reflect the nature of Roman rule over Palestine or if that doesn’t work why not the Greek cubit because there is some evidence that the Greeks used Z twist yarn as is found in the Shroud and did trade with Jerusalem. Or may be they just wanted to make a shroud and so long as it covered the body it did not have to be an exact number of cubits of any of the different traditions. . . ...","date":"2013-11-18","mins":"9:56 am","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-51950","author":"charles_freeman","post":"‘The same stitch for resewing selvedges as was commonly used at Masada, and has since become evident on the TS.’ We need the source for this as the excavation report on the textiles at Masada show that most were in wool and that the sewn ones were repairs of worn clothes. No examples of the actual stitches used are provided. I had assumed that Flury Lemberg had made her own study of these textiles and presumably has produced somewhere comparative diagrams but no one seems to know where. I have always thought that the ‘quite similar’ she is often quoted as saying is rather too vague when we have so little ancient stitching left..","date":"2013-11-18","mins":"6:21 pm","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-53077","author":"charles_freeman","post":"Selvedges and stitches. I am now quite used to following up a source quoted in Wilson and finding something very different from what he suggests (the classic remains the discrepancy between Wilson’s depiction of della Rovere’s actual portrayal of Christ in the Shroud and his own version, p. 28 of my 2010 edition of Wilson’s The Shroud in which Wilson even reverses the position of the arms!). So while I was having a research day in the Cambridge University Library, I called in the Masada Report to check out the source references given above. In my edition of Wilson the discussion is on p. 109 110. P. 169, fig. Sixteen does exist. It does show a selvedge on a goathair cloth. The excavators appear to have illustrated it because it is woven on a tubular or two beamed loom. No other example of the use of this kind of loom or selvedge has been found this early in the Mediterranean. However, earlier examples are known in northern Europe from earlier so the suggestion is that either the cloth originated in northern Europe –more likely – see further below – or is evidence for the first use of this kind of selvedge in the Mediterranean. Wilson then gives a reference to Gabriel Vial’s 1989 report on the Shroud in which Vial talks of the construction of the Shroud’s selvedge as ’tout a fait inhabituelle’. He does not give the page number in my edition of The Shroud, but it is p. 15 with an illustration on p.16 of the Shroud’s selvedge. (The article is in the CIETA Bulletin for 1989, Dave B quotes a reference for pages 27 9 from his edition of Wilson but this is a completely different article!) The problem is that the selvedge on the Shroud does not appear the same as the selvedge shown in the Masada report. So all we can do is agree with Vial –the article is his own report of his examination of the Shroud while they were choosing the sample for radiocarbon dating on 21st April, 1988, so is interesting and perhaps even important in its own right that the selvedge on the Shroud is ‘very unusual’. We next go on to the reference to figs. 111 113 on pages 201 11 of the Masada report. Yes these figs. Do exist and on these pages. They all refer to the same fragment of wool. It is picked out and illustrated as it is wool, 2:2, Z twist spin, balanced diamond twill. So except for the Z spin being similar to that of the Shroud , I can’t see why this is relevant it is not herringbone, linen or 3:1. In the discussion on the origins of the textiles found at Masada (p. 239), this cloth is placed in their group iv. The excavators’ conclusion is that these textiles probably came from northern Europe as this kind of twist (Z) and this kind of pattern is known from examples there. They suggest it may have come in with Roman soldiers who were involved in the crushing of the Masada revolt. I simply cannot see why Wilson provides a reference to a piece of cloth that has absolutely nothing in common with the Shroud except that its thread is Z spun (and thus as the excavators suggest probably spun in northern Europe). So far nothing about stitching at all so I had to find my own reference to the stitching in the Masada report and it is found on pp 170 1 where they discuss the 45 textiles that have stitching on them. They illustrate six of these stitches on figs. 20 25 but they do not describe any of them as exceptional. So I was surprised to find that Wilson reproduces Masada fig. 23 (as his fig. 8) which is a counter hemming stitch as one which the excavators ‘adjudged to be a very unusual seam’. I can’t find any reference to such a judgement but as Wilson has provided no references it may have been somewhere outside the accompanying text in this section. Luckily I had access to a higher authority my wife who designed and sewed theatre costumes for her degree and then went on to work in the textiles department of the Victoria and Albert Museum. She took one look at Wilson’s ‘unusual seam’ and said in fact that this was the standard stitch for joining two pieces of cloth together when one wanted to make sure the ends did not fray. Nothing unusual about it at all! Wilson does mention that Mechthild Flury Lemberg is on record as saying that this stitch is similar to the one on the Shroud but he gives no reference for her opinion. In fact, it would seem that the stitch on the Shroud is the basic standard one which one would use then and now to join two pieces of cloth. And so how much more time does one waste with Wilson? I have certainly better things to do but at least I can warn Shroud researchers to take anything that Wilson says with a large pinch of salt. I had only to read into the next page to find other issues that I could have dealt with in the same way as here but life is too short and I have far more interesting and accurate historians to work with. Hugh seems the man for the job of taking a critique of Wilson further – sorry Hugh but so long as people are going on quoting Wilson in their support it needs to be done..","date":"2013-11-28","mins":"6:32 am","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-53221","author":"charles_freeman","post":"Louis/Helmut try Victoria and Albert textile collection numbers – 7027 1860 and 8615 1863. You will have to ask the Museum for details of them as I don’t know where they are catalogued outside the Museum. My wife no longer has any contacts within the Museum her colleagues have long since retired..","date":"2013-11-28","mins":"11:50 am","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-53225","author":"charles_freeman","post":"‘A certain trustworthy believing Jew, immediately after the Resurrection of the Lord, stole from His Sepulchre the sacred linen cloth and hid it in his house for many days; but, by the favour of the Lord Himself, it was found after the lapse of many years, and was brought to the notice of the whole people about three years(32) before [this statement was made to Arculf].’ O.K. Thanks for bringing this up as it challenges Wilson’s story that this ‘linen cloth’ was the Image of Edessa that was temporarily transferred to Jerusalem. By tradition, and you are more trusting of this than I am, it had always been in Jerusalem , which at least gives it a more plausible heritage than anything Wilson can put together..","date":"2013-11-28","mins":"11:56 am","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-51913","author":"charles_freeman","post":"Dickinson. ‘So there were cubits for Temple use, and various other applications, but it is a particular cubit of the market place that is connected with the Shroud, the cubit that is known as the Assyrian cubit: the widely used, indeed, international standard of that time for merchants of the Near East, and had been so for centuries. This cubit of commerce was carried with the lingua communis, the language of trade and diplomacy that stretched from the Euphrates to the Mediterranean, the tongue that had become the common language of the Jew. Aramaic: the same language which Jesus spoke. Aramaic had been the communication medium of the Assyrian Empire and Israel had been a subject of Assyria.’ But O.K. This article, that I HAD read, just says what I said : that the cubit had been ‘an international standard of that time for merchants of the Near East, and had been so for centuries.’ ‘This cubit of commerce was carried with the lingua communis, the language of trade and diplomacy that stretched from the Euphrates to the Mediterranean’. Greek (koine),the language of Paul was actually the main trading language by this period, four hundred years after Alexander had spread Greek influence over the Near and Middle East. So if a piece of cloth is found to have been woven in Assyrian cubits it could have been woven anywhere in these centuries and along these far flung routes. Just because the Temple authorities may have used Assyrian cubits ( this is not proven by anything in the article I don’t know which of the many alternative cubits the priests used but probably one can find out) does not mean that the Shroud was made there because Jerusalem was only one of thousands of possible trading centres in the bustling first century Mediterranean. Again, the fact that the Shroud may or may not have been deliberately woven in Assyrian cubits does not take us anywhere. Can you provide anything from the Assyrian cubit measurement that provides a link to Jerusalem rather than any of these other trading centres or specifically to the first century? In fact, this is probably the most unhelpful cubit there is to be woven in. If it measured in Roman cubits it would be datable to a much narrower range. So what one ought to be saying is: ‘Unfortunately the Shroud is woven in Assyrian cubits and as these were used for so many centuries and across such a wide region, this gives us no help at all in placing the Shroud in either date or place of manufacture.’.","date":"2013-11-18","mins":"2:36 pm","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-51906","author":"charles_freeman","post":"I wish someone would explain why the Assyrian cubits are important here. Even if the Shroud, wherever it was woven, was deliberately measured in terms of Assyrian cubits, this does not help date it as the Assyrian cubit had been in use over hundreds of years, perhaps even as far back as the second millennium BC. And if the Assyrian cubit was used by traders in cloth,then the Shroud could have been woven anywhere so again that provides no evidence of an original link to Palestine. So if the Assyrian cubit was really the measure, which I doubt, it simply says that the Shroud might have been made somewhere along the trading routes of the Middle East at some point within a margin of several hundred years. That does not help us very much. I think this Assyrian cubit route leads nowhere..","date":"2013-11-18","mins":"2:11 pm","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-76952","author":"charles_freeman","post":"Paulette. Surely, it’s not so much ‘making things up’ before doing research. It is rather approaching an issue with an open mind and then looking at all the possible areas to research. I have a lot of doubts about the authenticity of the Shroud but one needs to brainstorm ALL the possible ways in which it might have ended up in Lirey. I am still advocating research on the early relic trade routes from Jerusalem to northern France that we know existed and led to collections of relics close to Lirey supposedly from ‘the Lord’s Tomb’, as, applying Occam’s Razor, this is the simplest solution to how the Shroud got to Lirey (possibly, as I have argued, transferred to Geoffrey de Charny as ‘a spoil of war’ while he was fighting the English in northern France)..","date":"2014-02-06","mins":"5:09 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-171171","author":"charles_freeman","post":"As I say in my article, the presence of an apparent three in one herringbone or chevron dated to the fourteenth century in the V and A tells us no more than that such weaves existed in the fourteenth century, in this case a vestment. I was interested that ‘weaving fan’ seems to have known of others. It is a pity that we can’t track him or her down to find out more but there is the Collingwood reference (s)he gives. It is interesting that when my weaving contact was commissioned to weave vestments she was told to do it in three in one herringbone so there must be a tradition that associates vestments with this particular weave to this day ( unless she was meant to be reproducing a medieval vestment)..","date":"2014-11-14","mins":"3:52 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-39769","author":"charles_freeman","post":"I do think, however, that Fulbright needed to make it clearer which of her examples were wool and which linen or silk. Masada is almost entirely wool. The excavators report suggest that this was because flax was not grown in Judaea in the first century, but rather in Galilee and wool would have been the normal local fabric for clothes which the majority of the Masada textiles were. Later,the second century AD onwards, apparently because the Romans provided better irrigation, Palestine became well known for its fine flax. I think it is wrong to get woollen clothes and linen cloths, including those made for burials, mixed up as if the weaving of one could be compared to the weaving of another. As the insistence on fine linen for the priests shows, different fabrics were used in different contexts and different styles and patterns followed. As I remember it the Masada stitching was largely for repairs of worn clothing so I was surprised to hear that it was something special one reason for my original question. Yet as much of the Masada textile collection has never been published, F L may have seen something that was not reported in the excavation report from a private inspection..","date":"2013-07-26","mins":"6:06 am","url":"https://shroudstory.com/2013/07/25/what-did-wilson-andor-flury-lemberg-actually-observe-about-stitching/","cat":"history","title":"What did Wilson and/or Flury-Lemberg actually observe about stitching?"},{"id":"comment-39790","author":"charles_freeman","post":"Fulbright provides very few examples and those that she does come from very different time periods, fabrics and places that had very different cultural traditions. It is very difficult to generalise from them. You must not assume that there was something called ancient weaving that was similar throughout the Mediterranean over two thousand years. No one doubts that ancient weaving could be highly sophisticated look at the Rameses girdle of 1200 BC in Liverpool Museum it has been almost impossible to recreate the weave today even with programming the weave into a computer. Again look at the third and fourth century AD damask silks, of which only a few fragments survive. They needed up to twenty heddle rods on the loom to achieve them. The Shroud is way way below this sophistication, of course. But what Fulbright does not show is that there is a single example of a linen herringbone 3/1 weave known. This does not mean that they did not exist because so little survives (outside Egyptian sources) that we cannot be sure but if the Shroud is first century it is the only one with this combination of linen, herringbone, 3/1. I take the point that the Akeldama ‘shroud’ as a textile does not help us either way and I would support Fulbright on this..","date":"2013-07-26","mins":"1:31 pm","url":"https://shroudstory.com/2013/07/25/what-did-wilson-andor-flury-lemberg-actually-observe-about-stitching/","cat":"history","title":"What did Wilson and/or Flury-Lemberg actually observe about stitching?"},{"id":"comment-10536","author":"charles_freeman","post":"Max Patrick Hamon. Very interesting information good to know that research is going on in this area. I don’t know if you know the 1790 engraving I refer to I expect you do. What do think is the relic referred to as number 17, the Saint Suaire? I had assumed,perhaps wrongly that these might be the ‘sheets’ referred to in the Pharos list of 1201. Notre Dame claim that they have the Crown of Thorns from the Sainte Chapelle given to them after 1815 and now in a nineteenth century reliquary – do you have any take on this? I researched all this for my book Holy Bones, Holy Dust, Yale 2011 but decided not to deal with the Shroud as there were just too many conflicting accounts and there were so many more important relics issues in the Middle Ages which was the focus of my book..","date":"2012-04-18","mins":"10:21 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10598","author":"charles_freeman","post":"Thanks to Yannick for this. The argument , put forward by Wilson and adopted by de Wesselow in his The Sign, that the Edessa image was the Turin Shroud was never plausible and this provides a far better route for its later existence..","date":"2012-04-19","mins":"11:07 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10700","author":"charles_freeman","post":"Thanks for yours, latendre. 1) No, I don’t think the Shroud is first century on the present evidence. I don’t think that the presumption that the Carbon 14 dating is right has been overthrown. There is now the blood evidence if the blood on the Shroud is AB ,then this blood type only originated a thousand years ago. So I am keeping to a medieval date for the Shroud until someone comes up with something better – which may or may not happen. One day we may understand how the image was made science is always making progress about such things. 2) The copy. I only said that this was a SUGGESTION that had been put forward. As I have not read the original article in which this suggestion was put forward i cannot say more. So it is not ‘my ‘ claim that it is a copy. 3) You are right about historical speculation. The attempts to find a route to take the Shroud back from the fourteenth century to the first century AD are enormously speculative and I think Yannick here has shown up some of the problems. If you read de Wesselow, he is full of bizarre suggestions , see my original review on Amazon about just ONE link in the chain , back to Constantinople. The real problem about doing scientific research on the Shroud is that the Vatican should have put it in a conservation department where trained conservationists could have worked on it in laboratory conditions and kept any pigments selected on site. Allowing a team from the States free access in the 1970s meant that even the original pigments were taken off the cloth and distributed all over and then many were examined in home laboratories. As a means of doing scientific work this was disastrous, it is not clear how many of those working on the pigments they took were qualified in either conservation or analysis. No wonder much of the work done on the Shroud never passed peer review. If it had been done in a single top laboratory, such as in the UK the Victoria and Albert Museum or the British Museum (but many excellent ones also in Italy) , there would not have been the problem..","date":"2012-04-22","mins":"4:08 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10602","author":"charles_freeman","post":"I agree nothing is simple,especially as there was no precise way to describe particular relics and too many duplicates! – as John Calvin says. I particularly enjoy Erasmus’ Pilgrimage for Religion’s Sake on Walsingham and Canterbury..","date":"2012-04-19","mins":"12:42 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10607","author":"charles_freeman","post":"Yannick. Thanks. I am sure you are one the right lines and that if one wants to take the Shroud back in time one has to find an alternative route. As a practical man myself, who used to work on digs in the Mediterranean of the classical period, we were constantly brought up with how little,especially of cloth, survives from these centuries unless the conditions are very special. Edessa is very damp in winter!.","date":"2012-04-19","mins":"1:26 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10638","author":"charles_freeman","post":"Always remember the problem of damp! and even more so the long gap before 550 AD that Wesselow refuses to discuss at all. I saw one documentary on the Shroud where the Shroud was moved so that the BBC could film it. It had to be placed in a room where the humidity was controlled! The point about the difficulties of survival of linen in the long term was beautifully made – even if no one in the documentary seem to have realised what a major issue this is for the Shroud ( I am speaking here from my archaeological experience of working in the Mediterranean.) Incidentally in that film, they claimed, from a sideways photo image, that the folds were ACROSS the cloth and the idea was put forward that the bottom end was in a container or chest and the rest piled on fold by fold. This was used to support the idea that it was the Shroud that was raised up, from the container, each Friday in the Blachernae chapel in Constantinople. I can’t see how a burial shroud with a naked dead man on it could morph into the Edessa image which is always attached to legends that it was of Christ while alive. I am on Yannick’s side over this..","date":"2012-04-20","mins":"9:51 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10734","author":"charles_freeman","post":"Ron perhaps you will read my Holy Bone, Holy Dust, How Relics Shaped the History of Medieval Europe. Yale UP ,2011. You, and others, can go to the Yale UP US website to check out the reviews. I used to own some linen of 2,500 years old from an Egyptian tomb unfortunately I sold it. Yes, it was in perfect condition because linen is preserved in Egypt, if not in many other places. But Edessa is very damp! Can you please tell me how many pieces there are, from OUTSIDE Egypt, of linen carbon 14 dated to the period 300 BC to 300 AD? Today Protestants don’t revere relics. At the Reformation they actually burned them up. So too in early Christianity, relics were not revered. The documentary evidence for relics first becoming seen as important dates from the 380s, 350 years after the Crucifixion. We do have good records of many images ‘not made from human hands’ appearing in the sixth century onwards. Linking any one of these to a later medieval relic is extraordinarily difficult because the terminology is never precise and the number of people who have the necessary experience in Byzantine Greek is, of course, very limited. I have never come across any trained Byzantine scholar who would support Wilson’s thesis, In my researches for Holy Bones, I found examples of the bodies of martyrs being preserved and honoured but never anything from the first century. I am particularly interested in information about relics from before 550 because this is a long period, no less than 500 years, and one has to find specific documentary evidence where a relic was, why before 380, it may have been venerated , against the trend. . De Wesselow in his book The Sign refusers even to discuss the question. There was another trend, not to show any images that showed the suffering of Christ – you can’t find any such in early Christian art. It would have extraordinary for a Jew to have kept a blood stained burial cloth as it would have gone against every traditional taboo. I doubt whether Wilson has found the evidence that no one else has for this period before 550. Hans Belting covers the issue well. Hans Belting, Likeness and Presence, p. 213. ‘Although an alleged letter of Christ that had healed the king [Agbar] was venerated as a relic, no image was mentioned [in Edessa] before the sixth century, when miraculous images became popular elsewhere as well. [CF –it is often forgotten that there were lots of them around!] As late as 544, Procopius still attributed the recovery of the town from the Persians to the letter, whereas by 593, the chronicler Evagrius gave the credit to the ‘God made image, which had not been touched by human hands.’ Belting expresses the common opinion of scholars that there is no mention of an image in Edessa before c.600. You can choose not to believe the report that it was the custom to sprinkle the (open) eyes of the Mandlion with water but then you runn the risk of being accused of only accepting the documents that support you and rejecting those that don’t! Alas, all too common in this field as I know from my own work. That is why i decided not to go anywhere near the Shroud in my book there are far more interesting relics in the Middle Ages as you might discover if you read Holy Bones! I must really try and withdraw from the discussion here! ..","date":"2012-04-23","mins":"3:28 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10642","author":"charles_freeman","post":"Legends no we certainly can’t. It was all too common in medieval Europe for relics to be given legendary histories for which there was no evidence at all. Without a legend that explained how a relic came to be where it was, why should anyone believe in it? I was doing some work on Guibert of Nogent you may know his twelfth century critique of relics and his monastery had relics from the first century that a king of Britain had collected from the apostles in Jerusalem and had buried on the site of the monastery! Incidentally Hans Belting, Image and Presence, p. 211, tells the story, recorded by a Byzantine court theologian, that when the Mandylion was exposed for veneration it was the custom for people to sprinkle its eyes with water should we believe this or not?.","date":"2012-04-20","mins":"10:35 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10698","author":"charles_freeman","post":"I think you are right. IF a definitive first century Carbon 14 dating did ever come up then we would have to assume that the Shroud survived somewhere all those centuries. But it seems pretty clear that there is no proper historical evidence that it came through the Edessa route..","date":"2012-04-22","mins":"3:52 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10757","author":"charles_freeman","post":"I had planned to opt out of this discussion but looked up a library copy of Wilson’s latest (2011) Shroud and his account of the birth of the Edessa image is complete and utter nonsense. On p. 162, he quotes from the Doctrine of Addai, which is a later fourth/ early fifth century legendary account which includes STORIES about King Agbar. Wilson’s quote comes from an account of Addai coming before King Agbar and his face shining , although no one else other than Agbar can see this. A page later Wilson says that this is the Turin Shroud aka the Edessa image. Well ,why should this legend of Addai’s actual living face have anything to do with any shroud image of Christ – why should it relate to any cloth/painted image at all?. There is absolutely no hint that this is about an image at all its one of the miracles of Addai, of which there are many others. I think we should stick with serious scholarship and just acknowledge that there is nothing that can be seen as an image in Edessa until the late sixth century when in other regions, several of these images are recorded for the first time.The image is, how often does one have to repeat this, always said to be Christ while alive and this is why copies of the Mandylion always show Christ with his eyes open without any marks of suffering. As Belting says, this was a time when there was some conflict over whether there should be images of Christ and the invention of a legend (one version of the Edessa origin) that Christ had sent an image of himself was used by those who argued that he could be shown. I had not expected Wilson to lay himself open quite so easily to derision but, as we have seen, there are people who do continue to believe him. I wonder, how many support his ingenious idea that the Carbon 14 dating was contaminated because that is where hands held up the Shroud. But how often was it exposed, how was it held up so that the whole image could be seen , do we know that the hands were consistently in the same place, is there any sign of wear and tear that one would expect from continual handling, was there really enough sweat to contaminate it (without causing decay) and how did this come to the amount to make a first century piece of linen come exactly to the radio carbon 14 date 1260 1390. A miracle, I would have said..","date":"2012-04-23","mins":"3:03 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10732","author":"charles_freeman","post":"Latendre. The 1978 team were all from the United States so to us in Europe it was a team from the United States – just as if a team from Europe came to analyse a native American relic, it would be a team from Europe. Was it, however, a ‘team’ , see below. ‘Home laboratories’ I was only using Ray Roger’s own words. It is often very difficult to know with STURP researchers where their researches took place, whether in the public laboratories of which they were members or elsewhere. Mc Crone, of course, had his own business. I looked up Joseph Marino and, please correct me here, did find a long and interesting testimony of how God had brought him to the study of the Turin Shroud but no evidence that he done any laboratory work on the Shroud itself. ‘Even the original pigments were taken off the cloth’, Pigments were on the Shroud, of course, no one denies that. I should have said ‘original pigments and other substances’. Even if you drum out Mc Crone you have to accept that he found some pigments, Ray Rogers relies heavily on the pigment vermilion for his attempted refutation of the Carbon 14, and haemoglobin is a pigment of blood all on the Shroud. The problem is as follows. You have an ancient piece of linen, date unknown with an image the nature of which is unknown. Naturally people are interested in it including a number of individuals from the United States. Looking at where the 1978 STURP members came from, I don’t see any working in laboratories that specialized in ancient cloth. Had a single member of the 1978 team specific expertise in ancient textiles, had any even seen one before they saw the Shroud of Turin in 1978? I am happy to be given the evidence if you have it. Then there is the rush of events due to the short timescale given to the team for examination. They are not working ,of course, in laboratory conditions and photos show a mass of individuals crowded around the Shroud. But the sellotape is applied, the Shroud is unstitched. Who knows what damage may have been done? This is not normally the way professional examinations of ancient paintings is done it often takes years there are cases in the British Museum at the moment when the full report is not expected for years! So the team make off back home after five days of frenzied work. Well, they have their 32 samples from all over the cloth, so what next? There is no evidence that they then teamed up with a museum conservation laboratory with experience in dealing with such material although there must have several in the US with the expertise to help them (again I am open to correction here). They seem to have kept the material among themselves. Then one of their members, Walter Mc Crone who has his own laboratory, is allowed to have access to all the 32 samples and comes up with a report that the samples are largely pigment. Consternation and eventually Mc Crone is forced out. This shows the weakness of the whole STURP approach of sending out the samples to members of the team instead of people with specific expertise, this kind of result is bound to happen. I don’t know whether Mc Crone was right, broadly right but exaggerated the extent of the pigment, or totally wrong but the STURP procedures were bound to lead to fiascos such as these. A major part of the problem is that STURP increasingly became associated with the view that the Shroud was genuinely the first century burial cloth of Jesus and so its scientific credibility went down (whether it was/is right is not the question, it is the impression it gives of having decided the matter beyond all doubt, which is the antithesis of true scientific work. Compare the attitude of the Oxford radio carbon 14 laboratory which says it will re examine its 1988 results if evidence comes up to challenge them). When the idea of professional carbon 14 dating came up, the Vatican started afresh by calling in people with the right professional experience in radio carbon 14 dating and textiles. This is ,of course, what they should have done all along. They should have handed over the Shroud in 1978 to a professional laboratory whose members had specific expertise in dealing with ancient textiles. I am sure that such a laboratory would have refused to allow any material from the Shroud out of their sight – there would have been none of this passing around of bits and pieces as seen in the Ray Rogers case below. Then outsiders who had particular expertise could have been asked in to see or work on the Shroud under proper laboratory conditions. Surely you have to admit that this would have been a better way of proceeding than the rushed 1978 examination. Compare these two accounts. 1) From the Nature Report, February 1989 – a report signed by 21 individuals including six who were recorded as being at the selection. ‘The sampling of the shroud took place in the Sacristy at Turin Cathedral on the morning of 21 April 1988. Among those present when the sample as cut from the shroud were Cardinal Anastasio Ballestrero (Archbishop of Turin), Professor L. Gonella (Department of Physics, Turin Polytechnic and the Archbishop’s scientific adviser), two textile experts (Professor F. Testore of Department of Materials Science, Turin Polytechnic and G. Vial of Musée des Tissues and Centre International d’Étude des Textiles Anciens in Lyon), Dr M. S. Tite of the British Museum, representatives of the three radiocarbon dating laboratories (Professor P. E. Damon, Professor D. J. Donahue, Professor E. T. Hall, Dr R. E. M. Hedges and Professor W. Woelfli) and G. Riggi, who removed the sample from the shroud. The strip came from a single site on the main body of the shroud away from any patches or charred areas. Three samples, each ~50 mg in weight, were prepared from this strip….. All these operations, except for the wrapping of the samples in foil and their placing in containers, were fully documented by video film and photography.’ In view of the numbers present and their professional qualifications in textiles and radio carbon dating, this selection would seem to be a valid process. Note that Luigi Gonella was present but there is no record that he was involved in cutting the Shroud. 2) And this from Raymond Rogers’ report in Thermochimica Acta (2005). I have no evidence that Raymond Rogers had any particular expertise in radio carbon 14 procedures. ‘On 12 December 2003, I received samples of both warp and weft threads that Prof. Luigi Gonella had taken from the radiocarbon sample before it was distributed for dating. Gonella reported that he excised the threads from the center of the radiocarbon sample.’ Note that the date he received these samples, the removal of which is not recorded in the original selection process, is over fifteen years later. When did Gonella take them from the sample? Did anyone see him doing so? Where had the fibres been since then, held under what conditions? So let’s not cast aspersion on anyone, let’s just say that the procedures by which the fibres arrived at the radio carbon laboratories and Raymond Rogers’ laboratory fifteen years later were significantly different! The qualifications of each to assess radio carbon 14 dating are also very different. Roger’s vague assertions about his fibres do not, of course, and he never claimed they did, provide an alternative date, nor do they provide any reason why a test on another part of the cloth should produce anything earlier than the medieval period. There is no reason to privilege Ray Rogers’ report above that of the Nature report although this is frequently done. I keep to the presumption that the ‘official’ radio carbon14 report must take precedence until an equivalent means of dating comes up with something different , possibly 6th 7th century when these images were first reported ( N.B. Carbon 14 dating of Oviedo shroud at 7th century) or earlier. I think I have made my points clearly enough to withdraw here. Wearing my historian’s hat, the evidence that the Turin Shroud can be taken back the Edessa route seems non existent. I haven’t seen any acknowledged Byzantine scholar (and it is a pretty specialized world needing years of study of ancient texts) who would support it..","date":"2012-04-23","mins":"3:01 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10800","author":"charles_freeman","post":"Ron: Just to put the record straight, I am a historian (although I worked on archaeological digs in Italy, Turkey and the Sudan before noting how my trenches always fell in !) and you can find the books I have written on the internet. As I have done a lot of work, for university presses, Oxford and Yale, on early Christianity, relics, etc,I think I have some right to state where Wilson has gone wrong. He has a habit of completely misreading medieval sources to suit his strange thesis that the Edessa image/Mandylion is the Turin Shroud. But I shall leave you to draw up your formal indictment of the men of 1988! Having seen how Wilson rubbished the ‘reweaving’ theory I wonder which of the many competing hypotheses is your favourite..","date":"2012-04-24","mins":"3:26 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10801","author":"charles_freeman","post":"P.S. No, Ron , i was reading the latest ( 2011) edition of Wilson , and if you can follow his thesis on pages 162 3 as to why an extract from the legendary Doctrine of Addai written probably in the early fifth century refers to an image of Christ of the first century, then you have a more imaginative mind than i have. He completely fails to give any evidence for the existence of an image in Edessa before Evragius ‘ report in the 590s. If you read Hans Belting’s Likeness and Presence : A History of the Image before the Era of Art, University of Chicago, 1994, you will find a truly scholarly account of all these references to images and icons – that is the book that the mainstream historians of relic images use..","date":"2012-04-24","mins":"3:33 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10815","author":"charles_freeman","post":"Ron on Wilson. If you get the 2011 edition look at page 240. Here he quotes a source, I think from 1090, which says that the Mandylion was kept locked up and that only the emperor could see it. It was ,of course, in the Pharos Chapel, the private chapel of the emperors. So unless the emperors reversed their decision about this, it was not on view to ordinary mortals. This just confirms that it is unlikely to be the ‘sheets’ in the Pharos chapel, which are listed separately in 1201 anyway , and certainly not the same as the exposed shroud with an image in the Blachernae chapel at the other end of town. Most commentators who want to take the Turin Shroud back beyond the Middle Ages, say that the only shroud that corresponds to the Turin Shroud is the Blachernae one. Wilson goes against this ,of course he sticks with the locked up Mandylion. But I had limited time and did not read further to see how he resolved the question. The problem remains ,of course, that we know that the relics in the Pharos chapel were not touched in 1204 and that many of them went on in the years afterwards to Louis IX’s Sainte Chapelle, where the Crown of Thorns that he got from the Pharos Chapel ( via some Venetian bankers!) was the star attraction. There is some evidence that the Blachernae shroud may have gone into Europe via Athens. So perhaps the real question should be, forget about the Edessa image, and try and trace the Blachernae Shroud back. We know that many of the relics in this chapel were placed there in the first half of the FIFTH century by Pulcheria , the sister of the emperor Theodosius II ( ruled 408 450). So this might get the Blachernae Shroud back this early, 150 years earlier than the first mention of the Edessa image. It seems a much more likely route than Edessa. The Blachernae Shroud was said to be a burial shroud of Jesus, there is no evidence that the Edessa Shroud EVER was, whatever Wilson might say. So Shroud sceptic though I am, I am putting forward a far more plausible ‘history’ of the Turin Shroud than Wilson is!.","date":"2012-04-24","mins":"10:49 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10813","author":"charles_freeman","post":"Ron. The provenance of the sample is well known and recorded on film, unless you subscribe to the conspiracy theory of Tite and the Cardinal later swapping a sample over. I don’t as it is seems simply ludicrous. I was surprised that de Wesselow appeared to entertain it. The sample has a far better provenance than the fibres obtained by Rogers for instance which cannot ,in any way, meet scientific criteria we don’t even know how they were stored or transported to Rogers or whether they were what they purported to be. I accept the 1988 finding until a clear alternative is put forward as to why the testing was not accurate. For this there must be a consensus. We do not have any agreement over whether the problem is contaminants or reweaving. You cannot convince a old sceptic like myself so long as those challenging the Carbon 14 cannot even agree among themselves what went wrong with the work of three professional laboratories. It is not good enough to put forward a series of vague possibilities as to why the testing might not be accurate. So I stick to my original position that for me the presumption is that the testing must stand and if there is a retest, my hunch is that, while they may be some readjustments with a different sample, the date will emerge again as medieval. I stress PRESUMPTION. I have no reason to prefer any one date over another – after all there was ONCE a burial shroud or burial cloths of Jesus, just as there was a cross and nails, and probably a Crown of Thorns and a stone that was rolled away from the tomb and goodness knows how many other relics. No one is suggesting that these relics never existed at one point in the first century. The question to me as an archaeologist/historian (stress, this largely an archaeology problem I have worked on first century AD digs and I know how little survives) is did these particular items survive or not? The probability , overwhelmingly, is not, as a bloodied sheet would have been unlikely to have been kept by Jews ( I stand to be corrected by Jews on that one), relics were not collected as such before c. 380( just as they are not collected by Protestants today) and damp would almost certainly have destroyed the cloth. This is common sense and this is where I always find it easier to start when working on a historical problem. That is where I started with the Shroud case when I was working on my history of relics – there has never been any other relic from the first century that has been proved to be such – so this one would really have had to have a most unusual history, one that certainly has NOT been tracked by Ian Wilson. The best way out of this is to do another C 14 testing. At present there is not a shred of carbon 14 evidence for a first century date. There is not even a calibrated set of results for vermilion deterioration so even if samples were gathered, or failed to be gathered, from across the Shroud , there would be nothing to test them against. (Rogers appears to have been a loner here and no one has followed him up.) Of course, the way that the Shroud has been mauled about by various parties with no experience of working with ancient textiles has made the Vatican suspicious about passing it out again. But I suspect that if any carbon 14 dating laboratory with an international reputation could put forward a coherent case for retesting, they might give in. Perhaps you and your supporters could work on this. If your case is as clear as you say it is,then surely a professional laboratory somewhere would back you. Certainly Oxford are quite open to it as they showed with their testing of John Jackson’s theory of carbon monoxide contamination (and they have made it quite clear that they are open to new evidence what more can you ask? they are certainly one of the world’s top r c labs). So let’s see how we go. I appreciate that your interest in the issue is many times stronger than mine for whom the Shroud is only one of hundreds and thousands of relics, authentic or otherwise, that still exist. As I say above, all these relics recorded in the gospels did exist at some point , but did they survive? That seems to me to be the question to focus on. I can see that I approach this question in a very different way from the way you do, but why not? There are many paths to the truth!.","date":"2012-04-24","mins":"10:28 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10817","author":"charles_freeman","post":"Fine, Ron. Why don’t you get in touch with Oxford or some other lab. As I suggest to see if you can get all this restarted. It obviously worries you a lot more than it does me. If the Shroud is first century , well ,we know a shroud or burial cloths existed then ( see John’s gospel) so , extremely unlikely though it might be , it is just possible that it survived. We may also find the Crown of Thorns, and some of those phials of blood may really have been taken from Jesus on the cross (just check that they are AB), and the stone that closed up the Tomb would not have suffered the problem of damp, so presumably it is still around somewhere. Then what? Most Christians broadly accept the historical evidence of the gospels,so not that much would change if some of the recorded backing evidence ever turned up. As one clergy friend of mine said when we were discussing this, it matters nothing to me whether the Shroud is genuine or not I will still believe in the Resurrection. Still, if I was you, I would work really hard on getting a new testing to set your mind at rest. Now the other issue. Here is an extract from Holgar Klein’s article on relics in Constantinople. If you google the author you will find it on his website. If I was looking for a way in which the Shroud or any other relic came to Constantinople from Jerusalem I would start here. There are many more documentary sources than Wilson can ever find in support of his theory ( as listed below) and they are much earlier – but,of course, he is so obsessed by the Edessa route, he won’t consider much more likely routes for the transfer of relics from Jerusalem to Constantinople. We are talking here of the 330s!! As I do quite a lot of work on Constantinople, and have been there recently setting up a study tour I am leading in October, I can tell you that the column of Constantine still stands although it is very battered.We even have a wonderful ivory relief from about 420 showing the arm of the martyr Stephen coming into Constantinople. Keep with Wilson if you must but there are far,far better historians around Klein is one of them, and here he provides a much more plausible possible route for the Shroud than Wilson ever does. If it came into the city from Jerusalem in the fourth century, was included among the relics that Pulcheria placed in the Blachernae chapel in the 420s, kept away from the damp (unlike the Edessa image in the city gate), then this would explain why Robert de Clari saw a burial shroud with an image of Christ on it in this very same chapel eight hundred years later. You also have a far shorter time between the crucifixion and the transfer of the relic to account for. ‘It is a common belief – based by and large on Ambrose’s funerary oration for Theodosius the Great, some passages in the church histories of Sokrates, Sozomenos, and Theodoret, and much later patriographic records – that Constantinople’s rise as a cult center for the relics of Christ’s Passion has its origins in the time of the city’s foundation under Constan tine the Great. According to these sources, Constantine himself received part of the relic of the True Cross and the Holy Nails from his mother Helena, who allegedly discovered them on Mount Golgotha during her pilgrimage to Jerusalem. In the capital, Constantine is said to have enclosed these relics – together with holy chrism, the crosses of the two thieves, and the palladion of Athena – inside the honorific column and statue that adorned the emperor’s Forum.’ Why not the burial shroud as well?.","date":"2012-04-24","mins":"12:27 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10527","author":"charles_freeman","post":"Very glad to hear of the Emmanuel Poulle article which I did not know. This seems very much on the right lines and certainly a better documented explanation than that de Wesselow’s (in his new book The Sign) and others’ claims that the Mandylion is the Turin Shroud. The Pharos relics seem to have survived the sack of 1204 as they were in the imperial palace and were then distributed ,sold or used as surety for loans ( the Crown of Thorns) by the Latin emperors who ruled in Constantinople until the restoration of the Byzantine Greek emperors in 1261. Most of them went to Louis IX’s Sainte Chapelle. In the official guidebook to the Sainte Chapelle there is an engraving of 1790 showing the Chasse, or main display altar, in the chapel, and seventeen listed relics from the Passion and Cruxifixion including a Holy Shroud, most of which can be linked back to the relics list of the Pharos chapel. However, there is no definite mention of a Mandylion there and it is assumed that the Shroud are the ‘sheets’ mentioned in the Pharos chapel as being of cheap cloth (listed as separate from the Mandylion in the Pharos list of 1201) .So one must be cautious in being sure that the Mandylion was among those transferred to Paris but it may well have been. The closest shroud in description to the Turin Shroud is, as you say, the one in the Blachernae Chapel (which does not mean, of course, that is is the Turin Shroud because there is no record of what happened to it after 1204 and and of course there were many shrouds, face cloths, images ,etc, around in medieval Europe – Oviedo, the Vera Iconica in Rome,etc,). De Wesselow claims that the Mandylion and the two shrouds from the Pharos and Blachernae chapel are one and the same! I am afraid he completely lost me there!.","date":"2012-04-18","mins":"6:12 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10828","author":"charles_freeman","post":"Thanks, Ron, I think the idea that the image of Edessa is the Shroud of Turin is so bizarre that it is not worth considering. I always thought that and when I read Wilson on it, it was clear that he had failed to tackle the basic questions and used the sources in a totally misleading way. Believe him if you must. He has no background in the history of the period and I would prefer to rely on trained Byzantine scholars such as Klein and Belting. We know a shroud with a full length body image on it that was claimed to be the burial shroud of Christ was in the Blachernae Chapel in the early thirteenth century ( Robert de Clari) and was exposed. So it must have got there somehow. The question is how. If I was doing further research on this, which I am not, I would follow up all the early sources, and there are many,which deal with the links between the imperial family and Jerusalem from 330s onwards during which we know that a lot of early relics linked to the Crucifixion were brought from Jerusalem into Constantinople. As I have not been through these original sources, I would not know whether there was a shroud or any form of cloth mentioned.It would be a chance whether any document mentioning it survived or not as we only have a tiny proportion of the original documents, I would be particularly interested in Pulcheria because she had her own links with Jerusalem and imported a number of relics from there see the relief of her welcoming the arm of Stephen in c.420 which came, of course, from Jerusalem. You can find some preliminary details in my book Holy Bones, pages 40 41. So it is possible that a Shroud was among them this seems the most likely time for it to come but you are free to suggest any other period when it arrived. You have to explain its presence somehow! You say the Shroud would have great fanfare but I don’t think it would have rated as high as the Cross (this was the most treasured relic of the Pharos Chapel as you will see from reading Klein) or the Crown of Thorns. Nor would a burial cloth have had the same resonance as an image of the LIVING Christ given by him to king Agbar, Remember the imperial family had many relics of the Passion and Crucifixion including the actual blood of Christ and the shroud would probably have been quite low in the pecking order. Note too that another image of the face of Christ while alive, the Veil of Veronica , was rated even more highly than the Mandylion. It is always a mistake to assume that, among the hundreds of relics of the Passion and the crucifixion, that the Shroud would have had any special status. The Blachernae Shroud cannot have been the Mandylion as, and here Wilson actually provides the evidence , on p. 240 of his 2011 edition, that the Mandylion was in 1090 locked in a chest and only the emperor was allowed to see it.In 1201 it is listed as still being in the Pharos Chapel. So it is certainly not the same as the purported burial shroud of Christ in the Blachernae Chapel which was the other side of town. Once on Constantinople, the Shroud would, of course, have been stored under cover in the church sacristy, so protecting it even from the damp of Constantinople, along with the other cloth relics we know were in the Blachernae chapel, notably the robe worn by the Virgin Mary. It would have been much more likely to have survived there than in the gate at Edessa! As I have said, this is where I would direct my research because there is clearly a much more plausible ‘story line’ here. Like any good historian , if I did not find the documentary evidence to support the case, i would not twist the documents to make a case and would probably end up saying that one can only speculate from the limited sources! Most commentators who have tried to find the link between the Turin Shroud and an earlier history in Constantinople have elected the Blachernae Shroud as the ONLY shroud that seems to have any relevance to the debate. The Pharos sheets are said to have been of poor cloth and there is no record of an image on them, the Mandylion was locked away and was, anyway, ALWAYS said to have been an image of Christ while alive. I don’t know whoever first put forward the idea that the Mandylion was the Shroud it makes no sense to me at all. I hope I have shown you and any other readers that there is more to this than Wilson ever suggests and, for those who do believe that the Shroud is genuine and came down through Constantinople, some much more promising avenues to explore than the watery Edessa route! But you do need to know your Byzantine Greek because not all the relevant documents have been translated and you would not want to miss a vital reference to the Shroud because you did not know Greek! ..","date":"2012-04-25","mins":"3:54 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10878","author":"charles_freeman","post":"Ron. Nicholas Meserites lists the Mandylion as being in the Pharos Chapel in 1201. The fact that only those of highest standing would have seen it, puts paid to the theory that it was seen ,close enough up for the herringbone weave to be detected, to be reproduced on the Pray Codex of c.1192. A Catholic,as we assume the illustrator of the Pray Codex to have been, would never have been allowed within the Greek Orthodox Imperial Chapel as the two churches were in schism. I am trying to help you here by diverting you towards the burial shroud in the Blachernae Chapel. It fits the description of the Turin Shroud better and was exposed to the public. It was also in a chapel founded by a fifth century princess who is known to have received relics from Jerusalem.So do please accept that there are other ways to explore the history of the Shroud. No one, but no one, in the real world of scholarship has any respect for Wilson’s theory..","date":"2012-04-27","mins":"3:09 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-10852","author":"charles_freeman","post":"Ron. No , the idea that it was Christ while alive is not weak. It was the absolute essence of understanding the Mandylion and there has never been any other legend attached to it. There is no way that the image of the Turin Shroud , especially if shown at full length , could be interpreted to be that of Christ while alive. Yet the Mandylion is said, in several different documents ,to have been an image of Christ taken during his lifetime ,either as a gift to Agbar or from his face in the Garden of Gethsemene ( ‘sweat ‘ comes when you are alive, not dead!) .But if you can’t see that ,there is little more that I can do for you. I can only endorse Yannick that Wilson is seen as a joke as a historian in circles outside those of the pro Shroud community. Where is his basic training in the history of Byzantine images and sacred literature associated with them? Why not concentrate on the Shroud in the Blachernae Chapel? It must have got there somehow and it fits the description of the Turin Shroud. So long as you don’t test my patience further by saying that it had been transferred there from the Pharos Chapel which was the private chapel of the emperors within the imperial palace. Now that would have caused headiness: ‘Emperor allows his private collection of precious relics of the Passion and Crucifixion to be transferred to the other end of town!” As we know that they were still in the chapel after 1204 and most were sold to Louis IX where they are recorded in the Sainte Chapelle, that is truly a non starter..","date":"2012-04-26","mins":"3:32 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"}]
