[{"id":"comment-210037","author":"charles_freeman","post":"No one would have forged a burial cloth with images on it it would be the equivalent of forging a Canaletto and putting a nineteenth century Venetian bridge into it. So we need to look elsewhere for its creation. The vast majority of relics were objects that were either so ancient that their origins had been forgotten and thus they could be adopted as relics (there are bones of Christian martyrs that have been C14 dated to pre Christianity!) – or objects, such as icons, that were associated with miracles, often of healing. I think that the constant reference by the popes to the Shroud as an icon fits very well, as icons do not to have to be any more that painted images but many still arouse great veneration. This is where, alongside the popes, I place the Shroud. The remaining images look very haunting but compared to what the top artists of the fourteenth century were producing, they are actually very crude when you analyse and compare them to each other. I still think that linen discoloured by having five hundred years of a first sealed,then painted, surface which disintegrated with constant handlng is the best bet. It helps explain why the edges of the images merge into the cloth so that one cannot even say for certain what the lengths/heights of the two images are (although they appear to be larger than life size as has been noted by others)..","date":"2015-09-10","mins":"7:27 am","url":"https://shroudstory.com/2015/09/03/colin-berrys-latest-and-greatest-is-it-enough/","cat":"3d","title":"Colin Berry’s Latest and Greatest. Is it Enough?"},{"id":"comment-210074","author":"charles_freeman","post":"Sheona you need to do some work on the early depictions and descriptions of the Shroud which make it quite clear that originally it was painted. The paint appears ,from nineteenth century depictions, to have disintegrated in the nineteenth century. There is a mass of evidence to support it and one day I will publish it in full. You do not ,of course, need to bother to read it when I do!.","date":"2015-09-10","mins":"5:11 pm","url":"https://shroudstory.com/2015/09/03/colin-berrys-latest-and-greatest-is-it-enough/","cat":"3d","title":"Colin Berry’s Latest and Greatest. Is it Enough?"},{"id":"comment-210095","author":"charles_freeman","post":"But you need to distinguish between a ‘relic’ that was deliberately created to deceive and an object that was created for some other purpose that was adopted as a relic ,perhaps because it was ancient, had a long tradition of veneration or was believed to have caused miracles. Most relics fell into the latter category. If you wanted to forge the burial cloth of Jesus you would not unnecessarily add images to it. That is perhaps why the Shroud of Cadouin was the most popular shroud relic in medieval Europe – no images, looked like the sheets that were shown in pictures of the day, provenance from the Holy Land, a big following, partly because, unlike Lirey, it was one one of the main pilgrimage routes to Compostela..","date":"2015-09-11","mins":"1:40 am","url":"https://shroudstory.com/2015/09/03/colin-berrys-latest-and-greatest-is-it-enough/","cat":"3d","title":"Colin Berry’s Latest and Greatest. Is it Enough?"},{"id":"comment-175959","author":"charles_freeman","post":"This is a depiction where you can see the Crown of Thorns, the long hair at the back and the gap between the elbows and the body on the dorsal image,all now vanished. This makes my point that what we have now is a diminished images of what there once was. The Crown of Thorns in place AFTER the deposition is datable to the fourteenth century. The gap between the elbows and the body is an important feature as if you try the pose yourself, and I do this with my audiences, you cannot also cross the hands in front. This suggests two completely independent images and not a cloth wrapped simultaneously over the same body. The loincloth suggest that this is a post 1578 image as we have no examples if a loincloth placed on the Shroud before this date. We have many other depictions by different artists that confirm these features. So lots to work with. Thanks, Colin..","date":"2014-12-12","mins":"4:52 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-175409","author":"charles_freeman","post":"‘Nobody …has previously suggested that the TS body image was produced as a thermal imprint to simulate an ancient sweat one.’ I can’t think why they missed it,Colin, it is such an obvious explanation – I just can’t believe that you have not found the evidence for it yet!.","date":"2014-12-09","mins":"4:21 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175519","author":"charles_freeman","post":"‘The painting process was very efficiently carried out, which suggests that the painter must have been well experienced. First, he painted all the outline shapes with unmodulated local colour, then he added the interior details and modelling. To create a three dimensional impression, light and dark lines were added, and sometimes cross hatched shading. . . . Though the painter worked with care, sometimes he blocked in local colour, where he should have left a blank for adding in details of a different colour. These mistakes have become visible because some of the details painted on top are now lost.’ From the report on the Zittau Veil in Villers (ed,) The Fabric of Images, p.104. Three dimensional impressions, details of the original painting now lost? Gives some clues to me when comparing the Veil to a similar linen cloth such as the Shroud. On the ‘large’ quantities of calcium carbonate that STURP found across the surface of the Shroud. Does Colin agree with STURP that they are ‘accumulations of dust’? I favour the remains of gesso as calcium carbonate is used to this day in sealing the outer surface of linen for painting but perhaps Colin has a completely different explanation again. It does seem a lonely life for Colin but at least it is one of his own making!.","date":"2014-12-10","mins":"7:17 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175559","author":"charles_freeman","post":"No, historians are always up for a challenge although we never have the precision in our evidence that scientists often insist on before they make grandiose claims. Inventories show that there were thousands o F painted medieval linens. I quoted from an English study In York that showed many simply within one city. Yet as the author of that report said there is not a single painted medieval cloth extant from the whole of medieval England. Why? It was because the attrition rate was enormously high. As I have repeated on numerous occasions the technique of painting on medieval linen was to seal the outer fibrin of the cloth with a gesso and then apply a primer or paint. As many of these cloths were used as hangings , banners or flags it was vital that they were not starched up but they still had to be sealed so that the pigments did not penetrate through and make it difficult to have a different painting in the other side. A very difficult balancing act and the gesso appliers must have taken years to learn their skill. It was ,of course, vital to have a relatively dense weave, similar to that of the Shroud,or otherwise the surface of the gesso would not hold. The problem was that the pigmented surface fragmented very easily. And so we read of hangings that were guasto, worn out and needed replacing. Most must have simply been thrown away when the images became too faint. If you google , ‘ calcium carbonate gesso’ you will find that calcium carbonate is indicative of gesso. My professor felt that what Adler and Heller found was also indicative of animal proteins such as one might expect from, say, a rabbit skin glue or similar glue. The extent and ‘largeness’ of the carbon carbonate is described in the STURP physics and chemistry paper but I am not near my office to check it. (Hugh usually has such facts at his finger tips!) So you have good evidence for the base. You then need to move on to the many depictions and descriptions of the Shroud as it was from the fifteenth century onwards with. A very rich collection of depictions exist from between 1578 and 1703 when for reasons that are not clear, expositions began to fall off. We really do need a full data base of these so that there can be intensive scholarship applied to them. It may well be that the images became fainter so that the crowds of 70,000 that are recorded at some expositions could no longer see them and so there was not so much point in having an annual exposition. Today the images can not be seen close up and the Shroud had to be framed to prevent further damage to its surface. There is a remarkably high coincidence among different artists over 150 years that show features that have now disappeared, thumbs, long hair at the back, a Crown of Thorns in place ( and this is confirmed by observers who also described it). It is hard to know how these could not have been painted. It is not part of my argument that there has to be remaining pigment any more than the very shadowy formerly painted images on the Zittau Veil have any remaining pigments. I expect that once a pigmented surface began to disintegrate it fell off pretty quickly. Yet both Mc Crone and STURP found some pigments, Mc Crone thought that they were part of the original painting, STURP had the idea ,that I must admit I find unlikely, that somehow pigments fell into the cloth when other paintings were being applied to it but somehow did not fall off again when the shroud was displayed. We know that medieval painted linens, if extraordinarily rare today, were very common in medieval times. So that when one finds shadowy images like that on the Shroud and compares them to the. Images of the Zittau Veil that we know for certain were painted, as many of the painted panels survive alongside those that have lost their pigments, then we have a plausible reason for believing that the Shroud was originally painted. I remain totally unconvinced by alternative explanations for the images. They seem wildly speculative. I am conservative by nature and prefer to work within the context of image making in linen that was the most widely used. Why abandon it if no coherent alternative can me suggested. (I will leave those who still want to argue about how the images were created if not through an original painting to get on with their speculations.) So the challenge is on to refute me!.","date":"2014-12-10","mins":"11:59 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175719","author":"charles_freeman","post":"Calcium carbonate is, of courses, natural but when you find it spread across the surface of a piece of cloth, the context is most likely one where it was used to seal the cloth I leave it to you to suggest alternative explanations. If Hugh has a copy of the physics and chemistry of the Shroud report to hand I am sure he can elaborate on the STURP findings. I am away from my big pile of printed out Shroud articles Rabbit skin glue was the most common ‘glue’ to mix with the calcium. As people are still using it with calcium carbonate to seal linen before painting in it, I guess the smell cannot be too bad. But try googling ‘ rabbit skin glue’. There have apparently been some experiments with painting on linen and then folding and unfolding the cloth to see how long the pigments survive. It will be interesting to see whether the pigments simply fragments or whether the surface cracks but I haven’t a reference to the experiments..","date":"2014-12-11","mins":"11:39 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175690","author":"charles_freeman","post":"Their numbers are 7027 1860 and 8615 1863. As they are stored away and not on display you have to make a special application to see them. Although my wife once worked in the V and A textile department ,I have not got round to it as I would need to take an expert with me to get most out of a visit..","date":"2014-12-11","mins":"7:20 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175744","author":"charles_freeman","post":"Colin, you chump, most of it has fallen off as the pigments have.The question is why was it there in the first place!.","date":"2014-12-11","mins":"3:17 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175748","author":"charles_freeman","post":"The blood, probably vermilion as this was the normal pigment for blood used by medieval linen painters, is the only paint known to have penetrated through the cloth of the Shroud,cf the penetration of red madder on the Zittau Veil. Obviously anything that penetrated through the outer fibrils, presumably because it was in a very fluid form, is going to leave more traces when compared to the pigments that did not penetrate the gesso and so remained vulnerable on the very surface..","date":"2014-12-11","mins":"3:36 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175746","author":"charles_freeman","post":"STURP called these ‘ large quantities, probably natural calcium carbonate’ and it. Is also important that they were found to be uniformly distributed. They certainly needed to give a better explanation of the uniform distribution than merely ‘ dust accumulations’. Anyone prepared to have a better explanation?.","date":"2014-12-11","mins":"3:31 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175752","author":"charles_freeman","post":"Well, we would need to ask the conservators of the Zittau Veil that has similar ghostlike images after the pigments came off in this case because of steam. Remember we are talking about paint in place for several hundred years the Zittau Veil was intact for almost five hundred years and there is some indication from a depiction of the Shroud in 1868 that one of the images had deteriorated very badly by then.( See illustration in Beldon Scott – and I can’t take any Shroud researcher very seriously if they don’t have a copy). So you have light shining on the images over hundreds of years and then the pigments fall off. I don’t know but I would assume that the cloth underneath would be discoloured according to the thickness of the pigments that had preserved the cloth from the effects of light. So while some features of the original painting ,especially those that had been painted into to an existing painted surface, might disappear without trace, others ,in particular the outline of the figures would be clearer. But we would need an expert who had worked on the conservation of painted linen to tell us.","date":"2014-12-11","mins":"4:04 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175858","author":"charles_freeman","post":"Different micros copyists with varying levels of expertise have come up with different opinions as to whether there is vermilion on the Shroud. It is only the most likely pigment used for blood but red madder may be an alternative. We desperately need 2014 2015 microscopy and the help of an expert on medieval pigments a very complex area as I have already suggested as the ‘mix’ depended where you got your minerals from.e.g calcium carbonate was used in gesso north of the Alps, calcium sulphate in gesso south of the Alps. So far as I know no independent authority on pigment S has yet considered the minerals found by the range of microscopists who have researched the possible pigments still extant on the Shroud. It is the lack of alternative solutions that seems to be the big problem. Most of these seem wildly more flakey than a simple case of a decayed medieval painting, something that, in comparison to the alternative solutions, is well documented as existing. Most decayed linens were thrown away when the images faded ( note the very small second hand value of painted linens in the York study) but the Shroud was preserved and we should treasure it for that reason( as well as,in my opinion, its original function as an object of veneration in the Quem Queritis ceremony)..","date":"2014-12-12","mins":"3:57 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175851","author":"charles_freeman","post":"‘Eastlake noted that tempera and watercolour paintings on linen were common in England and Germany in the 14th century. (CF. I am not sure why they didn’t use someone more recent than Eastlake!). Unfortunately(!!!) ,we have not examined any of these and have no basis for comparison with the Shroud image.’ STURP. Report, p30 1 PDF version. They didn’t even ask anyone who was expert In medieval linen painting ( and it is clear from reading the early part of the report that the Idea that this might be the remnants of earlier images did not even occur to them!!). When you know what the most common form of making images on medieval linen is and you don’t even examine similar cases for comparison, this is clearly a limited report. Admittedly we did not have the Zittau Veil conserved until the mid 1990s so a painted linen with many of its panels decayed was not there for comparison but you would have thought they would have made SOME effort. If you research medieval pigments you will find that there were many used with different make ups according to where the minerals or plants were gathered. Where STURP went wrong was not even to make the effort to talk to someone who knew about the variety of pigments used. Actually what is most interesting about the STURP report is how they only consulted within their own group as if they had a monopoly of expertise in iconography ( those all over scourge marks not related to their first appearance in iconography until after 1300, something that they would have been told if they had consulted any art historian specialising in Passion iconography ), weaving (the width of the Shroud is typical of a medieval treadle loom, cf the sections of the Zittau Veil), and painted linens. In fact,they chose to disregard examining all the areas that suggest that the Shroud is medieval. Perhaps this is just the narrowness of specialisms but you would have thought they would have asked someone about how the Shroud might have been woven. Knowledge of the fit with a medieval treadle loom,although not absolutely conclusive, might well have saved them the expense of hauling that equipment all the way to Turin in the hope of finding something pre medieval – which,of course, they found no evidence for. So they left us with the Shroud as some kind of mystery when there seem to be perfectly coherent explanations. They ,or those close to STURP, also put forward the idea that the Shroud is either authentic or the work of a forger. Again, with no one on the team knowing anything about medieval relic cults , they failed to realise that many objects acquired spiritual status usually due to associated miracles. If you look at the gospel accounts and the representations of Christ’s burial shroud that worshippers would have seen on the walls of churches, no forger would have tried it on with a large double image cloth. They did get away with the Cadouin Shroud that had no images on it and was similar to the representations of Christ being laid on a single sheet which is why that was the most popular of the burial shroud shrines..","date":"2014-12-12","mins":"3:21 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-211761","author":"charles_freeman","post":"I was given to understand, perhaps wrongly, that the orthochromatic film that Enrie used that accentuated dark and light would have created an artificial three:d effect, not seen , for instance, in the Durante photographs. I leave it to the experts to comment..","date":"2015-10-04","mins":"8:53 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-206744","author":"charles_freeman","post":"I am not saying that the Shroud IS a painting but that it WAS a painting which disintegrated with time as most painted medieval linens did. If you look at the lithograph of 1868 that Beldon Scott reproduces you can see that one figure has lost its paint from the shoulders down while the rest is still intact. By 1898 the disintegration of the painted images seems to have been complete. Mc Crone found some remnants of the pigments, STURP found the remans of the calcium carbonate that made up the gesso, so far so good, but things may have deteriorated still further since then and even a modern scanner, miles ahead of anything in 1978, ,might not be able to pick anything up. I hope we see one day. If you follow Cennini’s instructions on how to apply gesso to the outer fibrils of a linen and then paint on top when it is dry, you don’t have to use laser beams because you only have to wait five hundred years and the linen under the gesso and paint will become discoloured – as it is discoloured through the gesso and paint ,it will vary according to the thickness of the original pigment and will only be on the very top of the underlying cloth as found by STURP and the 1976 Commission. The central panels of the Zittau Lenten Veil show very similar images to those on the Shroud. Here the pigments were steamed off in the Second World War. The two figures on the Shroud are not of the same body the arms at the back could not possibly be the same arms of the front as you would have to hunch up the shoulders at the back ( which they are not) to cross the arms at the front. The artist must have believed that there was a sacred element to the Image of Edessa/ Veil of Veronica face off Christ as he reproduced it on the Shroud without adapting the hair to show it falling down. So you have the odd effect of the head of a man standing attached to the figure of Christ lying down..","date":"2015-07-28","mins":"6:13 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","title":"1999 Interview with Isabel Piczek"},{"id":"comment-206146","author":"charles_freeman","post":"Hear, hear. Exactly what one of the people who knew Mc Crone well wrote to me after my HT article came out. Although he was often his own worst enemy , people who knew his work were outraged by the cavalier way in which he was treated..","date":"2015-07-19","mins":"8:01 am","url":"https://shroudstory.com/2015/07/16/a-reason-to-doubt-the-image-was-formed-by-radiation/","cat":"image_theory","title":"A Reason to Doubt the Image Was Formed By Radiation"},{"id":"comment-171586","author":"charles_freeman","post":"The most profound revolution In iconography in the later thirteenth / early fourteenth century was t He emergence of blood cults relating to the scourging and crucifixion. So it is not just the Crown of Thorns in place, but blood flowing down the hair, along the arms, and from the wounds and the scourging marks covering the whole body. All this has, of course, been well covered by scholars, Caroline Walker Bynum in her Wonderful Blood, James Marrow in his works on Passion iconography( where he dates the emergence of all over scourging to 1300) and Jeffrey Hamburger who is particularly interested in the emergence of these aspects in Southern Germany. The iconography of the Shroud, the all over scourging, the pattern of the blood flows, fits well into this change and so one can argue for the creation of the images on the Shroud then. The alternative is to say that the Shroud inspired this dramatic change. The change does seem to have originated in Southern Germany, and apparently under Dominican influence, so the Shroud would have had to have been there 1290 1300 and associated with the Dominicans. There is just not a shred of evidence for this..","date":"2014-11-16","mins":"12:19 pm","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-171681","author":"charles_freeman","post":"I am compiling depictions of the expositions of the Shroud, 1580 1750. One on its own is not relevant the question is whether one can see features recorded by different artists at different times, that correlate to each other. So if an artist in 1578 shows thumbs on the hands and an artist in 1680 shows thumbs at the same angle, it is possible but certainly not conclusive that there were originally thumbs on the hands. This is tricky territory which is why we need a data base of all the depictions of the Shroud (there seem to be at least fifty independent ones – see Beldon Scott for some of them), release it to the wider academic world and let the discussion begin. It may be that after lots of scholars have looked at it, they decide there is not enough to suggest that there are features that are no longer there. But it is like visiting a doctor feeling run down. He still orders the blood test even if turns out to show nothing wrong. A data base of all the expositions is just one of the things that needs to be done if we are to build up a comprehensive survey of the Shroud. As a historian it is one of the first things I would have done, with the very first assessing the looms that might have woven the Shroud. Sue Benford describes her interests on the site she set up with Joe which i accessed simply under ‘Benford Pyramids’..","date":"2014-11-17","mins":"4:53 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-171663","author":"charles_freeman","post":"Thomas. Perhaps you should start by reading the three specialists that I have quoted, Walker Bynum, Marrow and Hamburger, before you put forward your own theories.They deal with the issues in detail after many years working with the evidence. Marrow, in particular, shows how the changes relate to the new emphasis on Old Testament texts.Then if you disagree with these authorities you can,of course, explain why. It is always good to start with the authorities, in particular as this field has been extensively worked on. I remain amazed that Colin seems to be going his own way without having started by consulting the many specialists working on medieval painting. He may end up rejecting their work but he should at least know about it before he goes public. Art historians today have to know a great deal of chemistry as much depend on the analysis of pigments, so he will be able to find people he can talk to. He needs to search out other faded cloths for comparison with the Shroud – I know of two, mentioned in my article, and there must be many more not on display anywhere so perhaps a conservation lab dealing with medieval textiles might be the place to start. Certainly I am hoping that my article helps find some to compare with the Shroud – sadly most have decayed. But perhaps the lure of going it alone is too strong for Colin.. I doubt, however, even if he finds a new way of making images of which the Shroud is the only example, it is going to revolutionise science in the way he suggests..","date":"2014-11-17","mins":"2:48 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-171675","author":"charles_freeman","post":"Of course you are free to put forward your own theories, Thomas. And we all know cases where people, whether academics or not, stick to their theories even if there is no evidence to support them. You still need to read as widely as possible among the specialists who have devoted their lives to the subjects and often disagree with each other. I wish I had more time to do that myself! But with four trips to the Mediterranean in six weeks, the Shroud is only a small part of my work! A major problem is the lack of comparative studies. Is Colin going to look at the faded Zittau Lenten Veil in the church museum at Zittau in Saxony? This is a painted linen from 1472, much larger than the Shroud (8.2 metres by 6.80 metres), with 90 separate paintings on the linen. It had survived relatively intact until the Second World War when it was looted by some Russian soldiers who used it to cover a steam bath. This alone caused the pigments to fall off in some areas and it was then left in the damp so parts were very faded. It is not only important in itself but it has received a full restoration programme and the contrast between those areas that remain faded and those that are relatively intact is easy to see. There is a full report in Caroline Villers, The Fabric of Images (London 200). Villers has a mass of material for those interested in how medieval linens were painted.. Then there is the Adoration of the Magi, no 35, in Diane Wolfthal’s The Beginnings of Netherlandish Canvas Painting , Cambridge UP 1989 now in the Museum of Prints and drawings in Berlin. Here the images seem to have suffered from abrasion but much of the original remains intact, allowing one to see how a particular painted linen might have decayed. Even with their faded areas, these are still intact enough to be displayed there must be lots of other examples that are hidden away in storerooms. I am not going to take Colin seriously unless he he can show that he has made a sustained effort to look at other faded linens from the Middle Ages before embarking on a theory of his own. He needs to show how the Shroud is different from these but you can’t do that until you have looked at the others! Similarly ,we need to make a data base of all the known depictions and copies of the Shroud so that scholars and others can independently make their own assessments of their relevance and accuracy by comparing them against each other. I have already put out the call to one professor of art history to see whether we can find a student wanting an interesting subject for ,say, a master’s Dissertation..","date":"2014-11-17","mins":"4:18 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-171561","author":"charles_freeman","post":"Wow, this is a man on a mission! My boring idea that this is a medieval painting whose gesso and pigments have fragmented ( this kind of medieval paint does not flake) over the centuries and rough treatment of the expositions is certainly not going to get me any plaudits from art historians who say why should I claim credit for something that is obvious ( well to eyes trained in such things at least). We look forward to the peer reviewed publication in a major academic journal that will set Colin on the path to fame, fortune and even perhaps the Nobel prize for Chemistry, a system of making images on linen that not a single one of the thousands of art historians working with medieval images has ever seen or even guessed at! Better than landing something on a moving comet any day..","date":"2014-11-16","mins":"8:01 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172184","author":"charles_freeman","post":"You do not have to look at earlier depictions of the Shroud to know that the scourge marks cover the whole body back and front they can still be seen. There does not appear to be any other example in western art before 1300, probably starting in Northern Europe. Either the Shroud inspired this change among all the artists even though there is no documentary evidence to support this (and why would this inspiration take place just about 1300 ? ) or the artist of the Shroud was copying what other artists were doing. James Marrow thinks the change was inspired by Isaiah 1.6 which theologians thought referred to the flagellation of Christ. I have a illustration for a forthcoming lecture that shows how the squiggles of the blood on the Holkham Bible ( London, c. 1330) are very similar to the squiggles of blood on the head of the man on the Shroud. I have a ‘slide’ that puts them next to each other to make the point and that is before we move on to compare the blood on the arms with similar flows of blood on fourteenth century crucifixions and Pietas. I.","date":"2014-11-20","mins":"3:59 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172509","author":"charles_freeman","post":"‘But it seems that most art historians.are simply learned to assign artworks to a few standard drawers, and they lack imagination or the ability to think outside the scheme.’ O.K. Please tell me how you have learned this? It is not my impression of the world of art history.Perhaps before you make this kind of statement could can read Caroline Villers (ed.), The Fabric of Images, European Paintings on Textile Supports in the Fourteenth and Fifteenth Centuries, as this has a great deal of information about painted linens. It is wrong to say art historians have nothing to say about the Shroud or that it could not be a painting until you have read something about paintings on linen. On page 104 there is a panel from the Zittau Veil which shows two faded figures. I showed it to my audience last night to show them that the Shroud is not the only piece of linen with mysterious figures on it! Until then many of them thought there was something unique about the Shroud. And you will know that STURP actually said that they had not examined any painted linens so how could they say that the Shroud was not painted!! So please do some basic homework and learn a little about the way art historians work before you are so dogmatic..","date":"2014-11-22","mins":"7:45 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172776","author":"charles_freeman","post":"What excites me about the Shroud is that it does seem to be the only survivor of the grave cloths used for the Quem Queritis ceremony. We know that there were once hundreds according to Karl Young who wrote the definitive book on the ceremonies in the 1930s,there are at least 400 accounts of these ceremonies still surviving in monastic records and there was a variety of cloths brought out to display to the congregation, some of them single cloths such as the Shroud. Increasingly my own view is that artists had a template they copied, suggesting that this was the cloth in which the body of Christ had lain and so placing the wound on the side on the left rather than the conventional right. It can be seen in the same place on the Besancon Shroud. I know that specialists in medieval drama ( Cambridge academics no less) are interested in my approach as it gives the Shroud a great deal of importance as a lone survivor. It also confirms that the Shroud was originally created as an object o veneration as this was more than a stage prop but a ceremonial cloth that was displayed to the congregation and then taken in solemn procession to be laid on the high altar. It may well have become associated with miracles and then Jeanne de Charny , who may have been in a state of high anxiety in the 1350s from the devastation of the Black Death and the absence on her husband in war – he died,of course in 1356 – began passing it off as authentic, perhaps because she herself had had a miraculous vision or whatever. There is no record of this but there are similar instances of this happening to other objects of veneration that became associated with the miraculous. We cannot rule that out at this very troubled time for her when we have so many other examples. But I think the Shroud is important for the reasons I have given..","date":"2014-11-24","mins":"3:43 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172247","author":"charles_freeman","post":"The dramatic change in iconography from about 1300 probably had several deep rooted causes, not least a more profound emphasis on the suffering of Christ as shown by illustrating the flow of his blood and the persistence of the Crown of Thorns on his head even when he was being buried. The pattern of its spread was partly inspired by the growth of the preaching orders , the Dominicans and Franciscans, who set up their bases all over. It is a vastly complicated process but the art shows it very graphically. No relationship has even been shown between the Shroud and any order and so it is hard to see how any change inspired by the Shroud would have spread around. These monastic networks were very important in spreading religious culture. From the 1350s, the veil of Veronica was frequently reproduced in paintings but it is usually shown as if it were itself a vivid painting – certainly not as a cloth whose images were made of sweat..","date":"2014-11-20","mins":"12:53 pm","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-171568","author":"charles_freeman","post":"No. O.K., certainly not any hypothesis contained in my History Today article. Any hypothesis that goes out to the academic community needs to wait at least a year before one can begin to assess whether it has academic support or not so we are in very early days it takes easily a year or more before academic journals will publish their responses. Obviously I am interested in the comments of specialists who are looking objectively at the Shroud as an artefact, not from those who appear to have made up their minds already as their views may be prejudiced. This means attracting the attention of people who may know nothing about the Shroud but a lot about ancient weaving or painting on linen. This is my main aim over the coming months. I am not sure what you means by ‘errors in weak sides’ anyway..","date":"2014-11-16","mins":"8:54 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172913","author":"charles_freeman","post":"A good comparison is with ancient bronzes almost every one has vanished over the centuries, but like painted linens, we know, from accounts,etc, there were once hundreds of thousands. We are just lucky in what has survived. When we find a bronze ( most are dredged up from shipwrecks),we usually treat it as unique only because we have usually lost any comparative examples. We also have marble copies of some but as marble is less tensile than bronze many of them have to have additions or adaptions to make them stand up without cracking so actually they are not exact copies of the original! If the Shroud had been in an English church it would have been burned at the Reformation. If it had been in what was Catholic Europe,most linens must have been thrown away as their images decayed.Because the Shroud has survived we must not think that artistically it is out of the ordinary any more than the chance find of a bronze statue suggests that that statue is like no other bronze statue that had ever been made. Think big!.","date":"2014-11-25","mins":"6:05 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-171569","author":"charles_freeman","post":"I disagree, John. The iconography of the Shroud, with its all over scourge marks and patterns of blood flows on the arms and head is very similar to other fourteenth century crucifixions and entombments. (I assume that you have read my article for preliminary findings on this.) This is the world of art history. I am assembling a chronological sequence of art that shows how iconography similar to that of the Shroud starts appearing in western art about 1300. I think we should leave it to the art historians who assess my hypothesis whether it relates to art history or not. I am in no rush. If you want to concentrate on the realm of physics there is no one stopping you, but please don’t try and stop other people doing their own research on the Shroud from a different perspective from your own...","date":"2014-11-16","mins":"9:01 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-206539","author":"charles_freeman","post":"If Colin expects people to spend their days reading his lengthy comments, he need to make them digestible. I have given up even trying to plough my way through them! He seems to think that we have a duty to read them even though it is impossible to keep up with where he is at. But I do think h e needs to do so e more work on how shrines worked or failed to work before he tells us exactly what was going on at Lirey! It seems very typical of me of the shrines in the years after the Black Death that spring up and attracted amass of pilgrims before the church moved in to close them down. This has nothing to do with whether the Shroud is authentic or not..","date":"2015-07-25","mins":"2:57 pm","url":"https://shroudstory.com/2015/07/25/colin-berry-on-rogers-groupies-me-and-trolls/","cat":"image_theory","title":"Colin Berry on Rogers, Groupies, Me and Trolls"},{"id":"comment-169863","author":"charles_freeman","post":"I have written about the Veil of Veronica in my Holy Bones. It was a mega cult from the beginning of the thirteenth century – so great the crowds coming to see it that often some were crushed to death. It was in the heart of things ,in St..Peter’s and promoted by the popes especially during Holy Years. Yes, it’s supposed to be sweat but that does not mean it was. As it is no longer extant ( well, some say a faded cloth with just a few marks on it is it – others say it was destroyed in the sack of Rome in 1527) we do not know how the surface was created but the many copies, very common after 1350, suggest that in its heyday it was very vivid indeed – cf the descriptions of the Shroud. Contrast this with the cult of the Shroud initiated it seems by a wife of a knight in small chapel in an out of the way village in Northern France. Like many cults in the traumatic years just after the Black Death, it catches on for a brief period in the 1350s but by the 1390s thev Shroud has been transformed by Clement VII into an object deserving of sufficient veneration to earn an indulgence but clearly proclaimed not to be authentic. There is absolutely no evidence that it was a major cult before the Savoys took it on. It was for this reason it did not qualify for discussion in my Holy Bones. The shroud is promoted as a burial cloth, not a veil. The predominant impact recorded is blood not sweat dead bodies don’ sweat well, I suppose they don’t bleed either but perhaps there was never any real blood or sweat either…..","date":"2014-11-08","mins":"10:15 am","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-169881","author":"charles_freeman","post":"John Green. I have a problem in finding any sort of evidence scientific or otherwise to date the Shroud to before AD 33. Colin – what is the problem in creating as negative image? The artis T of the Shroud as well as the Besancon shroud, was commissioned to imagine an image that a dead body might have left. The conventional iconography of t He side wound is on the right side of the body, so he produced it on t He left. Not difficult. For a more sophisticated negative image look at the mirror on the famous Arnolfini portrait by Van Eyck in the National Galley, London ( 1434). There are other cases of mirror images but this is the best..","date":"2014-11-08","mins":"11:34 am","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-169909","author":"charles_freeman","post":"Well, if the Shroud was created to appeal enormously to the medieval mindset ,then it failed to do so. We have virtually no evidence that. It attracted any body much after a brief flurry in the 1350s. There is the description of the early fifteenth century which refers to it as no more than a representation and if the Savoys had not picked it up, then it would have vanished like most of the other so called burial shrouds. I still cannot see why you think the Shroud is outside the ordinary as a physical object other than that it was kept rather than being thrown away as we know most linens were after their colours had faded. Still please go on with your researches. You are certainly not into Occam Razor country! Obviously many medieval and sixteenth century observers did believe that the blood was iconic – de Beatis and the Clare nuns for a start! I am going to end the debate and let you get on with your researches. I think that you have been misled by STURP into thinking that this is an object that is in some way outside the normal physical world of medieval artefacts. One of my main aims in my other postings on other sites is to argue that there is absolutely no reason to believe that the Shroud is any more mysterious as an object that any other from this period. It has things we don’t understand about it, but we also don’t understand how medieval craftsmen created the Sutton Hoo purse with its tiny garnets and there are lots of other medieval skills we are not able to replicate. This does not make any of these objects ‘mysterious’. Good luck with the experiments!.","date":"2014-11-08","mins":"3:36 pm","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-169910","author":"charles_freeman","post":"Louis’ point about the herringbone weave. Not just herringbone weave but three in one herringbone weave! My weaving expert gave me all the references to these and the Palmyra one is perhaps the finest, although much decayed, of about twelve whose fragments exist. Did Wilson stress that these were up market silk damasks, not linen weaves? Clearly with none of them dated to before AD 250 not really relevant and far too grand to compare with the Shroud anyway..","date":"2014-11-08","mins":"3:42 pm","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-169931","author":"charles_freeman","post":"Colin. Imagine a situation,horribly close to us with the Ebola outbreak, where through an enormous area half the population has died. The survivors are deeply traumatised ,their lives disrupted. This was Europe in the 1350s and all kinds of relic cults sprung up, flourished briefly and then faded. The Shroud was just one of these and there was nothing particularly different about it so far as we know. What was believed by some, and we really have no idea exactly who, as the actual burial cloth of Christ one of many on offer, of course, in the traumat Ised 1350s had settled by the 1390s into something very different , a cult of an object of veneration given Church approval,alongside many thousands of similar objects. But this time it was firmly declared not to be the real thing.. There is really very little evidence that the Shroud was considered important in the next fifty years by anyone other than Margaret de Charny – she tr Ied to display it but it was declared inauthentic, e.g. In 1449 when she tried to exhibit it. It is the canny Savoys who start making something of it and, as I believe, the images were still striking, they were able to display it in enormous arenas such as the Piazza Castello in Turin.from 1578. Of course ,with crowds of 40,000 packed into the Piazza, no one would have been able to see it close up but if the images were as strong as I think they were they were this hardly mattered, All this is indicative of a relic cult that appeared like so many others in the traumatised 1350s, was transformed into something else in 1390, looked like vanishing from view by the 1450s and then struck lucky when a royal family, not the Church, promoted it in support of their own dynasty. There is absolutely nothing here to suggest that there was anything strange physically about the Shroud’s images – or certainly no evidence that they attracted special attention EXCEPT the blood stains that are remarked on again and again. I really don’t see where you are coming from, Colin, and where you get this idea from that the images in their original state were In some way different from any of the other thousands of images from this period and furthermore were unlike ot Her images in being immune to chemical change. However, I shall leave you to get on with the lab work but I think we all have the right to see that you have peers in your support publication in a respected journal perhaps?.","date":"2014-11-08","mins":"4:59 pm","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-170024","author":"charles_freeman","post":"No, I publish long books for university presses that have to go through rigorous academic checking before being accepted as a proposal and then are subject to anonymous reviewing before the press will accept them. Been through that with two of the world’ s top presses, Yale and Oxford and if you go to the Yale US website and look up my Holy Bones you will see the reviews of my relics book. Cennino Cennini , a fifteenth century craftsman, wrote a manual on how to paint. The section on linen says you apply a gesso with a knife on the outer fibrils of the cloth only. He recommended calcium sulphate as the binder with , usually, rabbit skin glue. North of the Alps analysis shows that they used calcium carbonate. So no brush marks because a brush would not have been able to wipe off excess. The aim, and it must have been a very skilful process, one which like many other medieval processes no one would probably have the patience to master today, was to create things like painted flags that would flutter in the breeze. There is a wide range of original sources on medieval paintings and pigments ,etc, and surely you should master those for details of all these techniques before you set out to create one of your own. Then there are all the modern works on medieval painting. It is a large area. Even though it comes a lot into my professional life, I still have to ask for help on many issues. So when STURP found that the images was only on the surface of the fibrils and then large quantities of calcium carbonate, this is what one might have expected. When I submitted all the Heller and Adler articles to a professor of physiology, he suggested that while he was totally unconvinced that there was human blood on the Shroud, Heller and Adler may have been finding the remnants of the animal glue. I don’ think he thought the quality of the papers was really up to much anyway, let alone proof of blood. So where are you on this , Colin? Were STURP right or wrong? I believe that tied to the other evidence this comes together to suggest a fairly standard painted linen. With sources from 1449, 1474,1503, 1517 and 1534 all remarking on the predominance of the bloodstains, that is enough for me to accept that they were there! I am working within the mainstream, not Shroudies mainstream, but academic mainstream in setting out my hypotheses. No one who has read my articles thinks I am saying anything more than placing the Shroud within an acceptable medieval context. You are the one who seems to be setting out on y our own and so are in far more need to peers accepting your work than I am. Good luck if you find a technique that generations of art historians have never been aware of the possibility of fame in the art history world is within your grasp!.","date":"2014-11-09","mins":"2:15 am","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-169860","author":"charles_freeman","post":"There is no such thing as a three x One loom, there are only looms that.are capable of weaving a three to one, among many other weaves, of course. According to an expert weaver who recreates ancient textiles, the only example of three to one she knows from the ancient world are som extra high quality silk damasks dating from the third century, an age when opulence among the Roman aristocracy was at its height. We have a reference in 301 to a loom that appears to have been of great sophistication that may be related to this weaving. With a treadle loom, known in Europe since c 1000, things are very different. Because the weaver works with hands and feet simultaneously, it weaves at three times the speed leading to these looms taking over quickly. However, it only has one weaver and the width of his arms limited the width of the weave to less than 130 cms. However,he has the advantage of length as this loom allows the finished weave to be wound around rods. The next advantage, says my expert, is that the treadles can be manipulated to create more difficult patterns more quickly and so she has confirmed that a three in one could be produced on a standard treadle loom, thus by, passing the highly sophisticated loom needed in the third century. So this is what the expert opinion on the subject seems to be. As my article noted the only surviving three in one linen herringbone known is in the Victoria and Albert Museum in London and dated through the printed images on it to the fourteenth century..","date":"2014-11-08","mins":"9:48 am","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-170031","author":"charles_freeman","post":"But why choose to test your ideas out here, Colin? Why not test them out on scientists and art historians? Thins is a website whose predominant orientation is towards authenticity. In so far as Dan takes the imitative to write postings on my articles I will try and respond but I would not for a moment ‘try out’ my ideas here because ,with all respect, there are few specialists here in the specific areas I am interested in. Who is the expert on ancient and medieval weaving here? If you are nice to academics, they will usually be prepared to help you, so it is a question of searching out the expert in the field you are exploring and testing out your ideas on them. O It took me a long time with many going and froings of ideas with all kinds of specialists, from physiologists to weaving experts, before I went public with my article so I am with you there but from the e mails and responses I have received, it does seem to have paid off..","date":"2014-11-09","mins":"3:02 am","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-169884","author":"charles_freeman","post":"No, I am not, well certainly not if the Ian Wilson scenario is the one. He simply says we don’t know where the Shroud went to, so we must look for somewhere secretive, so, hey, bring on the Knights Templar, the solution to all mysteries, Then there is the Barbara Frale f Iasco. T here is absolutely no evidence to link the do Uble image of the Shroud with the Templars and I can’t see the point of discussing evidence that does not exist. If you can provide clear evidence of the Shroud, with supporting evidence that this is THE Shroud and not just another cloth with an image ( of which inventories show there were many thousands), then I might look at it but I want a serious level of evidence first I have wasted too much time following up leads that lead nowhere..","date":"2014-11-08","mins":"11:41 am","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-170050","author":"charles_freeman","post":"I have no,idea but there is no reason at all in an age when there were thousands of linens and other textiles with painted images on them to think it was the Shroud..","date":"2014-11-09","mins":"5:09 am","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-170052","author":"charles_freeman","post":"Do we have any evidence that Jeanne de Charny/Vergy in a remote village in Northern France would have had any idea about the Veil far away in Rome at a time of devastation in Europe? The shroud was a blood relic not a sweat relic. Once Colin can find some wider support, we can assess whether there is any mileage at all in his theory..","date":"2014-11-09","mins":"5:16 am","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-170054","author":"charles_freeman","post":"The key to having a successful shrine was to be on a major pilgrim route. Lirey was not. If Chevalier had not done his research, we would not have heard of the cult at all. So I cannot understand why Jeanne would ever have tried something so unusual and unlikely to catch on as it did not when we see how quickly and successfully the Church re orientated the Shroud away from any claim of authenticity..","date":"2014-11-09","mins":"5:22 am","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-170180","author":"charles_freeman","post":"When we have many descriptions of the Quem Queritis ceremony in which two priests hold up a grave cloth in extenso before an empty tomb, then the Lirey badge is spot on. We don’t know where and how long the Shroud had been used in this capacity before the 1350s but with no record of the iconography of an overall flagellation before 1300, it cannot have been that long. We also have no clear idea why Jeanne de Vergy/ Charny decided to have a go at transforming a ceremonial cloth into a relic. We know she failed and it needed a duke with a large arena to show it off to get a following for the Shroud. Of course, the Church was always suspicious of the Savoy coup which is why the Church has been careful never to declare authenticity. Here they have shown good sense. After all the Turin authorities have never repudiated the 1988 radio carbon dating that they initiated and supervised. I am with the Church on this one which makes me rather surprised when I read that I am considered anti Catholic!! Still no news on anyone able to date the Shroud to before AD 33 so no problem here in continuing to believe that it is medieval..","date":"2014-11-09","mins":"5:26 pm","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-169828","author":"charles_freeman","post":"Surely this is the wrong site for this discussion,Colin, as one would need to pass your theory through conventional scientific channels and then, once you have support from fellow scientists, repost it here so as to add to the discussion. You give e impression, perhaps wrongly, that you are a one man band on this. How many of us on this site are able to make any kind of evaluation of your hypothesis ( I still cannot understand why a medieval artisan would ever want to conccot an image this way – I simply cannot imagine the scenario in which he says: ‘I won’t do it the normal way but I shall strike out on my own’ using techniques that no one has ever found anywhere else.quite mystifying.) Virtually everything I post has been through some sort of expert opinion even if it is merely to say that there is no reason why my hypothesis should not be correct e.g, I have checked through the medieval treadle loom scenario with an expert weaver who recreates ancient weaves and knows about ancient looms, but has only come across three in one in silk damasks of the third century AD that must have been created in very sophisticated looms. The treadle speeds up the process three fold but also allows the treadles to be manipulated so as to create the three in one without much hassle. Therefore overwhelmingly. The Most likely loom for the Shroud. So I feel I have specialist backing why don’t you get the same from fellow scientists who about these things?.","date":"2014-11-08","mins":"7:26 am","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-170080","author":"charles_freeman","post":"The shroud does not purport to be the burial shroud of Christ unless it is a living entity and can talk. There are some people who believe that it is authentic but so far we have not a single piece of evidence to date. It to before AD 33. In my article I have put the accumulated evidence that it is fourteenth century. And I rest my case on that. Again I have not seen the evidence debunking the radio carbon dating but I do N’t make much of the radio carbon dating as the iconography is much more convincing. Even if it is debunked no alternative date is suggested..","date":"2014-11-09","mins":"7:34 am","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-170091","author":"charles_freeman","post":"Just read my article in full and report back. No need to repeat wh at I have spelt out there..","date":"2014-11-09","mins":"9:24 am","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-170094","author":"charles_freeman","post":"There are two separate issues 1) Providing any form of proof that the Shroud dates before 33 AD. 2) if none is forthcoming, and I have not yet seen any, deciding what other century it was woven and then the images added which may have been at the same time as the weaving or later. The iconography suggests fourteenth century as we have no examples of all over flagellation marks before then. This ties in well with the other evidence that is provided in the article..","date":"2014-11-09","mins":"9:30 am","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-170143","author":"charles_freeman","post":"Sorry ii is charlesfreemanuk.tumblr.com.","date":"2014-11-09","mins":"1:29 pm","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-170141","author":"charles_freeman","post":"John – I note two linens where the paints have faded in my article. Most faded linens would have been destroyed. A post I made a few minutes ago may not have gone through but the references are in the footnotes I originally submitted with my articles but were not used as History Today does not provide footnotes. They are available on charlesfreeman.tumblr.com.","date":"2014-11-09","mins":"1:28 pm","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-191496","author":"charles_freeman","post":"The feedback I am getting is that the reason why, to Colin’s dismay, I am high on the Google lists , is that I offer a coherent explanation for the Shroud, from creation on a treadle loom, to being painted according to medieval treatises, losing its pigments but leaving behind enough to show a typical early fourteenth century iconography and finally an explanation of the original function of the Shroud before Jeanne de Vergy attempted to make an authentic relic of it. People respond to a coherent narrative although this does not mean that my hypothesis is right in every respect. What I suggest is that those who disagree with me construct their own narrative of the creation of the shroud, how the images got onto it, how it survived over two thousand years, and make it convincing and coherent enough as a narrative for a respected journal or newspaper to publish it. Then I am sure people will want to read it and it will move up the Google rankings. Meanwhile I look forward to the new terminology to describe the images on the shroud. Fifty Shades of Fade anyone?.","date":"2015-02-21","mins":"12:58 pm","url":"https://shroudstory.com/2015/02/21/colin-berry-stop-calling-the-faint-image-a-faint-image/","cat":"image_theory","title":"Colin Berry:  Stop Calling the Faint Image a Faint Image"},{"id":"comment-191538","author":"charles_freeman","post":"Nabber, I don’t have to advertise myself if you read Colin’s blog, he did it for me. I obviously have no control over the Google ratings as I understand it, it occurs when large numbers of other websites find your contribution helpful and pass it around..","date":"2015-02-22","mins":"3:04 am","url":"https://shroudstory.com/2015/02/21/colin-berry-stop-calling-the-faint-image-a-faint-image/","cat":"image_theory","title":"Colin Berry:  Stop Calling the Faint Image a Faint Image"},{"id":"comment-191556","author":"charles_freeman","post":"Well you can see from both the Shroud and the shroud of Besancon that those painting the images for the Quem Queritis ceremony deliberately placed the chest wound on the left rather than the conventional ( from Ad 586 if not earlier) right to show that they were creating an imprint of the crucified body. It was clearly the convention to do this and it is a pity that we don’t have more survivals to prove the point. However , all the more reason for treasuring the Shroud as possibly the only survivor of this ceremony. In short the artist or the creator of the template these artists may have copied said’: This is meant to represent the marks that a crucified body might have left so how do we do this?..","date":"2015-02-22","mins":"9:14 am","url":"https://shroudstory.com/2015/02/21/colin-berry-stop-calling-the-faint-image-a-faint-image/","cat":"image_theory","title":"Colin Berry:  Stop Calling the Faint Image a Faint Image"},{"id":"comment-191563","author":"charles_freeman","post":"I can’t see what your point is, Dan. It is not as of fourteenth century artists were not capable of wonderful paintings, far more impressive than the Shroud, But they would need a reason to create a negative image and the Quem Queritis ceremony gave them one. The commission would have been to do a painting that showed the marks of a crucified body as if they had been transferred onto the grave cloth. So this is what we have ( as the wound on the left side shows). We would have to think up another context in which a negative was needed and research from there. Perhaps indeed this (and the Besancon Shroud) is the only one but it would not have been beyond an artist of the day. There remain lots of problems. Why is the head of Christ that of a man standing, for instance (this is echoed by depictions from the past which all show that the hair at the back was also of a man standing)? One suggestion I have had is that the inept nature of the join of the head to the body shows that they used a template for the head and painted the body separately but this must be speculative. I was doing a presentation last week and comparing the pose of the man on the Shroud with other medieval examples and we were looking at a sculpture from an entombment scene where they had carved the hair falling back as one would expect from a lying figure and it was, of course, nothing like the rigid hair of the head of the Man on the Shroud..","date":"2015-02-22","mins":"10:26 am","url":"https://shroudstory.com/2015/02/21/colin-berry-stop-calling-the-faint-image-a-faint-image/","cat":"image_theory","title":"Colin Berry:  Stop Calling the Faint Image a Faint Image"},{"id":"comment-191572","author":"charles_freeman","post":"I am waiting for expert guidance from a textile specialist on this but what we appear to have is the shadows of the original images after the pigments have fallen off. This would explain the limited residue of pigments. There is some evidence to suggest that this happened in the nineteenth century – a depiction of the exposition of 1868 shows the frontal image decayed from the shoulders downwards and this is just the exposition where they framed the Shroud for the first time which suggests that they were worried about its deterioration. By this time the pigments would have been In for place for five hundred years and so the shadows on the cloth underneath would vary according to the thickness of the original paint. So dark colours might leave a lighter shadow underneath and light colours a darker one and this may explain the apparent negative features, which go alongside the left hand wound. Five hundred years is a long time. As I say the only people who can answer this one are people who work with textile conservation especially those who deal with painted linens. I do not know of any such who are contributing to this site so the possibilities of finding a solution here are very limited. In so far as the Shroud is seen as a mystery, it is important to think imaginatively about the possible ways it which it was woven and the images created. One can only put forward hypotheses that are then tested against the knowledge of specialists. Some will be accepted, some shown to be wrong. I stick to my view that until the Vatican allows further testing ,it will be looking for similar features on other artefacts that will help solve the issues, just as the date of the horses of St.Mark’s was solved when other datable examples of gilded bronzes were analysed and they could be shown to be matches..","date":"2015-02-22","mins":"12:45 pm","url":"https://shroudstory.com/2015/02/21/colin-berry-stop-calling-the-faint-image-a-faint-image/","cat":"image_theory","title":"Colin Berry:  Stop Calling the Faint Image a Faint Image"},{"id":"comment-199993","author":"charles_freeman","post":"All this futile argument over washing can be avoided by those who can accept that the scourge marks represent either directly or indirectly Isaiah 1. 6. So nice sometimes to have a simple solution at hand..","date":"2015-05-23","mins":"1:41 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-200027","author":"charles_freeman","post":"Yes, Dave B, the thirteenth and fourteenth theologians who used this text did take it out of context so you need to take this up with them, but this did not stop them using it as a premonition of Christ’s scourging with sufficient success for it to appear in Passion iconography..","date":"2015-05-24","mins":"1:13 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-200058","author":"charles_freeman","post":"Well, I will leave it to expert opinion but a preliminary suggestion would be that some flagellations shows Christ not naked but in a loincloth and the band of blood would gather there and remain there when the loin cloth was taken off. It would seem that the artist would have imagined a band across there against which the blood would have gathered and a loin cloth would be the most obvious solution but we need to look for examples..","date":"2015-05-24","mins":"6:19 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-200050","author":"charles_freeman","post":"Thomas you are quite right the blood flowing along the arms comes in after 1300 and is found across Europe in Italy certainly – good examples in the Gallery in Bologna – in Germany (the Roettgen Pieta), in England, the Holkham Bible of 1330. So you have two options 1) the Shroud was well known across Europe and people copied it. 2) the iconography of blood flowing down Christ’s arms was well known across Europe and the artist of the Shroud copied it. Some more ‘desperate speculation’ needed!.","date":"2015-05-24","mins":"5:04 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-200134","author":"charles_freeman","post":"Well, we just have to disagree on the reality of the human blood. I am an independent scholar, formerly a Senior Examiner of the International Baccalaureate;s critical thinking programme, Theory of Knowledge, and thus used to looking at evidence or asking those who know. I had the Heller/Adler papers read by a professor emeritus of physiology who said that their claims that this was blood were totally unconvincing. I show the bloodstains to any forensic expert i can find and they all say they have never seen dried blood that red. So I am not working on the understanding that this is blood. Why can’t the STURP tests be replicated 37 years on? Have they lost the tapes???.","date":"2015-05-25","mins":"3:31 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-200148","author":"charles_freeman","post":"Patrick no they are graded it was a complicated system and depended on the intellectual quality of the argument in an essay on an issue of knowledge. But it was fun working with some top critical minds from all the different disciplines and taught me how to spot bull****. A great help sometimes!.","date":"2015-05-25","mins":"7:39 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199442","author":"charles_freeman","post":"I assume from all the confidence of these ‘ experts’ that they can provide evidence that a scourging covering both front and back of a body and here with372 marks, which would have made it impossible for any man then to have carried a cross, is documented. In all my studies of the ancient world I have never heard of such a thing. Better to stick with a biblical source,Isaiah 1.6, here and note how these all over scourge marks show the integration of this verse into fourteenth century iconography ,.e.g in the Holkham Bible illustrations and the Rottgen Pieta among many other similar examples. Colin, you are talking real sense – happy to agree with you in this occasion. Whenever I read the accounts of these forensic experts they never seem to address the effects of a scourging such as the one the Shroud shows – 372 marks none of which appear to break the skin. An artist could do it – a scourger ?????.","date":"2015-05-18","mins":"8:19 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199444","author":"charles_freeman","post":"P.S. Barbara Faccini notes three different types of instruments on the Shroud scourge marks in her Ohio presentation. James Marrow in his intensive study of Passion iconography notes that indeed illustrations of the fourteenth century do indeed show three different instruments in these all over scourgings as each one reflects a different OT precedent. Thanks, Barbara Faccini for providing another example to support Marrow’s scholarship!.","date":"2015-05-18","mins":"8:26 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199480","author":"charles_freeman","post":"372 or whatever..Anyone who suffered that number of bloodstains would not have been able to carry a cross. ‘ the author of Isaiah was somehow privy to a special divine revelation…’ Debatable. I am sticking with the fourteenth century on this one..","date":"2015-05-18","mins":"10:40 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199528","author":"charles_freeman","post":"People are still painting on linen after sealing it with gesso. Once you have an outer surface you can paint what you want , even hundreds of marks of bloodstains not a single one of which has a significant blood flow. As always such paintings are very vulnerable to disintegration as they are just on the surface if the cloth so they need to be kept on a flat surface to avoid disintegration. Once the pigments have been on for hundreds of years there is inevitably some discolouration of the linen underneath when they disintegrate, as on the Zittern Veil. The scourge marks on the Shroud cannot possibly come from a person with a beating heart – some of the marks would have cut deeper than others and there would be different levels of mark and bloodstain. On a real body with this scourging there would have been many other welts and bruises that did not break the skin in addition to the 372 or whatever that actually did on the ‘real body’ hypothesis. It does not make any kind of sense that a man could also carry a cross after a technique of intensive front and back flagellation not recorded anywhere in the ancient world. A fourteenth century discoloured linen after the disintegration of the pigments , fitting the iconography of Isaiah 1:6, is by miles the best hypothesis. Sometimes common sense is needed..","date":"2015-05-19","mins":"12:50 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199615","author":"charles_freeman","post":"Dave look at the helpful illustration at the beginning of the Faccini Fanti article. Do you really believe that blood oozing from wounds from a flagellation would have settled in that very precise manner in every case as shown here with the intensity the same on the cloth where the body had lain as on the top which covered the body – so that presumably the blood oozed upwards against gravity? You could not possibly carry out this intensive flagellation, make sure that the skin where it was broken was done so in an even way and that some hours later blood would have been oozing out on both front and back of the body in exactly the same pattern(with the variation for the three instruments that Faccini noticed) from each and every wound. At least one can say that the blood knew where to stop in each and every case. You say these experts have.’ruled in this case’. There is no rule in the world of science( and common sense observation). Thank goodness we don’t have to accept all these so called experts and can make up up our own minds within the sphere of our own specialist interests. I suspect that none of these forensics experts had every studied fourteenth century Passion iconography. Once you see similar patterns of bloodstains on fourteenth century examples, you begin to put together a very different picture. These marks could easily have been achieved, if rather unimaginatively so, by an artist. Much more likely. I am sticking with a fourteenth century creation those who read the (Anglican) Church Times will find my views expressed in more detail in an 1,800 word article in their May 8th edition – it was aimed at their specific ( mainly clergy and conventional Anglican) readership (23,000) and may not travel further. And yes, it was published there on the recommendation of a Professor of Church History at Oxford..","date":"2015-05-20","mins":"1:31 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199754","author":"charles_freeman","post":"Dave, I assume that as a researcher in this area, you have a copy of John Beldon Scott’s Architecture for the Shroud with its wealth of illustrations the essential handbook for all those following the post 1355 history of the Shroud.. So figure 42, p.60, which is a1583 fresco from the Galleria delle Carte Geografiche in the Vatican shows clearly that the images at that date were clear enough to be seen from about two hundred yards away note how the onlookers are gazing at the Shroud from this far away. This fresco is,of course, backed by many other depictions of the Shroud also illustrated in Beldon Scott. If you look at the illustrations of the Holkham Bible of c.1330, or the Roettgen Pieta – but there are many other examples from the fourteenth century you will see how typical the Shroud is of fourteenth century iconography of the day. My argument is that we have a discoloured linen left after the disintegration of the pigments, probably in the nineteenth century. The fundamental mistake made by many researchers is to assume that the images now are as they always have been, without realising that painted linens were inherently fragile and easily disintegrated as the pigments were only on a gesso surface on the outer fibrils of the cloth and did not penetrate it. STURP looked for paint that had probably vanished ( although Mc Crone claims some tiny particles were still there). If only the Vatican will let textile experts in with their modern microscopes, the matter could soon be sorted either way. People can have their lives turned around by works or art or even shadows of what were once works of art.I don’t doubt the sincerity of those who follow you..","date":"2015-05-21","mins":"4:31 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199582","author":"charles_freeman","post":"No, David, the other way around the artist of the Shroud was following the conventional iconography of his day, not only in the scourge marks but in the blood flows along the arms and the squiggles of the bloodstains of the head. These features are too widely spread geographically to have been the result of anyone seeing the Shroud but an artist who had kept up with trends in the representations of the Passion would have included them. The illustration provided by Hugh above makes my earlier point clearly. For a scourge wound from a real body to have left a mark means that blood or other liquid was oozing from it when the body was laid on the Shroud and this oozing was persistent enough to have seeped through the top of the Shroud when it was laid over the body. This is bizarre enough when the flagellation took place some time before the crucifixion and death of Jesus. However, why is it that in every case the blood flows just so far as to leave the impression but no further in every case – to the extent that Faccini was even able to to distinguish three different instruments. This could never have happened in real life after a real flagellation which would have been a much rougher affair. However, for an artist no problem, he can paint whatever he likes and limit the bloodstains to precise areas, especially when he is trying to represent a biblical verse. Have all these forensic experts actually seen bloodstains on a piece of cloth that don’t seep into the capillaries. If it is gessoed in the medieval way, no problem. Also I don’t buy the medieval forger idea. No forger would have hoped to have taken in anyone by a large imaged cloth when none are mentioned in the gospels or represented in the iconography of the deposition. If produced for the Quem Queritis ceremony, however, all that was needed was a symbolic representation of the dead body – the artist did not even try to show the face of Christ as that of a man lying down. So long as the images could be seen in the dim early Easter light, bloodstains and all, the figures larger than life size for the medieval period and doubled up, that was all that was required. He did not even make the two bodies the same size. The scourge marks are,in fact, one of the clearest piece of evidence that the Shroud never covered a real body..","date":"2015-05-19","mins":"4:57 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-197990","author":"charles_freeman","post":"My views is strengthening that the original pigments simply disintegrated over time, leaving discoloured linen behind. I have recently found some evidence that it was because the images were disintegrating and the Shroud could no longer be clearly seen from afar that accounts for the dramatic falling off of the number of expositions after 1700, well over fifty in the seventeenth century, only five in the entire eighteenth century with expositions increasingly confined to Savoy family occasions. My hypothesis can only be proved or disproved by a new surface examination of the Shroud so let’s hope pope Francis authorise one on June 21st!.","date":"2015-04-30","mins":"5:55 am","url":"https://shroudstory.com/2015/04/30/comment-by-hugh-farey-on-aging/","cat":"image_theory","title":"Comment by Hugh Farey on Aging"},{"id":"comment-198023","author":"charles_freeman","post":"No Piero, I do not have to study anything nor am I an expert in paint chemistry. I have been simply pointing out the immense discrepancies between the depictions and descriptions of the Shroud in the sixteenth and seventeenth centuries and the Shroud today and putting forward a possible hypothesis for these discrepancies. I am in the same situation as John Jackson when, having ruled out a reweaving of the Shroud corner through his photographs of the bindings, he put forward the hypothesis that carbon monoxide might have swayed the carbon 14 result. The Oxford lab tested his hypothesis and found that carbon monoxide had no effect on dating. End of hypothesis. Similarly, I am waiting for an expert in textile conservation with experience in painted linens to examine the Shroud close up and see whether my hypothesis has anything going for it. Only the pope can authorise the examination that is needed. I am quite happy to wait in the hope that this will happen. No one else seems to know how the images were made so why not another hypothesis?.","date":"2015-04-30","mins":"10:46 am","url":"https://shroudstory.com/2015/04/30/comment-by-hugh-farey-on-aging/","cat":"image_theory","title":"Comment by Hugh Farey on Aging"},{"id":"comment-201696","author":"charles_freeman","post":"Well, I am only suggesting further research and I think it is clear from what I wrote earlier, that I know in what direction I would like that research to take. The Shroud clearly does not play as much a part in my life as it does for some contributors. If Jesus existed there is always the possibility that something from his life survive, yet it is unlikely because early Christians did not collect relics any more than Protestants do today. I simply don’t see the evidence that takes the Shroud of Turin back into the first century in fact back even beyond AD 1000. I feel that much of the research already done has been inadequate, especially in so far as it assumes that the Shroud now is as it has always been, but with so much new work being done on medieval painted linens something may well come up to help us..","date":"2015-06-12","mins":"6:21 am","url":"https://shroudstory.com/2015/06/11/comment-promoted-charles-freeman-comes-closest/","cat":"image_theory","title":"Comment Promoted:  Charles Freeman Comes Closest"},{"id":"comment-201686","author":"charles_freeman","post":"My argument depends on looking closely at the many depictions and descriptions of the Shroud see especially Beldon Scott and the catalogue of the Savoy collection of images (1998).You can see that the images were much stronger then and had features now lost like the Crown of Thorns and long hair at the back. Many of them have thumbs and these seem to be at the same angle suggesting that they were once there. We need a database of all these images, not only the engravings and frescoes ( e.g. The one in the Vatican of 1583), but also the cloth images so that scholars can study them online as they can now study Shroudscope. I believe hat it was crucial for the display of the Shroud that the images could be seen from afar off and, following some recent research on this it is clear that painted images were often repainted as they disintegrated very quickly. This may explain some of the variations in the position of the legs but until we have experts assessing the database we shall not be able to come to any conclusions on this. The painting on, following the Trent decree,and the subsequent disintegration of, the loincloth does seem to fit the evidence and could explain the lighter patch on the buttocks. The final disintegration of the images and gesso, which were placed just on the very outer surface of a linen cloth, seems to have taken place in the eighteenth and nineteenth centuries the 1868 lithograph that Beldon Scott shows is the first one showing that the Shroud had to be framed and one of the images has deteriorated from the shoulders down. Anyone have access to the cathedral archives? By 1898 the images had virtually disappeared. Whether there are any pigments and gesso left is anyone’s guess after all that has gone on. Things have moved on so much from 1978 that a new examination of the surface of the cloth is urgently needed. The finding of calcium carbonate by STURP is primie facie evidence of an original gesso but as the STURP tests have never been replicated one should not rest too much on this. If the Shroud is not examined again, it is probable that examination of other images on medieval linen cloths which have lost their pigments will back or refute my hypothesis that this is linen discoloured by centuries of being overlaid by gesso and paint, the variations, which give the three d negative effects, reflecting the original thickness of the pigments. So I am keeping my eyes open on the research on painted linens which is now a growing area of interest.i hope something of importance should turn up which will throw light on the Shroud. Blood well, again the tests need replicating but there was so much relic blood around in the fourteenth and fifteenth centuries see Carline Walker Bynum’s book Wonderful Blood – that the incentives for adding it to make money must have been powerful. The redness of the existing stains seems to offer insuperable problems but perhaps someone can come up with a forensic expert who can provide examples. I don’t expect any of these issue to be resolved one way or the other quickly so it is a waiting game. Scientific research is moving on so fast and it is good that painted linens are a focus so one can be optimistic. After all no one was expecting the BM to solve the dating of the Horses of St.Mark’s so conclusively by finding other dated examples of the same techniques of casting and gilding..","date":"2015-06-12","mins":"4:21 am","url":"https://shroudstory.com/2015/06/11/comment-promoted-charles-freeman-comes-closest/","cat":"image_theory","title":"Comment Promoted:  Charles Freeman Comes Closest"},{"id":"comment-201703","author":"charles_freeman","post":"So Daveb – are you for or against research on medieval painted linens? Or is your mind made up for all time I know mine isn’t I am just working on the evidence that we have so far. No problems with relic worship after 320s even if the rights and wrongs were still being debated in the 380s. But three hundred years is a long gap. It would not be easy today to find relics of an event that took place in 1715. Read the opening chapters of my Holy Bones which deals with the issues and debates over relics in detail..","date":"2015-06-12","mins":"7:47 am","url":"https://shroudstory.com/2015/06/11/comment-promoted-charles-freeman-comes-closest/","cat":"image_theory","title":"Comment Promoted:  Charles Freeman Comes Closest"},{"id":"comment-139772","author":"charles_freeman","post":"Why not start with areas of research where little work has been done, e.g. Relating the weave of the Shroud to particular looms and the mass of ancient textiles that are being discovered and reported all the time? One never gets the feeling that these are being monitored by by Shroud researchers who repeat again and again that piece about the stitch found on a woollen cloth from Masada. Sure, herringbone weaves in linen are known from ancient times (as they are from medieval times) ,so why not correlate the evidence and see where it leads?.","date":"2014-07-22","mins":"4:46 am","url":"https://shroudstory.com/2014/07/21/creative-ideas-that-work/","cat":"image_theory","title":"Creative Ideas That Work"},{"id":"comment-139773","author":"charles_freeman","post":"E.g. The Archaeological Textiles Newsletter has lots of articles about recent discoveries in the Near East..","date":"2014-07-22","mins":"4:53 am","url":"https://shroudstory.com/2014/07/21/creative-ideas-that-work/","cat":"image_theory","title":"Creative Ideas That Work"},{"id":"comment-210692","author":"charles_freeman","post":"If you use Beldon Scott’s fine study of the display of the Shroud and supplement it with the many images in the catalogue of the exhibition of Shroud images of the Savoys in Turin 1998, there is no doubt that throughout the seventeenth century the images on the Shroud could be seen at a distance. Painted linens did not just fade.There was a layer of gesso on the surface of the linen and the paint was applied on top of this in the hope that the pigments would remain precise and not dissolve into the cloth. What tended to happen was the the painted surface disintegrated and fragmented with continual folding and refolding. Beldon Scott quotes a 1580 letter from Carlo Borromeo’s architect (Borromeo was pushing for a chapel for the Shroud) that expressed concern that the Shroud should be ‘preserved and displayed without the danger (sic) of folding and unfolding it.’ With lots of new work on painted linens coming out, we now have examples where microscopic analysis shows that the cracks in the paint were often painted over. The discoloration of the present images may be the result of centuries of contact between the painted surface and the linen as buffered through the gesso.This is perhaps why the discoloration does not penetrate below the outside surface of the linen as there is no way that it could in these circumstances. It may also explain the fuzziness at the edges of the images ( such that one cannot even give a precise measurement of the height of the man on the Shroud). This is no more than a hypothesis that needs checking out with a more sophisticated technical examination of the Shroud with modern scanning equipment. Unlikely to happen so it remains no more than a hypothesis. The alternative will be to exploit resent research on painted linens whose images have deteriorated to see whether comparisons can be made with the Shroud images. I leave that to the conservationists but it means getting them interested in the study of the Shroud. At present I am getting sympathetic ‘Yes, this possible’ s but no one prepared to take it on!.","date":"2015-09-19","mins":"5:33 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","title":"Faint Images:  The Case of the Shroud of Arquata"},{"id":"comment-210711","author":"charles_freeman","post":"So the go ahead for any new scientific examination of the Shroud ( which needs to go beyond test results of 35 years ago that have never been replicated) depends on who did or did not attend a conference in Hampshire! What a crazy way of deciding scientific objectives! So long as Colin sticks with flour, I doubt whether he will blow himself up. I prefer to stay with visual evidence that I can at least discuss with art historians and textile conservationists. I am increasingly convinced that comparative examples is the way forward. We must create a new narrative for Shroud research somehow!.","date":"2015-09-19","mins":"10:28 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","title":"Faint Images:  The Case of the Shroud of Arquata"},{"id":"comment-210746","author":"charles_freeman","post":"What makes you think that this was the work of a forger? Most relics were made for some other purpose and then adopted as supposed relics..","date":"2015-09-19","mins":"5:45 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","title":"Faint Images:  The Case of the Shroud of Arquata"},{"id":"comment-210781","author":"charles_freeman","post":"Where you and I differ, Colin, is that I try actively to see advice and support from experts in the field as this is the only way to obtain credibility. So far as I can see you have a personal theory for the images for which there is no evidence and you while away your time with a bowl of flour year after year trying to recreate the images as they are now when the real test is to recreate the images as they were originally. I am quite happy to be taking an alternative path but see no reason why this should involve your personal abuse of myself and others..","date":"2015-09-20","mins":"5:42 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","title":"Faint Images:  The Case of the Shroud of Arquata"},{"id":"comment-210790","author":"charles_freeman","post":"Don’t shout too loud ,Coilin. Some of the people who emply me as a professional historian might hear you and I would lose my income!.","date":"2015-09-20","mins":"8:11 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","title":"Faint Images:  The Case of the Shroud of Arquata"},{"id":"comment-210811","author":"charles_freeman","post":"I do wonder, then, why my History Today article was first checked and passed by an Oxford Professor specialising in the medieval church, then got through the History (sic) Today board and then was welcomed by several professors and others as being a sensible and likely solution to the mystery of the Shroud. However, what do they know compared to a flour expert who can spot bogus history a mile off! In the end what matters is that someone finds a solution to the Shroud that gets widespread academic support. We differ in that I start from building from existing work on painted linens, medieval versus ancient weaves, and Passion iconography so that if I decide to publish I can quote academic support for my views. Your approach is to work away in the flour bowl in your shed and, presumably, hope that fellow scientists will eventually endorse what you have done. Good luck. I have nothing against your approach. We are all after trying to get a plausible solution to an object that is closed off from sophisticated scientific examination. The date and nature of the images could probably be sorted in a couple of hours with state of the art scanning equipment that picks up minute pigments. What I find difficult is your apparent view that the Shroud has remained with any degradation of images or linen so that what we have now is exactly what existed in1350. However, that is better than assuming that what exists now Is exactly what existed in AD 30 which appears to be the STURP approach. I have never seen any STURP paper which says ‘ we must start by working out how the present Shroud might have looked 2,000 years ago’. At least Giulio Fanti accepts that the Shroud has degraded over time although as yet he has not extended this insight to the images themselves. Now I have replied to you without any denigration of yourself or your work. There is no need to do so. Where did your futile, unproductive, and, in my case, laughable, attempt to denigrate anyone who disagrees with you come from? Time for some soul searching perhaps or it may be something they put in in the today’s flour! Among the relics my study group will be visiting in Italy with me next week is the Holy Blood of Christ in Mantua. It has a longer documented history than the Shroud but Christ’s blood was such a money spinner in the fourteenth century there were all kinds of incentives for finding some, perhaps ,though I doubt it in this case, adding some in to the Shroud..","date":"2015-09-20","mins":"3:15 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","title":"Faint Images:  The Case of the Shroud of Arquata"},{"id":"comment-210840","author":"charles_freeman","post":"Quote.’i have nothing against your approach ‘. It may find the solution to the problem, it may not. I happen to think you are starting from false premises. Please prove me wrong. But yet more personal denigration of myself…. If that is your way of living within the academic community so be it..","date":"2015-09-21","mins":"1:14 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","title":"Faint Images:  The Case of the Shroud of Arquata"},{"id":"comment-210860","author":"charles_freeman","post":"Colin,When you have produced a formula that can be replicated by other scientists and which explains both the blood images and the other images ,I am sure you will be taken seriously. But you haven’t got there yet. I am working from an opposite approach – starting with existing research and seeing how it provides comparisons with the Shroud The winner will be any person, perhaps neither of us two,who can achieve a consensus of academic opinion on how the original images can be explained. I think that with the new research on painted linens and the way they disintegrate over time, it will happen naturally within ten years. We will wait and see. No Need to waste your energy on personal attacks before then..","date":"2015-09-21","mins":"7:55 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","title":"Faint Images:  The Case of the Shroud of Arquata"},{"id":"comment-210884","author":"charles_freeman","post":"Surely the problem is,Colin, that no one has noticed your work and you can’t really claim that there are no counterclaims until you have published it. It is not my problem that you have failed to extend your researches into the academic community. I have published in a highly respectable history journal and have a lot of responses I have been able to work from. My guess, and only a guess, is that with the accumulation of recent work on painted linens we will have within the next few years a number of formerly painted images that match the Shroud. I am not a linen conservationist so I won’t get the accolade but I may get a mention as having pointed some of my more academic readers with the relevant specialist skills in weaving, iconography and painting on linens towards taking the Shroud seriously. Of course, your imprint theory does not conflict with the solid evidence that this was a typical product of a medieval treadle loom and that the iconography fits well with the fourteenth century..","date":"2015-09-21","mins":"3:24 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","title":"Faint Images:  The Case of the Shroud of Arquata"},{"id":"comment-210909","author":"charles_freeman","post":"The point actually is that my article was read by a lot of academics and I have good contacts through it on which I have been able to build further research. Once you have published your own work ,I am sure you will get many accolades. I will wait until then. Happy dough kneading!.","date":"2015-09-22","mins":"12:32 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","title":"Faint Images:  The Case of the Shroud of Arquata"},{"id":"comment-210914","author":"charles_freeman","post":"It is only a matter of getting yourself published,Colin, so that your work can be openly evaluated by others. I have never in all my time working on relic cults come across your premise about the making of this kind of fake relic so I am deeply sceptical especially as I have no evidence that you have ever studied relic cults and the way they work. Flour, well super flour! , is your thing, radiation is di Lazzaro’s. Good luck to one and all. There is no one path to the truth as a critic of early Christianity once said. But once again, get yourself published in a respected scholarly journal and you will be open to proper evaluation. Judging from the feedback I get my thesis has widespread approval in the wider academic community, was taken up by the Guardian’s chief art critic, is up near the top of the Google list on the Shroud,etc,etc. And is being widely read. I am just waiting for someone with more specialist expertise than I to take it on..","date":"2015-09-22","mins":"1:27 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","title":"Faint Images:  The Case of the Shroud of Arquata"},{"id":"comment-172535","author":"charles_freeman","post":"From my perspective of the Quem Queritis ceremony it is quite simple. It is Easter morning Christ has risen. Those coming to the tomb ( that has been set up for the purpose) cannot believe this so that the ‘angel’ ( a priest) sitting by the tomb tells them to go in and they will see the grave cloths lying there. The images on the Shroud represent the dead Christ imprinted onto the cloth. But He is not there and they hold up the grave cloth to show that he has risen just leaving the impression of where his body had been. The Lirey Pilgrim Badge shows two priests holding up the Shroud before an empty tomb just as the ritual demands. So the Shroud is like a memory of how he was when he was dead BEFORE the Resurrection..","date":"2014-11-22","mins":"9:51 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","title":"Image of the Resurrection?"},{"id":"comment-172630","author":"charles_freeman","post":"No Russ, I don’t work from copies and replicas. I work from the depictions of expositions of which there are probably fifty different ones over the years, by different artists,of course.. I start with the Tempesta engraving of1613 as Tempesta was famous in his day for accuracy as an engraver. Then we look at other examples from1578 to 1703 to check whether Tempesta should be trusted. Obviously the three I take from before 1613 cannot have been influenced by him but they show similar feature to those in the later 1600s. You make the fundamental mistake in asserting that the images on the Shroud were created faint, my argument with illustrations is that they became faint over time ( the nineteenth centur Y seems to show the deterioration of the images although a lot more work by prof Essional art historians is needed here ).it is just a different way of approaching the issue and I think more fruitful in getting to the heart of the issue. What is essential is to assemble a data base of all the depictions of expositions they really are fascinating when you start comparing them with each other to work out the features like the Crown of Thorns ,shown with lots of prickly thorns , that are now lost. There may be problems off copyright but the idea would be to have a historical Shroudscope that anyone could access. It would be an essential part of any Shroud researcher’s materials..","date":"2014-11-23","mins":"2:51 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","title":"Image of the Resurrection?"},{"id":"comment-172642","author":"charles_freeman","post":"P.S. For instance , your loincloth issue. There is, of course, no problem in a loincloth being added – it is no different from many other relics that coverings were created for look at the wonderful gold costume that the Volto Santo is decked out in when processed or gems sewn onto relics. No one saw this as a problem any more than they did in cutting out part of the Shroud to give away as a relic probably in the 1530s ( or STURP taking off parts of the image to the US – no one seems to have seen this as desecrating a holy relic but it could be argued that it was by those who think the Shroud is authentic. If it is not authentic that is not a problem although it may have been unwise to separate elements of the Shroud in this way – I still don’t know whether they are kept together in proper conservation conditions and what the rules for access by scholars are.) However, Russ’s point is valid. Is this a loincloth painted onto the Shroud or one painted on by artists who were unanimous in showing it? ( I have at least thirty examples that show it the 1998 catalogue of the Savoy family’s collection is enormously helpful here ). This is why we need ALL of them online so that you,Russ, and other Shroud researchers can freely argue from a common data base. I think it would be an excellent study for a Master’s dissertation by a budding art historian to collect them all together but there would probably need to be finance available to that those images still subject to copyright can be paid for. As a historian I just believe in assembling all the evidence and opening it up to public and academic discussion. Then we can see what comes out of it..","date":"2014-11-23","mins":"4:48 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","title":"Image of the Resurrection?"},{"id":"comment-200834","author":"charles_freeman","post":"These comments suggest that the case for authenticity is closed. Yet science moves on and I shall be interested to see what new tests on the Shroud will bring. I know where I think the argument will end up. I am just happy to wait but naturally I am putting forward my own ideas in the meantime as everyone else here is doing. It is something called free debate..","date":"2015-06-02","mins":"1:25 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?"},{"id":"comment-172647","author":"charles_freeman","post":"P.P.S. Of course the tradition with relics ever since the fourth century is that any one part of a relic, a finger from a saint, a sliver of the Cross, a single thorn from the Crown of Thorns has the power of the whole. So anything removed from the Shroud that is original to it is this same category and those who think the Shroud is authentic should venerate it as such. One more reason to make sure that these tapes are kept with appropriate care. In traditional Catholic teachings on relics each one with material from the original surface has the spiritual power of the whole Shroud..","date":"2014-11-23","mins":"5:01 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","title":"Image of the Resurrection?"},{"id":"comment-200850","author":"charles_freeman","post":"Thomas you are quite right the articles will keep on coming and when I need to give an acknowledgment of an expert I will do so with their permission. We may never get a final solution for the Shroud but we can at least provide overlapping evidence from a variety of specialists which gives us a reasonable understanding of it. Inevitably many textile experts will give their opinion from what they can see of the Shroud’s weave and iconography and the present state of the images but prefer not to go further without a close up examination. Sadly unlike the Anti Kythera Mechanism where there is access given freely to those with the right expertise the Shroud at present is off limits and expert opinion is likely to be limited as a result..","date":"2015-06-02","mins":"4:16 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?"},{"id":"comment-17485","author":"charles_freeman","post":"I never comment on the scientific evidence other than to raise the query of how to square a blood grouping of AB with the commonly held view that this blood grouping was not known before AD 900. I leave all the discussions about Maillard reactions etc, aside. It is BECAUSE I am not a scientist that I call more up to date scientific tests. It would fill in the gaps which I am unable to make a judgement on. I came into this field because I was shocked by the inadequacy of Wilson’s work on the Shroud not the only one,of course: Byzantine scholars in general and Yannick Clement on this site share this view. Having worked for two and a half years on relic cults as well as many more years than that on the history of early Christianity with work peer reviewed and published by university presses, I felt I had something to offer. I did start work, many years ago, as an archaeologist and have much more confidence in radio carbon 14 dating than some others here , as I am aware of how many dating problems it has solved to everyone’s satisfaction. Any reputable person working in a r c lab knows all the pitfalls that can distort dates and will state these alongside their findings but overall the accuracy is greater than most other forms of dating. It should be one ,but only one, element in achieving a final dating of the Shroud. It should certainly be able to rule out a first century date if the Shroud is not authentic..","date":"2012-10-11","mins":"10:40 am","url":"https://shroudstory.com/2012/10/11/it-is-thus-but-may-not-berichard-dawkins-should-ignore-the-challenge/","cat":"image_theory","title":"It is thus but may not be–Richard Dawkins should ignore the challenge"},{"id":"comment-17548","author":"charles_freeman","post":"Reply to Ron. I base my ideas on the accepted works of scholarship. In the case of radiocarbon dating, pages 136 147 in the most authoritative work on archaeology, Renfrew and Bahn’s Archaeology, Theories, Methods and Practice, sixth edition, 2012 , sets out the issues well. These pages have lots of tables and discussions on the strengths and limitations of radiocarbon dating and in the same chapter look at all the other dating methods. They conclude,p.143, ‘If we seek to answer the question’When?’ in archaeology, radiocarbon has undoubtedly offered the most generally useful way of finding an answer…radiocarbon has transformed our understudying of the past, helping archaeology to establish for the first time a reliable chronology of world cultures’. So, rather than taking my word for it, I shall refer you to Bahn and Renfrew whose credentials are easily found online. The Egyptian and Peruvian examples have long since been shown to be false I think it was even on this website that it was shown how retesting had shown that the Egyptian examples in particular were not AB blood at all..","date":"2012-10-12","mins":"11:24 am","url":"https://shroudstory.com/2012/10/11/it-is-thus-but-may-not-berichard-dawkins-should-ignore-the-challenge/","cat":"image_theory","title":"It is thus but may not be–Richard Dawkins should ignore the challenge"},{"id":"comment-17549","author":"charles_freeman","post":"Further to Ron: On AB in Latin America for the pre European contact populations. As they are almost all O in Latin America and with virtually no As or Bs known, AB is virtually impossible in the pre 1490s population. ‘Type O is particularly high in frequency among the indigenous populations of Central and South America, where it approaches 100%’. This is easy to check and one study of ancient burial sites failed to find a single corpse that was not O. In any case as there was no contact with Europe before the 1490s, this is irrelevant for the Shroud..","date":"2012-10-12","mins":"11:52 am","url":"https://shroudstory.com/2012/10/11/it-is-thus-but-may-not-berichard-dawkins-should-ignore-the-challenge/","cat":"image_theory","title":"It is thus but may not be–Richard Dawkins should ignore the challenge"},{"id":"comment-17550","author":"charles_freeman","post":"Not that it is relevant for Shroud studies. . . Distribution of ABO blood types in various modern Indigenous Amerindian populations Test results as of 2008[80] PEOPLE GROUPO (%)A (%)B (%)AB (%) Peru 100 0 0 0.","date":"2012-10-12","mins":"12:00 pm","url":"https://shroudstory.com/2012/10/11/it-is-thus-but-may-not-berichard-dawkins-should-ignore-the-challenge/","cat":"image_theory","title":"It is thus but may not be–Richard Dawkins should ignore the challenge"},{"id":"comment-7327","author":"charles_freeman","post":"We can all try and get as close as we can, with lasers or flour or whatever, to the images as they are now but you still have to argue that the Shroud is chemically the same as it was six hundred or two thousand years ago and explain specifically why anyone would want to make it THEN the way it is NOW. That involves finding an historical narrative that makes sense. I think that some time ago I am not going to search for it you told us that you were going to give the historical narrative but you never did. Thr point is that no one would be able to find it the way your site is presented now. Shroud.com has the top rating, together with the ubiquitous Wikipedia but it has built up a loyal following among pro authenticitsover many years it is a club newsletter. One of my correspondents who was new to the Shroud said that in fact Shroud.com was hopeless as ,while it had lots of pro authentic articles , you could not find a straightforward coherent defence of the authenticity of the Shroud ( and ,of course, it does not even mention articles ,even those in respected journals, that argue against authenticity so it is hopeless as a means of getting an overall view of the debate). I assume we agree here. I have never seen a single piece of scientific evidence that dates the Shroud before the medieval period despite repeatedly asking for some. Fant’s dating fantasies were embarrassing even for those who believe in the authenticity of the Shroud. Anyway the question here is how to make your own site more visible. As someone who has a very visible and much read coherent explanation of the Shroud which has kept high in the Google ratings over eighteen months I am simply giving you some tips as how it can be done. You need not take my advice if you don’t want to. I won’t bother you further..","date":"2016-06-09","mins":"7:06 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/25/modelling-the-shroud-of-turin-with-white-flour-olive-oil-and-a-real-face-in-pictures/","cat":"turin_shroud","title":"Modelling the Shroud of Turin with white flour, olive oil and a real face – in pictures."},{"id":"comment-7320","author":"charles_freeman","post":"Not ‘ instant big media splash’ – my article has been near the top of a Google search consistently for eighteen months. I, and presumably other readers, have not a clue why anyone would want to make a flour oven roast of linen and this is presumably why your blog has not been referred to on other sites. If you could set out why clearly with the historical background and get a reputable journal to publish it you might be listened to. It can be done!!.","date":"2016-06-08","mins":"7:39 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/25/modelling-the-shroud-of-turin-with-white-flour-olive-oil-and-a-real-face-in-pictures/","cat":"turin_shroud","title":"Modelling the Shroud of Turin with white flour, olive oil and a real face – in pictures."},{"id":"comment-7318","author":"charles_freeman","post":"Colin, I have done absolutely nothing to keep my History Today article near the top of the Google searches. I have been told that its high rating is because people have liked it and passed it around a number of websites. One reason for this is that it sets out clearly what and why I believe about the Shroud. Nowhere on your site do you set up exactly what you believe in one coherent narrative so I am not surprised that you are not picked up in the way I appear to be. I got a positive response from. A Harvard professor who had read the article only today. I have to say also that my article came in a highly respected history journal and as a result was taken up by the global media. No harm in your setting out your arguments clearly and getting them published in a similarly respected magazine/ journal. Good luck!.","date":"2016-06-08","mins":"3:21 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/25/modelling-the-shroud-of-turin-with-white-flour-olive-oil-and-a-real-face-in-pictures/","cat":"turin_shroud","title":"Modelling the Shroud of Turin with white flour, olive oil and a real face – in pictures."},{"id":"comment-7371","author":"charles_freeman","post":"Colin why you need to resort to abuse against me is not clear. I only intervened to HELP you find a way of publicising your website so that it was as high on a Google search as my History Today article is. This says nothing about the relevative quality of our work, only about its visibility although I have had a lot of good support as it is easy to contact History Today. On publications, I prefer to write long books for university presses so OUP have published three editions of one of my books, and Yale UP two books by me, one on medieval relics which is one of my academic specialties( see the reviews of Holy Bones on the Yale UP US website). As you may know no UP publishes a book unless the proposal has gone through its academic committee and then the final version is checked by two anonymous reviewers. I see no reason to go on spinning any MORE yarns as I am quite happy with the high ranking of my own HT article. Why should I need to do more? I accumulate positive feedback and would prefer to present it together at book length if the opportunity presents itself. Meanwhile I write articles on the Shroud when asked to do so as in a twin page spread in the Church Times last June and a long article on the Catholic Church’s attitude to the Shroud in the autumn 2016 edition of the Journal of Information Ethics. Why not get on with your work and seeking specialist support and publication rather than worrying about my status as a historian, a status that seems to have been accepted by everyone who has paid me as a historian for the past forty three years. I just don’t get where you are coming from!.","date":"2016-06-18","mins":"9:42 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/25/modelling-the-shroud-of-turin-with-white-flour-olive-oil-and-a-real-face-in-pictures/","cat":"turin_shroud","title":"Modelling the Shroud of Turin with white flour, olive oil and a real face – in pictures."},{"id":"comment-58481","author":"charles_freeman","post":"John. I am sure that it will be an interesting contribution so good luck with finding a way of publishing it..","date":"2013-12-12","mins":"2:41 pm","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-58315","author":"charles_freeman","post":"‘Skepticism not founded on fact is not true skepticism but pseudo skepticism.’ Come on, John! The OUP defines scepticism ( as one of its definitions) ‘ ‘Doubt as to the truth of some assertion or supposed fact’. ‘Doubt’ is the key word. It simply means that in a specific case the ‘facts’ are not established fully enough for them to be accepted as true they may or may not be. It is is a perfectly honourable position to take. A ‘pseudo sceptic’ would be someone who claims that they are sceptical about something when in fact they believe it to be true. It is one of the virtues of Dan’s blog that one can express sceptical views about particularly assertions about the Shroud and the benefits are obvious from the debates that follow. Compare Stephen Jones’ blog where nobody dares say anything and there is simply no debate – I know which I prefer which is why I look in on this blog but would never bother with Stephen Jones.. So please don’t denigrate the honest sceptics those who really don’t know because the evidence is, as yet, inadequate. By posing questions ,they may actually lead to new insights about the Shroud..","date":"2013-12-12","mins":"7:04 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-58334","author":"charles_freeman","post":"‘Doubt as to facts must itself be based on facts.’ Well, we shall just have to disagree on that. I would suggest that that is philosophically untenable surely as an attorney you doubt some of the stories you hear because they appear to be implausible or self serving without having any alternative facts with which to disprove them.You just say, surely, ‘I doubt your account’. The important thing is we don’t shut each other up. I really value scepticism as without it we can hardly make any progress, not least in trying to understand the Shroud. I am intrigued to know why the fur might fly when your book is published? or perhaps I should not ask you to give your secrets away at this stage and we shall just have to wait until Ash Wednesday!.","date":"2013-12-12","mins":"7:44 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-58363","author":"charles_freeman","post":"‘The limit is thin between mystery and ignorance.’ If this was a philosophy blog, we would have a wonderful debate on this one I would certainly enjoy analysing what it does or even might mean!.","date":"2013-12-12","mins":"9:13 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-167927","author":"charles_freeman","post":"There is no competition here – it is an accumulation of evidence that gives a coherent picture of the Shroud’s provenance. I ask in vain for any one convincing piece of data that dates the Shroud to the crucial period of AD 1 30. Failing that I put together in my article all the evidence that suggests a western origin for the Shroud, done on a medieval treadle loom, showing fourteenth century iconography ,etc, ,etc that reinforce my argument for those (have you got round to it yet,Colin? ) who have read my article. I am not competing with anyone on this!.","date":"2014-11-02","mins":"1:26 pm","url":"https://shroudstory.com/2014/11/02/paper-chase-a-significant-paper-by-mario-latendresse/","cat":"image_theory","title":"Paper Chase:  A Significant Paper by Mario Latendresse"},{"id":"comment-214593","author":"charles_freeman","post":"O.K., being so paranoid, Why anyone would be remotely interested in compiling a dossier on anyone who believes the Shroud is authentic defeats me. Some of us of are academics, merely interested, among other projects we are working on, in finding the truth about its origin. What harm are you doing to anyone in believing that it is authentic? Why should you have any importance that deserves busy people to be compiling a file on you? What use would it be to anyone? What matters is finding scientific, artistic, etc, evidence that establishes the origin of the Shroud. Some of us prefer to focus on that. I.","date":"2015-11-14","mins":"2:42 am","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","title":"Nevertheless, the images are real enough!"},{"id":"comment-118574","author":"charles_freeman","post":"David Ford is not a blood specialist, neither am I. I put all the Heller and Adler papers I could find to an Emeritus Professor of Physiology at London University and he found nothing to convince him there was human blood on the Shroud, so at least the issue is contested. The ‘wrong’ colour of the blood remains a major issue against its authenticity. Ironically we are discussing testings made in 1978 while science has moved on so fast that the issue of painting and blood could pobably be sorted either way in a few minutes nowadays. I am not sure of the wisdom of going over these old papers when they represent the findings of hopelessly out dated research methods. We wouldn’t do it in any other scientific context. Incidentally I am writing this about two hundred yards from the now vanished palace of the Byzantine emperors in/Constantinople where some contributors to this site believe that the Shroud might once have been stored. I have just taken a tour around the surviving mosaics from the palace..","date":"2014-05-13","mins":"10:04 am","url":"https://shroudstory.com/2014/05/13/schwortz-it-is-worth-reviewing-david-fords-noteworthy-blood-or-paint-paper/","cat":"image_theory","title":"Schwortz: It is Worth Reviewing David Ford’s Noteworthy Blood or Paint Paper"},{"id":"comment-157152","author":"charles_freeman","post":"If all the paint flaked off what would you be left with? I am sure a professional conservationist would be able to advise on this.","date":"2014-09-27","mins":"2:42 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-157706","author":"charles_freeman","post":"As I noted elsewhere, south if the Alps they used calcium sulphate , north of the Alps calcium carbonate. So if this was indeed a uniform primer on the Shroud ,it was likely to have been applied north if of the Alps..","date":"2014-09-29","mins":"11:20 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-157876","author":"charles_freeman","post":"One must never forget the rough handling the Shroud had especially in the public expositions of the seventeenth century. The gesso surface would have fragmented with time leaving only the evidence of calcium carbonate on the outer fibrils. So I would ask Mr.Jackson to place this possibility among the other hypotheses to be tested. Only closed minds would rule it out from the start and it would be an easy test to do..","date":"2014-09-30","mins":"2:25 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-157878","author":"charles_freeman","post":"One view a professor of physiology suggested to me was that what STURP thought was the remnants of blood was in fact collagen from the glue( probably boiled up rabbit skins ) that mixed with the calcium to form the gesso. His was after reading some if the STURP papers. As I keep on saying there is lots of further research to be done by those whose minds are not already closed..","date":"2014-09-30","mins":"2:31 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-158020","author":"charles_freeman","post":"Well I sent him every STURP paper I could find and he simply said ‘totally unconvincing’ as to the existence of human blood. What is extraordinary is that I keep on saying that further testing is needed to sort out these issues one way or the other. If you refuse to countenance such tests I am entitled to say you have a closed mind. They may rule out the remnants of a gesso applied with a knife altogether just as a doctor might rule out a suspicious lump being cancer but he still does the tests. I shall be very interested to see if Dr. Jackson is prepared to include tests that might prove conclusively that the Shroud is fourteenth century..","date":"2014-09-30","mins":"12:39 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-158241","author":"charles_freeman","post":"I am glad we can agree on the need for new testing but I don’t think the 1078 tests should stand as conclusive of there being no paint. However, new testing will give an opportunity to resolve the matter. My professor worked from what STURP reports were available and he found them unconvincing and I have no doubt that it is another area that needs new work on it. By the fourteenth century there were many cults involving the blood of Jesus, some of it coming from bleeding consecrated hosts the real blood of Jesus, of course , so later blood may have been added as we know the extensive blood marks were the first thing the fifteenth and sixteenth century observers noted, far more dominant than they are today. I always find it strange that Shroud researchers assume that the Shroud today as as it always has been but with the passage of time one would expect major changes to have taken place on the surface. Plotting what these may have been from early descriptions and depictions needs to Be added to Dr. Jackson’s list. Belsdon Scott made a good start but much more archival research needs to be done in Turin..","date":"2014-10-01","mins":"1:10 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-155235","author":"charles_freeman","post":"STURP never explained the ‘large’ quantities of calcium carbonate they found on the Shroud and were apparently unaware that in the medieval period and right up to today it is a major component of gesso that was applied to the outer fibrils of linen to seal it before painting. I agree with Hugh that painting cannot be ruled out..","date":"2014-09-24","mins":"4:29 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-155250","author":"charles_freeman","post":"Seeing how far microscopy and the analysis of pigments has progressed sine 1978, I would happily accept the findings of a conservation lab that had experience of dealing with painted cloths..","date":"2014-09-24","mins":"4:58 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-155545","author":"charles_freeman","post":"I don’t think that would explain the ‘large’ quantities that STURP found. One has to remember that with dramatic unfurlings almost every year in the seventeenth century ,any smaller fragments would have fallen off but calcium carbonate as part of a gesso would be more likely to have kept on – as ,of course, it was intended to. I could not believe my eyes when I read in the STURP report that they had not examined any medieval paintings on linen for comparison or apparently even consulted conservationists who specialised in such things. Surely you approach every avenue before you rule out such things. The question of painting must be left open – but at least get an conservation expert in these things on the case !.","date":"2014-09-25","mins":"2:38 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-155256","author":"charles_freeman","post":"That is not correct, Thibault. In their physics and chemistry article STURP specifically stated that they had not examined any paintings on linen. There is nothing in their article about how linens were prepared for painting and how the painting was actually done despite medieval treatises on the subject. They failed to explain the presence of calcium carbonate that many would see as a possible indication of gesso. In short, this area remains open for further research especially through seeking expert opinion as to why the calcium might have been on the cloth in ‘large’ quantities..","date":"2014-09-24","mins":"5:07 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-157135","author":"charles_freeman","post":"O.K., Josie So why not join me in leaving the question open?.","date":"2014-09-27","mins":"1:03 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-156041","author":"charles_freeman","post":"Painters of linen to this day made/make sure the painting did not seep through by creating a layer of gesso onto which the pigments were painted. If you google around ‘painting on linen’ you will find out how to do it ..","date":"2014-09-25","mins":"3:29 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-157148","author":"charles_freeman","post":"It is simply because gesso does stiffen the linen that Cennini advises putting it on the outer fibrils only. It was clearly a very skilled operation to get it right but the number of painted linen flags fluttering in medieval paintings shows that they could do it..","date":"2014-09-27","mins":"1:43 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-156366","author":"charles_freeman","post":"As STURP did not even bother to consult an expert on painting in medieval linen the question of whether a layer of gesso was applied on the outer fibrils must be left open. Medieval painted flags were sealed on the ultra fibrils only so that they could flutter in the breeze..","date":"2014-09-26","mins":"1:22 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-156418","author":"charles_freeman","post":"I am only saying that there tests that should have been done by STURP or submitted to experts in this field that were never done and to this extent ,as with the study of the weave, the STURP report was limited and cannot be treated as conclusive of anything much. Anyway it is so hopelessly dated by now that it is becoming increasingly irrelevant for any serious student of the Shroud..","date":"2014-09-26","mins":"2:27 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-156902","author":"charles_freeman","post":"Not at all ridiculous to suggest that tests undertaken in 1978 in virtually every area of scientific research will be very dated and will need redoing from scratch with modern equipment unless David Goulet is prepared to go and see his doctor and say that he does not want any tests done that were not in place before 1978. I have no problem with someone who believes on the balance of evidence that they believe the Shroud is oauthentic; that is up to their own judgement of the very limited evidence we have. I do have a serious problem with anyone who is not prepared to consider that a great deal more would be known about the Shroud if it was given a proper examination in a conservation lab specialising in ancient textiles, painted and otherwise. We also need an in depth analysis of the weave – thanks to the quality of the photographs this can largely be done from these..","date":"2014-09-26","mins":"11:10 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-156932","author":"charles_freeman","post":"I am happy to re do the C14 tests again though unconvinced as I am by the reweaving and contamination claims I do not expect them to be much different. But we must redo them to try and settle the matter. I shall insist on 2014 testing from my doctor. I understand that blood rests in particular have advanced enormously in the last twenty years and the advances are of great importance so far as the Shroud is concerned..","date":"2014-09-26","mins":"11:50 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-157051","author":"charles_freeman","post":"If they had read Cennino Cennino’s fifteenth century treatise on painting on linen they would have discovered that he recommended applying a layer of gesso to the outer fibrils of the cloth with a knife so that the excess could be wiped off. This would explain an image just on the outer fibrils without brush marks. I have been trying to persuade one of my contacts in the documentary world to have a go at commissioning such a sealed linen. I have been saying all along ere are enough unresolved issues , especially with the calcium carbonate that is the main element in most gessos that the question should be left open. I do not have much time for people who say it should remain closed and if I were home I would quote you the paragraph in the STURP report that says they did not examine any painted linens. – perhaps Hugh has it to hand. Meanwhile I have been assured by my local guide that the bones of John the Baptist they have here in Genoa have been dated to two thousand years ago. I have, of course, told her that you must never trust carbon 14 dates and that they are probably medieval..","date":"2014-09-26","mins":"5:31 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-157059","author":"charles_freeman","post":"Thanks,Hugh. STURP were professionals in their own fields but their knowledge of medieval iconography, methods of painting on linen and techniques and looms used in ancient and medieval weaving appears non existent. And as this quotation suggest they did not even bother to inform themselves. How can you reject the idea of this being a painted linen if you have never even examined an example presumably anyone following Cennini would have sealed the linen on the outer fibrils and then put the paint on top. One can hardly paint linen without sealing it although I understand this might be possible with modern paints. Medieval pigments mixed with tempera would have gone through into the cloth and then it would have been impossible to paint ,say, a flag with different images on each side and the paint would have made it impossible to flutter freely. That is why priming /sealing is essential but it has to be confined to the very outer layer of the linen. Lots to think about for those prepared to think..","date":"2014-09-26","mins":"6:01 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-157703","author":"charles_freeman","post":"I have the full Cennini text. The whole point is to cover the whole cloth with gesso and then you can apply the image wherever you need to. The gesso also acts as a preservative. If the calcium carbonate is uniform and you are the one who has provided a quotation in support of this, this is a point in favour of an original priming and thus keeps open the possibility of an original painting that may have decayed with time..","date":"2014-09-29","mins":"11:14 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-44685","author":"charles_freeman","post":"Leaving aside the radiocarbon tests, I wonder what Mark would accept as other scientific tests that are consistent with the Shroud’s authenticity. An obvious test would be those whose credibility would be accepted by the scientific community as a whole. I am not a scientist but every time I go through these debates I get the impression that almost every test is disputed within the Shroud community, not a good starting point if one wants to attract outsiders to the debate. I was talking to a medievalist art historian who said that he knew nothing about the Shroud and that it was much too controversial an issue for him in any case. That spoke volumes..","date":"2013-09-19","mins":"5:55 am","url":"https://shroudstory.com/2013/09/16/speaking-of-more-scientific-testing-of-the-shroud/","cat":"image_theory","title":"Speaking of more scientific testing of the shroud"},{"id":"comment-172112","author":"charles_freeman","post":"What Colin has made clear with his mention of artists, the embellishment of images ,etc,etc, is that he is in the realm of history of art. How can he not be? An image made in sweat or to represent sweat is as much within the field of history of art as painting is – well particularly interesting to historians of art in that there has never been any documented case of such image making in medieval art before Colin got to work on it. This was medieval Europe at a time of enormous disruption after a third to half of the population having died from the Black Death. Lirey is miles from Rome, not even on one of the pilgrim routes along which news would have travelled. The de Charny family had no known links with the papacy or Italy and it is only later that the Veil of Veronica becomes a popular theme of art. Yet somehow this cloth that supposedly touched the living face of Christ inspired the creation of a cloth that supposedly touched the dead body of Christ and was, as Colin suggests, worked over for years ( which years is he suggesting?) .And if Chevalier had not dug up those documents ,we would probably have not heard about it all despite it being a completely out of the ordinary artistic creation ( let alone the technique not having been heard about by any art historian). It is enough to make you think that the Shroud might be authentic after all..","date":"2014-11-19","mins":"5:18 pm","url":"https://shroudstory.com/2014/11/18/the-conspiracy-of-the-faux-sweat-imprint/","cat":"image_theory","title":"The Conspiracy of the Faux-Sweat Imprint"},{"id":"comment-172178","author":"charles_freeman","post":"The Veil of Veronica first became prominent in Rome after 1205 and was a prominent relic in the Holy Year of 1350. There is absolutely no reason to link it ,however, with an obscure village in Northern France in those traumatic years of the Black Death. Relic cults and imitations ,etc, grew up along the main pilgrim routes. Why would Colin’s artists have chosen there to make there to make their unique sweat image? Italy would have been more appropriate and this was the age there of the greatest artistic creativity..","date":"2014-11-20","mins":"3:16 am","url":"https://shroudstory.com/2014/11/18/the-conspiracy-of-the-faux-sweat-imprint/","cat":"image_theory","title":"The Conspiracy of the Faux-Sweat Imprint"},{"id":"comment-158894","author":"charles_freeman","post":"I am intrigued by the assumption seemingly common to all Shroud researchers that the images on the Shroud are as they have always been. Perhaps it is because I worked as an archaeologist where one assumed that what one dug up was not how it originally was and so one tried to find evidence of earlier examples to start work on. So far as I can see it is only in the past fifteen years that there has been serious work on textiles with images on them (of which thousands are documented in medieval church inventories, not least to cover everything up at Lent but also in all kinds of hangings) and often conservationists seem to be working on decayed images as there is only a handful of medieval images that are still in pristine condition. Of course, as STURP admitted that they had done no research on these, the area is still open but sadly none of these untouched areas of research seem to be represented at the coming conference..","date":"2014-10-03","mins":"11:05 am","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis"},{"id":"comment-159188","author":"charles_freeman","post":"David Mo. Hear,hear. As readers on this site will know, I have long advocated an intensive examination of the Shroud in a conservation lab with experience in dealing with ancient textiles. No one on the STURP team seems to have had any experience in this central, and, as yet, little explored area of Shroud research so the opportunity to carry out even a preliminary examination of these issues when STURP had the Shroud under their noses was missed. Perhaps Dr. Jackson can make it a priority – there are such labs whose impartiality and professionalism is beyond doubt..","date":"2014-10-04","mins":"6:22 am","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis"},{"id":"comment-159009","author":"charles_freeman","post":"Point taken,Hugh. Yes, it would go without saying that if you take ‘ the Shroud is a painting ‘ route, it makes sense that you have a decayed image with the pigment largely or wholly lost. I must have missed the theory about the image being formed over dozens of years. Even so,if that takes you up to, say, AD 150 you still have many centuries without change..","date":"2014-10-03","mins":"5:22 pm","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis"},{"id":"comment-206369","author":"charles_freeman","post":"‘When one adds cold limewater to white flour there’s an immediate strong fishly odour.’ Well, it is a herringbone weave..","date":"2015-07-23","mins":"5:42 am","url":"https://shroudstory.com/2015/07/23/the-morphing-of-rogers-and-berry/","cat":"image_theory","title":"The Morphing of Rogers and Berry?"},{"id":"comment-183473","author":"charles_freeman","post":"The artist was imagining the imprint on a cloth of a body. He knew that the convention since the sixth century ( despite any gospel evidence to support it) was to represent the wound (reported only in the latest of the gospels, John) on the side on the right, so the artist placed it on the left to make the point that he was reproducing a negative impression as left by the body. We see the same on the Besancon Shroud ( which is independent of the Shroud as one can see from the iconography) so the Turin Shroud is not unique in this respect. I suspect that some of the so called copies of the Shroud in Spain may well be independent creations ( e.g. Those made after 1532 without the fire marks). It will be interesting to see if they also show the wound on the left. If they do and are not direct copies of the Shroud, this suggests that this became as conventional for these Quem Queritis and other liturgical grave clothes as showing the wound on the right was in conventional Crucifixion scenes. Certainly the artist of the Shroud INTENDED it to be a negative as shown by the placing of the wound. How far he succeeded and what other aspects of a negative image he achieved I leave it to others to determine..","date":"2015-01-15","mins":"6:49 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-183531","author":"charles_freeman","post":"The artist was trying to his best to show that this is how he imagined a body would leave its imprint on a cloth and this would inevitably give some impression of being a negative. He may or may not have succeeded but this is what he would have been required to do if producing a grave cloth. As my photography teacher always tell me ‘A photograph is not reality’. The real image is the image on the real Shroud, not photographs of it, and this should be the centre of debate. The least mysterious thing about it is the superficiality as this is exactly an image on a cloth should be if the cloth is properly sized and we have lots of similar examples ( see Villers, ‘The Fabric of Images’). The Shroud may be unique only in its particular combination of features each of which have comparisons elsewhere and in the fact that it MAY be the only survivor of the Quem Queritis ceremony. As Hugh pointed out in his quotation from The Fabric of Images, to an expert such as Villers (who died tragically young from cancer), a faded linen like the Shroud is run of the mill, worth just a passing mention. The few surviving highly sophisticated painted linens, with extraordinarily complex use of pigment layers and mixes are what fascinated her and her colleagues. The fact that she, as an expert, did not think the Shroud was anything special as a an artefact or work of art is significant. I don’t think anyone on this site has ever argued as consistently as I have that we should bring in experts in these specialist areas. Far too much time in far too many crucial areas is wasted going over the same ground without a single input from a specialist. No wonder everyone wanders around in a fog of mystery!.","date":"2015-01-15","mins":"11:43 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-183668","author":"charles_freeman","post":"The Shroud was never intended to deceive. No one in the Middle Ages would been taken in by a cloth with images on it when there were none mentioned in the gospels or seen on any depiction of the burial of Christ. This is why the Church was so easily able to prevent it becoming a medieval cult of an authentic relic – but they were outwitted by a secular ruler the Savoys – who realised they had the space and influence to claim it was the real thing. In his study of the Quem Queritis ceremonies , Karl Young in the 1930s found four hundred accounts of these ceremonies all involving the display of the grave clothes before the congregation ( so there must have been very many more). So we know that at one time hundreds of these clothes existed. But the attrition rate is high. We know of hundreds of documented painted linen cloths in medieval England we do not have a single survivor. So the painter of the Shroud would have had lots of models to draw on. It is is a major mistake to think that because the Shroud is a unique survivor t Hat it was the only one ever made!! The painter would have lots of models, perhaps even a template to copy from. He may even have been making a replacement of one that had decayed. We are very much at t He same stage as research on the Egyptian pyramids were in the 1880s. They were so ‘ unique’ all kinds of stories went on about them, with their measurements even being thought to be the source of British weights and measures. Gradually serious research began, they got dated and gradually they were given a context. Work is still going on. There are still lots of ‘ mysteries’ about the pyramids but we have lot S of solid interlocking evidence that explains most but not all of them. Yet there are still people who think they were built 12,000 years ago, were linked to Peru and even Mars. Again the Anti Kythera mechanism. Vast amounts still to learn from another unique survival and an example of the Greeks being far more advanced that we ever expected them to be. But, of course, we recognise that what we have now is not what was originally made and the Shroud must be assumed to be the same unless it was miraculously preserved outside the real world of physical change. So you can see why we are in t He same place as t He pyramids were in the 1880s. And haunting though the photographic negatives of the negatives are( as photographic negatives often are) ,you still have to explain why the squiggles of blood on the head are almost identical to those on the Holkham Bible of 1330 (‘remarkably so’ says Paul Lay, History Today Editor when we were looking at them together when he was interviewing me for my podcast). And crucially you have to explain why Christ’s head is that of a man standing upright with his hair falling to his shoulder in fact the conventional pose from as early as 300 AD in Rome but why copied here and not adjusted to show a man lying down. That is one of the mysteries still to be solved or perhaps the artist was just going through the motions for a commission for a church that needed a new grave cloth in a hurry. We shall never know but this should not stop us bringing in independent experts as I have long advocated..","date":"2015-01-16","mins":"2:59 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-184233","author":"charles_freeman","post":"Quote from Karl Young, The Drama of the Medieval Church, Oxford, 1933, pp. 134 5. Young was aware of some four hundred different accounts of these Easter ceremonies and the following is based on that: ‘ The dramatic ceremonies at the sepulchre followed the Gospel traditions with considerable freedom, using sometimes a single cloth, called sindo or linteum,sometimes a cloth called sudarium, sometimes several pieces called linteamina, and again both a sudarium and linteamina. These dramatic images may have been in part responsible for the production of painted sudaria which have sometimes been mistaken for authentic relics of the Passion.’.","date":"2015-01-18","mins":"4:19 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-206127","author":"charles_freeman","post":"‘But why are only the crowns affected?’ There is a good clue in the STURP Physics and Chemistry Report of 1982. As is well known there was no art historian on the STURP team but they did ask one, J. Drusik of the Los Angeles County Museum of Art, for advice: ‘He suggested that if the large calcium concentrations [ as found by STURP] had been present in the cloth before the image was formed, it might be expected that it would have buffered certain types of reactions and, thereby, assisted in confining the discoloration to the tops of the thread crowns.’ This makes good sense. The discoloration of the linen took place underneath the calcium carbonate. I wish Drusik had been questioned further as he probably had the solution to the image formation. N.B. Calcium carbonate is the main ingredient of the gesso with which a linen cloth is sealed before painting is placed on top..","date":"2015-07-19","mins":"2:33 am","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","title":"Those Gee Whizz Radiation Models"},{"id":"comment-206147","author":"charles_freeman","post":"Wh at you hav E now, as Drusik suggested, is discolouration (and this is the best way to describe the images) on the top fibrils. One piece of evidence for this is that the limits of the discolouration are not clear which is why you have problems in taking measurements of the body. So you have to explain how the linen became discoloured. The best hypothesis is that This is not a question of paint fading but disintegrating leaving the discolouration behind where the painted and gessoed surface once covered it. There is s nothing in the STURP paper that disagrees with this unlike Drusik, doubtless a professional in his own field, they did not imagine that there was a painted surface which had once been there but which had now vanished. It does pay to have an art historian – but having said that De Wesselow did not spot it either!.","date":"2015-07-19","mins":"8:11 am","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","title":"Those Gee Whizz Radiation Models"},{"id":"comment-206148","author":"charles_freeman","post":"No one has argued that the calcium carbonate was a binder as the medieval manuals made clear you needed just to lay it on top of the fibres. This seems to be where STURP found the calcium. It fits the medieval manual instructions. If STURP wants to be taken seriously it needs to show that the tests can be replicated. That is the basis for all science and explains why STURP has never been taken seriously by the wider academic community. Has anyone ever produced an old linen that has t he same pattern of iron oxide as the shroud has? I doubt it but I am ready to be convinced!.","date":"2015-07-19","mins":"8:17 am","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","title":"Those Gee Whizz Radiation Models"},{"id":"comment-216396","author":"charles_freeman","post":"Hugh. So are we justified in saying that there is calcium carbonate on the Shroud?.","date":"2015-12-13","mins":"10:09 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"id":"comment-216389","author":"charles_freeman","post":"Colin could well use his considerable scientific knowledge to look at the analyses of the gesso that does survive on the medieval painted linens that have been studied. I think it is from this that we know that calcium carbonate was used in gesso north of the Alps and calcium sulphate for gesso south of the Alps. Anyway there is no problem in locating and analysing surviving medieval gesso and someone will eventually be able to tell us whether the calcium on the Shroud is sufficient evidence of an original gesso. Colin knows for certain that it is not but he will strengthen his case if he can provide some evidence that he has looked at the existing gesso from this period. I cannot see the relevance of the gesso not being on the Shroud of Arquata. We know from the medical treatises ,such as that of the Tuscan Cennino Cennini, that gesso was used to seal linen and he gives the instructions for it. Hard to know how you can paint on linen without selling it in some way you will find lots of instructions in modern textbooks and calcium carbonate still features!.","date":"2015-12-13","mins":"9:10 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"id":"comment-216406","author":"charles_freeman","post":"‘Aragonite gesso’ is worth googling..","date":"2015-12-13","mins":"11:56 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"id":"comment-216374","author":"charles_freeman","post":"But Colin, welcome out from the shed! They actually did gesso painted linens and it was a very skilled job. How else do you think they managed to get paint onto flags, banners an veils that were such a prominent part of medieval life? It is all well documented so why not do some homework on this? We do h ave a quotation from the 1570s ( in the bible Beldon Scott) with someone actually talking of the dangers of folding and unfolding the Shroud. This was common in the circumstances and we know of the very high attrition rate among painted linens. The few survivors we have today were usually pasted onto boards to stop the paint flaking. Of course in many cases the linens were painted for one big ceremonial occasion and were never designed to last. All there to find out about if you start on your homework!!.","date":"2015-12-13","mins":"7:49 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"id":"comment-216456","author":"charles_freeman","post":"David. It will need careful examination of all the depictions of the Shroud over the centuries , not copies , to determine if it was repainted. The best bet would be in the 1570s when the loin cloth appears to have been added and possibly the legs repainted further apart. This may have been to make the Shroud more visible to the large crowds now wanting to see it after its transfer to Turin. However, an enormous amount of research would need to be done on the depictions of expositions to see if this was the case. The layers of any repainting are easily detectable on surviving painted linens. Whether the latest scanners would be able to detect layers of pigments on the Shroud I don’t know One more area where research needs to be done!.","date":"2015-12-14","mins":"1:49 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"id":"comment-216903","author":"charles_freeman","post":"Final comment. Dan ends his post by saying that the ‘ watertight evidence ‘ might not be what I hoped for. I have read this blog for some time and no one has come up with any satisfactory explanation for the images – certainly none that anyone outside the Shroud community would accept, There is,I believe, a fundamental problem in assuming, by Colin and STURP and many others, that the Shroud is now as it was when it was made whether in the fourteenth century or earlier. This is extraordinarily unlikely unless the Shroud had been sealed in an Egyptian tomb. In fact, we know it has been exposed in the open air many many times. Fanti has got as far as accepting that linen degrades over time( although he has the bizarre idea that it degrades at a common rate does a linen stored in a container really degrade at the same rate as one left out in the rain?) Yet Fanti and others, including Colin, never imagine that images in that linen will also degrade over time. Until this is recognised Shroud studies are in limbo. One you look for alternative examples of images on linen, you find that painted images on linen were very common thousands are recorded in inventories ,etc.yet the attrition rate of the images was very high especially if the linen is folded and unfolded. This is why most painted linens were thrown away after they had fulfilled an immediate purpose. The question remains whether a painted linen, sealed and painted according to the medieval treatises, left any discolouration of the linen just below where the sealant was, and thus only on the top fibres of the linen Research on painted linens is comparatively recent as so few have survived but scanners are now able to analyse gessoes, pigments, repaintings, far beyond anything possible in 1978. At this point I have to hand over to conservationists who deal with these linens to see how far the Shroud fits as a once painted linen. I think it is promising and that with further research the Shroud will actually seem quite typical of the fourteenth century and while very rare of its type, not that much of a mystery at all. The iconography, with the pattern of bloodstains and the scourge marks both front and back, is certainly very typical of the fourteenth century. The Holkham Bible illustrations are helpful here. So we shall see but it certainly will not be a historian but linen conservationists who will provide the solution, one way or the other. Good luck to them and to Dan in his retirement!.","date":"2015-12-20","mins":"11:11 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"id":"comment-216372","author":"charles_freeman","post":"We will see no rush. These things tend to reveal themselves in time. The speed of research is so quick, especially on these art history objects as so much money is involved – we just hope for spin offs relating to the Shroud. As yet I have seen nothing in any of Colin’s posts which refutes the once painted hypothesis. Hugh is clearly thinking about it even if he does not agree with me. No doubt when Colin starts reopening his e mails he can set out why he is so certain that this was never a painted linen but I have never seen any evidence that he has read up on them. I think he does need to know something about them and why they disintegrated so easily before he comments further. Villers (ed.) The Fabric of Images is such a good starting point. And I was hoping too whether Colin could confirm that aragonite, as apparently found on the Shroud, is related to calcium carbonate. Perhaps Hugh can stand in on this if Colin is still out in his shed with his flour. I also assume that Colin believes himself to be the courier that everyone is keen to hear. I will leave others to judge that!.","date":"2015-12-13","mins":"7:21 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"id":"comment-170889","author":"charles_freeman","post":"John see my reply below. Directionless medieval painting on linen is quite common if the paint is applied in a fluid form. Examples given in Caroline Villiers book below. It is quite an important point for art historians because if they find paint without any brush marks they then can begin to understand how fluid the solution was when it was applied. So it is something that any conservationist working on a decayed painted linen will examine at the start if they are wanting to work on restoration of the original as it was painted e.g. They will try and reproduce the fluidity of the original paint solution on areas that have faded. It is obvious really that a very fluid solution will dry without any ev Idence of direction so I don’t see why it is such an issue ( or perhaps I do have some idea!) It certainly is not for those who have taken the bother to consult introductory books on painting on medieval textiles before they declare themselves authorities on whether there is painting on the Shroud or not..","date":"2014-11-12","mins":"3:26 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170886","author":"charles_freeman","post":"I am not really in here as I have too much on and am not worried if I cannot convince anyone of the paintings when other people I am talking to think it is quite obvious, if only from looking at the depictions in Beldon Scott. I also don’t think anyone will miss me and if I haven’t made my points by now I never shall. However, one of the books I have found most useful is edited by the late Caroline Villiers on medieval paintings on textiles. There are lots of essays on different paintings and it depends entirely on the fluidity of the paint whether there are visible brush stokes or not. If the paint is fluid then ,of course, it settles without brush marks, just as, to take an extreme example, water settles without marks on the surface. If, it is thicker however, the pigments will dry with the brush stokes intact. They give examples of both in the book from medieval textiles. So the directionless can simply mean that the paint was applied in a fairly fluid form. I would assume that Colin is reading all these books before he gets carried away with his own esoteric solutions. It really does seem that he hasn’t mastered the basics of medieval painting on linen yet but it might be wise to do so so that someone somewhere might take him seriously!.","date":"2014-11-12","mins":"3:12 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170892","author":"charles_freeman","post":"But O.K, what is your status in the academic community who know about medieval painting on linen? Why don’t they, with their expert eyes, have any problem in seeing that the images were originally painted when you do? That is the question that needs answering!.","date":"2014-11-12","mins":"3:31 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-171060","author":"charles_freeman","post":"David, How can you be so sure that a year working with experts in weaving , art iconography, medieval linen painting, etc, won’t bring the academic world closer to the truth about the Shroud? Suppose STURP’s dated 1978 tests are redone ( even though there is no evidence that the tapes have been preserved as an archive anywhere) and one does confirm that the calcium carbonate is not dust but gesso and thus evidence of painting? Suppose you get a group of experts in ancient weaving and they show physically that the Shroud could not have been woven on any known ancient loom but could be on a medieval treadle loom that was only known in Europe since 1000, how would you, with perhaps no experience of weaving at all, actually challenge this? A miracle weave? I am used to having my work assessed by professional experts in addition to those who are asked to peer review it. If I am found to have been deliberately deceiving anybody they will find me out and then you can all pelt rotten apples at me as I lie in the stocks. What would be the point of deliberately deceiving anyone anyway, what would I be hoping to gain?.","date":"2014-11-13","mins":"12:02 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-171094","author":"charles_freeman","post":"It is STURP that we have to thank for defining the superficial image on the weave as that is exactly how the medieval linens were painted so that flags and banners could flutter. If you find large quantities of calcium carbonate then it is indicative of gesso. So we have a start there. But my evidence comes from looking at the earlier depictions and descriptions and tying them into medieval iconography. This is all In my article so I will not repeat it. It adds up to me clearly that this is a linen that was originally painted in the fourteenth century. Every time I read of some other explanation of how the images got there, I feel more confirmed in my view. At least, after all these years of debate, if there was a consensus on how the images were formed other than through being painted on, we might be able to have a proper debate. I don’ think anyone here is going to convince anyone in the outside world that it was not originally painted unless they can provide a clear alternative. But Louis may be in luck. I was contacted on Monday by a TV producer who is hoping to recreate the Shroud from the weave onwards. The project seems to have been under way before he came across my article and he has started with contacting weaving experts it turned out that one of those I consulted myself had been contacted independently by him. And then they are going to paint the surface although I warned him that it was unlikely that there are many people around who can recreate a thin layer of gesso on to which the paint goes. It was apparently a highly skilled job with some craftsmen doing nothing else. Very difficult to keep it really thin but sealing the whole surface. He has the outlines of the images and the scourge marks and the bloodstains sorted out so he has clearly been doing his homework. I have no idea whether I shall be involved in this or not – he just asked me some quartos about my article and went on his way – so perhaps we will all wait and see in about a year’s time what comes out of this project..","date":"2014-11-13","mins":"3:16 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-157480","author":"charles_freeman","post":"One can have painted objects of veneration – as most icons are. Remember those who visited an exposition of the Shroud at Lirey after 1390 would have been told it was not authentic. Italy is still full of objects of veneration, many if them painted images, so if the Ahrpud were painted this would not rule out its veneration..","date":"2014-09-28","mins":"11:49 am","url":"https://shroudstory.com/2014/09/27/why-the-shroud-is-not-a-painting/","cat":"image_theory","title":"Why the Shroud is not a Painting"},{"id":"comment-186141","author":"charles_freeman","post":"It will have to be solved the same way as the dating of the Horses of St.Marks, where analysis of similar metal artefacts with gilding on them ( in the British Museum) pinned the date down to not earlier than the second century AD. Up to shortly before learned professors were arguing with a mass of evidence that the horses were third or fourth century BC but once they were matched with other examples the later than second century date was confirmed and I don’t think there are now any doubters. What was already known about the horses was sufficient and they did not need further examination to confirm the date. Similarly the Turin authorities may well find themselves outflanked by research on other linens..","date":"2015-01-25","mins":"7:30 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"},{"id":"comment-157481","author":"charles_freeman","post":"Sorry , typos. Typing on my I Phone..","date":"2014-09-28","mins":"11:50 am","url":"https://shroudstory.com/2014/09/27/why-the-shroud-is-not-a-painting/","cat":"image_theory","title":"Why the Shroud is not a Painting"}]
