[{"id":"comment-47352","author":"charles_freeman","post":"Many of the accounts of Charlemagne and his collection of relics from Constantinople were later medieval legends. The study on this is Matthew Gabriel and Jane Stuckey (eds,), The Legend of Charlemagne in the Middle Ages, Power, Faith and Crusades, Basingstoke, UK and New York, 2008. It is part of the consistent medieval practice of developing ‘backstories’ for relics for which there is no other historical evidence. The Shroud of Turin is interesting in that no one in the Middle Ages developed such a backstory, although the dukes of Savoy did later claim that it came from Cyprus (via Margaret de Charny) as part of the possession of the de Luisignan family who were kings of Jerusalem and they claimed that it had been given to them in the eleventh century by the patriarch of Jerusalem. (See John Beldon Scott’s, Architecture for the Shroud,University of Chicago Press, 2003 pages refs in the index under Lusignan.) To clamber back onto my hobby horse, yet another instance where the devotion to Ian Wilson has closed off research on alternative legends for the origins of the Shroud ( or at least, I have not come across any Shroud researcher other than the excellent Beldon Scott, whose book should be on every Shroud researcher’s shelves, who seems to be aware of this legend)..","date":"2013-10-13","mins":"6:18 am","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-150420","author":"charles_freeman","post":"Has there been any specific recent response from the Turin authorities on the C14 tests? The latest I have found was a robust defence of the testing procedures and the dates from Luigi Gonella himself published in Turin in 2000 – it is reproduced in Silvano Scannerini and Piero Savarino (eds.), The Turin Shroud: Past, Present and Future, Turin, 2000, pp. 507 13 and Gonella gives the impression he is deeply offended by the attacks made on the procedures..","date":"2014-09-12","mins":"6:06 am","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","title":"A Reason to NOT DO More Scientific Testing on the Shroud"},{"id":"comment-150457","author":"charles_freeman","post":"Gonella was defending himself against those who had criticised his role and the testing procedures as they were finally carried out. He was publicly defending a 1260 1390 date: so presumably he did not believe the Shroud was authentic.So was he representing just his personal view or was he the frontman for others? Obviously others know more about the politics of all this than I do..","date":"2014-09-12","mins":"9:21 am","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","title":"A Reason to NOT DO More Scientific Testing on the Shroud"},{"id":"comment-150751","author":"charles_freeman","post":"I thought that Nabber’s conspiracy theory was dead, killed by ridicule – how wrong I was..","date":"2014-09-13","mins":"1:02 pm","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","title":"A Reason to NOT DO More Scientific Testing on the Shroud"},{"id":"comment-30220","author":"charles_freeman","post":"I don’t know where D’Adamo got his theory from. If you research this you seem to get back to evidence from Hungarian burial archaeology but other than hearing a Hungarian professor dating AB to AD 900, partly on the grounds that AB has not be found in burials earlier than that and A and B groups have known to have mingled on the Hungarian plain around 900 and then Hungary went on to have the highest incidence of AB in Europe (over eight per cent), I have not got any further in finding academic backing. I am still looking I have ignored D’Adamo as I would not see him as a credible source in himself..","date":"2013-04-10","mins":"12:51 pm","url":"https://shroudstory.com/2013/04/09/an-important-distinction-in-catholic-theology/","cat":"news_&_views","title":"An important distinction in Catholic theology"},{"id":"comment-40021","author":"charles_freeman","post":"I agree that the TS was technically possible no problems there – but if you want large linen cloths just search ‘Medieval tablecloths’..","date":"2013-07-29","mins":"5:58 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","title":"And the problem is a four-pedal loom?"},{"id":"comment-40037","author":"charles_freeman","post":"No, of course not!! Simply that they did make large fine linen cloths in the Middle Ages, something that seemed to be challenged in another posting..","date":"2013-07-29","mins":"10:17 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","title":"And the problem is a four-pedal loom?"},{"id":"comment-40104","author":"charles_freeman","post":"DAVEB. If you are seriously into weaving you need access to the Cambridge History of Western Textiles, two volumes (2003). The section on the treadle loom, introduced in c. 1000 AD is important and is discussed on Volume One, pages 194 7. It could produce thin cloths, linen or wool or silk, up to 25 metres – the details are there. It came from China via Islam – probably the Shroud of Cadouin and the Veil of Apt were woven on treadle looms c. 1090 in Egypt. You can get the dimensions of fine medieval linen from making estimates from the table and altar cloths that were in linen and are known from many depictions. If they have figures with them you can work out the dimensions. There were also linen dossals and frontal pieces, which went behind and in front of altars, that tend to be rectangular. I am not relating this to the Shroud in any way but when I had a conversation with someone who recreates ancient weaving patterns, they said I had to master the different kinds of loom used in the ancient world before I could say anything of any value as different lengths, widths, and patterns were made by different kinds of looms.So perhaps your researches should concentrate on what type of ancient loom would have been needed to create a cloth the size of the TS. Over to you..","date":"2013-07-30","mins":"3:38 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","title":"And the problem is a four-pedal loom?"},{"id":"comment-128281","author":"charles_freeman","post":"There are issues involved with STURP. They took vital evidence in their samples from the Shroud, vital above all because these samples were taken from a number of different areas of the cloth. Ideally they should have been returned to Turin after analysis so that they remained there for future research. If not they should have been kept as an archive in museum conditions with controlled access for scholars but never dispersed as they appear to have been. I have shown one or two ‘expert’ friends parts of STURP reports and have been told that some of the problems of the Shroud reported by STURP could be quickly resolved by a 2014 lab. It is not difficult to relate the Shroud to the various ancient and medieval looms of which we have evidence. Some,for instance, would not have been able to weave a cloth of this length but as STURP had no ancient textile expert in their team this was never considered. Again there was no expert on medieval linen painting and the STURP physics and chemistry report specifically says that this area was not considered. Whether there are brush strokes on a printed linen depends on how liquid the paint mix was when applied, the more liquid the more likely it would settle without marks before it dried. In fact, conservation labs learn about the paint on a linen by seeing whether there are brush marks or not and from this they understand the formulation of the original mix. So absence of brush marks does not mean that the linen was not originally painted ( but, of course, it does not mean that it was!) again an expert would have known this. So let’s give STURP credit where it is due but note that science does not stand still and reports from 1978 have diminishing value. The team missed a lot of opportunities by not having a full range of experts in weaving and painted medieval linens. These do exist and could well provide valuable comparative material. Again one cannot give STURP many good marks if they have not preserved their valuable samples intact and together somewhere so that more sophisticated technology can be applied to them. Whatever Mc Crone’s problems he was able to make a comparative study of samples – is this still possible?.","date":"2014-06-10","mins":"4:58 pm","url":"https://shroudstory.com/2014/06/08/answering-charges-of-pseudoscience-bias-and-more/","cat":"news_&_views","title":"Answering Charges of Pseudoscience, Bias and More"},{"id":"comment-146818","author":"charles_freeman","post":"How do you file a canonical complaint? Do you have to fill in lots of forms in medieval Latin? The sponsorship always looked quite bizarre and I am only surprised that the IEEE ever signed up in the first place as I could not see how the Shroud fitted into its area of interest..","date":"2014-08-28","mins":"12:27 pm","url":"https://shroudstory.com/2014/08/28/breaking-news-on-the-bari-conference/","cat":"news_&_views","title":"Breaking News on the Bari Conference"},{"id":"comment-146827","author":"charles_freeman","post":"IEEE’s purpose. Mission statement IEEE’s core purpose is to foster technological innovation and excellence for the benefit of humanity. Vision statement IEEE will be essential to the global technical community and to technical professionals everywhere, and be universally recognized for the contributions of technology and of technical professionals in improving global conditions. Hard to see how this fitted in with research on the Shroud unless it became available for research by new technology. Would the core membership of IEEE agree that the authenticity or not of the Shroud is connected with ‘the benefit of humanity’ or ‘improving global conditions’? All rather strange..","date":"2014-08-28","mins":"1:20 pm","url":"https://shroudstory.com/2014/08/28/breaking-news-on-the-bari-conference/","cat":"news_&_views","title":"Breaking News on the Bari Conference"},{"id":"comment-50403","author":"charles_freeman","post":"‘The concept that it should pass to a secular guardian such as the British Museum or the even the Smithsonian is simply unacceptable’. From John Klotz’s blog. I am not sure what you mean by this, John. Do you think they will falsify the evidence? Perhaps there is a conservation lab in Italy ( and a lab specialising in ancient textiles is needed to ensure that there are trained people who know all about non invasive techniques on these fragile items) who are all good Catholics and they will be acceptable to you..","date":"2013-11-08","mins":"5:25 am","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-50419","author":"charles_freeman","post":"Kelly. I have worked intensively on relic cults and I think that the number of people, especially in a Europe where we have grown up with such things, who believe that the Shroud is authentic are very few. The same goes for any other pre medieval relic although I have a Roman archaeologist friend who confirmed that one of the several Holy Lances is indeed a Roman lance. So ‘saving the masses from a possible delusion’ is not really an issue because very few are deluded ( or not as the case may be) in the first place. The vast majority of those who believe the Shroud is authentic come from other climes. In medieval times, the Shroud was never an important cult (one of the criticisms of it was that John would have mentioned the images on it in his gospel if they had been there on the original), it becomes one when the Savoys take it over and make it such a central theme of their royal prestige. In this sense its heyday was the seventeenth century when it was exhibited to vast crowds almost every year. I like the Shroud as a subject because, despite it not being seen as important in its day, there are lots of issues surrounding the nature of its weaves, the actual history itself,the iconography of the Shroud and what it might actually have been if not originally a grave cloth. I am just hankering after some proper tests so that I can have more evidence to work from. So my ‘personal’ interest is as a historian who has specialised in relic cults, and sees some unresolved issues here that interest me. So I keep an eye on these debates and contribute when I feel i have something to offer (as in areas where i would like to see further research). Despite the odd snipe at me from some contributors, I congratulate Dan for keeping things as open as they are..","date":"2013-11-08","mins":"8:03 am","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-50412","author":"charles_freeman","post":"‘Frankly, Charles, your previous remark about the character of Shroud students being evil really makes me question you bonafides as an impartial skeptic. The statement is balderdash.’ I made it quite clear, and this for the third time, that that is what you can gather if you see how some contributors refer to their opponents. If you read some of the things said about me by commentators, you would really think I was some kind of nefarious character instead of a bone fide historian who has been genuinely trying to add to the debates despite my scepticism over the authenticity of the Shroud. I particularly objected to the way that research conducted by sceptics is challenged not on its own worth but on the grounds that the researcher has some kind of personal agenda that has skewed the results he or she has come up with. That is why I made the satirical comment that everyone who seems to be involved in Shroud research seems to be some kind of evil character, well, at least according to their opponents!!.","date":"2013-11-08","mins":"7:12 am","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-50422","author":"charles_freeman","post":"‘Clement carefully cadged his approval of he Shroud so as not to approve of authenticty claims because the Church was still seeking reunion with Orthodox and a claim that it was an authentic artifact of Christ would engender Orthodox demands for its return. (Which would have by the way made in vulnerable to the Islamists armies who were on the move.) Do you have any thoughts on that.’ Even if the Shroud came from Constantinople, which is disputed largely because there is no record of it having done so (the missing years), it was one of many thousands and certainly by no means the most prestigious. One has to remember that in the hierarchy the Cross and the Crown of Thorns ( that ended up in the Sainte Chapelle in Paris) were higher up than the various shrouds that were around. Even if the Schism between east and west had been settled (as was attempted in Florence in 1439) no local church would ever have surrendered up its relics, certainly not the French kings and other potentates who had the best ones! This is what gave a church or ruler status. I think the real problem that Shroud researchers often have is to think that the Shroud was considered as important before the sixteenth and seventeenth centuries when it got a powerful backer in the Savoys. Clement was probably overwhelmed with requests to have relics of all sorts proclaimed authentic and popes typically hedged their bets according to which kings or nobles they needed to please. Clement never saw the Shroud, he would have known that it was one of many shrouds, no one could tell where it had come from,and there was the problem of the unrecorded images so I suspect that he just wanted to keep things calm!.","date":"2013-11-08","mins":"8:25 am","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-50525","author":"charles_freeman","post":"Ancient linen textiles are being worked on all the time in laboratories. Start with the people who have expertise in this area and know how to be non invasive and work from there. As I understand it, the STURP teams did not have a single member with experience of examining ancient textiles and how to take samples from them in a non invasive way. The 32 tapes are the only body of evidence on the Shroud outside Turin but it does not seem clear where they are , how they are conserved and who has access to them. It is STURP’s responsibility to come public on this if it wants to be taken seriously. If it can’t show that it knows how to look after these samples and that it has a transparent policy of allowing access (as any responsible museum would have) we will be back with the great Dead Sea Scrolls scandal..","date":"2013-11-09","mins":"5:07 am","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-50537","author":"charles_freeman","post":"So what happened to the 32 tapes ( and I know the problems/trail of the Frei tapes which were, of course ‘lifted ‘ separately and which many do not consider authentic anyway)? Rogers refers to the 32 tapes in his 2005 article. They are after all the only evidence outside the Jull radiocarbon sample that are, or were, available for more study and are as such valuable. There were apparently at least 8,000 fibres on them and they were especially important because they were taken from different parts of the image and non image sections of the Shroud and so would allow further comparative tests to take place (if they were still available). I hope that they were not binned when STURP disbanded!.","date":"2013-11-09","mins":"7:53 am","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-50538","author":"charles_freeman","post":"It is confusing as STURP is said to have officially disbanded in 1981 but they pop up again expecting to to be involved in the radiocarbon tests. So when did they actually disband and as I have said, how did they make provision for the conservation of the tapes when they did so?.","date":"2013-11-09","mins":"7:57 am","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-50544","author":"charles_freeman","post":"Yes, I know that but I also have read the articles that cast critical light on the Frei samples and there is a lot of explaining as to why he found pollens that no other examination did and why so many were insect borne anyway. It is only Kelly who referred to Frei I was interested in the 32 STURP tapes as they contain potentially so much information. I don’t know what the actual legal agreement between STURP and the Savoys/Turin authorities stipulated but if the agreement was with STURP the Turin authorities missed a trick when they did not ask for the samples back when STURP disbanded. (Gilbert Raes sent his samples back when asked to do so but, as we all know, that was not quite the end of the story….) These are important issues but they are seldom clarified..","date":"2013-11-09","mins":"8:29 am","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-50648","author":"charles_freeman","post":"Kelly, I am sure I have not read everything – most books about the Shroud are very repetitive and add nothing to our knowledge but perhaps John Klotz will make a break through. (Heller and Gove are the more readable and informative.) Clearly whatever happened to the tapes on the disbandment of STURP they do not seem to have been made over to a public institution that could care for them and make them available for scholars to examine. This is a pity as if they have been kept in pristine condition and together, new tests would certainly add new information about the Shroud. I once worked on a US led archaeological dig in Turkey. We were allowed to take materials out of the country for testing on condition that they were returned.I wish the same had happened here but clearly the deal was done otherwise and so we have a fragmented Shroud. No one here seems to mind much. (One of my first jobs when working as a ‘slave’ – I suppose ‘intern’ nowadays, in Rome, in 1966 was packing away gold fibulae from Etruscan tombs and I was taught how vital conservation and labelling was because one would never know who might one day want to examine the finds.) Even if I was granted access to the tapes I don’t have the expertise to do any new tests so I just made the enquiry as a matter of interest. I do hope the wrangling about the radiocarbon dating can stop – we have passed the 25th anniversary. Even if the tests are declared invalid there is not a scrap of evidence from the tests done by the labs to date the Shroud to the first century so why go on about them, Even a patch, that no one who has examined the Shroud close up ( e.g Flury Lemberg) can see. Might simply have been a sixteenth century repair of a cloth made two hundred years before. The atmospheric palynologist, Dr. A. Orville Dahl, surveying the Frei tapes, pointed out that no less than 32 of the 57 pollens could only be deposited by insects – rather than blowing in on the wind as Frei suggested. Dr. Dahl put it cautiously when came to the conclusion that the pollen was not ‘due to wind borne deposition but to human activity of some sort.’ I am not one for conspiracy theories but I admire his restraint!.","date":"2013-11-10","mins":"1:59 pm","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-50410","author":"charles_freeman","post":"John sorry you had a broken night and we look forward to the great book when it is out. It is just that some of us are already into the day whether there is sand in our Vaseline or not (didn’t know that one!). But seriously, the option of shutting up all scientific testing on the Shroud is a possible one to take and then everyone can go on arguing for another twenty five years about the radio carbon ‘fiasco’. De Wesselow said something about it being one of the greatest scientific frauds of all time. That showed he knew very little about the lively history of scientific fraud and sadly he never explained who was being fraudulent (you have the book, i binned mine, so perhaps you know) but he rather lost me there. Meanwhile there are just so many areas of research that people could be getting on with in the archives in the cities of northern France. (Troyes has a lot still to explore.) I keep throwing them in. So Margaret de Charny said that her grandfather Geoffrey got the Shroud as ‘a spoil of war’. Some researchers have followed him to Smyrna but the war that he was actually fighting in the early 1350s when the Shroud is first documented was against the English in northern France. So was the Shroud originally among the loot taken from one of the collections of relics that are documented in northern France as coming direct from Jerusalem, even ‘the Lord’s Tomb’, in the second half of the first millennium? It is unlikely but these are the leads to be followed up. Following an earlier discussion, if the thread in the Shroud is Z spun then it is unlikely (stress unlikely) to have been made in Palestine. So who, among those who think it is first century, is going to do the work on early first century trade within the Roman empire that might pinpoint its origins. There’s tons of new shipwreck evidence for trade. Certainly we have Greek imports to Judaea and the mainland Greeks seem to have used Z spin. So go for it and let’s break this endless wrangling about test results that are long since passed their validity date. The Shroud is supposed to have had more tests done on it than any other artefact in history and yet there are major areas of research into its origins that seem untouched. Will your book actually say anything new so that we can move on a bit?.","date":"2013-11-08","mins":"6:33 am","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-191889","author":"charles_freeman","post":"As everyone knows I have strong doubts about the authenticity of the Shroud but if you believe it is authentic, you also have to show the flagellation as affecting the whole of Jesus’ body, front and back, top to toe – unless you happen to believe that the criss cross of flagellation marks were a later addition…...","date":"2015-02-26","mins":"10:12 am","url":"https://shroudstory.com/2015/02/25/cnn-is-laying-it-on-thick/","cat":"other_sites","title":"CNN is Laying It On Thick"},{"id":"comment-191906","author":"charles_freeman","post":"Max, I was not referring in this instance to James Marrow, a far greater expert in medieval iconography and Passion narratives than either of us. ( I assume you have read Marrow in detail it is quite a long study in order to comment that his is ‘a forced interpretation’. He brings in a lot of supporting material from his own archival work and certainly there seems enough evidence to suggest that his interpretation is anything but ‘forced’. It is not me who wants to believe that Isaiah 1.6 is a premonition of the Passion. As Marrow shows this was a specifically fourteenth century interpretation of that verse and he gives archival and iconographical evidence in support.) No, I am looking at the Shroud itself. Barbara Faccini’s interpretation of the marks of the flagellation claims that ALL the marks on the Shroud are the direct result of three specific instruments. If she is right (and perhaps she is not), then any representation of the flagellation must show Jesus bound in such a way that the flagellation can mirror the marks on the Shroud in that the instruments used must reach front and back. If you click in to the posting you find a flagellation image where this would have been impossible so it is perhaps by someone who has not absorbed how the flagellation would have taken place if the Shroud is authentic.There is no need to illustrate the flagellation but if you do, and believe in the authenticity of the Shroud, then you have to show how the scourge marks or whatever on the Shroud, were possible..","date":"2015-02-26","mins":"1:27 pm","url":"https://shroudstory.com/2015/02/25/cnn-is-laying-it-on-thick/","cat":"other_sites","title":"CNN is Laying It On Thick"},{"id":"comment-191953","author":"charles_freeman","post":"Did Donna Campbell find any cotton threads?.","date":"2015-02-27","mins":"7:38 am","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192024","author":"charles_freeman","post":"One must remember that Gonella was vigorously defending the r c date as late as in his paper printed in the proceedings of the Turin Conference of 2000. As he died only in 2007, one wonders what he made of Roger’s paper of 2005 which would appear to challenge his own hands on (literally it seems) view on the matter..","date":"2015-02-28","mins":"10:20 am","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192018","author":"charles_freeman","post":"There is no point messing about with threads and fibres whose origins cannot be checked. The only way to see if there is cotton woven into the Shroud is to examine a woven piece, either a piece left over from the carbon dating or the Shroud itself as Flury Lemberg and other experts did in 2002 making clear that no reweaving could possibly have been concealed and there was none to be seen. And there is the important article from the CIETA bulletin of 1989 in which Vial explains how the major differences in the thickness of the threads used in the original weave make a regular pattern unlikely. These are all experts working from the Shroud itself or a woven sample of it so they must be given credence over those who have had no specific experience of dealing with ancient or medieval textiles or have never examined a woven piece of the Shroud close up. I am open to correction but am not aware of any of these experts who has found any cotton woven into the Shroud. Oxford spotted ( not that difficult) and removed for independent testing the one fibre of cotton they found so one can assume that there was no cotton left in the sample they actually tested. Flury Lemberg knew of Rogers’ article as she refers to it in her own article on the reweaving hypothesis and, following her actual examination of that corner of the Shroud, she roundly refuted it. It was not that difficult to test out on the actual Shroud, of course..","date":"2015-02-28","mins":"9:01 am","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192109","author":"charles_freeman","post":"As Thibault notes, you do not have to be an expert to spot the difference between cotton and linen which makes it easy to check out Rogers’s hypothesis on the Shroud itself or any other woven pieces from it. Also it meant that the labs could spot it as well before they did the dating. So unless you are accusing Oxford, Tucson and Zurich of deliberately concealing the cotton they must have been able to see……. Raes only mentions ‘ traces of cotton fibres’ and leaves it open how far these spread. With the massive increase in imports of raw cotton to Europe after 1200 and the custom of spinning and weaving both in the same room (and sometimes as in fustians alternating cotton and linen threads) it is hardly surprising to find ‘traces of cotton fibres’ in the Shroud established within the cloth during the spinning and weaving process. But this is just what Raes suggested. As different skeins of yarn were used in the weaving of the Shroud as the banding shows, some may have been in environments where cotton fibres were drifting around and others not. I think without having any of my sources at hand that Raes thought the fibres may have been left in the loom from an earlier cotton weave. All speculation, of course. The fundamental problem is that there is no evidence of sufficient amounts of cotton to sway a carbon 14 date..","date":"2015-03-01","mins":"12:46 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192150","author":"charles_freeman","post":"No one disputes the presences of cotton fibres when one realises just how often flax and linen were spun and woven in the same workshops especially after the massive influx of imported raw cotton into Europe after 1200. The question is whether there was enough to sway the carbon dating samples. Judging from your looking for needles in a haystack work, it seems clearly that there would not be. Time to move on on this one..","date":"2015-03-02","mins":"2:29 am","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192151","author":"charles_freeman","post":"Sorry flax and cotton..","date":"2015-03-02","mins":"2:30 am","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-51570","author":"charles_freeman","post":"I was delighted to see that the Shroud of Turin is another of those ‘blood’ relics whose blood liquefies. They were very common in the Middle Ages an, in fact, having the blood of Christ in liquid rather than dried form was often taken as a mark of authenticity. (The true blood of Christ would never solidify this was the selling point of the monks at Weingarten in Germany who had the blood that had come out of the side of Christ and was still liquid to prove it one reason perhaps why the Shroud was never in the top class of blood relics.) Here were have a case, like that of the blood of St. Januarius in Naples, when the blood only liquefies on special occasions but is able to replicate itself on a contact relic that then becomes a relic in itself. Not unusual but good to add to the story of the Shroud. I deal with the medieval blood cults in Chapter Nineteen of my Holy Bones, Holy Dust, ‘The Wondrous Blood of Christ’. I have not as yet come across any member of the STURP tomb ( here apparently still active in 1986) who knew anything about medieval relic cults so I wonder how they dealt with the matter. Anyone know who was involved?.","date":"2013-11-16","mins":"4:44 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","title":"Copy of the Shroud of Turin in New Jersey"},{"id":"comment-51615","author":"charles_freeman","post":"Hugh.You have made the right points. This is how relic cults work – the myths just develop, as it appears that Zugibe developed this one, and their origins can no longer be traced but if people want to believe that they are miracles they will and the story will go on growing. I am glad that Kelly has told us that he believes in the possibility of miracles because that helps understand his approach.Any event for which one can not find a physical explanation can potentially be the result of a miracle. So if, as yet, we have no scientific explanation for the images on the Shroud , Kelly can keep open the possibility that they are the result of some miracle. Hard nosed Brits like myself, living in a country that simply gathered up all relics and burned them in the 1530s, take another approach – we don’t understand ‘x’ but there are lots of things we didn’t understand in the past, we do understand now as a result of scientific developments, so why not the Shroud? This does not mean that relic cults, the way they arise and grow and why some become worldwide phenomena and others disappear is not a fascinating topic at least fascinating enough for me to have spent many months researching and writing about it. I repeat that I am delighted that the Shroud has been behaving like a good medieval relic should and transferred itself onto a copy that has now achieved veneration in its own right with a storyline that seems to have been boosted further by Fred Zugibe. What will we be saying about the Shroud in fifty years time or will it be one of those cults that simply disappear like so many others in history?.","date":"2013-11-16","mins":"10:28 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","title":"Copy of the Shroud of Turin in New Jersey"},{"id":"comment-51622","author":"charles_freeman","post":"The problem with the science is that there is as yet nothing to date the Shroud to that narrow window of 1 35 AD. So it is a question of leaving the question open,as I do, though I suspect the science will eventually come up with a ‘medieval’ solution, or come out in favour of authenticity. Clearly if one believes in the possibility of miracles then the lack of any scientific support for a first century date is not so important..","date":"2013-11-16","mins":"11:18 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","title":"Copy of the Shroud of Turin in New Jersey"},{"id":"comment-51584","author":"charles_freeman","post":"Typo – yes ‘team’. Apologies. ‘Any tests that were done would be considered incompetent, inconclusive, etc’ Well, we wouldn’t know until we had read the report whether they met normal levels of scientific objectivity(over to you Colin) but as a historian working largely on medieval relic cults, it is good to see stories about the Shroud that echo those of other medieval relic cults. It makes me feel quite at home when so many reports on the Shroud treat it as if it were the only relic existing in medieval Europe so that, despite there being thousands of documented medieval cloths, linen and silk mainly, with images on them,when a report of one, such as that by Robert de Clari, is found, it is assumed to be the Shroud!.","date":"2013-11-16","mins":"6:58 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","title":"Copy of the Shroud of Turin in New Jersey"},{"id":"comment-51586","author":"charles_freeman","post":"So what do you think,Kelly, about ancient blood, apparently dried, that comes damp to such an extent that it can be transferred onto another piece of cloth? It is common enough in medieval Europe to read of such things which is why I feel quite at home with it and don’t think of it in scientific terms at all. But the STURP TEAM (raised no doubt from the TOMB of their disbandment of 1981) apparently did think of it as a ‘scientific’ happening. So if the two bloods are the same,what is the mechanism through which the dried blood of the Shroud transferred itself to the nuns’ copy?.","date":"2013-11-16","mins":"7:04 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","title":"Copy of the Shroud of Turin in New Jersey"},{"id":"comment-51589","author":"charles_freeman","post":"Co;in, It looks here as if the nuns’ copy has been placed face up and the blood has seeped in from the back. Normally someone trying to transfer the potency of a relic would have put their own image directly onto the face of the Shroud. But I am always scrupulously careful not to say this sort of thing about a relic unless, as in the rare case of the Shroud, it has been adopted as an object of scientific research..","date":"2013-11-16","mins":"7:29 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","title":"Copy of the Shroud of Turin in New Jersey"},{"id":"comment-138723","author":"charles_freeman","post":"‘The fact that the TS has been conserved up to now could either imply that it is a fake that goes far back in time or it is the true linen in which the corpse of Jesus Christ was wrapped.’ Not quite true. In January 1390 the (anti ) pope Clement VII decreed that the Shroud might be exhibited at Lirey so long as it was announced to the assembled crowds ‘in a loud and intelligible voice’ that ‘the Linen with the imprints is not the Shroud of Christ but a copy and representation made in imitation of the Shroud of the same Lord Jesus Christ.’ Six months later, June 1st, there was a further papal bull in which indulgences were allowed to those who visited the Shroud at Lirey. This implies that for reasons lost to us the Shroud was seen as an object of veneration as an icon might be. This would have been enough to justify its conservation. As I have said before, we would love to know why exactly the Shroud was given this papal indulgence while at the same time being seen as not genuine. I have never seen anyone tackle this important issue.Too late to present it at either of the conferences..","date":"2014-07-16","mins":"10:06 am","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","title":"David Roemer’s Rejected Paper"},{"id":"comment-194479","author":"charles_freeman","post":"SDJJ If you access Charles Freeman Origins of the Shroud of Turin in the English journal History Today you will find some of the descriptions that show,indeed, that observers of the Shroud did comment on the vivid nature of the blood on the Shroud in the fifteenth and sixteenth centuries. This was the age when paintings showing extensive blood of Christ, especially those showing Christ still bleeding even after he was dead, were very common. Good luck with your researches..","date":"2015-03-26","mins":"10:32 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"id":"comment-194492","author":"charles_freeman","post":"SDJJ. It is just as important to read the work of professional historians who have different ideas from Mr. Wilson and it is important also to wonder why his views do not have any support from professional academics. It is just a question of keeping your mind open..","date":"2015-03-26","mins":"1:03 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"id":"comment-196383","author":"charles_freeman","post":"I know the Convent of San Marco well as it is one of my favourite places in Florence. As you climb the stair you are greeted with a lovely Annunciation at the top by Fra Angelico and then you go round the cells in each of which there is another fresco by Fra Angelico who was a monk there. So it is good to see that the convent is lending out one of his works. I would,however, be intrigued to know on what basis ‘experts’ consider that Fra Angelico saw the Turin Shroud. There is no record that he ever travelled outside Italy and at this period the Shroud was still in the possession of the de Charny family in France. His iconography of the laying out of Christ is conventional for medieval western art in that Christ is being laid out on a single sheet with no images and the body on the Shroud has nothing to suggest the markings of the Shroud. So a bit of a mystery here unless we can find the ‘experts’ to explain their view..","date":"2015-04-15","mins":"5:22 am","url":"https://shroudstory.com/2015/04/15/fra-giovanni-angelicos-lamentation-to-be-displayed-with-the-shroud/","cat":"2010","title":"Fra Giovanni Angelico’s ‘Lamentation’ to be Displayed with the Shroud"},{"id":"comment-196385","author":"charles_freeman","post":"Sorry, the first comment did not get through but it has now! Forgive the repetition!.","date":"2015-04-15","mins":"5:29 am","url":"https://shroudstory.com/2015/04/15/fra-giovanni-angelicos-lamentation-to-be-displayed-with-the-shroud/","cat":"2010","title":"Fra Giovanni Angelico’s ‘Lamentation’ to be Displayed with the Shroud"},{"id":"comment-196384","author":"charles_freeman","post":"I know the Convent of San Marco well as it is one of my favourite places in Florence. Fra Angelico was a monk there and painted frescos in each of the cells. So it is great that they are lending out one of his paintings for the exposition. However, I would be intrigued to know on what basis ‘experts’ consider that Fra Angelico saw the Shroud. There is no record that he ever left Italy and at this time the Shroud was still in France in the possession of Margaret de Charny. Moreover, Fra Angelico follows convention in showing Christ being laid out on a single sheet with no images on it. The marks on Christ’s body correspond in no way with those on the Shroud there are no flagellation makes on the front of the body, for instance. So I look forward to hearing the ‘experts’ case on this one..","date":"2015-04-15","mins":"5:28 am","url":"https://shroudstory.com/2015/04/15/fra-giovanni-angelicos-lamentation-to-be-displayed-with-the-shroud/","cat":"2010","title":"Fra Giovanni Angelico’s ‘Lamentation’ to be Displayed with the Shroud"},{"id":"comment-196411","author":"charles_freeman","post":"The 1440s were just the time when Margaret de Charny was in dispute with the canons at Lirey over ownership of the Shroud and in 1449 the bishop of Liege refused to accept that it was authentic when she tried to display it. So it is unlikely that the devout Beato Angelico would have paid any special attention to it even if we did have any evidence that he was ever in France. Other than the pilgrimage badge, I don’t know of any artist copying the Shroud (e.g. Size, double image) until the sixteenth century. Still, let’s enjoy the Lamentation as a great extra for those visiting the Shroud. No need to try and link the two but I would still like to hear why ‘experts’ think that there is a link. There are many examples of all over scourge marks, squiggles of blood on the forehead, blood along the arms from after 1300 and a single sheet for the burial, so no signs that Beato Angelico is operating outside the artistic conventions of his time..","date":"2015-04-15","mins":"9:25 am","url":"https://shroudstory.com/2015/04/15/fra-giovanni-angelicos-lamentation-to-be-displayed-with-the-shroud/","cat":"2010","title":"Fra Giovanni Angelico’s ‘Lamentation’ to be Displayed with the Shroud"},{"id":"comment-196515","author":"charles_freeman","post":"So, Nabber, for once, we are in total agreement: that this is not the Shroud. Still interested to know why ‘experts’ think that Beato Angelico had seen it..","date":"2015-04-16","mins":"8:57 am","url":"https://shroudstory.com/2015/04/15/fra-giovanni-angelicos-lamentation-to-be-displayed-with-the-shroud/","cat":"2010","title":"Fra Giovanni Angelico’s ‘Lamentation’ to be Displayed with the Shroud"},{"id":"comment-178205","author":"charles_freeman","post":"Having done work in getting students to asses material and arguments critically, with appropriate material developed to help them, It does not seem that there is sufficient evidence to make valid judgements in the questionnaire so I am not sure how any serious findings on cognitive responses are going to come out of it. How is the sample selected? Where is it being advertised other than here and the Holy Shroud Guild website. Is it specifically a survey of readers of these sites and, if so why? I cannot imagine anyone who does not know the Rogers’ paper and the background to it in considerably more detail than provided here would be able to make head or tail of the issue in Part Two. Perhaps someone can tell me where peer review comes in are the respondents to the questionnaire the peers? Is it a judgement of whether Rogers was right in believing that he had representative samples ( or unrepresentative samples) – yes ,there is a lot of confusion here. If this had been one my students compiling a similar survey, I would certainly have expected a lot more clarity about its purpose and how the limited number of questions related to COGNITIVE responses. The intelligent response in most cases would simply be ‘ not enough evidence to be able to make an assessment’ and this is hardly helpful to the questionnaire..","date":"2014-12-21","mins":"10:47 am","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help"},{"id":"comment-178356","author":"charles_freeman","post":"Good luck with it and I hope the results provide you with the help you need..","date":"2014-12-22","mins":"3:13 am","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help"},{"id":"comment-173038","author":"charles_freeman","post":"My researches on epitaphioi took me to the recent book Warren Woodfin, The Embodied Icon: Liturgical Vestments and Sacramental Power in Byzantium, Oxford , 2012, pages 122 9. I only consulted it in the Cambridge UL so I am unable to answer your question. However, they did have the stone on which Christ was lain in one of the churches of Constantinople and ceremonies around this were especially sacred. Here are ,of course, many things from the 1204 sack of Constantinople in Venice so I would assume that this was how the epitaphioi got there..","date":"2014-11-26","mins":"2:34 am","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","title":"How to Become Famous"},{"id":"comment-172697","author":"charles_freeman","post":"I, for one, can hardly complain if Colin wishes to provide material to the Wikipedia site but I have provided a link to an article that was published in a respected history journal and which has, according to the Editor, had 20,000 hits. The article was read by expert advisers at my request and I assume, from the two month delay after I submitted the article to History Today before acceptance, peer reviewed by their advisory committee. It is entirely up to the editor of the Wikipedia article ,of course, but might I suggest that Colin provides some evidence that he has academic support for his theories or we will have Stephen Jones joining in too..","date":"2014-11-23","mins":"1:19 pm","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","title":"How to Become Famous"},{"id":"comment-172700","author":"charles_freeman","post":"I see that the summary of my article on Wikipedia has been deleted by someone called Stetson7. I am not gong to reinsert it as it has already had very wide publicity ( note the 20,000 hits on History Today) and I could not have wished for more. I assume that an editor might reinsert it but I will leave it up to them..","date":"2014-11-23","mins":"1:32 pm","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","title":"How to Become Famous"},{"id":"comment-172716","author":"charles_freeman","post":"Don,I do think that the best fit explanation of the original images on the Shroud is a painting but medieval pigments would have fragmented into tiny particles, not flaked. They leave a faded image as in the Zittau Veil if you want an example to compare the Shroud with. However, leaving aside painting and looking at the Shroud today and seeing the all over scourge marks, these are not known in images of the dead Christ before 1300. If the Shroud was earlier than that then no one seems to have realised that the scourging was all over the body so had they seen e Shroud or not? Or perhaps, artists started copying the Shroud’s scourge marks only for the first time after 1300. Or maybe, just maybe, the images on the Shroud were made by someone after 1300 who was following the new trend that seems to have been sparked off by Isaiah 1.6..","date":"2014-11-23","mins":"5:14 pm","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","title":"How to Become Famous"},{"id":"comment-57087","author":"charles_freeman","post":"Surely the real problem here is that Habermas and his questioner had not sorted out a suitable soundbite coherently delivered. Why did he not write down the points he wanted to make, absorb them , do one or two test runs before going for it as most people do in such circumstances. Whether you agree with him or not, it was a wasted opportunity. I had to do an interview with very short answers for a television documentary the other day and if I fluffed my lines, they made me do it again three or four times on one occasion! Anyone heard more about Fanti’s dating who accepts it as authoritative?.","date":"2013-12-07","mins":"8:13 am","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes"},{"id":"comment-72715","author":"charles_freeman","post":"If the simplest answers are the best , then researching the relics from the ‘Lord’s Tomb’ that are documented as arriving in northern France DIRECTLY from the Holy Land in the second half of the first millennium close to Lirey is obviously far simpler than suggesting 1) 550 years of unknown provenance for the Shroud. 2) Very tenuous evidence indeed that the Shroud is the Image of Edessa. 3) No reliable evidence for the provenance of the Shroud between 1204 and 1355. The reference for those who want to follow this up is ‘Hagiographical horizons: collecting exotic relics in early medieval France’ Chapter Ten , in Michael Mc Cormick, Origins of the European Economy,Cambridge, 2001. Margaret de Charny climbed that the Shroud came to her grandfather as ‘a spoil of war’. She may or may not have been correct but the most likely wars were those in which Charny fought ( and died at Poitiers in 1356) in northern France in the 1350s about the same time as the first documentation for the Shroud. These cities were being fought over and certainly relics were an acknowledged spoil of war( compare the Crusaders in 1204), so it would not be unusual for a relic captured by one side or the other in these protracted wars to be taken as a spoil of war. Lots more research needed but so far I have never read that de Charny may well have gained the Shroud when he was fighting the English but this is what he was doing at the time when he he seems to have first got it and his grand daughter may have been right all along!!.","date":"2014-01-09","mins":"7:42 am","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","title":"Keep it Simple: Can Anyone Help?"},{"id":"comment-72716","author":"charles_freeman","post":"Sorry ‘claimed’ not ‘climbed’!.","date":"2014-01-09","mins":"7:43 am","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","title":"Keep it Simple: Can Anyone Help?"},{"id":"comment-72739","author":"charles_freeman","post":"John an interesting case study. Unhappy as I am with the Edessa theory which has been around for many years without finding a single specialist in this period of Byzantine history/ Byzantine relics to support it, I am simply interested in alternatives that may have more to back them and be in general more plausible. As the Shroud of Compiegne, also in northern France, showed, once a relic was in the possession of a church, in this case since 876, it tended to be looked after and this is a crucial point with linen that is so vulnerable to damp. The survival of a linen cloth over two thousand years has always been a a crucial difficulty (if not always acknowledged as such) for those who think it authentic and so one must look for places where it may have been safely stored( I am not convinced AT ALL by that gateway in Edessa as a dry storage space!). Northern France was rich in relics including those of the Passion. One thing that amazes me is that we are constantly told that the Shroud is the most researched artefact in history and I, admittedly not from wide reading, have never seen a single account that discusses this possibility that it was among the relics that came directly from the Holy Land to northern France hundreds of years before the Crusades. Again, as I have said earlier, I have never seen a single account that suggests that de Charny may have won it as ‘a spoil of war’ in the wars with the English that took up the last years of his life and fit exactly with the dates of first account of the Shroud in his possession. I doubt whether we would be able to confirm any of this but it stares me in the face as many times more likely that the Edessa route. Perhaps Hugh can use his editorship to put together some of these alternative routes (another is the influx of relics to the Blachernae chapel in Constantinople in the fifth century directly from Jerusalem when Jerusalem was still part of the Byzantine empire we all know what was seen in that chapel by Robert de Clari eight centuries later and it would have been kept safe from damp here as well!)..","date":"2014-01-09","mins":"11:08 am","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","title":"Keep it Simple: Can Anyone Help?"},{"id":"comment-196190","author":"charles_freeman","post":"I am not sure what Willard Libby had to do with the 1988 testing as he died in 1980 perhaps an intervention disputing the findings from on high. Anyway good news that the archbishop seems open to new testing there are lots of respected conservation labs able to do it..","date":"2015-04-13","mins":"4:02 am","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","title":"More Testing? Maybe."},{"id":"comment-196293","author":"charles_freeman","post":"Thanks, Dan. A good place to start is Caroline Villers’ (ed.) The Fabric of Images : European Paintings on Textile Supports in the Fourteenth and Fifteenth Centuries (Archetype Publications, 2000). The essays here have a lots of information on all these issues, many of them from experts who have been working on repairing decayed painted linens. There is a new Archetype volume on painted linens out last year but it is too expensive for me at the moment and i am trying to track down a library copy. If you google ‘medieval painted linens’ you get a variety of papers showing just how prevalent painted linens were in the medieval period. The journal Medieval Textiles also has articles.I liked the discussion of painted wall hangings in York by Dr. Charles Kightly in the June 2001 edition. He shows how vulnerable the painted surfaces were so that despite the many wall hangings mentioned in medieval inventories we do not have a single English survival today. However, my point is that it is clear from these articles that there are a number of people involved in the restoration of painted textiles and that one would hope that they would be involved in an ideology/preconception free analysis of the Shroud..","date":"2015-04-14","mins":"5:14 am","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","title":"More Testing? Maybe."},{"id":"comment-196219","author":"charles_freeman","post":"Since there has been a great deal of work done on ancient linens in recent years, including many with images on them, one would hope that there would be comparative studies with these as well. STURP famously said that it had not examined any painted linens. Now is the time to try! Again it is about time someone did some work on ancient and medieval looms and related them to the patterns and dimensions of the Shroud. And, de Wesselow having failed to explore this aspect of the Shroud at all, the iconography of the pattern of bloodstains and scourge marks needs exploring by art historians, relating those on the Shroud to other examples. Much of this can actually be done without examining the Shroud, just as the dating of the horses of St. Mark’s in Venice could be done by establishing (from other examples of gilded copper) a date line of copper gilding to which the horses’ own gilding could be neatly fitted in and so confirm that they were second third century AD and not several centuries earlier. Above all there needs to be the will to do what the archbishop says and approach the Shroud without any preconceptions..","date":"2015-04-13","mins":"8:42 am","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","title":"More Testing? Maybe."},{"id":"comment-51861","author":"charles_freeman","post":"Great one to start with as it shows, what Gilbert Raes spotted, that the threads of the Shroud vary considerably in thickness. That should give the weaving experts something to talk about because it says something about the quality of the cloth compared to others where there has been a deliberate attempt to achieve consistency. One for the textile experts to enlighten us on..","date":"2013-11-18","mins":"5:58 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-196278","author":"charles_freeman","post":"Research on ancient linens. Piero says that he does not know what I am getting at. In recent years there has been an outburst of research on what had been a neglected area of art history, medieval painted linens. In particular, there has been research on the pigments used, the way that these have been built up to make an image and the problems of decay of pigments. So anyone researching the surface of the Shroud should be up to date with this research..","date":"2015-04-14","mins":"1:03 am","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","title":"More Testing? Maybe."},{"id":"comment-51908","author":"charles_freeman","post":"No John, I would not get too excited until you have read Paul Zanker’s The Mask of Socrates that traces the beard of Christ back to fourth century Rome with illustrations. Paul Zanker is one of the most distinguished historians of Roman art so just check him out before you get hooked on Wilson and Vignon..","date":"2013-11-18","mins":"2:17 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-51914","author":"charles_freeman","post":"Goebbels expected commitment not skepticism! You had to swallow the myth without questioning it..","date":"2013-11-18","mins":"2:39 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-51927","author":"charles_freeman","post":"‘Commitment in spreading half truths and ordinary lies, you have, Charles.’ When I read this kind of thing, I feel that I must have won the argument!.","date":"2013-11-18","mins":"4:18 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-51875","author":"charles_freeman","post":"‘The fact is that STURP was multi disciplinary.’ Well, only to a point, it had no expert in ancient textiles, no historian and no art historian. So we have no STURP report on the weave,for instance placing it alongside other linen weaves that are known from earlier periods. We know a lot about the contexts in which the Shroud was stored and displayed since 1350 and there needed to be a report on how this might have affected/ damaged the images one can hardly expect there have to be no effect over this length of time. So a historian needed to list everything that is known about the expositions – many took place in the open air and would not be cancelled if it rained on the Shroud’s feast day 4th May when huge unmanagable crowds had gathered in Turin. As a result the STURP reports cannot be considered to be definitive they simply leave too many gaps. Again, while the STURP team said that it wanted to be non invasive of the Shroud ,etc, there is no record of them having a textile conservationist on hand in Turin to advise them on this as they went about their work. I am not an expert but have worked with archaeologists on ancient materials and I squirmed when reading Heller’s account of the STURP assault on the Shroud. Rogers and Schwalbe’s Physics and Chemistry of the Shroud acknowledged the gap. They state ‘Eastlake [author of a classic nineteenth century study of Italian painting] noted that tempera and watercolor paintings on linen were common in England and Germany in the 14th century. Unfortunately, we have not examined any of these and have no basis for comparison with the Shroud image. Our conclusions are based mainly in direct observations and the results of other follow up studies.’ Quite so. They needed an expert who HAD examined the few surviving paintings on linen to rule in or out comparisons with the Shroud.As it is the STURP reports do not mention a single one but they do exist..","date":"2013-11-18","mins":"9:41 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-51887","author":"charles_freeman","post":"John. No, I am a genuine skeptic, not a pseudo skeptic. The STURP might have gained some credibility in the wider world of scholarship if they had had an expert in painted linens who could show the particular characteristics of these, especially when they have aged over time, and then compared the Shroud with them. To give a small instance, comparison of surfaces of these paintings show that whether brush strokes are visible today or not depends on the liquidity of the paint and if you can’t see any strokes it simply means that the paint was more liquid when applied. I won’t go further other that to reiterate my point that there are large areas of research on the Shroud that STURP neglected to undertake. ‘I don’t mean to puff them up, but future generations will read about Barrie Schwartz and the STURP team if they ever study religion.’ Maybe in the filed of religion Il leave it to scientists to comment on whether they will be similarly revered by scientists. As they did not engage in the history of the Shroud,they don’t feature within my discipline..","date":"2013-11-18","mins":"11:42 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-51896","author":"charles_freeman","post":"John. The reason that I am a genuine sceptic is that in my experience of working on medieval relics there has not been one that has yet been traced back the first century. So scepticism about the Shroud being the exception is the default position. So far I have not see any scientific evidence that provides a specific date within the range of 1 35 AD. In the video Barry Schwortz says that he hesitated for seventeen years but was then convinced by a single statement from Adler that suggested that blood dried red if the victim had been tortured before death. For some reason Barry did not ring up his local forensic lab and ask if that were true or suspend judgement until Adler’s tests had been replicated as they do not appear to have been. That was up to him but I am afraid it would not have been good enough for many people including myself and so the default ‘remain sceptical’ setting stays in place..","date":"2013-11-18","mins":"12:34 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-202366","author":"charles_freeman","post":"Any of us working on the Shroud are continually bombarded by misinterpretations of what limited evidence there is. I suspect the lying on the back one is a misinterpretation from one of my points in my HT article.. Of course, i never use the word ‘fake’ as I don’t believe the Shroud was created to deceive anyone. If you examine the early depictions of the Shroud you will see gaps between the elbows and the body (they have now been swallowed up by the firemarks). If you lie on the ground and hold that position you will not also be able to cross your hands in the front. So this and other evidence suggests that these are not images simultaneously taken from the same body,.","date":"2015-06-16","mins":"11:41 am","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","title":"Of People Who Drink Medicinal Wine from a Teaspoon"},{"id":"comment-134845","author":"charles_freeman","post":"I am not going to guess but I suspect, and this is what prompted me, that it will be on the same lines as the work done on ancient gilded metals in the conservation lab at the British Museum. They pinpointed a new technique of gilding on copper ( or at least only copper casting took this gilding) that only came in in the second century AD. They then realised that the Horses of St Marks, that some had dated as late as the 1990s as fourth century BC, were gilded the same way and had to be second century AD or later. So it might be with Egyptian Coptic textiles, Islamic cloth, medieval linen,or even some first century weave just unearthed, that provides the evidence. You can’t simply hold this research up and it is taking place around many of the issues that have become frozen in debate over the Shroud. So we shall see. It will almost certainly be something that no one can predict but it will be obvious when it is found..","date":"2014-07-02","mins":"6:55 am","url":"https://shroudstory.com/2014/07/02/part-of-a-comment-promoted-a-question-for-today/","cat":"news_&_views","title":"Part of a Comment Promoted:  A Question for Today"},{"id":"comment-135365","author":"charles_freeman","post":"There is already an immense amount of work going on with ancient linens in conservation labs. So knowledge is expanding all the time. At some point something of immediate relevance to the Shroud is likely to emerge – it is just a question of recognising it..","date":"2014-07-04","mins":"4:26 pm","url":"https://shroudstory.com/2014/07/02/part-of-a-comment-promoted-a-question-for-today/","cat":"news_&_views","title":"Part of a Comment Promoted:  A Question for Today"},{"id":"comment-134859","author":"charles_freeman","post":"One might well. You cannot predict what research will throw up. We only know that there are conservation labs throughout the world working on ancient linens and that new textiles are being discovered in archaeological sites every year. So there is a high probability ( I am not going to try and calculate how high a probability!) that something of relevance to the Shroud might come up that may give a date to the Shroud that will have the same backing as the dating of the Horses of St. Mark’s which is now accepted by everyone. I am just wondering how this will be dealt with if it happens. O.K. Seems to assume that it will never happen and he can simply stick to his own beliefs. Another good case was the discovery, by Michael Ventris, that the Linear B tablets were written in Greek. Lots of people said that this was impossible. But then a new cache was dug up in the palace of Pylos and indeed it was Greek. So it was put about by Ventris’ opponents that new tablets had been created specially and then buried. . ..","date":"2014-07-02","mins":"8:28 am","url":"https://shroudstory.com/2014/07/02/part-of-a-comment-promoted-a-question-for-today/","cat":"news_&_views","title":"Part of a Comment Promoted:  A Question for Today"},{"id":"comment-134950","author":"charles_freeman","post":"My point was that it might be work on materials other than the Shroud by specialists who may never have heard of it that would provide findings that could then be applied back to the Shroud and provide something definitive..","date":"2014-07-02","mins":"5:30 pm","url":"https://shroudstory.com/2014/07/02/part-of-a-comment-promoted-a-question-for-today/","cat":"news_&_views","title":"Part of a Comment Promoted:  A Question for Today"},{"id":"comment-184464","author":"charles_freeman","post":"Andrea Nicolotti provided me with the Bergier extract and it was, of course, one piece of evidence I used in building up my case. There were hundreds of these clothes around originally, most of then produced locally I assume and many must have been replacements for earlier ones that had become worn out after centuries of service. ( Young traces the ceremonies back to the 900s and some believe they started even earlier.) We would be lucky indeed if we have the specific document that linked the Lirey Shroud to the Quem Queritis ceremony but the Lirey Pilgrim Badge with two clergy holding the Shroud in extenso in front an empty tomb is exactly the theatrical gesture that the ceremony required before the cloth was processed in ceremony to the High Altar on which it was laid before the beginning of the main Easter Mass. So that is why I have put it forward as a hypothesis only – there were other contexts in which painted cloths were put on the altar during Lent. Perhaps I have missed it but can Mario tell us which in this context is the ‘wrong’ side. The conventional side looking at a crucifixion is the right, if you are doing an imprint it would be on the left, as on the Lirey Shroud. BTW. I don’t understand why Mario talks of the Shroud being ‘forged’for the ceremony. It would have been a straightforward commission – ‘we have got Easter coming up, the old grave cloth is pretty worn out, please paint us a new one – you can copy the one they have at Troyes ( or wherever) if you need to know how it should be done.’.","date":"2015-01-19","mins":"3:11 am","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","title":"Ponderable for Today"},{"id":"comment-182431","author":"charles_freeman","post":"Copyright was obtained for all the illustrations used in my History Today print article, including from the Royal Library in Turin who were actually quite helpful and not that expensive compared to the church ( and asked nothing about why they were needed) but I was told that it was too expensive to get worldwide online copyright permissions hence my online article has hardly any illustrations..","date":"2015-01-10","mins":"4:01 pm","url":"https://shroudstory.com/2015/01/09/photographs-of-the-shroud-and-copyright/","cat":"news_&_views","title":"Photographs of the Shroud and Copyright"},{"id":"comment-184467","author":"charles_freeman","post":"Personally I don’t think the Shroud was originally made for the church at Lirey its size suggests a substantial altar where it would be displayed after the Quem Queritis ceremony. A possible but undocumented scenario is that it was associated with some miracle and this gave it status. It may have been grabbed by Geoffrey as a prize of war ,of course, ( this is what his grand daughter thought) while he was fighting the English in Northern France. We have to remember that, until the Savoys got it, all attempts to present it as authentic had failed..","date":"2015-01-19","mins":"3:27 am","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","title":"Ponderable for Today"},{"id":"comment-184496","author":"charles_freeman","post":"And I think the Shroud should be treated with respect too. Something must have impelled Clement VII to give it spiritual status, its own indulgence, even though he did not believe in its authenticity. And,if I am right, historian of drama should also be interested to this sole survivor of what must have been many originals..","date":"2015-01-19","mins":"6:07 am","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","title":"Ponderable for Today"},{"id":"comment-184618","author":"charles_freeman","post":"Colin, the Quem Queritis ceremony was one ritual within the whole annual circuit of liturgies it was something many churches did and, as all of them involved having grave clothes with a makeshift tomb ,they would all have had their own grave clothes as these formed a central part of the liturgy ( an ostension of the grave clothes in front of the tomb, procession to the high Altar, laying on altar, etc. However, the Turin Shroud appears to have been larger than a small church like Lirey would need and so this suggests it was brought in from somewhere else. Furta sacra, holy thefts were quite common, there is a whole book on them of that name by the historian Patrick Geary and this might well have been one , taken or looted by Geoffrey in the chaotic fighting in which he was involved in Northern France with the English and in which he lost his life. I suspect that in his absence it was Jeanne who had a go at saying it was the real thing but the Church very quickly squashed that one while accepting( Clement VII) that it did have some spiritual status. Perhaps it already had a reputation for bringing miracles which is why Geoffrey got it for his new family chapel..","date":"2015-01-19","mins":"5:33 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","title":"Ponderable for Today"},{"id":"comment-184608","author":"charles_freeman","post":"The Quem Queritis ceremony was a standard Easter ceremony. You should read Young on it. He had documented evidence for it in four hundred churches and monasteries mostly in Germany. So it would have been quite usual to find it and it was intrinsic to the ceremony to bring out and display grave clothes some of which had painted images on them. The liturgy describes Peter and John, dressed as priests, going into the tomb, taking out the clothes and holding them in extenso in front of the tomb before processing up to the main altar where the cloth is laid before the Easter Mass begins. The Lirey Badge appears to show just this, two clergy, the Shroud in extenso , the empty tomb. So can you provide a better explanation? As Young makes clear, see my earlier quote, there were lots of these cloths around. So mine is a reasonable hypothesis. As suggested earlier, the Shroud seems to have been made for a larger audience and altar than seems to have been the case at Lirey. Yet Clement seems to have known of some event associated with the Shroud that made it worthy of an indulgence even though he was certain it was not authentic. These cases usually involve a miracle or two. It is possible that Geoffrey’s grand daughter was right that it was a spoil of war and taken from a larger church where G. Was fighting the English but the Lirey Pilgrim Badge suggests that its original purpose had not been forgotten. Certainly the nature of these clothes would have been common knowledge then – I am sure Young would only have tracked down a small proportion of the original ceremonies even if we have forgotten the QQ ceremony today ..","date":"2015-01-19","mins":"4:56 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","title":"Ponderable for Today"},{"id":"comment-166233","author":"charles_freeman","post":"No, I give hardly any credence to the d’Arcis memorandum i give much greater weight to the pronouncement of Clement VII that the Shroud was not genuine but nevertheless was worthy of veneration.This confirms that the church hierarchy did not believe it was a forgery. I do not rely on Mc Crone I do not support him in my article one way or the other as you will see from my article. I simply mention his findings .The best evidence for the painting comes from the calcium carbonate that was an ingredient of gesso which was used to seal a cloth ON THE OUTER FIBRILS only before painting. That was a STURP finding the problem being that they did not know anything about medieval painting. I do not regard it as definitive but it is hard to understand why there was so much calcium carbonate and why the image was just on the outer fibrils but this was just where the medieval experts advised it should be and applied by a knife so that any excess could be scraped off (this explains why there were no brushmarks). The other issue is the much more distinct images and the presence of features such as the Crown of Thorns that are now vanished where have they gone if they were not originally painted on and now disintegrated? The carbon 14 dating has not been discredited. The careful work of Flury Lemberg as well as every other expert who has actually examined the cloth close up confirms that there was no reweaving it simply could not be concealed on the back even if it was on the front and this is further confirmed by John Jackson’s photography that shows the bands were not interrupted. Jackson himself confirmed that there was no reweaving and he is normally trusted among the Shroudies. Then no one has been able to even say what the contamination that would have to be twice the weight of the cloth AFTER cleaning to affect the result actually was. An examination under modern microscopy , that is, as my article says, desperately needed would show whether the paintings or lack of it is ‘a scientific fact ;or not. The debate will not be won or lost on the Shroud Story website. It will be won and lost among specialists in the areas I covered, medieval iconography, weaving techniques/looms, conservationists, specialists in painted linens, experts on medieval liturgy these are the ones I am approaching for further comments. As I have said before, the debate will not be sorted one way or the other authentic burial cloth or faded painted linen – in under a year as it takes this sort of time, at least, for the ideas to get around and reach the people who know about medieval artefacts and the ceremonies associated with them.. But I must congratulate you on being so far as I know the only contributor to the Guardian comments section to have his comment removed by the moderator. Quite some feat when you look at the competition!! ..","date":"2014-10-28","mins":"12:43 pm","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","title":"Posting Correction"},{"id":"comment-166505","author":"charles_freeman","post":"Thanks, Hugh for the Sofer reference – I did not know it but it seems relevant to my thesis. I don’t think the Shroud is ‘so expensive’ – just look at the linen table cloths they were producing in the medieval period that are of far higher quality. The medieval treatises on painting on linen stress that the weave has got to be fairly close or else the gesso surface cannot be applied. You are aiming to get a very thin and consistent layer of gesso on the outer fibrils without it seeping through a loose weave (then you paint on top). There were two aims 1) to allow you, if not in the case of the Shroud, to have different paintings on each side 2) for flags and banners to be able to flutter in the breeze. It was quite a skilled job to get the gesso on in a thin layer and that is why they advised to do it with a knife so excess could be scraped off. Also a treadle loom is three times as fast as an ancient loom thanks to the coordination of feet and hands so this made the whole process of weaving linen and other textiles much easier after c. 1000. Unfortunately the cost of securing illustration rights for the world wide web were prohibitive but I have a nice picture of a medieval treadle loom in the print version of HT. It shows how the weave was rolled up around a rod at the top so that longer cloths could be produced, but the width was limited to c. 130 cms, No problems, the experts tell me, in producing the Shroud on such a loom..","date":"2014-10-29","mins":"6:13 am","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","title":"Posting Correction"},{"id":"comment-166468","author":"charles_freeman","post":"Well if you read my article you will see I give two examples of similar faded medieval paintings on cloth and call on conservationists to see if they have more from their work. This is why I am seeking out conservationists so that we can build up some comparative examples. The Shroud is not the only formerly painted linen with faded images after five or six hundred years of public expositions. But you might have actually to read my article to see what two of those other linens are! As my article says , the images were painted as negatives, as the Besancon Shroud was also. As I argue these cloths were produced for the Quem Queritis ceremony where grave cloth had to be brought out of the tomb and held up in front of it to show that Christ has risen just look at the Lirey pilgrim badge to see how it was done. Whether the artist used a template to copy from ( this would explain how similar the Shroud bloodstains are to those, for instance, of the Holkham Bible and the Roettgen Pieta, both fourteenth century) or whether he did his own thing, he had to produce a negative image to make the point that this was a grave cloth. This was right at the beginning of medieval drama. – the Passion plays follow..","date":"2014-10-29","mins":"3:41 am","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","title":"Posting Correction"},{"id":"comment-166470","author":"charles_freeman","post":"Well, the professional academics I work with are professionals and they would never go public with something that they could not defend with their own expertise. But it takes time – it took about four months to get my article published, presumably because it was being read by other academics than those I consulted before even a magazine for the general history public accepted it. So give it a year at least. But if my article had not been p Ublicised here, I would not be responding at all as it is not on this website that the issues will be decided anyway..","date":"2014-10-29","mins":"3:48 am","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","title":"Posting Correction"},{"id":"comment-163937","author":"charles_freeman","post":"Aljones. Yes, I am as bemused as you are by some of these claims – but the Church does not claim that the Shroud is a genuine relic. After all it commissioned the radio carbon dating of 1988 and has never repudiated it. If the Church was claiming it was a genuine relic, then I would be in deep trouble with my new article that argues for a medieval origin. They would claim that I was undermining the exposition when, in fact, I am giving extra reasons for visiting it in that the Shroud may well be the only survivor from the Easter ceremonies when they held up a grave cloth to show that Jesus had risen. I organise tours to the Mediterranean – we actually did Turin last year and there are large numbers of tours being organised to visit the Shroud – many of which will make very good money for their organisers. ( Only us insiders know how much mark up there often is on the actual cost of arrangements.) It will be interesting to see if the tour promoters claim, beyond what the Church, and so one assumes the organisers of the exposition, itself claims, that they will see the real thing..","date":"2014-10-20","mins":"1:44 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"id":"comment-172585","author":"charles_freeman","post":"Also remember that we have a1449 description of the Shroud as ‘admirably painted’. We also know that the gesso for a painted linen was placed only on the outer fibrils of the cloth and that, north of the Alps, calcium carbonate was used in the gesso mix. We must be grateful to STURP as, although they admit they never examined any painted linens, they did report both the outer image and the calcium carbonate ( in ‘large’ quantities and spread across the cloth). A good start. Then you have to explain away features that different artists over 150 years saw on the Shroud that are no longer there, of which the Crown of Thorns is perhaps the most important with the same pattern of thorns clearly shown in different pictures and we have a separate description of it by an observer of the Shroud in the early sixteenth century so it is pretty clear it was once there. This forms the core of my lecture and I can show how similar the pattern of bloodstains on the Shroud are to those of early fourteenth century iconography. So was the Crown put on by some form of scorch? A painted cloth, with images decayed, such as is seen in the Zittau Veil linen panels, is the best fit hypothesis. We know that hundreds of thousands of these painted linens once existed (evidence from church inventories) but we don’t know of a single one of Colin’s sweat images which is why he is having to make it up as he goes along ( as he clearly is from one posting to the next). Best fit hypothesis. That is my position..","date":"2014-11-22","mins":"4:55 pm","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","title":"Second Annual Bertrand Russell Award in Sindonology"},{"id":"comment-134545","author":"charles_freeman","post":"‘My goal is not to convince them that HPM was based on the Shroud I know that convincing fanatics is impossible. No. The purpose is to show everyone they are wrong and dishonest. So either they admit that HPM was based on the Shroud, or they turn out to be complete morons. Let they fear.’ Well, at least we know what O.K.s purpose is now, so clearly expressed in his own words. Quite how those who fail to see the Shroud in the Pray Codex are therefore dishonest and what they should be fearful of, God only knows!.","date":"2014-06-30","mins":"5:14 pm","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","title":"Shroud Encounters of the Wikipedia Kind"},{"id":"comment-134307","author":"charles_freeman","post":"‘The conventional image of a fully bearded Jesus with long hair did not become established until the 6th century in Eastern Christianity, and much later in the West.’ No, it was the other way round.The text of Paul Zanker’s The Mask of Socrates can be accessed online with illustrations and he takes the first examples appearing in the west about AD 300. An excellent example of an early western example is the Christ in the Church of San Pudenziana in Rome of c. 390 420. I don’t think we have any eastern examples ( though i am open to others being provided) until 150 years after that. Zanker ties it in with the adoption of Christ as ‘the true philosopher’. If you look at Google Images for Plutarch (the philosopher died AD 120) at Delphi you will see the template..","date":"2014-06-29","mins":"9:30 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","title":"Shroud Encounters of the Wikipedia Kind"},{"id":"comment-134311","author":"charles_freeman","post":"Actually you can just put in ‘Greek philosophers’ into Google images to get the range of haircuts, beards and moustaches. Many of these statues are Roman copies but I am not sure, without rereading Zanker, why it was in the west rather than the east that Christ was first adopted in the guise as a ‘Greek philosopher’. We certainly find him being described by Clement of Alexandria, early third century, as the true philosopher who had transcended pagan philosophy. No real need to look further for the origin of the bearded Christ but read Zanker is you are still not convinced. I am not going to get myself bogged down in an endless argument that that bearded Christ came into art from the Shroud in the sixth century. The earlier examples are too obvious for there to be any serious debate on this..","date":"2014-06-29","mins":"9:48 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","title":"Shroud Encounters of the Wikipedia Kind"},{"id":"comment-172894","author":"charles_freeman","post":"Well, if de Sale’s quotation is the only one that mentions sweat ( alongside blood as in so many other observers’ descriptions) it can hardly stand for much. Perhaps I am wrong but surely Colin has something more to go on before he attempts to rewrite medieval art history..","date":"2014-11-25","mins":"2:41 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-172968","author":"charles_freeman","post":"Colin – we are talking about different quotations. The ‘Cunningly’ is from the fourteenth century arc is Memorandum, the ‘admirably painted’ is from a hundred years later, in 1449, a Benedictine monk. The Latin original is ‘ miro artificio depicta’. It is,of course, part of my ‘ this was originally a painting’ evidence..","date":"2014-11-25","mins":"1:18 pm","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-172971","author":"charles_freeman","post":"Never too late, Colin, to read some introductory books on medieval art history , especially as this seems to be the area you are working in. I have told you about the Villers which is specifically about painted linens. I will leave you to get on with it so that you feel able to talk with more confidence and credibility. I am not in my office so I don’t know what the original of the translated ‘ cunningly’ is. I am not sure exactly what connotations the original may have had. I think the good bishop was referring to the fraud of pretending that the Shroud was authentic, not saying that it was in itself a forgery but again we need to go back to the original text. I am, of course, referring to the 1449 quotation as this was someone who was referring directly to the image that he could see before him..","date":"2014-11-25","mins":"1:55 pm","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-172822","author":"charles_freeman","post":"But I see Stetson7 has not removed the entry on my Ht article from the History of the Shroud article. But perhaps the last person to modify that article who goes by the name ‘anonymous’ may the one to do so. I can see why we never let students use Wikipedia as a source!.","date":"2014-11-24","mins":"12:34 pm","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-172818","author":"charles_freeman","post":"The original entry for my article was not by myself and I was surprised that someone, I assume a moderator, had posted one so soon. I simply enlarged it and made clear that it was me who had done so. My article had, after all, gone through a great deal of academic eyes with approval before publication in History Today and I am well known as the author of the only university press published book on the history of medieval relics so i do have some wider credibility in this field. It was not a moderator but a semi anonymous figure called Stetson7 who removed both the original article and my additions. I assume a moderator would have reverted to the original entry of 7th November if they had disapproved of my addition. I am quite happy to see how the flow goes if it has not been replaced by this time next year, I will think about whether I feel it ought to be there or not. Despite its many achievements , a Wikipedia article can still become the focus of games between rivals and I had another article relating to me completely displaced by a troll someone who I knew had been banned from several websites for his behaviour. When I was an examiner In critical thinking for the International Baccalaureate students were forbidden to use Wikipedia as a source. They had to go back to an original source. So I am not going to lose a my sleep over this..","date":"2014-11-24","mins":"12:04 pm","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-172910","author":"charles_freeman","post":"One way forward must be for comparative images,e.g. Take photos of other medieval linens whose images are now faded, photograph them and then produce the negatives for comparison.You may be surprised but until you have done that you cannot claim that the Shroud is unique. Non directional is not an issue as many (of the few surviving) painted linens from the medieval period have non directional paint – it depends on how fluid the ‘paint’ was when it was applied whether it dried with brush marks on it. Some did, some didn’t. Do read (the late and much lamented) Caroline Villers’ (ed.) book on painted linens before you go any further, Colin. It amazes me the way you go it alone without any help for the people who have studied images on medieval linen professionally. I am just working on hypotheses that experts have so far not been able to dismiss – and I have approached quite a number. Obviously without close up examination of the Shroud with the latest technology ( and the application of a great deal more information we have accumulated over the past fifteen years on painted linens ), no one is going to give me an authoritative ruling but at least they are supportive and it is always wrong to get too far outside the academic community.That is why I am waiting for a year for academic responses to my hypotheses. However, it seems that a TV company is already working on this (though from long experience I know that only about ten per cent of proposed programmes actually get made!!).","date":"2014-11-25","mins":"5:54 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-172958","author":"charles_freeman","post":"This says all that needs to be said about the vulnerability of painted cloth such as I assume that the Shroud once was. Note the speed which which they decayed I think that the Shroud did well to hang on to its images as long as it did. Note the ‘experiments with modern replicas” certainly worth following up. From The Hangings About the Hall: An Overview of Textile Wall Hangings in Late Medieval York, 1394 1505 by Gr. Charles Kightly in Medieval Textiles Issue 28, June 2001. Painted cloths In York, as throughout England, painted cloths were much the most popular cheap wall hangings from the late medieval period until the mid seventeenth century. The earliest York reference I have found is to a painted dorser belonging to John de Birne, rector of St. Sampson’s, who died in 1394 (C). Their great attraction was that they offered brightly coloured and often figurative wall decoration – much cheaper to paint than either to embroider or to work in tapestry – at a very low cost. The shop stock of the York tailor John Carter (d. 1485 B), for example, included twelve yards of ‘panetyd clothes’ at 2/8d, or only 2 d a yard, while that of the chapman Thomas Gryssop (d. 1446 B) included six whole painted cloths (admittedly ‘old’) at 5/ the lot. Their cheapness, however, was counterbalanced by their lack of durability: experiments with authentically produced modem replicas have shown that they degrade quite rapidly, especially when the painted surface is cracked or damaged by rolling or folding for storage. For this reason their second hand value could be very low indeed. The most expensive York example was Richard Dalton’s (1505 B) complete painted hallings at 7/ , but their average second hand value seems to have been only one or two pence a yard, and two whole cloths belonging to Henry Thorlthorp, vicar choral (d. 1427 B) were appraised at only a penny each. The low value and ephemeral nature of painted cloths has ensured a very low survival rate, and no indisputably medieval English examples are known to exist. What did they show? Among the earliest described belonged to Robert Lyndesay (d. 1397 B), parish clerk of All Saints North Street, which depicted ‘the image of Christ sitting in the clouds’. John Underwode, clerk of the vestry at York Minster (d. 1408 A), had a cloth ‘of the Last Resurrection’, Henry Thorlthorp (d. 1427 B) and John Danby (d. 1485 A), vicars choral, both had cloths ‘with the Crucifix’; and cloths ‘with the Trinity’ are recorded for the goldsmith John Colan (d. 1490 B); the widow of Thomas Person (d. 1496 A), and John Clerk, chaplain of St Mary Magdalen chapel (d. 1451 B), whose hanging also depicted St. John the Baptist and St. John the Evangelist. These two saints also appeared on a cloth belonging to John Tidman, chaplain at All Saints, North Street (d. 1458 C), who likewise owned painted hangings with ‘a great image of the Virgin’ and with ‘the history of the Five Joys of the Virgin’. Agnes del Wod (d. 1429 A) favoured images of St. Peter and St. Paul; William de Burton, vicar of St. Mary Bishophill (d. 1414 A) had a cloth with ‘the history of St. Thomas of Canterbury’; and John Colan (d. 1490 B) one with ‘the Virgin Mary and St. George’; while both John Kexby, Chancellor of York Minster (d. 1452 B) and Janet Candell (d. 1479 C) owned cloths depicting ‘the Seven Works of Mercy’. Secular subjects were seemingly much rarer, though the vicar of Acomb, Henry Lythe (d. 1480 A) had a ‘halling painted of Robyn Hude’..","date":"2014-11-25","mins":"11:55 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-172964","author":"charles_freeman","post":"One has to remember that if one of the grave cloths for the Quem Queritis ceremony decayed or was destroyed, they would have to commission a new one for the following year. So it is quite possible that a single cathedral,church or monastic church whose inventories talk of a burial cloth is talking of different cloths at different times. If the Besancon Shroud is sixteenth century as Andrea Nicolotti argues it is, then this does not mean that there were not earlier ones, including, possibly,one lost in the earlier fire. The real issue is the very low survival rate that gives us virtually no examples to make meaningful comparisons with the Shroud. In fact, its importance for me ( and I think other people with an interest in early medieval drama) is that is the only known survivor of what must once had been hundreds of others, all, like every single Medieval English wall hanging, now lost..","date":"2014-11-25","mins":"12:22 pm","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-173033","author":"charles_freeman","post":"Thanks for the quote,Hugh..","date":"2014-11-26","mins":"2:03 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-172858","author":"charles_freeman","post":"I think we need to pin down more clearly who these pilgrims were who said that the images were derived from sweat and what they actually said. The predominant observation was of the ‘blood’ on the Shroud ‘ as if it had been recent’. David Mo has suggested that they may have exaggerated the blood and this is possible as there was certainly an obsession with the blood of Christ from the fourteenth century onwards that may have led to observers highlighting it more than it deserved but this is not sweat. One also has to explain the descriptions and depictions of the Crown of Thorns that was certainly not a sweat imprint. I am so confused about what Colin is arguing but presumably his sweat would only have created the outline of the body and not extras such as the Crown of Thorns. I am not sure whether anyone has done any work on whether the copies themselves have faded over the centuries. We must remember that we are dealing with at least seven hundred years and very vulnerable materials. The vast majority of linens recorded in church and monastery inventories with images on them have vanished without trace and this can only mean that they proved all too vulnerable to damp, decay or fire. It is hard to make generalisations from the rare survivors such as the Shroud..","date":"2014-11-24","mins":"5:36 pm","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-216948","author":"charles_freeman","post":"I agree with Hugh. The Quem Queritis ceremony early on Christmas morning required a burial cloth to be held up to show Christ had risen. Some were known to have been painted though we don’t know exactly how. In a large church and in the dim early light the priority must have been impact and this is what was achieved by a double image with vivid blood as the early accounts suggest. The need for impact above all else also explains why the two images, now only discoloured linen, do not match each other, in length or in the way the arms are shown( you could not hold the position of the arms on the back image simultaneously with those on the front). Some accounts of these ceremonies do, as Hugh suggests, involve an actual Effigy of Christ but the Shroud images do not reflect being laid over a three dimensional image they appear to be straightforward representations from above of a body crucified according to the gospel accounts with some elements, e.g the scourging on both sides reflecting post 1300 iconography..","date":"2015-12-21","mins":"7:19 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217030","author":"charles_freeman","post":"I am sitting in the airport at San Francisco waiting for my flight back to the UK so you will need to wait for the moment until I get back to the references!.","date":"2015-12-21","mins":"9:57 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216951","author":"charles_freeman","post":"Sorry, EASTER morning! That time of year is getting to me! I have argued elsewhere ( History Today article easily found on Google ) that the original purpose of the Shroud gives it the right to be venerated within Catholic tradition as pope Francis recently demonstrated without any acknowledgement of authenticity. If it were a fake there would be no reason to venerate it. It is,I believe, one of thousands of medieval ‘ relics’ which are not what they claim to be but which have been given spiritual status by continuous veneration over centuries. The medieval Volto Santo in Lucca is a good example. It is known to be medieval even by its most devoted adherents but it is venerated as a supposed replacement of the first century original..","date":"2015-12-21","mins":"7:47 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216582","author":"charles_freeman","post":"Thanks, Dan. It has been fun to keep up with. Great you have kept a wide variety of views alive. I stick to my view that we will have a fairly definitive solution to the mystery of the Shroud within the next ten years but thanks for keeping the debates on their way..","date":"2015-12-15","mins":"11:04 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216987","author":"charles_freeman","post":"Put the Besancon image alongside the Shroud and you can see clearly that one is not a copy of the other, nor is there any documentary evidence linking the two. The ‘relic craze’ began in the west soon after the east. Augustine was welcoming relics by the early 400s. You are right. To say that the 1204 Crusade encouraged forgeries. That is why Pope Inncocent III tightened things up in 1215 and new relics had to have papal approval. That is why the Shroud was turned down in 1390 by Clement VII and was not allowed to be exhibited without saying it was not authentic..","date":"2015-12-21","mins":"3:55 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217069","author":"charles_freeman","post":"The Quem Queritis ceremony was a re enactment of the Easter morning at the tomb and had alternative presentations with the three Mary’s or Peter and John. In the case of the latter they go into the tomb as per the gospel accounts and find the discarded grave cloths. Often there were two as John’s account but Karl Young quoted many accounts where there is a single linen. The Cambridge UL has a copy of the Young and it has many many accounts of these ceremonies – in fact, though dated, it was the single most important book in my researches which led to my hypothesis of the Shroud coming from the Quem Queritis ceremonies.The TWO of them, although the still dressed as priests, come out of the tomb then hold up the linen before the congregation in front of the empty tomb to show that Christ had once been there but had now risen leaving the grave cloths. The linen is then. Carried to the High Altar and laid there. For a possible illustration of this which fits the liturgical account ,see the Lirey Pilgrim Badge. Young has a ninth century illustration from the monastery of St.Gall with the Three Mary’s approaching the tomb and you can see the wrapped grave cloths inside. As per the required ritual the Marys in this illustration also carry an incense burner. Well, you go into a dark tomb to find the cloths to bring them out and some incense just gets spilt onto the cloth. . . . . We may never know but I wonder whether there was some miracle associated with the holding up,of the cloth one Sunday which is why the exposition is shown on the badge. This would not be untypical of these events. Back home, I am too tired and with too much to do , but will answer any other queries when I am back with my reference books. I would agree with Mario that searching these accounts for evidence of the authenticity of the Shroud is a dead end. Rather it provides evidence of the possible/ probable medieval liturgical origins of the Shroud. I will also hope to give a reference from Hans Belting to the Image of Edessa being venerated by crowds who would sprinkle water on its eyes, one more reason why this was never the Shroud. No sign of the sprinkling!.","date":"2015-12-22","mins":"4:00 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217074","author":"charles_freeman","post":"Mario I have just flown in from the States and have a mountain of things to do before Christmas but the three works referencing the images on cloths will be sent when I can get to my office tomorrow promise! Karl Young is fundamental to these researches as his is the fullest account, if in the Latin original of these ceremonies..","date":"2015-12-22","mins":"5:23 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217099","author":"charles_freeman","post":"Mario. I am very busy and jet lagged but here are the references. I cannot guarantee to return to this site so I hope this settles outstanding matters. One.To the Image of Edessa being the subject of veneration. ‘The rituals of the feast of the cloth image in Edessa are described retrospectively by a writer apparently a court theologian, from Byzantium, ….. The relic, concealed behind a white or purple cover, was usually kept in a shrine and was set up on a ‘throne’ only on special days. On feast days it was approached with water that the people sprinkled on its eyes.’ Hans Belting, Likeness and Presence, p.211. There is a great deal more on the Image of Edessa in Belting. Required reading for all those who persist in seeing it as the Shroud of Turin! Two. References to Easter ceremonial cloths being painted. (N.B. The only way to get an image on a linen cloth is to embroider it ( as in the famous Bayeux Tapestry) or paint it after the linen has been sealed. Painting was obviously the most economical way but shelf lives tended to be short unless it was expertly done or the image was preserved on a backing. Otherwise the painted surface tended to disintegrate after too many foldings. This is why we have so few survivors from the many thousands of painted cloth images that are recorded in inventories.) I am sure that much more can be done on this, but this is just the preliminary results of my researches which show clearly that there were painted cloths, with images on them, used at the Easter ceremonies. A)The Mozarabic Rites that originate in the seventh century and are followed in some parts of Spain to this day. The Easter Preface reads: ‘Peter ran with John to the tomb and saw the recent imprints of the dead and risen man on the linens.’ This would date well before the Shroud was created. As no ‘imprints’ are mentioned in the gospels, it would seem that there may have been actual cloths with a double image on them. B)Karl Young is the crucial source here. In the ceremonies of the Visitatio Sepulchri in which John and Peter appear and display (the Latin word ostendo with its connotations of ‘stretching out’ is used) cloths that have an ‘Imago Domini’, ‘an image of the Lord’, on them. Among the places where this is recorded, in examples given by Young, are Aquileia, Salzburg, Chiemsee (a nunnery on this Bavarian lake), Passau, and the abbey of St. Florian (near Linz). None of these provide details of the images but this simply confirms that there were images on the cloth and that these were shown to the congregation, in this case by clergy representing Peter and John (?as shown in the Musée de Cluny Lirey Pilgrim Badge). C)In her exhaustive study of medieval Easter Sepulchres in England, Pamela Sheingorn finds many references to painted cloths although sadly most inventories or church records do not tell us what the subject of the paintings are. Even so (and I have not been through all her many references to inventories) in the church of St.Peter in Cornhill in London, among other ‘steyned clothes’, is one ‘of the burying of our lorde with Image of three Marys’. In his will of 1559, long after the Reformation, Sir Rich Rede bequeathed to St. Paul’s Cathedral ‘my little embodered Cloath wrought with the Resurrection of our Saviour Christe Jesus, which I thinke was made to hang aboute the middest of an Altare, about or beneath in the feast daye of the Resurrection.’ In Lincoln Cathedral, the Easter Sepulchre was embellished with ‘a whyte steyned cloth of damask silke for the sepullcour with ye passion and the Ressurecion of owr lord’. D)In the third volume of the theology section (1790) of the mammoth Encyclopedie Méthodique the Abbé Bergier contributed the article on Suaire (‘Shroud’). He describes the Gospel texts and concludes that the linens or shrouds that one sees ‘in several churches’ could not possibly be the actual burial cloth of Jesus. He goes on to note that in the Easter ceremonies, which he dates back to the 12th and 13th centuries, a linen cloth empreint de la figure de Jesus Christ enseveli (empreint, ‘printed’, enseveli, ‘buried’) is displayed to the congregation [ in other words he suggests that this was normal practice to have an image of the buried Christ]. He goes on to tell how these cloths are preserved in church treasuries, which is why there are so many of them. He notes specifically those displayed at Cologne, Besançon, Turin and Brioude and argues that despite their lack of authenticity as the original Shroud they should still command veneration. E)A French Bible dictionary of 1912 states that there were ‘linen cloths, in which in former days it was the custom to paint the body of Christ in the tomb and spread them afterwards on the altar to serve for the mass on Easter Sunday.’ Further research need on pilgrim badges to see how the Lirey badge relates to others. The question that needs to be researched further is whether there are examples of pilgrim badges that record a miraculous event was there an (unrecorded) miracle associated with the display of the Shroud one Easter? We do have lots of recorded cases where an object, not seen as a relic as such, became venerated after a miracle or vision was reported. The odd thing about the early accounts of the Shroud is that no miracles are reported (perhaps one reason why the Church authorities were able to dismiss it so easily). The Savoys did, however, produce several miracles and these are described in Beldon Scott. (I really have no time for those who do not have this book at hand as it is not expensive in second hand copies and has a mass of vital information about the Shroud.) Happy Christmas to all, and especially Dan! So much more research to be done we have hardly started but I do think it should be over to the linen conservationists who deal with these linen cloths close up to take over!.","date":"2015-12-23","mins":"5:01 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217101","author":"charles_freeman","post":"P.S. ( Sorry, interruption to set up a bed in my ground floor office so that my 95 year old father in law can be with us for Christmas!) With so many of the painted cloths around, with an Imago Domini on them,there is no reason to link the de Clari image in Constantinople specifically with the Shroud of Turin especially when de Clari’s was, like many others, a single image. We must accept that there was nothing unusual about a painted image on cloth of Christ buried or resurrected. No evidence that the Latin speaking de Clari would have been able to communicate with the Greek speaking heretical Orthodox Christians to find out about the Blachernae cloth anyway. (One reason why the Crusaders were able to loot all the Constantinople relics is that they were, after 1045, held by excommunicated heretics.).","date":"2015-12-23","mins":"5:33 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217125","author":"charles_freeman","post":"Mario you need to read Young as he painstakingly takes back the story to the tenth century and actually has a tenth century illustration ( from the monastery of St. Gall a primary source if ever there was one) that shows the ceremony. The Three Marys are approaching the tomb. Inside you can see two cloths wrapped up. We would be extraordinarily lucky to have an actual illustration of these cloths with images on them. Karl Young notes that, while in actual depictions of the grave clothes the sudarium (‘facecloth’) and the linteamina (the wrappings of the body) are usually shown separately (as in the tenth century St. Gall illustration) , ‘the dramatic ceremonies at the sepulchre followed the Gospel traditions with considerable freedom, using sometimes a single [N.B.] cloth called sindo or linteum , sometimes a cloth called sudarium, sometimes several pieces called linteamina, and again both a sudarium and linteamina.’ You really have to work through Young in detail on this as he very carefully traces the developments of these ceremonies from the tenth century in the west. He notes how the Quem Queritis ceremony began as part of the Easter morning Mass but was then separated out to become a independent ceremony at dawn with more and more emphasis on the display of the linen grave cloth or cloths. Although I don’t think he made this point, this emphasis on public display of relics was very much a feature of the Gothic period which is why Gothic churches had more windows and processional space. While an Easter connection with the Shroud seems to have been maintained in the first half of the fifteenth century on the banks of the river Doubs it was only exhibited there on Easter Sunday so far as we know – the Savoys converted it into their family prestige relic and the link with Easter was broken with a new feast day of 4th May. Beldon Scott, has the best account that I know of of the crucial transformation of the Shroud from a rejected outsider (rejected again by the bishop of Liege in 1449) to a prestige relic with stories of its own miracles and a transfer, not from the Lirey church, but to the kings of Cyprus by Patriarch Heraclius of Jerusalem in 1087 (Beldon Scott, ‘King of Kings, King of Cyprus’,pp 31 7). By doing this the Savoys were doing what you had to do if anyone was to take your relic seriously have a miracle record and a story which in this case needs to go back to Jerusalem. Of course, the researches of Chevalier exploded this Savoy myth of the Shroud having come direct to them from Jerusalem via the Lusignon kings of Cyprus but how else could the Savoys maintain the pretence of authenticity? They must have realised that the Lirey origin would get them nowhere so they dumped it!! Yet, as Beldon Scott shows they could hardly dump Margaret de Charny who actually handed the Shroud over so they created a story that Margaret de Charny was descended from the kings of Jerusalem; fled from Cyprus with the Shroud at the fall of Constantinople to the Turks (1453), and handed it over to the duchess Anne of Savoy who was her Lusignon family relative. Mario is right it is very difficult to get the truth from medieval documents. Yet I think that there is sufficient overlapping evidence to show that some of the cloths used at the Visitatio Sepluchri ceremony (see Young again as how this emerged as an alternative to the ceremony with the Three Marys) had images on them. I cannot think how these images would have been created other than through the well tested if usually rather ephemeral methods of painting on the cloth. Just as I cannot see the Shroud anywhere in the Pray Codex, i cannot possibly see how the Besancon Shroud is a copy of the Turin Shroud. Remember you have lots of other models to work from if you want to represent a laid out body with folded arms on a cloth , the epitaphioi, the Holy Graves of the Rhineland, the Klosterneuberg altar, etc. Etc.. The Besancon image is even cruder than that of the Shroud which in itself does not even have matching bodies. That is why I think that the original artist was concerned ,in the dim morning light, to create something with impact hence the heavy emphasis on the blood, so typical of the fourteenth and fifteenth century, and so remarked on by everyone who saw the Shroud in its early years. No one would bother much if the Shroud bodies were of different lengths and the arms at the back could not possibly have been the same arms folded at the front. After all Christ had risen only the grave cloths where his body had lain were left and by displaying them you made the point. Bring the cloth to the altar lay it out ( the length of the Shroud matches an altar such as the one in Cologne Cathedral) and rejoice!!.","date":"2015-12-23","mins":"12:45 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217129","author":"charles_freeman","post":"I am not sure why Mario is insisting on the Three Marys ceremony which is an early version of the Visitatio Sepluchri with Peter and John, in other words two clerics instead of three. Of course we should be happy with images from either of these ceremonies but I think the latter is more likely as there seems to be more emphasis on the display of the cloth in the recorded liturgies of the Visitatio. The theatrical impact would have been enormously enhanced if there were images on the displayed cloths. Having spent two and a half years and more on medieval relic cults, I am used to so many stories ( and miracles ) invented in the hope of getting pilgrims to believe that you had an authentic relic that I dispair of actually finding out what really happened at Lirey. It is always interesting to me that neither of the de Charney males are linked to the claim for authenticity. There is no evidence that the much in demand Geoffroi senior was ever at Lirey in these years before his death in 1356 and Geoffroi junior seems to have been happy to exhibit the Shroud with the restrictions Imposed on him by Clement VII ( that it had to be announced that it was not authentic). The difficulty is intensified by the period. With a third to half the population dead from the Black Death and a highly traumatises surviving population many of whom believed that the Black Death was a punishment from God, people flocked to new shrines. Lirey was clearly a new early 1350s shrine but we have no record of how it might have related to the traumas left by the Black Death. However, we should be sensitive to this context. I am frustrated that Belting did not give a reference for the sprinkling of water on the eyes as he implies that this was a ceremony at Edessa, not Constantinople.Is it clear from the text Mario quoted that this is a cloth and not a wooden icon? Wiping an image on a cloth with water does not seem a sensible thing to do if you were interesting in preserving the image or the cloth which would decay if damp. It would seem, unless there is a clear reference to this being a cloth, that we are talking of a wooden icon. Having said that , Belting’s alternative scenario of pilgrims sprinkling water on the open( we presume) eyes of the Edessa image also seems to be sure way to have a decayed cloth!.","date":"2015-12-23","mins":"1:45 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217161","author":"charles_freeman","post":"Fascinating source,Hugh. Now is this THE Shroud or another one? In 1450, it was still in the possession of Margaret de Charny and she had just been ticked off by the bishop of Liege for exhibiting it without papal approval. She is then recorded as taking it to Macon before going on to give it to the Savoys. Cf. Th is account with that of the St. Clare’s ‘s nuns in 1534..","date":"2015-12-24","mins":"1:43 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217238","author":"charles_freeman","post":"Thanks, Hugh.I assume that the Semur is the medieval town which still has its core intact today. There would appear to be a tradition of exhibiting a shroud there with many wounds of Christ on it. It is hard to know these wounds would not have been seen without having been painted on. So here we MAY ( lots more work to be done)have a reference to a similar ceremony to that at which the Turin Shroud was first exhibited. An important new avenue of research..","date":"2015-12-26","mins":"7:18 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217162","author":"charles_freeman","post":"Also see Paul Zanker, The Mask of Socrates, which traces the beard back to Rome about AD 300. Ties in the development to Christ as a philosopher. The book is available online with illustrations free. The idea that a single image could spark off an artistic revolution across a very wide area but leave no documentation was always far fetched. In so far as the earliest representations of the bearded Christ are in Rome, It would assume that the Shroud was originally in Rome , not the east , but no documentation to support this. Again the Shroud could simply have been copying the conventional iconography of the medieval Christ. . . . ..","date":"2015-12-24","mins":"1:53 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217259","author":"charles_freeman","post":"I see Colin is now arguing that the Shroud was never owned by the canons. I am sure he has read through the judgements of the various ecclesiastical courts of the first half of the f Iteenth century whichsaid that they did have title as was acknowledged when the Shroud was removed for safe keeping by Margearet’s husband. The canons managed to threaten Margaret with excommunication when she did not give it up and they persisted even after she passed it on to the Savoys in1453. Eventually they had to give up. But no doubt Colin has found alternative sources which deny this..","date":"2015-12-26","mins":"3:29 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217169","author":"charles_freeman","post":"I don’t know whoever was the first to dream up the idea of the ponytail. The early depictions of the Shroud, without any exception that I know of, show the hair falling fully back across the neck. What we have is the result of deterioration of the original image which could possibly be interpreted as a pony tail but only by someone who had never studied the original depictions we have of the Shroud..","date":"2015-12-24","mins":"4:40 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217262","author":"charles_freeman","post":"P.S. So far as I remember Beldon Scott claims that Geoffrey senior gave the Shroud to the canons. ( Can’t get to my study to check now we have settled my 95 year old father in law down for the night there,) As it is a mantra of professional historians that all knowledge, especially in the very complex area of medieval texts, is provisional, I am happy for Colin to put forward alternative explanations but it is not clear whether he has read the evidence of the ecclesiastical courts backing the canons and rejected it for some reason or not been aware of it all. I can’t be bothered to wade through yet more of Colin’s rapidly changing thoughts as ,as soon as one has read and digested one of his suggestions, he has moved on to another, so probably by the time I am back in my study it will be too late to comment here. Still It is for Colin to build up his own following on his own website. It would be good if he could actually stay still for a bit or come to a conclusion without us having to wade through acres of changing ideas, and not taking them seriously because he may have changed his mind 24 hours later!.","date":"2015-12-26","mins":"4:03 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216907","author":"charles_freeman","post":"And that same stitch is used to this day to sew two different textiles together. My wife recognised it immediately( from a photocopy of the original Masada report) as one she used in her days as a theatre costume designer. In the report of the Israeli textile specialist ( sorry I am in the US at present and haven’t the article to hand) he told of similar ninth century examples. A search for Flury Lemberg online will show her expertise. I was always worried that the comment about the stitch was taken from an interview and we have no idea how the interviewer interpreted or quoted her remarks. I prefer her articles as she was in control of the whole text, not subject to the interpretation of an interviewer who may have had biases of their own. However as no three in one herringbone weave has ever been found from the first century, I am not sure how she talks of the weave being compatible with the first century. Perhaps she knows of examples that other experts on ancient textiles I have consulted are not aware of. The fullest account by a specialist I have talks of possible tunics in this weave in wool in the second century ( from Egypt) and in silk in the third and fourth centuries. This three in one weave is especially good in silk as it catches the light and that is why it was used for Rowan William’s inauguration robes as Archbishop of Canterbury..","date":"2015-12-20","mins":"3:02 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216919","author":"charles_freeman","post":"Thanks I have an (English) article on the woollen three in one at home but probably the same second century example that you quote, from a remote location on one of the trade routes across the eastern desert of Egypt. So far as I remember the fragments are so decayed that it is only speculation that they are tunics, possibly Roman, rather than Greek. As F L would seem to confirm, they are unique to this location..","date":"2015-12-20","mins":"8:24 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216920","author":"charles_freeman","post":"My Greek lexicon does suggest that the word sindon was originally used by the Greeks of fine cloth from India ( Sind is a region of India) but then became a word to use generically of any fine cloth, usually in linen. Hence its use in the New Testament by which time the Indian origins had been forgotten. If you are suggesting that any of the DNA found on the Shroud hooverings is related to the or Iginal weave and not to the vast amount of handling by later generations, then you are spoilt for choice of where it might have been woven. Yet, why, when we have so much evidence of handling over the centuries, any of the DNA samples might specifically be assigned toto the original weave of the cloth defeats me..","date":"2015-12-20","mins":"8:34 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216924","author":"charles_freeman","post":"Thanks, Giano Marco. Very interesting on the woollen or goat hair textiles. I need to read it carefully. I assume that the English article I was sent on this site was possibly a translation or resume. They make the point that the torsion of the spin is always ‘s’, typical of these Egyptian textiles which suggests that there is no link to the Shroud as an Egyptian textile as the Shroud is ‘z’ spin. They also stress the unique nature of this weave so I do not think there is anything here for Shroud studies especially as we are looking for linen examples, not wool or goat’s hair..","date":"2015-12-20","mins":"9:43 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-203298","author":"charles_freeman","post":"No, it can’t be based on anything of mine as I always argue that the Shroud was never created to deceive but was a cloth created for some other liturgical function but which was adopted as a relic. It was a painting if the early depictions are anything to go by, but with the surface disintegrated we appear to only be left which the discoloured linen under the gesso and paint..","date":"2015-06-23","mins":"12:10 am","url":"https://shroudstory.com/2015/06/22/the-day-was-not-about-the-shroud/","cat":"2015","title":"The Day Was Not About the Shroud"},{"id":"comment-216921","author":"charles_freeman","post":"Sorry Sind was allocated to Pakistan not India in 1947 but the name for the region goes right back and there were early Greek trading contacts..","date":"2015-12-20","mins":"8:39 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-203299","author":"charles_freeman","post":"The Catholic Herald did not address any of the real issues in my article and I sent a letter of complaint to the Editor in that his chosen expert did not seem to know anything about the medieval context which my article was concerned with. What we need to work from is the mass of depictions which have not in themselves faded and other info. Such as medieval treadle looms and the iconography of the front and back scourge marks. There was no evidence from anything I have read of Barrie’s that he is up to speed on the medieval context within which my article was set and I am surprised the Herald did not ask a medievalist to comment. Still one cannot control what the press say. Anyone who wants to read my arguments can easily find my article in a Google search under Shroud Turin and apparently it continues to be widely read..","date":"2015-06-23","mins":"12:21 am","url":"https://shroudstory.com/2015/06/22/the-day-was-not-about-the-shroud/","cat":"2015","title":"The Day Was Not About the Shroud"},{"id":"comment-44954","author":"charles_freeman","post":"O.K. I think ‘troll’ is rather extreme. I only post what is backed up by scholarship or is clearly my own opinion as author of A New History of early Christianity and Holy Bones, Holy Dust on relic cults, both published by Yale University Press. Read Roger Bagnell’s Early Christian Books in Egypt if you have not already done so. The more significant problem is the failure of Shroud scholarship to move on into avenues such as the early relic trade from Jerusalem to northern France and Constantinople that might well reap rich rewards. But I suppose that means ditching Wilson and Edessa and that s a bridge too far..","date":"2013-09-21","mins":"7:21 am","url":"https://shroudstory.com/2013/09/19/the-divine-jest-the-shroud-of-turin/","cat":"news_&_views","title":"The Divine Jest: The Shroud of Turin (Amended)"},{"id":"comment-44801","author":"charles_freeman","post":"I am sure everyone knows that Thiede’s datings are controversial. When he dated a papyrus of Matthew to the first century AD he said it compared well with scripts from the papyri found at Herculaneum that were, of course, covered by lava in 79 AD. All looked good until Robert Bagnell, and others, pointed out that the papyrus from Herculaneum was actually first century BC and so Thiede had found something truly remarkable a gospel of St. Matthew dating to before Christ was born. Much merriment all round – I don’t think there has been support for Thiede’s first century AD attribution either. I have seen the titulus in Rome still venerated – by a nun who came in to pray before it when I was last there. Certainly relics were remade. The Volto Santo at Lucca is not the original. This is supposed to have been destroyed by pilgrims taking slivers of wood off it!.","date":"2013-09-20","mins":"3:45 am","url":"https://shroudstory.com/2013/09/19/the-divine-jest-the-shroud-of-turin/","cat":"news_&_views","title":"The Divine Jest: The Shroud of Turin (Amended)"},{"id":"comment-143564","author":"charles_freeman","post":"Fascinating article on the pollen, Hugh. It opens up lots of questions and so helps Shroud studies move on..","date":"2014-08-12","mins":"12:16 pm","url":"https://shroudstory.com/2014/08/12/the-latest-bsts-newsletter-is-out/","cat":"news_&_views","title":"The Latest BSTS Newsletter is Out"},{"id":"comment-174285","author":"charles_freeman","post":"When we are discussing all these ‘shrouds’ it is is important to realise just how many there were once were. Karl Young, the great authority on the Quem Queritis ceremonies, claimed that there were no less than 400 documented examples but the grave cloths actually shown to the congregation on Easter morning varied from church to church. Young noted that, while in the descriptions of the grave clothes the sudarium (‘facecloth’) and the linteamina (the wrappings of the body) are usually shown separately, ‘the dramatic ceremonies at the sepulchre followed the Gospel traditions with considerable freedom, using sometimes a single cloth called sindo or linteum, sometimes a cloth called sudarium, sometimes several pieces called linteamina, and again both a sudarium and linteamina.’ (Karl Young, the Drama of the Medieval Church, Oxford , 1933, pp.134 5.) Some of them had images. So when I read of all these controversies about which ‘Shroud’ is which my first response is that we are probably talking of independently produced grave cloths of all shapes and sizes. As I said in an earlier posting, because painted linens had the image only on the outer fibrils of the cloth (thanks STURP), they were very vulnerable to disintegration which is why we have so few painted linens left today.it was the folding and unfolding that did for them and the survivors today are mostly ones that were pasted onto a backing board. We must distinguish between linen ( it had to be linen to fit in with the gospel accounts) cloths produced specifically for the Quem Queritis ceremonies and those cloths/wrappings/facecloths believed to be authentic shrouds. In medieval Europe the top earner was probably the Shroud at Cadouin as this had been brought back from the Holy Land and assumed to be the real thing we now know that it was produced in the workshop of the caliphate..","date":"2014-12-02","mins":"5:54 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174630","author":"charles_freeman","post":"‘So these are facts about the Shroud that I submit have been proven: the Shroud is not a painting and the blood is real.’ The Shroud is not a painting. I agree but it WAS a painting until the pigments fell off under repeated folding. The Zittau Veil is a good comparison because large parts of the original painted surface survives and one can see the ares where the pigments have fallen off leaving images ( of Mary and Elizabeth at the Visitation in one example) that have the same ghostlike quality of the Shroud images. A good match but further research need to confirm that they have the same qualities. The presence of blood is hotly disputed. Mike Spyer, professor emeritius of physiology at London University, read through all the STURP reports on blood that I was able to send him and he said he was totally unconvinced. I cannot remember whether it was him or another expert I consulted who noted specifically the absence of potassium and suggested that it was probably the protein from the glue made from animal products that had been misinterpreted as blood.. No one other than Adler or Heller has ever found that blood dries as red as that on the Shroud. We also have the failure of the Forensic Department in Modena in 1976 to find any sign of blood in their samples. Then you have the problem that there is evidence that blood type AB only appears in the second half of the first millennium (or rather that there is lack of evidence that it occurs earlier) but I suppose that the Son of God does not have to conform to such constraints. So shall we just say that the presence of blood is not proven.I shall leave it at that as I am not as expert as those I have consulted on the matter.They certainly don’t think STURP found human blood..","date":"2014-12-04","mins":"11:38 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174749","author":"charles_freeman","post":"The linen Zittau Veil (1472) is perfect as it has painted panels and faded panels on the same cloth. It also has evidence of the images on the outer fibrils only the conservationists note that no pigments except for some red madder penetrate into the cloth. They found signs of the protein that made up the size that sealed the outer fibrils so that the paint could be added.They also note that it was made up of sections of a width between 108 cms and 116 cms that,they say, reflect the loom it was made on. So it fits very well with what we know of the Shroud. – in fact, it is brilliant evidence for anyone who asks the question of why the images on the Shroud are as they are. In my lectures I use the English Visitation panel to make the point and everyone can see similar faded images. They conservationists go on to show how the artist used black and white shading to create a three dimensional impression. As you can see faded and painted images side by side you can see how the Shroud deteriorated. Note my comment on the pigtail above. The article that describes all this is in Caroline Villers’. Edited series of essays on medieval textile painting, the Fabric of Images, Archetype Books,London ,2000. I keep trying to get Colin to read this book but. Obviously without success. If Heller and Adler were all that they are cracked up to be they would have been able to write a survey of the blood evidence that would have convinced a professor off physiology. They clearly were not able to do so and the idea that the redness of the ‘blood’ reflects the stresses of a tortured man has never been found by anyone else. But your mind is made up so however much evidence I give you will never be enough. I am better off working with people with open minds who can assess the evidence for themselves..","date":"2014-12-05","mins":"7:58 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174751","author":"charles_freeman","post":"P.S and articles by Kelly Kearse were included among those I had read through by professor Mike Spyer who is happy to be quoted as ‘totally unconvinced’...","date":"2014-12-05","mins":"8:00 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174755","author":"charles_freeman","post":"Thibault. It is quite clear that it is not proven that there is blood. This backs up my claim that the existence of human blood on the Shroud is not a fact. It is a belief held by some people that has not yet been presented in a form that convinces experts in these fields. I am happy with ‘not proven; as Caroline Walker Bynum’s book Wonderful Blood shows just how many blood cults involving Christ’s blood were about in the thirteenth and fourteenth centuries. Some were the dried blood of Christ, they were beaten to it by a German monastery which had some liquid blood of Christ. Then there were the consecrated hosts that bled, as in the case of miracle at Bolsena where the blood was still to be seen on the church floor. Then there were stolen hosts which bled – all this was accepted as the true blood of Christ, of course as a result of transubstantiation. Then there were the figures of Christ on the Cross that bled when some infidel struck them. Some of this blood was probably human and why not add it to the Shroud, although I trust my expert opinion as he could not find anything that hinted of human blood and felt that that Modena tests should be treated as pretty conclusive if they had not had a single one of the standard tests showing blood..","date":"2014-12-05","mins":"9:09 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174895","author":"charles_freeman","post":"What you have here is a painted linen cloth dated to 1472. The paint remained fairly extant until the Second World war when the veil was looted and used by some Russian soldiers as a steam bath which led to the pigments on large areas of the centre coming off. It was restored so far as it could be in the 1990s. So what you have still existing,e.g. In the top left hand corner, .is an original painted linen and what you have in the centre is what happens to these paintings when the pigments come off. It leaves a shadowy image with large parts of the original missing completely. In the Shroud we just have the shadowy images of what was once a a painted linen. The Veil is similar to the Shroud in many ways. It is made up of sections of 108to 116 cms wide as the conservators say this is what one expects from a medieval loom. ( No need to get into Assyrian cubits.) The paint does not penetrate the fibres and they show from the remains of animal proteins that there was a size or sealing Gesso applied to the outside fibrils only as it also was for the Shroud ( thanks STURP). The only paint that got through the gesso was red madder – not sure why this got through while other pigments did not but presumably the liquid was more fluid and less made up of pigments than the rest of the paint. And it is also noted how the artist used shadings to give the impression of three dimensions. So what we have it evidence of how a linen was painted and how it looked ( the Visitation panel is the one I use in lectures) when the pigments come off leaving a, dare I say it, Shroud like image behind. So a quick glance and immediate rejection of the relevance of the Zittau Veil is a totally inadequate response. Please raise your game..","date":"2014-12-06","mins":"5:56 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174891","author":"charles_freeman","post":"I stick to non proven. It is quite clear that there are experts out there who are not convinced by the evidence as it at present presented. In fact they regard it as totally inadequate. I hardly need to get a top professor to write out a long report on this when he has considered a wide range of evidence from STURP and does not feel that it even starts to show human blood – rather some evidence of animal protein. However, as some evidence of protein was also found on the Zittau Veil that is considered to be related to the animal products used in the gesso or tempera then this is what one would expect. The real problem with the Shroudies evidence is it he total failure to convince anyone outside their own narrow circles. It is your responsibility if you wish to promulgate the view that the Shroud is authentic to get some evidence that the academic world finds acceptable. If not you risk confusing people who are ,for obvious reasons, interested in the origins of the Shroud, but deserve to have a balanced approach to the evidence that we have until further testing is allowed by the Vatican..","date":"2014-12-06","mins":"5:43 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-175062","author":"charles_freeman","post":"Art Science. The first indication about the Shroud having been gessoed is that the image is just on the outer fibrils, as is the image on the Zittau veil. This is because they first sealed the cloth with gesso so that the pigments would not seep through, although it is clear from the Zittau Veil that red madder did penetrate in small quantities. So an image on the outer fibrils only is an indication of gesso having been applied – if there had not been a gesso barrier the image would have gone through into the cloth. The next indication of gesso was the ‘large’ quantities of calcium carbonate found by STURP that appear to have covered the whole surface of the Shroud. Calcium carbonate or sulphate was used in the gesso and is still used today if you look up modern gesso products. Another indication of gesso is animal proteins as the calcium was usually mixed with a glue – often of rabbit skin boiled up – again you can find instructions even today of how to make your own ( first skin your rabbit!). While Mike Spyer who advised me on this could find no evidence at all of human blood in the accounts, he did suggest that the STURP findings were compatible with animal proteins. So I am working on the assumption that, together with the evidence from the Zittau Veil, we have good evidence that the Shroud originally had a gessoed surface. I completely agree that we need to move on from there to look at the specific way that the images were then created and see how far these are different from what might have been expected. Unfortunately the full report on the Zittau Veil is in German and I only have the summary. It is interesting that the width of the sections that make up the Shroud, that the article says is related to the width of a medieval loom, is very similar to the width of the Shroud. So as I have said many times before ,there is still a lot to research of the Shroud but as there is no scientific evidence of a first century date and the preservation of a linen from that period, other than in the very specific conditions of closed Egyptian tombs, is unknown, for me everything comes together to show a medieval context within which we must find the meaning of the Shroud. I think that is a perfectly reasonable stance to take and there is a lot of evidence that I provide in my article that offers further support to this..","date":"2014-12-07","mins":"4:07 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-175128","author":"charles_freeman","post":"Hugh. I think that there were not what could be called positive human blood results just results that were interpreted or misinterpreted according to my sources as human blood. Let’s stick with non proven. Remember that this debate was started with the claim that the human blood was an established FACT but like all scientific claims it has to be supported or replicated and the STURP claims have not been by any test independent of ST URP. The Modena ones suggested that this was not blood. Of course, the tapes can be released for new testing In an independent and respected forensic lab. Y One of my audience was a judge who has presided over many criminal trials, although now retired, and I met up with him today.. Having seen endless photographs in his long career of criminal cases, he said that having seen the photos of the Shroud blood stains and I put in some close up ones he said that there was absolutely no way that this was dried blood. I am sticking to non proven..","date":"2014-12-07","mins":"3:23 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-175211","author":"charles_freeman","post":"So are you saying at two thousand year old blood turns back to red? Without replication of Heller and Adler’s tests I am sticking with ‘ non proven’. It is clear as can be that what STURP produced has not convinced anyone outside STURP and its supporters and a ‘scientific’ test result that cannot even be presented in a form experts in this field find convincing is not really much of a test result. So however many hundreds of papers these STURP members produced they had clearly not learned how to present their findings in a way that could be assessed by experts in this field. Replication of the tests in an independent forensic laboratory is needed..","date":"2014-12-08","mins":"7:15 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-175230","author":"charles_freeman","post":"I think everyone is agreed that the colour of the ‘blood” is too red for the usual dried blood. I have not yet found anyone who has seen a close up who does not agree and it was Barrie Schwortz’s concern as well. Heller or Alder came up with the idea that the blood of a human being under stress was likely to dry red. This has never been replicated and so cannot as yet be counted as scientifically valid. We had better sort it out if true it would revolutionise criminal trials that involve bloodstains..","date":"2014-12-08","mins":"11:16 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-175247","author":"charles_freeman","post":"I will stick to the best fit hypothesis that this is a typical medieval painted linen, similar to others that exist, where the pigments have fragmented and fallen off. The panels on the Zittau Veil show the same phenomenon. I would not hold this view so strongly if a coherent alternative way of creating the image had been put forward. The fact that there are about ten alternatives, none of which has general support, says it all to me..","date":"2014-12-08","mins":"1:29 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-175379","author":"charles_freeman","post":"Scepticism and rage don’t really go together. A sceptic withholds judgement on the grounds that the evidence is not really good enough or presented in a way that is not convincing and so (s)he does not need to get worked up. So I have used the words ‘ non proven’ recently as that leaves me in the clear if something IS then proven. In contrast, someone who is committed to a point of view that is then challenged often does get worked up..","date":"2014-12-09","mins":"11:05 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173404","author":"charles_freeman","post":"Well, if the Besancon Shroud is a copy of the Turin Shroud you could have fooled me!.","date":"2014-11-28","mins":"2:08 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173416","author":"charles_freeman","post":"P.S. All we have on what the Besancon Shroud looked like is the painting(?) of it made by Pierre D’Argent in the 1560s and still in the archives at Besancon. We had to ask for permission to use it in my article and at first no one at Besancon knew where it was and sent us an illustration from a seventeenth century book they had with it in it. Then they announced they had found the original and sent the HT picture researcher a big copy of it that we had of course to pay to use. As everyone seeing the Shroud in the fifteenth and sixteenth centuries remarked on the prominence of the blood stains, the scourge marks, the Crown of Thorns, then these would surely have been reproduced on a copy – and the head is so very different! It is also, of course, a single image not a double one. It is surely obvious that the same body was not represented on the Shroud of Turin as on the Besancon Shroud, so the theory that they were used consecutively in Jerusalem doesn’t make any sense. My own view, as I put it in my article with backing from a 1790 source, is that this was another of the Quem Queritis cloths – what is has in common with the Shroud is that the wound is not shown on the conventional right (conventional not from any gospel source but the medieval iconographic convention) but on the left side of the body as these cloths ( whether you agree with me or not that the Turin Shroud is one of them) were symbolic representations of the marks Christ might have left on the burial cloth if he had lain on it..","date":"2014-11-28","mins":"3:36 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173418","author":"charles_freeman","post":"Hugh is certainly right that. People began to question relics more as they travelled around. I am not sure whether you can find the full text online but I wrote an article on Guibert Nogent ( died 1124) for History Today as he began to questions certain cults that had sprung up around him that had no basis in reality. But my argument is that no one who knew that gospel accounts would have been fooled by a single cloth with images on it and no forger would have bothered to try it on. This was surely a cloth created for another purpose that then, probably because of miracles associated with it, converted into something else.in 1390 the Church( Clement VII) reaffirmed that it deserved veneration and even an indulgence but that it was not the real thing. I think he was just reasserting the original status quo. If it had a reputation for miracles, of course, it would have been worth a visit..","date":"2014-11-28","mins":"3:44 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173439","author":"charles_freeman","post":"No I don’t. It is attributed to Pierre D’Argent in Diane Wolfthal’s The Beginnings of Netherlandish Canvas Painting, Cambridge 1989. It is perhaps this misattribution that was the reason why they could not find it at first when they were asked for it..","date":"2014-11-28","mins":"7:36 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174726","author":"charles_freeman","post":"Can anybody put me on to the scientific evidence that the Shroud dates to before AD 33?.","date":"2014-12-05","mins":"4:15 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173442","author":"charles_freeman","post":"Colin, I have repeatedly said that we need a full data base of all the depictions of expositions. The Crown of Thorns is shown on several different ones, not just the Tempesta, over 150 years. It is also mentioned by Antonio de Beatis as early as 1517 when he saw the Shroud close up in the chapel at Chambery.. How much more evidence do you need? When I show my lecture, there are basic seven depictions from 1578 to 1703 I show. I warn the audience that some of these ( not the Tempesta who was resident at the court and must have seen several exposition), were quick drawings and I show the difference between the different depictions. I then go on to suggest features that they share in common. The Crown of Thorns is one of them and is typical of the iconography of the fourteenth century when they began to show the Crown in place after Christ had been removed from the Cross. The thumbs are another it is interesting that you can see how the angle of the thumbs is the same in 1578 as it was in 1690 and 1703. So this is good evidence but I always go back to the crucial point. We need ALL these depictions, observers’ descriptions, copies, etc, on a single data base open to all. I can convince an intelligent audience who is actually looking at them but I want them to be seen by the world at large so that proper scholarly debate can take place. I am sure you support me on this you might be able to move on yet again with more theories!.","date":"2014-11-28","mins":"7:45 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173453","author":"charles_freeman","post":"No grudges here simply lack of evidence to back up Colin. But I do admire the way that Colin is so sure that it was purely imagination and that there was never any vivid imagery. Two separate accounts say that the blood was so vivid that ait was as if had been shed today/ recently. Why should they be imagining this? We have accounts from 1449 and 1703 both talking of painting= imagination again? Onto the data base one day, I hope!.","date":"2014-11-28","mins":"8:34 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173741","author":"charles_freeman","post":"Not true,Colin,as if you read the full accounts you find they include references to the Crown of Thorns in place as well ( and this is backed by many representations of the Shroud with the Crown in place) as one would expect from post1300 iconography ( as I show in my article, the Shroud is spot on for the iconography of t His date and it is interesting to see the head measurements below that give further confirmation of this.) The last sentence I gave in my posting above shows accounts of 1449 and 1703 using the word painting. I can’t see why you NEED to replace the mass of evidence that this is a painting with an esoteric version of your own that, unlike medieval painting on linens on which there is an increasing amount of material, would make it totally unique and unknown to any other professional art historians. The evidence that the Shroud is a one off in this sense is simply not there. Where the Shroud is a one off is that it ( whatever else it has been imagined as being since) appears to be the only survivor of the Quem Queritis ceremony and therefore of importance for that reason alone. That is why I was asked to speak to a group trying to raise money to restore a MEDIEVAL church. I think your problem is that because the Shroud is a line survivor, you think that it was unique in its time when we have references to thousands of other cloths with images on Christ on them. See the article I posted .Extracts from that show that despite accounts of painted linens in England , not a single one still survives. As the author noted, if folded, these linens lose their painted surface very quickly and again the Shroud seems remarkable in hanging on to its own for so long..","date":"2014-11-30","mins":"3:08 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-197371","author":"charles_freeman","post":"‘ peculiar rigorous view of history’ !!!! So are historians to be blamed for being rigorous? Nothing I have seen among earlier references to shrouds, images on cloth, specific icons, of which there were many references, can be shown to link specifically to the Shroud now in Turin. I do not know of any specialist in this complex area who thinks so which is why the authenticist view has failed to gain any support in the academic world. Whether this failure is important to the authenticists I leave it to them to decide..","date":"2015-04-24","mins":"12:13 am","url":"https://shroudstory.com/2015/04/23/the-real-meaning-is-not-authenticity/","cat":"2015","title":"The Real Meaning Is Not Authenticity"},{"id":"comment-197373","author":"charles_freeman","post":"P.S. If there was any significant scientific evidence that the Shroud dated to before 50 AD ,I would follow two simpler lines of provenance. 1) there are documented relics from the ‘ Lord’s tomb’ in relic collections close to Lirey that are known to have arrived there from the Holy Land in the first millennium. An obvious place to start. 2) When Jerusalem was still part of the Byzantine empire in the fourth and fifth centuries, the age when relic collecting began, there are documented accounts of the transfer of relics to Constantinople by Pulcheria, the sister of the emperor Theodosius II, to add to the transfer of Helena’s relics from Jerusalem a century earlier. Both are more obvious trails of provenance than the Ian Wilson hypothesis. I am amazed at the gullibility of those who have accepted this without questioning. It has completely closed off alternative studies of early relic transfers direct from Jerusalem and made Wilson a laughing stock among the Byzantine specialists. What an enormous waste..","date":"2015-04-24","mins":"12:49 am","url":"https://shroudstory.com/2015/04/23/the-real-meaning-is-not-authenticity/","cat":"2015","title":"The Real Meaning Is Not Authenticity"},{"id":"comment-197805","author":"charles_freeman","post":"To return to the lost theme of this posting, this ambiguity seems to be quite common in Italy, although I leave it to the Italian contributors to confirm this. I was asked to talk to a group of Italian guides( a spin off of my work in Italy) and the words that come up often when talking about relics are ‘ Non e vero, ma ci credo’. This was originally the title of a 1950s comic film but has been adopted as the attitude to many relics. ‘We know it is not true but we go on believing it.’The strongest point is that these many relic cults are so deeply woven into Italian culture that to think of getting rid of them would be impossible. So the idea that a relic might be authentic is kept alive even though many in their heart of hearts know that it simply cannot be true. I can understand why Zaccone’s point about the obsession with authenticity fits with this attitude and I sense, and again I need confirmation from Italians, that many are getting rather embarrassed that the Church is allowing belief in authenticity to go unchallenged. We shall see what pope Francis says on the matter!.","date":"2015-04-28","mins":"1:53 am","url":"https://shroudstory.com/2015/04/23/the-real-meaning-is-not-authenticity/","cat":"2015","title":"The Real Meaning Is Not Authenticity"},{"id":"comment-197700","author":"charles_freeman","post":"The reason why the Antikythera Mechanism is still not fully understood is nothing to do with the inadequacies of science. It is because it has decayed over time,especially after centuries under water and there is no similar surviving mechanism to compare it with. However, the Greek Government allows access to established experts and so over the years more sophisticated imaging equipment has revealed some of its secrets. In fact, the research is proving an excellent example of scientific method but we may never be able to find the whole truth about the complex mechanism. Similarly with the Shroud, the centuries of deterioration have made the original creation harder to understand and there is the added problem of lack of access for experts. A pity when more sophisticated technology is readily available to examine the Shroud..","date":"2015-04-27","mins":"1:53 am","url":"https://shroudstory.com/2015/04/23/the-real-meaning-is-not-authenticity/","cat":"2015","title":"The Real Meaning Is Not Authenticity"},{"id":"comment-197909","author":"charles_freeman","post":"I agree with Louis that there is no proof of forgery. It would not make any sense for a forger to create a large cloth with images on it when anyone reading the gospels or seeing medieval frescos of Christ’s deposition and burial would never have seen the Shroud this way. Much better to look for an original liturgical function and the conversion from icon to relic when this was such a common occurrence in the medieval period. Apparently the Shroud will not be on display again until 2025, so the pope can talk about faith and let it be folded away again for the next ten years. Or he can say,’ Come on, let’s settle the argument. Let’s find the top textile conservationist experts and ask them to examine the Shroud and have another radio 14 test for good measure.’.","date":"2015-04-29","mins":"1:33 am","url":"https://shroudstory.com/2015/04/23/the-real-meaning-is-not-authenticity/","cat":"2015","title":"The Real Meaning Is Not Authenticity"},{"id":"comment-135630","author":"charles_freeman","post":"Can I say that having led a tour to Turin last year it is one of the most civilized of Italian cities. The centre is almost traffic free after 9 am and stunning Baroque streets radiate out from the former Royal Palace. There is wealth of cafes and you can even buy a Chocopass allowing you to get free samples from the many small chocolate shops. The Slow Food Movement was born here and excellent food can be got at good prices. Don’t miss out on the superbly restored royal hunting lodges, a short distance from the centre and there is the Agnelli art collection in the old FIAT factory as well as excellent museums of cars and cinema. So once you have venerated the Shroud hang about a bit to enjoy the city! My group had a great time..","date":"2014-07-06","mins":"7:57 am","url":"https://shroudstory.com/2014/07/06/tourists-or-pilgrims/","cat":"2015","title":"Tourists or Pilgrims?"},{"id":"comment-52800","author":"charles_freeman","post":"O.K. There is no evidence that relics from the passion of Christ were venerated before the discovery of the ‘True Cross’ by Helena in the 320s. You show no idea of just how many thousands of relics there were around. It used to be thought that the medieval mind was backward and credulous but I deliberately highlighted cases where within the medieval period itself there was concern about the number of fakes see the ridicule that the Canterbury pilgrims gave the Pardoner ( the seller of relics) in Chaucer. Medieval people were not fools – from the popes down they could see quite clearly what was going on this is why pope Innocent III and other popes tried to bring some order into the market! What do you mean by ‘duly certified’? There was no coherent system of certification – as you will know from your studies of the Shroud there was no way then of sorting out whether it was authentic or not in the medieval period or not, especially when no pope was prepared to back it as authentic ( as they still do not). I believe that nowadays the Vatican does try and sort out the fakes from the authentic. I am told that if you ring them up to ask which of the seven heads of John the Baptist is the right one, they will tell you the one in Damascus. Don’t ask me how they know this but they certainly accept that the others are not the real thing. I am sure that all of us, not only myself, will benefit from your as yet unpublished work on the Shroud I am sure that Dan will be happy to provide a link to it once you have finished it. Good luck with it, Charles..","date":"2013-11-26","mins":"4:57 am","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","title":"Where to begin?  First pour two cups of coffee or a full pint or . . ."},{"id":"comment-29845","author":"charles_freeman","post":"As I write as a historian for two university presses (OUP and Yale University Press), I am always subject to peer review, on my proposals themselves, on my drafts and on my final versions. I am also asked to comment, as probably one of three ‘reviewers’, on proposals sent in. In the vast majority of cases I see the peer reviews on my own work although they remain strictly anonymous and often i am able to clear up points reviewers have disagreed with to the satisfaction of my editor (who makes the final decision on publication as with most academic journals). It is a system that works well. I am not a scientist but there does seem to be a genuine problem, accepted by many contributors to this site, relating to the provenance of samples from the Shroud. I leave it to others to comment but I am always amazed that Ray Rogers’ work on the 1988 samples is described as ‘peer reviewed’ when he fails to provide any supporting evidence that the fibres he used were genuinely those cut off by Gonella. He suggests that they have not come to him directly so there is every possibility that they might not be the originals or have been contaminated on the way. There is even talk on this site of an intermediary who passed on materials. So who are the ‘peers’ who considered Rogers’ paper acceptable? Was he able to provide them with further evidence he chose not to publish publicly that convinced them of the authenticity of his fibres? On a separate note, it would seem important to know where these fibres are now, following Rogers’ death. Who actually owns them? Is anyone authorised to pass them on to an independent laboratory specialising in textiles to see if Rogers’ findings might be replicated?.","date":"2013-04-08","mins":"4:27 am","url":"https://shroudstory.com/2013/04/07/when-it-comes-to-the-shroud-of-turin-has-peer-review-lost-its-luster/","cat":"news_&_views","title":"When it Comes to the Shroud of Turin, Has Peer Review Lost its Luster?"},{"id":"comment-52823","author":"charles_freeman","post":"O.K. Since when has the CNN been a source that scholars use for listing relics? Are you really suggesting that whenever anyone claims to have part of John the Baptist it is genuine? I think we must agree to differ. I spent three years researching medieval relic cults and noted how they rose and fell, new relics turned up from nowhere, often without any provenance, there were battles between rival monasteries over who had the true body of so and so or the better phial of Christ’s blood and, with a thousand year gap between the time of Christ and the Middle Ages, virtually no relic had any evidence of its provenance anyway. You do not seem to be aware of the serious theological objections to relics on the grounds that they encouraged the worship of objects at the expense of God. One of the greatest of the fourth century theologians , Basil of Caesarea, put it as follows: ‘ As the sun does not need the lamplight, so also the church of the congregation can do without the remains of the martyrs. It is sufficient to venerate the name of Christ, for the Church is his bride, redeemed by his blood.’ I assume that you don’t live in Europe but if you are over here, do wander around the sacristies of some medieval Catholic churches – you will hardly believe that there were quite that many saints in existence as you will find parts of in the reliquaries and that is after the church cleaned out so many in the late nineteenth century..","date":"2013-11-26","mins":"12:13 pm","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","title":"Where to begin?  First pour two cups of coffee or a full pint or . . ."},{"id":"comment-52833","author":"charles_freeman","post":"OK 1) Sources. If you make a modest investment in my book Holy Bones, Holy Dust, Yale 2011 you will find nine pages of sources so you should be able to pick and choose that you want for your own work. Incidentally as you will see from the Yale US website reviews, it was warmly received by the Catholic press. 2) ‘Belief in the authenticity of any of them’. Some relics are /were clearly authentic such as the bones of Thomas Becket. As the characters and events in the New Testament have some historical reality behind them,there would have been at one point some authentic relics from the first century. The difficulty lies in tracking those few that have survived the long centuries into the medieval period and beyond. I have nothing against authenticity but I do expect some reasonable proof in specific cases. 3) Basil of Caesarea was not a Protestant. It is a perfectly appropriate Christian response to fear that material objects become a subject of worship in themselves although i would not go so far as to destroy relics because of this. 4) Many Catholics that I have discussed these issues with do not see relics and their authenticity a major issue in their faith and so they don’t get hung up about this (which is why, perhaps, the Catholic press was quite relaxed about my book). Obviously relics as material remains of the Christian past play an enormous part in your approach to Christianity but I do think you have a much greater acceptance of authenticity than the historical context in which these cults have emerged justifies. I wish you wouldn’t accuse the rest of us of lying it does not take the debate in any helpful direction.No doubt we will hear more about your findings when you have finished and published your own research..","date":"2013-11-26","mins":"2:14 pm","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","title":"Where to begin?  First pour two cups of coffee or a full pint or . . ."},{"id":"comment-52902","author":"charles_freeman","post":"O.K. ‘But this is so simple, and reminds well known model in statistical physics, known as Markov chain with a short memory.’ You have lost me but I am a mere professional historian brought up in the standard way of analysing sources and their reliability. My, and that of most professional historians,default position is scepticism not just about relic cults but most other medieval texts/legends. I note in Yannick’s new posting the customary Shroudie belief that somehow sceptics are biassed. No, they are often professionals who have not seen sufficient evidence to support the authenticity of the Shroud. After all the exhaustive texts of STURP failed to come up with anything that suggested a first century origin for the Shroud at least I have not seen anything in their report that suggests this. It is a pity that they did not have any professional historian, art historian or expert in ancient textiles in their team as the opportunity was missed to provide a properly comprehensive report..","date":"2013-11-27","mins":"4:23 am","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","title":"Where to begin?  First pour two cups of coffee or a full pint or . . ."},{"id":"comment-52749","author":"charles_freeman","post":"Many medieval relics were indeed genuine such as the bones of St. Thomas Becket that had never left the cathedral where he had been martyred. It is the older, especially first century, ones that are problematic as there is no record of Christians venerating relics before the fourth century and by then many would have disappeared. Everyone knew there were fakes around – see Guibert of Nogent’s Treatise on Relics from the early twelfth century when he complained that authentic relics were being driven out by fakes and miracles were being deliberately set up. The problem got much worse after the Fourth Crusade when unscrupulous operators took advantage of the flood of relics coming in from Constantinople to create their own. Pope Innocent III had to insist, in 1215, that bones be given proper reliquaries and it was often said you should not trust a relic as coming from Constantinople unless it had a reliquary with Greek writing on it. Pope Innocent also set up commissions to test whether a miracle was genuine or not – and these commission accounts can be fascinating reading with many miracles thrown out as unsupported by any evidence! My wife is a horse dealer of the rare honest variety and she constantly comes across people who have been mis sold horses by dealers who are less scrupulous than she is. The world of relics was the same and everyone in the medieval world knew this especially when travel became more easy and people began noticing that this was the third head of John the Baptist (or,dare I say it, the fourth burial shroud of Jesus) they had come across. By the fourteenth century, people are becoming much more sceptical about accepting any relic as necessarily genuine and the debates between popes, bishops, the de Charnys and the Savoys over the Shroud show exactly this!!.","date":"2013-11-25","mins":"7:48 am","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","title":"Where to begin?  First pour two cups of coffee or a full pint or . . ."},{"id":"comment-216276","author":"charles_freeman","post":"Colin , the book you need is Brian Spencer’s Pilgrim Souvenirs and Secular Badges, Boydell Press, second edition, 2010. Although it is based on badges excavated in medieval London there are lots of foreign badges. Most of them are 3d I assume that it was easier to cast them that way if you want to accentuate the image so there are lots illustrated for you to compare the Lirey badge with (although no example f this badge has yet been found in London). The Lirey badge seems really quite crude compared to some of the better examples (e.g. The pilgrim plaques from St. Denis in Paris of c. 1280 which are very intricate but this was a top level shrine linked as it was to royalty) I assume that once you had your mould you could produce them by the hundred. However, Lirey was not a major shrine so one would hardly expect them to have got a top engraver to make the mould. The vernicles of the Veil of Veronica are discussed on page 252 Delighted to help you on your way but I do think you need to read more widely before you make speculations about the history of the Shrine..","date":"2015-12-12","mins":"3:09 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216281","author":"charles_freeman","post":"Colin, I am referring to L.A. Schwalbe and R.Rogers, Physics and Chemistry of the Shroud of Turin, Analytica Chimica Acta ,135 (1982) , pp.3 49. P. 17 refers to a study by Morris which suggests ‘natural calcium carbonate’. As I only read this paper after I have been studying painted linens and read of the use of calcium carbonate in gesso ( as it still is today), this jumped out at me. Again I am delighted to refer you to a paper of which you are clearly unaware. Much of it is way over my head but it will be obvious to you as a scientist and Hugh no doubt has also mastered it. My main complaint as a historian who has long been interested in ancient objects and has even dug some up is that nowhere in this paper does anyone seem to consider that the Shroud now is not as it might have been originally. From my limited experience as an archaeologist this seemed amazing. I had to use a university library connection to get through to this article but it is downloadable as a pdf. Heller, p. 136., on Roger Morris’ paper presented at a conference at Santa Barbara. ‘Finally the results were presented. There was calcium on the Shroud lots of it, It was evenly distributed over the entire length and width, I wondered where in the world it come from. It was not concentrated in the image areas, so it could not have anything to do with paint , dye or stain.’ Thiink medieval gesso sealing the cloth prior to painting, Heller!!!.","date":"2015-12-12","mins":"3:34 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216288","author":"charles_freeman","post":"Colin, the gesso is not proven but has to be checked out. What Heller reports of the Morris paper, the impression is that the calcium is there in good quantities and spread over the whole surface and this is just what you expect if the cloth was coated according to the prescriptions laid down in medieval manuals, such as Cennino Cennini. Cennini as a Tuscan ,would have used calcium sulphate in his gesso, the northerners had access to calcium carbonate in their local mines and used this So don’t you think that the next time the Shroud has a scanner applied to it we should check this out further?? I have also been told that the aragonite found near the feet might actually be part of the original calcium carbonate. As it appears to have been mislaid we may never know and I certainly know nothing about the relationship between aragonite – which is spread throughout the Mediterranean – and calcium carbonate so cannot assess this. Any mineralogists able to help here? The calcium fits well with the other evidence of paint and also with the evidence of animal proteins ( the gesso binding) which the professor of physiology I consulted over the Heller Adler papers thought they had confused with blood. So it is one part of the picture but fits with a lot else including two direct accounts of the Shroud being painted ,1389 and 1449, and references (De Beatis 1517) to being able to see the images from a distance. So I am taking it as number one hypothesis. From what you say you would not even consider it which suggests something a closed mind The retting scenario means nothing unless there are comparative examples in linen which should be fairly easy to check out. It gave the impression of being a rather desperate solution picked out of the air especially as flax was often retted in the open air (!). As so often in Shroud research, no one ever seems to think of relating what is found to comparative examples whether pilgrim badges, other formerly painted linens, etc. Yet this is almost certainly where the solution to the Shroud’s origins will eventually be found. I may be biased in favour off unfolding research being helpful but this is just how the dating of the horses of St.Mark’s, on which I have written a book ,was settled and fixed conclusively to the second century AD when the previous big study had said 4th BC. We shall wait and see but it would be so good to have a state of the art scanner look at the surface of the Shroud again. I seem to be on a limb here in that I just assume that developing technology will offer totally new insights into the Shroud as time goes by. Others clearly think we have enough evidence to be certain as to what it is and when it was dated and so we can close the books. I am taking a bet on my solution and will cash in if the Shroud is shown to be a fourteenth cent Ury painting. I shall have to eat humble pie if science proves that it is not! But the question remains open in the present state of knowledge..","date":"2015-12-12","mins":"5:47 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216304","author":"charles_freeman","post":"I am pretty certain there was no loin cloth on the original I have seen no example of any in any depiction the first with a loin cloth that I know of is the banner standard from the battle of Lepanto now in the church of San Domenico in Turin, it is c. 1571 and as the decree from the council of Trent on the covering up nudity was 1563 and we have a prayerbook of 1559 in the Royal Library in Turin which still shows the figures nude, it fits quite well. As a study of the many depictions in the Savoy catalogue of images shows it on into the nineteenth century it was certainly not stripped on and off! But as a later painting on the earlier figure it may have been the first to have come off. We need a linen conservation expert to help explain why the buttocks today are lighter than the rest as noted by the art historians in the 1973 6 examination ( that was suppressed!), one would expect the buttocks to have been darker if an actual body had laid on the cloth ( and the back view to show a heavier imprint than the top). ‘Not a shred of paint’ Mac Crone anyone? The lithograph that Beldon Scott shows on p.296 suggests that the painting of the front figure had largely faded by 1868. Did the rest come off in the next thirty years? The Zittau Veil was used to cover a steam bath by some Russian soldiers where the steam penetrated in the centre the paint came off, round the edges at the bottom it did not, hence the contrast. Still I take Hugh’s point we need to get the linen conservationists who have studied painted linens that have deteriorated onto this. The Shroud was kept well past its image date usually these linens appear to have been thrown away when the painting disintegrated. There is a possibility that the Shroud was repainted before its transfer to Turin in 1578. This fits if you take a chronological sequence of the depictions which the legs apart painted over an earlier painting. I was surprised to find that repainting a treasured linen was actually quite common modern scanning of some painted linens has shown up different layers from repainting. However, we can get nowhere on this until someone brings together all the known depictions of the Shroud as it was displayed not copies. Even modest exploring dug up two ones I had never seen, one lurking in the British Library of 1608 and one sent to me in error by the Royal Library in Turin when I ( or rather the picture researcher) had asked for something different. Once again there is tons to uncover about the Shroud’s history , especially of how it looked at different moments in its history.This is an unfolding story. On pilgrim badges. The Lirey 3 D is actually very conventional. Brian Spencer has an excellent section on moulds and metals (pp.7 13). Mould making was a skilled occupation and ,as I mentioned earlier, the Lirey Badge is crude compared to some of the star finds. Original moulds for pilgrim badges have even been found one from Yorkshire is illustrated on p. 9 of Spencer. The metals varied from lead to pewter to gold at the top end of the market. An amazing amount of work has been done on all this and it seems that the Lirey badge is totally typical of mass produced pilgrim badges from minor (and in this case short lived) shrines. Repeat this is an unfolding story. We have not got there yet although I think the evidence of a medieval origin is overwhelming. For me the iconography of the all over scourge marks both front and back, not known before 1300, is the clincher ! (As well as the evidence that was woven on a medieval treadle loom.).","date":"2015-12-12","mins":"7:33 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216309","author":"charles_freeman","post":"John, not necessarily as there was a great surge of blood cults in thirteenth and fourteenth century Europe and many monasteries/churches claimed to have phials of Christ’s blood .e.g. One was found in the same chest that held the Sudarium of Oviedo and Hailes in England had an enormously lucrative one they rebuilt a large part of their monastery from the proceeds. Then there was dried blood such as the miracle of Bolsena – a host which bled to show that it was truly the blood of Christ and the blood was kept on the floor. Where did all this blood come from? The incentive to add some to a relic must have been strong. So when you read the 1449 eye witness account of the Shroud by a Benedictine monk, Corneille Zantfliet, in which he describes a shape of the body of Christ that was miro artificio depicta, ‘admirably or skilfully painted’, and goes on to say that the wounds on the hands, feet and side of the images were so bloody that they looked as if they were recent, one does wonder. Still ultimately anyone who has a piece of the Shroud or a sticky tape with blood on it needs to have it tested in an independent forensic lab to test out the blood. The testing methods of 1978 have long been superceded and, in any case, those tests have never been independently replicated. For further info. See Caroline Walker Bynum’s Wonderful Blood which has a mass of information on these blood cults in Germany..","date":"2015-12-12","mins":"9:38 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216316","author":"charles_freeman","post":"I agree with you, John that it is unlikely to have been added although the ‘blood’ seems to be separate from the paint – or if it is paint it is vermilion which is the normal pigment used on medieval cloths for blood( and this is just what Mac Crone found,of course). My own attempts to have the Heller Adler papers read by an expert physiologist ended in me being told that there was almost certainly no blood on the Shroud. As the 1978 tests have never been replicated we certainly have no proof in the scientific sense that there was blood. Problems such as the lack of potassium and the redness of the ‘blood’ convince many that this is not blood. I was just making the point that the presence/addition of human blood in an era where blood cults were everywhere and very lucrative is not beyond the bounds of credibility. Many such things went on in the relic cults! The question of being or not being a Christian is really irrelevant in relationship to the authenticity of the Shroud. If Jesus lived ,was crucified and was buried, a burial shroud existed at one point. T He question is whether the Shroud is it or not, or if it perished ( as statistically would be the most likely fate) or is one of the many other shroud relics or perhaps is hanging around somewhere totally unrecognised for what it is. Many Catholics do not believe that the Shroud is authentic and the Church despite presiding over the carbon 14 dates is not clear either!.","date":"2015-12-12","mins":"11:46 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216324","author":"charles_freeman","post":"Colin, I have never suggested that I have settled it. If you had read my posts you would have realised that I would like to see the tests replicated by an independent forensic laboratory what’s wrong with that? It is just that an informal survey of the Heller Adler papers by an expert in these things did not believe that they had shown that there was human blood. Nor, as I remember from an early post of yours, do you think it is blood. It is because an expert is unconvinced that we need further testing but would the samples ever be handed over to an independent laboratory? Here I am being very courteous towards you, feeding you tons of information about pilgrim badges and the documentary evidence for Lirey, all of which can only expand the context of your theories and you treat me as some sort of ignoramus. That is your privilege but you certainly cannot call my painting hypothesis absurd until you can show definitively that there has never been gesso or paint pigments on the Shroud or that those who recorded the Shroud as painted or who depicted the images as much stronger than they are now were also deceived. There is a lot of evidence to overthrow but so far I have never seen any significant evidence for any of your theories. They seem to come from your head without any awareness that there is such a thing as evidence needed to support them. For a brief number of years, Lirey was a minor shrine which is largely known to us because the Church authorities quashed its activities and only allowed these to resume some years later on the understanding they they dropped their claim that they had the authentic Shroud. It was one of many such shrines, hundreds of them are recorded, which had a brief moment of popularity but then failed. Yet you treat it as if it were somehow unique or different from its many competitors, some of whom were much more successful at ‘selling’ their relics. Compare Lirey with say Hailes and its phial of Christ’s blood to see what a really successful shrine was like!.","date":"2015-12-12","mins":"1:04 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216310","author":"charles_freeman","post":"I agree with PHLP that I shall not be the first nor the last to say that this was originally a painted linen. Mac Crone ,of course, and then we have the late and lamented expert on painted linens, Caroline Villers, who talks of the Shroud as ‘one of the best known surviving medieval images on a textile support’. Would that she was still with us to expand on that! The real point is that I can accumulate evidence but in the end it will be a professional conservationist who has worked on painted linens who will make the call, preferably with some examples that are very similar to the Shroud. I have had several responses that say that my views are plausible or that i seem to be on the right lines so I can only sow seeds. One day I hope some expert will come up with the watertight evidence! With so much more attention being given to painted linens it may be sooner rather than later..","date":"2015-12-12","mins":"9:47 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216331","author":"charles_freeman","post":"Leave it there,Colin. I worry about your blood pressure..","date":"2015-12-12","mins":"2:18 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216529","author":"charles_freeman","post":"Re Colin’ s illustration. Lie down on your back in the privacy of your own home with a gap between your elbows and your body and then try and hold the same position as the Shroud image in the front. Front and back cannot be the same simultaneous image of a body. This gap is typical,of depictions but is obscured today by the spread of the burn marks. Note loin cloth should be a post 1570 illustration..","date":"2015-12-14","mins":"8:41 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216365","author":"charles_freeman","post":"‘ is this his idea of scholarship?’ Yes, it is. I am not an expert on painted medieval linens but I have read a significant amount about them that suggests that the Shroud was originally a painted linen. I am aware that there is an increasing number of expert conservationists who are working on these linens, which have really only become of interest in the past fifteen years. They will be qualified to judge whether the Shroud was originally a painted linen or not. I am simply waiting to see what their expertise brings up. I am quite ready to accept that those with more expertise than I may prove me wrong. Colin has already decided that the Shroud was never a painted linen. For him the case seems closed. Fine. Let’s see what the next few years of research on painted linens provides us with. My hunch is that it will solve the problems of the images and the origins of the Shroud..","date":"2015-12-13","mins":"3:49 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216791","author":"charles_freeman","post":"I wonder where Colin dreams all this up. I cannot think of a single piece of evidence that supports this scenario. It assumes that the Shroud is unchanged now from what it was originally and, so far as I can untangle Colin’s speculations, the king of France collaborating to recreate a full scale BURIAL SHR Ou D which copies the FACE of the Veronica miles away in papal care in Rome. However, the story changes so quickly I will leave it to Colin’s ?many fans to follow him on his way. Why did the ecclesiastical courts all agree that it was the Dean and Canons that owned the Shroud and not the de Charney family? Why was the Church able to crush the expositions so easily if there was any kind of royal support there?Why use a technique, imagined by Colin, that no art historians have ever heard of? Why did no one think it was exceptional? Etc,etc, etc,…….","date":"2015-12-18","mins":"10:01 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216193","author":"charles_freeman","post":"Your speculation, Colin, is as much speculation as anything about the so called double image. In the years to come the canons of Lirey proved that they had the legal right to ownership of the Shroud. It is unfortunate that accounts of the various ecclesiastical courts that found in their favour against the de Charny family have not survived as they would have filled us in on the origins of the Shroud in Lirey. If you research the life of Geoffroy de Charney’s in t He 1350s to his death in 1356, you find no evidence that he ever visited Lirey as he was completely tied up with the diplomatic and military business of the king as a time of acute warfare in Northern France. I suspect that it was Jeanne de Vergy who actually started putting the Shroud up as a relic. Unfortunately she was not canny enough to create a back story to give it some claim to authenticity as was usual in these cases or if she did it has not been recorded. In her unsuccessful attempts to prove ownership of the Shroud, Margaret de Charny did at one point claim that it was given to her grandfather as a spoil of war. As he was fighting in these years against the English in Northern France this is presumably how he might have obtained it there was a mass of Jerusalem relics around in this part of France ( see my other posts on documented relic routes!) However, this does not explain how the canons, not t He de Charny family were registered as the legal owners If you have any documentary evidence for t He creation of the Shroud in Lirey in whatever form that relates it to the French royal family, please provide it. If not we should stick with the evidence from the courts that it was in the ownership of the canons who may or may not have been embarrassed by the attempts of Jeanne to pass it off as authentic..","date":"2015-12-11","mins":"3:10 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-215785","author":"charles_freeman","post":"The double image is one of the most fascinating aspects of the Shroud image and has not been properly researched ( as with many aspects of the Shroud), Of course, double images are common in Byzantine art but these tend to be of mirror images of similar objects, often birds or semi mythical animals. We do have record of double, in this case distinct, i.e. Not mirror, images in the Mozarbic rites from Spain – one Easter Collect talks of images on cloth of both Christ dead and resurrected so this would takes us back to the sixth century. I note that one Spanish researcher, Daniel Duque Torres, claims that there are Spanish examples of double images in some Spanish towns that claim to be the originals of the Shroud of Turin. This is one more avenue of Shroud research which needs to be followed up. It is not impossible that the Shroud was copied from elsewhere although this will be heresy to many readers of this site. Did not Hans Belting claims somewhere that the Shroud was a copy of an earlier original and we do have many examples of relics that disappear and then reappear clearly in some cases as newly minted copies of the original the Volto Santo in Lucca is a good example..","date":"2015-12-07","mins":"6:07 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216194","author":"charles_freeman","post":"P.s.Colin, I assume that if you are going for the French royal family link, you have dropped the papal Veil of Veronica link. There were indeed thousands of copies of vernicles, as the Veronica images were known. Chaucer even mentions one and a cache of them has been found hidden in a German monastery. However, as the Lirey Shroud was always referred to as a burial shroud and not as a vernicle I think we can be confident that there is no possible link. Still you move on so fast that some of us who try and keep to the documented evidence can’t keep up!!.","date":"2015-12-11","mins":"3:21 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216202","author":"charles_freeman","post":"Colin “The modest timber built collegiate church was built in Lirey in the early 1350s to house the Shroud, we are told, presumably on the initiative of either the Lord of the Manor (Geoffroi) or his wife. : ‘ While Colin is resting we just need to get the record on this straight. It was as early as 1343 that the French king, Philippe VI, granted de Charny permission to raise the money for building by amortizing feudal land. With the money in hand, de Charny then petitioned the papal court at Avignon for the right to have masses said continually for his family and to have a family burial ground near to the church. None of these documents mention a shroud. Lirey was essentially a church in which prayer would be offered for Geoffroy and his family after his death. There are many cases where indeed a church was built specifically to house a relic (usually in a place on an existing pilgrimage route!) but remote Lirey was not one of these. I suppose it is possible that the de Charny family gave the Shroud to the canons of the church perhaps after pope Clement VII declared that it was not the authentic burial shroud but no surviving document mentions this. Yet Pierre d’Arcis claiims that the Dean procured the Shroud and this could only have been after the official election of the canons on October 1354. When Margaret’s second husband , Humbert de Villersevel, removed ‘a cloth, on which is the figure or representation of the Shroud of Our Lord Jesus Christ’, presumably our Shroud, he promised it would return to the CANONS when peace had returned. But as we know, Margaret grabbed it, tried to fight off the canons when they wanted it back and then passed it on to the Savoys in 1453. The canons eventually gave up but they, not the de Charny family, were certainly seen as owners at the beginning of the fifteenth century and, according to Pierre d’Arcis, as early as the 1350s. No problem in ploughing your lonely furrow, Colin, and doing whatever detective work you want but you do need to provide documentation if you are going to be an effective historical detective. As you say, unlike those of us who write articles read by fellow professionals and thus have to defend our reputations and work publicly, you have no responsibility to anyone and can put out whatever you want! Good luck to you!.","date":"2015-12-11","mins":"6:28 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216235","author":"charles_freeman","post":"Colin – why don’t you look me up online under Charles Freeman Yale University Press and you will see that I have no less than three books published by university presses, including one on medieval relics. Each one had to go through an academic review committee before it was accepted and then had to be read by two academic referees before it was finally accepted. You can access Yale on their website to see the reviews of my Holy Bones and you will see that I am taken seriously by academic historians on the specific subject of medieval relics. If you had actually read my article you would see that my argument is that the loincloth was added to comply with the decree of the Council of Trent against religious nudity. The images are shown nude as late as 1559 but by 1571 they are covered with a loin cloth. It is Iikely that Carlo Borromeo who was a stickler about these things ordered it the buttocks to be covered over. It appears that one can see a lighter patch on the buttocks where the paint once was. But I quite forgive you if you don’t want to debate further. Ian Wilson is obsessed by the Shroud and does not seem to have bothered to have read in the wider world of relic cults. Once you follow up a text cited by Wilson you often find it says the opposite of what he implies he says , as in the tetradiplon Acts of Thaddeus..","date":"2015-12-11","mins":"3:27 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216241","author":"charles_freeman","post":"No, I don’t imply there was ever a loin cloth on the original Shroud. The Holkham Bible of 1330 which shows bloodstains on its illustrations of Christ’s head strikingly similar to those on the Shroud also shows Christ naked. The issue ,it appears, was not to show his genitaliia and the hands were crossed to cover these, but the bare buttocks were just too much for St.Carlo. We have evidence that he ordered other nude figures to be covered up. I am quite happy with the support I have received from academic historians and others who have contacted me over my article. I can assure you that with so many odd theories about the Shroud around, any Shroud articles are given very rigorous assessment before they are published in serious journals! Well ,that is my experience at least. My article .in the Church Times in June needed an Oxford professor of medieval Christianity to OK it!.","date":"2015-12-11","mins":"4:22 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216246","author":"charles_freeman","post":"Colin, I enjoy reading and debating about the Shroud which is a minority interest. It is common practice to suggest avenues of research that one might not be able to carry out oneself in the hope that someone with the right linguistic skills, professional expertise and time might pick them up. In many areas, research on the Shroud has hardly begun. Too much time has been spent navel gazing at the Shroud images and virtually nothing on the painted linen possibilities although to be fair it is only in the last fifteen years that serious work has been done on these and scanners are able to show what the original painted surfaces and primers below them were made of. I hope that one day an expert will simply fit the Shroud into the research, just as the horses of St. Mark’s, Venice can now be seen,from work on the gilding of similar statues, to be second or third century AD. Unlike some I am happy to wait for the origin of the Shroud to become clear probably in the next five to ten years. I am keeping a watching brief on work on painted linens and will certainly let everyone know if the Shroud Turns out to be a typical of other ‘once painted now decayed’ linens. The Zittau Veil is the best similar example I know of ( original pigments steamed off leaving images similar to the Shroud on discoloured linen) but no doubt more will come to light and some expert in formerly painted line cloths will be able to make effective comparisons with the Shroud. I cannot really start retraining as an expert in the conservation of linen so I will have to leave this to the existing experts! Patience needed but with the enormous strides in scanning techniques in recent years I am sure that the Shroud will yield its secrets or other cloths so similar will be analysed and make it obvious how the Shroud images were created. The calcium carbonate found by STURP seems an important clue as it was used in the sealing gesso and, as in medieval times, this was mined for this purposes in Northern Europe, this is one small pointer to the origins of the Shroud there..","date":"2015-12-11","mins":"5:16 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216239","author":"charles_freeman","post":"P..S. Colin, how can you be sure that this is the first appearance of a double image when there are apparently places in Spain which claim to have originals from which the Shroud is copied? I have never followed this up but I hope someone will as it is possible that it is here that one finds t He origin of the double image. There is ,of course, no evidence that the Shroud was made in or near Lirey but I think we would have had some documentation if it had had a past elsewhere. My own suspicion, no more than that, is that it came from the Rhineland but that is another issue which I need to accumulate a lot more evidence on. The Lirey badge has two clerics holding up the Shroud in front of the empty tomb. This is what is laid down in the Quem Queritis ceremony with the two clergy representing Peter and John who found the empty tomb and the grave cloths. The ceremony was a re enactment of this with the two holding the burial cloth in extenso in front of the tomb and the congregation early on Easter Monday. I suspect that the Shroud is too big to have been made for a small private chapel as Lirey but I found an interesting reference to the fact that the altar in Cologne is the same size as the Shroud and cloths were displayed on it at Easter,. It was not suggested that the Shroud came from Cologne but that the Shroud was a typical size of those that were. There is a lot of German scholarship,on such matters which does not seem to have penetrated the English speaking Shroud world. Alas my German is schoolboy level..","date":"2015-12-11","mins":"4:03 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216272","author":"charles_freeman","post":"Calcium carbonate. Read the STURP report on physics and chemistry which you no doubt have at hand. Also referred to in Heller ‘s book on the Shroud. They talk of ‘ large’ quantities and across the cloth. No doubt you can assess this for yourself but it is indicative of a Northern Europe gesso. South of the Alps they used calcium sulphate. I am not qualified to say that they actually found something else altogether but the ‘ frosty’ appearance of the Shroud surface that they noted might also be the remnants of the calcium. What was clear was that STURP having never examined any painted linens or understood the techniques of sealing linen for painting thought it was just accumulations of dust. It may or may not be evidence of gesso but they did not even consider it might be..","date":"2015-12-12","mins":"2:25 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216273","author":"charles_freeman","post":"P.S. Colin, you can find whole books on pilgrim badges which show the different ways different relic shrines advertised their relics. I think the Lirey badge is a very strong one but perhaps you should look at the other examples to give comparisons. I am pleased to introduce you to some of the work done on medieval relics. It is a fascinating and absorbing subject and it kept me very busy for three years of research for my book..","date":"2015-12-12","mins":"2:32 am","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-56635","author":"charles_freeman","post":"The Catholic Church had it for some time – it was called the Inquisition..","date":"2013-12-05","mins":"7:11 am","url":"https://shroudstory.com/2013/12/05/you-need-to-read-both-lines-of-the-headline/","cat":"humor","title":"You need to read both lines of the headline"},{"id":"comment-56669","author":"charles_freeman","post":"O/K/ In that case perhaps we ought to reintroduce it with its priority being monitoring blogs about the Shroud do you think it should still keep burning as a last option for those who remain sceptics?.","date":"2013-12-05","mins":"8:36 am","url":"https://shroudstory.com/2013/12/05/you-need-to-read-both-lines-of-the-headline/","cat":"humor","title":"You need to read both lines of the headline"},{"id":"comment-217234","author":"charles_freeman","post":"The 10,005 wounds of Christ is a new one on me. The normal calculation in the obsessive attempts to pin down the number is 5,466 individual wounds. This is attributed to St.Gertrude but she may be simply reflecting earlier traditions of there being many wounds ,in addition to the Five Sacred Wounds that were the subject of intense veneration based on gospel sources. If you read the visions of say Bridget of Sweden (fourteenth century) and others you get a concentration on the wounds and the blood of Christ that is also reflected in the iconography of threat period. I leave it to individual researchers to relate or fail to relate these to the Shroud. ‘About 1450’ is vague but with the condemnation of Margaret de Charny in 1449 for exhibiting the Shroud and the threat of excommunication hanging over her for possessing what the ecclesiastical courts ruled was not hers anyway, it is most unlikely that a pre1453 text referring to a shroud is referring to the Turin Shroud but to another that was similarly marked with wounds from the scourging. If so this is a very important text for anyone interested in the display of shrouds/ grave cloths in this period. And I hope to find out more from Hugh on this..","date":"2015-12-26","mins":"3:49 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"}]
