[{"id":"comment-205494","author":"charles_freeman","post":"The fifteenth/ sixteenth century sources always refer to the Shroud as the cloth in which Jesus was taken down from the Cross.e.g. De Sanguine Christi(1464), Antonio De Beatis (1517). This let them off the hook with the gospel sources, and remember too the description of the burial cloths of Lazarus, that talk of wrappings. If the Shroud was originally created for the Quem Queritis ceremony, it would have been one of many such and so not particularly miraculous as a creation.In these ceremonies, the images simply symbolised the tomb where the body had lain before the Resurrection. For a large congregation, in the early morning light of an Easter dawn, the most important thing would have been visual impact and this may explain why the images are larger than life size and why the blood is described ‘as if it were recent’ (one of the reasons why Herbert Thurston did not believe that the Shroud was authentic) ..","date":"2015-07-13","mins":"9:17 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","title":"Beg Your Pardon (Comment Promoted)"},{"id":"comment-205515","author":"charles_freeman","post":"The Image of Edessa. The Veil of Veronica and the face of Christ on the Turin Shroud, and thousands of other representations of Christ, all draw on an image of Christ that the authority on Roman art Paul Zanker traces back to AD 300 Rome (see his The Mask of Socrates). I have never supported Colin’s thesis that the Shroud of Turin was a deliberate attempt to cash in on the Veronica it would have been presented as a representation of Christ while he was alive, not dead, if it had been. A full body Veronica would not make any sense as the legend always said that ti was just the face that was wiped and left an impression. The Lirey pilgrims do not appear to be the elite unlike somewhere like Mantua where popes and emperors came to venerate the blood of Christ. They seem typical of the masses of dislocated peasantry who are said to have flocked backwards and forwards to new shrines in the unsettled years after the Black Death..","date":"2015-07-13","mins":"1:43 pm","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","title":"Beg Your Pardon (Comment Promoted)"},{"id":"comment-205495","author":"charles_freeman","post":"Also the professional palynologist Marzia Boi’s recent scathing attack on Frei’s methods: ‘It was research that was full of inaccurate ideas and preconceptions which, instead of checking and confirming if the relic was original, has even led to speculation today on whether there was actually any presence at all of these pollen types on the Shroud’..","date":"2015-07-13","mins":"9:20 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","title":"Beg Your Pardon (Comment Promoted)"},{"id":"comment-205620","author":"charles_freeman","post":"It was virtually impossible to launch a new relic cult without papal authorisation. This was the result of the mass of fake relics that poured into or were created within Europe after the sacking of Constantinople in 1204. Pope Innocent III tightened things up in a decree of the Fourth Lateran Council of 1215: ‘Some people try to sell saintly relics and show them around everywhere. This belittles the Christian religion. To prevent this for the future, we declare by this decree that old relics may not be exhibited outside of a container or exposed for sale. And let no one presume publicly to venerate new ones unless they have been approved by the Roman pontiff.’ This is why Clement VII made his announcement that he was not authorising the Shroud as genuine in 1390 (but did allow veneration).Of course, people took their chances but, as with the Shroud, the local bishop soon suppressed them. It is interesting that when Margaret de Charny tried to exhibit the Shroud as genuine in 1449 in Liege she was asked for the papal authorisation for what she was doing.She could only produce the papers from Clement and so was forbidden to go on exhibiting. Anyone would have known that if they tried to set up a new relic they would be under immediate scrutiny. And so it proved to be. The original shrine seems only to have survived a year or two before it was closed down and the Shroud hidden away.The 1390 proclamation was a typical compromise ( as those of us who live in the EU are very used to). There would have been only one or two genuine Shrouds and most of the others had long standing pilgrim income which they would have protected against any pronouncement of yet another ‘authentic’ Shroud.The popes knew better allowing veneration but not disturbing the old established ‘authentic Shroud’ sites – was the sensible way. No one would have had any means of knowing which of the competing shrouds, if any of them, was genuine anyway. On what grounds were you able to compete with the Shroud of Compiegne that had five hundred years of veneration behind it? When Antonio de Beatis saw the Shroud in 1517 at Chambery he was told that it had been taken by a Lord of the House of Savoy from a Muslim prisoner during the First Crusade! We know better but at least the Savoys were realising that they needed some kind of back story!.","date":"2015-07-14","mins":"5:23 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","title":"Beg Your Pardon (Comment Promoted)"},{"id":"comment-181223","author":"charles_freeman","post":"The real mystery is that God created a material world whose atomic structure can be manipulated by human beings so as to destroy it completely..","date":"2015-01-04","mins":"4:13 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-65048","author":"charles_freeman","post":"From being unable to explain the images to assuming that they are miraculous evidence of Christ’s resurrection is too far a leap for me without supporting evidence that I am happy to listen to. . ‘The “skeptics” (who are themselves “believers” in the Shroud’s non authenticity)’ should be rewritten as ‘The ‘skeptics’ (who are themselves sceptical of the Shroud’s authenticity)’. A sceptic on the present evidence might well lose their scepticism if presented with sufficient evidence of authenticity. I am certainly sceptical so long as the ‘Image of Edessa’ route is still seen as the most likely pathway of the Shroud from Jerusalem to Lirey when the documented evidence of a direct trade in relics between Jerusalem and northern France has not yet been investigated..","date":"2013-12-22","mins":"11:59 am","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-65425","author":"charles_freeman","post":"John, This posting is not about the carbon dating I simply made a point about scepticism and evidence. I find Roger’s paper inadequately referenced , I don’t see how he can be sure that the encrustations are a dye rather than a simple sizing or sealing with gum to prevent the deterioration of the cloth and I have looked in vain for any evidence that he provides to support his ‘ pristine replacement material’. However as his paper has been roundly rubbished by Mark Antonacci, John Jackson ( who shows with photographic evidence that the banding across this part of the cloth is undisturbed) and Flury Lemberg who could see no sign of any reweaving from a close up examination of the cloth I cannot see why we should give much credence to the work of a man writing in 2005 who had not seen the cloth since 1978 and who had no woven material to work from. Please refute John Jackson’s photographic evidence and Flury Lemberg if you want to prove your case that Ray Rogers is the gold standard. See the debate on Shroud.com for January 21st, 2006. I am also not sure why the authenticity of the Shroud would be an ‘unpleasant truth’. After all we know that Jesus was buried in some form of burial cloth. Certainly I would be able to rewrite my first chapter of Holy Bones, Holy Dust and achieve far greater sales if it were authentic.As a sceptic I am careful to leave all the options open and never in my long life as a historian have I been criticised for my caution!!.","date":"2013-12-23","mins":"4:40 am","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-196715","author":"charles_freeman","post":"‘Brown, Scavone and Wilson are writing historical texts. Any event that they report as an historical event can be reported as history by another author, but the second author can not do so in the original author’s unique own words without attribution.’ None of these three has any standing within the academic community and so ‘any event they report as a historical event’ would not be taken seriously unless it was a date or whatever that was already common knowledge. I am unaware of any original research by any of these writers that has been taken seriously by any historians working in these fields..","date":"2015-04-18","mins":"11:56 am","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-197122","author":"charles_freeman","post":"‘Have never met’,etc…..Perhaps you don’t move in the right circles,Dave B! I have not yet anyone who takes the Pray Codex claim seriously. ‘Where are the bloodstains on the body, where are the images? ‘ are the Immediate responses. Similarly I have never met anyone with any forensic background who believes the red marks in the Shroud are dried blood. I think Barrie Schwortz was naive to rely on a single ‘test’ by Adler which has never been replicated anywhere. Nor has anyone I have discussed this with seen dried blood as red as this in any context. So really Dave B, perhaps each of us moves in circles that are too small. I have been a professional historian for over forty years and Dan Scavone’s work on the Holy Grail is, let us say, not up to it as serious history..","date":"2015-04-21","mins":"11:48 pm","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-197125","author":"charles_freeman","post":"P.s. If you want to be taken seriously by other historians, you don’t start off an article as Dan Scavone did by saying that you take Ian Wilson’s 1978 book as your Bible. It immediately marks you out as a dependent on other research which in Wilson’s case is considered laughable outside the Shroud community. I don’t think Dave B ,and perhaps others, have yet realised that no one in the academic world takes these guys seriously..","date":"2015-04-22","mins":"12:16 am","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-196713","author":"charles_freeman","post":"Leon so is this the inside story of how Max Frei did it?.","date":"2015-04-18","mins":"11:45 am","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-171185","author":"charles_freeman","post":"Recreating. I was talking to someone who recreates medieval illuminated manuscripts. She told me that there are certain techniques that no one knows how to do anymore so now it would be impossible to recreate certain illuminations. Then there is the Sutton Hoo purse, seventh century. Despite intensive study at the British Museum no one know how they got the garnet inlay there. And when I was creating an engagement ring for my wife, we chose a Minoan ring of c 1700 BC for a model. The jeweller said they would not be able to reproduce the original as it was too intricate unless I was prepared to pay one of the world’s top jewellers to have a go. Sadly the cash did not go that far! (Still, she loves what we did end up with!) And what is one trying to recreate?: something old but as it is now with the patina of age on it, or something as it was originally made as in the three examples I have given? Very difficult indeed to do the former as one would not be able to recreate the effects of the conditions in which it had been kept, perhaps for hundreds of years..","date":"2014-11-14","mins":"6:14 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"id":"comment-196714","author":"charles_freeman","post":"The case of the century! So long as John does not file it in the Italian courts he will be fighting it for the rest of his natural life and beyond and I assume that Stephen Jones will be called as an expert witness..","date":"2015-04-18","mins":"11:49 am","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-171187","author":"charles_freeman","post":"P/S. I have never understood why anyone would want to reproduce the Shroud as it is today after all these years of existence. Perhaps it is the time I spent as an archaeologist if one dug something up you wanted to know what it had originally looked like – if it were gold, of course, cleaned up, there would be hardly any difference between then and now, likewise with objects kept in an undisturbed Egyptian tomb, but other materials we would have expected to change through time so the challenge remains what were they once like when they were made? Perhaps I am too old to get out of the conditioning of my youth! ..","date":"2014-11-14","mins":"6:36 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"id":"comment-171676","author":"charles_freeman","post":"I think it is always dangerous to have faith in a person for historical issues it is the evidence that counts. It is not always easy to accumulate but one can often built up evidence from different sources that correlate with each other. Then when you have a hypothesis you must see if there is evidence that contradicts it. Without the primary research on the looms that might have woven the Shroud and an analysis of all the descriptions and depictions ( from a data base so that these sources are open to all), Shroud studies remain limited with large areas still to research before conclusions can be made. It is not good enough to rely just on the Shroud today without making any assessment as to the ways in which it may have different in the past. If you believe that , unusually, the Shroud is the same now as it was six hundred or even two thousand years ago, the onus is on you to show why it remained impervious to change despite the colourful history, documented from 1350, imagined from before that, that we can recreate. This is why I am trying to involve experts who traditionally have refused to get involved with the Shroud. It is hard to know what expertise Benford and Marino bring to the subject. They attempted to make a case for the reweaving of the Shroud but neither has/had any background in textiles or examined the Shroud close up. If you google ‘Benford pyramids’, you will see that her main interest lay in assessing the specific properties of pyramid shapes and I am not sure how this was relevant to the Shroud..","date":"2014-11-17","mins":"4:39 am","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"id":"comment-70025","author":"charles_freeman","post":"‘A major new book on the Shroud of Turin.’ Is this John Klotz’s long promised book which is expected around Easter,I think? I am sure that whatever book it is and however John manages to publish it we will hear about it here first..","date":"2013-12-30","mins":"4:59 am","url":"https://shroudstory.com/2013/12/29/happy-new-year-from-stera/","cat":"other_blogs","title":"Happy New Year from STERA"},{"id":"comment-172115","author":"charles_freeman","post":".’ Exclusively a job for a dedicated textile historian’. Yes, I can tell you that there is one working on the loom issue at the moment. However as they are working for someone else researching the Shroud their findings will not come to me ( unless I can persuade them to be passed on to me) and I have no idea what they will come up with, other than knowing that the weaver concerned is one of the top textile historians/ weavers in the field..","date":"2014-11-19","mins":"5:30 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"id":"comment-161722","author":"charles_freeman","post":"It’s the word ‘ anatamothanathanogical’ , Max, that convinces me that you are making fun of us all and one day you will publish an article in English that we can all understand mocking us all for taking you seriously when you knew you were making words up as you went along. Don’t worry, I really enjoy your contributions even if I can’t understand them. You have such imagination!.","date":"2014-10-12","mins":"2:18 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-161388","author":"charles_freeman","post":"Does anyone else share my hypothesis that Max Patrick Hamon’s contributions are spoof ones, deliberately obscurantist nonsense to see how far he can wind everyone up?.","date":"2014-10-11","mins":"2:29 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-161723","author":"charles_freeman","post":"Max, if like me you believe there is good evidence that the Shroud was woven and painted( it has since faded dramatically) in the fourteenth century then knowing anything about Second Temple burial practices is irrelevant. The only relevance is the more we know about them the less likely it is that the Shroud comes from a first century Jewish burial..","date":"2014-10-12","mins":"2:23 pm","url":"https://shroudstory.com/2014/09/29/hello-mr-zias/","cat":"guest_posting","title":"Hello Mr. Zias"},{"id":"comment-161857","author":"charles_freeman","post":"Suppose one consults an expert on ancient weaving an d looms and they say 3in 1 herringbone was possible by the third century AD on very complex looms but almost certainly not for that length of cloth. Medieval treadle looms would, however , be quite capable of it and there is a fourteenth century example of a 3 in 1 in the Victoria and Albert Museum in London to prove that that that weave was being done at that time..","date":"2014-10-13","mins":"12:18 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-161867","author":"charles_freeman","post":"I would suggest that a study of the early descriptions and depictions of the Shroud might suggest that ,as it originally was, vivid enough to be unfurled before enormous crowds, there were lostdetails typical of medieval iconography. I was amazed that de Wesselow did not seem to be aware of all this early evidence and him supposedly a trained art historian! Nor, might I say, have I come across any Shroudies who seem to have put all this evidence together..","date":"2014-10-13","mins":"1:01 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-54278","author":"charles_freeman","post":"Sorting out the stitch issue was merely a matter of discarding evidence that has been used by some but which, as I have argued here, is, in fact not relevant either way in establishing the authenticity of the Shroud, any more than the fact that it is woven in linen helps either way. I mentioned in a previous posting that these are small steps towards moving to a more mature assessment of the Shroud. Part of this would be, although I am not the one who is going to do it, researching the direct links between Jerusalem and northern France in the relics ‘trade’ (e.g. The relics from the Lord’s Tomb that are known to have come in to northern France in the first millennium). This seems potentially relevant evidence that no one seems to have touched. And here I am talking about evidence that could offer support for authenticity so please don’t accuse me of bias. I applaud High’s approach that seems to me to be open minded but rigorous and will certainly help move toward this new more mature approach to Shroud studies that ,so far,as i can see, is still stuck in the debates of twenty five years ago. Let’s just disregard the radiocarbon dating as it never provided any evidence for the contrary view that the Shroud was first century and so perhaps, ( although I am not necessarily as critical of it as others) it too can just be discarded as irrelevant..","date":"2013-12-01","mins":"6:18 am","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","title":"It may not suit the scientific mind-set"},{"id":"comment-155951","author":"charles_freeman","post":"Dawkins was wrong it was not denounced by the Church authorities in 1390 the anti pope Clement VII accepted the Shroud as a justified object of veneration, even worthy of an indulgence on condition that it was publicly announced before each exposition that it was not authentic. These objects of veneration were very common. I have just seen a crucifix in the Church of Santa Maria in Castello in Genoa where I am leading a study tour which has been venerated ever since the Christ on the Cross was seen to move his head in assent to a question. I suspect that there were similar, now unrecorded, miracles associated with the Shroud that gave rise to its status. I leave it open as to whether Clement was right about its authenticity or not but he certainly did not denounce it!.","date":"2014-09-25","mins":"12:51 pm","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","title":"Mars, Weeping Mary and the Shroud"},{"id":"comment-54832","author":"charles_freeman","post":"Dave B. The fact that the Shroud is in linen is not relevant to its authenticity as linen cloth is known from 6,000 BC to today. The particular counter hemming stitch is not relevant because it was used widely through the centuries. The Z twist IS relevant as the archaeological evidence shows that it was used primarily in western Europe while S twist was overwhelmingly the most common twist in Egypt and the Near East. It does not settle the issue one way or the other – the Shroud might have been imported to Palestine from the west but is significant in the way that the stitch is not. I have not seen Mechthild Flury Lemberg comment specifically on the Z twist and it would be interesting to hear what she had to say..","date":"2013-12-02","mins":"4:11 am","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","title":"It may not suit the scientific mind-set"},{"id":"comment-205929","author":"charles_freeman","post":"We have been here before Assyrian civilization collapsed in the seventh century BC and there are cubits of varying lengths not difficult to find one which fits! 113 114 cms is the standard width of the English ell used in commercial transactions for cloth. Treadle looms can still be bought in a standard size of 45 inches. The six linen strips that make up the Zittau Veil, 1462, averaged 113 cms in width. This has always been one of the strongest pieces of evidence for a medieval weave..","date":"2015-07-16","mins":"5:16 am","url":"https://shroudstory.com/2015/07/16/maybe-a-not-so-startling-coincidence-of-something-that-is-approximate-and-presumably-averaged/","cat":"other_blogs","title":"Maybe a Not So Startling Coincidence of Something that is Approximate and Presumably Averaged"},{"id":"comment-212140","author":"charles_freeman","post":"I don’t think that between expositions, the Shroud is much of a money spinner. When I visited the Shroud museum in Turin I was the only person there and I was fussed over by the custodian who even unlocked the adjoining the chapel to show me the copy of the Shroud they had been given for storing it there after the fire. I had a local guide for my study group ( of baroque Turin) and wondered what she would say about the Shroud nothing much other than that she thought it had come from Constantinople certainly nothing for or against authenticity. There is a full size copy on show in the church of St.Lawrence next to the royal palace and cathedral but that, and the Museum, which is some distance from the centre, is about it. Compare this with the continuing hysteria about Padre Pio, particularly in the south of Italy.He is everywhere, statues, shrines,etc..","date":"2015-10-09","mins":"10:56 am","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","title":"No Closer to the Truth Because of Simony"},{"id":"comment-57905","author":"charles_freeman","post":"I was not able to get a clear ‘expert’ consensus when i asked around a few months ago but the highest rates of AB appear to been where A and B groups have intermarried and this has taken place in central Europe and eastern Asia where the percentage of AB is highest. The idea seems to be that the higher the incidence of AB the further back the intermingling took place. Many different sites suggest the central Europe AB emerged after 900 AD but this seems to be based on lack of evidence that it can be found earlier rather than on firm evidence of this as the first date. The professor of physiology with whom I shared the blood evidence doubted whether it was actually AB blood anyway. So I just left it in my mind as an open question. One of the MANY areas of Shroud research where we need more up to date testing..","date":"2013-12-11","mins":"5:26 am","url":"https://shroudstory.com/2011/07/25/tales-of-blood-type-ab-negative/","cat":"other_blogs","title":"Tales of Blood Type AB Negative"},{"id":"comment-29130","author":"charles_freeman","post":"Just a note to say ,re. Qu.6, that a significant proportion of medieval relics came from the Holy Land. One of the effects of so many people following Ian Wilson is that they have ignored the considerable amount of evidence for the import of relics directly into Europe from the Holy Land. It began, of course, with the transfer of relics from Jerusalem to Constantinople in the fourth and fifth centuries. Then, soon after the Arab Conquests, trade in relics from the Holy Land to Europe began. It is well covered in Chapter Ten of Michael Mc Cormick’s Origins of the European Economy where he looks at a number of french collections from this period. Then vast numbers of relics, both from Constantinople ( 1204) and from the Crusades poured into Europe in the Middle Ages. Some of these were of Islamic cloth which also traded as an item in itself. Clearly if you were presented with a new relic, evidence that it came from the Holy Land was a selling point which simply encouraged more imports. So far not a single of these traded relics has been shown to be authentic but, whether you believe the Shroud to be authentic or not ,if you are a serious researcher into it, you need to examine the large amount of documentation and evidence of the relics themselves that deal with relics coming from the Holy Land. I am amazed that no one seems to be working on this but I suppose that until Wilson is dumped no one will start looking at all this mass of material that is much more relevant to Shroud research than anything Wilson drags up..","date":"2013-04-02","mins":"9:17 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","title":"Ten Questions for Shroud Skeptics from Fr. Longenecker"},{"id":"comment-29143","author":"charles_freeman","post":"I agree, Louis , but I would have thought that someone might have done SOME research. Although I wasn’t working on the Shroud when I wrote my book on relics, I had no difficulty in pinning down a lot of sources, many of them online, about the relics trade. You can start with the very informative chapter cited above. Some Shroud researchers seem to spend so much time going over old ground that it would be good to see new avenues being explored instead..","date":"2013-04-02","mins":"1:29 pm","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","title":"Ten Questions for Shroud Skeptics from Fr. Longenecker"},{"id":"comment-149432","author":"charles_freeman","post":"And once again Jones has reproduced the misleading Wilson doublings. The second doubling is not a doubling of the first doubling, the third one is in effect the second doubling as you will see if if you take a slip of paper, double it and put it alongside the illustration. Wilson’s theory only works if you have three doublings and this cannot fit with any plausible definition of tetradiplon. But we have been here before it is a pity Stephen Jones won’t read this blog ( but perhaps he does peek at it from time to time without telling us!).","date":"2014-09-08","mins":"8:37 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149923","author":"charles_freeman","post":"I thinks ‘tetradiplon’ is irrelevant as the text makes clear that this was how the cloth was folded BEFORE Jesus wiped his face on it and the text does not mention that it was refolded as such. Wilson is misleading as he suggests that the word refers to the cloth after Jesus wiped his face on it.. This is not grenade throwing – it is simply commenting on a misleading statement that too many people have relied on without going back to the original text ( that also mentioned burial cloths separate from the tetradiplon cloth again Wilson does not mention this).. I believe that Jesus existed and that he was buried. Therefore there was originally a burial shroud or wrappings/ facecloth. I just don’t think that the Shroud was it. If a more plausible set of burial clothes from first century Jerusalem comes up it would not shake my world view at all. After all in Jerusalem there exist a number of large stones that originally blocked tombs ( the practice was to unroll them three days after to check that the deceased really was dead or to anoint the body as in the case of the Jesus tomb.). It is highly likely that the stone from the tomb is still there and if the right one was indeed found then it would not destroy my world view either. Why should it?.","date":"2014-09-10","mins":"12:06 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149994","author":"charles_freeman","post":"That review does not say it ALL because I have had many other reviews and you should start by looking at some of these on the Yale University Press USA website under Holy Bones. Many of the most supportive are from Catholic journals. Actually I have never seen the one quoted so would be interested where it is to be found. If you have been writing so long as I have, first book out in 1980, you learn not to worry about Amazon or other ratings. I don’t write for the popular market so ratings are irrelevant. I am more than happy with the reviews I get and the fact that I am mainly published by university presses who have to get my work assessed by academic assessors before they accept or publish it..","date":"2014-09-10","mins":"4:18 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149998","author":"charles_freeman","post":"For your interest, a proposal to a university press goes first to two or three academic advisors. If given preliminary acceptance it then has to be approved by an academic board before the press signs you up. Then the finished book is read by at least two anonymous and different academics who make their own comments that are fed back to the author (sometimes they agree to let their names be released or even provide endorsements). No academic commented on my discussion of the historical issues behind the resurrection accounts as they could see that it was a serious discussion of some possible interpretations of the evidence in what is a history book not a theological one..","date":"2014-09-10","mins":"4:37 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-150284","author":"charles_freeman","post":"Yes, we established that seamstresses today recognise this as a basic stitch, useful for stitching two cloths together and still used today. It does not help us one bit in dating the Shroud. I never objected to the. Idea that the stitch on the wool at Masada many have been similar to the stitch on the Shroud, it is just that that does not move us on in any way if the stitch has been used throughout stitching history as appears to be the case..","date":"2014-09-11","mins":"5:33 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-205356","author":"charles_freeman","post":"David Mo is right in saying that the Shroud is not considered seriously by historians and art historians, largely I suspect because none of them have seen anything to convince them that it is authentic. The failure of the Shroudies to convince any specialist outside their own circles is all too obvious but they don’t really seem to worry about it. Why at all these conferences is no space given to how to persuade specialists in the relevant areas? Part of the problem is that the Fantis and Carpinteris get flashes of international publicity but their findings are quickly discredited and the Shroud is not seen as a serious object of research. Whenever I do get into conversation with an ancient textile specialist, the Shroud is just assumed to be the typical product of a medieval treadle loom ( the length and width are the give aways), so, I am told, why bother to go further? The late Caroline Villiers, one of the foremost experts on painted linens, simply referred to the Shroud as ‘one of the best known surviving medieval images on a textile support’. It was not an issue with her and she turned her attention, before her early death, to the painted linens that really interested her. I am learning to live with the fact that the real painted linen experts are tied up with the linens whose paintings do survive and they are less interested in ones where the paint has disintegrated, even when they accept that this is what has happened..","date":"2015-07-12","mins":"4:35 am","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","title":"The Meaning of Solid"},{"id":"comment-150443","author":"charles_freeman","post":"Apparently this is how the stitch recorded from the Masada excavations is designed to do stitch together two different pieces of cloth. However, this does not necessarily mean that it was used in the same way for the Shroud. We are only talking of ‘similarities’ not exact fits..","date":"2014-09-12","mins":"7:46 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-205401","author":"charles_freeman","post":"‘Yawn’ :exactly what I mean about Shroudies not caring about whether they convince anyone outside their own circle! Sleep on, Thomas!.","date":"2015-07-12","mins":"1:54 pm","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","title":"The Meaning of Solid"},{"id":"comment-205476","author":"charles_freeman","post":"I would place whatever the scanner showed alongside the other evidence of the Shroud. If there are any traces of original paint a scanner of this sophistication would be able to pick them up but, unlike most objects of this type, we can’t get access at the moment so this is all hypothetical. Obviously if the scanner did pick up traces of the vermillion from the blood areas it would be pretty conclusive well, nothing would ever be conclusive to some…… but I was pleased to see that Thomas still has an open mind..","date":"2015-07-13","mins":"6:17 am","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","title":"The Meaning of Solid"},{"id":"comment-205459","author":"charles_freeman","post":"Thomas your comment does not reflect the feedback I get from my History Today article which you may or may not have read. Lots of others have and find it interesting and convincing. We all want new research. The BBC had an interesting programme on a disputed Renoir last night. The latest technology has produced a scanner which can instantly show what pigments make up the paint on any surface so they were able instantly to show whether the painter had used vermillion or not (plus other pigments but vermillion is the key one for the Shroud as it was the normal pigment used to depict blood). The scanner is so rare that there are long queues to use it ( in Berlin) but no doubt in a few years time it will be standard and would quickly resolve the issue of whether the Shroud was once a painted surface or not. Alas, the Church seems to be going quiet on the Shroud and will hide it away until 2025. A lot of progressive Catholics are somewhat embarrassed about it.I don’t know whether this was deliberate editorial policy or not but I could not find the exposition even mentioned in the Tablet (British Catholic journal) for the week that it opened..","date":"2015-07-13","mins":"3:07 am","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","title":"The Meaning of Solid"},{"id":"comment-73668","author":"charles_freeman","post":"‘Without that there would be no Shroud websites, no Shroud books, no Shroud conferences, no Shroud papers,no Shroud blogs.’ Surely not true. The Edessa theory seems to have stopped people pursuing more fruitful research on the possible origins of the Shroud. By now there would be conferences, papers and books, on relic cults in Northern France and early links to Jeruaalem galore and it would be a much more open and fruitful field of study..","date":"2014-01-19","mins":"6:17 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73657","author":"charles_freeman","post":"Well, you need to find a specialist in Greek texts of this period to advise you – find a university department specialising in Byzantium and see if anyone can answer your query. I am doing some work in Constantinople/Istanbul this year ( and in fact was there in November) – leading two study tours – but I am concentrating on the buildings and classical history and Greek texts are not my specialist area..","date":"2014-01-19","mins":"4:42 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73602","author":"charles_freeman","post":"‘There is no other viable explanation of those coincidences. For the ‘Academia’ pseudoscholars – blinded, prejudiced, immersed in their dogmas, lacking any imagination – no chance, I think. But as always, I can be mistaken, and someone may come with some brilliant and unexpected solution…’ Can I object to this? When there are so many problems with the tortuous Mandylion route to Lirey and there has as yet, so far as I know, been no serious research on the much more direct, documented routes of relics from the ‘Lord’s Tomb’ straight to northern France, this is an unjustified comment. I think myself that the blind prejudice lies in sticking to one possible, but extraordinarily unlikely, solution so dogmatically that one is not even able to consider others..","date":"2014-01-18","mins":"1:39 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73711","author":"charles_freeman","post":"Louis’ No.11. Seen and read. I have checked up sources used by Wilson too many times to find that they do not say what he says they say to be impressed. I am not going to repeat them because apparently we all have to treat him with kid gloves. One day someone will write a book beginning: ‘ If the Shroud is authentic, hence originating in Jerusalem c. 30 AD, and yet is first documented in Lirey in the 1350s, then are several routes by which it may have got there. Any serious historian is going to explore them all before assessing which are the most likely. We would start with the early relic collections in northern France as several were close to Lirey and contained relics that were said to have come directly from the ‘Lord’s Tomb’ in Jerusalem. We may not be able to find documentation to support this but no serious historian can discount this possibility as it provides the simplest explanation. It is quite possible that these relic collections were looted during the wars between the English and French in the fourteenth century and the story that the Shroud was ‘a spoil of war’ won by Geoffrey de Charny, although later, might be true….’.","date":"2014-01-19","mins":"12:56 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73661","author":"charles_freeman","post":"Matthias well it is my profession and I chose it so that I be out and about in the Mediterranean as much as possible!.","date":"2014-01-19","mins":"5:06 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73706","author":"charles_freeman","post":"1. Could the Mandylion transferred to he Constantinople in 944 be anything else other than the Shroud of Turin? Yes or No. 2. If Yes, then what it was? Answer to One. Certainly yes.It needs enormous distortions of a few texts usually by people who are not specialist in the Greek religious texts of this period to suggest anything other. Answer to Two, The Mandylion was an image probably created in the late sixth century and fitted into the Agbar legend which was then embellished to present it as an image created by Christ when alive so as to boost the arguments that Christ himself supported representations of himself. That seems the summary of current Byzantine scholars as I understand it..","date":"2014-01-19","mins":"12:27 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73655","author":"charles_freeman","post":"I would love to but I am already fully committed to other projects this year and I don’t have the expertise to work in early medieval French documents. We simply know that northern France had large early relic collections, that it was the custom to tag relics as a mark of authenticity and that we have collections of relics tagged as coming from Jerusalem including some said to be from the Lord’s Tomb that ended up very close to Lirey. So there is important work to be done here to expand on this but sadly I am not the one to do it. What one can’t do is present the Mandylion version without saying that it was only one of several alternative ways in which the Shroud might have come to do Lirey..","date":"2014-01-19","mins":"4:38 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73783","author":"charles_freeman","post":"‘Of course, this is just a possible explanation and others can be put forward (HURRAH!!]… But in the end, whatever the reason, I still believe that, in the light of all the known historical sources concerning both the relics of the Passion and the Mandylion, a direct transfer from Jerusalem to Constantinople without a séjour in Edessa is the most rational and prudent hypothesis we can draw for the Shroud of Turin. I hope that even the most fanatical of Wilson’s fan out there will at least recognize that such a hypothesis is POSSIBLE (I don’t say probable, just possible).’ Hear hear, Good sense coming into the debate but we must look at the possibility of a direct transfer from Jerusalem to northern France as well as we know such trade in relics existed. All in all there is scope for a good book on the Shroud which examines all these possibilities. If only we can persuade people that the Wilson theory is just that and has diverted too much attention away from other important areas of research then one could actually move on in Shroud studies..","date":"2014-01-20","mins":"3:59 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73782","author":"charles_freeman","post":"Good to see someone who knows the texts contributing to the debate!.","date":"2014-01-20","mins":"3:55 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73795","author":"charles_freeman","post":"‘All of these theories involve speculation.’ Yes and this is where professional historians BEGIN their work – to see whether these speculations have any support. As this has never been done in the case of the Shroud, so far as I know, with regard to the more obvious routes along which relics travelled from Jerusalem either to northern France or to Constantinople they will remain speculations until the research has been done by professionals able to read and assess the original sources. As there are records of sets of relics associated with the Passion, crucifixion and burial of Christ recorded as coming into Constantinople as early as the fourth century and into northern France by the seventh and eighth, the balance of probabilities is that one of these would be the route the Shroud would have taken. Linen would certainly not have lasted long bricked up in a wall!!.","date":"2014-01-20","mins":"7:46 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73872","author":"charles_freeman","post":"Reply to 47. ‘Because, instead of facing the arguments presented in article directly, he is going with some gibberish talk about ‘direct routes from Jerusalem to Lirey’ knowing well that there are none.’ Excuse me. These routes are well documented by Michael Mc Cormick in Chapter Ten of his Origins of the European Economy, Cambridge UP, 2001, the definitive book on the subject of early medieval trade. The relics (which ended up in shrines close to Lirey) are tagged as coming from Jerusalem and Mc Cormick sees them as part of the reviving trade routes in the Mediterranean after the collapse of the Roman Empire. I can excuse your complete ignorance of the various trade routes of relics from Jerusalem across the Mediterranean because you were clearly not aware of them but for those of us who do study these things we do not take kindly to being called ‘dishonest’ when we feed in the findings of internationally recognised experts in this area to this discussion..","date":"2014-01-20","mins":"6:11 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73803","author":"charles_freeman","post":"Because I am open minded to all possibilities and I get frustrated to find that so little research has been done about so many aspects of the Shroud!.","date":"2014-01-20","mins":"8:16 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73660","author":"charles_freeman","post":"‘It eludes me why any Passion relics should be taken direct from Jerusalem to ancient Gaul.’ Well, it is well documented from tags on the relics themselves that they were see my earlier postings about relics from ‘the Lord’s Tomb ‘ that are known in collection close to Lirey. Northern France was avid for relics and there were large collections, including those of Charlemagne, early on. They were added to by the Crusades. As the Shroud is first documented in northern France, overwhelmingly the most likely source of its origin lies somewhere within these collections but, as I have said above, I have not the skills or time to do the research that is needed for this. It may have been captured by de Charny in the wars with the English that devastated this area and must have involved the looting of relics from the collections that had been there for centuries. I can only repeat that to stick to the Edessa theory without even mentioning more plausible alternatives for the arrival of the Shroud in northern France is simply bad history. A historian starts,BEFORE researching , going through ALL the possible routes of which, of course, there are many through which relics made their way from Jerusalem to northern France, and picks out the most likely for further research. If I did have the time to do the research, the Edessa theory would be very low down on my list indeed, partly because specialist scholars in Greek texts and Byzantine relic cults have always rejected it. ( Wilson does not even read Byzantine Greek!!) Although it is still not that likely, the most interesting alternative for me would be to chart the well documented collecting of relics from Jerusalem by Pulcheria, the sister of the emperor Theodosius II, in the early fifth century. The reason for this is that her collection was housed not in the imperial palace but in the Blachaernae church on the outskirts of Constantinople and it was, of course, there that Robert de Clari , saw a shroud with an image that might have been one of her fifth century imports brought directly from Jerusalem. Again, going for the Edessa theory without even mentioning this possibility is bad history. You need to start by listing all the possibilities and then you may well find that the actual truth is concealed from us because the documentation surrounding the early history of the Shroud has been destroyed anyway in the medieval Anglo French wars in northern France, in the French revolution or in the sacks of Constantinople by the crusaders and Ottomans! Sadly that is usually the case and we simply have to say ‘we don’t know’! That is why I am usually sceptical of people who are certain that they know what happened ( and proud of it!)..","date":"2014-01-19","mins":"5:03 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73925","author":"charles_freeman","post":"Matthias. You are making the mistake of accepting the Wilson hypothesis and then trying to explain any objections (of which there are many) to it. Try starting the other way round and say ‘ If the Shroud is authentic and has arrived in Lirey by 1350, then let’s consider the most likely routes through which it may have made its way there.’ (See also ‘Anonymous’ below who is thinking like this so there is at least someone prepared to take things on.) Perhaps one of the more opulent Shroudies could finance someone to do a Ph D on the subject it does need three years concentrated work in the archives from someone who knows the right languages. My own take is that a C14 date will probably come up with a medieval result but I will wait and see. It is also likely that someone who has never studied the Shroud but who is working on one of the other medieval linens that survive, using technology that is way ahead of anything known in 1978 or 1988, comes up with some findings about images on the medieval linens which can be applied to the Shroud. That is how breakthroughs often take place. I haven’t seen anything in these debates that suggest anyone who has worked with medieval linens at all but it is a growth area in art history even if I have seen nothing that can be directly applied to the Shroud..","date":"2014-01-21","mins":"10:05 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73928","author":"charles_freeman","post":"‘We know from Arculfus relation that the lance was still in Jerusalem in 670 AD.’ I think ‘a’ lance is probably more accurate – a completely different one was unearthed during the First Crusade and there are number of the ‘originals’ around as is typical of relics of the Passion..","date":"2014-01-21","mins":"10:08 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73948","author":"charles_freeman","post":"O.K. I have every right to object to being called ‘dishonest’. It seems that you use the term of anyone who has happened to have studied the issues more deeply than you have and has access to much more relevant material in the search for understanding whether the Shroud is older than 1350 and, if so, what its history may have been before then. With the refusal of so many so called ‘ Shroud researchers’ to examine any possibilities outside the Wilson hypothesis it is more and more likely that the ‘mystery ‘of the Shroud will actually be solved by an outsider working in an associated field, say medieval linens or the Mediterranean relic trade. There is very little evidence that any ‘researcher’ here (and I include myself) has the needed skills to do the archive work which is why I have suggested someone finances a Ph D student with the right languages to do it..","date":"2014-01-21","mins":"11:26 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-213838","author":"charles_freeman","post":"I wonder where the Hungarian monks got the idea that there were two linens involved. Anyone else know of a single example in medieval art where two are depicted? Or this just a scientist with no background in medieval relic cults or art history’s imagination?.","date":"2015-10-29","mins":"12:21 pm","url":"https://shroudstory.com/2015/10/29/ye-denizens-of-shroudsponge/","cat":"other_blogs","title":"Ye Denizens of Shroudsponge"},{"id":"comment-73667","author":"charles_freeman","post":"No it doesn’t override the gaps. It provides no explanation of where the Shroud was in those crucial first five hundred ( repeat five hundred) years before the sixth century and again does not fill in the gap after 1204. Then again the chance that the Image of Edessa and the Shroud are the same is extremely tenuous – and this is being generous ! Once one begins to look at the alternatives, the Edessa theory fades quickly out of the picture as a likely possibility..","date":"2014-01-19","mins":"6:06 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73911","author":"charles_freeman","post":"Louis.’Rome is aware of the gaps and the controversy and there is a commission to check the provenance.’ This is fascinating. Please tell us more. I agree with you that one should not quote Wilson as if his work is your own, better to check out the original sources that he provides. When he started writing it was very difficult to track down these sources – I remember well ploughing my way through large volumes of 1890 translations of the Church Fathers for my own research – now he can be checked up on the web..","date":"2014-01-21","mins":"7:36 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."}]
