[{"id":"comment-196793","author":"charles_freeman","post":"It is interesting that in the Byzantine iconography of the laying out of Christ’s body, they almost always show him wrapped in linen strips and with a separate face cloth. In the western tradition, he is normally lying on a single sheet which often looks too small to wrap round the whole body. Nothing in medieval art that I have yet seen,but I am still working on it, suggests that any artist is copying a single sheet as large as as the Shroud. There is also no tradition in either iconography of showing any images on the cloth. Although there are two different iconographic traditions,both can draw on gospel sources..","date":"2015-04-19","mins":"1:20 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196830","author":"charles_freeman","post":"Wow, O.K. You certainly have your work cut out when you say there is no basis for the gospels being post 70. You have some formidable scholarship to contend with. Good luck! You must realise, of course, that yours is a very small minority position within New Testament studies as a whole but perhaps that does not worry you..","date":"2015-04-19","mins":"10:51 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196813","author":"charles_freeman","post":"Mainstream scholarship.e.g. Oxford Companion to the Bible accepts Mark, c. 70, possibly a bit earlier, Matthew and Luke c. 80 and John 90 100. That is just mainstream scholarship but it has been well defended by people who have spent their lives working on these texts. There have been a lot of problems over how far the gospel writers knew the geography of what they were writing about. Tradition says that Mark was writing as afar away as Rome, for instance, although the modern scholarship tends towards Syria, as there seems a mistaken link between the evangelist Mark and Peter. It is in fact John who usually scores most highly in that places he mentions had no alternative sources backing them but have since have been been confirmed by archaeology. If ,unlike myself, you think the Shroud is authentic, John is the only one to mention the lance wound so how far would you trust him on other issues?.","date":"2015-04-19","mins":"5:07 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196899","author":"charles_freeman","post":"I would think that as OK holds a position that is at odds with the consensus of academic opinion – and as David Mo says it is a formidable consensus of experts the onus is on him to prove his case. The early dating was tried out by people such as John Robinson in the 1960s but decades of scholarship later, no one is now convinced by him. Still OK is free to defend his position. I would be interested to hear it. I do worry ,however, that whenever an established academic disagrees with OK’.s position he or she is dismissed as a fraud. You must do better than that Ok!.","date":"2015-04-20","mins":"5:26 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196935","author":"charles_freeman","post":"O.k. I may have missed it but can you provide your own preferred date for each of the gospels – and,of course, the concrete data that supports your dates. I am just repeating conventional scholarship as I have not spent thirty or forty years working on these texts as many have and am prepared to support such scholars when their varied approaches arrive at roughly similar conclusions as to dating. You need to convince me that I should not..","date":"2015-04-20","mins":"11:38 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-51776","author":"charles_freeman","post":"I didn’t listen to all of this there were too many assertions made that are contested and having asked around anyone who knows about blood I still haven’t found anyone who has ever seen bright red blood used in a criminal trial as evidence that the injured/deceased was tortured before death – yet it seems to be Barry’s clinching argument. I see that the debates over blood rage on elsewhere. There is just one simple point I want to add it seems. From these debates, that if the Shroud is not authentic, it must be a forgery. In fact there is a third possibility, that it was a painted cloth made for some other function that became venerated (as an icon) and was then ADOPTED as the genuine burial shroud of Jesus. I take it that this is what Kaeuper and Kennedy believe when they write in their little book on Geoffrey de Charny and his treatise on knights that after de Charny’s death, Jeanne de Vigny, now his widow, and clergy ‘blurred the crucial line between icon and relic’ (p.41). I think this possibility needs recording to make for a more nuanced discussion..","date":"2013-11-17","mins":"3:02 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51853","author":"charles_freeman","post":"Sadly there are all too many examples from recent history of traumatised bodies – so let’s have some post mortem reports that specifically note that the degree of suffering can be ascertained from the redness of the blood..","date":"2013-11-18","mins":"3:59 am","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-51852","author":"charles_freeman","post":"Hugh you are getting dangerously close to being recommended to read my Holy Bones, Holy Dust, How Relics Shaped the History of Medieval Europe. You are broadly right as early as the twelfth century Guibert of Nogent was warning of faked miracles and relics that could not be what they said they were. I think it was the growing numbers of pilgrimages from the thirteenth century onwards that was important as people would come across the fifth thighbone of St.Peter as they travelled from one part of Europe to another and so a gradual scepticism crept in.This was fuelled by rival shrines discrediting each other and appealing to the pope to get their relic authenticated and their rival condemned. The Shroud itself is a good example of a relic that, in the medieval period, never got church approval other than as an object worthy of veneration. By the fifteenth century there was much more widespread scepticism about relics (e.g. The Lollards and Hus, De Sanguine Christi of 1405 , a major attack on blood of Christ cults) and this culminates in the sixteenth century in wonderful satires as in Erasmus’ Pilgrimages for Religion’s Sake of 1526 ( available on line) and then John Calvin’s massive rejection of relics in his Treatise on Relics. These were Christian attacks on relic cults (N.B. Those who think that anyone who doubts the authenticity of the Shroud must be an atheist!). Forgeries went on all the time but most were very crude and didn’t take anyone in – see the response to the Pardoner in Chaucer’s Canterbury Tales. As I suggested above, many relics were in fact mysterious objects that had originally been made for some other function but which then became associated with a miracle or whatever and so became venerated in their own right as the pope allowed veneration of the Shroud but only on the condition that it was announced that it was not authentic. Then sometimes the line got crossed and an icon worthy of veneration became seen as an actual original relic. I am only putting forward this for those Shroudies who say that if the Shroud is not authentic, it must be a cunning and sophisticated forgery. There are alternatives. Meanwhile we all wait to hear of anyone anywhere who has been able to replicate Adler’s dried red blood..","date":"2013-11-18","mins":"3:57 am","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-198604","author":"charles_freeman","post":"Tetradiplon is just not a relevant issue as it only ,in one comparatively late text, referred to the cloth before it had been handed to Jesus. I am quite happy with it being used to describe a double folding four times as shown on the Parthenon frieze cloth! Why search any further when we have visual evidence of a cloth folded doubled four times. I don’t need to play around with alternatives. It is Wilson who needs to rewrite his text to make it quite clear that there is no reference to tetradiplon after Christ had wiped his face! I cannot work out whether he was just being careless or dot dot do dot. But if he does write another edition he needs to leave it out as it is simply not relevant to an already hopelessly weak argument..","date":"2015-05-08","mins":"7:34 am","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","title":"A Folding Method Charles Freeman Might Accept"},{"id":"comment-198677","author":"charles_freeman","post":"But the basic point is ,Hugh, is that is not a shred of evidence that the cloth was folded in any way at all AFTER the image of the face had been placed on it. This is where Wilson misleads by giving the impression in his The Shroud that tetradiplon refers to the face cloth after Jesus had wiped his face on it. This is why he should take out this section altogether. If we are talking about possible foldings these should only refer to how the face cloth was folded before it was given to Jesus. And it is a face cloth as the grave cloths are mentioned separately in the same t Ext. Now, overwhelmed ( actually underwhelmed) by Colin’s bright blue chemical mixtures, I must drop out to focus on the group of 22 that I am leading around the Greek Peloponnese for the next ten days. They are all convinced that the Greek economy will collapse leaving them stranded on a mountain hillside somewhere – getting them all to the airport will be challenge enough!.","date":"2015-05-09","mins":"2:01 am","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","title":"A Folding Method Charles Freeman Might Accept"},{"id":"comment-198615","author":"charles_freeman","post":"Max Well any intelligent reader would have spotted that Wilson got the illustration wrong but few would have gone back to the original text to find that he had got the placing of tetradiplon in the original text wrong too. And I think I have a first in showing that the sacred cloth of the Panathenaic festival was doubled over four times, the most obvious meaning of tetradiplon, so possibly implying that the cloth when given to Jesus as tetradiplon it had a sacred status. There is nothing in the text to suggest that that the cloth was anything but an image of a face and, as I have also pointed out, the grave cloths are mentioned later in the same text so the tetradiplon cloth cannot have anything to do with the Shroud. It is better for Wilson to cut out the whole issue to save himself further embarrassment..","date":"2015-05-08","mins":"9:16 am","url":"https://shroudstory.com/2015/05/08/a-folding-method-charles-freeman-might-accept/","cat":"news_&_views","title":"A Folding Method Charles Freeman Might Accept"},{"id":"comment-197209","author":"charles_freeman","post":"Steve. I have just been visiting the Cathedral Museum in Ferrara. They have a wonderful set of sculptures of the months, each of the survivors from the original twelve having beautifully sculpted figures. We do not know who the sculptor was nor do we have any other works of art that are recognisably his so he is simply known as the Master of the mese( months) in Ferrara. This is quite common as documentation is often very poor and names and works have been lost. If the artist of the Shroud specialised in painted linens , so few have survived that it would be highly unlikely that we would have any others left by him. So that is not really an issue here..","date":"2015-04-22","mins":"12:23 pm","url":"https://shroudstory.com/2015/04/21/charles-freeman-and-the-huffington-post-caption-writer/","cat":"2015","title":"Charles Freeman and the Huffington Post Caption Writer"},{"id":"comment-198540","author":"charles_freeman","post":"Nabber the only reason why this minor point was raised at all is that Wilson used it to shore up his argument that the Image of Edessa and the Turin Shroud are one and the same. Some people may have been taken in probably not many as it is quite clearly wrong but some. Not many would have gone back to the original text to check whether Wilson was right in saying that tetradiplon referred to the cloth after Christ had wiped his face on it. Yes, tridiplon would do nicely to describe a cloth that has been folded double three times and if that had been the word used I would have been with Wilson., but the most likely translation is a futher doubling to make four and thus bring it into line with the four times doubled cloth of the Panathenaia..","date":"2015-05-07","mins":"9:02 am","url":"https://shroudstory.com/2015/05/07/charles-freeman-on-tetradiplon-and-the-video-on-shroud-com/","cat":"comments_promoted","title":"Charles Freeman on Tetradiplon and the Video on shroud.com"},{"id":"comment-198627","author":"charles_freeman","post":"Well, Hugh,the Panathenaic cloth was ritually folded in a way that saw it doubled four times the layers can be seen in the British Museum marbles. So here we have an actual example of a cloth treated with respect that was certainly tetradiplon.So I don’t think you are far off when you say that to label a cloth as tetradiplon you are giving it status and this would have been appropriate for a cloth handed to Christ.. Just as the Panathanaic cloth was left unfolded after it was placed on the statue of Athena, so too the text here makes no mention of any refolding once it had its face of the living Christ on it. Again it is worth repeating that as the grave cloths are mentioned later in the same text, this could not possibly be the Shroud. When I was originally researching this I found references to the pallium with which a new priest was invested also being a folded cloth. Alas I could find no reference to the folds being tetradiplon but as many pagan rituals were transferred into Christianity ( Jerome had a big moan about that) it is not impossible. But tetradiplon is clearly irrelevant if one is trying , quite without any foundation to my mind, to link the Image of Edessa to the Turin Shroud!!!.","date":"2015-05-08","mins":"10:06 am","url":"https://shroudstory.com/2015/05/07/charles-freeman-on-tetradiplon-and-the-video-on-shroud-com/","cat":"comments_promoted","title":"Charles Freeman on Tetradiplon and the Video on shroud.com"},{"id":"comment-142807","author":"charles_freeman","post":"As I understood Thibault’s articles on the Rogers’ threads, he found a very small proportion of cotton fibres. I have failed to understand the argument here as the cotton in itself does not seem to be in sufficient quantities to sway the date significantly. Rogers certainly does not explain this. He seems to suggest that all the reweaving is cotton although I must say I find his article annoyingly imprecise. Perhaps Thibault can help out here..","date":"2014-08-07","mins":"12:45 pm","url":"https://shroudstory.com/2014/08/05/5050-colin-berrys-most-outlandish-proposal/","cat":"other_blogs","title":"50/50  :  Colin Berry’s Most Outlandish Proposal"},{"id":"comment-191663","author":"charles_freeman","post":"These are hypotheses but they are ones which are making sense to people who know about these things and so eventually something acceptable to the scientific community may emerge. No other hypotheses about the making of the images have gained any widespread support, certainly not in any scientific circles, so why not try another in a field that is still open?.","date":"2015-02-23","mins":"1:21 pm","url":"https://shroudstory.com/2015/02/23/catching-a-wonderful-response-to-charles-freeman/","cat":"uncategorized","title":"Catching a Wonderful Response to Charles Freeman"},{"id":"comment-142811","author":"charles_freeman","post":"But there were vast quantities of imported cotton in Europe from 1200 and the weavers/spinners often used both together e.g. In fustians. See Maureen Mazzaoui’s excellent The Italian Cotton Industry in the Later Middle Ages, 1100 1600, Cambridge 1981. After all it was Raes who claimed that cotton and linen were often woven in the same workshops although for some reason he seemed to believe that this happened in Roman times when, as Mazzaoui shows, it was far more prevalent in the Middle Ages, both in Italy and southern Germany..","date":"2014-08-07","mins":"1:13 pm","url":"https://shroudstory.com/2014/08/05/5050-colin-berrys-most-outlandish-proposal/","cat":"other_blogs","title":"50/50  :  Colin Berry’s Most Outlandish Proposal"},{"id":"comment-146765","author":"charles_freeman","post":"Colin, I have had extensive criticism of some of my works by right wing Christian evangelicals, and in some case, outrageous abuse. I have had one star Amazon reviews of books I spent three years writing with the reviewer saying he had given up after two pages because the Lord was not in my heart. In one case I made some historical corrections to a misinformed blog and got virtually wiped off the face of the earth by a so called professor (who turned out to know nothing at all about the subject being discussed). There was nothing much I could do about it who do I sue and where, and what damages would I get? Perhaps you could try a test case against Dan I am sure the lawyers will be pleased to take your money. If you want to contribute to a website where many people disagree with you, then you will get responses that you consider are unfair, as I did in the cases above. It is the nature of internet debate as it is equally open to people who are specialists and people who have no academic background at all. I applaud Dan for keeping things as open as they are even to sceptics such as myself. The only way I discovered to deal with it was to develop my ideas with as much material backing them as possible, get them published, don’t abuse my opponents,and trust that intelligent readers will support what I am doing. Then if you are confident and behave with integrity you can sleep in peace if there are attacks on you..","date":"2014-08-28","mins":"7:06 am","url":"https://shroudstory.com/2014/08/28/a-response-to-a-comment-by-colin-berry/","cat":"uncategorized","title":"A Response to a Comment by Colin Berry"},{"id":"comment-1774","author":"charles_freeman","post":"Well, I certainly ignored the AB on the Shroud as being unlikely when I first read of it. But there is someone called Kelly Kearse who is making a big thing of it – I don’t know what his qualifications for doing this are as there does not seem any evidence that he has analysed the sample himself. If I was arguing the ‘Shroud is authentic’ case , I would certainly be very cautious about making definitive statements about AB, always a minority grouping, on such poor samples in case they were used against me, but there you go. Similarly if I was looking at how a first century Jerusalem relic might have got to Europe, I would start with the three most likely routes as there is documentation and evidence from all three. A) The early recorded relic trade between the Holy Land and Europe documented by Michael Mc Cormick in his Origins of the European Economy. B). The documented transfer of relics from Jerusalem to Constantinople from 330 onwards, including those relics brought in by Pulcheria, the emperor’s sister in the early fifth century. Then transfer to Europe as a result of the massive looting of relics by the Crusaders c) The documented transfer of relics collected in the Holy Land to Europe from the Crusades. When we have so much evidence to explore here, why did Ian Wilson ever dream up the Image of Edessa idea as a means of getting the Shroud to Europe? It has been condemned by every Byzantine scholar who has discussed it and, due to the sheep like nature of those who have accepted it, has diverted attention from far more relevant areas of research in the early relic trade. However, virtually none of these ‘shroud researchers’ have any background in the period 350 to 1100 which, and I still see myself as an outsider to it, is extraordinarily complex as a result of poor sources and complex literary conventions in the Greek and Latin texts.So they swallow Wilson and ignore the most likely ways in which an authentic first century relic, if any such exist from a period when relics were not collected anyway, might have reached Europe!!.","date":"2013-01-22","mins":"12:59 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/11/what-is-a-shroud-expert-and-is-he-or-she-to-be-trusted/","cat":"culture","title":"What is a Shroud  “expert” – and is he or she to be trusted?"},{"id":"comment-142825","author":"charles_freeman","post":"Cotton was imported in large quantities ( as Mazzaoui’s title suggests from1100) everyone knew how it grew, the problem was that the European climate was too temperate for it succeed there. Rogers was quite frankly misleading..","date":"2014-08-07","mins":"1:46 pm","url":"https://shroudstory.com/2014/08/05/5050-colin-berrys-most-outlandish-proposal/","cat":"other_blogs","title":"50/50  :  Colin Berry’s Most Outlandish Proposal"},{"id":"comment-169886","author":"charles_freeman","post":"Yes, all this sounds very plausible. We have about four hundred accounts of the Quem Queritis ceremony ( see Karl Young’s book on medieval drama).,so how many hundreds can you provide of yours? Young provides instances of a single cloth being held u p before the empty tomb by two priests and then processed to the altar where the cloth was given due reverence. If you want an illustrated example there is a medieval artefact called the Lirey Pilgrim Badge that shows just this. I am sorry to hear that you hate the Catholic religion. As a historian who likes tradition I am pleased that the pope himself is coming to Turin to venerate the Shroud in a tradition that now goes back six or perhaps seven hundred years. This kind of continuity is important and I also like to come across similar processions ,etc ,from the medieval period that are still gong strong. Of course, the pope seems to be within the tradition of Clement VII in being careful not to say that this is the authentic burial cloth but this does not make it any less worthy of respect. Thank goodness there is no evidence that it was designed to deceive or we would really be in trouble. Good luck with your researches and be sure to post your findings..","date":"2014-11-08","mins":"11:55 am","url":"https://shroudstory.com/2014/11/07/charles-freemans-article-covered-in-forbes/","cat":"press_coverage","title":"Charles Freeman’s Article Covered in Forbes"},{"id":"comment-1761","author":"charles_freeman","post":"Thank you, Colin. It is important to contribute when you can. I am pleased to see that my article on ‘tetradiplon’ has now worked its way up to the top of a Google search because the attempts to fit that tetradiplon to the Turin Shroud/Image of Edessa were just laughable. One could possibly argue that it meant a cloth folded into four or a cloth folded double four times but Ian Wilson had a cloth folded double THREE times and so folded into EIGHT as a result he missed both possibilities! So I am glad that his idea is no longer the first you come to in a search, even if you don’t agree with everything I say..","date":"2013-01-21","mins":"5:49 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/11/what-is-a-shroud-expert-and-is-he-or-she-to-be-trusted/","cat":"culture","title":"What is a Shroud  “expert” – and is he or she to be trusted?"},{"id":"comment-1756","author":"charles_freeman","post":"A good question as to who is an expert here. I have been surprised by the number of people who describe themselves as ‘shroud researchers’ and list over twenty years experience but who simply seem to reproduce the ideas of others with no original input of their own. So Stephen Jones ( who has accused me of knowing that the Shroud was authentic but casting doubt on its authenticity simply to make money – and for an article for which i was paid nothing!) merely parrots Ian Wilson (Saint Ian of the Holy Shroud) and so far as i can see from his website provides nothing original of his own while seeing off anyone who dares to comment unfavourably on what he has written. No wonder Dan Porter’s blog flourishes while Stephen Jones’ stagnates. My expertise on the Shroud is marginal, as the author of the only full length history of medieval relics on the market (Holy Bones, Holy Dust, Yale UP, 2011), one which has been well received. The two and half years of full time research I have done on medieval relics makes me believe that the Shroud is almost certainly medieval but, as there was once a burial shroud in the tomb of Jesus, there is a tiny, and really tiny, outside chance that it could be it. However, I have also earned my living professionally as a historian for forty years and it was from this ‘expertise’ that I saw the immense weaknesses in Ian Wilson’s work on the Shroud. Is he an expert on the Shroud who,however, fails miserably as a historian? Certainly the real experts on Byzantine history, religion and literature unanimously condemn his argument about the Image of Edessa, so I am in good company. (If it were proved that the Shroud is authentic, it is much more likely that it came to Constantinople with the other relics from Jerusalem that we know arrived in the fourth and fifth centuries see the wonderful ivory (now in Trier) of the relics of St. Stephen being brought into the city from Jerusalem c. 420.) I would also rate Madame Flury Lemburg, who is an acknowledged expert on textiles and who has worked closely on the Shroud, when she says there is no reweaving, over Ray Rogers, whose views, never confirmed or replicated by any later research, seem to be based on threads that he claims, without any further authentication, to come from someone who was present, years before, at the cutting up of the Shroud. How he got this one past his peer reviewers I cannot imagine! All kinds of contamination could have got into those threads in the years after they were cut off and before they were forwarded to him ( and why him when there were so many laboratories in italy where the level of expertise in textile analysis would have been many times greater?). So which experts decide who are the real experts? A good question..","date":"2013-01-21","mins":"11:08 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/11/what-is-a-shroud-expert-and-is-he-or-she-to-be-trusted/","cat":"culture","title":"What is a Shroud  “expert” – and is he or she to be trusted?"},{"id":"comment-1777","author":"charles_freeman","post":"Yes, you have hit the nail on the head. There is no evidence from which to start with a presumption of authenticity so his statement is meaningless. The presumption is that alongside thousands of other medieval relics it is a later creation made by methods we do not yet understand. Even the STURP ‘analysis’ could not come with anything in favour of authenticity. And the way that the samples taken in 1978 have been scattered around to those who have already come out in favour of authenticity makes the whole thing a joke..","date":"2013-01-23","mins":"8:26 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/11/what-is-a-shroud-expert-and-is-he-or-she-to-be-trusted/","cat":"culture","title":"What is a Shroud  “expert” – and is he or she to be trusted?"},{"id":"comment-1771","author":"charles_freeman","post":"A good project. While you are into genetics, which is not my field, you might look at the AB blood grouping of the Turin Shroud. I have my doubts about the analysis of the blood anyway but now it is firmly argued that it is blood group AB. The general consensus is that this was not known before AD 900 and was the result of incoming B groups from the east mingling with native A groups on the Hungarian plain, with AB becoming genetically embedded in the population by 1100 1200. That the initial encounter was here is backed by the Hungarians having the highest percentage of AB of any native population in Europe, suggesting a longer period of interaction.. Analysis of Hungarian graves has also failed to find any evidence of AB before 900. Like many consensuses I have found it stated by various people including a Hungarian professor summarising these findings in an online interview but haven’t got the original research. I have asked around for any evidence of earlier AB and there has only been ONE example provided, a very small Israeli sample of 1977 which found AB among a family group there. However, some other early testing suggesting AB in Egypt has now been redone and found invalid ( I think it turned out to be A not AB) and without some replication here this does not seem to be firm enough evidence to overthrow the presumption that AB is post 900.. As I already believe that the Shroud is medieval, partly because, despite all the mud thrown at the radiocarbon labs, no one has come up with any plausible reason why the tests were invalid and there is not an ounce of scientific evidence that the Shroud is first century, then the AB grouping is at the moment for me, merely supportive evidence which needs much more backing than i can give it. It may be that whatever is on the Shroud anyway is not blood from the AB group but the ‘Shroud is authentic’ believers have nailed it to their mast so they must be prepared for the obvious objection that AB blood is almost certainly medieval. Over to the scientists! meanwhile I will keep on asking my medical contacts – so far no one has come up with anything earlier than 900..","date":"2013-01-22","mins":"11:16 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/11/what-is-a-shroud-expert-and-is-he-or-she-to-be-trusted/","cat":"culture","title":"What is a Shroud  “expert” – and is he or she to be trusted?"},{"id":"comment-43712","author":"charles_freeman","post":"On the Dawkins challenge, if RD and his mates in various departments in Oxford, did come up with a solution , how would ‘the people’ decide on it. Worldwide vote? Shouldn’t there be an independent committee of experts , including art historians and the relevant scientists, set up who be prepared to assess any claim by Dawkins? What if someone else, somewhere else in the world, comes up with a solution can Dawkins appropriate it – does that count?.","date":"2013-09-11","mins":"3:15 am","url":"https://shroudstory.com/2013/09/10/david-rolfe-challenge-to-richard-dawkins-embedded-in-pj-media-article/","cat":"press_coverage","title":"David Rolfe challenge to Richard Dawkins embedded in PJ Media article"},{"id":"comment-43898","author":"charles_freeman","post":"I am sorry Dawkins has been silent on this. If I were him, I would at least clarify the terms of the challenge and how it was to be judged and then I am sure if he circulated it on his e mail contact list with a promise that he would pass on some of the £20,000 to anyone who came up with a solution it would be worth the chance. He has nothing to lose. There may well be someone out there in a lab with some new imaging technique that could be adapted for the purpose..","date":"2013-09-12","mins":"4:34 am","url":"https://shroudstory.com/2013/09/10/david-rolfe-challenge-to-richard-dawkins-embedded-in-pj-media-article/","cat":"press_coverage","title":"David Rolfe challenge to Richard Dawkins embedded in PJ Media article"},{"id":"comment-1769","author":"charles_freeman","post":"It’s not my field, Colin. Certainly there are constant reports of finding Scandinavian DNA in the eastern side of the UK where they settled. I suspect it is complicated. Certainly the collapse of Roman rule in England had more profound effects than virtually anywhere else with a dramatic fall in living standards and even the ability to make pottery of a wheel..","date":"2013-01-22","mins":"9:27 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/11/what-is-a-shroud-expert-and-is-he-or-she-to-be-trusted/","cat":"culture","title":"What is a Shroud  “expert” – and is he or she to be trusted?"},{"id":"comment-215788","author":"charles_freeman","post":"Enigma indeed. The three d figure shown at the top of David Rolfe’s website could not possibly have transmitted the images as we know them..","date":"2015-12-07","mins":"6:49 am","url":"https://shroudstory.com/2015/12/07/david-rolfes-website/","cat":"other_sites","title":"David Rolfe’s Website"},{"id":"comment-144199","author":"charles_freeman","post":"Does anyone have any details of the radiocarbon dating that came up with a AD 30 plus or minus 70 years from 1982 that Habermas mentions in his lecture ( at 30 minutes, 30 secs). I had never heard of it before. Provenance of sample, possibility of contamination, laboratory testing it, etc all the issues that have come up with 1988. Was it an AMS dating if not where did they get a big enough sample from ?.","date":"2014-08-16","mins":"11:04 am","url":"https://shroudstory.com/2014/08/16/another-gary-habermas-shroud-of-turin-video/","cat":"news_&_views","title":"Another Gary Habermas, Shroud of Turin Video."},{"id":"comment-144212","author":"charles_freeman","post":"Thanks, Hugh. I thought that the controversial thread you are talking about actually dated later – not as early as AD 30. Perhaps Habermas was speaking before all the controversy of it came out but ,as with the coins, some caution is needed before evaluating this video..","date":"2014-08-16","mins":"12:58 pm","url":"https://shroudstory.com/2014/08/16/another-gary-habermas-shroud-of-turin-video/","cat":"news_&_views","title":"Another Gary Habermas, Shroud of Turin Video."},{"id":"comment-57578","author":"charles_freeman","post":"Some time ago the report of the nuns who repaired the Shroud in 1534 was posted on this site with quite a full description of what they saw. The nuns reported that ‘the nail holes are in the middle of the long and beautiful hands’. So the argument seems to be going Matthias’ way..","date":"2013-12-10","mins":"3:38 am","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","title":"Barbet vs Zugibe"},{"id":"comment-138675","author":"charles_freeman","post":"Giulio Fanti ( from the interview) ‘There are hundreds of facts in favour of authenticity and independent probabilistic studies have reported that the probability of the Shroud having wrapped the Jesus of history is 100%, with a negligible uncertainty. ‘ I wish I knew where all this convincing material was to be found but, if Fanti is right, they obviously have every right to turn down any paper that does not accept this 100 per cent certainty..","date":"2014-07-16","mins":"6:00 am","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","title":"A Telling Interview with Giulio Fanti"},{"id":"comment-93091","author":"charles_freeman","post":"The [Fanti’s] press releases states: “The results of these studies have produced dating all mutually compatible with a date of 33 BC with an uncertainty of plus or minus 250 years at a 95 percent confidence level.” I really can’t understand the maths here. Fanti produced three disparate ratings from his varied samples. 1) 752 BC plus or minus 400 years this gets us nowhere but it was then subject to some arbitrary adjustment by Fanti to make it 300 BC plus or minus 400 years. 2) 200 BC plus or minus 500 years. If this was correct the date of the crucifixion does lie within this enormous range of 1000 years but this is hardly evidence when the range is so enormous. He does not make the same correction as in 1) 3) AD 400 plus or minus 400 years. Well, you might just catch the crucifixion date if the ‘real’ date is just on the edge of the range. Again he does not make the same correction as in 1) So not one of his dates really provides much evidence for a date of 33 BC. But then ,for some reason I cannot understand, he believes one can average these dates. But we cannot be sure with the enormous disparity of dates that any of them are correct and at the most only one can be.And are we comparing like with like as one would have to do if one is to be justified in using averaging? Or am I missing something? But I am only a historian. Perhaps the mathematicians/scientists among you can sort me out. Thanks..","date":"2014-03-25","mins":"10:25 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-93198","author":"charles_freeman","post":"OK. First we have to ask whether each of Fanti’s tests was on the same material. Then we have to be sure that all this material is original to the moment of creation of the Shroud (e.g. Not dust collected externally). Then we have to be sure that the results of his tests can be set against an objective standard of dating established on other material. If all those three things obtain, we would then have to ask why he came up with such varying results and why he felt he needed to adjust the first result but not the other two. One obvious explanation is that two of the three or possibly all three of the tests failed to produce valid results. Then we have to justify bringing these disparate results together to make an average between them. If I go into a greengrocers and see two cauliflowers in one box, sixteen apples in another and twelve bananas in another, then with 100 per cent certainty, there is an average of ten pieces of fruit per box. But so what? It is a meaningless result and Fanti’s also seems to be. Perhaps also you,as a mathematician, would like to find the average date if Fanti had not arbitrarily adjusted the first date. I am sure it is simple maths for you but it might just end up with an average many years before Christ’s crucifixion and then what? Latendre. This has been discussed exhaustively earlier and I am not going to start again beyond summarising the argument. Wilson tells us that the Image of Edessa was folded tetradiplon (well, in one account it was BEFORE it was handed to Christ but there is no evidence it was so folded AFTER Christ had wiped his face although Wilson suggests it was). Although the word is not known elsewhere we have c.150 examples of Greek words with the prefix tetra. The most likely meaning is that the cloth was folded double four times, making sixteen sections. We have no literary equivalent but we do have a religious one in that the cloth used to wrap the statue of Athena in the Panathenaic festival was folded double four times as can be seen in the sculpture on the Parthenon frieze in the British Museum in London. However, tetradiplon could just mean folded double to make four sections. Now the point I made and to which i had no response was that Wilson showed a cloth folded double three times so making the eight sections he ‘needed’ to show only the hard of the Shroud. In other words, he was creating an image that was not related in any way to any meaning of tetradiplon. With no one challenging me on this, I have long since moved on..","date":"2014-03-25","mins":"5:16 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-93552","author":"charles_freeman","post":"I agree with Yannick. Has Mario looked at a Liddell and Scott Greek Dictionary to see the possible meanings of ‘tetra’ as a prefix? The most likely meaning is that there has been four double foldings and as we have an example from the Parthenon frieze of a cloth folded exactly this way and handed to the priests BEFORE it was put round the cult statue of Athena (just as Christ was handed a cloth described as tetradiplon BEFORE he wiped his face on it), I think we have a good precedent for this. Wilson’s depiction of a cloth on page 191 of his 2010 The Shroud is a complete muddle. He shows the Shroud, then figure a) shows the Shroud doubled to make half the size and he calls this ‘doubled’. So far so good. Then he doubles again for fig b) and for some reasons calls this ‘Doubled in two’ but why not ‘doubled for the second time’ or ‘doubled to make four sections’ as this is what figure b) actually shows. ‘Whatever does ‘doubled in two’ mean? Then he doubles again for figure c). And calls it ‘tetradiplon or doubled in four” while what the figure actually shows is the cloth doubled for a third time to make eight sections. There is no way that ‘tetradiplon or doubled in four’ can describe a cloth doubled three times to form eight sections which is what he actually shows. However, if he doubled the cloth for a fourth time then he would have the face of the Image cut into two and then the implausibility of his argument would be exposed. The sad thing is that he seems to get away with this befuddling does nobody, other than Yannick, actually check up on him or his sources?.","date":"2014-03-26","mins":"2:46 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-93836","author":"charles_freeman","post":"Latrendre. ‘tetradiplon most likely applies to the state of the cloth, not the process to fold it’. It is WILSON who describes it as a process, with a sequence of illustrations, not me so address your question to him. I agree with you that tetradiplon refers to the final state of the cloth AS IT WAS HANDED TO JESUS, just as a cloth folded in just this way was handed to the priests on the Acropolis in the Panathenaic festivals you can count the folds on the sculpture in the British Museum. So actually you and I agree, it is Wilson who brings in the question of process. So as we have no disagreement on this , I will not dust down my 1855 Liddell and Scott specially. The problem is not only Wilson’s muddled illustrations of the process but his assertion that tetradiplon refers to the cloth AFTER Jesus had wiped his face on it. This is not what the text says and he really irritates me when again and again I go back to a text he mentions and finds he has misled us. As Yannick has pointed out the VERY SAME text contains a separate reference to the burial cloths of Jesus so tetradiplon cannot refer to these in any case. It is better simply not to take Wilson seriously..","date":"2014-03-27","mins":"6:54 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-94137","author":"charles_freeman","post":"Latendre. First folding makes two sections, second folding makes four sections, third folding ( as shown in Wilson) makes eight sections, four (‘tetra’) foldings ( as in the Panathenaic cloth) makes sixteen sections and if applied to the Shroud would have cut through the face. Anyway all this is irrelevant as the text makes clear that ‘tetradiplon’ does not refer to the burial cloths of Jesus, so pretending it does is nonsense. Let’s move on..","date":"2014-03-28","mins":"4:43 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-93156","author":"charles_freeman","post":"Thanks, Yannick. I had hoped that someone might have popped up to have shown me a defence of Fanti’s methods. If no one does then I simply assume that he is misleading us, whether he means to or not. I notice that he is also finding all kinds of strange happenings, unexpected accumulations of water on religious statues at Medjorgje for instance, and vibes from the Virgin Mary when she appears there he is a busy man and presumably he has a job to do as well. I am on safer ground with Wilson as I am a professional historian and can see where he is using methods than no professional historian would use and coming to results that cannot be sustained by the evidence that exists. No one ever came to his defence about the mysterious four folding of the Image of Edessa which would have to be folded into EIGHT to fit his theory..","date":"2014-03-25","mins":"3:01 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-57357","author":"charles_freeman","post":"‘ Hugh. ‘To be fair to Fanti, I do not think he continues to press his new dating systems as relevant to the Shroud any more, although they may have value in other circumstances.’. Yes, that is certainly my impression which is why I asked the question in the first place. Until there is an accepted external standard of measurement against which his very varied dates can be judged, I can’t see why we need to take them seriously. Just because with a bit of ‘effects of the fire’ juggling we can get an overlap in the first century don’t get us very far and I suspect that this is why I can’t find any evidence that anyone in the scientific world has given his findings the time of day..","date":"2013-12-09","mins":"4:59 am","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-57233","author":"charles_freeman","post":"What do you mean by ‘good ‘ result? As I understand it Fanti got three very different results. Only one at most of these can be ‘good’ but which one ? (Unless, of course, the Shroud has been worked on continuously from the middle of the first millennium BC onwards and these varied results reflect this.).","date":"2013-12-08","mins":"7:56 am","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-59349","author":"charles_freeman","post":"This is a good move as Hugh has shown that he is able to sort out the dead from the living wood of Shroud research and I am sure he will initiate research into areas where very little work on the Shroud has yet been done e.g. The early trade in relics between Jerusalem and Constantinople in the fifth century as masterminded by Pulcheria, the sister of the emperor Theodosius II, and the direct relic trade between Jerusalem and northern France in the second half of the first millennium AD. Both these routes had documented relics from the Lord’s Tomb or Calvary so need to have further work done on them. I look forward to seeing what comes up in the Newsletter!.","date":"2013-12-14","mins":"10:50 am","url":"https://shroudstory.com/2013/12/14/update-hugh-farey-takes-over-as-btst-editor/","cat":"news_&_views","title":"Update: Hugh Farey Takes Over as BTST Editor"},{"id":"comment-49413","author":"charles_freeman","post":"Thanks, Colin. Yes, i did double check with the original before making a fool of myself! It has clearly not prevented people signing up – but it does throw into question this whole enterprise and clearly there should be caution all round..","date":"2013-11-01","mins":"5:29 am","url":"https://shroudstory.com/2013/10/31/press-release-marino-endorses-antonacci-petition-and-proposal/","cat":"news_&_views","title":"Press Release:  Marino Endorses Antonacci Petition and Proposal"},{"id":"comment-49401","author":"charles_freeman","post":"What, in the petition, does ‘minimally scientific’ mean? The only meaning I can suggest is that science should be pushed as far to one side as possible. Is this what Mark Antonacci is suggesting? I would caution Joe Marino to keep clear of this one if he does not want his conference to become a bit of a farce..","date":"2013-11-01","mins":"3:59 am","url":"https://shroudstory.com/2013/10/31/press-release-marino-endorses-antonacci-petition-and-proposal/","cat":"news_&_views","title":"Press Release:  Marino Endorses Antonacci Petition and Proposal"},{"id":"comment-144311","author":"charles_freeman","post":"Yes, having accessed the acrimonious debate from April of this last year, there was never a claim that the thread was as early as AD 30, so I leave it to others to debate where Habermas got his date from. Surely it must have been an AMS lab to have got a r Esult from the end of a single thread and there seems to be no evidence of one here. Shows how easily stories grow in the telling!.","date":"2014-08-17","mins":"2:32 am","url":"https://shroudstory.com/2014/08/16/another-gary-habermas-shroud-of-turin-video/","cat":"news_&_views","title":"Another Gary Habermas, Shroud of Turin Video."},{"id":"comment-163964","author":"charles_freeman","post":"For obvious reasons, the Shroud was always held longways as it was the only way to display the full extent of the images. Certainly it was folded, probably in different ways at different times, but I can’t see the need for a lifting mechanism when there were so many clergy who were obviously honoured to do the job themselves.What would be the point of having a lifting mechanism that could only show one of the two images?.","date":"2014-10-20","mins":"4:50 am","url":"https://shroudstory.com/2014/10/20/in-the-belly-of-the-beast/","cat":"critical_summary","title":"In the Belly of the Beast"},{"id":"comment-164258","author":"charles_freeman","post":"The Shroud appears to be a unique survivor of many documented linens. This is the key point of my article. It gives new life to the stagnated and repetitive debates!.","date":"2014-10-21","mins":"2:14 am","url":"https://shroudstory.com/2014/10/20/in-the-belly-of-the-beast/","cat":"critical_summary","title":"In the Belly of the Beast"},{"id":"comment-164024","author":"charles_freeman","post":"Daveb. You need to envisage how and why the Shroud should have been displayed if it were top to bottom. Do you have the head of the frontal image at the top and the rest folded away behind it or do you just have one long hanging with the dorsal image upside down? At present every single image we have of the Shroud from the Lirey badge onwards shows it displayed longways and held by clergy so it reasonable to suggest that it was hung like this. As inventories show that cloths with images of Christ on them were quite common, there is absolutely no evidence to link the single image that de Clari saw with the double image of the Shroud. That is a misconception of those who do not realise how few of many thousands of original painted linens survive. Wilson goes even further with the misconceptions when he thinks that the cloth with an image of a man ( why didn’t they say it was Christ if it was?)on it venerated by the Knights Templar was also the Shroud. Not a shred of evidence to link the two and then we have the problem of Barbara Frale .. .but I digress…..","date":"2014-10-20","mins":"8:53 am","url":"https://shroudstory.com/2014/10/20/in-the-belly-of-the-beast/","cat":"critical_summary","title":"In the Belly of the Beast"},{"id":"comment-199771","author":"charles_freeman","post":"John , if you accept that you are as likely to be right as I am and I am as likely to be right as you are, then there is no need for exasperation and we can all get on with our studies of the Shroud. There was once a burial shroud (no reason to think otherwise from what the gospel sources tell us) is the Turin Shroud it, or is another surviving cloth it or has it vanished at some point in history as vulnerable textiles tend to do? At some point there is going to be a new breakthrough in research it simply has to happen perhaps, as with the case of the Horses of St.Mark’s in Venice, through research on different medieval/more ancient artefacts altogether which will illuminate the ‘mystery’ of the Shroud..","date":"2015-05-21","mins":"10:11 am","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin"},{"id":"comment-199797","author":"charles_freeman","post":"Don’t be too pessimistic about solving the mystery of the Shroud, Dave B and Sampath. Science is moving forward all the time and it is only recently that there has been serious sturdy of painted linens because so few have survived with their images intact. I see no reason why there should not be breakthrough of some kind which will give, for instance, an irrefutable date for the weave and then we can work from there. I feel that you have come to the conclusion that research on the Shroud has come to a dead end and will never move forward. I will be surprised and disappointed if it does not when progress is being made in so many other areas of science..","date":"2015-05-21","mins":"5:11 pm","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin"},{"id":"comment-199831","author":"charles_freeman","post":"Disproving my hypothesis that the Shroud was originally a painted linen with iconography of the fourteenth century whose pigments have disintegrated would be a step forward. It has not yet been done so I am keeping the hypothesis alive. As my article In the The Church Times makes clear , I don’t believe that the Shroud was originally created to deceive anyone and is worthy of its tradition of continued veneration. So no disagreement with the theme of continued meditation although there are many other works of art also deserving of such meditation. Who knows – the pope may order new scientific investigations this coming month. No, Sampath , I don’t know anything about that imaging ( and no one else seems to either in the present state of knowledge) but presumably it is testable with the most sophisticated technology of the day to give us an up to date assessment as to whether the images are any more than linen discoloured after long centuries of being covered by pigments. I hope that this testing happens. It does not seem likely that the matter has been scientifically settled for all time with scientific techniques developing as fast as they do. It seems likely that either by further direct testing of the Shroud or through evidence accumulated from other medieval linens, there will at some point a significant move forward in understanding the Shroud..","date":"2015-05-22","mins":"1:19 am","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin"},{"id":"comment-199838","author":"charles_freeman","post":"Fine, Sampath it’s a miracle then – all settled – but just as so many miraculous cures were later given scientific explanations I am waiting to see what the scientists come up with. There is no reason why you should read anything I write you are not my target audience when I write for History Today or the Church Times but I am not arguing that anyone painted a photographic negative. Instead I am putting forward a hypothesis that the linen was discoloured as a result of being overlaid by gesso ( that calcium carbonate thanks,STURP ) and pigments for centuries with the varying thicknesses of the original pigments giving the so called negative photographic effect. I am quite happy to see whether what is only a hypothesis can be proved or disproved by further research. No rush but it would be good to see this further research happen in my lifetime. I clearly have a less stressful approach to this than John Klotz..","date":"2015-05-22","mins":"2:14 am","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin"},{"id":"comment-199876","author":"charles_freeman","post":"Well if anyone met me and only remembered the palms of my hands or the end of the my fingers I would be pretty disappointed!.","date":"2015-05-22","mins":"10:08 am","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin"},{"id":"comment-49549","author":"charles_freeman","post":".But someone has to organize the scientific methods that are non intrusive and sell them.’ That is why a laboratory specialising in conservation of textiles is the best place to go to because they are expert in non invasive techniques that is their job. I remember reading that the lab set up in Florence after the floods was now in danger of closing and all its expertise being scattered but perhaps it is still going and it would have enormous credibility when it produced results..","date":"2013-11-02","mins":"6:16 am","url":"https://shroudstory.com/2013/11/01/stephen-jones-on-antonaccis-latest-the-vatican-would-probably-want-to-see-a-broad-consensus/","cat":"uncategorized","title":"Stephen Jones on Antonacci’s Latest:  the Vatican would probably want to see a broad consensus"},{"id":"comment-199885","author":"charles_freeman","post":"PHLP. Samuel Pepys, of course. The artist of the Shroud was no Giotto he was simply following the iconographical conventions of his day..","date":"2015-05-22","mins":"1:18 pm","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin"},{"id":"comment-49916","author":"charles_freeman","post":"John, I did law at Cambridge so know the law of libel. But surely the people to sue are the ones who call others insincere, deceitful,etc. I am only taking words from personal attacks that crop up on this site, many of them made on sceptics who have as much right as anyone else to be considered Shroud researchers. (Or should they be excluded by virtue of the fact that their own professions train them to take a critical view of what is often inadequate or ambiguous evidence?) You can read through any of my comments and find that I never make personal attacks on people. I start with the assumption that everyone, sceptics and others, are bone fide researchers but it is the evidence that should be the centre of attention, not the characters of the contributors. That’s the point I wanted to make. BTW what did you mean by ‘I think it’s time to wheel the horse outside the city gates’? I assume it has something to do with your earlier cryptic ( bring in Max Hamon here), comments about a Trojan horse. Sounds a bit libellous to me whoever it is aimed at..","date":"2013-11-04","mins":"1:21 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-50146","author":"charles_freeman","post":"Kelly. As I said earlier, I am only repeating what commentators on the site have said about other Shroud researchers (of all persuasions and among them perfectly honest ‘sceptics’). Need I trawl back among the posts? When you put them together very few people, especially the sceptics, seem to be of upright character if their opponents are to be believed! That is the impression that one often gets but as I don’t know any of the characters involved in these attacks I am in no position to know whether they are justified or not. I just know that they divert attention from the evidence. I was standing back from that, and deploring it because personality and the ability to produce valid evidence are not the same thing. I have no idea whether you have been one of the people who have suffered personal abuse or not. I have certainly been by name and actually got an apology for a libellous comment! Mc Crone, for one, is not around to do the same. It is not beyond the bounds of possibility that a new microscopic analysis of the Shroud will side with him rather than with his opponents and in that case his character will be irrelevant.We have to wait and see..","date":"2013-11-06","mins":"4:46 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-50147","author":"charles_freeman","post":"‘It would add a far better and constructive purpose to their lives if they actually took up knitting, so that their otherwise wasted efforts might take on some useful semblance of productivity by which the rest of humanity might benefit even if only to some minor degree. Great idea about the knitting , Daveb, but some of us have busy jobs writing books on history, including relic cults, that others actually buy and learn from!.","date":"2013-11-06","mins":"4:51 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-50173","author":"charles_freeman","post":"‘I believe there was a decision/mandate set forth on this blog that insinuations about intellectual dishonesty without proof would not be tolerated. Referring to anyone specifically or generically as being “evil, insincere, deceitful” and a “crooked lot” in my opinion, certainly falls within this category. These are very strong, very specific words. I don’t believe they should be used lightly. In my opinion, they shouldn’t even be used at all, even in the context of “deploring”. I totally agree that was the point of my post.They have been used all too often but not by me. As I am not a scientist or blood specialist and had on one of my tours a professor who was a leading authority on physiology, I was talking to him about this. I sent him every article I could find that suggested that there might be blood on the Shroud. He replied that he had read them carefully (he is now retired) and could see nothing that suggested that there was blood. As I said earlier, on that basis I am happy to leave the question open..","date":"2013-11-06","mins":"8:09 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-50159","author":"charles_freeman","post":"P.S. I have also provided information on an early cloth with an image of Christ in Memphis in Egypt. That is important because one of the massive problems about the Shroud is how it was preserved from the damp over centuries. Yet, if it were stored in Egypt then it stood a chance. I AM a sceptic overall but that doesn’t stop me spotting possibilities for further research on the Shroud when I see them! That is what i enjoy about being a historian even if the Shroud is far down my list of interesting relics so far as the medieval period is concerned. I do think that the Jerusalem direct to northern France route that is known to have featured relics from quite early is the place to START for anyone genuinely interested in seeing if there is any convincing evidence for the Shroud before 1350..","date":"2013-11-06","mins":"6:54 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-50175","author":"charles_freeman","post":"P.S. I have no idea where my review of de Wesselow went to. I haven’t been back there for months. The question of whether the Shroud was a work of art, in the sense of the images having been created artificially and not by a decomposing human body, is another of several that I am leaving open. Like many others I have some ideas of it as a work of art but I wouldn’t take these further until I went through them with a specialist in medieval painted linens..","date":"2013-11-06","mins":"8:19 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-50186","author":"charles_freeman","post":"‘If you have a peer reviewed source supporting Mc Crone’s determination that the Shroud was a painting, I would like to know about it.’ John, you are completely missing the point. I am only talking about the hypothetical case of the Shroud being subjected to new comprehensive tests and then seeing whether there is any material evidence to back Mc Crone or not. This follows from earlier posts that suggest that Mc Crone’s results were not to be trusted because he was personally ….well, you name it. I do not take the various STURP tests of 1978 as definitive for all time.The team did not even include any expert on ancient linens and was largely self appointed. Some would query the tests as not even definitive in their own time. Now we have thirty five years of enormous developments in all the tests that need to be made on the Shroud and, if it like many other artefacts from the ancient world that new tests have been applied to, the results might well show something that no one researching the Shroud has yet conceived of. Until recently there were books on the horses of St. Marks that showed with all kinds of ‘evidence’ that they were fourth century BC. Then when work was done on the gilding method (in the British Museum labs, dare I say!), it was found that it would have been impossible to have made them before the second century AD. This is the way research works. Are you really saying that the 1978 tests, such as they were, are really invulnerable to being challenged by more advanced methods?.","date":"2013-11-06","mins":"9:48 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-50174","author":"charles_freeman","post":"John. Come on! I only said that Mc Crone might be proved right and so he might or might not when more sophisticated tests are done on the Shroud! I have no means of judging whether he was right or wrong myself but to say that it is impossible that he was right when he was a leading authority in his field seems to me to be rather sweeping..","date":"2013-11-06","mins":"8:11 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-50208","author":"charles_freeman","post":"Michael Gordin in his The Pseudoscience Wars focuses on Immanuel Velikovsky and his Worlds in Collision , a mishmash of ideas about Venus hitting the earth and changing the course of history. The Velikovsky camp had their own supportive magazines but you had to be ‘peer reviewed’ before you could get an article accepted. So to rephrase an old saying: ‘Who peer reviews the peer reviewers?’ Are the papers to be read at next year’s conferences ‘peer reviewed’?.","date":"2013-11-06","mins":"2:46 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49683","author":"charles_freeman","post":"Historians HAVE to be sceptics as part of their professional life as most of the evidence we use is not as it might seem at first glance. I resent the way the word is used here as if anyone who does not believe in the authenticity of the Shroud and keeps an open mind to the evidence as it unfolds – and will certainly unfold in dramatic new ways, probably totally unexpected ones, if modern technology developed since 1988 is applied to the Shroud, is branded as in some way ‘evil’ or ‘idiotic’. I look forward with an open mind to new tests and so far in what I have read on the Shroud I have still not found a single test that convinces me that the the cloth was made between 1 and 35 AD. Clearly I am not nearly as emotionally involved as the many others on this site with the Shroud and if a new test does come up with a first century date and confirms that it is human blood ( we really do need new tests on that and they are not difficult to come by), then I shall simply rewrite the first chapter of my book on medieval relics to fit with the evidence. Until then I shall continue as a sceptic and happily live with that!.","date":"2013-11-03","mins":"5:55 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49704","author":"charles_freeman","post":"Quite so, John, but for most Christians, the authenticity of the Shroud is simply not an issue as relics are not an appropriate way of worshipping God. That is why Britain is bereft of all its relics that were simply rounded up and burned in the sixteenth century. It is of immense historical interest if the Shroud is authentic but for most Christians it does not change their faith in any way if it is. There are apparently lots of large stones around the ancient cemeteries of Jerusalem that were used to close off tombs. The one that closed off Jesus’s tomb is likely to be still there if only it could be picked out from the rest. So what implications follow? Not many than i can see, other than this would again be of immense historical interest and so qualify for a place in my history of medieval relics. If more sophisticated tests do confirm that there is first century blood on the Shroud then there are immensely interesting theological questions that arise if that blood is analysed – where does ‘the Son of God’ fit genetically?.","date":"2013-11-03","mins":"7:32 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49726","author":"charles_freeman","post":"Yes, John, but you have to bear in mind that many blood experts do not support Heller and Adler. I ran one of their reports past a Professor of Physiology who told me that what was there was consistent with animal organic material and no more. So at the very least the question is open ( and I am happy to leave it open). I just think that when we have so much more advanced technology we should try again.What’s to lose if we have a more advanced test confirming Adler and Heller?.","date":"2013-11-03","mins":"9:40 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49772","author":"charles_freeman","post":"The tests normally quoted are those carried out by Professor Frache and his colleagues at the forensic laboratory at Modena in 1973. Several tests that should have shown up blood failed to do so and this was after all a speciality of a forensic laboratory which is more than anything that Heller and Adler could provide. I am happy to stick to my view that the question of whether there is blood is certainly disputed. As I understand it, the absence of potassium is certainly an indicator that this may not be blood. But I am not an expert, the only expert personally known to me read a range of work including a long article by you Kelly and concluded that there was no clear evidence of human blood. So let’s leave it open..","date":"2013-11-03","mins":"12:57 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49763","author":"charles_freeman","post":"No, John, my degrees are from Cambridge, the University of London and the University of East Anglia. I can’t see why anyone should get upset when I suggest more sophisticated testing. The number of whole blood tests that failed to find blood are enough to show that more testing is needed. It may never happen but until it is it is certainly right to say that the matter is disputed. We must also remember that ‘consistent with’ is not proof. We have to be aware of what in human blood is also in animal collagen and what in human blood has not be found on the Shroud such as potassium. Of course, if your minds are absolutely made up, this is all irrelevant. I don’t usually get criticised for being cautious about evidence in the rest of the academic world it is usually treated as a virtue..","date":"2013-11-03","mins":"12:11 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49789","author":"charles_freeman","post":"Kelly. Was Jackson an expert on blood or the tests actually undertaken in the forensic lab? Hearsay evidence doesn’t count for very much. Would you be happy to support my view that we should aim for a blood test to settle the matter one way or the other? My father in law had many years of practice as a doctor and he tells me that what you can say about blood now from tests compared to thirty years ago is amazing. Everyone I have asked ridicules the idea that the blood on the Shroud is redder than it should be because the victim suffered torture. If that was the case, I am told, every murder case in the courts would bring this up as evidence of the circumstances in which a victim died. My physiology friend also saw the colour of the ‘blood ‘on the Shroud as one of the main reasons he thought that it wasn’t blood. I just repeat what I have said all along. There is disputed evidence in a field where tests are vastly more sophisticated that they were thirty five years ago and I would like to see new tests that would certainly settle the matter one way or the other because this is scientifically possible. Until then I am a sceptic and it seems to me the only possible way to be (although my physiology expert was much more certain that the evidence for blood was lacking). Historians seldom have this certainty as we are making assessments of evidence that is often inadequate but please pass on any historical evidence you have!.","date":"2013-11-03","mins":"3:23 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49851","author":"charles_freeman","post":"‘In the extreme range’. Sadly there are others who have died in these circumstances and it would be a crucial bit of evidence to establish the nature of the death. But it is simply not relevant as there is no evidence that the colour of dried blood varies significantly according to the degree of torment suffered by the victim. If there was it would have been used in the courts by now. So Adler’s hypothesis has failed because it seems impossible to replicate and it has not done his reputation as a blood ‘expert’ any good. This is the world we are stuck in until there have been new tests to establish whether there is human blood, primate blood or just collagen. I am only seeking to apply the same criteria to the Shroud that one would apply to any other ancient material object whose origins are unknown. If, until this has been done, I remain sceptical, then I am happy to be counted as a sceptic..","date":"2013-11-04","mins":"3:58 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49842","author":"charles_freeman","post":"The question I want settled is whether Frache and his colleagues in the forensic lab at Modena or Adler and Heller who seem to work in rather makeshift conditions are right. We need confirmation as to whether this is blood, human blood or merely collagen – animal glue from bones and skin used either as a binder for paint or as a preservative on cloth. Every ten years I update my Egypt, Greece and Rome – working on the proofs this week for the third edition out next spring. Each ten years things that were considered mysteries are now solved by new research. So I work on the principle,with the Shroud, as with other material objects, if we don’t know now, we soon may. I am amazed at the way these long ago tests with relatively unsophisticated technology are still argued over as if the Shroud had been dated to the first century AD by any of them! The problem with the Shroud is lack of access so that we are deprived of up to date evidence from which to work from. I often think, however, that it might have been better not to have had any tests on the Shroud and kept it as a mystery!.","date":"2013-11-04","mins":"3:47 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49854","author":"charles_freeman","post":"No doubt one day someone will write a book about the evil, insincere, deceitful,etc, people who, for some reason, seem particularly drawn to researching the Shroud. I don’t know any of them so I have only the comments provided here to go on but, my goodness, they seem a crooked lot! Perhaps best to keep one’s head down and concentrate on the evidence, or rather lack of it..","date":"2013-11-04","mins":"4:41 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-121934","author":"charles_freeman","post":"David – do you mean a Shroud agnostic or a Shroud gnostic?.","date":"2014-05-20","mins":"7:14 am","url":"https://shroudstory.com/2014/05/19/dear-stephen-jones/","cat":"uncategorized","title":"Dear Stephen Jones"},{"id":"comment-86525","author":"charles_freeman","post":"‘STURP physicist Dr. John Jackson and chemist Dr. Keith Propp write that if the temperature incurred by the Shroud [in the fire of 1532] was just 200o C that it would lose 95% of its vanillin in a mere 6.4 seconds.’ That comes from Mark Antonacci’s paper on Roger’s vanillin thesis ( et alia) on Shroud.com, January 21st, 2006. I have no idea whether this is true or not but if it is it completely destroys any chance of using vanillin, or the lack of it, as a means of dating the Shroud..","date":"2014-03-09","mins":"8:17 am","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"id":"comment-46015","author":"charles_freeman","post":"Yes, it would certainly be appropriate to know under what auspices people hold ‘private’ collections of material taken from the Shroud, not simply material originally removed on STURP’s 32 tapes and passed on to others but also those distributed by Gonella and Riggi that are referred to in various articles. Is the original collection of 32 tapes still intact? This is an important issue as they represent different parts of the image and non image areas of the cloth and so may be the best single record of the surface until further samples become available. An updated version of the Physics and Chemistry article on the Shroud, now over thirty years old, would be of benefit to all if the tapes are still available..","date":"2013-10-02","mins":"11:26 am","url":"https://shroudstory.com/2013/10/02/a-sturp-sequel/","cat":"news_&_views","title":"A STURP Sequel?"},{"id":"comment-142834","author":"charles_freeman","post":"So what percentage of the total of the radiocarbon samples did Rogers believe to be cotton and is there any independent support for whatever figure he came up with?.","date":"2014-08-07","mins":"2:24 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"},{"id":"comment-142935","author":"charles_freeman","post":"The problem is that no one has yet found that cotton THREAD was interwoven with linen in the specific samples used by the radiocarbon labs. I have not seen as yet a piece of weave from the Shroud with the cotton threads shown interwoven with the linen. What Raes found was cotton fibres that he though had drifted in from a previous weave..","date":"2014-08-08","mins":"3:52 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"},{"id":"comment-143014","author":"charles_freeman","post":"As Hugh has suggested there are various possible ways of explaining the presence of cotton. However I am surprised that no one examining the actual weave has noted these mixed threads in the proportion they would need to be to sway the date. ‘Abnormal high cotton content.’ Just how high ? The problem remains of how this mix was actually made up. You suggest a cotton and linen mix which was then dyed – it would be worth experimenting to see if this worked. Not difficult as both cotton and linen are easy to come by! Mazzaoui says that cotton and linen were never spun together in a single thread but both were woven as alternate threads in a weave. Still lots to sort out here..","date":"2014-08-08","mins":"4:24 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"},{"id":"comment-142837","author":"charles_freeman","post":"No one is saying that but was reweaving done in both linen AND cotton?.","date":"2014-08-07","mins":"2:49 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"},{"id":"comment-143067","author":"charles_freeman","post":"Hypothesis : flax( linen) and cotton fibres were spun together to make threads that were then dyed and made up the whole or part of a reweave of the Shroud in the sixteenth or nineteenth century. The reweave made up part of or the whole of the samples used by the laboratories in the radio carbon tests. At this clarifies one explanation for the presence of cotton. What evidence is there is favour or against this hypothesis?.","date":"2014-08-09","mins":"3:36 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"},{"id":"comment-143197","author":"charles_freeman","post":"P.S. There is no reason to believe that hanks of yarn with cotton fibre were woven at a different time period from those without much or any fibres. Surely it would depend on what cotton was lying about, being disturbed , being spun alongside the linen ,etc. This would surely vary within a single room within a single day, let alone between different work spaces and account for fibres being found on some of the hanks and not on others. After all we are dealing with tiny amounts of cotton fibres. It is pure imagination to claim that there is a valid distinction between old and new threads on the basis of whether they have cotton fibres within them or not!.","date":"2014-08-10","mins":"3:29 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"},{"id":"comment-143195","author":"charles_freeman","post":"I agree with Mike M. This suggests that spinning took place in a room where cotton fibres were floating around and got integrated.(as Raes suggested). Of course as there were different hanks of yarn in a cloth as big as the Shroud ( shown in the bandings) , some hanks may have more cotton fibres than others, depending on the atmosphere in which the spinning took place. Still nothing like enough cotton fibres to significantly affect the date. I believe Mazzaoui when she says that cotton and flax were never spun together but the separate threads of each were used in various combinations..","date":"2014-08-10","mins":"3:17 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"},{"id":"comment-142860","author":"charles_freeman","post":"Thibault. Please give me your estimate of the proportion of the total sample submitted to the labs that was cotton. Your own estimates suggest it was very small and not enough to sway the date significantly. But if there was also linen in the reweave, then why did there need to be cotton as well? I have never bought the Rogers thesis because it does not make sense to me but perhaps you can enlighten me. So that is my problem and any clear answers would be much appreciated!.","date":"2014-08-07","mins":"5:41 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"},{"id":"comment-142920","author":"charles_freeman","post":"Barrie, thanks. You are certainly right that they did interweave the two – Mazzaoui has a section on this so you just need to confirm that this is true of the Shroud in the samples dated..","date":"2014-08-08","mins":"1:15 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"},{"id":"comment-142855","author":"charles_freeman","post":"I am just looking for clarification of what the argument is. Why deliberately use cotton as only part of a reweave ?.","date":"2014-08-07","mins":"4:58 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"},{"id":"comment-10403","author":"charles_freeman","post":"Sadly, it is very much as the reviewer says. As I have said elsewhere, it is tragic in fact that he did not talk to other academics in the field before embarking on this lonely enterprise. He presents himself as a Sherlock Holmes among art historians yet even his chapters on the authenticity and possible history of the Shroud show no sign of any independent critical thought. He simply takes authors such as Ian Wilson without question even though there are massive problems in say, seeing the ‘open eyes’ Mandylion as the ‘closed eyes’ Shroud (he assumes they are the same). He describes the Carbon 14 dating as ‘one of the greatest fiascos in the history of science’ ,yet fails to provide any sustainable reason for any ‘fiasco’ between the time of the cutting off of the sample and the announcement of the medieval date the idea that a cardinal would gang up with the representative of the British Museum to swap samples (p.171)after the selection had been made is simply ludicrous. I actually ended up feeling quite concerned for him. As a freelance researcher myself I know how easy it is to get a mad idea that fails as soon as it is tested against academic opinion. I now feel that he has blown any chance of an academic career after what appears, in his biography ,to have been a great start...","date":"2012-04-15","mins":"11:25 am","url":"https://shroudstory.com/2012/04/15/are-there-any-good-reviews-of-de-wesselows-book/","cat":"books","title":"Are there any good reviews of de Wesselow’s book?"},{"id":"comment-10498","author":"charles_freeman","post":"The articles by Steven Schafersman on both Frei and Rogers are a good starting point you can find them online. The problem with both Frei and Rogers is that there was no scientific checking of where they got their samples from (only hearsay) and there is evidence that Frei added in his pollen to one of his notorious pieces of sellotape. No one ever got so much pollen off the shroud as he did and it was not uniformly spread most of it from one piece of sellotape that appears, on later inspection, to have been tampered with! ( Moreover much of his pollen came largely from insect born pollen which could not have drifted onto the shroud – the assumption is that he added it in without realising that this would give him away!) Also both of them appear to have worked alone unsupervised so there is no way of having an independent check on their work. (This is crucial in the Frei case because we know he was reprimanded by the Swiss police for his misuse of evidence in his police work.) This is not science that meets any sort of protocol and I am surprised that you haven’t spotted that when it seems such a concern of yours. As Schafersman says, it is extraordinary that Rogers’ paper got through the net. Please read these articles carefully it seems quite clear that you were not aware of them. You still have not given me a clear reason why i should reject the 1988 testings just vague assertions about lack of protocol et,c which, as I have said, makes it all the more surprising you do not apply the same standards to Frei and Rogers. ( i do not wish to cast any aspersions on the good name of Rogers but he can hardly be taken seriously if he gets a couple of fibres via a Vatican rep, who was never authorised to take any samples from the shroud and must have done so secretly perhaps you trust the Vatican more than you do the Oxford lab.) I think further discussion is fruitless. I assume we both agree that another Carbon 14 testing would be worthwhile I doubt whether it will revise the position by 1300 years..","date":"2012-04-17","mins":"12:23 pm","url":"https://shroudstory.com/2012/04/15/are-there-any-good-reviews-of-de-wesselows-book/","cat":"books","title":"Are there any good reviews of de Wesselow’s book?"},{"id":"comment-10458","author":"charles_freeman","post":"Ron. Thanks for your response.1) The Edessa face, as copied after 944, is nothing like the Shroud face – it has no markings of any suffering. This is because 2) The legends, and they are,of course ,legends relating to the Edessa image all say that it is an image taken from the living face of Christ. You have the problem of what is asserted to be a burial shroud to have become described as something completely different and linked in to a different set of legends. 3) Preservation of cloth. Ancient cloth can be preserved in the arid climate of Egypt,as known from many examples. Around Jerusalem it is destroyed by damp except in very rare circumstances. In Edessa, the modern Sanliurfa in south eastern Turkey, the winters are very damp it rains on average every other day in January. You would have a very real problem in preserving cloth from say 100 AD to 944. 4) We have no idea what the Turin Shroud, if it existed at all then, would have looked like in the tenth century, if the image was stronger , the closed eyes could not have been missed. The major problem with de Wesselow’s argument is his confusion over the many different shrouds, relics in Constantinople in 1204. It is estimated that there were 3,600 relics in Constantinople and the Pharos chapel, well protected within the imperial palace, had the imperial collection of relics, many of which were connected to the life , Passion, Crucifixion,etc. Of jesus. So you start with his swaddling clothes, you have part of the Cross, the Crown of Thorns, a phial of his blood, the tunic in which he walked to Calvary, the Holy Lance, a robe of the Virgin and many, many more. There are also some burial sheets which are said to have smelled of myrrh and have been of cheap cloth as there is no sign of any ointment ,etc on the Turin shroud and it is of a very fine weave , this can’t be it. Anyway we have a record of these relics from the Pharos chapel going to the Sainte Chapelle of Louis IX in Paris ( he had bought the Crown of Thorns from the Pharos Chapel and it was housed here together with other relics from the Pharos chapel). A burial shroud of Jesus is listed in the Sainte Chapelle inventory and a container with it inside is shown in an engraving of 1790. So we can be pretty sure that the Pharos sheets are these. In a listing of the Pharos relics, the Mandylion is listed as a SEPARATE item, but it disappears after that and we only know of it from the copies that show the open eyes and with no sign of the sufferings on the Turin Shroud. Then among the 3,6000 city relics, there is another shroud. This was at the Blachernae Chapel right at the other end of the city. This was a chapel dedicated to the Virgin Mary that was endowed with relics in the fifth century. It was a vulnerable position , just outside the city walls and by the shore. It is described as having a burial shroud of Christ that was full size and which was exhibited every Friday. This also disappeared in the disastrous sacking of Constantinople by the Crusaders in 1204 and some have argued that this is the only conceivable candidate for the Shroud of Turin. OK so Far? Well, de Wesselow argues that the Pharos sheets and the Mandylion are one and the same, despite them being listed separately. He then argues that the Pharos sheets were taken from the Chapel to the Blachernae Chapel. There is no documentary evidence of this. It would be unlikely for the imperial family to have surrendered one of its relics to such a vulnerable place as the Blachernae and anyway the Pharos sheets can hardly be the same as the single shroud of Blachernae. The simplest explanation is that we have two relics that disappeared, the Mandylion and the Blachernae Shroud, and one which survived and went to Paris ( the Pharos sheets). De Wesselow’s argument that they are all one and the same simply does not work. Carbon 14 Dating. Let us assume (unless you want to claim otherwise) that when the samples arrived at the three laboratories they were correctly tested. You will no doubt have read the Nature report on the 1988 testings. You will see that a sample of the Shroud was cut away after it was confirmed in front of the British Museum rep and the reps from the laboratories that it was of the same weave as the rest of the cloth. This was an open process. The samples were then carefully sealed. You are claiming that the British Museum rep. Dr. Tite and the cardinal then collaborated in swapping the Shroud sample with a piece of cloth from the fourteenth century. I am afraid such a collaboration is ludicrous and unless the match was very close , the reps from the laboratory would surely have spotted something when they unpacked the sample.Still de Wesselow seems to entertain this. So you have two alternatives. 1) The sample was so contaminated that,although first century, the mix of contamination was such that it came out as fourteenth century. Yet contamination is a common problem and the laboratories each cleaned their samples. They each used their own methods but the dating still agreed with each other. As de Wesselow admits ‘ Some of these [contamination] theories are more plausible than others, but none has gained widespread acceptance, let alone been proven’.The Oxford lab did a test on one theory put forward by John Jackson that the contamination was by carbon monoxide and found that this had no effect on samples. So if even de Wesselow cannot give support to any contamination theory, why should any one else? 20 The added patch. No one spotted that the sample was any different from the rest of the weave. Flury Lemburg, who was meant to be the textile expert, said that an extra weave could not be added without it being spotted (which is why she refused to endorse the ‘added patch’ theory. Raymond Rogers was using samples that were not scientifically attested as genuine (you can spot this from his own report on this) so, when placed against the sample used by the labs, they can hardly stand up. (One of the great mysteries is how his essay ever got accepted as supposedly peer reviewed he did not, of course, provide any carbon 14 dates to support the age of the Shroud.) So this is why many people take the view that there is no sufficient reason to challenge the carbon 14 dating by the three labs in 1988. The Shroud has been so mauled around, pieces taken off by sellotape, the controversial cleaning of 2002, that it is unlikely that anyone else will be allowed a go at it but I suspect that any carbon 14 dating would come up with the same dates. It is hard to see how, even if there were problems in the testing, they could be so significant to end up with a date 1300 years earlier. No.I don’t know how the image was created. I am waiting for a scientific resolution which will obviously be the right one and everyone can calm down a bit!.","date":"2012-04-16","mins":"2:32 pm","url":"https://shroudstory.com/2012/04/15/are-there-any-good-reviews-of-de-wesselows-book/","cat":"books","title":"Are there any good reviews of de Wesselow’s book?"},{"id":"comment-10462","author":"charles_freeman","post":"Ron, I first came across radio 14 dating when I was working as an archaeological assistant at the British School in Rome in 1966. Everyone knew about the problems of contamination,etc back then! There is a very good recent survey in Colin Renfrew and Paul Bahn’s Archaeology, Theories, Methods and Practice, Thames and Hudson, 2012 edition, pages 136 147. The problems about Carbon 14 ,and de Wesselow is misleading here, concern things like soaking in water that gives an earlier date and problems with calibration on objects earlier than 1000 BC. So there are problems and certain objects will be rejected for Carbon 14 but when it works it works. None of these apply to the Turin Shroud. I have to disagree with your assumption that all three respected international radio cabon labs all collaborated in such a way that they produced a fourteenth century result. After all they are scientific institutions, depend on academic credibility for their survival and had no reason to fudge a date. I can’t believe that it would matter to them whether it was 14th century, 5 6th century ( the date when these images are first reported) or first century – or even 1000 BC! They were simply scientists getting on with their job and taking care ( as you can see in the Nature report) to make sure that any possibility of contamination was removed. I am not sure what you mean by ‘unscrupulous writings’. Whose? Where might I have come across them? I am an historian who has written a long book on medieval relics and who usually can spot a poor source a mile off!.","date":"2012-04-16","mins":"3:32 pm","url":"https://shroudstory.com/2012/04/15/are-there-any-good-reviews-of-de-wesselows-book/","cat":"books","title":"Are there any good reviews of de Wesselow’s book?"},{"id":"comment-10478","author":"charles_freeman","post":"Ron, I simply do not understand what your point is because you do not make a clear case for overthrowing the presumption that the 1988 dating is the best we have. The shroud.com site is dedicated to the idea that the Shroud is authentically first century ( so far as I can see) and one has to read a lot of articles from other sources to get a fuller picture (e.g the Max Frei pollen analysis is now seen to be fraudulent but I doubt whether this is covered in shroud.com please prove me wrong but I am still having it quoted at me as if it were accepted). The real problem is that articles against the 1988 dating are full of insinuations that are not in themselves enough to cause doubts about the 1988 dating. There are many hypotheses floating around about the samples none of which seems to have gained much support. So please present your case clearly. The Oxford people have made clear they are quite open to reassessing their results if they are given direct evidence to challenge them. As an example of their readiness to respond, they tested out, for instance, John Jackson’s theory of carbon monoxide contamination for the Shroud and showed that c.m. Did not affect the dating. But until clear evidence is provided against the 1988 dating one can hardly expect the labs to drop everything and retest. Those who want to argue against the 1988 testing must get their act together with a coherent consensus about what went wrong. Lots of individual researchers coming up with their own pet theories gets us nowhere. De Wesselow is not much help here because his critique of Carbon 14 dating is simply a muddle and he cannot himself provide any clear reason for challenging the 1988 testing. Yes, don’t bother to read the book. There are too many obvious gaps in his argument that the Shroud is authentic and it would not convince anyone coming to the subject for the first time..","date":"2012-04-17","mins":"3:17 am","url":"https://shroudstory.com/2012/04/15/are-there-any-good-reviews-of-de-wesselows-book/","cat":"books","title":"Are there any good reviews of de Wesselow’s book?"},{"id":"comment-201767","author":"charles_freeman","post":"Yes, I agree. They are the ones to challenge him. My limited asking around suggests that he does not have much support but he can prove me wrong. He should get his thesis published in an acknowledged art history journal. It is a pity that he did not show the Niccolo dell’Arca ‘s haunting Lamentation from the head but from the feet. I know it well having seen it twice in Bologna this year already and I am taking a study group to see it in September. Niccolo shows how the hair of Christ would fall away when he was lying down, if this was a real body, not in the straight way that it is shown on the Shroud. In fact if I was doing a book on the Shroud I would use it as one of my examples the whole Lamentation scene is an extraordinary piece of realistic art and Niccolo had thought through how a dead body would really look laid out. Do see it if you are in Bologna and have lunch at the excellent Sette Archi restaurant afterwards..","date":"2015-06-13","mins":"2:46 am","url":"https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/","cat":"video","title":"Thomas De Wesselow On Why the Image is Unlikely by an Artist"},{"id":"comment-201913","author":"charles_freeman","post":"Thibault I think you have to move on from just looking at copies of the Shroud, which may themselves have changed over the centuries, to actual depictions of the Shroud, to the descriptions and other depictions of the Shroud. I would put forward the 1583 fresco of the exposition of the Shroud in the Vatican where onlookers are sitting a long way off and can see the images clearly. Again there is the Tempesta engraving of 1613 and many many more. We need a database of them all. People have wondered why the patch on the buttocks is today lighter than expected. That is probably because the loincloth was painted on later and the evidence is strong that this was to comply with the decree of the council of Trent that nudity had to be covered up, and then faded off. The only way to prove all this is to build up a data base of all the depictions and work through them carefully. Obviously not going to happen on this site! De Wesselow obviously has not even begun a serious study of the Shroud or he would at least have made some comment on all these depictions. Meanwhile I shall rely on the wise advice I was given some time ago if the only response to something you say is abuse, don’t worry, it is because they cannot provide a reasoned reply..","date":"2015-06-14","mins":"2:28 am","url":"https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/","cat":"video","title":"Thomas De Wesselow On Why the Image is Unlikely by an Artist"},{"id":"comment-201784","author":"charles_freeman","post":"Yes, Nabber , but they won’t be anonymous if they agree to have their names published in any academic articles i write. My custom is when I rely on an expert opinion that I wish to quote is to clear the exact words I attribute to any expert with them. I am not going to go to that bother for postings entered here. I am making it quite clear on this website what my views are but this is not where I would aim to get them accepted! I also make it quite clear that in many areas serious research on the Shroud has not yet begun and I look forward to hearing what specialists in specific fields have to say..","date":"2015-06-13","mins":"6:45 am","url":"https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/","cat":"video","title":"Thomas De Wesselow On Why the Image is Unlikely by an Artist"},{"id":"comment-201792","author":"charles_freeman","post":"It might help if I give an analogy. Suppose I am walking in the fields around my home and I spot in the grass an object that turns out to be a wallet. It was clearly dropped there many years ago.I get it home and open it in the hope of finding out who once owned it. It is, of course, very faded and disintegrated but I find some letters in it which might explain who once owned it. Unfortunately you can hardly see the lettering as the ink has disappeared over the years. It might be possible to reproduce the faded letters. Perhaps I could find some suitable paper, perhaps I could try and reproduce the faint lettering with one of Colin’s concoctions, or perhaps I could scorch it, or have some raised letters from a printer’s block and place the paper on top of them and rub them. Perhaps I might even apply short bursts of radiation with a laser beam.There may be all kinds of ways I can dream up of reproducing what we have now. Even if I succeed I only have a copy of what I have found and it gets me nowhere because what I want to know is what was the lettering originally. De Wesselow, Colin, di Lazzaro are trying to explain/reproduce the images on the Shroud as they are now and even if they succeed they won’t have proved anything they would simply have found a way of reproducing the images faster than decay and disintegration caused by the passage of time. I am totally amazed that after all his research de Wesselow does not seem to be aware of the earlier depictions of the Shroud which help provide clues as to how the Shroud looked originally. My work is trying to find the original images, just as with my wallet I would be trying to reconstruct the original lettering on the letters in the hope of unlocking the secret of the writer of the letters..","date":"2015-06-13","mins":"9:41 am","url":"https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/","cat":"video","title":"Thomas De Wesselow On Why the Image is Unlikely by an Artist"},{"id":"comment-201966","author":"charles_freeman","post":"Well, Hugh, I would include all the depictions but obviously the frescos and engravings, especially by experts such as Tempesta, rank above copies on cloth which may themselves have faded..","date":"2015-06-14","mins":"6:43 am","url":"https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/","cat":"video","title":"Thomas De Wesselow On Why the Image is Unlikely by an Artist"},{"id":"comment-202067","author":"charles_freeman","post":"Thibault. Relics were not treated as inviolable as they could be divided up, put into reliquaries,etc, etc, without losing their spiritual power. There would have been no problem in adding paint to an existing relic especially in the period of the Counter Reformation when they got really worked up about nudity. The more I learn about painted cloths the more I learn about how vulnerable they were I am not surprised that the painted loincloth disintegrated and ,although I would need specialist support from a linen conservationist, the lighter patch on the buttocks today would suggest that this was what was left after the paint came off. PLEASE NOTE: I said that specialist support is needed. This is just a hypothesis along with many contributors here I do not have the expertise to test out my hypotheses, only to put them forward as solutions consistent with the evidence as I see it. I am happy to put all your copies in the database alongside the frescoes, engravings, lithographs ,etc that we have of the depictions of the Shroud. We need to add too the actual descriptions of the Shroud in documents. Then we need to creat a Shroudscope website that anyone interested can access so we can spot the changes over time in the way the Shroud was depicted. I don’t agree with Hugh that there are two distinct traditions I think there is a spectrum from a very heavy image as in the Tempesta engraving of 1613 towards a lighter end which in some cases might be due to the fading of the copy itself. What do you think of the many illustrations that Beldon Scott reproduces?.","date":"2015-06-14","mins":"3:44 pm","url":"https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/","cat":"video","title":"Thomas De Wesselow On Why the Image is Unlikely by an Artist"},{"id":"comment-202367","author":"charles_freeman","post":"Thomas, Having seen the pig’s ear De Wesselow made of trying to explain the images, I know the competition is not strong. I believe the original linen surface was coated in gesso ( of which the large quantities of calcium carbonate found by STURP is a remnant). Then , if the normal procedures of medieval cloth painters or stainers was followed, the pigments would be on top. Inevitably the surface would often crack up and the cloth was then discarded although in cases where there was some value given to the painting it was repainted. Clearly the pigments varied in thickness and consistency but after some centuries in place the evidence suggests that for the Shroud they really only began to break off completely in the mid nineteenth century as the lithograph in Beldon Scott of the 1868 exposition suggests then the linen immediately underneath the gesso would have been discoloured. The discoloration would vary according to the thickness of the paint on top and possibly its colours. Hence you have the resulting ‘three dimensional’ aspect of the Shroud. The best way to settle this will be through finding other examples of former painted linens whose pigments have fallen off. The best example I know is the central panels of the Zittern Veil as the pigments have gone ( steamed off by Russian looters in WWII) and there are images similar to those on the Shroud on the linen underneath, but I would like to find more. Although I am told that my theories have been totally debunked, not sure quite where and by whom I can at least set them out clearly. I wish others could set out their own theories on the images with clarity..","date":"2015-06-16","mins":"11:55 am","url":"https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/","cat":"video","title":"Thomas De Wesselow On Why the Image is Unlikely by an Artist"},{"id":"comment-202395","author":"charles_freeman","post":"I said he MADE a pig’s ear of a particular point,the explanation of how the images got there. I am sure he is brilliantly qualified but perhaps has not as much experience as I have of wandering around medieval churches looking at ordinary images. He shows no sign of having studied the iconography of the Passion. I need to do a lot of looking for my study tours and also for illustrations of relic cults. That is why I shall be seeing the Niccolo dell’Arca Lamentation in Bologna three times in this year alone. His examples are from high class art as one would expect from a Courtauld trained art historian he does not see the relevance of more down to earth art such as the illustrations of the naked Christ with all over scourge marks and squiggles of blood like those on the Shroud to be found in the Holkham Bible of c.1330 which actually match the images on the Shroud. I can’t help it if I have had experiences that he has not had. He simply appears to have missed the evidence from the early depictions of the Shroud as if he had never seen them. One crucial divide in Shroud studies is between those who believe the Shroud now is as it was originally created and those who don’t. That is the main difference between de Wesselow and myself I think the early depictions are the vital clues. And the more I study the Lirey copy the more I see it as a set of images that have themselves faded. This is not to exclude it from my database of early Shroud descriptions but to realise that it is not representative of the spectrum of original depictions. The Shroud images only make sense as linen discoloured by being overlaid by gesso and paint for centuries. We know that they were ONCE painted , there is evidence that the paint disintegrated in the nineteenth century and not surprisingly there is some discolouration just on the surface of the Shroud underneath as the result of the overlay .I have never seen any alternative explanation that makes any kind of sense. And listening to de Wesselow, it is clear that he hasn’t any satisfactory explanation for something that may look mysterious but is not actually mysterious when you look at it systematically as a creation of time and decay..","date":"2015-06-16","mins":"4:48 pm","url":"https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/","cat":"video","title":"Thomas De Wesselow On Why the Image is Unlikely by an Artist"},{"id":"comment-191195","author":"charles_freeman","post":"The pity is that neither Rinaldi or the STURP team either put the Shroud before art experts. The STURP team actually said in their report that they did not examine any painted linens! If they had they would have found that these painted images were always painted on the outer fibrils of the cloth and something might just have clicked!.","date":"2015-02-16","mins":"9:46 am","url":"https://shroudstory.com/2015/02/16/walter-mccrone-art-experts-should-not-weigh-in/","cat":"uncategorized","title":"Walter McCrone:  Art Experts Should Not Weigh In"},{"id":"comment-201763","author":"charles_freeman","post":"De Wesselow starts from the premise that the images now are as they always have been, presumably in his view for two thousand years. This is the fatal error made by STURP but as they did not seem to have anyone on their team who had ever dealt with an ancient object let alone an ancient textile that is perhaps understandable. I am surprised that de Wesselow seems to have made this same error but perhaps painted textiles in not his area of specialism. I and others start from the opposite premise ,that what we have now is the Shroud after centuries of decay with images of a very different kind from the original creation. My interest lies in finding out what the Shroud images looked liked originally. I don’t think that there is any way de Wesselow can overlap with me – we are just approaching the same problem from such different perspectives. The question is whether he can find specialist support from his fellow art historians. Somehow, from my own conversations with art historians who specialise in painted linens and medieval weaves I doubt it, but I shall be interested if he can. Thanks for brightening my day with your comments,Nabber. Perhaps one day you will actually give the International Sceptics Forum the evidence for why you believe the Shroud is 2000 years old you go strangely silent when asked and just infuriate everybody ..","date":"2015-06-13","mins":"1:28 am","url":"https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/","cat":"video","title":"Thomas De Wesselow On Why the Image is Unlikely by an Artist"},{"id":"comment-199865","author":"charles_freeman","post":"John you know my take on the Pray Codex. Anyone who saw the Shroud would have seen a double image heavy with bloodstains. Anyone depicting it would have shown some wounds on Christ and some images on the cloth. Four holes on the coffin lid, probably representing the holes drilled in the marble top to the sepulchre in Jerusalem in the tenth century, are not enough to overrule this. Maybe fifty fifty was being generous to you but I appreciate that you have a book to sell..","date":"2015-05-22","mins":"8:51 am","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin"},{"id":"comment-50151","author":"charles_freeman","post":"Dave B , I think one of the reasons why Byzantine experts cannot contribute much about the Shroud is that none of them can find any evidence for its existence in the Byzantine world. No expert has any time for the Wilson/Edessa theory so that leaves the Byzantine experts with nothing much to do, except presumably take up knitting. However, as you may or may not have read on this site, my own research on medieval relic cults has produced references to relics from ‘the Lord’s Tomb’ that came over in the first millennium from Jerusalem and are still in collections in northern France very close to Lirey. Yesterday, I came across references to stones from the Sepulchre in Jerusalem that had been brought back to the cathedral at Langres, just 125 kilometres from Lirey. Then there is a wealth of material on relics brought back from the Holy Land by crusaders, again direct to France. Then there is bishop Gautier of Troyes who was in charge of the allocation of the relics from Constantinople in 1204 and brought back many to Troyes, just twenty kilometres from Lirey (he is shown in a window in Troyes with a cup from the marriage feast at Cana!). Perhaps one of his retinue brought back something as wel I. Then then is a native born man of Troyes, pope Urban IV who was Patriarch in Jerusalem before he became pope and lavished patronage on Troyes ( his basilica there still survives). Did he bring back any relics? In my own work on medieval relics, the Shroud does not feature because it was one of many thousands of cults competing against each other and certainly not the most interesting or important but I don’t think we historians can be accused of sitting by when, as here, I am providing those who do want to concentrate on the Shroud with lots of leads from my own researches. It’s hardly my problem if no one wants to follow these leads up..","date":"2013-11-06","mins":"5:14 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"}]
