[{"id":"comment-200249","author":"charles_freeman","post":"The Marzia Boi article is just the kind of article we need if Shroud studies are to move on. I can’t make head or tail of the history one!.","date":"2015-05-26","mins":"11:17 am","url":"https://shroudstory.com/2015/05/26/a-treasure-of-reading-material/","cat":"paper_chase","title":"A Treasure of Reading Material"},{"id":"comment-169467","author":"charles_freeman","post":"Possibly not if they follow the medieval instructions that the gesso and paint should be only in the outer fibrils of the cloth ( ring a bell anyone?). It must have been one of those skills that took years to perfect as Cennini says you have to be careful to create a layer that does not penetrate. Remember many painted linens were flags and banners and they wanted them to flutter just as a flag does nowadays. That is why they aimed for a very light covering with the excess scraped off with a knife ( lack of brush strokes ring a bell with anyone?).","date":"2014-11-07","mins":"1:00 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169468","author":"charles_freeman","post":"I think that anyone can create a three D image if they want to. I really don’t think your argument has any mileage. Perhaps you should write to the Editor of History Today complaining of the low level of articles he and his peer reviewers accept. You need to cut out personal abuse and concentrate on facts if you are to be taken seriously. I don’t think using the words ‘ absolutely worthless pseudo historical fantasies ” will help unless you raise your intellectual game!.","date":"2014-11-07","mins":"1:08 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169492","author":"charles_freeman","post":"Colin – not ‘start’ with the premise , ‘ conclude on the mass of interlocking evidence as laid out in my article’ would put it better. Perhaps I have missed the reply to my question asking for the scientific evidence that places the date of the Shroud within the narrow period AD 1 30..","date":"2014-11-07","mins":"3:22 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169602","author":"charles_freeman","post":"Colin, Amazingly some people will believe anything and the traumatised 1350s were full of relics that had no relation with the gospel accounts of the objects involved. No one who originally created the Shroud would have expected anyone to think it was the real burial cloth and would have been amazed and probably embarrassed when he heard that some pilgrims had been conned into believing it was. I can trace an acceptable journey for the Shroud from say1325 as seen by many as having bright colours of blood, painted on the outer fibrils as advised and woven on a medieval treadle loom. All this is supported by experts and when you have other faded linens then there is a plausible scenario to explain the present state if the Shroud. The ball us in your court to set out an alternative method of creating the images, which explains why these images were created as they were and why a totally unrecorded method of making images, one that could remain chemically unchanged for seven hundred years, was used, probably uniquely in this particular case. I simply cannot understand why anyone would have done this so look forward to your reply. Thousands of fourteenth century art works survive, many much decayed and faded, thousands of art historians have been working in them so your researches if successful will surely make your name. In contrast , people are simply saying to me ‘aren’t you stating the obvious?’ And I won’t get any prizes. So grasp your chance to become famous in the medieval art history world while you can!.","date":"2014-11-07","mins":"11:11 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169568","author":"charles_freeman","post":"Colin I don’t know how far your study of fourteenth century art has gone. In my article I give two examples of linens whose images have faded since they were painted in the fifteenth century. They survive because half the image is still intact. In most cases when the images are faded altogether they will have been thrown away. So we know beyond any doubt that linens painted in the medieval period can fade. When I read the many accounts that describe a painting vivid in blood, one that was even thought to be recent ,I have no problems in suggesting that the Shroud was one of these now faded linens. This is a hypothesis that I leave you and anyone else to challenge. It is the best fit explanation of the Shroud we have today the one that is closest to the documentary evidence. I think that some of the contributors here do not know much about medieval art. I would suggest an I.introduction such as the Oxford History Of Art which has excellent reproductions that show that those paintings that have not faded are amazingly Bright. This morning I was viewing a Giotto Madonna and Child – early fourteenth century no less. It comes from the Uffizi gallery in Florence but it was damaged in a terrorist attack in 1993 but has now been restored. It is travelling around Italy being shown off and it looks wonderful although they have left one hole in the canvas as a record of the attack on it. The colours are bright and the Virgin Mary sits on a bright red cushion. It this had been blood it would have been shocking but because it just a cushion we just admired the vivid redness of what is probably vermilion. What I find extraordinary, indeed incomprehensible, is why you think that the Shroud was not originally painted as richly as this. I have read a lot about medieval art as I have to lecture to groups on it in front of paintings and I have never heard of anyone creating a painting with scorches ,etc. Why would they want to when there were so many painters around who would create the real thing for observers to see. Some posters seem to think it was extraordinary that people came to see the Shroud at Lirey but in the years after the Black Death with half the population dead there was a frenzied rush towards new relic cults. It does not seem that the Lirey cult lasted very long before the bishop closed it down and, as we know, when expositions began again in 1390 it was made clear that this was not the authentic grave cloth but could still be venerated. Pope Francis is following in this same tradition. If Francis’s face had left an imprint on the cloth, what would it have looked like. Certainly not like the face of the man on the Shroud!!.","date":"2014-11-07","mins":"8:07 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169772","author":"charles_freeman","post":"I believe that the descriptions of the Shroud by observers and the depictions that show features such as the Crown of Thorns on the head, now faded leaving the top of the head rather fuzzy looking, are convincing evidence, enough for me to work from there and begin researching other aspects of the Shroud’s history to see if any contradict this approach. None found so far. Anyone who has been lucky to see some of the great medieval art of the fourteenth century will not have any problem in recognising the bright colours of paintings of that period( well certainly the ones that have been lucky enough to have been preserved over seven hundred years without fading!) This morning back home after several days of total self indulgence ( without a tour group to lecture to) in Lucca and Pistoia looking at medieval paintings in their original settings, I began to think how would one ,as a historian, START exploring they over – hyped ( by STURP and the National Geographic as well as others) ‘ mystery ‘ of the Shroud. First things first. How is it woven? It must have been woven first before we even get onto to the images – unless the images existed as a sort of holograph onto which a cloth drifted and held them down! There is absolutely no problem in making the Shroud on a medieval treadle loom , first known in Europe from about AD 1000. The width is typical as the weaver could not stretch further than about 130 cms. The length is fine as these looms allowed the cloth to be rolled around a rod at the top and certainly could go further than 430 cms. The use of treadles to manipulate the shuttles to create a three in one herringbone is also possible and certainly much easier to effect than in any known ancient loom. So if you want to challenge this please provide an ancient loom that can weave a cloth similar to the Shroud. And then there is the issue of the Z spin of the yarn that places the linen into the Western Mediterranean… So one STARTS with the hypothesis that is a medieval cloth. It is important to establish such hypotheses that are fairly basic and then challenge people to overthrow them. And all this BEFORE we have got round to putting the images on. . . I leave it to the surviving members of the disbanded STURP to make their defence but my point is that they did not sit down and start with asking the basic questions that one needs to START with and so have misled us all by making the Shroud a totally unnecessary mystery. Now that people are talking to me about this, I simply say I am not taking any credit for taking the approach that any professional historian/ archaeologists/ art historian would have taken start with the basics – in this case the weave – from which all else follows. Meanwhile whatever is happening on this site, life moves on as others are beginning to become involved..","date":"2014-11-08","mins":"3:55 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-168934","author":"charles_freeman","post":"I agree , multi disciplinary approach is the way to go. So I have the following disciplines to offer from my articles, iconography of the fourteenth century, blood cults of the fourteenth century, weaving techniques e.g the treadle loom as the most likely loom for the Shroud, background history to relic cults in the medieval period, medieval liturgies and ceremonies – in addition I have consulted Mike Spyer a professor of physiology, on the blood stains and, from the STURP articles he cannot see how the STURP team could say that they had found human blood.He took the conventional view, that all forensic scientists I have consulted have taken, that the blood stains are too red to be real blood. Heller or Adler’s hypothesis of stress and bright red blood has never been replicated or taken seriously by anyone other than Barrie Schwortz. Can you imagine how different criminal trials with bloodstain evidence would be if it were true? I did do an earlier post from my I Phone that I asked people to read in my article the observations of the fifteenth and sixteenth century of the blood stains ( please don’t comment back if you have not read and absorbed them I am entitled to be judged on what I have actually written) and then defend the view that the Shroud looked then as it does now. Why did one observer described the stains as ‘admirably painted’ (not the D’Arcis memorandum another source) and another describes the bloodstains as so bright that it was if they were recent. I am taking this as primary evidence that the Shroud looked very differently to these observers in that they could not possibly be describing the bloodstains as we see them today. So once you accept that the Shroud did look differently, the search is on to reconstruct as far as possible how it did actually look and work from there. This is conventional art history and I am not sure how de Wesselow missed out on his training here. News from one of my numerous contacts in the publishing world is that de Wesselow has a new book on the Shroud on the way – so perhaps he will elaborate on his inadequate dismissal of the ‘ this is not a painting ‘ there. ( The person concerned acted totally correctly in not letting me see the proposal perhaps just as well that I was not asked to be one of the peer reviewers!).","date":"2014-11-05","mins":"10:12 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-168817","author":"charles_freeman","post":"But de Wesselow did not look at the original depictions of the expositions. He discredited himself as a serious scholar with his Resurrection Shroud scenario which was stupid of him, as he blew his other credentials when he did not need to. I am amazed that he turned his back on conventional art history by not saying ‘ what did this cloth look like seven hundred years ago?’ That is and always should be the first question to ask and lots of people are happy that I am asking it. I am in Lucca, looking at the relic cults in the churches there. There is nothing like immersing yourself in the medieval world to get the vibes of the cults. Why is David Mo.s comments not up there among the ‘terrific’ ones it is just as valid as the others to my mind he is asking the right questions, questions that should have been asked years ago..","date":"2014-11-05","mins":"4:34 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-168951","author":"charles_freeman","post":"P.S. Might I add that if I had been asked to peer review de Wesselow’s new book, I would have said no, even though I would have remained anonymous. He is entitled to have it looked at by peers who have had nothing to do with him and his ideas before. (That is the ideal, of course!) Each book is a fresh start and presumably he has something new to say or he would not be putting in a new proposal. So we shall see what emerges..","date":"2014-11-05","mins":"11:15 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-168955","author":"charles_freeman","post":"Look at the early depictions of the Shroud on the dorsal image they all ( any exceptions?) show a gap between the elbows and the body that can’t be seen today. Now, in the privacy of your own home, lie down on your back and put yours arms down so that there is a gap between the elbows and the body. Then see how far your arms will reach in front. You can then see that the two images on the shroud are not simultaneous representations of the same body. In fact, the artist has not even tried to make them match as his aim was simply to create images that could be seen by a congregation..","date":"2014-11-05","mins":"11:33 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-168883","author":"charles_freeman","post":"Please read the original descriptions of the impact of the blood on fifteenth and sixteenth century observers in my article and then defend your view that the Shroud is unchanged from 1449..","date":"2014-11-05","mins":"7:20 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-168979","author":"charles_freeman","post":"O.K. Please don’t confuse copies of the Shroud with depictions of the expositions. The expositions are Iikely to be more accurate – they certainly correlate with each better. Anyone able to find one that does not show a gap between the elbows and the body and follow up my point from there? ‘Desperate attempts’ and ‘ bogus hypotheses ‘. Oh dear, another sleepless night, tossing and turning now that O. K has exposed my mendacity yet again. How can I show my face, etc,etc?.","date":"2014-11-05","mins":"1:50 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169017","author":"charles_freeman","post":"Antero. This is just silly. You can read my biography on the Yale University Press site easily found if you put my name into a Google search and you can see that I have a great deal of experience as a historian and am widely accepted as such with a book on medieval relic cults that is published by a university press and has been well received by Catholic reviewers. I am merely interested in finding the truth about the Shroud and I promise you that if you find any evidence to place the Shroud conclusively within the period AD 1 30 then I will take it seriously. It is because I have never seen any such evidence and because I know a great deal about medieval relic cults that I think that the Shroud is better placed within the medieval era and more closely ,due to its iconography, to the first half of the fourteenth century. That is an honest opinion based on what evidence we have. I have placed the Shroud within a very important medieval ceremony taking place on a day when Christians traditionally rejoice at the Resurrection. It is quite understandable that the Shroud should have been venerated for over seven hundred years and I think that anyone should be satisfied that that it the case. After all, I am not saying that it is a forgery or a hoax but a cloth that was created for a sacred ceremony. I don’t think I should be denounced for saying that. It is hardly ‘debunking’ the Shroud by giving it a sacred function. The chances that it was the burial cloth of Christ were always remote and I think pope Francis is right in not encouraging that belief..","date":"2014-11-05","mins":"5:58 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169108","author":"charles_freeman","post":"What evidence from science places the Shroud within the period AD1 30? I am not ignoring science that I have never seen..","date":"2014-11-06","mins":"2:19 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169106","author":"charles_freeman","post":"The copies are not good enough. They may have faded too. Count your victory when you have explained the intensity of the bloodstains as seen by the observers I quote. They cannot possibly be seeing the same Shroud as we see today. Do you think the Crown of Thorns could be seen clearly on the original Shroud?.","date":"2014-11-06","mins":"2:17 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-168661","author":"charles_freeman","post":"Just as well that the value of my article is not being decided here but instead within the academic community of people who actually work with medieval artefacts and liturgy! in fact I got an e mail this morning from a Catholic specialist saying thank goodness we have moved on from the sterile ‘is authentic or not?’ to actually looking at the Shroud within a medieval context. I am not at liberty to disclose private e mails I have had but it looks as if my article is going down well with those who know and whose credentials I respect. No doubt I will be able to,publicise some of these in the next couple of months. I t seems that I will eventually bypass Shroud Story and leave you all in peace..","date":"2014-11-04","mins":"1:48 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169273","author":"charles_freeman","post":"‘ everyone who viewed the Shroud was told it was the residue of sweat.’ Colin, I have never comes across this before so,please give the quotes from ‘ everyone’ and I will add them to my notes. I would love to know from Colin how he knows that the images were as faint or almost as faint in the fourteenth century as they are today. It assumes that the chemistry of the Shroud has remained unchanged for seven hundred years despite the many expositions that we know were pretty turbulent affairs – as the nuns caught by the customs officers with brandy in their bottles labelled ‘Holy Water’ put it – Good Lord, another miracle’. David has dug up yet another quotation that shows beyond reasonable doubt that the Shroud looked very differently in the sixteenth century. I have seen the two exact replicas of the Shroud in Turin and I can’t see bloodstains ‘as if they were recent,’ even though Thomas can, and, as David reminds us, the Shroud was described in 1449 as painted. As a historian I have to make a judgement and in the end I give up on those who really do believe that the Shroud was the same in1350 as it is now ,although I am giving Colin a last chance to provide his evidence. Just as I can’t see the Shroud in the Pray Codex as it shows Christ being laid out without the bloodstains on his body when anyone seeing the Shroud would put the bloodstains on the body, in the end one just has to accept that one has the wrong spectacles and continue on one’s way trying to find the truth about the Shroud. I have been in Pistoia looking at the wonderful 1260 Crucifix with scenes of the Passion they have in the cathedral there. There is blood flowing from the five wounds, but no marks of any flagellation and the panel with the flagellation scene shows no blood at all. Christ has a halo, not the Crown of Thorns. The change in iconography over the next eighty years is indeed dramatic. The flagellation marks are shown covering the whole body, the halo becomes the Crown of Thorns, and the blood becomes more prominent – the Shroud is so typical,of this change. I am keeping my mind open to which of the bloggers here have closed minds!.","date":"2014-11-06","mins":"11:35 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169347","author":"charles_freeman","post":"‘ everyone who saw the Shroud was told…’ Well, Colin, you have not provided a single example of anyone who was told. Francis de Sales imagined sweat, along with the blood, but that does not mean much. I cannot see anything credible you can provide for your case of faint images to set against the mass of primary evidence that everyone was shocked by the prominence of the blood in the fifteenth and sixteenth centuries..","date":"2014-11-06","mins":"4:20 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169274","author":"charles_freeman","post":"Well, I just ask Emeritus Professors and give them every paper I can find on the Shroud bloodstains I think there was only one of the Heller Adler papers that I was not able to find. Are you suggesting that they will change their professional opinion to suit me? I sometimes wonder whether some of the contributors to this blog have ever worked directly with academic specialists in my experience they give their professional opinion independently of what I might want to hear and several trails I have started along have been closed off as a result..","date":"2014-11-06","mins":"11:42 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169349","author":"charles_freeman","post":"Antero. If you can find a print copy of History Today , where we have the illustrations in full, you will find that the blood flows on the Holkham Bible of 1330 are almost identical with those on the Shroud.","date":"2014-11-06","mins":"4:22 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169341","author":"charles_freeman","post":"Don. First you have to create a medieval linen weave. The medieval experts tell us that it has to be quite a thick weave of linen ( just as the Shroud is) if it is to be a suitable surface to paint on. Then you seal it ,usually with a gesso of collagen derived from rabbit skin boiled up and mixed with calcium carbonate ( as found in large quantities by STURP). But as Ceninno Ceninni advises, in the fifteenth century, you must cover only the outer fibrils of the cloth( as again STURP found on the Shroud). If it goes under the surface you will not be able to fold and unfold the cloth. Then in top of the gesso once it has dried, you can paint an image. If you need bloodstains ( as the early observers of the Shroud reported there to be in vivid colours ) then probably you need vermilion even if it does not dry like real blood. Now you have your painted linen. You need to keep,it very carefully because even with a sealed surface it remains vulnerable to damp and decay and the vast majority of the painted linens that we know, from church and monastic inventories, to have existed have long since perished. The problem is if you expose it, especially in Turin in May when it is the month of the heaviest rainfall, and unfurl it dramatically year after year in front of the enormous crowds that get to see it, the surface begins to fragment. It may take four or five hundred years before almost all, or perhaps all, the pigments have dropped off and there are only a few remnants of the calcium carbonate to be found by later researchers, although here is at least one report that some of the vermilion was still there in 1978. But in the end after six hundred years, the bright colours of the blood and images that were once said to be there, have faded and one can hardly make out what is still left. The Crown of Thorns has gone, the loincloth, that was painted on by 1578 in accordance with the decrees of the Council of Trent against lascivia in religious imagery, has long gone and you can no longer see that there was once a gap on the dorsal image between the elbows and the body, making it clear that the front and the back image could not have been created simultaneously as the arms would not have reached in the front to cover the pubic area. And although this is hard to believe, there are some people who still think that the faded images of today are still the same as they were In 1350 and perhaps even in AD 30 but they must be left to their own fantasies and the rest of us must move on in the real world. The problem is that we have not got five or six hundred years to paint a linen cloth according to the medieval methods and wait until the images are faded. So perhaps the Shroudies will win after all..","date":"2014-11-06","mins":"4:10 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-163757","author":"charles_freeman","post":"No, I don’t and I keep saying this but you don’t listen!! I may be the first as with all m y research I have not found anyone else proposing this, but I did make a study of this decree for my book Holy Bones and knew quite a lot about Carlo Borromeo so it may be that no other Shroud researcher knew about the background and spotted the connection. Again, if you know someone who has written about the loincloth, please let me know and if you want to be acknowledged in my footnotes, you will have to reveal your real name!.","date":"2014-10-19","mins":"9:14 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-169464","author":"charles_freeman","post":"David G. Well from my perspective I sometimes get the feeling that someone out there is out to defeat me!.","date":"2014-11-07","mins":"12:54 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-163758","author":"charles_freeman","post":"Markwardt is a lawyer and I would not like to be prosecuted by him – he obviously has decided to be the prosecuting counsel in this case and uses language to suit. However, I am a historian and have to look at the facts and actually read what Thurston wrote, not what JM thinks he wrote to fit in with his prosecution case. Thurston is absolutely clear on what he believed, rightly or wrongly, the Shroud to have been so there would have been no problem taking on his case as defence counsel and winning..","date":"2014-10-19","mins":"9:20 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163820","author":"charles_freeman","post":"Anoxie, as you will see if you can wait for the full article and the footnotes any points I make that I do not think to be original are footnoted. No one seems to be able to understand what you want. The decree of 1653 attempted to deal with nudity that was a feature of much religious art and was causing offence in the sterner times of the Counter Reformation.. So we have cases where a loincloth was put onto a nude body to comply with the decree. The Last Judgement by Michelangelo in the Sistine Chapel is the example that most people know of the figures have now been restored to the originals. I am simply arguing that as I know of no case where a depiction of the Shroud before 1563 had a loincloth on it and every depiction after 1578 does have a loincloth on it (until the pigments of the added paint fell off) then it is likely that the loincloth was added as a result of the decree. When you discover that two devotees of the Shroud, both of whom appear in depictions as the presiding clergymen at an exposition of the Shroud, are known to have been directly associated with the decree, one of them actually being one of the signatories, then you put the evidence together and wait for someone to refute it. Relics suffered all kinds of fates, pieces were cut off, bodies were divided into many parts, there are many fragments of the True Cross and individual thorns from the Crown of Thorns or relics were concealed in reliquaries. So there would have been no taboos about adding a loincloth to the Shroud whether it was/is authentic or not. I just added it as an interesting part of the story of the Shroud and I am not sure why you are making such a fuss about it!.","date":"2014-10-19","mins":"2:34 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163832","author":"charles_freeman","post":"So I may be the first to have made this point about the loincloth. Over the next year or so as experts in religious art of this period read my article, we shall see if I am supported in my argument or not. It is not a question that has any relation to whether the Shroud is authentic or not, of course, and I still don’t understand why you are so worked up about it. It is after all an interesting but peripheral part of the article..","date":"2014-10-19","mins":"4:17 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163833","author":"charles_freeman","post":"Daveb. I am not sure how you can be quite so dogmatic about the creation of the cloth but perhaps you will favour us with the evidence against my hypothesis when you have read the full article and the footnotes. It is obvious from the various pin pricking comments that my article has not been properly digested as yet. I assume that more sophisticated challenges will be on their way but ,of course, after Thursday I am hoping to draw in specialists who so far have not applied their expertise to the Shroud..","date":"2014-10-19","mins":"4:28 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-164092","author":"charles_freeman","post":"Well, as you will see, I do not rely on Chevalier – my main argument rests on the iconography of the Shroud which, whatever Dr. De Wesselow may say ,is fourteenth century. In all his six years of research, he art historian does mot seem to have realised that all over flagellation marks as seen on the Shroud only come in the 1300s Had he never read the work of James Marrow who deals with this in depth?.","date":"2014-10-20","mins":"2:58 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-164093","author":"charles_freeman","post":"I mean the James Marrow who is at Princeton the great authority on Passion iconography. And I do acknowledge his work in my footnotes! He pins down the all – over flagellation iconography that confirms that the Shroud could not have been painted before 1300..","date":"2014-10-20","mins":"3:05 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-164117","author":"charles_freeman","post":"No, the Stuttgart Psalter does not work because the flagellation has to be from the crown of the head to the soles of the feet to fit with the link to Isaiah 1.6. That Marrow sees as the inspiration of the iconography.The Stuttgart flagellation hardly extends below the buttocks. The Shroud flagellation marks also, as Barbara Faccini points out, are the result of three different instruments and, although she may not have realised this, this fits in with the three Old Testament texts that Marrow pinpoints as the inspiration of flagellation scenes from 1300 onwards, each text describing a different instrument – see my article. It is the clinching point for a 14th century iconography..","date":"2014-10-20","mins":"4:51 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-164239","author":"charles_freeman","post":"Methinks Max has not read my article..","date":"2014-10-21","mins":"12:28 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-164369","author":"charles_freeman","post":"I can’t tell you much, Max ,because there is not a shred of evidence that it is the Shroud that they are referring to. Surely in all your researches you have come across inventories of monasteries and cathedrals that were once full of painted images on cloth ,many of them specifically mentioning that they are of the risen Lord. The misconception of many Shroudies is to assume that if there is a mention of an image of Christ on a linen ,it must be the Shroud. The Shroud is important as , even with its pigments disintegrated, it is a rare survivor of the thousands of painted images on linen that were once documented, especially for use Lent and Easter hence images of the risen Lord. And your admittance that you have not read my book ( actually an article in a serious history journal)but can still comment on it really shows you up.!!.","date":"2014-10-21","mins":"12:47 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-164663","author":"charles_freeman","post":"Max, the article will be online tomorrow at History Today. You haven’t even read it yet. Don’t waste everyone’s time until you know what you are talking about and if you wish to comment as you are free to do, make sure your comments relate to the article and are written in a form that is comprehensible. Thanks..","date":"2014-10-22","mins":"12:38 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-165777","author":"charles_freeman","post":"One of the first tasks of future research into the Shroud (the object that ‘ has had more research in it than any other artefact in history’ ( lol)) is to make a data base of all early depictions of it. These must be divided into the depictions of expositions, such as in Tempesta’s engraving, and copies of it found in other contexts. We must be careful with copies those in churches in Piedmont are surely inspired by the Shroud even if they do not have the fire marks – other so called copies, those in Spain , may not be direct copies of the Shroud at all but actually similar clothes used in the Spanish Easter ceremonies. For me the major remaining mystery of the Shroud is why it has two images on it when others have only one. ( Of course, in Byzantine art double images are common.) Only when we have all the depictions can we begin to make a final assessment. Were the marks more vivid in the fifteenth and sixteenth centuries? Were some features such as the Crown of Thorns and thumbs on the hands shown consistently across the decades by different artists portraying the expositions.?Can we say that the figures were naked before 1563 but with a loincloth afterwards? With the loincloth are the artists each painting their own loincloth or are they portraying the loincloth they can see on the Shroud.? So there is a great deal of basic work that has not yet been done. I am concentrating on working with those who accept that the Shroud is fourteenth century but realise that there is still so much work to be done on it. I have to say that I find it ridiculous when I read that in some way I really know the Shroud is authentic but that I want fame and fortune by pretending that it is not. I really do believe that the evidence is overwhelming that the shroud comes from the fourteenth century. As I can see from the worldwide publicity a single article in the Guardian shows that a new debate can begin on other websites that deal with medieval iconography, ancient weaving and medieval liturgy. This is where I will be working. Who knows where we will be in a year’s time in research on the Shroud once these specialists become involved?.","date":"2014-10-26","mins":"9:50 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-164906","author":"charles_freeman","post":"And there is the Margerite de Valois prayer book of 1559 that is shown in the illustrated version of my article. So three out of three..","date":"2014-10-23","mins":"12:53 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-166109","author":"charles_freeman","post":"No, I am retracting nothing. I am simply saying that for completeness sake we should assemble a full data base. That is just standard research which, in the case of the Shroud ,has never been done and I am pleased to find that on the web, among the many reactions to my article, some of which have ,of course come to me personally, people are beginning to say this. So this is a positive outcome of my article. If we get a full data base I think we will build up a great deal more evidence about how the Shroud looked when it was first painted. I think the evidence, on the depictions of Shroud expositions I have seen, will support me in the loin cloth but there is still so much to be done. For instance, I found , in the British Museum print section, a depiction of an exposition I had never seen before and then when I asked the Royal Library in Turin for a particular depiction showing Carlo Borromeo which they have they sent me a completely different one, which again I had never seen. So there is a lot of work to be done here, possibly for a Master’s dissertation or even a Ph D. But we come back to the first issue. What does it matter if there was a loincloth added or not? It is just an interesting part of th e Shroud!’s history that has nothing to do with whether it is authentic or not. Much more cr Ucial is the ‘all over’ flagellation that Is so prominent on the Shroud but not known in medieval iconography before 1290 1300.and yet no one has raised this at all! We need to date the Viverone depiction, which is an independent copy, of course, and not an actual depiction of an exposition. I think the the latter should take precedence for sh owing what people actually saw on the Shroud. The way the clergy are holding the Shroud is more typical of the later sixteenth and seventeenth century but I am glad at this issue is being raised as it is typical of those what will make more sense when we have a full data base to make a comparative study..","date":"2014-10-28","mins":"3:30 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-166237","author":"charles_freeman","post":"So what was the large amount of calcium carbonate found by STURP on the Shroud? Even today it is an essential component of the gesso used to seal cloth before you paint on it. My belief is that once we have all the depictions together we will be able to find a lot more about the Shroud without even asking the Vatican to release it (although this would be best of all). I am resting my findings on the research I have done so far which shows that there are many features the Crown of Thorns is an obvious example that are clearly shown to be there on many of the depictions. The leaving of the Crown of Thorns on the body of Christ after he is taken down from the Cross appears in the late thirteenth / early fourteenth century, together with the over all flagellation marks that result from the adoption of Isaiah 1.6. As a premonition of the flagellation. (This is not my idea but that of the top expert on Passion iconography , Professor James Marrow – let’s admit there are experts around who have better things to do than study the Shroud but whose work offers important information.) My article, as you will see if you have the time to read it, builds up a lot of circumstantial and more than circumstantial evidence to make a coherent argument for the weaving and painting of the Shroud in the first half of the fourteenth century and it was so vivid that people were overwhelmed by the power of images, especially the bloodstains, that have now faded..","date":"2014-10-28","mins":"12:57 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-166602","author":"charles_freeman","post":"You need to remember that the gesso layer is designed to be very thin so as to rest only on the outside of the fibrils( this is why STURP found the image was only on the very outside). Medieval gesso as found north of the Alps was a mixture of calcium carbonate and rabbit skin glue ( collagen) although different mixes were possible. Once the surface of the Shroud came under pressure , the gesso would have fallen outwards not inwards. Obviously I would like clarification of what STURP meant by ‘ large’. It seems that there were significant amounts of calcium carbonate and when I am in my office I shall go back to the original report to see whether they have provided any further information beyond, as I recall ‘ accumulations of dust’ Your alternative explanations seem very speculative. It underestimates the very rough handling of the Shroud that is documented in the seventeenth century expositions when dust and limestone fragments would certainly have been shaken off while one would expect some elements of a glue gesso to still be sticking there. When I submitted all the so – called blood reports I could find to a Professor of Physiology he read them and said he was totally unconvinced that this was blood but more indicative of collagen. So we have evidence,still to be confirmed, of the ingredients of gesso on the Shroud. As you will know STURP specifically said that they had not examined any medieval linen paintings so they had nothing to go on. This was an extraordinary omission. If they had bothered to do some basic research on painted linens before they set out to Turin they would have been in a much stronger position to make credible claims about painting. As you will see from my article and the podcast just issued by HT, I keep making the point that there is so much basic research on iconography and medieval linen paintings that has not yet been started. I am working hard to involve more specialists such as the professor ment Ioned above. I don’ t know of any Shroudies with the relevant expertise in so many areas of research I am interested in..","date":"2014-10-29","mins":"1:14 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163232","author":"charles_freeman","post":"Eric. Read the article. The images were painted naked, c 1325 50 , they were only covered with a loincloth two hundred years later after the 1563 decree from the Council of Trent – the same decree that led to the covering up of Michelangelo’s Sistine Chapel Last Judgement nudes – but it is all in the article with the specific links to the clergy who were associated with both the decree and the Shroud. But there is no point in my having to point out these things when the article is clear but will be further enhanced in the digital edition with more illustrative back up – sorry ,folks, but History Today have a pay wall, but you do get lots of other articles as well!.","date":"2014-10-17","mins":"5:35 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163361","author":"charles_freeman","post":"The Lier copy shows a nude figure but as this is pre 1563 that is what I would expect..","date":"2014-10-18","mins":"2:30 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163353","author":"charles_freeman","post":"Well, you can’t have read very far as I argue that the iconography of the painting , made probably just after the Shroud was woven, is typical of the first half of the fourteenth century. It was painted early on ,and if you read on in my article you will find that the best bet is that it was for the Quem Queritis ceremony on Easter morning..","date":"2014-10-18","mins":"2:00 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163223","author":"charles_freeman","post":"I am happy to let this debate run. I do believe I have a better hypothesis for the formation of the images than any others going but if you want an answer to how the image was formed you will need to paint a linen cloth according to the medieval manuals, as quoted in my articles, with a layer of gesso on the outer fibrils only, with paint on top of that. Then you need to apply some rough treatment, e.g. Dramatic unfoldings, as in the Tempesta engraving I illustrate, over many decades, wait for five hundred years and you may have just the faded image left. As none of us are likely to be around in five hundred years time, the matter may never be resolved but I am putting out the call for conservationists who specialise in ancient painted linens to see if t hey have other examples with which to compare the image on the Shroud. The fully illustrated article( I.e. With several more illustrations) will be in the digital edition of History Today next week with an accompanying podcast I recorded earlier today. I also have a full set of footnotes for which I will soon provide the link. (History Today do not do footnotes. But I felt that it was right to provide them) History Today is a well respected journal in which professional historians write for history buffs. This is my fifteenth article for them. I have no idea who peer reviewed my article before acceptance but some of Britain’s top historians are on the advisory board. Much of the article has been checked for me by specialists in the areas I discuss and an Oxford professor in medieval church history has read and approved of the whole. My aim is to bring in experts who have not so far been involved in the Shroud to cover the many important areas where serious research on the Shroud has not yet begun. Copyright in the articles is not mine but with History Today. All illustrations have been acknowledged and paid for by History Today. I am not intending to involve myself further in the debate unless something. I have written has been misrepresented. I would not expect a consensus among historians, art historians, weaving specialists and experts in medieval liturgy to have formed in less than a year so I shall sit back for a bit and see what happens. Whatever responses I get I am grateful for the interest and hope the responses are directed at the evidence I provide. That is the only way to move forward..","date":"2014-10-17","mins":"5:14 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163478","author":"charles_freeman","post":"I think ‘popular’ could be misleading as you will see if you access the website and look at the advisory board.The aim of HT is to pass on the work of professional historians on to those interested in history, provide a bridge as it were. I had to wait for two months before my article was accepted although I have no idea what process was gone through before it was. I also had the whole or parts read by willing specialists. I know that the magazine is an excellent way of getting history news and ideas out in the wider world which is why I chose it for this article..","date":"2014-10-18","mins":"10:42 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163355","author":"charles_freeman","post":"Yes, £200..","date":"2014-10-18","mins":"2:01 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163664","author":"charles_freeman","post":"Latendre. Do make sure in your letter that you make it quite clear what your own credibility as a historian is, if you want your letter to have a chance of publication..","date":"2014-10-19","mins":"2:32 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163590","author":"charles_freeman","post":"Latendre “May not stand the scrutiny of professional historians”. But the advisory board of History Today is made up of highly prominent historians, many of them university professors. So are you saying that they have their names up there but don’t scrutinise the articles that are published? In so far as History Today is ‘popular’, it is because it is highly respected by readers who want to be assured that the articles are of high quality. .if this is what you mean by ‘popular’ then I agree with you..","date":"2014-10-18","mins":"5:52 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163358","author":"charles_freeman","post":"So far as I know I am the first to propose that the loincloth was a later addition to a previously painted cloth. As you will see there were two important clerics, Francisco Lamberti, bishop of Nice, and Carlo Borromeo, who were clearly associated with the devotion to the Shroud and also were associated with the decree of 1563. As you will see from the fully illustrated article, there is an image of the Shroud with nude figures in 1559 and from 1578 onwards there is the loin cloth. I suspect that the visit of Carlo Borromeo to Turin where he welcomed the Shroud in 1578 has something to do with it. I had not expected publication of the article until this coming Thursday but the link to the footnotes is in preparation and I will see if I can get it out earlier. All sources I used are quoted in the footnotes. N.B. Accusations of plagiarism and other ad hominem attacks. The traditional methods work best. Make a wax effigy and put the name of the offender on it and then stick pins in it. I have a box of candles ready to melt down.. But as it clear that very few, if any, of the commentators so far have read, let alone digested, the article so I shall leave it at that for the time being..","date":"2014-10-18","mins":"2:12 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163939","author":"charles_freeman","post":"Yes, I have seen these lists. I go well beyond the brief mention by naming individuals who might be involved. What we need to do is find an art historians who will look ant all the depictions of the loincloth,BY DIFFERENT ARTISTS at DIFFERENT TIMES, and see whether they are showing the same loincloth or making up their own. My own research suggests that they were copying what they actually saw painted onto the Shroud. I am fascinated that this issue is the one that everyone is concentrating on when it is such a marginal part of my article. It adds nothing to the overall argument of the article but I think it is an interesting part of the Shroud’s story that was worth mentioning. As I have stated in other posts, there were no taboos about dealing with relics in this way..","date":"2014-10-20","mins":"1:54 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163359","author":"charles_freeman","post":"Again read the article. This was probably a stage prop in the Quem Queritis Easter ceremony when they brought a grave cloth out of a stage tomb to show the congregation that Christ was risen. They held it up in front of the tomb just as shown in the Lirey pilgrim badge. The artist here, and in the Besancon Shroud, recreated the idea of an image of Christ’s body having touched the Shroud and so a negative. I believe that the cloth was painted originally for this ceremony and later Jeanne de Charny had an unsuccessful go at claiming it was the real thing. But it is all there in the article!.","date":"2014-10-18","mins":"2:18 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163699","author":"charles_freeman","post":"Mike M It would not prove anything. – this is purely a re enactment – in effect, the birth of medieval drama it leads on to the Passion plays. Priests pretending to be the three Mary’s in some versions, or Peter and ‘the disciple that Jesus loved’ in others ( if they adapt John’s gospel) act out the gospel story but the liturgy requires them to bring out a grave cloth to show to the congregation that, in the tomb where Christ was buried,there is now nothing but the grave clothes. Some appear to be painted, here in garish detail to make the point at a time, the fourteenth century , when emphasising the blood of Christ was all the rage. What makes the Shroud really important is that it seems to be the only survivor. ( After I wrote the article, I found some information that there may be similar surviving double images in Spain which have been misinterpreted as copies of the Shroud.) The Lirey badge gives support to the hypothesis that the Shroud was one of these in its original form, held up by two priests before an empty tomb as the ritual required .It appears to be Jeanne de Charny who tried, unsuccessfully so far as Clement VII was concerned, to claim that this was the authentic burial cloth. As you will know Clement allowed continued expositions so long as her claim , she was by now dead,of course, was publicly announced not to be true. And so on to the present position of the pope, the dukes of Savoy and the Shroudies not withstanding..","date":"2014-10-19","mins":"4:52 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163666","author":"charles_freeman","post":"Yes, Anoxie is right that is my contention..","date":"2014-10-19","mins":"2:37 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163678","author":"charles_freeman","post":"As I have said before, I do not know anyone who has made this contention in the specific context of the 1563 decree from the Council of Trent and linked it to Francesco Lamberti and Carlo Borromeo. You sound as if you do, when you say that this is not an original contention, so please give me the reference so I can make acknowledgement in my footnotes.and I will even give you an acknowledgement for pointing it out if you come out from behind your pseudonym!.","date":"2014-10-19","mins":"3:18 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-164498","author":"charles_freeman","post":"But one aim of my article is to show with evidence that STURP got it wrong on the painting, partly on the evidence that STURP found for large quantities of calcium carbonate, part of the gesso mixture that , according to the medieval sources was put on the outer fibrils of a cloth with a knife to seal it before painting. No one on STURP had a clue about medieval painting and did not even bother to ask any specialist. They would have been told at once’ “Calcium carbonate just in the outer fibrils and no evidence of brushwork? Yes, that suggests a gesso applied as it should be with a knife to seal the cloth so that paint could be added.” Yes, I do believe that it makes good sense,not nonsense. This posting was put up on this website and I have every right to respond to comments, abusive or otherwise on it but the quality of my argument will be tested on specialist websites, not here. I do not respond to abusive remarks. They make absolutely no contribution and simply degrade those who make them..","date":"2014-10-22","mins":"12:29 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163434","author":"charles_freeman","post":"No, I only said that because in many years of Shroud research there may be someone who has claimed the same but I don’t know of anyone who has made the specific link between the appearance of the the loincloth by1578, but not before 1563 and the specific association of Francesco Lamberti and Carlo Borromeo both of whom were linked to the decree of 1563 from the Council of Trent that banned lascivia in religious art. Lamberti was actually present to sign the decree, Borromeo was the link man between his uncle ,pope Pius 1 V and the Council and he enforced the decree in Milan when he became archbishop there. There are engravings / depictions of both of them as the central figure holding up the Shroud. So the search should be on to find a depiction of the Shroud before 1563 that does show the loincloth and one from between 1578 and 1750 that does not. The obvious comparison is with Michelangelo’s Last Judgement in the Sistine Chapel that has clothes painted on after 1563 so we have a precedent. As Hugh says what is the big deal about painting a loincloth on? After all far worse things were done to relics, including cutting them up into smaller pieces. There was never any taboo about dividing bodies and other relics up into smaller pieces so a loincloth added on is neither here or there. It is just an interesting episode in the history of the Shroud..","date":"2014-10-18","mins":"8:00 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163456","author":"charles_freeman","post":"The release date of the full article with illustrations is this coming Thursday and as the footnotes relate to that they will come out at the same time. There are four full pages of them so that anyone who is interested in knowing where my sources come from will be able to follow up the sources I give. This debate is going nowhere. My own suggestion is that someone who has coherent objections to it that deal with the history aspects try and get something on the History Today blog where others can comment. It also appears that an art history website will be doing something on it ( I will provide details when I have these confirmed) and no doubt those who wish to comment on the painting aspects and iconography will be able to provide comments. Perhaps our old friend Thomas de Wesselow will make an appearance. As I said earlier, I would expect it will be at least a year before we know whether this article has advanced Shroud studies or not but as I have lots of other projects on, I am happy to wait ..","date":"2014-10-18","mins":"9:19 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163444","author":"charles_freeman","post":"No, I did a great deal of research so can be fairly confident that no one has been there before me. You can’t be absolutely sure that some German or Polish or Spanish scholar ,for instance, has not proposed the same idea. However, we shall go live with the footnotes on Wednesday or Thursday at the same time as the fully illustrated article becomes available on the History Today website and if anyone can find someone who has made the point about the loincloth I will happily give the reference. So over to all of you to find one! If not I shall go on calling my work original..","date":"2014-10-18","mins":"8:33 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163467","author":"charles_freeman","post":"Anoxic, Not in relationship to the decree of 1563, no. There have been general references to artists adding a loincloth to their pictures but I would argue instead that they were depicting the same loincloth although here, as in many areas of Shroud iconography, we still have lots of work to do. As anyone reading my article will see, I think that there is so much basic research to do on the Shroud and I hope that one result of my article will be to encourage specialists to do it..","date":"2014-10-18","mins":"10:18 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163470","author":"charles_freeman","post":"Anoxie. HT may have realised it was not a good idea to publish the article early when the illustrations that back the arguments were not all there. Remember, however, that History Today has the copyright of the article and that they can legitimately prevent its circulation other than under the normal rules of copyright. I think Dan spelled out what those were not long ago. I shall retain copyright of the footnotes. Being a well established and highly respected journal, HT will no doubt have a lawyer at hand. It will be much better if those who wish to seriously engage with this article wait until they have seen the full text and the accompanying footnotes..","date":"2014-10-18","mins":"10:31 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163471","author":"charles_freeman","post":"Anoxie As I have sold the copyright for the princely sum of £200 I have no greater right to the link than you have. You must approach the copyright owner directly. I have also failed to have access but as publication was not scheduled until the 23rd I can hardly complain. Just some of you have had a peek preview ,even if it has not been of the full article..","date":"2014-10-18","mins":"10:34 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163668","author":"charles_freeman","post":"Contrary to what Jack Markwardt, a lawyer, not a historian, implies, Thurston argued that the Shroud was not original but was created specifically for another purpose, display at the Quem Queritis ceremonies. You can find Thurston’s view in the venerable 1907 Catholic Encyclopedia., article on Shroud that he wrote for them. Once you have got towards the end of my article you will find my acknowledgement of this as there is evidence to support him. So the implication that Chevalier and Thurston conspired to say that the Shroud was a fraud does not hold has JM had this article peer reviewed or on what grounds is it accepted as scholarly? It is quite clear that many of the commentators here have not read my article in detail. They will find when they do that I do not believe that the Shroud was a fake in the sense of a artefact designed to deceive – why would Clement VII have allowed it to be displayed with an indulgence attached if that had been the view in 1390? Rather it was one of many, objects of veneration given spiritual status by the Church but no more – the same position as today at least the Church is consistent! Ultimately for me, the success of my article will depend on whether professional historians, art historians, experts in weaving, etc, endorse my views as that is the world I work in. I give them lots of work that I would like them to do in areas where I am not a specialist. So we shall see. If Shroudies wish to participate in the debate they must establish their own credibility as commentators so it is up to them. Please don’t expect to write letters, etc, to be published in academic journals unless you make it quite clear what your own academic status in these issues is. I have had a well reviewed book on medieval relics published by a university press and that proved a good starting point to being taken seriously..","date":"2014-10-19","mins":"2:57 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163679","author":"charles_freeman","post":"Addition to the sentence above ‘ In the article itself, I give them lots of work to do. . . ‘ we do need lots more specialists to become involved in these issues!.","date":"2014-10-19","mins":"3:22 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163713","author":"charles_freeman","post":"Daveb the article by Thurston in the Encyclopedai can hardly be just of archival interest if it undermines Markwardt’s thesis as it does. Sometimes historians have to point these things out. Anyway, while I don’t give any credibility to JM ‘s thesis ,it is irrelevant within the wider context of my article. Suppose Thurston had argued, as he does not, that the Shroud was a fraud, then there I would not go along with him as my article makes clear the Shroud was never a fraud and never intended to be one. It was openly created,I believe, for a totally different purpose, as a stage prop in an Easter drama to show congregations that Christ had indeed risen. The question of how it was misappropriated as a relic is a fascinating one but a completely separate story..","date":"2014-10-19","mins":"5:24 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163686","author":"charles_freeman","post":"Come on Dave B! So far as I know JM’s article has never been given academic credibility – where has it been published? ,where has it been reviewed in the mainstream academic world? It does not make any kind of sense to me as it implies that Thurston claimed that the Shroud was a fraud when he quite clearly states otherwise in the famous Catholic Encyclopedia of 1907. So Markwardt starts with a fake premise and argues from there. Certainly not an article that proves anything and in fact it is irrelevant to my argument anyway as I state quite clearly that the Shroud was not a forgery but was painted for a specific purpose – the Easter ceremonies without any intention to deceive anyone. Jeanne de Charny had an unsuccessful attempt, in the eyes of the Church , to say it was authentic. The dukes of Savoy claimed the same thing and then there are the Shroudies today. Meanwhile the Catholic Church has, in fact, kept to the same stance established by Clement VII in 1390, , worthy of veneration ( probably because of miracles, alas unrecorded), but with no support for authenticity – as pope Francis has reaffirmed – presumably the exposition of 2015 follows the official Church line. There is nothing in my article that would offend the Church as nothing in it contradicts or challenges their official teaching on the Shroud. I can at least sleep easy on that one. The Shroud is not a fake the most probably hypothesis by far is that it is a typical medieval object of veneration, images painted on a cloth of c.1325, now sadly faded. Over to specialists in these fields of weaving, iconography, relic cults, medieval liturgies, and this ,of course, includes any Shroudies with the relevant expertise, to agree or disagree with me..","date":"2014-10-19","mins":"3:37 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163741","author":"charles_freeman","post":"Yes, Hugh you have raised a good question as to why the Shroud was venerated when it was but one of many. Just one of the many areas where the artefact that ‘has been researched more fully than any other artefact in history’ needs much more research!! A clue might lie with the Besancon Shroud, now vanished, of course, but probably a single image grave cloth from the same ceremony. There is a report that it was associated with the revival of a dead body. This would give it the status to allow it to be preserved and venerated. So I suggest, and this is no more than a suggestion, that there was some miracle or miracles associated with our Shroud. There is some support given to this by the wording about the Shroud on the Lier copy that tells of the Shroud, then at Chambery, having miraculous properties. We do have to explain how what was probably no more than a stage prop got to the point where Clement VII was able to give an indulgence to those who visited it. The next move, to suggest it was a genuine relic, is ,of course a different story and the line from Jeanne de Charny to the dukes of Savoy to the Shroudies is a history subject in itself, one which runs alongside but distinct from the official view of the Church ( other than perhaps a pope or two who did believe it was the real thing). All grist to the historian’s mill!.","date":"2014-10-19","mins":"7:29 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163729","author":"charles_freeman","post":"Daveb. ‘To claim that the Shroud was created as a stage prop in some kind of liturgical drama is a nonsense and cannot be sustained by any kind of scientific study of its properties which remain enigmatic.’ To be discussed in a year’s time when the wider academic world has had its say..","date":"2014-10-19","mins":"6:30 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-205786","author":"charles_freeman","post":"‘ It had only to seem credible to 14th century pilgrims who were drawn to a must see relic that claimed to be a bigger and better version of the Veil of Veronica’. The Veil was an impression of the face of Christ when still alive. It was the top papal relic, the subject of enormous crowds when exhibited in St.Peter’s in 1350. So how do you go bigger and better than that ? Clearly it was a PA disaster if only because no one at the time saw any resemblance to the image of a living Christ (cf. Image of Edessa), and the double image of a dead Christ. The choice of venue was also a serious mistake far too out of the way for a serious relic cult. Compare the Shroud of Cadouin which was on a major pilgrim route so you could hardly miss it! It was also extremely easy to get it suppressed in c.1355. Altogether an enormous flop..","date":"2015-07-15","mins":"2:08 am","url":"https://shroudstory.com/2015/07/12/barrie-schwortz-colin-berry-and-some-good-reporting-in-fort-wayne/","cat":"article","title":"Barrie Schwortz, Colin Berry and Some Good Reporting in Fort Wayne"},{"id":"comment-198412","author":"charles_freeman","post":"Where did I say that the illustration I correctly dated from my own study of such things was painted? Come on, Colin, you provided an illustration that has absolutely no relevance to the painting on the Shroud and I did not even comment on how it was coloured. If you want to turn the question to illuminated medieval manuscripts, usually on vellum before paper came in, then I shall be delighted as the quality of art to be found is way beyond anything to be found on the Shroud and full of interest. I am a great fan which is why I chose to do a specialist course at Cambridge on them. Perhaps you are letting the vapours get to you, Colin. Why not take a break until we have more specialist findings on the images on the Shroud. I agree that it is frustrating especially when there is the expertise on painted linens out there and it just has to be brought into contact with the Shroud itself! It is extraordinarily unlikely that without any known experience of examining painted medieval linens ( STURP had the same problem) that you will get there first and may well poison yourself in the process..","date":"2015-05-05","mins":"3:17 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-202804","author":"charles_freeman","post":"Well it was John Paul II who authorised the publication of the radiocarbon results( according to Gove). One also has to remember that in earlier times any pope who ddeclared the Shroud authentic was also saying that the many other contenders were not authentic unless you believe in the two Shroud theory. This is one reason why the popes tended to be ambivalent , allow indulgences, talk about veneration as a reminder of the Passion, etc, without actually saying this is the real thing! In 1460 the Holy Blood of Mantua was given an authenticity certificate by the pope. That was hardly a problem as you had lots of relics claiming to be the blood of Christ in the fifteenth century and declaring one authentic did not necessarily diminish the authenticity of the others there was enough blood to go around. The Shroud is in a different category and the more work I do on relic cults the more I think it unlikely that the popes were prepared to go further than an indulgence, feast day, etc in line with many other sacred objects..","date":"2015-06-19","mins":"10:18 am","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","title":"BBC News Magazine:  The Perplexing Image"},{"id":"comment-198442","author":"charles_freeman","post":"Let’s take the common sense approach that depingere means what is usually does unless someone can come up with an alternative meaning that is more likely in the context. We don’t know where Wilson got his idea of copying from but clearly he is not a source here to rely on. In the world in which I work, we do rely heavily on specialists opinions and we are not afraid of asking for them. There is a curious do it yourself approach here with home laboratories very much at the fore at least Colin is continuing in the revered tradition of Raymond Rogers..","date":"2015-05-06","mins":"1:25 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198452","author":"charles_freeman","post":"Well,Colin. I do have the Boy Scout badge in Philately, won when I was twelve. How did you guess?.","date":"2015-05-06","mins":"4:36 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198511","author":"charles_freeman","post":"I think we can safely rule out ‘copy’. Someone please tell Ian Wilson so that he can revise his text for any new edition of the Shroud. This should go along with his correction of the illustration of tetradiplon as you cannot translate it as’doubled in four’ alongside an illustration showing it doubled to make eight ( alas a mistake repeated in the video that Barrine has just posted). Better leave out the tetradiplon issue altogether as it only refers to the cloth BEFORE Christ wiped his face with it and there is no indication in the text that it was refolded as such afterwards. Having ploughed my way through 150 examples of Greek words where tetra was added, the most likely translation is doubled four times which is exactly the way they folded the Parthenon cloth as seen in the Parthenon frieze in The British Museum. But that would cut through the face of the Man on the Shroud and so would destroy Wilson’s argument. Better just to edit all this out to save Wilson further loss of credibility among the Byzantine experts..","date":"2015-05-07","mins":"1:57 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198526","author":"charles_freeman","post":"Thomas. Quite frankly they cannot be bothered as none of them think that it is remotely important in comparison to other artefacts that they deal with and none of them that I have had contact with consider that the Shroud is pre medieval anyway. Sampath there does not have to be an order in which we get rid of hypotheses. You only have to compare the illustration of Wilson’s tetradiplon cloth with any possible translation of tetradiplon to see that while a cloth folded double four times is a possible translation (and backed by the visual evidence of the Parthenon cloth) and so is a cloth doubled (twice) to make four sections is another , but less likely, possible translation, Wilson shows a cloth doubled three times but labels it as a cloth doubled in four which cannot possibly fit with the illustration as his makes up eight! This kind of thing should be simple to sort out because it is so obviously wrong. The painting issue is much more difficult to disprove as we have the 1449 description of the Shroud being painted to put alongside the 1389 text and we have lots of depictions which show the images much more powerful than they are now and it is hard to know any other way of producing such strong images other than paint as documented in the medieval manuals. We also know that painted surfaces on linens disintegrated very easily and so the question, which I leave to experts in conservation of textiles to sort out, is what is left on the linen when the pigments fall off a painted cloth after many centuries. This is the key question to focus on. The solution to the so called mystery of the Shroud will eventually be sorted out with an up to date examination of the surface of the Shroud again so let’s all push for that. Meanwhile my own work involves trying to put out articles which will arouse debate on the Shroud with the hope of at least getting some specialists involved on matters such as the weave and the iconography of the images..","date":"2015-05-07","mins":"5:08 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198549","author":"charles_freeman","post":"Out of the natural kindness of my heart, I shall recommend that Colin reads Spike Bucklow’s The Alchemy of Paint, Art, Science and Secrets from the Middle Ages. It might give him some ideas with which to launch his new attempt to recreate an image on discoloured linens..","date":"2015-05-07","mins":"12:47 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198550","author":"charles_freeman","post":"I believe Belting thought is was a later copy but the iconography of the Shroud with its bloodstains is all wrong for Byzantine imagery which doesn’t do blood...","date":"2015-05-07","mins":"12:49 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198560","author":"charles_freeman","post":"I still don’t understand how even if you recreate an image today, you can be sure that it will exist in the same chemical state in seven hundred years time. The issue for recreating the Shroud, and it is a challenging one, is working out how it looked seven hundred( or some would argue even more) years ago. That is what you have to recreate,not how the Shroud looks today when the linen will inevitably have degraded somewhat from its original state. As I am not a scientist, rather a comedian, tour guide, etc,etc, – you can find my biog under Charles Freeman, Yale University Press – I would like an explanation of how linen and discolourations on it can remain in the same chemical state over hundreds of years. This seems to be the assumption by all Shroud researchers but they never explain why this should be the case. It seems an obvious question to a historian who deals with the problems of understanding ancient objects on a daily basis and seldom, unless they are in gold or similar materials, have existed unchanged..","date":"2015-05-07","mins":"2:38 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198586","author":"charles_freeman","post":"Colin, I still think you need to do some work on medieval craftsmen’s techniques and the mass of work on painted linens before you spend more money on flour and nitrates. I have recommended you a book to get started with. If you were examining how the Mona Lisa was painted would you get started without reading anything about painting of the era? You would not have any credibility and would simply be laughed at. you take the same risk here but perhaps you are quite happy with that. I am happy to wait around until at last we get some specialists involved. They are there and the focus must be on getting the Shroud and medievalists of various disciplines together as was done in 1973. I think the dating of Noemi Gabrielli, originally Director of the Art Galleries of the Piedmont, was, iconographically, a century too late but she did examine the Shroud close up as an art historian and considered that the images were ‘drawn by the artist directly onto a wet cloth stretched on a frame, using a compound of sepia coloured clay and yellow ochre diluted in a resinous liquid’ and she goes on toe describe the technique. Since then there has been an immense amount of work done on painted linens of which she would not have been aware but it is high time it was exploited. Disregard it if you want. I am happy to debate here but my focus is on a completely different sort of specialists, those who actually know something about what paint has or has not done to medieval linens seven hundred years on. They may end up rubbishing me but at least we might break the log jam of stagnation in Shroud studies..","date":"2015-05-08","mins":"4:12 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198648","author":"charles_freeman","post":"The Besancon Shroud is quite clearly not a copy of the Shroud of Turin. End of story..","date":"2015-05-08","mins":"2:02 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198246","author":"charles_freeman","post":"Colin, Have you any idea as to why anyone would want to carry this bizarre operation? I think you are still hooked on the idea that the images today are the same as the images were when they were created and that the Shroud was somehow unique in its own day rather than today’s ( almost) lone survivor of the hundreds of thousands of painted linens of its own day. The answer is only going to come from a new intensive examination of the surface of the Shroud. Flury Lemberg got as far as ruling out the reweaving hypothesis, I wish they had gone further in 2002. But pope Francis, if you are reading this, why not give the go ahead for a top Italian textile conservation lab to examine the Shroud? The expertise in medieval ( or earlier) textiles is out there and the technology is many times more sophisticated than anything available in 1978 or even 2002..","date":"2015-05-04","mins":"1:24 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198251","author":"charles_freeman","post":"There is nothing here that is incompatible with a linen painted according to the usual medieval craft traditions but, like many other such relics, passed off as something else. The difference is that it was quickly spotted as a scam by ‘responsible people ‘ who urged the bishop to act and dealt with. Eventually a compromise position was adopted ( in 1390 by Clement VII) that this cloth had some spiritual significance – probably there had been some alleged miracles or visions associated with it that allowed Clement to g Ive it indulgence status but reaffirming that it could not be the real thing. There were thousands of spiritual objects, etc, that had this status. Theologians made the point that remains relevant today that no gospel mentions images. Personally I think this rules out a forgery as any forger would have known that this obvious response to an imaged cloth would have proved fatal to his attempted deceit. I think there is a good case for the Vatican to follow within this tradition. I think that if there had been anything unusual about the Shroud’s images these would have been mentioned. This report suggests that it was a run of the mill linen painting job..","date":"2015-05-04","mins":"2:51 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198259","author":"charles_freeman","post":"I am not sure what your point is, Colin. If you want to make these ad hominen attacks you need to substantiate them, especially as the original texts are in Latin and/or medieval French. I am sure that those who read my full article will make up their minds on it, thought sadly we have not been able to afford the copyright costs of the illustrations I need to give it its full impact. The point is that the major documents talk of an artist not an alchemist and words such as ‘depinxerat’ from ‘depingo’, I paint’, in the Latin original are used. Remember we also have the 1449 description of the Shroud by the Benedictine monk in Liege who describes it as ‘miro artificio depicta’, ‘admirably painted’, again using the verb depingo. So let’s apply Occam’s Razor here and assume that the word depingo is used in its normal sense of ‘to paint’. You can put away the flour and the chemicals and enjoy the spring May holiday! I am quite worried that you might suffocate yourself with the potions you are concocting..","date":"2015-05-04","mins":"4:51 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198264","author":"charles_freeman","post":"I have the original Latin text with me and my 2,000 page, three columns a page Lewis and Short Latin dictionary to help me out when i am stuck! In the 1350s, after the trauma of the Black Death, we know that there many false cults that sprang up in the emotional chaos that followed. One can imagine the same thing happening in an African village where half the population had died of Ebola. It was a very unusual period. The important thing is how quickly ‘responsible people’ spotted the scam and reported it to the bishop who makes it quite clear that he thought the Shroud was painted. Do you think he never tracked down the painter?.","date":"2015-05-04","mins":"5:22 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198248","author":"charles_freeman","post":"P.S. Surely your biggest problem,Colin, is that once you have found the right chemical formula for the original creation of the image in whenever, you have also to be sure that it will remain stable for the next several hundred years so that it matches what we have today. I am playing safe with my discoloured after the pigments have fallen off linen hypothesis. At least I don’t have to go out and order more medieval flour..","date":"2015-05-04","mins":"1:50 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198263","author":"charles_freeman","post":"Hugh, I think the distinction here is between an object deliberately created to deceive pilgrims into thinking it was the real grave cloth and an object representing the rising of Christ which no one would originally have considered to be authentic ( a view confirmed for the Shroud by Clement VII). If you imagine what a medieval church, with no artificial lighting, would have been like in the early Easter morning light (when we know the Quem Queritis ceremony took place), then the idea of putting dramatic pictures on a cloth makes some sense. In my article I quote a French Bible dictionary of 1912 which specifically mentions that the Easter cloths were painted on. I am cautious about using such a late source but there are also the early Mozarbic rites for Easter that describe how ‘Peter ran with John to the tomb and saw the recent imprints of the dead and risen man on the linens’. This certainly suggests that linens with images on them were associated with the Easter rituals. What often happened, and I have come across many documented examples, is that an object that no one believed for a moment to be authentic, suddenly achieved a status by becoming associated with a miracle. So at Prato, there was a perfectly ordinary fresco of the Virgin and Child. An eight year old boy reported that the Virgin had come down from the picture, dumped the baby Jesus on the ground, gone into the local prison, cleaned it out, came back, picked up the babe and popped back into the fresco. He was believed and there is a lovely Greek cross church on the site and if you go in the original fresco is in a prominent place on the altar. I suspect that some such happened with the Shroud but the problem is when. As all too often with the Shroud, real rseearch on these issues has hardly begun..","date":"2015-05-04","mins":"5:14 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198274","author":"charles_freeman","post":"Historians are often much more interested in documents that have not been sent on the grounds that they have not been ‘spun’ before sending and thus more likely to reflect what the writer actually believed. So if the d’Arcis memorandum was never sent this might be a point in favour of its fundamental accuracy. Hard to see why it should not be accurate. Clement VII must have got his view that the Shroud was not authentic from somewhere so if not the D’Arcis Memorandum perhaps there are lost documents usually the case sadly. I rather like the status of ‘pop historian’ (quote C.Berry) might give me some credibility with my children. But there i was wishing Colin well when I am afraid he might poison himself with his alchemy or frighten off his pets with his flour whitened face and all i get in return is unsubstantiated attacks on my professionalism!!.","date":"2015-05-04","mins":"7:03 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198286","author":"charles_freeman","post":"No, Nabber that was not the Shroud – it was the Image of Edessa, something quite different..","date":"2015-05-04","mins":"8:47 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198295","author":"charles_freeman","post":"Having worked for some time on relic cults, it is impossible to predict which ones fall and which ones rise. Some relics of the blood of Christ had enormous success, others failed to attract anyone. Why was the piece of the True Cross I was shown in Lucca some weeks ago have hardly any followers while just down the road in the cathedral, the Volto Santo – the holy face of Christ on a wooden cross – has an enormous following. The ‘not made by human hands’ relics are often linked to the campaign to show that Christ wished to be shown in images..","date":"2015-05-04","mins":"10:59 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198335","author":"charles_freeman","post":"Markwardt’s paper makes the,to me, fatal mistake of assuming that if the D’Arcis memorandum was not sent, then it was all lies. In fact, if it were not sent, it is more likely to be a true representation of what happened. With such a major misconception I dislike the insinuations that Markwardt makes about Chevalier’s character. They are unwarranted. Lewis and Short do not mention that ‘depingo’ can be translated as ‘copy’ and it is certainly the fullest Latin dictionary i know and is my mainstay in such things. I have the copy belonging to my great uncle Kenneth Freeman who was Senior Classic at Cambridge so I assumed he had only the best! We have the 1449 reference to painting (‘depicta’) as well. I have repeatedly said that the Shroud surface needs to be examined with the latest technology by experts who are used to dealing with ancient linens, painted and otherwise. None were on the STURP team, as their failure to recognise that an image just on the surface of the cloth was just what the medieval craftsmen’s manuals advised ( in order to let painted flags flutter in the breeze). I am happy to rely on the findings of specialists. I suspect that the so called negative image is the result of the different thicknesses of the original paint/pigments before they disintegrated but I await the expert examination. The important thing will be to focus on the hypothesis to rule it in or out (as the Oxford lab helpfully did for John Jackson’s carbon monoxide affecting the dating hypothesis which they ruled out). Even if the images on the Shroud remain unexplained ,there is no logical reason why this makes the Shroud authentic. It just makes it one of thousands of objects in a similar state waiting for science to advance enough to provide an explanation for them.. I await a single piece of scientific evidence that is replicable and so acceptable to the scientific community as a whole that the Shroud dates to before well I was going to say AD 50 but I shall be generous and say AD1000 as that would take it into a different context from that of the medieval period which is where my own ( limited) investigations are focussed..","date":"2015-05-05","mins":"4:29 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198350","author":"charles_freeman","post":"There is no harm in your continuing your work to the nth model, Colin, but what is the rush? Neither of us have any specific expertise in ancient or medieval textiles, neither of us have worked in a laboratory that specialises in the conservation of such things so what we can say is,as you say, limited. Better to get it right through specialist help rather than waste time following up false paths. The focus should be on getting these specialists to take an interest and the pope to support them..","date":"2015-05-05","mins":"6:50 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198342","author":"charles_freeman","post":"I totally agree with you, Colin. I don’t know half of it, perhaps even less (although I think a lot of the limited amount I know may be quite relevant), which is why I am happy to leave it to specialists in ancient painted linens to decide when,if ever, there is a new examination of the surface of the Shroud. I am not going to plough back into your extended posts especially as you keep changing your mind and starting again, but I think ‘bizarre’ is a fair summary of your attempts at recreating medieval alchemy. They seem unnecessarily complicated especially as there is no reason to suggest that the original creation of the Shroud was out of the ordinary within the context of its own day. The tetradiplon issue was important for two reasons. First, Wilson gave a misleading summary of the text he was relying on by implying that the cloth had been folded tetradiplon AFTER Christ had wiped his face on it while the text clearly says that it was folded tetradiplon BEFORE it was handed to Christ with no evidence that it refolded as such afterwards. Secondly, we have the interesting depiction of the cloth used in the Parthenon ceremonies, that went on into the fourth century AD, that shows that the cloth there was indeed folded double four times. Again Wilson gives a misleading illustration that shows only three double foldings if he had the fourth it would have cut through the face and ruined his argument! I think it is best to leave it at that and not discuss further why Wilson made these apparently elementary errors.I don’t have Jack Markwardt’s killer instinct in these matters!.","date":"2015-05-05","mins":"6:06 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198395","author":"charles_freeman","post":"I am sorry, Colin, but i have obviously missed your references to ancient textiles that you have worked on. Thats the trouble with your writing such long posts one misses the important points..","date":"2015-05-05","mins":"12:10 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198406","author":"charles_freeman","post":"Certainly older but may be as late as the twelfth century although there are similar columned lists like this which go back to the ninth century and perhaps, Rabbala Gospels, ,even earlier. No obvious comparison with a linen painting ,of course so this is not a very good attempt to prove your case..","date":"2015-05-05","mins":"2:03 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198405","author":"charles_freeman","post":"Painted linens were very vulnerable as the pigments were only just on the surface of the cloth which is why we have so few left. The Shroud received a lot of rough treatment as it was folded, unfolded and refolded many times especially In the seventeenth century. In fact it was remarkable in that the pigments seem to have lasted until the nineteenth century. A lithograph of 1868 shows that by then one of the images seems to have disintegrated and it was just this exposition that saw the Shroud placed in a frame for the first time. This illustration looks as if it is five hundred years earlier and it will probably have survived because it will have been kept out of the lights and have a vellum base but I can’t say more than that. It certainly will have a better base than linen and won’t have been folded. It will have been kept shut up for much of its life. The linens that have survived with their images intact have usually been pasted onto wooden backing. I did an adult course at Cambridge University on medieval illustrated manuscripts and there are wonderful ones surviving from as early as the fifth century because they have been kept out of the light. No such luck for the Shroud..","date":"2015-05-05","mins":"1:46 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198357","author":"charles_freeman","post":"‘Ian Wilson has also asserted that it may mean to copy’ , Well, that settles it then we don’t need a Lewis and Short to guide us. Wilson admitted to Averial Cameron, the great Byzantine expert, that he did not know any Byzantine Greek ( despite his authoritative interpretations of documents in Greek) but perhaps his Latin is better..","date":"2015-05-05","mins":"7:22 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198399","author":"charles_freeman","post":"I do hope that Dave B has a better source for his translation of depingere than Ian Wilson who is not a classicist. Perhaps Dave B can tell us where he did get the idea that depingere means to copy as no one else seems to be able to find one. Having told us (The Shroud, 2010,p.145) that depingere can mean ‘to copy’, Wilson goes on to translate the passage as ‘the truth being attested by an artist who had copied it’ which seems special pleading to me unless we have some academic support for depingere meaning to copy. And as yet we haven’t. I hope that it is not just an invention by Wilson. I do find the way people follow anything Wilson says like sheep really extraordinary. It has completely closed down research into other links between Jerusalem and western Europe/Constantinople that provide much more promising routes to the west for the Shroud if it does prove to be authentic..","date":"2015-05-05","mins":"12:45 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-166170","author":"charles_freeman","post":"This is not a commentary on my History Today article but a completely different article i wrote some time ago! The History Today article is online but regrettably without the full set of illustrations that show how the blood stains on the Shroud echo those of the fourteenth century iconography – on the Holkham Bible Christ for instance. To see the illustrations you have to buy the print version and it may not be easily available outside the UK. It was apparently too expensive to get picture rights to show them online throughout the world. I am not suggesting in my History Today article that the Shroud of Turin was a run of the mill relic. Bearing in mind that the only information anyone would have had on the burial cloth of Jesus is what they would have read in the gospels (lintemina, sudarium), no medieval forger would ever have produced single cloth with images on it and hoped to have deceived anyone at all. No, it was clearly produced for some other purpose and I suggest that the Easter Quem Queritis ceremony is the most likely original context for it. So far the experts on medieval drama at Cambridge I have consulted think i may well be right but I am getting them to ask around other specialists. It is as this specialist level that my article will stand or fall, not on the Shroud Story website. The grant of an indulgence by Clement VII suggests that the cloth became associated with miracles. We have hundreds of recorded examples of artefacts that were clearly not relics,and no one believed them to be, but which still had spiritual significance. My own guess is that Jeanne de Charny (an Italian professor has been in touch already to say I should actually refer to her as Jeanne de Vergy) was responsible for converting what was an object of spiritual status into a relic. She was quickly slapped down and to avoid any ‘fraud’ her son was told he could not expose it again without explicitly saying that it was NOT the real thing. The Dukes of Savoy were able to get away with it more easily. I think it is exciting that we have what appears to be the only surviving example of a cloth associated with the most joyous ceremonies of all, those held at Easter, and I am completely perplexed by those who appear to be arguing that there is anything anti Christian in my approach! Still, most of my discussions are with academics in the fields covered because, at the risk of repeating myself, it will be here that the issue will be decided. The feedback so far has been very positive. ‘Game,set and match’ was the response to me of one Oxford Professor of church history..","date":"2014-10-28","mins":"7:59 am","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article"},{"id":"comment-170118","author":"charles_freeman","post":"And there is no reason why you should NEED to reproduce a decayed image. Suppose you lost your wallet out on a hike and found it ten years later, you would remember what it once looked like but probably the papers in it would have decayed, the photos faded, the leather decayed. So the issue of reproducing as it was found would be a non starter as it would be unlikely that you would have an original to start with and then recreate all the accidents of the period at it was lost over the ten years to come up with anything like the wallet as you found it. There would be no scientific record of all the events it encountered. The Shroud is surely similar , unless you really do believe that it has remained chemically constant throughout several hundred years ( unbelievable I would have thought). You would know that you could never recreate the effects of time and rain and unfoldings ,etc, etc, to reach what you have now. What you can do, and I am hoping to do, is to find other faded cloths I already have two in my article that you can compare with the Shroud. The problem is that in medieval times we know they were often thrown away( as we have documentary evidence saying that a new banner needed to be made because the old one was worn out) and museums will hardly have on display faded cloths! But this surely this is the best way forward.what remains on the Shroud today is unreliable evidence of what there once was. Now I think I can take a break!.","date":"2014-11-09","mins":"11:04 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-170133","author":"charles_freeman","post":"You have a cloth that originally had images on the outer fibrils (STURP finding but in line with medieval manuals), the images have faded ( hardly surprisingly after a minimum of seven hundred years) and you then make a photographic negative of what is left today. No wonder you end up with something that looks rather mysterious! How you follow on from that to suggest that this is the burial cloth of Christ defeats my(obviously very limited) understanding! Am I right in saying that STURP assumed that the Shroud has remained chemically constant for perhaps two thousand years. Do they state that clearly and give their reasons for so believing (I can’t remember the point being made explicitly but it seems to be assumed)? If, against what one would assume, there has indeed been no chemical change between then and now. I think you have converted me. However,I do need to see the evidence not only of the lack of chemical change but of how the Shroud survived for so long without any part of it decaying. Ian hard to,convince because of the many descriptions of the images being so much stronger than they are now..","date":"2014-11-09","mins":"1:07 pm","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-170149","author":"charles_freeman","post":"Thomas. – start with the five descriptions I give in my article of the predominance of the bloodstains, 1449, 1474, 1503, 1517, 1534. Then there is another that David Mo has added in previous posts. Is that enough for you to be getting on with?.","date":"2014-11-09","mins":"2:07 pm","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-170096","author":"charles_freeman","post":"I can’t see anything in the photographic negatives that I could not see in negatives when I was being taught how to develop my own photos as a schoolboy in the fifties. They were equally haunting. The Shroud image is of a man as if he was standing, There is no other way of explaining how the hair hangs down. The artist has transferred the chest wound over to the other side but not much else. He has copied the trend by providing all over all flagellation marks, that first appear in medieval art c. 1300. As Van Eyck shows, medical artist were capable of imagining alternative ways of looking at images although the Shroud is pretty crude by the standards of the great artists of this period. It has even been suggested to me that he may have been copying off a model template, In a year’s time I shall gather all the supportive academic comments by specialists and we can judge my article. Really it is much too early to make a snap judgement but I am quite confident from what feedback I have had. Too early to start deriding me, I think. But a start would be to provide evidence to date the Shroud firmly to before AD 33. I cannot see how the Shroudies are going to be taken seriously until they have..","date":"2014-11-09","mins":"9:44 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-170101","author":"charles_freeman","post":"The painting. If you read up on painting on medieval l Inens you will realise the amazing sophistication of some of the artists, several pigments mixed with each other and then painted layer on layer. The Shroud is very primitive in comparison probably only two pigments in all. No evidence that the colours were revered. T He descriptions we have suggest that the emphasis was on bloodstains at least this is what people noticed. As vermilion was the normal,pigment used on these linens for bloodstains, this would be the first pigment to expect to find..","date":"2014-11-09","mins":"10:07 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-170298","author":"charles_freeman","post":"Yes, you START with the bloodstains that make the point that the Shroud looked very differently in the fifteenth and sixteenth centuries from what it does today. It seems important to stress this as there are still people who argue that the Shroud is chemically unchanged from seven hundred, even two thousand years ago,. You then GO ON to look at the depictions of expositions. I use the Tempesta 1613 engraving as my first example, partly because we know from his meticulous view of Rome in 1593 that he was very accurate and partly because he was resident for some time in the royal court in Turin and it seems clear that he saw the Shroud on several occasions. It is not just the images are much stronger (as they need to be if you are going to get crowds to come and see the expositions ( now with the faded cloth you have to get up close to see anything)) , it is that you can see features you can no longer see, the Crown of Thorns on front and back of the head, the long hair at the back, the gap between the elbows and the body of the back image( showing that the crossed hands are impossible if this is the same body) , the loincloth ( after 1578). As I then note this is only one of perhaps fifty depictions of expositions. As they are made by different artists at different times , largely between 1578 and 1750 when – probably because the images were beginning to fade so large scale expositions are not so impressive they diminish in number. You then need to work on a data base. For instance from the Royal Savoy catalogue depictions of 1998, I have taken thirty photocopies and every one shows the loincloth in place and it seems to be the same loincloth recorded by different artists. A lot of the depictions show thumbs on the hands. As I argue in my article and would repeat here, we desperately need to do what should have been done years ago and create a data base of all the depictions so that we can confirm what features there were one on the Shroud but which now can no longer be seen. What is without doubt is that the images were stronger, they contained features no longer there, and that the bloodstains were in the fifteenth and sixteenth centuries the features that stood out. N.B. Contributors here have talked of paint flaking off. No, these were medieval ground pigments and they would have been in small particles. This is why the disintegration of the paint would have been very different from modern oil based paint that, as we all know, does tend to flake off. No one can possibly say that I don’t put out my arguments clearly and that I concentrate on hard evidence. But as my article says all I need to say( although you need the print edition of History Today to see how the flow of blood on the Shroud matches the Holkham Bible) and I have now provided the footnotes at charlesfreemanuk.tumblr.com, I think I can leave everyone , on this site and on others to get on with it! No one has any excuses for not knowing what my arguments are so I do not need to repeat them further. Phew! (Well unless Dan wants to keep things going through further postings but I have done my best to respond to everything he has posted ( and that is my privilege) and I don’t think he can expect anything more the article and the footnotes are there for all to see!).","date":"2014-11-10","mins":"2:31 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-170339","author":"charles_freeman","post":"Just above you,Thomas , at 2.31 am! I have given two weeks to monitoring and responding to objections to my article on this site but as it is there online for all to read I shall leave it at that. At the risk of being repetitive, whether my article succeeds or not will not be decided on this website but I hope I have shown that I am ready to debate with all comers in a civilized manner. I certainly feel I have put in points that have never been discussed before e.g. Did STURP assume that the Shroud was exactly the same when they examined as it had been seven hundred years or perhaps even two thousand years ago. That is one for them to reply to..","date":"2014-11-10","mins":"5:40 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-170403","author":"charles_freeman","post":"I am busy with my next project but could not resist the following from a book I am reviewing ‘Rendez Vous with Art ‘ where Philippe de Montebello, director of the Metropolitan Museum of Art for thirty one years, remarks ( p. 156): ‘Every work of art of some age that we look at has changed. . . Sadly the world’s artistic heritage is no more immune than anything else to the inevitable deterioration of matter.’ Something to reflect on. (N.B. I am always amazed to find aficionados of the Shroud who have not got a copy of Beldon Scott’s book on the Shroud on their shelves. There are lots of illustrations showing the images on the Shroud as much stronger than they are now but perhaps the most interesting is one showing the exposition of 1868, the last before 1898, on page 296. The Shroud is exposed, now no longer outside in the Piazza but in the Cathedral. The dorsal image is still clear and relatively strong. The frontal image is faded from the waist down. Have a look for yourself. It was this image that prompted me to speculate that the real deterioration of the Shroud took place in the nineteenth century.).","date":"2014-11-10","mins":"10:07 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-170423","author":"charles_freeman","post":"Well yes, because I think they are essentially a myth that only Shroudies seem to be able to see. Of course, a negative photo of a cloth with decayed images on It is going to come out all mysterious. You don’t reason from that that it is the authentic burial shroud of Christ. You get on with the job, that is central to the work of every archaeologist and art historian, ‘ how did this look when it was first created?’This is my focus and I have put forward some answers. But I really, must get on with other things. You have so much material from me to work from!.","date":"2014-11-10","mins":"11:56 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-170109","author":"charles_freeman","post":"I think this negative issue is a false issue, not being seen as a problem by anyone other than the Shroudies. Photographic negatives always look haunting, at least mine did. I have given two examples in my article of similar faded images. Why are the images of a head of a man standing up? That is not a mystery If the artist was copying similar images, of which there are thousands of a bearded Christ and many fourteenth century exampleswith the blood trickling down( as in the Holkham Bible images and the Roettgen Pieta). It is a real problem if you think this image comes from a man lying down insurmountable in fact. Then there is the mismatch of the arms of the back and front images. The artist needed to get so something functional to use in the liturgy and other than transferring the wound from one side to the other he could hardly have been said to have taken much trouble. As someone has recently said to me, the artist would never have imagined that the faded remnants of his painting would cause so much fuss!.","date":"2014-11-09","mins":"10:29 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-197609","author":"charles_freeman","post":"So, assuming that they have not lost or destroyed their precious tapes, why have STURP never had their tests replicated? They cannot expect to be taken seriously as experts if they do not..","date":"2015-04-26","mins":"12:07 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197523","author":"charles_freeman","post":"The Campo Santo in Pisa is a burial ground made up entirely of earth brought from the Holy Land in the Middle Ages. The way that the pollen on the Shroud is distributed in ine place suggests that it may too have been brought in from the outside at some point. So John Green’s point is very relevant. I am in Mantua, in a flat overlooking Sant’Andrea where they have vessels contesting the blood of Christ collected from the ground under the Cross. The veneration takes place every year with great ceremony and processions. That is one thing I love about Italy: wherever I am there is some relic claimed to be from the Passion or the life of the Virgin Mary that is still venerated. The interesting thing is why the Shroud has a following outside Italy when most of the other ‘authentic’ relics do not..","date":"2015-04-25","mins":"9:10 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-192097","author":"charles_freeman","post":"There are hundreds of relics first attested in the fourth and fifth centuries as this was the first period in which relics were considered to be a theologically acceptable way of worshipping God/ Christ. However, three hundred years after the Crucifixion , there is little evidence that any are actually genuine which was why I told the CNN crowd that if they did radiocarbon date an early fragment of the Cross to the first century to please let me know so that I could rewrite my first chapters of Holy Bones. Despite many documented accounts of specific Holy Land relics, no mainstream scholar specialising in ancient artefacts or early relic legends knows of any that are genuine. I have never heard anything but ridicule of Thiede from established scholars. Certainly his book on the titulus, which I have seen in Rome, was totally unconvincing and the carbon date reflects an age when many ancient objects were given relic status. I am in Lucca at the moment and again the Volto Santo, believed to have been carved by Nicodemus,has again come up medieval, as have other apparent relics that have been carbon dated. This does not mean ,of course, that they were designed as fakes, though some were, the majority was objects of lost origin which became associated with miracles or visions and so got their relic status that way. Common were stories of them travelling from the Holy Land, as the Volto Santo did In a boat without any oars! Actually the people of Lucca know that is it is medieval but this does not stop them having a wonderful feast day in September in which it is paraded through the streets. In the end whether a relic is authentic or not matters little in Italy so long as the festivals associated with it keep going!.","date":"2015-03-01","mins":"9:11 am","url":"https://shroudstory.com/2015/02/28/hints-about-shroud-of-turin-episode-in-cnn-series/","cat":"press_coverage","title":"Hints About Shroud of Turin Episode in CNN Series"},{"id":"comment-192117","author":"charles_freeman","post":"Yes Daveb, I have read all these early accounts and they were convinced that if they found a manger in Bethlehem that it was the real thing. But that does not mean that it was. The start of relic cults is three hundred years on covering a time when almost no attention was paid to relics so there was no reason to preserve them. It needs a particular mind set to preserve relics which is why they are not part of many Christian traditions. Meanwhile only accept as genuine those relics that can be dated to the first century and have some other evidence to link them to the life of Christ. I don’t know of any but I was hoping that the CNN programmes might come up,with some. But if they have I shall be annoyed if they have not let me know their researcher did promise!.","date":"2015-03-01","mins":"3:38 pm","url":"https://shroudstory.com/2015/02/28/hints-about-shroud-of-turin-episode-in-cnn-series/","cat":"press_coverage","title":"Hints About Shroud of Turin Episode in CNN Series"},{"id":"comment-192824","author":"charles_freeman","post":"It is all there in my Holy Bones as I take the reader through the various phases. It is the fourth century that you first get sustained Christian relic cults, the deliberate use of relics as a means of accessing heaven through an object, using them as a talisman for good fortune ( e.g. Constantine using a nail from the Cross on his horse’s bridle) or using relics as mechanisms through which healing or the expulsion of demons ,etc, were effected. This is a much more sophisticated level than just preserving things and you get the first sustained theological arguments for the veneration of relics in the fourth century. The Wikipedia article, although pretty elementary, does mention the important figures in elevating relic cults such as Ambrose and Augustine. There were certainly memories of where some martyrs were buried but there was no systematic use of the actual dug up bones being used as spiritual forces before the fourth century. Ambrose of Milan’s opportune discovery of the bones of Gervasius and Protasius in the 380s when he used them as a means of boosting his own reputation is one of the best known early examples and his transfer of some dust from them to Rouen one of the earliest examples of a translatio the placing of a relic in an above ground shrine where it could be openly venerated. By 400 the emphasis was on public display, carrying relics in processions, having them in shrines,etc. No need for secrecy, in fact the opposite. There is no point in having a relic if you hide it away from veneration. Of course, in many cases the relics are new or are old bones ,etc, that are assumed to be genuine. So there are lots of stories of discoveries .e.g the bones of the martyr Stephen in Jerusalem in 415. No reason at all to think that they were the real thing and until any of these are actually dated to the first century or have some definite evidence of provenance then I am sceptical. There was just too great an incentive to produce a relic which was claimed to be authentic. So far, but we are waiting on CNN, not a single relic has been proved to be first century. No need to answer the rants of OK..","date":"2015-03-08","mins":"3:47 pm","url":"https://shroudstory.com/2015/02/28/hints-about-shroud-of-turin-episode-in-cnn-series/","cat":"press_coverage","title":"Hints About Shroud of Turin Episode in CNN Series"},{"id":"comment-167865","author":"charles_freeman","post":"And Christ is always depicted in Byzantine iconography as wrapped in bands I saw a wonderful example just a couple of weeks ago in the Greek monastery of Hosios Loukas. If the Shroud has been as influential as Wilson et.al. Suggest as a source for iconography they would not have gone on showing Christ wrapped in bands..","date":"2014-11-02","mins":"5:18 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-194755","author":"charles_freeman","post":"Perhaps it is simply a question of finding a sample of human blood of a similar redness and working from there. So far no forensic expert I have asked has ever seen dried human blood this red..","date":"2015-03-29","mins":"12:12 am","url":"https://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/","cat":"article","title":"Is Bilirubin Still Accepted as an Explanation for the Red Blood?"},{"id":"comment-166184","author":"charles_freeman","post":"Max, I don’t know whether you have read my History today article I am beginning to wonder whether anyone has other than High, I think!! No problem about herringbone it goes back millennia it is the combination of herringbone and three in one that seems unknown. I talked to an authority of ancient weaving and they gave me the only examples they knew about – in wool and silk but not in linen. So just referring to herringbone is a red herring here! In my article, I simply made the point that, as we had an example of three in one linen in the V and A that has been dated to the fourteenth century, that weave was known in the fourteenth century and so it merely makes the point that cloths similar to the Shroud three in one herrngbone were being woven at the same date. Circumstantial evidence. Not offered by me as anything more..","date":"2014-10-28","mins":"8:56 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-166255","author":"charles_freeman","post":"Stephen Jones did miss out on my employment by the KGB..","date":"2014-10-28","mins":"2:21 pm","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-166266","author":"charles_freeman","post":"Maybe but I don’t know how to fix radio carbon laboratories’ computer programmes so I will not be much use to them. But I was working in Oxford in 1988 so there is a smoking gun there..","date":"2014-10-28","mins":"3:35 pm","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-166137","author":"charles_freeman","post":"John Tyrer does not seem to be aware of the extensive import of cotton into Europe after 1200 and the fact that cotton and flax were often spun and woven in the same environment (as Gilbert Raes pointed out). If the Shroud was being produced specifically for the Quem Queritis ceremony, as I argue, then it would have to be in linen to match the gospel accounts but,of course, fibres of cotton ( and no more than fibres have ever been found on the Shroud), may have drifted in, either when the yarn was being spun or when the weaving was being done. That fits well with the cotton evidence that has never been more than a tiny percentage of the Shroud.. Tyrer does not also seem to be aware that while three in one SILK damasks are known from the third century ( and one expert has suggested to me that there may have been some three in one WOOL tunics from the second century) the only linen three in one known to exist other than the Shroud is the fragments in the Victoria and Albert Museum dated to the fourteenth century from the pattern printed on them. ( The whole question of whether a pattern was printed on the Shroud as it is on the V and A samples with the ‘blood’ added separately for the Shroud is another avenue that needs research. One of my V and A contacts has told me how I can get access to these fragments but it involves going through all kinds of security and, in any case, I would need a medieval textile/ medieval patterning on cloth specialist to come with me so as not to waste the visit.) BTW, I took time out from lecturing in Istanbul to see what was happening in the Blachernae district. While the Church of St.Mary, where de Clari saw an imaged cloth, is now completely nineteenth century, the nearby palace is being restored as a conference centre and it looks as it if it will be a great venue right up there on the fifth century walls. I think there is one Shroudie who mixes up the palace chapel with the church. I can assure whoever it was that they are completely separate buildings. As for our friend Stephen Jones, well they say all publicity is good publicity. It has caused much hilarity among people who have worked with me on academic issues over the years.My son has sent me his latest job appraisal from the States ( very positive), I sent him back my latest one from Australia!.","date":"2014-10-28","mins":"5:29 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-191065","author":"charles_freeman","post":"Can we have the reference please for,the Z twist of the Gibson Shroud? There are indeed a few, a very few, Z twists among the Masada fragments ( always fragments from this climate in the first century) – the vast majority are S twists and the excavators suggest that the Z twists were imports worn by Roman soldiers – I would be interested to have it confirmed that the Gibson Shroud is also a Z twist..","date":"2015-02-14","mins":"5:27 pm","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-191089","author":"charles_freeman","post":"I have never said there was no Z twist in Palestine the Masada evidence shows that were some Z twists but they were in a small minority and the excavators concluded that they were imports, the native weaves being S Twists..","date":"2015-02-15","mins":"2:07 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-191094","author":"charles_freeman","post":"I am glad to see that Daveb realises that cotton contamination is ‘ minor and readily explicable’. Good to have something we can agree on after all the Oxford lab identified only one cotton fibre in their sample which they were able to remove before the radio carbon testing. Rogers was misleading in suggesting that there was more than minor contamination , even a reweaving with cotton threads, especially if he was extrapolating his conclusions to the sample of the Shroud actually tested by Oxford. Gilbert Raes gave the good explanation that cotton and flax were often woven and spun in the same workshops and this would explain the presence of fibres. After 1200 there were massive imports of raw cotton to Italy and ,through Marseilles, to other parts of Europe, and so the presence of cotton fibres in some of the skeins of yarn, not necessarily all, depending on where the spinning of each skein took place, suggests a medieval date for the drifting in of the fibres. The Cave of the Warrior textiles were woven on ground looms and one of the other textiles found there came from Egypt. At the most we can say the Shroud,if first century, must have been woven on a ground loom, which suggests Egyptian or possibly nomadic Bedouin manufacture but then you can’t explain why the yarn was not spun in the native way with a S twist. The combination of a ground loom, a three in one herringbone and a Z twist is beyond any probability. When the Shroud could easily have been woven on a medieval treadle loom ( so the experts tell me), you are scraping the barrel a bit to find some esoteric loom and weaving process that somehow accounts not only for the Shroud itself in the first century but its miraculous preservation( but I suppose if it were a miraculous creation anyway none of this matters.).","date":"2015-02-15","mins":"3:30 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-191253","author":"charles_freeman","post":"The most significant issue is that early Christians did not collect relics any more than Protestants do today. It was a contested area even in the fourth century, when relics were first accepted as a legitimate means of worshipping Christ, as it was contested in the iconoclasm era and at the Reformation. The idea of an artefact through which one could access Christ/God is only valid in some Christian traditions and abhorred in others. In the early Christian era it was simply not an issue these were Jews,of course,in the earliest days. At the Protestant Reformation they simply burned the lot. So why would they have saved the burial shroud that we do know of course, once existed in the first century? There are, as David Mo points out, immense difficulties in understanding how a linen of this size and weave and Z spin might have been around in Judaea in the first century to be used at short notice to wrap a body. So immense to my mind as to be beyond realistic probability. Even more difficult to understand is how a cloth such as this would have survived in this condition outside an Egyptian tomb. We only have a tiny, tiny proportion of medieval linens surviving compared to the number we know from inventories to have existed in churches and as wall hangings in home. There is not a single medieval English painted linen still in existence. The trouble was that the painted surface disintegrated all too easily and the linen was thrown away if damp or fire had not got there first. So the problems of keeping a linen in good condition in damp areas for hundreds of years more is again beyond realistic probability. Two improbabilities multiplied together make the odds very long indeed. Historians simply have to make judgements. When experts in weaving tell me that the Shroud is a typical weave of a medieval treadle loom, I don’t take this as an absolute fact but I see no reason to dispute that expert opinion as there are no realistic alternatives. So gradually by eliminating improbabilities and imaginative solutions, one comes to a reasonable conclusion that is held until some evidence, ideally a first century carbon 14 date will do it, comes up to contradict it. As it is clear that a burial shroud of Christ did once exist, I shall be as interested as anyone if it is found, just as I would be if one of the large tomb blocking stones that still exist in Jerusalem is shown to be the one that closed Jesus’ tomb. That probably really does still survive in Jerusalem if only we could spot which one it is! It is said that the stone on which he was laid out, another likely survivor as it could hardly disintegrate or succumb to damp, was taken to Constantinople in the fourth or fifth century! I am not sure why the Shroud is talked about as if it were the greatest relic of all when all relic lists which have a hierarchy in them put pieces of the True Cross (the only relic of the Passion given a public showing each year in Constantinople), the Crown of Thorns (grabbed ,of course, by Louis IX for his Sainte Chapelle) and, from the fourteenth century, the blood of Christ, higher up on the list than any burial shroud or sudarium..","date":"2015-02-17","mins":"4:18 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-191115","author":"charles_freeman","post":"The Z twist suggests that it is NOT of Middle East or oriental origin. If the cotton came in during the spinning then some skeins ( as distinguished by the banding)might have It and others not depending on the workshop where the,y were spun before being gathered for the weave. However remember that Raes thought that ‘his’ cotton came from a loom used for cotton weaving. This would mean that as you went away from the loom you would not find any cotton – after all Oxford only found one fibre. Does anyone here claim that there was other cotton in the Oxford sample that was missed by the lab? A surviving linen cloth of this width and length and with this pattern is so much more likely to be the product of a medieval treadle loom than any alternative that the onus is on those who think it is first century to revise some more sophisticated evidence to support their claim..","date":"2015-02-15","mins":"9:03 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-191263","author":"charles_freeman","post":"Hugh, you need to look at journals such as, among those I have been put onto, Archaeological Textiles Newsletter and Medieval Textiles. It was in the latter (June 2001) that had Charles Kightly’s article about painted wall hangings in medieval York that had a lot of information about how quickly painted linens disintegrate and the kinds of images that they had. I was also put onto the work of Martin Ciszuk though i have no idea where he is to be found as he has done a great deal of work on Roman patterned textiles. And there is nothing like accessing the textiles section of the Masada excavation reports if you want a full study of typical first century textiles from Judaea. And do some work on treadle looms and linen weaving concentrate especially on the width issue as 113 4 cms seems fairly typical it corresponds to the medieval English ell and is the same width as the linen strips that make up the Zittau veil. The treadle loom seems to be number one choice when someone looks at the dimensions of the Shroud. So lots to be getting on with! But the Cambridge History of Western Textiles has articles by most of the big names like John Peter Wild it does concentrate on weaves rather than painted linens though. The Fabric of Images is good on the painting. As usual academics mention the Shroud only in passing which is a pity..","date":"2015-02-17","mins":"6:38 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-191264","author":"charles_freeman","post":"And Daveb is right in suggesting that the Shroud is not that complex there is nothing difficult in putting a thread under one thread and over the next three and then starting the next one with the under thread one across from the thread below to create the herringbone it is just painstaking work which is perhaps why it was seldom done – it gives a better impression with damasks and, as I have been told, church vestments such as the V and A textile. 3 in one is used by weavers today for vestments..","date":"2015-02-17","mins":"6:43 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-191265","author":"charles_freeman","post":"Main Ciszuk is easily tracked down on the web..","date":"2015-02-17","mins":"6:47 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-209960","author":"charles_freeman","post":"Joe from all your researches or from the photographic evidence can you tell us how far the reweaving extends? I have never been able to follow the logic of Roger’s explanations but he seems to imply the reweaving was in cotton that was then dyed. Yet everyone agrees that it is easy to distinguish cotton fibres from linen threads so where are they on Shroud 2.0?.","date":"2015-09-09","mins":"9:31 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-209994","author":"charles_freeman","post":"So who of those involved might be better qualified to see whether an ancient textile had been rewoven or not? As the issue of reweaving was posed as a hypothesis, it falls on those who propose it to show where they think the reweaving extended to and why no one seems to be able to spot it. In particular if Rogers believed that there was some reweaving in cotton that was then dyed( I do find his account difficult to follow) then it should be easy to see it. We obviously need an expert microscopist to help us here. . The late Walter Mc Crone anyone?.","date":"2015-09-09","mins":"4:07 pm","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-209948","author":"charles_freeman","post":"The difficulty is surely that no one whose speciality is ancient textiles who has actually examined the Shroud close up has been able to spot the reweaving. Th is is the point that Flury Lemberg makes of herself and her colleagues who have worked on it..","date":"2015-09-09","mins":"7:07 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-210106","author":"charles_freeman","post":"There may have been reweaving but the question is has anyone with PROFESSIONAL EXPERTISE in textile analysis who HAS ACTUALLY EXAMINED THE SHROUD close up been able to see it in this specific area. No. Therefore no reason to take the reweaving theory seriously. It was never more than a hypothesis and it has been clearly refuted (as John Jackson concurred by providing the pictures showing uninterrupted weave through this section of the cloth). Sometimes one has to make a judgement on an hypothesis and move on..","date":"2015-09-11","mins":"4:12 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-152135","author":"charles_freeman","post":"One of the biggest gaps in Shroud research has been anyone with any expertise in ancient textiles so it is good that Orit Shamir has become involved. As the Masada and other excavations in burial sites in the Middle East has shown there is a vast amount of material, much of it fragmentary, of course, that needs to related to the the Shroud. So far we only have that stitch! I hope the paper becomes accessible soon..","date":"2014-09-18","mins":"2:20 am","url":"https://shroudstory.com/2014/09/12/surprising-paper-out-of-bari-plant-dna-studies-on-the-shroud-of-turin/","cat":"article","title":"Surprising Paper out of Bari: Plant DNA Studies on the Shroud of Turin"},{"id":"comment-152136","author":"charles_freeman","post":"Well the introduction of treadle looms in c. AD 1000 were the biggest revolution in weaving technology and replaced the traditional ancient loom for most purposes as using your feet and hands simultaneously made weaving three times as fast..","date":"2014-09-18","mins":"2:26 am","url":"https://shroudstory.com/2014/09/12/surprising-paper-out-of-bari-plant-dna-studies-on-the-shroud-of-turin/","cat":"article","title":"Surprising Paper out of Bari: Plant DNA Studies on the Shroud of Turin"},{"id":"comment-204733","author":"charles_freeman","post":"‘The Shroud lay virtually unknown for 1,900 years’. Clearly the writer has not read John Beldon Scott’s Architecture for the Shroud which details the many expositions of the Shroud,especially in the seventeenth century, some of which attracted 70,000 observers.Then there was the grand chapel built for it by Guerino Gaurini and opened in 1694. Hardly unknown!.","date":"2015-07-06","mins":"8:14 am","url":"https://shroudstory.com/2015/07/06/techno-science-and-the-shroud/","cat":"article","title":"Techno-Science and the Shroud"},{"id":"comment-190926","author":"charles_freeman","post":"I never knew that STURP concluded that it was genuine. I have certainly never seen the evidence to support this conclusion. We still have to find evidence of an ancient loom capable of weaving a single cloth of this length. Normally the limit was two metres although away from Palestine an Egyptian ground loom could do more but the examples are a lot earlier. Any ideas anyone??.","date":"2015-02-13","mins":"7:33 am","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","title":"Two More Articles About Upcoming CNN Series on Finding Jesus"},{"id":"comment-191004","author":"charles_freeman","post":"Egypt was very isolated from the rest of the Mediterranean which is why Egyptian culture and art is instantly recognisable as distinct from that of other cultures and so far as I know there is no evidence of the Palestinians using Egyptian artefacts from a thousand years before. There are a few articles on the Shroud and the weave which sometimes assume that a herringbone weave is the same as a three in one herringbone weave but search as much as you will and no one has raised the basic question if the Shroud was authentic then what kind of known ancient loom was it made on. Its length really does need explaining for that period..","date":"2015-02-14","mins":"2:36 am","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","title":"Two More Articles About Upcoming CNN Series on Finding Jesus"},{"id":"comment-189111","author":"charles_freeman","post":"It looks as if he is better off writing on his own. The jointly written Rule of Four has more one star reviews on Amazon.com than the total of four and five star reviews together some kind of record, I think. Now that he is writing on his own he has got forty four and five star reviews and only one star review and this is six weeks before the book is even published. P. S. None of my publicists have ever told me how to get five star Amazon reviews before my books are released to the public. I have still a lot to learn..","date":"2015-02-04","mins":"11:27 am","url":"https://shroudstory.com/2015/02/04/a-most-anticipated-book-of-spring-2015-about-the-shroud-of-turin/","cat":"books","title":"A Most Anticipated Book of Spring 2015:  About the Shroud of Turin"},{"id":"comment-189122","author":"charles_freeman","post":"Thanks, John. I used to review on Amazon but I gave up when I realised how many of them had been arranged by the author. I was one even approached myself to ask whether I would provide a five star review for a book I had never read and did not even have a copy of. It was actually specified they were only looking for five stars! I refused and dropped out altogether from Amazon reviewing. There are other ways of finding out whether a book is any good or not. Goodreads is somewhat better..","date":"2015-02-04","mins":"1:29 pm","url":"https://shroudstory.com/2015/02/04/a-most-anticipated-book-of-spring-2015-about-the-shroud-of-turin/","cat":"books","title":"A Most Anticipated Book of Spring 2015:  About the Shroud of Turin"},{"id":"comment-144731","author":"charles_freeman","post":"I wonder if this is the same CNN series that I was telephoned about two weeks ago to see if I could help with research. I was asked nothing about the Turin Shroud ( the producer I talked to did not even mention it) , they only wanted to hear about the True Cross and I was able to put them onto some recent scholarship on the fourth century legends of the True Cross. I think they are going to carbondate some wood supposed to be from the Cross. So someone must be helping them on the research for the Turin Shroud..","date":"2014-08-19","mins":"7:50 am","url":"https://shroudstory.com/2014/08/19/an-important-new-book-coming-in-february/","cat":"books","title":"An Important New Book Coming in February"},{"id":"comment-183751","author":"charles_freeman","post":"The 29 reviews. I am not saying that this is the case here but the Society of Authors warned about the way in which Amazon reviews are no longer respected because they were mostly by friends of the author. I checked up on another book a couple of years ago where I suspected the author had done this and the telltale sign was a whole bunch of f Ive star reviews coming out almost on the same date and with some of the same terminology so it was obvious..","date":"2015-01-16","mins":"12:18 pm","url":"https://shroudstory.com/2015/01/16/book-the-physical-death-and-resurrection-a-surgeons-view/","cat":"books","title":"Book:  The Physical Death and Resurrection: A Surgeon’s View"},{"id":"comment-183966","author":"charles_freeman","post":"Poisoning the well. Well, I am not going to plough through the reviews in this case but it does happen. In the case I knew about the five star reviews were up even before publication date and by a month after publication date there were lots of them and then hardly anything. And unlike this book, I knew the book and it was not up to much..","date":"2015-01-17","mins":"2:49 am","url":"https://shroudstory.com/2015/01/16/book-the-physical-death-and-resurrection-a-surgeons-view/","cat":"books","title":"Book:  The Physical Death and Resurrection: A Surgeon’s View"},{"id":"comment-184033","author":"charles_freeman","post":"John, you have your own way of buying books. My Egypt,Greece and Rome came out in 1996 and has sold 82,000 copies. I have had a total of 46 reviews on Amazon.com. Which is less than three a year. The third edition has not yet had a single review but has sold out twice in the States and has already, in six months,earned me my advance back and more besides plus the sale of the rights to mainland China. Yes, publishers send out books for review but they don’t expect the reviews to be on Amazon as these may be very good but on the whole have no credibility in the wider market simply because some people, organise a big five star review programme among their contacts..","date":"2015-01-17","mins":"8:19 am","url":"https://shroudstory.com/2015/01/16/book-the-physical-death-and-resurrection-a-surgeons-view/","cat":"books","title":"Book:  The Physical Death and Resurrection: A Surgeon’s View"},{"id":"comment-145799","author":"charles_freeman","post":"Why was Frei not spotted? Well, according to John Heller’s Report on the Shroud of Turin, p. 108, John Jackson made an official complaint about Frei’s behaviour, procedures and general amateurship in taking samples. The complaint was upheld by Gonella, and Frei ‘stomped out of the room, glowering’. So he had been ‘outed’ that early by STURP, although he did have his tapes. The real question is why he was given any credibility thereafter. It seems sensible to view the question of pollen on the Shroud, what there is and where it came from, completely independently of anything Frei provided..","date":"2014-08-24","mins":"6:29 am","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"id":"comment-145847","author":"charles_freeman","post":"Louis “more examinations will have to be made”. Yes, I agree what we have is clearly unsatisfactory, partly because of the doubts that STURP had of Frei’s competence when they saw him working in Turin, partly because of the clouds hanging over him, partly because of the impossibility of defining the pollen with the certainty that he claimed and partly because of the discrepancies shown up by Hugh. So it seems worth starting again if only one can get access!!! Meanwhile, it would be irresponsible to use his findings as any kind of proof of anything..","date":"2014-08-24","mins":"1:53 pm","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"id":"comment-145780","author":"charles_freeman","post":"Following Hugh’s article, you need to specify which parts of Frei’s argument you support. Perhaps someone can give a considered reply to the different points that Hugh made. What is the thinking about the flowers supposedly buried with the Shroud – do t hey relate to what Frei actually found? There just seem to be a lot of discrepancies..","date":"2014-08-24","mins":"2:39 am","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"id":"comment-146034","author":"charles_freeman","post":"Thanks, Hugh. Helpful to work from. Frei was a busy man – I did not know he had done this as well: “The Dr. Max Frei found pollen from North Africa on the Sudarium, consistent with the traditional story of its transfer from Jerusalem c.614 A.D. Via Alexandria to Cartagena, Spain, later to Toledo and finally in 711 A.D. To Oviedo.’ From a presentation by the Pontifical Institute : Notre Dame of Jerusalem Centre. ‘Who is the Man on the Shroud?’ Anyone know more about this journey??.","date":"2014-08-25","mins":"9:56 am","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"id":"comment-146054","author":"charles_freeman","post":"I was completely surprised when I first started looking into Shroud material that the sudarium was isolated by the ‘Shroudies’ as the (varying) legends say that there was a chest of relics containing part of the Cross, some of Christ’s blood, bread from the Last Supper, a stone from the tomb, a robe of the Virgin Mary and some of her blood as well as a shroud’ presumably the sudarium. The legend went on that the disciples had gathered all these relics and made the chest themselves. The closed chest left Jerusalem c. 600, then made its way along the north African coast until it appeared in Toledo via Cartagena. Guscin has a go at all this but even he has to admit that ‘in these manuscripts [of the transfer of the relics] we are told that the ark left Jerusalem over the Mediterranean Sea, not overland, and that it entered the Iberian peninsula via the port of Cartagena. The curious thing about these manuscripts is that the sudarium does not appear in the list of relics, although it should also be pointed out that no two lists are the same in any document.’ I can see why Hugh is getting confused!!! Was the sudarium there or not? It may be, of course, that a sudarium was not considered as prestigious as some of the other relics certainly it would not have been more important than a piece of the Cross, but Guscin is hopelessly confusing over the relationship between the sudarium and what he calls the ‘ark’. He implies that the sudarium was somehow independent of the other relics but, without going back to my research, I think the story was that all these relics were together in the chest from after the Crucifixion. There were all kinds of taboos about opening the chest and only in 1075 when king Alfonso VI was present was it opened and the relics discovered. I have no idea what happened to all the other relics but it is hard to know how all the pollen got into the sudarium when it was supposed to have been closed up in the chest. Still Frei was clearly a genius for discovering pollen from wherever it needed to be discovered! Guscin seems to believe that all these legends about the ‘ark’ which may or may not have contained the sudarium, represent some sort of historical truth. My own opinion was that they were typical of many other backstories developed to explain why a relic might be authentic and was just more interesting that some of the others which is why I put it in my book. Anyone who had a relic in western Europe had to develop a story of how it got there and there are lots of legends of boats setting out from the Holy Land and drifting to the coast of Italy or Spain (e.g the arrival of the bones of James on their way to Santiago is very similar). I think it is wrong to assume that the Oviedo one is more likely to be historically accurate than any of the others. Understandably as these stories were essentially made up they were discrepancies between them according to whom you listened to and, as Guscin recognised, this is an issue here. Of course, if you accept that these are legends then there is no historical problem involved – I was more interested in how similar the drifting boat legend was ( the Volto Santo in Lucca arrived in the same way – or at least that was their story!!). And, for the sudarium there is this little problem of the carbon 14 date of 700. I am sure someone will tell us when faidherbia acacia arrived in Palestine from its native Africa and at what time of year it pollinates – apparently beekeepers love it because it pollinates at a time of year when not much else does but I have no idea when this was in Palestine. Answers please..","date":"2014-08-25","mins":"11:09 am","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"id":"comment-145657","author":"charles_freeman","post":"Hugh Farey’s recent article in the journal of the British Society for the Shroud addresses the problems with Frei’s work..","date":"2014-08-23","mins":"12:30 pm","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"id":"comment-146073","author":"charles_freeman","post":"O.K.’ Legends do not get created around nothing, Charles there is always a grain of truth.’ So what do you think about the legend that Belsdon Scott has in his book on the Shroud (pp.32 33) that Patriarch Heraclius of Jerusalem gave the Shroud to the king of Cyprus in 1087 and it was kept on the island until the Turks overrran Cyprus. Then Margarite de Charny escaped with it and the reason that the Savoys were keen to have it was that the duke of Savoy’s wife Anne of Lusignan came from a family that had claimed stewardship of the holy places of Palestine as well as the crusader kingship of Jerusalem. All quite plausible, don’t you think? This is another of those backstories that explain why a particular family or shrine had the right to a particular relic and there must be hundreds if not thousands of them. As many are contradictory (unless you are prepared to accept this one for the Shroud and reject any others), historians simply discount them UNLESS there is subsidiary evidence. I spent many months reading up these legends I recommend Jacopo de Voragine’s The Golden Legend if you are into this kind of thing and very seldom was there the ‘grain of truth’ that you suggest is ALWAYS there. ..","date":"2014-08-25","mins":"1:16 pm","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"id":"comment-146081","author":"charles_freeman","post":"Janice Bennet makes my point for me perfectly. Attempting to explain the journey of the sudarium from Jerusalem ,she highlights the number of DIFFERENT versions of the same background story. This is very typical of competing legends and it is impossible to say that one is more likely to be true, or indeed that any of them are true. ‘According to some versions, the chest was taken from Toledo to the coast, and placed in a boat that carried it to Subsalas. Another legend relates that it was carried in a boat to Luarca. Still another version says that the chest crossed Castile, passed through Babias, stopped in Torrebario, entered through the Port of Ventana and through Quiros in Asturias. From Mount Aramo they were probably taken to Montesacro [where it may have been hidden for fifty years]. . . Another version confuses [ YES, it does!] these relics with those brought from Jerusalem by St. Toribio in the fifth century ,and says that the saint arrived in Aviles with his divine cargo,and then placed the chest of relics on a peak of a high mountain called Monsacro. . .’ And it is not even clear whether the sudarium was in the chest anyway!! So I am absolutely at one with Hugh on this!.","date":"2014-08-25","mins":"1:47 pm","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"id":"comment-146214","author":"charles_freeman","post":"‘It is plausible that the Shroud spent some time in Cyprus’. So we need to look for some Frei pollen that is from a plant that flowers exclusively in Cyprus! Daveb’s hypothesis that the Shroud was exhibited in Jerusalem in the summer of the Crucifixion adds another dimension. Who is saying we are resting on our laurels? – and there is still all the excitement of the conferences to come!.","date":"2014-08-26","mins":"3:19 am","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"id":"comment-211435","author":"charles_freeman","post":"I agree with Hugh that an English origin is certainly possible. The English ell, the width of cloth, was 45 inches,c.114 cms and so close to the width of the Shroud. The patterns of bloodstains on the Holkham Bible crucifixion scenes, c.1330. Are similar and were made in London. Then the Shroud could have been a spoil of war won by Geoffrey who was, after all, predominantly fighting the English. O.K. Is right if the Shroud had remained in England, it would have undoubtedly been destroyed at the Reformation..","date":"2015-09-28","mins":"11:18 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","title":"The Shroud of Canterbury"},{"id":"comment-31162","author":"charles_freeman","post":"Please could someone explain how Giuilio Fanti’s averaging system works? Suppose you took two new separate samples from the Shroud and had each carbon dated in a different lab and the results were Sample One: 30 AD, Sample Two: 1370 AD, surely you would not date the Shroud to 700 AD. Perhaps I have missed something but is this not what Fanti is doing?.","date":"2013-04-18","mins":"9:50 am","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"id":"comment-146025","author":"charles_freeman","post":"‘There remain a few grains of pollen from some exclusively wind blown Middle Eastern trees’. I am not clear from the article exactly which ones these are. It would be good to have the list. Thanks..","date":"2014-08-25","mins":"8:57 am","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"id":"comment-192398","author":"charles_freeman","post":"If he had asked around, Ian Caldwell would,have been put onto Paul Zanker’s work The Mask of Socrates. Zanker is among the top five authorities on Roman art and he shows how the bearded Christ emerges in about 300 in Rome. The book can be found in full online. Of course, despite the massive hype, there are many who have different views about the work of Ian Caldwell as even the most basic research makes clear..","date":"2015-03-04","mins":"12:20 pm","url":"https://shroudstory.com/2015/03/04/inside-the-popes-bedroom-and-more/","cat":"books","title":"Inside the pope’s bedroom and more"},{"id":"comment-140886","author":"charles_freeman","post":"There are quite a lot of examples of both texts and illustrations in John Beldon Scott’s Architecture for the Shroud. Start here. I continue to be amazed that some Shroud researchers don’t seem to have a copy of this, the fullest account of the Shroud’s history since the Savoys acquired it. If it were on everybody’s desk, we would simply be able to say ‘see the illustration on Beldon Scott, page 212 or whatever’ and communications would be so much easier!.","date":"2014-07-28","mins":"9:03 am","url":"https://shroudstory.com/2014/07/26/john-klotz-issues-a-challenge-show-me-an-image/","cat":"books","title":"John Klotz Issues a Challenge:  Show Me an Image"},{"id":"comment-140562","author":"charles_freeman","post":"Most skeptics are skeptics because they don’t know how the image was made but see no reason to believe that it was necessarily made, by some process as yet unknown, in the first century AD. We are sceptical of those who claim they they DO known exactly how the image got onto the cloth. I do wonder why so many people have difficulty in understanding the everyday meaning of the word ‘sceptic’..","date":"2014-07-26","mins":"3:43 pm","url":"https://shroudstory.com/2014/07/26/john-klotz-issues-a-challenge-show-me-an-image/","cat":"books","title":"John Klotz Issues a Challenge:  Show Me an Image"},{"id":"comment-140630","author":"charles_freeman","post":"Hanks,John. I have no problems in accepting that there is something unique about the Shroud. My researches show that we have lots of documented, but now vanished, single images of Christ on cloth used in church ceremonies or to cover altars during Lent but no record of a similar double image. I will go on looking!.","date":"2014-07-27","mins":"2:21 am","url":"https://shroudstory.com/2014/07/26/john-klotz-issues-a-challenge-show-me-an-image/","cat":"books","title":"John Klotz Issues a Challenge:  Show Me an Image"},{"id":"comment-141007","author":"charles_freeman","post":"I have just been through the bibliography of Beldon Scott and there are a 101 printed sources listed from before 1800. That is not counting the archival sources he lists and many of the later sources are scholarly studies which may also include archival material. Then there are 214 listed illustrations. As every one knows one of the problems with the Shroud is that it had no back story coming with it (compare the Oviedo sudarium that had an elaborate one that had it brought from Jerusalem with a box full of other relics from the Passion and Crucifixion, the box itself having been made by the apostles). The Savoys recognised this and Pignon’s History of the Shroud , 1581, links the de Charnys back to Cyprus and from there to Jerusalem. Beldon Scott discusses this route in detail pages 31 37. I have not as yet come across any modern Shroud researcher who seems to have been aware of this..","date":"2014-07-29","mins":"3:52 am","url":"https://shroudstory.com/2014/07/26/john-klotz-issues-a-challenge-show-me-an-image/","cat":"books","title":"John Klotz Issues a Challenge:  Show Me an Image"},{"id":"comment-140998","author":"charles_freeman","post":"Thomas,I would think hundreds after 1578 as it was so widely publicised by the Savoy dynasty. Pignon”s history of 1581 was the first full scale book on the Shroud and then,as they say, it went viral. There are also lots of descriptions of individual expositions and the rituals involved. Again Beldon Scott is full of these..","date":"2014-07-29","mins":"2:38 am","url":"https://shroudstory.com/2014/07/26/john-klotz-issues-a-challenge-show-me-an-image/","cat":"books","title":"John Klotz Issues a Challenge:  Show Me an Image"},{"id":"comment-141041","author":"charles_freeman","post":"Thomas, More than worth a read as it has tons of material on the Shroud not available anywhere else and I find myself rereading it because there is much too much to take in at one go over four hundred pages by a top level scholar ( who makes no decision either way over authenticity). Go to abebooks they have two used copies at just over £20 without postage on at the moment – and several more at more than this. I bought my copy from there for c. £20 and it has been wonderful value..","date":"2014-07-29","mins":"7:01 am","url":"https://shroudstory.com/2014/07/26/john-klotz-issues-a-challenge-show-me-an-image/","cat":"books","title":"John Klotz Issues a Challenge:  Show Me an Image"},{"id":"comment-141561","author":"charles_freeman","post":"Antikythera mechanism, apparently a hoax? No, simply look it up and you will see that it is genuine of its time and apparently a lone survivor of what must have once been several prototypes. Whenever anyone says that the Turin Shroud must be first century and genuine on the sole ground that it is unique and many aspects of it are apparently inexplicable, I just think of the mechanism! The difference is that the Greek authorities allow access to bone fide scholars and as a result more is known about the mechanism every year as technology and x rays develop more sophisticated ways of examining it. Not possible for the Shroud at present. We will learn a great deal more about it if it is ever given over to a laboratory for a proper investigation ..","date":"2014-08-01","mins":"2:10 am","url":"https://shroudstory.com/2014/07/26/john-klotz-issues-a-challenge-show-me-an-image/","cat":"books","title":"John Klotz Issues a Challenge:  Show Me an Image"},{"id":"comment-140640","author":"charles_freeman","post":"The real problem in answering John’s challenge is the enormously high attrition rates of church cloths, whether linen, silk, or wool. They suffered from damp, fire and destruction( Reformation, French Revolution,etc). Colin’s point about prototypes is valid. The Antikythera Mechanism is a good example. It is totally unique and very sophisticated and scholars agree that there must have been lost prototypes, a long process of trial and error with gears, etc , to arrive at something so advanced for its day. Whether this is relevant for the Shroud I do not know..","date":"2014-07-27","mins":"3:39 am","url":"https://shroudstory.com/2014/07/26/john-klotz-issues-a-challenge-show-me-an-image/","cat":"books","title":"John Klotz Issues a Challenge:  Show Me an Image"},{"id":"comment-141566","author":"charles_freeman","post":"Image of a corpse on a cloth. Surely the Besancon Shroud although now lost, qualifies.The original was painted from life In Besancon in the 1560s and the painting is still there in the Municipal Library. Clearly not the Shroud,of course, just to compare the images and by this time the Shroud was ,of course, at Chambery..","date":"2014-08-01","mins":"2:19 am","url":"https://shroudstory.com/2014/07/26/john-klotz-issues-a-challenge-show-me-an-image/","cat":"books","title":"John Klotz Issues a Challenge:  Show Me an Image"},{"id":"comment-140642","author":"charles_freeman","post":"P..S. For instance, we know from church inventories that many churches had cloths with images of Christ Risen( obviously nothing to do with the Shroud) that they put out at Easter ( and folded away again until the next Easter). So far as I know not a single one survives..","date":"2014-07-27","mins":"3:44 am","url":"https://shroudstory.com/2014/07/26/john-klotz-issues-a-challenge-show-me-an-image/","cat":"books","title":"John Klotz Issues a Challenge:  Show Me an Image"},{"id":"comment-141592","author":"charles_freeman","post":"I know of Scavone’s paper and it is highly speculative i.e. He produces no significant evidence that we are talking of the Turin Shroud and not some other image. A contact of mine got in touch with the Library at Besancon to see what they had and they e mailed a seventeenth century image of the Besancon Shroud. He then asked about the painting of the Shroud by Pierra Dargent , apparently dating from 1560, and reproduced in a well known book on painting on linen (D. Wolfthal’s The Beginnings of Netherlandish Canvas Painting, Cambridge UP, 1989) and at first no one knew of it but eventually they found it in the archives. Working from what is reproduced in Wolfthal’s book, it is clearly not a copy of the Shroud and it is usually listed separately in works on shrouds. It is documented up to 1790. If Dan Scavone has a free moment I suggest he goes to the Library at Besancon as it seems they have quite a lot of material on their shroud there – another area where more research needs to be done. It is annoying that we have lost the cathedral’s own archives from before 1349. Again you have this problem that this, like the de Clari image, is only a single image and the defining feature of the Shroud is that it is a double image. The search goes on..","date":"2014-08-01","mins":"5:15 am","url":"https://shroudstory.com/2014/07/26/john-klotz-issues-a-challenge-show-me-an-image/","cat":"books","title":"John Klotz Issues a Challenge:  Show Me an Image"},{"id":"comment-141606","author":"charles_freeman","post":"John. For the nth time, I am not a pseudo sceptic I am the real thing, but always open to evidence that could convince me otherwise. I am only making the point that historians live with things we cannot understand but if an ancient object of any kind is made freely available for accredited scholars to examine,we can make good progress. For the Shroud we only have 1978/88 testings, long past their sell by date. We may, like the Antikythera Mechanism, still end up with things we don’t understand about it in the Shroud’s case because of the enormous attrition rate of pre 1500 images on cloth (if the inventories of medieval churches/monasteries and cathedrals are anything to go by). So I would join with anyone else who is prepared to let the Shroud go for examination in one of the top conservation labs dealing with ancient textiles..","date":"2014-08-01","mins":"7:26 am","url":"https://shroudstory.com/2014/07/26/john-klotz-issues-a-challenge-show-me-an-image/","cat":"books","title":"John Klotz Issues a Challenge:  Show Me an Image"},{"id":"comment-214820","author":"charles_freeman","post":"The Shroud of Turin only became truly famous in the 1970s. Hardly anyone came to see it in the eighteenth and nineteenth centuries and even among the many rival shrouds that at Cadouin attracted many more pilgrims in the medieval period. I wonder if Mr Buckley knows of the description of the Shroud from precisely 1517 in the Travel Journal of Antonio de Beatis. It would give him good background material including a full description of the images as they were at that date..","date":"2015-11-19","mins":"4:05 pm","url":"https://shroudstory.com/2015/11/19/just-in-time-for-christmas-the-relic-master/","cat":"books","title":"Just in time for Christmas:  The Relic Master"},{"id":"comment-141609","author":"charles_freeman","post":"STURP did not have enough disciplines. If you look at their report on the physics and chemistry they mention ‘large’ (their word) quantities of calcium carbonate found on the Shroud which they thought was accumulated dust. Anyone who deals with ancient linens would have spotted that this, from medieval times to this day, is an essential component of gesso, used to stiffen fabrics. The question is whether the calcium covered the whole cloth or only parts of it and what the purpose of applying gesso was perhaps just as a preservative. But here was a trick that STURP missed as a result of their failure to bring in anyone who knew anything about ancient textiles and their treatment..","date":"2014-08-01","mins":"8:07 am","url":"https://shroudstory.com/2014/07/26/john-klotz-issues-a-challenge-show-me-an-image/","cat":"books","title":"John Klotz Issues a Challenge:  Show Me an Image"},{"id":"comment-214920","author":"charles_freeman","post":"Dan , the photos certainly went global but it does not seem to have meant much to Turin. One had to wait thirty three years after 1898 for a new exposition and that was a family one, the wedding of Umberto II, which was in line with well established family tradition. Then the Church took over for the 1933 commemorative exhibition. Neither drew enormous crowds and then you had to wait another FORTY years for the next exposition. This does not suggest widespread interest..","date":"2015-11-21","mins":"6:26 am","url":"https://shroudstory.com/2015/11/19/just-in-time-for-christmas-the-relic-master/","cat":"books","title":"Just in time for Christmas:  The Relic Master"},{"id":"comment-214857","author":"charles_freeman","post":"Mario. 1) We know the public expositions of the Shroud from the 1350s and they were very limited until 1578 when it was transferred to Turin. The problem with the de Charny’s was the refusal by the popes and then bishops to allow it be seen as authentic.e.g condemnation of Margaret de Charny for exhibiting it by bishop of Liege in 1449. The Savoys tried to turn this around by claiming that the Lusignon family into which they had married had been given it by the Patriarch of Jerusalem in the eleventh century – all details in Beldon Scott. Meanwhile the shrine at Cadouin was on the way to Compostela and was packed out with pilgrims on their way there. It had the advantage over the Turin Shroud in that it had the actual story of having been brought from the Holy Land ,even though since the 1930s we know it is an Islamic cloth made shortly before it arrived. 2) You will find the details of the eighteenth and nineteenth century expositions in Beldon Scott. The Shroud used to be exhibited as a relic on its feast day but after about 1703 it was only brought out at family weddings. In 1821 it was only exhibited in the cathedral ( when before it was shown in the open air in the Piazza Castello ) because of fears of demos against the dynasty, whose symbol it was, among liberals. There were only three expositions in the entire nineteenth century, 1842, 1868 and 1898. The 1868 was within the cathedral but only for four days and there is no record of many crowds as the dynasty had now relocated itself as kings of a united Italy. The lithograph that Beldon Scott reproduces from 1868 suggested that much of the paint from one of the images had fallen off by then but I leave it for yourself to view the lithograph yourself. 3) The photos of 1898 did indeed go round the world but in the early 1900s the conservative Catholic Encyclopedia said that few Catholics thought it was authentic. There were complaints between the wars by authenticists that no one was listening to them. Things had moved on in the relic world. It was the television broadcasts in the 1970s which made it truly international and you get the creation of new , hitherto unrecorded, legends of an early origin which had, after the researches of Chevalier, to include Lirey again. These new legends have not found any support among medieval or Byzantine historians. If you don’t yet have a copy of Beldon Scott then they are available second hand and essential if you want to know e history of the expositions and the way the Savoys tried to manipulate and create a legend of authenticity which airbrushed the Lirey origin especially after the ecclesiastical courts repeatedly proclaimed that it was not de Charny property in the first place!.","date":"2015-11-20","mins":"3:42 am","url":"https://shroudstory.com/2015/11/19/just-in-time-for-christmas-the-relic-master/","cat":"books","title":"Just in time for Christmas:  The Relic Master"},{"id":"comment-214927","author":"charles_freeman","post":"I don’t know where the two million figure comes from that would be 100,000 a day (how many a day went through in June?) and in the extensive study by Beldon Scott of the 1931 exhibition, pp 304 13, he makes no mention of crowds at all, except in the final exposition for one day outside and that only from the cathedral steps and not in the larger Piazza Castello (a planned exposition outside for the opening day was cancelled as a result of rain). There were unverified accounts of 1.5 million in newspapers but even this seems too high considering that the Shroud was in the cathedral. Plate 12 in Beldon Scott shows the Fascist Government’s advert for the ostension and he notes, p. 311, how Mussolini, flushed with success of the Concordat of 1929, saw it as a propaganda event to link the regime, the monarchy and the church. ‘Seizing the ostension as an opportunity to solidify further its advantageous positive rapport with the church, the fascist regime employed various means for advancing this goal’ and this included a fifty per cent reduction in train fares from Italian stations. As Beldon Scott goes on: ‘In effect, a government subsidy, this arrangement encouraged pilgrimages to Turin, solidifying a mutually beneficial relationship between church and state’. The poster links the exposition to the royal nuptials ( Umberto was still Crown Prince at the time and the king did not even turn up.) Knowing how the press was controlled by the Fascists at this time, the 1.5 million may be no more than propaganda put out by the regime. I think Beldon Scott would have mentioned the crowds if they had been this big as they would have brought the city to a halt! We also have Peter Rinaldi’s memoirs (‘When America First Heard About the Shroud’, Spectrum, no. 12 Part 3) which notes that after he went back to the US after the 1933 ostension, no one had heard of the Shroud. The evidence does suggest, however, that the breakthrough to the Shroud as an international icon is in the 1970s following television broadcasts. The fact that lots of people turn up to a shrine has no relationship, of course, with authenticity, especially when you have a Fascist government encouraging them as in 1931..","date":"2015-11-21","mins":"8:48 am","url":"https://shroudstory.com/2015/11/19/just-in-time-for-christmas-the-relic-master/","cat":"books","title":"Just in time for Christmas:  The Relic Master"},{"id":"comment-214858","author":"charles_freeman","post":"‘ entire nineteenth century’ – after 1821, I mean. By 1898 the Savoy dynasty had lost interest and only sent a cousin up for the exposition. The Church tended to run the expositions from then on even though they did not own it until1983. All in Beldon Scott!!.","date":"2015-11-20","mins":"3:48 am","url":"https://shroudstory.com/2015/11/19/just-in-time-for-christmas-the-relic-master/","cat":"books","title":"Just in time for Christmas:  The Relic Master"},{"id":"comment-214861","author":"charles_freeman","post":"And then again, after 1898 there was only the 1931 exposition (marriage of Umberto II on show behind glass 3rd to 24th May with a brief public viewing on the steps of the cathedral) and the 1933 exposition (1900 years after the Crucifixion) which again involved only one brief external exposition and the Savoys did not even turn up in Turin at all. This simply was not a big news relic! The Catholic Encyclopedia of 1907 14 states that ‘the immense preponderance of opinion among learned Catholics was adverse to the authenticity of the relic.’ One really does have to see the authenticity movement as essentially a newly minted one of the 1970s..","date":"2015-11-20","mins":"5:08 am","url":"https://shroudstory.com/2015/11/19/just-in-time-for-christmas-the-relic-master/","cat":"books","title":"Just in time for Christmas:  The Relic Master"},{"id":"comment-214918","author":"charles_freeman","post":"Mario. They did not count the numbers of pilgrims at each shrine although sometimes they recorded the number of miracles and these were read out on the feast day of the relic in question. If you look at the evidence for the expositions of the Shroud you will find that it makes a very small impact before 1578, largely because it did not have a fixed base until brought to Turin. Overwhelmed as I was by the major cults of Europe in the Middle Ages, e.g. Before 1500, when I was writing my book on relics,I had no need even to include the Shroud as an also ran. It just did not feature among other more prominent shrines. I think Beldon Scott has enough details on the expositions of the Shroud to show that it was only between 1578 and 1703 that it had widespread popularity. I do not need to say more when anyone with an interest in the Shroud should have a copy of Beldon Scott to refer to it is always the first book I recommend as it is the only one that relies on the original documentation in Turin and has a wonderful set of illustrations of the Shroud. One of the problems with the Shroud was the very small number of miracles associated with it Beldon Scott illustrates those known in the sixteenth century but it did not, compared to some relics, have a healing tradition associated with it. Neither did it have a backstory ( e.g. The shroud at Cadouin was indeed brought back from the Holy Land) until the Savoys concocted their story of the Jerusalem Cyprus Lusignon connection by the 1580s. If we go back to 1517 de Beatis was actually given an earlier story that it was brought back from the First Crusade! There is nothing outlandish in referring to the cult of the Shroud, other than the period 1578 to c.1703, as a minor one before the 1970s. It appears that it was the international television coverage that brought so many, over three million, pilgrims to Turin in 1978. The single figure on the Shroud of Besancon did have a miracle of raising a man from the dead associated with it but I understand that many of the medieval sources relating to it were lost in a fire. The Shroud at Besancon, with its very different iconography ( e.g. No emphasis on the blood) ,and only a single figure, was, to my mind, another example of a Quem Queritis ceremonial burial cloth. The basic issue is that the number of pilgrims to a shr Ine had nothing to do with the authenticity of a relic, unless it was of a recent saint. It is almost certain that the original stone that closed to the tomb is one of those apparently still to be found in Jerusalem but there is no way of knowing which one!.","date":"2015-11-21","mins":"6:19 am","url":"https://shroudstory.com/2015/11/19/just-in-time-for-christmas-the-relic-master/","cat":"books","title":"Just in time for Christmas:  The Relic Master"},{"id":"comment-123469","author":"charles_freeman","post":"The Masada stitching proposal was put to rest in an earlier discussion on this blog. Once the original stitching that F L was referring to was tracked down in the multi volumes excavation reports of Masada it was shown to be a simple and typical stitch that has been used to this day( my wife who worked on theatre costumes used it often). So it is of no relevance here. Hugh has made the main point. You can’t have an invisible weaver using cotton instead of linen threads and expecting to be invisible! So those who advocate reweaving, or otherwise, must get their arguments clear if they wished to be taken seriously. Remember too that no one has found sufficient cotton fibres in any part of the Shroud to affect the dating. If there was a significant reweaving that actually affected the dating it must have been in linen..","date":"2014-05-23","mins":"3:47 am","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"id":"comment-123470","author":"charles_freeman","post":"Yesterday I was at the new exhibition of Egyptian mummies at the British Museum and they were all buried with their hands crossed over their genital area. The reason is that this is the most economical way of enclosing a body in a shroud or wrappings. You need a much broader covering if the arms are left down by the side. So when you discuss hands in this position you need to relate it to the methods of wrapping the body for burial, not necessarily anything to do with religious prurience. The Lombards also buried heir dead with hands crossed over the genitalia see the examples in the museum at Cividale in Fruili where a large Lombard cemetery was excavated..","date":"2014-05-23","mins":"3:54 am","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"id":"comment-140857","author":"charles_freeman","post":"John, Are we looking for an image that is discolored, as you suggest that the Shroud is ,or one with colours instance, presumably because it has been better stored? The high attrition rate of medieval cloths is a real problem. We do know from inventories of many hundreds of cloths, some just for Lenten coverings up of statues and rich altars, others, mainly of saints, hanging all the year round. We may find more help from medieval documents but these are mostly still in Latin and my medieval Latin is not that good. I haven’t found a double image of the buried Christ mentioned anywhere yet..","date":"2014-07-28","mins":"6:08 am","url":"https://shroudstory.com/2014/07/26/john-klotz-issues-a-challenge-show-me-an-image/","cat":"books","title":"John Klotz Issues a Challenge:  Show Me an Image"},{"id":"comment-123565","author":"charles_freeman","post":"I have seen 9 kgs quoted but then I have never had the privilege of holding it!.","date":"2014-05-23","mins":"9:23 am","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"id":"comment-123679","author":"charles_freeman","post":"This is the blurb one bookseller gives. There are second hand copies available on Abebooks. “The famed linen cloth preserved in Turin Cathedral has provoked pious devotion, scientific scrutiny and morbid curiosity. Imprinted with an image many faithful have traditionally believed to be that of the crucified Christ “painted in his own blood”, the Shroud remains an object of intense debate and notoriety yet today. In this illustrated volume, John Beldon Scott traces the history of the unique relic, focusing especially on the black marble and gilt bronze structure Guarino Guarini designed to house and exhibit it. A key Baroque monument, the chapel comprises many unusual architectural features, which Scott identifies and explains, particularly how the chapel’s unprecedented geometry and bizarre imagery convey to the viewer the supernatural powers of the object enshrined there. Drawing on early plans and documents, he demonstrates how the architect’s design mirrors the Shroud’s strange history as well as political aspirations of its owners, the Dukes of Savoy. Exhibiting it ritually, the Savoy prized their relic with its godly vestige as a means to link their dynasty with divine purposes. Guarini, too, promoted this end by fashioning an illusory world and sacred space that positioned the duke visually so that he appeared close to the Shroud during its ceremonial display. Finally, Scott describes how the additional need for an outdoor stage for the public showing of the relic to the thousands who came to Turin to see it also helped shape the urban plan of the city and its transformation into the Exploring the mystique of this enigmatic relic and investigating its architectural and urban history for the first time, “Architecture for the Shroud” should appeal to anyone curious about the textile, its display and the architectural settings designed to enhance its veneration and boost the political agenda of the ruling family.”.","date":"2014-05-23","mins":"3:36 pm","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"id":"comment-123678","author":"charles_freeman","post":"John Beldon Scott’s Architecture for the Shroud has a mass of detail about how the expositions were organised. I continue to be surprised that so few ‘Shroudies’ seem to know about this book as it has a great deal of information about the Shroud that I have never found anywhere else..","date":"2014-05-23","mins":"3:30 pm","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"id":"comment-124865","author":"charles_freeman","post":"I am in Greece at the moment with no access to my files but a Belgian cultural institute analysed 400 C14 ratings of Coptic textiles and found about one per cent questionable. There have been problems with calibration especially when you go back 50,000 years working with very small samples of surviving carbon but it makes no sense to equate dating of very ancient artefacts with those from the last two thousand years where the margin of error is very small indeed. I have found Meacham very misleading as , from what I have read of him, he fails to make this distinction. You also need to distinguish say peat from textiles as the issues of selecting un contaminated samples are very different..","date":"2014-05-26","mins":"2:55 pm","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"id":"comment-75100","author":"charles_freeman","post":"‘The weave being similar to what was found at Masada.’ The Masada evidence was fully discussed in a separate posting. The Masada textiles are mostly wool and are not the same as the weave of the Shroud – those that are twill are largely 2.2 not 3/1 (the Shroud herringbone) that apparently needs a different kind of heddle on the loom when being woven. The similarity was supposed to be the stitch which, it was claimed, was a very rare one (Wilson, The Shroud) and only known on the Shroud and on a Masada textile. However, as we showed in the discussion, I hope to everyone’s satisfaction, the stitch concerned was in fact a very common one for stitching two different cloths together and used from ancient times up to this day, even by my wife when she was working with theatre costumes. So the stitch theory did not take us any further forward. Perhaps someone , ?Hugh in his Newsletter, could gather together the fruits of these discussions when an issue/myth seems resolved so that it doesn’t get brought up again and again..","date":"2014-01-29","mins":"3:17 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-124867","author":"charles_freeman","post":"P.S. The Belgian study is important as it concerns a) textiles, b) textiles that date to the first millennium Ad, therefore in the same era that the linen of the Shroud might be,.","date":"2014-05-26","mins":"2:58 pm","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"id":"comment-75151","author":"charles_freeman","post":"‘Yet as much of the Masada textile collection has never been published, F L may have seen something that was not reported in the excavation report from a private inspection” No, I think you will find that we have the reference in F L to a specific illustrated stitch in the excavation reports these are difficult to pin down but the Cambridge University Library has a copy that I consulted on this and photocopied the relevant illustrations of stitches. If the stitch illustrated is in fact the same as the stitch on the Shroud then it could have been stitched at any time as it is very common one. Wilson is very misleading on this when he describes it as rare – but I suppose sewing is not his thing while it is for for my wife who used to design and sew up theatre costumes and instantly recognised the stitch this is why these myths get around! However, as we discussed this endlessly before and it is on record in this blog, I am not going to look out the photocopies of all the stitches I took from the excavation reports to make the point yet again. But the point I made is valid some of these discussions do eventually end in conclusions that no one seems able to challenge and sometimes these conclusions get rid of myths about Shroud research that get endlessly recycled from one discussion to the next. One day someone will write the definitive book on the Shroud drawing on independent textile experts, art historians , historians ,etc. Which can be used as the benchmark on all these issues. There does not yet exist a single book that does this despite all the talk about the vast amount of research that has been done..","date":"2014-01-30","mins":"7:19 am","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-50234","author":"charles_freeman","post":"‘ Merely yet another example of a slanted take contrary to the actual evidence, in a pathetic agenda driven attempt to discredit the TS as of possible ME provenance.’ And I thought we were meant to be being polite to each other! Ok, Dave b, well let’s put out some evidence as this in area that has been exhaustively researched (because knowing the twist S or Z is used widely to assess provenance and so it is always recorded in textile studies). This is a compilation of the evidence from various archaeological sources. All the major finds in the Near East, the textiles from the Qumran Cave and Masada (both first century AD), those from the period of the second Jewish revolt (AD 132 5) and from the early third century from Dura Europus in Syria, have S twists. So did all the 46 fragments of wool damask from the Mons Claudianus site in Egypt (second century AD). A study of 21 linen textiles from Coptic Egypt from the Katoen Natie collection in Antwerp that have been dated to between the fifth and tenth centuries AD showed all had S twist yarns. A possible exception to the eastern S twist lies in the very finest cloths as in a (wool) diamond twill of the third century AD from a tomb in Palmyra (its weft had a staggering 160 threads to the centimetre) which was Z twist. In contrast the pre Roman Celtic cultures of Europe all used Z twist. John Peter Wild, a leading authority on textiles, writing in 1970, knew of only one piece of linen from the Roman west that was S spun and as it was found with silks, it was probably an import. ( Wild’s Textile Manufacture in the Roman Northern Provinces, p. 44.) The wonderful silk damask from Milan of the fifth century is another cloth with Z twist threads. The ‘Roman’ Z twist continued into medieval Europe. For instance, all the linen textiles recovered in excavations from London that are dated between 1150 1450 have a Z twist in their yarns. In general, therefore, a linen textile that uses a Z twist in its yarn is likely to come from Roman or medieval Europe, and a yarn with S twist invariably comes from the east. Now would you like to present your evidence to contradict this ‘coherent argument’? Please realise that some of us are professionals working in these fields and we do try and get things right before we go public..","date":"2013-11-06","mins":"6:18 pm","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-75152","author":"charles_freeman","post":"‘So if she’s wrong about the Masada textile, maybe she’s also wrong about the evidence that came from Sue Benford/Joe Marino/Ray Rogers as well.’ Perhaps (one must always be open to the possibility), but I assume you are not making this assertion without having read her paper on the subject. And ,as we have noted in another discussion, she is supported by Professors Raes, Vial, Testore who have all examined this corner of the Shroud, so she is one of a GROUP of PROFESSIONALS specialising in ancient textiles who have actually examined this corner of the Shroud,not an isolated voice. Yes, for those who follow him, it is important to note that Wilson does not support the ‘reweave’ he seems to be into contamination by clerical sweat, although one would assume that that would have been dissolved in the cleaning. Perhaps he will enlighten the Melbourne audience on what he actually believes might challenge the C14 date. I know academics are often derided on this blog but no one else has such expertise and when several experts concur on there being no reweave then I think one should take them seriously. Remember Benford and Marino are/were not textile experts, nor was Rogers, and Rogers had not seen the Shroud since 1978 he was writing 27 years later with only threads and fibres, not even an actual weave!! And his dye thesis is unsustainable if taken alongside the researches on the Raes fibres by Thibault Heimburger, that show most of the reweave, if it happened, must have been linen. Why add in cotton as well to the ‘new ‘linen if this was meant all to be invisible..","date":"2014-01-30","mins":"7:34 am","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-50268","author":"charles_freeman","post":"Dave b. I only intervened on one issue, the Z twist. When I first read it, I simply assumed that the author had got S and Z mixed. I do not know where he got his idea that Z twist indicated that the tunic ‘was probably made in the near or Middle East’. A glance at a standard text, e.g. The first volume of The Cambridge History of Western Textiles would have shown him that he was wrong. It has long been recognised that Z is rare in the east, and S rare in western Europe. I do take the point,however, that there was trade. In fact, trade between the east and Spain has been plotted through the discovery of S twist textiles in Spain. Accounts suggest that the Temple priesthood in Jerusalem imported their linen from India or Egypt, there being little high quality flax in Palestine until the second century. So one can have an imported Z spun cloth in the east I was simply making the point that ‘PROBABLY MADE IN THE NEAR OR MIDDLE EAST’ is certainly wrong. I did not intervene on the blood issue so that is irrelevant here.Obviously the fact that non human primate species may have AB blood is neither here nor there as the species don’t cross. This is one of the areas that will be clarified over the years as more genetic evidence is accumulated. Progress is so fast in the field of ancient genetics that it is simply a question of seeing how this is resolved. ‘Doubtless we shall see him grasping at yet further straws in the future to bolster his pseudo skepticism as his imagination might allow.’ I am working on it, Dave B, but what is ‘pseudo skepticism’? I assume that it is pretending to be sceptical when one is not, but I can’t understand why I should PRETEND to be sceptical. The real question is whether this is a website on which sceptics are allowed or not to contribute without personal attacks. That is up to Dan. Yesterday in the ‘Consider Rogers’ posting I put forward some areas of research (in the relic collections of northern France that are said to have come direct from Jerusalem) that can be followed up without making a commitment either way to authenticity. Here I have put forward some accepted evidence about S and Z twist that certainly does not come from my imagination but from the hard work of dedicated archaeologists..","date":"2013-11-07","mins":"4:29 am","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-50188","author":"charles_freeman","post":"‘The weave, made using a so called Z twist, indicates that the robe was probably made in the Near or Middle East.’ I think the author must have meant ‘S’ twist. Z is relatively rare in the east but almost universal in western Europe while S is the predominant twist in the Middle East. (It depends on the way you do the spinning and this is, interestingly enough, a cultural phenomenon.) It may be, of course, that the tunic is the exception that proves the rule..","date":"2013-11-06","mins":"9:55 am","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-164405","author":"charles_freeman","post":"John,take it from an old hand, first book published in 1980. Whatever you write, however well researched, however much you have specialist knowledge others do not have, you will still get people who say what you write is garbage, or plagiarism or dishonest. Just learn to live with it and never respond with the same kind of abuse! I think you are too sensitive to even the most mild of criticism. Wait until somebody really pulls your book apart!.","date":"2014-10-21","mins":"3:31 pm","url":"https://shroudstory.com/2014/10/21/on-early-reviews/","cat":"books","title":"On Early Reviews"},{"id":"comment-182353","author":"charles_freeman","post":"The True Cross programme was the one I was consulted on and I gave them all the articles I had on the early legends of the Cross by the acknowledged academic experts. (Of course, there is no question of being paid a consultancy fee however much one helps!) When I suggested that it was unlikely that any relics of the Cross were authentic they told me that they were radiocarbon dating one that they thought might be. I told them to get in touch if they came up with a first century date as I would have to rewrite the first chapters of my Holy Bones. I have heard nothing more. I did get the idea that they really did believe that some of the relics were authentic and that the programmes would be slanted that way. They certainly did not want to hear further from me or the experts on these legends who think that they are legends and nothing more. They did not even acknowledge some other references I sent them later. But if you start with an agenda and neglect specialist opinion ( I do not mean myself but people who are specialists in these early Christian texts on relics) then what do you expect..","date":"2015-01-10","mins":"6:24 am","url":"https://shroudstory.com/2015/01/10/six-major-artifacts-including-the-shroud-of-turin-the-true-cross-and-john-the-baptist/","cat":"books","title":"Six major artifacts, including the Shroud of Turin, the True Cross, and John the Baptist?"},{"id":"comment-182511","author":"charles_freeman","post":"Actually there has been quite a lot of testing, official and unofficial, of relics in Italy. One of my guides was up to date on them they had found that one reason for the good state of preservation of the body of Santa Zita in Lucca for instance, were the large quantities of lead in her body from her long life as a servant in the kitchens with lead pipes. It does not seem to be a big issue whether a relic is genuine or not. The people of Lucca love their Volto Santo but they simply say the original, authentic, relic is no longer there because pilgrims took pieces off it in the Middle Ages but the present, medieval one is a good substitute! Never forget that many of these so called relics are objects of veneration, not authentic, but venerated because there are miracles associated with them. A miracle can always give a sacred object that may not be original at all special status. My own feeling is that Italians live emotionally with relics but disregard the science. They are simply part of the fabric of life associated with communal festivals going back, usually, into the Middle Ages and that keeps it all going. So far as I can see the booking for the Shroud visits is not being organised by the Church but the local tourist authority. That says a lot but there are indeed wonderful things to see and do in Turin and the surrounding countryside so I wish the Piedmont Tourist Board luck in spreading their message outside the cathedral as well..","date":"2015-01-11","mins":"3:43 am","url":"https://shroudstory.com/2015/01/10/six-major-artifacts-including-the-shroud-of-turin-the-true-cross-and-john-the-baptist/","cat":"books","title":"Six major artifacts, including the Shroud of Turin, the True Cross, and John the Baptist?"},{"id":"comment-168224","author":"charles_freeman","post":"You need the flagellation of Christ scenes and the Crucifixion scenes – you can see there how the globules of blood on the hair of Christ and the blood running down the arms as well as flagellation marks and sores covering the whole body echo those of the Shroud. The Bible dates from c. 1330 .If those imagesare not here they come up easily on a Google images search. The important thing is to contrast these with illustrations of c 100 years earlier and you can see the dramatic changes in the iconography, e.g. The Pray Codex, much discussed here!!, had no signs of the scourging or the flowing blood on the arms. The Shroud and the Holkham Bible as well as other fourteenth century images such as the Roettgen Pieta do. It places the Shroud solidly within the fourteenth century..","date":"2014-11-03","mins":"9:58 am","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"id":"comment-168349","author":"charles_freeman","post":"David Mo has already made clear that the Shroud does not show a representation of a ‘real’ flagellation as there is no sign of the skin being broken at all. And if you look at the scourge marks, all 372 of them, on Faccini and Fanti’s illustration, you can hardly say there are areas where there are few marks. The crucial point , Marrow suggests, is whether you have scourge marks that cover the whole body back and front and the Shroud does in accordance with the inspiration of Isaiah 1.6. Obviously different flagellations will vary but this is certainly not a ‘real ‘ one and read my article to understand the OT textural background to the way the Shroud marks are displayed. I am getting to the point where I would put forward the Shroud as a classic example of the changing way in which the flagellation was portrayed in the first half of the fourteenth century...","date":"2014-11-03","mins":"4:12 pm","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"id":"comment-168485","author":"charles_freeman","post":"What you can’t do is to describe the horrors of being flogged by a flagrum and then say that the Shroud shows the after results of someone who has been flogged by one. You might argue the opposite that the marks of the flagellation on the Shroud show that a flagrum was NOT used..","date":"2014-11-04","mins":"2:24 am","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"id":"comment-168351","author":"charles_freeman","post":"P.S. The flagellation displayed above is not the one I am referring to – google .image ‘ Holkham Bible flagellation Christ’.","date":"2014-11-03","mins":"4:14 pm","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"id":"comment-168483","author":"charles_freeman","post":"The Holkham Bible was made in London. There is some evidence, see my article, to suggest that the Shroud was painted in Southern Germany. So no one is saying that they are the same artist – it is just that the word got around first among theologians and then it spread c.1300 into art that The flagellation marks should cover the whole body to fit with Isaiah 1.6. You cannot find this before 1290 1300. Obviously this was done in slightly different ways in different parts of Europe. So the Shroud ,one might say, is part of a family with enough similarities with other members of the family to date it within the same period. Russ, the Holkham Bible illustrations have nothing to do with the Easter ceremonies. My arguments for these are presented in the second part of my article – the Lirey pilgrim badge shows clerics holding up the Shroud in front of an empty tomb in exactly the same way the liturgy says it should be held up in the Quem Queritis ceremony again I refer you to my article..","date":"2014-11-04","mins":"2:12 am","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"id":"comment-168692","author":"charles_freeman","post":"Thanks, David. Good to have the support. The original of the prayer book of 1559 of Margeurite de Valois is In the Royal Library of Turin and they should be able to send it online for a payment. It is illustrated in the print version of my article but the cost of getting rights for the World Wide Web were too high. It is also illustrated in Beldon Scott’s book on the Shroud..","date":"2014-11-04","mins":"3:45 pm","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"id":"comment-168694","author":"charles_freeman","post":"The Church did not have official control. An American art historian Jeffrey Hamburger argues that much of this imagery was an indicative of the Dominicans who commissioned their work and told the artists what they wanted..","date":"2014-11-04","mins":"3:49 pm","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"id":"comment-168326","author":"charles_freeman","post":"I never expected I would agree with Max on anything but yes here is a later fifteenth century depiction of Christ with the Crown of Thorns in place, blood on the hair under the Crown and flagellation marks covering the whole body and blood flowing on the arms – all very Shroud iconography..","date":"2014-11-03","mins":"2:59 pm","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"id":"comment-53219","author":"charles_freeman","post":"Helmut. It is some years since my wife worked at the V and A so she cannot comment on any samples given by the V and A to Dr. Tite – she worked on the twentieth century collections. It is most unlikely that the V and A would give away part of its collections why would it? Is there a hint here that Dr. Tite actually got hold of a fourteenth century cloth from a respectable museum, cut it into three and distributed it to the three radiocarbon labs and made each of them substitute it for the samples taken from the Shroud. – I think you should ask Dan Brown, not my wife, about this..","date":"2013-11-28","mins":"11:45 am","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","title":"Unraveling Unusual Stitches in the Turin Shroud"},{"id":"comment-53806","author":"charles_freeman","post":"Daveb. It is not a bias as such it is just sorting out what is relevant or irrelevant. The Shroud is high quality certainly not as high as other known examples e.g. Medieval table cloths or altar cloths but woven by professionals so one would EXPECT that the stitching would also be done by professionals. No surprises there. Flury Lemberg simply confirms, and it is helpful to have her confirmation, that the stitching is in line with the professional quality of the weaving. Mrs. Charles Freeman can only work from the illustrations given by Wilson and the Masada report she certainly does not see this stitch as complex so far as a professional seamstress is concerned because it the standard one used in these cases but it is good to see that it is not a botched job in this case!!. As my wife, who is playing an unexpected starring role here, continues: The sentence ‘The linen cloth of the Shroud of Turin does not display any weaving or sewing techniques which would speak against its origin as a high quality product of the textile workers of the first century’ could be rewritten as ‘The linen cloth of the Shroud of Turin does not display any weaving or sewing techniques which would speak against its origin as a high quality product of the textile workers of the twenty first century.” The question we need to ask the ‘history of stitching’ experts and Gian Marco Rinaldi seems to be able to help here is whether we could replace ‘first century ‘ and ‘twenty first century’ by textile weavers ‘of the medieval period.’ if we can,then we are simply back to saying that, other than confirming that the stitching was professionally done, it could be of any date from the first century onwards. This is why I think the evidence of the stitching can be discarded as irrelevant for dating purposes. If there is no evidence that this form of stitching was ever known in the Middle Ages then we do have something of relevance to work on. So over to anyone who knows about the history of stitching to tell us..","date":"2013-11-29","mins":"5:44 am","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","title":"Unraveling Unusual Stitches in the Turin Shroud"},{"id":"comment-53809","author":"charles_freeman","post":"P.S. Wilson’s caption for this stitch that he illustrates as fig 8. On p. 110 of The Shroud (2010) ‘ reads ‘Very rare type of ‘Invisible Seam.” LOL from the resident seamstress of the Freeman household..","date":"2013-11-29","mins":"5:53 am","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","title":"Unraveling Unusual Stitches in the Turin Shroud"},{"id":"comment-53838","author":"charles_freeman","post":"Helmut – that is up to you if you want to start a new thread but do see whether you can sell the idea to Dan Brown first he might be able to pay you a good price. Sorry, I can’t see who would have gained by this bizarre idea. There was much more in it for the radiocarbon labs if they had been able, against the expectations of people who deal in medieval relics, to come up with a first century date. Now that really would have made their reputation!.","date":"2013-11-29","mins":"6:43 am","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","title":"Unraveling Unusual Stitches in the Turin Shroud"},{"id":"comment-53414","author":"charles_freeman","post":"OK/Dave B. It is clear from Wilson that the actual stitching that he is referring to is Fig 23 in the Masada report even though he provides no reference that pinpoints this. I assume that he is correct in saying that this is the one that Flury Lemberg pinpointed but he does not provide a reference to any conversation of text so we cannot follow it up. What I cannot find any support for is Wilson’s assertion that ‘the excavators adjudged this to be a very unusual seam’. I have read through the section in which they discuss the stitching and fig.23 is presented as one of the six examples of stitching they choose to highlight with an illustration as typical but nowhere do they say that it ‘very unusual’. Today that stitch is a standard one,immediately recognised by my wife from the Masada figure as the same one used when two cloths are sewn together today. Common sense (not always the best guide) would suggest that this same stitch has persisted throughout history until today as it serves the simple purpose for which it was intended and there is nothing fancy or unusual about it. So if the fig.23 counter hemming stitch is the same stitch used on the Shroud it is simply saying that the Shroud stitchers used a conventional stitch and this does not tell us anything about the date that they did it. There is certainly no evidence that this kind of stitch disappeared throughout the Middle Ages and then popped up again in exactly the same form as in Masada just in time for my wife and her fellow seamstresses to use it as one of her standard stitches. I suspect it has simply gone being used throughout history as the easiest way to achieve what needs to be achieved when two cloths are being joined. My own feeling is that this stitch evidence gets us absolutely nowhere and like the cubits is just one of those bits of deadwood that need to be discarded as research on the Shroud moves on..","date":"2013-11-28","mins":"5:47 pm","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","title":"Unraveling Unusual Stitches in the Turin Shroud"},{"id":"comment-203991","author":"charles_freeman","post":"‘ The Turin Shroud is the most important and studied relic in the world.’ We often seem to read this but there has been actually a great deal more intensive research directly on the fabric and images ( writings,inks,etc,) of the Dead Sea Scrolls than of the Shroud and it has been undertaken by top level specialists in the relative disciplines. As the recent report on the Scrolls in Minerva, the international journal of art and archaeology, noted’ no other set of documents has been subjected to so many analytical techniques’. The main difference ,of course, is that the Scrolls, after a poor start, have been open to direct specialist examination with increasingly sophisticated equipment. I would certainly argue that we have learned more from the Scrolls than we have from the Shroud..","date":"2015-06-28","mins":"3:41 pm","url":"https://shroudstory.com/2015/06/28/update-on-new-book-by-giulio-fanti-and-pierandrea-malfi/","cat":"books","title":"Update on New Book by Giulio Fanti and Pierandrea Malfi"},{"id":"comment-145601","author":"charles_freeman","post":"Any microscopy from as far back as 1978 is hopelessly out of date anyway, so I think we need not bother about that ancient controversy. We just need to get the tapes looked at again in a 2014 lab if a representative sample of these tapes is still to be found. They are the only record of accretions to the Shroud that exist outside Turin and there must be lots on them that can be seen in 2014 that could not be seen by Mc Crone or anyone else in 1978..","date":"2014-08-23","mins":"5:52 am","url":"https://shroudstory.com/2014/08/22/looking-for-a-paper-by-mark-andersen/","cat":"paper_chase","title":"Looking for a paper by Mark Andersen"},{"id":"comment-183255","author":"charles_freeman","post":"The complexities are surely partly the result of the ageing process unless you think the Shroud is miraculously preserved exactly as it was first created..","date":"2015-01-14","mins":"12:54 pm","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","title":"Papers by the Skeptic of STURP"},{"id":"comment-210259","author":"charles_freeman","post":"I saw an interesting exhibition in ( the medieval) York Minster which showed how medieval craftsmen were adept at creating negatives of the positive stone work they were creating. If you are having to create an intricately carved piece of stone and work from an original block, but definition you will have a positive and negative as you separate them! Never underestimate the skills of medieval craftsmen just look at the roofs of a Gothic cathedral and think of all the carving and building skills needed!.","date":"2015-09-13","mins":"5:03 am","url":"https://shroudstory.com/2015/09/12/new-barrie-schwortz-podcast/","cat":"radio_and_podcasts","title":"New Barrie Schwortz Podcast"},{"id":"comment-182171","author":"charles_freeman","post":"I find it odd that when any standard work on painting on medieval linen, describes, with quotations from texts by medieval craftsmen such as Cennino Cennini, that linens were always sealed with a gesso before the painting was applied (as they still are), programmes such as this go on insisting that a painting would have soaked into the fibres. This is exactly what the craftsmen were trying to avoid as in many cases they did not want to clog up what might be a flag or banner that needed to flutter and often wished to create a different image on the other side which would be ruined if paint seeped through. This is such standard knowledge it annoys me when it is said that no one can understand why the images are on the outer fibrils only. That is exactly what experts in medieval linen painting would expect to find..","date":"2015-01-09","mins":"10:19 am","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"id":"comment-182300","author":"charles_freeman","post":"Russ, the skill of applying gesso was so as not to make the cloth rigid, that is why it is only applied on the outer fibrils of the cloth. If it went below the surface it would create a rigid cloth , as if it had been starched. Is would make it impossible to use painted linen as a flag or banner? STURP reported a frosty appearance to the surface of the the Shroud, found large quantities of calcium carbonate which is to this day used in making gesso. So we have good circumstantial evidence of an original gesso. A further close up examination is needed. What has to be explained is why the liquid on the Shroud,e.g. The bloodstains,did not not go into the capillaries of the fibres. This is easy to explain if the cloth was gessoed as it was just this dispersal that it was designed to prevent. It is more problematic to explain other reasons why the bloodstains show no sign of dispersal along the capillaries but no doubt someone has an explanation. I haven’t seen much focus on this issue but it is a central one if you are trying to explain the images. The images are not just on the outer fibrils only they have not dispersed along those outer fibrils. This is compatible with gesso as applied in line with Cennini’s instructions ( early fifteenth century although ,as he was writing in Tuscany , they tended to used calcium sulphate for their gesso ,not calcium carbonate which was used north of the Alps.) lots of work still to be done. And there has been the suggestion made to me by a physiologist that what STURP thought was human blood was, in fact, compatible with animal proteins but I am not qualified to make any judgement on that. It needs to be kept on the burner as a possibility though. Goodness knows we are nearly forty years on from 1978 and all those tests must be so dated!.","date":"2015-01-10","mins":"2:39 am","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"id":"comment-182315","author":"charles_freeman","post":"Good points, Hugh, but you will also note that Cennini insists that the gesso is applied with a knife so that any excess can be scraped off( hence ,of course, no brush marks). The key skill lies in getting as thin a layer as possible so you could still use the cloth as a flag or whatever. There has been an explosion of technical material on painted linens in the last ten years, a lot of it on how sophisticated the paintwork was with mixes of different pigments, layer upon layer, on the few survivors we have As years go by, anything coming from either Mc Crone or STURP is likely to be so dated as to be increasingly irrelevant. When professors reading the STURP reports today find them completely inadequate, then we know we need to move on. And one always has to remember that STURP did not provide a shred of scientific evidence that suggested that the Shroud was earlier than the medieval period. I quoted in earlier postings the essay on the York painted linens that told how easily the surface paint disintegrated unless they were later placed on a board backing these linen paintings had a very short shelf life linen was hardly high class compared to the wonderful silks and other cloths that were produced in quantities for aristocrats and so most were soon thrown away when the painted surface began to crack up. This is why, the expert opinion is, we do not have a single surviving painted linen from medieval England. We are all agreed that the Shroud needs more close up examination. What we do have now is a wealth of new material on how linens were prepared for painting and painted on since 1978 ( I.e. From close up examinations of the survivors rather than just relying on thee medieval texts) that has not yet been transferred into Shroud studies ( e.g. The results of the Zittau Veil restoration were only published in the mid 1990s and then only in German with a shortened English version in 2000). So once we do get another chance to examine the Shroud there will be a lot of new expertise to apply to it – and one would hope that the Turin authorities would only employ people who do have this expertise. I am surprised that they did not take the opportunity during the 2002 ‘restoration’ as a lot of these issues could easily have been sorted out then..","date":"2015-01-10","mins":"4:11 am","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"id":"comment-182218","author":"charles_freeman","post":"The Zittau Veil is very similar in the way shadowy images were left after the pigments had disintegrated. It is also like the Shroud in other ways in that some pigments went through the gesso, suggesting that finely ground pigments might get through when thicker pigments would not. Again the Zittau veil is made up of strips of linen between 108 and 116 cms wide, typical of treadle loom weaves , cf the shroud 113 cms. Hugh is right in that you cannot have sophisticated painting, and some surviving painted linens are very fine indeed, if there is a risk that the paint will disperse across the capillaries. That is why they took care in preventing this. Lots more research still to do but nothing as yet incompatible with a medieval origin..","date":"2015-01-09","mins":"4:54 pm","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"id":"comment-182608","author":"charles_freeman","post":"The amount of calcium carbonate is quantified in the physics and chemistry of the Shroud paper. I shall also provide a quote from Heller when I am in my study tomorrow that refers independently to large quantities of calcium in his book on the Shroud. There are two interlocking features of the issue. It is not just that there is evidence of calcium carbonate but that the surface of the Shroud is ‘ locked’ so that the image did not go through. It is this combination that is important as this is what one would EXPECT to find on a decayed medieval painted cloth. Of course, ‘ expect’ can all too easily slant one’s judgement but it is indicative of the Shroud having once been sealed in exactly the way the medieval craftsmen say it should be sealed before painting. I shall also provide a good paragraph on the Zittau Veil that also backs up this approach. The quantities of animal protein they found were actually very small but they were there. So more coming tomorrow!.","date":"2015-01-11","mins":"2:05 pm","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"id":"comment-182619","author":"charles_freeman","post":"Well, so far as I remember without checking the original, the STURP physics and chemistry report said calcium carbonate it depends on whether you think the report reliable or not. Someone like Hugh may have the report actually to hand but I will tomorrow. AFTER I had read up about painting on linen, I read the STURP report on the physics and chemistry for the first time and was amazed to find that they had found the image on the outer fibrils only when it was just this that I had been reading as the method of sealing linen before painting. It is obvious that you cannot paint on unsealed linen and it is hard to see how an actual body placed on an untreated linen would not put its sweat,blood ,etc, into the linen capillaries. I am not sure that I have seen this issue addressed but perhaps so done has an explanation, other than a sealed surface for liquids staying on just the very outside. I have also gone back to the comments made by Mike Spyer ,the professor of physiology, who read the Heller /Adler blood papers for me. He was ‘ totally unconvinced’of blood from what they had written and said that in any case the colour was wrong for dried blood. He made the extra point that they had failed to distinguish what were probably animal proteins from what they thought was blood. I am not a scientist and am cautious about all this but here is an expert who thinks that , even in what he considered the scientifically inadequate papers of Heller and Adler, there is separate evidence of animal proteins on the Shroud. Goodness we really do need some Independent experts to look at all this dated material again!.","date":"2015-01-11","mins":"3:02 pm","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"id":"comment-182636","author":"charles_freeman","post":"Well, we all know we need retesting of all this after nearly forty years. Mike Spyer found the papers by Adler and Heller inadequate so he could hardly use them to say whether there were animal proteins on the Shroud or not. He just felt, as I understand it, that what Heller and Adler described could also been explained as including animal protein. I can only pose specific questions I would like further independent and expert research on. The St Louis session on future testing seemed totally unable to suggest anything much. It gives the impression that research is stagnant and needs revitalising by a new group of researchers who are expert in weaving, medieval painting techniques on linen,the iconography of the Passion, the composition of the material on the surface of the Shroud ( are the original STURP tapes still together for further research or not? we never seem able even to find this out, let alone get the tapes subjected to the most recent investigation techniques)..","date":"2015-01-11","mins":"5:18 pm","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"id":"comment-182634","author":"charles_freeman","post":"Well, the image did not get through! It did not, as STURP found, penetrate further than the outer fibrils.so the word .’ Locked’ seems appropriate unless you can suggest a better word to describe why and how the image, wherever it originated, failed to penetrate the Shroud. I am open to suggestions..","date":"2015-01-11","mins":"5:06 pm","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"id":"comment-182640","author":"charles_freeman","post":"Yes, clear as to what the original reports said. But accumulations of dust seems very speculative. Calcium does not just float about in the air in the quantities found here and settle uniformly over a cloth that is held in the way the Shroud is when exhibited. ( If it was left in the open lying down this might have been a more plausible suggestion.) There are various ways of preparing flax for spinning and not all of them involve retting so this seems another long shot and no other examples of this happening have been reported. As I reported a couple of months ago, the BBC History people talked to me about my article as part of independent research they were doing. I heard later that they had talked to other people as well but I have since heard that no decision has been made as to whether they will do a programme or not. I told them it was absolutely essential that they get the evidence looked at by specialists who were totally Independent of the present debates. If the St. Louis conference could not even come up with a coherent plan for further research, when clearly there are many areas where further research is needed, then we need to move on to a new group of people who are prepared to start again. For a start let’s get it sorted once and for all if there is any known ancient loom capable of weaving a three in one herringbone linen of the size of the Shroud..","date":"2015-01-11","mins":"5:39 pm","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"id":"comment-182782","author":"charles_freeman","post":"We do have to draw on all the new expertise arising from the growing interest by specialists in painted linen cloths. I assume it is possible that some very finely ground pigments could make their way through the size while other pigments were too large to do so. In another article in the Villers book on two fifteenth century Italian painted cloths, authors Dubois and Klaase compare a Durer self portrait where the paint had got through the cloth with their two subjects ‘where the paint lies on top of the yarns and has hardly penetrated the fibres at all, In the Saint Jerome, apart from the sizing of the canvas, thus could be due to the thicker consistency of the paint, but in the Dead Christ Supported by Mourning Angels, a thorough sizing of the canvas prior to painting must account for this good isolation of the canvas from the fluid paint’. Again a lot of pointers for future research of the Shroud and its images. Yet another article in Villers talks of a cloth painting where the images have faded and lost their original sumptuousness. Well, it all speaks to me if to nobody else!.","date":"2015-01-12","mins":"6:08 am","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"id":"comment-182747","author":"charles_freeman","post":"Here are the two passages I promised. 1) From John Heller,’Report on the Shroud of Turin, Boston, 1983. P., 136. ‘Finally the results [Robert Morris’s paper] were presented, There was calcium on the Shroud lots of it. It was evenly distributed over the entire length and width. I wondered in the world it could have come from. It was not concentrated in the image areas, so it couldn’t have anything to do with paint, dye or stain’. This is all compatible with the sealing of the entire surface of the Shroud before painting had begun. 2)From ‘Technical Observations on the so called Grosse Zittauer Fastentuch’, in Villers (ed.) The Fabric of Images, London, 2000, p, 103. ( A must have book if you are discussing medieval painting on linen.) The Zittau Veil is important as parts have the original paint and parts have lost it leaving shadowy images similar to those on the Shroud. ‘The paint did not soak through the fabric and only a few spots of colour can be seen on the reverse between the yarns. Clearly the canvas [it is plain weave linen] must have been prepared with a glue size coating or priming layer and, in fact, protein was detected among the canvas fibres. Technical examination has confirmed the use of such preparatory layers in the Middle Ages. .. The technical treatises describe a range of preparatory applications to the canvas and not just glue size. The Nurnberger Kunstbuch (first half of the fifteenth century) mentioned a size described as stercken (Impregnating) applied with a bath sponge to both sides of the canvas. Alcherius/ Coene described a preparatory layer for gilding, painting and drawing on fabric supports containing gypsum with Armenian bole bound by parchment or leather glue. . .’ (They go on to describe other sizing materials before going back specifically to the Veil) ‘ On the Zittau Lenten Veil both a size coating and a priming layer have been found. In all cross sections the size can be seen lying directly on the fabric support [N.B.], covered by a thin ground containing chalk [ ?calcium] with a proteinaceous binder. This chalk is particularly finely ground. . .As this ground was found in all cross sections examined, it is assumed that it was a uniform coating [cf. Heller’s account on the calcium on the Shroud]. . .The ground successfully reduced the absorbency of the fabric and prevented the paint from impregnating the weave. Only the red pigment, identified as madder, has soaked deeper into the structure and can be seen on the reverse’. If this does not give suggest avenues for further research I don’t know what will!!.","date":"2015-01-12","mins":"3:04 am","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"id":"comment-183002","author":"charles_freeman","post":"Kelly. What I have provided is a mass of circumstantial evidence to suggest that the Shroud was sealed ( e.g. The image is one the outer fibrils only) as is typical of medieval painted linens (see my other posting),with the pigments now decayed, leaving only the shadowy images ( compare the images on the Zittau veil). The decay of the images is symbolised by the contrast between the enormous crowds able to see the images in the seventeenth century and the close up viewing needed today. As you may know one of my points is that we should be asking what the images were when the Shroud was originally created, not what they are now – this is the biggest wild goose chase of them all. We need to shift the whole focus of Shroud research and work on the depictions and descriptions from earlier times as one would normally with any artefact of this nature. (Why is the Shroud outside the normal approach to ancient objects?) Part of the circumstantial evidence is the examination of the Heller Adler papers by a professor of physiology who is not convinced by them and thinks that some of the findings are compatible with animal proteins ( this was his unprompted suggestion) and this would provide some evidence for a typical gesso mix. The professor has offered to pass everything on to a top haematologist but I have not taken this up. I will if there continues to be a challenge. As my posting on the Zittau veil showed there were many different ways of sizing (sealing) a linen cloth but the way in which the images are on the outer fibrils only are compatible with such a sizing and there are lots of other examples, now tested, that could be examined as a comparison with the Shroud. Calcium carbonate or sulphate is an ingredient of such sizing to this very day. So we need to broaden out research by looking at comparative examples it irks me when people say that the Shroud is unique and then i discover that they have never studied anything about medieval painted linens (as STURP openly admitted they had not!!). The Shroud may or may not be a medieval painted linen but it has many features that suggest that it is one whose images have decayed and to dismiss these out of hand is not serious scholarship. It is the most likely hypothesis for the images and it remains number one until someone provides something better so it is over to those who can provide a coherent alternative..","date":"2015-01-13","mins":"5:45 am","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"id":"comment-183053","author":"charles_freeman","post":"‘Large’ was the word used by STURP and Heller not by me. If the other linens were prepared to be painted on then they would probably have been sized, with gesso or an alternative so we need to know more about them and how the amount of calcium compared with the ‘large’ quantities apparently found on the Shroud. Please, even if you consider the dialogue at an end, provide the STURP reference for the calcium not being carbonate and if they suggest an alternative. If the Shroud was sized/gessoed, it might provide a pointer to where it was painted (e.g calcium sulphate used for sizing south of the Alps). I haven’t yet found anyone who has seen the ‘bloodstains’ who think they are actual human blood, but I will keep on asking! So far I have asked doctors, a criminal forensic expert and a professor of physiology and have drawn ‘no. It isn’ts’. At least we can agree that there is dispute over whether there is human blood on the Shroud,while in some circles it is still presented as fact. The AB information i have is that, probably not much before Ad 900, probably as a result of mingling of A and B on the Hungarian plains but the distributions suggests mingling further along that divide, as well, of course in the Far East (suggested date of emergence unknown). BUT no one can confirm any of this until they have ruled out the possibility of earlier AB. Personally I wonder if it is AB at all, though the blood of Christ is likely to be genetically interesting whatever..","date":"2015-01-13","mins":"12:00 pm","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"id":"comment-183057","author":"charles_freeman","post":"P.S. I am not a scientist so must leave the scientific evaluation of the ‘blood’ to those who are. So far, the opinions I have had is that the evidence is ‘totally unconvincing’. However,I am a historian of relic cults and the thirteenth to fifteenth century saw a mass of blood relics ( Bynum’s Wonderful Blood is the key text.) Some were believed to be the authentic blood of Christ gathered from the Cross, some were blood coming from crucifixes that had been struck by infidels, some again were from hosts that bled after transubstantiation to convince doubters or to leave a trail of those who had stolen them. With so much blood around it is not impossible that some was added to the Shroud for some reason or other, even if not as a deception but rather to increase its sanctity. That is why I keep an open mind on blood on the Shroud..","date":"2015-01-13","mins":"12:25 pm","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"id":"comment-214441","author":"charles_freeman","post":"Some time past, here I think, I gave details of medieval liturgies that referred to Jesus as the Nazarene so Frale is talking nonsense here. But why one would put a text on a burial shroud that would normally be hidden defeats me..","date":"2015-11-09","mins":"2:02 pm","url":"https://shroudstory.com/2015/11/09/because-i-dont-see-it/","cat":"video","title":"Because I Don’t See It"},{"id":"comment-173108","author":"charles_freeman","post":"Take out my mention of the D’Arcis memorandum and my argument remains the same. I passed my article through a prominent Oxford professor of church history and individual parts of it( on the weaving, ‘ human blood’ thesis ,etc) to specialists before I even submitted the the article to HT. I cannot believe that in the two months between submission and acceptance , the editor of HT did not pass it though some members of the very prestigious advisory committee of History Today. What else are they there for? I would have known by now if there had been any serious academic challenges to my article by fellow professionals. But, as I have said before, it will take a year to assess the academic credibility of my article. So far, so good, 20,000 hits virtually no hostile reactions apparently. If anyone from this website wishes to mount an academic challenge to it in an equivalent journal to History Today, please do..","date":"2014-11-26","mins":"9:36 am","url":"https://shroudstory.com/2014/11/25/environmental-study-of-the-shroud-in-jerusalem-videos/","cat":"video","title":"Environmental Study of the Shroud in Jerusalem Videos"},{"id":"comment-214524","author":"charles_freeman","post":"And how does Frale think the text was applied? You have to seal linen before you can paint on it, otherwise the image diffuses into the cloth, so it would have been quite a job , certainly not one one could do in the same day as the burial..","date":"2015-11-12","mins":"2:25 am","url":"https://shroudstory.com/2015/11/09/because-i-dont-see-it/","cat":"video","title":"Because I Don’t See It"},{"id":"comment-173117","author":"charles_freeman","post":"Yes,what would one expect?, but I have not found them convincing and if only posted here they won’t affect my standing in the wider academic world which is why I added the final sentence of my last posting. It’s there where the debate is going to be won or lost..","date":"2014-11-26","mins":"10:02 am","url":"https://shroudstory.com/2014/11/25/environmental-study-of-the-shroud-in-jerusalem-videos/","cat":"video","title":"Environmental Study of the Shroud in Jerusalem Videos"},{"id":"comment-192533","author":"charles_freeman","post":"The professionals ( e.g. Experts in recognising bloodstains or the scientific evidence for them) I have consulted both over the red marks on the Shroud and in the findings of Adler and Heller all agree that this is not dried blood. However, bearing in mind the many blood cults of the fourteenth century and their popularity and the lucrative possibilities of having Christ’s blood (e.g the monastery at Hailes in England built their main building from the fruits of pilgrims visiting their relic of Christ’s blood), it is quite possible that real blood was added to the Shroud. In this I am not supported by the expert opinion I have consulted but in an age when consecrated hosts bled ( e.g. After transubstantiation with what the Church insisted was the ‘real’ blood of Christ), crucifixes spurted blood from the body of Christ when hit by heretics or Jews and there were many shrines claiming to have the blood of Christ, the Shroud could hardly be left out! So I am just keeping the remote, and it is very remote, possibility that Adler, Heller, etc, were right open. So what is wrong about this?.","date":"2015-03-05","mins":"1:02 pm","url":"https://shroudstory.com/2015/03/05/keeping-an-audience-in-suspense/","cat":"television","title":"Keeping an audience in suspense"},{"id":"comment-192517","author":"charles_freeman","post":"If you can put SOME evidence that offers us sceptics a reason to consider that the linen of the Shroud has a date from before AD 1000 we shall be happy to consider it..","date":"2015-03-05","mins":"11:27 am","url":"https://shroudstory.com/2015/03/05/keeping-an-audience-in-suspense/","cat":"television","title":"Keeping an audience in suspense"},{"id":"comment-190781","author":"charles_freeman","post":"Galatia is in modern Turkey not Greece. The Galatians were originally Celts who were defeated by the Attalid dynasty of Pergamum and later settled under Roman rule in central Anatolia. I can’t see any reference to a burial shroud here but if so it would presumably have been in one of the cities visited by Paul so one would need to follow that up. Is the suggestion that the Shroud was in central Anatolia in the middle of the first century?.","date":"2015-02-12","mins":"4:24 am","url":"https://shroudstory.com/2015/02/07/more-press-coverage-of-the-upcoming-cnn-series-about-jesus/","cat":"uncategorized","title":"More Press Coverage of the Upcoming CNN Series About Jesus"},{"id":"comment-211095","author":"charles_freeman","post":"Noted Colin’s belief that personal attacks take knowledge further..","date":"2015-09-24","mins":"3:15 pm","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"id":"comment-215288","author":"charles_freeman","post":"Lots of good Catholics think that the Shroud is medieval. The scientific question of whether the Shroud is fourteenth century or first century is independent of anyone’s faith. The Shroud does not show any process of Resurrection it is of a dead man..","date":"2015-11-29","mins":"8:16 am","url":"https://shroudstory.com/2015/11/29/new-very-short-video-from-national-geographic/","cat":"video","title":"New, Very Short Video from National Geographic"},{"id":"comment-211618","author":"charles_freeman","post":"There is no need to use me as a refuter of Wilson’s theory as far more distinguished scholars have rubbished it. In fact, when I had my article checked by one of the Byaantine scholars mentioned, I was asked why I bothered to respond to someone who had absolutely no academic qualifications in this field. Wilson admits that he cannot even read Byzantine Greek. Markwardt’s thesis rests on. ‘an awesome icon’ he finds referred to in Antioch. By this period icons of Christ were quite common so there is no reason what this particular one should have anything to do with the Shroud. In fact it would be very unlikely. As it was not until the eighth century that Christ was ever shown dead so this ‘awesome icon’, like the Image of Edessa, would be of Christ when alive. So the basic plank in Markwardt’s theory collapses. As many authenticists are only interested in the Shroud, they fail to recognise that images of Christ were common, in the Roman catacombs from c. 250, with the first bearded Christ’s recorded in Rome in about 300 and then in the east the images of Chirst in the Dura Europus church of c. 240 ( assumed by some experts to be the earliest representations of all). If whenever an image of Christ is mentioned it is assumed to be the Shroud then we would have fifty or sixty alternative histories! Why not start with some of the ones in Rome you can easily construct a history in which Peter takes the Shroud with him to Rome and that is why the first images of the bearded Christ are seen there!! Even more so as we know that many relics from Rome were taken up to France. One can reconstruct any number of imaginary journeys for the Shroud if all you need to start with is ‘an awesome icon of Christ’..","date":"2015-10-01","mins":"7:31 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"id":"comment-211648","author":"charles_freeman","post":"Bearing in mind the large number of different images of Christ from the third century onwards, some of which achieved scared status, we would need to find one that is unequivocally a double image of the dead Christ to be able to even start reconstructing a pre medieval past for the Shroud. As, for various theological reasons, early Christians were reluctant to show Christ as dead, we have no representation of him, even on the Cross, as dead before the eighth century crucifixion image from St.Catherine’s Sinai, For us historians, no references, no evidence, all that is left is speculation. Just don’t start with assuming that ‘An awesome icon’ of Christ in Antioch has anything to do with the Shroud. Why should it? Certainly Markwardt provides no evidence to suggest that it might be so why take anything that follows from this speculation seriously? I have recently been consulted over a proposed TV programme on the Holy Grail, the producer of which made the similar mistake of thinking any early cup mentioned must be the real thing! So far there are two hundred contending cups!.","date":"2015-10-02","mins":"2:04 am","url":"https://shroudstory.com/2015/09/22/recent-interview-with-russ-breault/","cat":"video","title":"Recent Interview with Russ Breault"},{"id":"comment-77991","author":"charles_freeman","post":"I have a chapter on the Gnostics in my A New History of Early Christianity and this meant that I had to read widely, even trying to plough through translations of several of the bizarre Gnostic texts found in the Nag Hammadi library. I never came across a single reference to any kind of physical representation of Jesus and doubt whether the Gnostics, who believed that the material world was evil, would ever have expressed their beliefs in this way.(Incidentally if you come across a two programme documentary called The Bible Hunters, coming out in the UK on this 13th and 20th February on BBC 2, 9 pm, and apparently on the Smithsonian channel in the US, then you will see me being interviewed about these texts.) I think it is odd to say ‘there is no other explanation’ and therefore it follows that the Gnostics made it. I just don’t follow it why them ? I still think that so long as the Shroud is not allowed to be examined using the latest technology, its secrets are probably going to be revealed by someone working on other ancient linens in a conservation lab somewhere, who may never even have heard of the Shroud. That is often the way these so called ‘mysteries’ are solved (as in the case of the dating of the four horses of St,Mark’s when other examples of similarly gilded copper could be dated and this knowledge was then applied back to the horses)..","date":"2014-02-10","mins":"4:29 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-78084","author":"charles_freeman","post":"That is a good quote, David but the position with Irenaeus is very complicated because one of the results from the findings of the Nag Hammadi texts is that many people who Irenaeus labelled as Gnostics did not fit into that category at all and he seems to have used the term for a wide variety of his rivals. This whole area is extraordinarily difficult because so few of the original texts survive ( see a programme called The Bible Hunters (!), though I have not seen it myself yet). The quote does make the point that many Gnostics saw Christ as just ONE of several philosopher figures who brought light into the darkness of the evil material world so the question of how far they were Christians in the normal sense of the word is debatable. This is a real academic minefield!!!.","date":"2014-02-10","mins":"1:10 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-189596","author":"charles_freeman","post":"I expect Russ’s experience will be similar to my own – these people who ring up have no background in history, let alone the history of relic cults or knowledge of ancient artefacts, so they are hardly able to discriminate between the different pieces of evidence they come across from different interviewees. I have heard nothing about whether BBC History are to do something on the Shroud but I do know that things I told them was then referred back to specialists ,e.g. One of the weaving experts I had consulted told me that they had also been on to her to talk about ancient and medieval weaves. The last I heard the proposal was working its way slowly through the BBC hierarchy of approval. I definitely got the impression from the Cross programme that they were really only interested in authenticity stories and they were certainly not interested in the experts who had been working on the mythical background of True Cross stories. So very different from the approach of the BBC ..","date":"2015-02-06","mins":"2:58 am","url":"https://shroudstory.com/2015/02/05/set-your-dvr-an-unprecedented-cnn-event-on-march-1/","cat":"video","title":"Set Your DVR:  An Unprecedented CNN Event on March 1"},{"id":"comment-189459","author":"charles_freeman","post":"It is not CNN who are making the programme – they have simply bought it from a company whose name I forget who consulted me for the Relics of the Cross programme. I know of no experts who believe that there are any genuine fragments of the Cross and I sent them some articles ,etc, by the leading authorities but their interviewer seemed to be working on the premise that there were and I heard nothing more from them. I shall be interested to hear what scientific evidence exists for the Ascension..","date":"2015-02-05","mins":"5:23 pm","url":"https://shroudstory.com/2015/02/05/set-your-dvr-an-unprecedented-cnn-event-on-march-1/","cat":"video","title":"Set Your DVR:  An Unprecedented CNN Event on March 1"},{"id":"comment-182991","author":"charles_freeman","post":"I was intrigued, in another extract, to see Barbara Frale still claiming that there is lettering on the Shroud. In her authoritative manner she claims that no one in the Middle Ages would have used the word Nazarene to relate to Christ. But if she had studied her medieval liturgical texts she would have known that the response to the angel at the Quem Queritis ceremony ( the angel asks the Three Marys, Quem Queritis, ‘whom are you seeking’ when they come to the tomb ) is: ‘Ihesum Nazarenum crucifixum’. This is the standard response. I know Wilson has dropped her but she keeps on appearing as an authority!! and on the hitherto respectable Smithsonian too. Don’t they run these things past experts on medieval texts before they are broadcast?.","date":"2015-01-13","mins":"4:10 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","title":"Smithsonian Channel:  Is it the greatest prank ever pulled?"},{"id":"comment-183093","author":"charles_freeman","post":"Carlos your last sentence. I totally disagree we need many more experts from outside with relevant skills and expertise, in fields such as weaving in ancient and medieval times, the iconography of images of the Passion, the way in which linens were painted, especially when images have decayed, how the the Shroud ,if medieval, need not have been designed as a forgery. Of course, they must do some study of the Shroud but it is vastly more important that the Shroud is compared with other cloths and relics and not treated as if it were somehow unique. Many features of the Shroud can be compared to similar ones found elsewhere but this is an area where the research has hardly begun. I was interested in an article I read on painted linens some time ago ( I think it was from the later 1980s or early 1990s) when the author just mentioned, in an aside, the Turin Shroud as a typical medieval painted linen as if there was no argument about it. She did not even think that she needed to say anything more..","date":"2015-01-13","mins":"4:56 pm","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","title":"Smithsonian Channel:  Is it the greatest prank ever pulled?"},{"id":"comment-183004","author":"charles_freeman","post":"Frale is on the second extract the one about the Vatican. I see they are recycling Garlaschelli too he is still locked in the idea that the Shroud was created as it is now but at least he realises that the pigments were once there – he thinks they were deliberately removed in the Middle Ages but this would not explain the many seventeenth century depictions we have that suggest otherwise. Why rule out natural decay of the surface for which we have lots of evidence for other linens?.","date":"2015-01-13","mins":"6:02 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","title":"Smithsonian Channel:  Is it the greatest prank ever pulled?"},{"id":"comment-183099","author":"charles_freeman","post":"Having talked to BBC History ( who make programmes directly for the BBC and not through an intermediary) about the Shroud I can see why this programme has not appeared on BBC. I was, quite rightly, grilled on everything I said, and this was when, so far as I know, no programme has even yet been commissioned and this was just preliminary research. They made it clear that they would check everything I said independently with an expert ( one or two of whom I had myself been in contact with). So Barbara Frale would, I hope , have been picked up for her misleading comments but I suspect they soon spotted that this was not up to standard academically as soon as they peer reviewed it. Still there are BBC programmes that dumb down so one never can be sure which way it would go. I would hope that if a Shroud programme ever happens it is of equal standard to the forthcoming Wolf Hall series which promises to be the BBC at its best..","date":"2015-01-13","mins":"5:37 pm","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","title":"Smithsonian Channel:  Is it the greatest prank ever pulled?"},{"id":"comment-183189","author":"charles_freeman","post":"Colin, you have ruined my day! What I am hoping to get is the odd free lunch as offered me today by yet another TV producer who gas enjoyed my article!.","date":"2015-01-14","mins":"4:30 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","title":"Smithsonian Channel:  Is it the greatest prank ever pulled?"},{"id":"comment-183102","author":"charles_freeman","post":"Colin, you can follow me up under ‘Charles Freeman Yale University Press’ easily available online and then access the Yale US website and look up my Holy Bones and read the reviews. I then shall await your assessment as to whether I am a genuine historian or not. The only point I was making is that this particular scholar did not see anything unique about the Shroud it fitted into the SUBJECT of the article on medieval painted linens and she had far more interesting ones to discuss. For her it was obviously run of the mill, mentioned as a matter of interest. So far as I remember this article was just after the carbon dating and the Shroud had been defused as a serious academic subject..","date":"2015-01-13","mins":"5:43 pm","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","title":"Smithsonian Channel:  Is it the greatest prank ever pulled?"},{"id":"comment-183171","author":"charles_freeman","post":"We writers live in a free world and I have written many books and I have had everything from abuse to praise but always continual work from respected sources, the last three publications by university presses.. Perhaps to balance Colin’s cherry picking you should go ,as I suggested, to the Yale University Press US site( they have kept the reviews up to date ), access Holy Bones and read the review extracts. You will see why I feel I have some reason for attempting to place the Shroud within the wider world of relic cults..","date":"2015-01-14","mins":"2:40 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","title":"Smithsonian Channel:  Is it the greatest prank ever pulled?"},{"id":"comment-183017","author":"charles_freeman","post":"David. I am happy to be corrected, especially as this is close to my thesis that what we are left with on the Shroud is images after the pigments have fallen off. I am not sure why the frottage technique was needed. How does he explain the images just being on the outer fibrils does his theory cover that? As you will know, I also believe that this was never intended to be a forgery. No one would have been taken in by a cloth with images on it when none are mentioned in the gospel sources. That is perhaps why the Cadouin Shroud, with its historical background in the Holy Land (actually an Islamic cloth), pulled in the pilgrims over centuries and outclassed the Shroud until the Savoys got it and (in my opinion) realised that with the images as they existed then, they could exhibit before mass audiences. Thanks for your (Spanish) comments on my article..","date":"2015-01-13","mins":"7:23 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","title":"Smithsonian Channel:  Is it the greatest prank ever pulled?"},{"id":"comment-183243","author":"charles_freeman","post":"Actually Hugh, it wasn’t this one, but very similar in that it mentions the Shroud as an aside. I remember reading it in an article in a journal I was not able to take out of the Cambridge University Library! There were three in one herringbone silks in the third century AD – one was found as far east as Palmyra but they were all in silk and so very upmarket from humble linen. The V and A three in one is the only one I know in linen other than the Shroud. On your earlier posting: ‘If the Shroud was much brighter and clearer than it is now, Charles needs to explain how such a uniform disappearance of pigment might have occurred, the apparent absence of any protein to bind the gesso, and the faint images that appear in copies’ I don’t think the disappearance of the pigments would have been uniform. A clue to why not can be seen from the depiction of the exposition of 1868 by Ferdinando Perrin, reproduced on page 296 of Beldon Scott (I assume that all you keen Shroud researchers have got your copies of Beldon Scott by now!). Perrin shows the dorsal image pretty complete but the frontal image as virtually invisible from the waist down in fact it begins to fade from the shoulders down. I take these depictions with caution you really need to have several ones by different artists to compare against each other but it is hard to know why Perrin painted so faded a frontal image but a much more intense dorsal image if this is not what he actually saw in 1868. It is also interesting that the 1868 exposition –the last for thirty years was the first one in which they placed the Shroud in a frame and kept it within the cathedral. In 1842, the exposition before, it was still being held in the open by the clergy from the balcony at the Palazzo Madama. So what had changed? Had there been a marked deterioration of the pigments as apparently recorded by Perrin? Perhaps we can get into the cathedral archives for the mid nineteenth century. . . . Lots of further work to be done here. ‘The apparent absence of any protein’. Below is what Mike Spyer said when he had read the Heller/Adler papers. ‘The studies are all equivocal and would in my view fail to distinguish from the presence of other human or animal materials. There may well be proteins etc.’ So we certainly cannot rule out animal proteins. It is clear from what Kelly has said that there is a lot of confusion over this issue and certainly it seems difficult for anyone to be committed to the certainty of human blood any longer. Perhaps we have moved on here. Faint images in copies. Yes, but this is vastly outweighed in numbers by all the depictions and descriptions of the Shroud that remark on the intensity of a Shroud that seemed to attract very large audiences (compare today’s single file close up). We MUST have a database of all these depictions, descriptions, copies, etc with open access to scholars, before we can move further on this one. We have to define the features of the Shroud that are seen again and again in past depictions but are now missing, the long hair at the back (not a pony tail), the gap between the elbows and sides of the dorsal image (making it impossible for these to be the same arms as those of the frontal image), the thumbs which are usually shown jutting out at the same angle by different artists, the Crown of Thorns (that is also mentioned in descriptions). . . The loincloth, probably added after 1563, is an interesting historical titbit. I was interested to read in Villers, ‘The Fabric of [medieval] Images’ that they did repaint linens that they valued. Serious research on the Shroud has scarcely begun so much time has been wasted going down dead ends and ending up saying it is a mystery. Yet the more I talk to professional weavers, the more I hear that a cloth of this size, pattern and length is typical of a medieval treadle loom. (The sixth widths of the treadle loomed Zittau Veil make up 6.80 cms in total – do the maths for yourself to establish the average width of the linens and forget about Assyrian cubits! Even today one of the standard widths of a treadle loom is 45 ins.) Remember we have to fix the origin of the weave before we need to worry about the origin of the images. On origin we also have to explain the Z twist in the yarn. But at least we are debating relevant issues..","date":"2015-01-14","mins":"11:31 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","title":"Smithsonian Channel:  Is it the greatest prank ever pulled?"},{"id":"comment-183257","author":"charles_freeman","post":"I am sorry but there is so much material out there that needs to be brought into the debate!.","date":"2015-01-14","mins":"12:56 pm","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","title":"Smithsonian Channel:  Is it the greatest prank ever pulled?"},{"id":"comment-183417","author":"charles_freeman","post":"‘ All needs to be considered.’ Agreed. Obviously it is a muddle at present and little can be said with any certainty. . You will have noted my personal caution on this because of the large amount of cults involving blood of Christ and others in the fourteenth century. There was certainly a lot of blood associated with relics at that time. One monastery even had the actual liquid blood of Christ and they were one up on those who only had the dried variety. With bleeding hosts and crucifixes there was just a lot around..","date":"2015-01-15","mins":"2:03 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","title":"Smithsonian Channel:  Is it the greatest prank ever pulled?"},{"id":"comment-183310","author":"charles_freeman","post":"This was a private communication to me not a public one but Mike Spyer agreed that his name could be quoted in my footnotes to the article in relation to what he had found. I think people who want to go further on this should get their own specialist to read the papers. All he was really saying was what he had read was ‘ totally unconvincing’ as to human blood and I see no reason why he should be asked to go any further to discuss proteins as I never asked him about them the only thing I asked about was the presence of human blood and he tentatively mentioned proteins but this does not mean he ever made a proper study of them. Why should he reread all this stuff – and I sent him every page I could find which he read several months ago after he had been one of my ‘students’ on one of my study tours. Also Mike Spyer said he could pass everything on to a haematologist if I wanted although he could not see why this would come up with anything different. I take responsibility for what he said as part of my own research which I used for my article but this does not make him someone anyone else can access. He is a very busy man and did this for me as a special favour as he had enjoyed my tour. I don’ t think he should be involved ‘publicly’ any more than he agreed to be, which was to have his name attached to the quotation he made. Remember he is a 2014 expert, Heller and Adler were working nearly forty years ago. There is really no comparison as things have moved on quite dramatically. I was talking to an elderly GP who said it was amazing what they know about blood know that they did not know when he started practising. Applying 2014 knowledge is quite likely to rule out what might have been unclear when Adler and Heller ( and their expertise in these matters is disputed by some) were working all that time ago..","date":"2015-01-14","mins":"5:40 pm","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","title":"Smithsonian Channel:  Is it the greatest prank ever pulled?"},{"id":"comment-183426","author":"charles_freeman","post":"“Hailes Abbey became a site of pilgrimage after Richard’s son Edmund donated to the Cistercian community a phial of the Holy Blood, purchased in Germany, in 1270. Such a relic of the Crucifixion was a considerable magnet for pilgrimage. From the proceeds, the monks of Hailes were able to rebuild the Abbey on a magnificent scale.” (Wikipedia) See what I mean about the importance of blood this was later said to be duck’s blood refilled at regular intervals but the incentive was there!.","date":"2015-01-15","mins":"2:53 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","title":"Smithsonian Channel:  Is it the greatest prank ever pulled?"},{"id":"comment-183446","author":"charles_freeman","post":"And there is the bloodstained corporal of Bolsena, traditionally dated to 1263 , and still a major cult today. Some say that the face of Christ can be seen on the bloodstained cloth. So with so much money to be made from these thirteenth/ fourteenth century blood cults, blood, real or alleged, human or animal, on a relic of this period must always be viewed with caution as possibly added or created. If there is blood on the Shroud it may only because it was following the trend of t He day and have been embellished to give it greater impact. It may not even have been added to deceive anyone as, although many early observers of the Shroud noticed the intensity of the blood ( quotes in my article) , it does not seem to be the blood as such that they venerated ( well, the sources could be interpreted differently on this). But the incentive to associate blood with relics was certainly there..","date":"2015-01-15","mins":"4:01 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","title":"Smithsonian Channel:  Is it the greatest prank ever pulled?"},{"id":"comment-183019","author":"charles_freeman","post":"P.S. Where I went wrong was to think that Garlaschelli argued that the pigments were removed by the original appliers of it and that he was showing in his oven how they did it!.","date":"2015-01-13","mins":"7:40 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","title":"Smithsonian Channel:  Is it the greatest prank ever pulled?"},{"id":"comment-183037","author":"charles_freeman","post":"The article was submitted as a whole. Both parts were scrutinised by the HT advisers and both parts passed in front of a prominent Oxford professor of church history before they went up. The decision I made in discussion with the editor was, seeing the total length of the original article which he wanted to publish unshortened, whether to publish it in consecutive issues or to publish both parts simultaneously with the second in the digital edition and then the whole article (without the illustrations that were too expensive to buy for the www) freely online. As HT are pushing their digital edition we decided for the latter in the hope of bringing in new readers across the divide between print and digital. Judging by the large number of hits the article has had it looks as if we made the right decision. I am flogging a dead horse with you Colin but not with other specialists in this area who feel I am moving things on after a period of stagnation in Shroud studies. As you will know, the copies are not much use (although the ‘naked’ Lier copy is useful in providing yet more information that the loincloth was added in accordance with the 1563 decree of the Council of Trent), you need to look at the actual depictions, a whole range of them, to isolate the features originally on the Shroud that are now lost. I look forward to hearing of other examples of ancient linens that have calcium on them that can be traced back to the retting. It is a new one on me but I suppose one could have retting in a limestone area even though flax was not always prepared by retting but by putting out in the sun. I do want to know of other known examples before I buy this one otherwise it is just possible that it was dreamed up by someone. . .. It was STURP who suggested calcium carbonate but it is quite possible that they got it wrong. It can be calcium sulphate, of course it varied from one part of Europe to another with the Alps the divide between c carbonate (north) and c. Sulphate ( south). And there were other ways of sizing but ‘large’ quantities of calcium (STURP/Heller) did catch my eye. The image is on the outer fibrils only. You either have an unsealed cloth with a body that (?miraculously) transferred its liquids but knew when to stop and how to prevent them spreading further into the capllaries or a sealed one that locked out the liquids, pigments, whatever that were applied to it. We have no known example of the former but lots of the latter as you will see from the postings I have put up. But, thank goodness, I do not have to convince you of anything Colin I am going for the specialists in these things and it is no disrespect to you that I have never seen any evidence that you have studied the specific ways of putting images on medieval ( or earlier) linens.There are people who have these are the ones I have to convince!.","date":"2015-01-13","mins":"10:04 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","title":"Smithsonian Channel:  Is it the greatest prank ever pulled?"},{"id":"comment-183096","author":"charles_freeman","post":"I agree that there IS no painted image on the Shroud today, although a new microscopic examination nearly forty years of technological advance on from 1978 might still find evidence of pigments. The question is whether there were originally painted images as the Benedictine monk of 1449 thought there were, ‘wonderfully painted’. That is where the research needs to focus and be carried out by people who actually work with these things in laboratories – so that rules ME out. As everyone knows by now, it is the further research, some of which needs direct access to the Shroud and some, the relationship of the measurements of the Shroud to different kinds of loom, for instance, does not, that I am pushing for, especially the research which does not need direct access to the Shroud as we may actually be able to find a professional who can be brought in to do it now. Taking up Carlos’s point from below, I cannot see why you have to make any special study of the Shroud to relate its measurements to the range of looms that we know existed. It is the expertise of people who know about looms that we need!.","date":"2015-01-13","mins":"5:16 pm","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","title":"Smithsonian Channel:  Is it the greatest prank ever pulled?"},{"id":"comment-149389","author":"charles_freeman","post":"Whether the linking of the finding of the True Cross was linked to Helena in the 320s or 390s, I agree that relics and imperial prestige were linked from the fourth century onwards and this continued for centuries. The use of the Shroud by the Savoy family to maintain their prestige is, in fact, a classic example. This is one of the reasons why relics, especially of objects, the Cross, nails, Crown of Thorns, and further down the hierarchy ,shrouds, rather than bones became prominent after the integration of Christianity with the imperial authorities. I used the example of Thomas Becket in my introductory chapter of Holy Bones to show how a martyrdom led to miracles and to a pilgrimage shrine..","date":"2014-09-08","mins":"2:53 am","url":"https://shroudstory.com/2014/08/11/the-top-ten-relics-of-christ/","cat":"video","title":"The Top Ten Relics of Christ?"},{"id":"comment-149210","author":"charles_freeman","post":"Relic cults only really began in the fourth century, three hundred years after the Crucifixion, and even then major figures such as Basil of Caesarea felt they were a diversion from the true worship of Christ. His view re emerged in the iconoclasm of the eight H century and the Protestant Reformation when relics were bundled up and burned. We would not have the Turin Shroud if it had been housed in England..","date":"2014-09-07","mins":"4:43 am","url":"https://shroudstory.com/2014/08/11/the-top-ten-relics-of-christ/","cat":"video","title":"The Top Ten Relics of Christ?"},{"id":"comment-149293","author":"charles_freeman","post":"I am not sure what I have done to deserve the reputation of being a compulsive lie er! There were certainly attempts to preserved the bodies of martyrs for veneration but I do not know of a single case where they caused miracles or were used as an intercession to Christ as the normal relic cults did from the fourth century onwards. One must also remember, as I do recount in my book Holy Bones, that there were indeed pagan ceremonies of veneration of the bodies of heroes and Christians followed pagan rituals here ( see Ramsay Mac Mullen’s The Second Church). I would certainly not see these as uniquely Christian relic cults in the way that such cults developed from the fourth century onwards. The earliest relics from the life of Christ and the Virgin Mary are not recorded until the fourth centur Y and even then were contested as relevant means of worshipping Christ. The earliest mention of Helena’s discovery of the True Cross is 395. All the fourth century legends/ accounts talk of relics hidden since the Christian Era being discovered for the f Irst time then. There were later legends giving relics of the Passion,,etc, an earlier history but scholars see these as legends. It is interesting to read how Augustine at first rejected miracles through relics but over thirty years came to accept them. Many Christ Ian churches, including the early church, have survived without relics. They have not been seen by many Christians as relevant to Christian worship and at the Reformation were actively derided as objects of superstition. I have no problems with OK disagreeing with me but I cannot see why I should need to tell lies!.","date":"2014-09-07","mins":"3:00 pm","url":"https://shroudstory.com/2014/08/11/the-top-ten-relics-of-christ/","cat":"video","title":"The Top Ten Relics of Christ?"},{"id":"comment-209041","author":"charles_freeman","post":"‘ Rome does monitor what is being said everywhere.’ Quite like the old days then..","date":"2015-08-26","mins":"3:53 pm","url":"https://shroudstory.com/2015/08/26/youtube-of-barrie-schwortz-at-ahmadiyya-annual-convention/","cat":"video","title":"YouTube of Barrie Schwortz at Ahmadiyya Annual Convention"},{"id":"comment-209092","author":"charles_freeman","post":"Surely the problem has been the lack of monitoring, especially within the Vatican City itself – see also under Bank, Vatican. Meanwhile whole regions such as Ireland have been effectively lost to the Church. I cannot imagine that anyone commissioned by pope Francis to clean all this up and reassert authority is going to be reading this blog. Relics are no longer a big issue within the Church as Catholic faith is in no way dependent on them. Pope Francis did no more than convention required in offering veneration of the Shroud. I am also mystified at Louis’ comments on Hugh who seems to be approaching the issues with a much more open (intellectually) and generous mind than most..","date":"2015-08-27","mins":"4:26 am","url":"https://shroudstory.com/2015/08/26/youtube-of-barrie-schwortz-at-ahmadiyya-annual-convention/","cat":"video","title":"YouTube of Barrie Schwortz at Ahmadiyya Annual Convention"},{"id":"comment-166474","author":"charles_freeman","post":"‘ large’ was the word used in the STURP 1982 paper for the calcium carbonate. I have not got it to hand but perhaps in a footnote they have attempted to quantify it – otherwise I agree that it does seem rather vague. But where are the tapes from 1978 to quantify it?.","date":"2014-10-29","mins":"4:03 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"}]
