[{"id":"comment-191143","author":"charles_freeman","post":"O.K. So follow my advice and get working on them! Just as the so called mystery of the Shroud will probably be solved, and maybe sooner than you think, by comparison with similar features of other objects so might the so called mystery of the sudarium be solved by the same methods, researching objects that have been found in the same original context. This obsessive focus on the Shroud to the neglect of other relics which may or may not be authentic is very strange..","date":"2015-02-15","mins":"5:51 pm","url":"https://shroudstory.com/2015/02/15/important-new-pollen-discovery-on-the-sudarium-of-oviedo/","cat":"press_coverage","title":"Important New Pollen Discovery on the Sudarium of Oviedo?"},{"id":"comment-191172","author":"charles_freeman","post":"I agree with Stan that most of these so called relics were never intended as forgeries. They were simply unexplained artefacts which were lying around or stored somewhere and of unknown provenance to which legends became attached. In many cases they became ‘live’ after someone reported a miracle or vision. It was sometimes at this point that a canny operator declared the artefact to be an authentic relic and the shrine may or may not have become established depending on whether the church tried to close it down. Very often the Church went half way as Clement VII did with the Shroud in 1390 not authentic but worthy of veneration.j Pollen analysis has made enormous strides in the last two decades as computers and optics have allowed pollen to be analysed more effectively. It is now a major part of any archaeological dig so there will be lots of experts around for those who wish to consult them. Pollen appears, of course, in a large number of ancient contexts. As Hugh has pointed out in the British Society bulletin there are major problems with the pollen on the Shroud. It is one more area where recent advances would allowing a total rethink of the evidence..","date":"2015-02-16","mins":"3:00 am","url":"https://shroudstory.com/2015/02/15/important-new-pollen-discovery-on-the-sudarium-of-oviedo/","cat":"press_coverage","title":"Important New Pollen Discovery on the Sudarium of Oviedo?"},{"id":"comment-191137","author":"charles_freeman","post":"The story goes that the sudarium was one of many relics from the last week of Christ’s life that were kept in a chest apparently made by the apostles themselves. Unless the others were thrown away , they will provide evidence that will support or deny the authenticity of the sudarium, yet they are never mentioned by all these enthusiastic researchers. They certainly provide better evidence than this elusive pollen! And what if the other relics in the chest prove to be later than the first century or even to have a carbon date similar to that of the sudarium e.g AD 700..","date":"2015-02-15","mins":"4:00 pm","url":"https://shroudstory.com/2015/02/15/important-new-pollen-discovery-on-the-sudarium-of-oviedo/","cat":"press_coverage","title":"Important New Pollen Discovery on the Sudarium of Oviedo?"},{"id":"comment-174772","author":"charles_freeman","post":"The point remains that there is the assumption that the Image on the Shroud now is the same as the image of the Shroud in some previous century when quite clearly it is not. Obviously one can discuss what were the differences between now and then at different points in the past centuries but to assume that the Shroud has been physically inert for centuries is very unlikely in view that it has not been given special conservation care..","date":"2014-12-05","mins":"1:06 pm","url":"https://shroudstory.com/2014/12/05/paper-chase-new-observations-on-the-sudarium-of-oviedo/","cat":"archaeology","title":"Paper Chase:  New observations on the Sudarium of Oviedo"},{"id":"comment-174748","author":"charles_freeman","post":"Who first thought up the idea of a pigtail? Every depiction of the Shroud from the Lier copy onwards shows the long hair round the back of the head. The pigtail effect is only where the original has deteriorated..","date":"2014-12-05","mins":"7:42 am","url":"https://shroudstory.com/2014/12/05/paper-chase-new-observations-on-the-sudarium-of-oviedo/","cat":"archaeology","title":"Paper Chase:  New observations on the Sudarium of Oviedo"},{"id":"comment-215603","author":"charles_freeman","post":"One must always remember that the Sudarium was only one of a cache of Passion relics, including a phial of the blood of Christ, that was found to be in the chest when it was opened in medieval times. ( the chest itself was said to have been made by the apostles.) Unless the other documented relics from this chest have been lost, then they should be tested too to give the wider context of the Sudarium. There is no justification for isolating and highlighting the Sudarium as it would certainly be less important than the phial of Christ’s blood..","date":"2015-12-04","mins":"2:24 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215605","author":"charles_freeman","post":"One of the lines I would like investigated is whether the double image of the Turin Shroud is actually derived from earlier Spanish examples. It would mean a lot of painstaking. Work on the Spanish images without the assumption that they all derive from the Turin Shroud. Perhaps David Mo can know someone who would be interested..","date":"2015-12-04","mins":"2:31 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215614","author":"charles_freeman","post":"It is a pity that Crispino did not give any reference for her assertion about Cardinal Gorrevod. If one reads the actual account of the St.Clare’s nuns, it is quite clear, and in this they echo the report of Antonio de Beatis in 1517, that there was a lot more to the images in the sixteenth century than can be seen today. This is born out by any study of the depictions of the Shroud expositions, of course. Fanti at least made the point that linen degrades over time so that one should not expect the Shroud to be now as it was then ( this point is crucial to his dating hypothesis). He does not seem to have grasped that the images also will have degraded, and probably more so than the actual linen. The question is establishing what they were originally. Colin appears to believe that they exist now as they always have done which seem a surprising position for a chemist to hold. In my archaeological past, we just assumed that,apart from special objects like gold, anything old would have been degraded by the passage of time and the original form of the object might not be recoverable. This seems the best position from which to start understanding the original make up of the Shroud images..","date":"2015-12-04","mins":"5:45 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215678","author":"charles_freeman","post":"We don’t know the extent to which the Shroud might have deteriorated by 1534 but we can be sure from the descriptions and depictions that the images had a lot more to them then that they have now. The blood appears to have been much more prominent to observers than it is now and the Crown of Thorns still appears to have been in place with the hair long round the back. I agree with Colin that we just need detective work by specialists. If a Penny Black, printed with 1840 methods, has been kept dry in a stamp album, it will have kept close to the original. According to the sources we have on painted linens (which include valuations which show how quickly newly painted cloths lost their value), an unstable cloth, subject to its surface being folded and unfolded, will have in the vast majority of recorded cases, seen its images disintegrate quite quickly. According to the specialists such as the late Caroline Villers this is the best explanation for cloths such as the Shroud (‘The Turin Shroud ,one of the best known surviving medieval images on a textile support’) but, as I have said, before, one awaits more systematic examination with modern scanning technology within the assumption that it likely that with its history of continual display in the open air and visible to large crowds that the surface of the Shroud is not what it once was..","date":"2015-12-05","mins":"6:43 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215805","author":"charles_freeman","post":"As the Turin Shroud has nothing whatever In common with the Edessa image, I cannot see the relevance. The description Max gives is typical of sacred images which someone wants to pass off as somehow miraculous as the Edessa image was assumed to be. How could the Edessa image be described as anything else if it was assumed to have the imprint from the moisture of Christ’s face on it. You would blow your cover if you described it as ,say, a painted cloth..","date":"2015-12-07","mins":"11:48 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215838","author":"charles_freeman","post":"There is nothing to link the Shroud of Turin with the Image of Edessa except in the imagination of I an Wilson and his followers who should have applied some more common sense to the issue. The Parthenon Cloth was always folded tetradiplon , e.g doubled four times to make sixteen layers, as can be seen on the cloth on the Parthenon frieze in the British Museum, so we have a precedent here to signify a cloth which has a sacred quality. For years now as a result of following Wilson , no one has followed up the other leads which are established by ordinary historical methods,e.g. The first millennium tags on relics from Jerusalem including the ‘ Lord’s Tomb’ that are to be found in churches such as Chelles close to Lirey. Let’s get some real history, not imagination, into this one, Max!.","date":"2015-12-07","mins":"5:57 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215873","author":"charles_freeman","post":"Max if you go to a Greek lexicon and work you way through the150 plus words beginning with tetra, the most likely translation is doubled over four times, as the Parthenon cloth was ( and so we have a good precedent for a cloth actually folded this way). It is just possible that it could mean doubled into four, e.g. Doubled twice, although, if this was the Shroud, this would leave a half figure exposed. My guess is that tetradiplon came generically to mean ‘ sacred’ after many centuries of being the way that the ‘sacred’ Parthenon cloth was folded, and so gave status to the cloth that was given to Jesus to wipe his face on but this is purely speculative. Wilson’s images show it doubled three times into eight so he is clearly out of the running on this one. Wilson has muddied the waters in other ways, although those who actually believe his myth are also to blame. Not only has he discouraged research in alternative routes of the Shroud to Lirey but ,through the r Idicule he has earned from Byzantine scholars ( as you will find if you actually talk to scholars working in this complex field of Byzantine relic texts), he has discredited Shroud research in general. P.S.If you happen to believe that de Clari saw the Turin Shroud in the Blachernae Church, then you need to research the origins of that relic collection. You will find that it leads back to the early fifth century Pulcheria , sister of the emperor Theodosius II , who imported relics direct from Jerusalem. No need to have the convoluted Edessa route which has a complete blank for the first five hundred years in any case. A direct Jerusalem link either to Constantinople or Northern France, both of which are documented for relic transfers, would be much more likely. And it might just be the case that the shroud was made in Europe on a medieval treadle loom in the early fourteenth century ( and it is a pity that the B Bc could not afford to employ the weaver who said that she could recreate it on her treadle loom to show it was done)..","date":"2015-12-08","mins":"3:48 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215958","author":"charles_freeman","post":"Max anyone looking at Wilson’s illustration can see that he is misleading here. That sort of mistake is why he is not taken seriously as a professional historian. And if you read on in the tetradiplon article you will find that the burial shroud of Christ is referred to as a separate cloth from the one offered to Jesus. So the tetradiplon text is actually one that shows that the Image of Edessa is not a burial shroud. Wilson misleads everyone in his text by suggesting that the word tetradiplon is used of the cloth after Jesus used it , not before. You seem to have been one of the many people misled by his text. There is absolutely b no evidence that the Image of Edessa was refolded as tetradiplon any more than there is evidence that the tetradiplon Parthenon cloth was refolded that way either. If you were researching any exotic object in Europe whose origin was in the east, you would assume that it came along the documented trade routes. Similarly those who believe the shroud originated in Jerusalem should take as their starting point the documented relic routes from Jerusalem to Northern France and from Jerusalem to Constantinople as their starting point, especially when we have relics from the ‘ Lord’s tomb’ in northern France.","date":"2015-12-09","mins":"2:54 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215922","author":"charles_freeman","post":"Max, I cannot believe that after years of Wilson reproducing his three doublings into eight you were the very first to spot something which is quite obvious except to those who believe that Wilson is some sort of guru whose word cannot possibly be challenged. No idea about tetraplon – why is this relevant? Note: the word tetradiplon is used only of the cloth BEFORE Christ wiped his face with it no text says that it was folded back this way. I have no idea why a solitary scholar who probably never saw the Image of Edessa described it as a himation. No Byzantine scholar, and I mean people who actually can read original texts unlike Wilson, supports the Edessa theory. You seem to be in the group who accept it as true and try and manipulate texts to fit it rather than just accepting that it is without any foundation. But good luck anyway it is just a pity that the endless attempts to make texts fit an imagined journey divert attention from the other possible and more likely routes of the Shroud from Jerusalem to Lirey, whether it came via Constantinople or not. I agree with you over the Turin Shroud being used at Easter – in the Quem Queritis ceremony most likely. I suspect that when the Three Mary’s entered the ‘tomb’ to retrieve the Shroud, carrying an incense burner as the ritual for this ceremony demanded, they spilt the incense as they bent down to pick up the shroud!.","date":"2015-12-08","mins":"3:20 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215963","author":"charles_freeman","post":"Colin – why is this hilarious? There is tons of evidence of documented relic routes, notably, of course, from the Holy Land both before and after the Crusades. The route to northern France the most relevant for anyone researching the origins of the Shroud is explored by Michael Mc Cormick in his The Origins of the European Economy AD 300 900, Cambridge University Press, 2001, Chapter Ten, ‘Hagiographical horizons: collecting exotic relics in early medieval France.’ The theme of this chapter is the revival of early trade in the Mediterranean, notably between the early Islamic states and mainland Europe. Mc Cormick uses the evidence of relic collections in northern France that survive with their original tags attached to show that there was an early trade in relics between the Holy Land and France. These relics include those from the ‘Lord’s Tomb’’ In addition to the northern French collections at Sens and Chelles, Mc Cormick provides a text from the ninth century abbot of St.Riquier thanking the pope for sending him relics. After acknowledging the gifts from Rome he goes on to talk of his relics from other sources: ‘from Constantinople and Jerusalem, by the ambassadors sent there by more Lord [the pope], and next relics sent to us from Italy, Germany,Aquitaine, Burgundy and Gaul by the most holy Fathers. There was, in fact, a busy trade in relics along documented routes, one of which was from Jerusalem to Constantinople in the years before Jerusalem fell to the Arabs. Constantinople. I attach a short extract from Holgar Klein the expert on relics in Constantinople, from his’ Sacred Relics and Imperial Ceremonies at the Great Palace of Constantinople’ – found online on Holgar Klein’s website. He gives many more examples of relic transfers but Jerusalem to Constantinople was the obvious one, attested as early as the 320s when Helena sent Constantine relics. ‘Apart from relics intended for private use and possession by members of the court, there were others that should develop a more prominent profile. One such relic arrived in the capital from Jerusalem around 421.45 Granted in exchange for an imperial gift of money for distribution to the needy and a golden, gem studded cross to be erected on Mount Golgotha, the archbishop of Jerusalem sent the right arm of St. Stephen to Constantinople, where it was received with great honor and deposited in a small church, newly built by the emperor’s sister Pulcheria Augusta inside the Great Palace (fig. 1).46 Further relics of St. Stephen arrived in the capital in 438. As recorded by Marcellinus Comes, they were brought back from Jerusalem by the emperor’s wife Eudokia and deposited in the church of St. Laurence, another church associated with the name of Pulcheria.47 Earlier the same year, on 27 January 438, Constantinople had celebrated the arrival of the relics of St. John Chrysostom, whose body was brought to the capital from Komana, the city of his exile.’ You, as a scientist, might believe that Wilson is a professional. I can assure that he is treated with ridicule by other professional historians. ..","date":"2015-12-09","mins":"4:11 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-216014","author":"charles_freeman","post":"So the pray Codex is a Benedictine production? Well, I prefer that Max is just having us on it is much more entertaining to read his posts that way..","date":"2015-12-09","mins":"11:28 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215989","author":"charles_freeman","post":"Having seen numerous paintings with sarcophagi and tilted lids, I just love Max’s explanation for the cryptic Shroud. It really has lightened my day! I still can’t make out whether Max thinks he is being serious or whether he is having us on!.","date":"2015-12-09","mins":"8:24 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-216040","author":"charles_freeman","post":"I asked you for your evidence that it was a Benedictine production. No description of it suggests this but no doubt you can give a Hungarian Benedictine monastery that used Hungarian rather than Latin for their texts. So please go ahead!.","date":"2015-12-09","mins":"3:23 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-216067","author":"charles_freeman","post":"I am not saying that it is not a Benedictine production I am being neutral,of who produced it you are the only person I have ever come across who says that the Pray Codex do you mean all the texts or just this picture is Benedictine in origin so I am asking you why you think this. You would need to provide a Benedictine monastery which is a pioneer in writing its texts in Hungarian rather than Latin and explain why it did so. So far as I know the Pray Codex has not been linked to any monastery but you obviously know better. Substance to your assertion,please. And please don’t a wriggle out again Hugh and I are on your case!.","date":"2015-12-09","mins":"5:48 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"}]
