[{"title":"Several Mark Antonacci  Talks in St. Louis  Starting Next Week","post":"I have a smoke detector near my closet. So now, using Antonacci’s methods, I have scientific proof that my Green Bay Packers hoodie was in Jesus’ tomb and that the Resurrection was a nuclear event.\n\n","date":"March 7, 2014 at 6:50 am","url":"https://shroudstory.com/2014/03/07/several-mark-antonacci-talks-in-st-louis-starting-next-week/","cat":"event","id":"comment-85835","author":"Paulette","site":"shroudstory"},{"title":"Several Mark Antonacci  Talks in St. Louis  Starting Next Week","post":"Dan’s comment was right on the money. There is a conference scheduled in October in St. Louis. That might be an ideal place to discuss how to go about new tests. I have my own drum to bang: multi-spectral digital analysis of the entire Shroud which could preserve for all time the data on the present composition of the shroud and actually allow it to be shared in study centers around the world.\nOne person Dan didn’t mention in his comment was Father Peter Rinaldi. He was unique combination of Turinese altar boy and American priest. In 1933 as a seminarian in Turin he actually was an interpreter at the informal scientific discussion that emerged. \nWe don’t have that now and a single individual’s petition project will not change things.\nBruno Barberis who had some interesting things to say at the Valencia Conference in 2012 is the head of Turin Centro and will be in St. Louis. I may be a bit optimistic or naive but when they say “all roads lead to Rome,” I think as far as the Shroud is concerned, “All roads lead to Rome via St. Louis.”\n\n","date":"March 7, 2014 at 7:36 am","url":"https://shroudstory.com/2014/03/07/several-mark-antonacci-talks-in-st-louis-starting-next-week/","cat":"event","id":"comment-85846","author":"John Klotz","site":"shroudstory"},{"title":"Several Mark Antonacci  Talks in St. Louis  Starting Next Week","post":">>There is a segment of Christianity that pushes a Christian triumphalism and the Shroud could be be exploited by them<<\nA question: why is it okay to routinely characterize Christians in this way, but we must all subscribe to the idea that the original C-14 scientists were all \"honest men\"?.I'm not saying they weren't, but even Thomas De Wesselow in his book \"The Sign\"(which argues against a literal Resurrection and can't be characterized as \"pro Christian\" ) says that fraud could have been involved in the 1988 tests. I have no idea what happened, or why. But it's disconcerting to see Christians characterized as \"triumphalistic\" when we live in a world where people see scientists as infallible, and where Christians barely speak up for their rights in an increasingly hostile world.\n\n","date":"March 7, 2014 at 8:52 am","url":"https://shroudstory.com/2014/03/07/several-mark-antonacci-talks-in-st-louis-starting-next-week/","cat":"event","id":"comment-85864","author":"Larry","site":"shroudstory"},{"title":"Several Mark Antonacci  Talks in St. Louis  Starting Next Week","post":"“That mixture then emits neutrons (half life approx.10 days) and before you know what the Shroud will then be impregnated with radioisotopes such as chlorine-36 and calcium- 41”\n& also, I might add, C14… If it’s that easy to fool the C14 experiment why wasn’t it discredited for the same reason?\n\n","date":"March 7, 2014 at 9:12 am","url":"https://shroudstory.com/2014/03/07/several-mark-antonacci-talks-in-st-louis-starting-next-week/","cat":"event","id":"comment-85868","author":"Mike M","site":"shroudstory"}]
