[{"title":"Ash Wednesday 2013","post":"Ash Wednesday…..”and to dust you shall return”.  In September, 1998 the Buddhist monk Khenpo A-Chos passed from this world by dissolving his body into a stream of light leaving nothing behind except the burial clothes.   Called the Rainbow Body,  he followed in the footsteps of the thousands of practitioners, ordinary people like you and me,  who preceded him, all of whom exemplified the ultimate in love, compassion and abstention from indulgences of all types in their earthly lives.   Kind of adds new meaning to the words used at Ash Wednesday services.  Perhaps the words should be amended to say “…..but only if you so choose.”\n\n","date":"February 13, 2013 at 8:41 am","url":"https://shroudstory.com/2013/02/13/ash-wednesday-2013/","cat":"event","id":"comment-24141","author":"Tom Devins","site":"shroudstory"},{"title":"Ash Wednesday 2013","post":"Ash Wednesday, a timely reminder that the false impression of our permanence here on earth is but an illusion – our mortal remains shall inevitably return to the dust of the earth whence they came.  “Memento homo quia pulvis es, et in pulverem reverteris!”  The beginning of Lent, its origins no doubt connected to the spartan conditions at one time prevalent in the late northern winters.  \nHere in the antipodes the standard liturgical calendar is disconnected from the natural cycle of the seasons, so we shall observe Lent at the time of harvest, celebrate the new life of Easter with a winter ahead of us, Advent at the end of spring and the coming of the Light of the World in mid-summer.  We have long given up the early immigrants’ culinary habits of a hot roast and sticky pudding at Christmas time in favour of a ham salad, or else throwing a trout or sausage on the barbie, perhaps during an outing to the sea-side beach.  \nNevertheless the seasonal liturgies remain popular, with crowded churches at Easter and Christmas.  Marking Pope Benedict’s announced resignation, the Wellington Dominion-Post editorial commented that Catholic church congregations in NZ were dwindling.  That is not my experience.  The three Sunday Masses in my fairly spacious parish church are still all well-attended, with a multi-ethnic congregation, truly catholic in the broadest sense.  \nA similar pattern seems evident in other southern countries.  What can rival the pre-Lenten fiesta of any South American country?  In the Philippines, the Good Friday penitents out-rival their northern counterparts with their excesses of self-flagellation and crufixion simulations.  \nLast night, I attended a joint Catholic-Anglican service for the distribution of the ashes at our local Anglican church.  Despite earlier services in the day, both congregations were well-represented in a near-crowded church.  And I obtained a bonus by being asked to proclaim the reading from 2 Corinthians.  It all went remarkably well.  I nearly forgot to mention;  The lady host celebrant performed her priestly duties competently, assisted by her deacon and deaconess, and our own parish priest.  Joint Ash-Wednesday services in NZ are now an obligatory requirement of both episcopal conferences.\n\n","date":"February 14, 2013 at 6:30 am","url":"https://shroudstory.com/2013/02/13/ash-wednesday-2013/","cat":"event","id":"comment-24203","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Ash Wednesday 2013","post":"It is not inevitable that our earthly remains shall return to dust.  The Rainbow Body adepts in the Buddhist tradition, the Tamil Siddhas in Hinduism and Enoch, Elijah, Moses, Jesus and  Mary in the Christian tradition (not to mention over 100 accounts of incorrupt bodies) all avoided “return to dust.”  How?  They took lifestyles of love (promoting happiness), compassion (eliminating suffering) and ascetic values to the extreme.  They walked the walk.  The words on Ash Wednesday, “….to dust you shall return” need to be modified to say, “….to dust you shall return, provided you so choose.” We are all spiritual entities seeking a human experience and not the other way around.  Death and decay are the result of the spiritual us being overly caught up in the material world causing us to lose our way.  As it turns out, the Essenes and Gnostics were right after all.\nToday’s faithful would categorically reject that message because it tampers with otherwise plush and  comfortable lifestyles and membership would decline as would the proceeds in the Sunday collection plate. But, the facts are the facts are the facts.  We all have free will and can have an opinion about anything one wishes to opine about.  But, you cannot have an opinion about fact.\nThe human mind as a serious defect.  It can’t take a joke.  So, if you keep saying something over and over it will accept it as fact no matter how wrong it might be and the conscious self will act accordingly.  Politicians have known about this defect for eons and fully take advantage of it at the peril of the unsuspecting.  We need to stop accepting the certainty of death and decay. Death and decay are  alternatives, not fate.   Lets face it; Adam and Eve are corporate characters, it is  not possible to build a boat that will hold two of every creature (let alone find two of every creature) and God is not a man that lives up in the sky, having a son but not being married, and he does not have a super computer that keeps track of every deed, good and bad, that his subjects commit.  The sooner we admit to these things the better off the world will be. The first step is to stop saying it.  The only way to cure a broken leg is to recognize that the leg is broken.\nAnd, while churches may be full from time to time, the fact is in the U.S.  30% of the people raised Catholic leave the Catholic faith before their late 20’s. My impression is that a similar thing is happening in Europe.  Were it not for the influx of Mexican immigrants the US Catholic population would be in serious decline. \nOn top of that,  almost 50% of those who claim to be Catholic practice the “cafeteria” version of the religion.  They freely choose their personal preference on a variety of key issues, such as Original Sin, abortion rights, gay marriage, Mary’s virginity, transubstantiation and even the divinity of Jesus.  About 40% of U.S.  Christians believe in reincarnation and another 25% remain open to the possibility.  The notion of Jesus’ second coming and the faithful being raised on the last day has been relegated to myth and metaphor. The Church has lost control of the congregation.\nThe faithful speak proudly of the way the Church has held steadfast to its 2,000 year old traditions.  I stand disappointed, even embarrassed,  in front of my non-Catholic friends,  that this powerful institution has arrogantly refused to update its teachings and bring them inline with modern advances in Biblical scholarship,  archaeological discovery, quantum physics,  East-West dialogue and social understandings.   Ask the Dali Lama what he would do if science proved Buddhist teaching to be in error and he would say “change the teaching”.  Ask the Pope what he would do if science proved Catholic teaching to be in error and he would say, looking down his nose on the questionnaire,   “Sonny (or young Lady) we are the truth, science is wrong.” \nSpeaking of truth, truth be known, the Church is so culturally invested in what it says and does that it cannot change and preservation of its priestly structure has taken priority over propagation of the truth and mediating salvation.  The new Pope has a lot of work to do.\n\n","date":"February 14, 2013 at 11:05 am","url":"https://shroudstory.com/2013/02/13/ash-wednesday-2013/","cat":"event","id":"comment-24235","author":"Tom Devins","site":"shroudstory"},{"title":"Ash Wednesday 2013","post":"Mr Devins may exercise his right as a free human being to adopt his own particular version of “cafeteria Catholicism”, even to denying the inevitable.  The gospels tell us that even the elect may be deceived towards the end-time.  It is an act of beneficent Providence that the Holy Spirit informs Church teaching nonetheless.  It is a matter of history that ever since the Roman hierarchy discovered its mistake in condemning Galileo, (WHICH IT HAS SINCE FORMALLY ACKNOWLEDGED) that it has welcomed the discoveries of Science.  A case in point is that of Nicolaus Steno (1638-1686), pioneer geologist.  Gottfried Leibnitz and the Catholic Church were among the few supporters of Steno, when other scientists and others were still claiming that seashell fossils in sedimentary rocks were the relics of Noah’s flood! Recent popes have welcomed the “Big Bang” hypothesis for Creation, while several American Catholics with their cafeteria approach and Southern Baptists are still recovering from the after-effects of the Stopes Monkey trials in USA.\n\n","date":"February 14, 2013 at 3:42 pm","url":"https://shroudstory.com/2013/02/13/ash-wednesday-2013/","cat":"event","id":"comment-24273","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Ash Wednesday 2013","post":"We could argue forever over the Church’s response science.  But, the cold hard fact remains, ordinary people have been able to avoid “returning to dust” , the last such incident taking place in September, 1998 in Tibet. The next most recent incident took place in 1955. Before that it was 1948.   The Catholic Church, through Father Francis Tiso’s on-site investigation,  has confirmed the most recent incident.  (See Father Tiso’s web-site to learn of his substantial credentials).  How come I don’t hear about it from the pulpit on Sunday morning?  “…to dust thou shall return…..but only if you so choose.”  The incident sends shock waves through the entirety of Christian thought, undermining the notion of Original Sin all the way to the Resurrection on the last day.  If the Church is so progressive in dealing with new revelation, when can I expect a response?  How much longer will this vital piece of salvation information continue to gather dust in the Vatican library?\n\n","date":"February 14, 2013 at 4:11 pm","url":"https://shroudstory.com/2013/02/13/ash-wednesday-2013/","cat":"event","id":"comment-24280","author":"Tom Devins","site":"shroudstory"},{"title":"Ash Wednesday 2013","post":"Wasn’t Stopes (Marie Charlotte – promoter of contraception) but Scopes! \nScopes Trial: (July 10–21, 1925, Dayton, Tennessee, U.S.), highly publicized trial (known as the “Monkey Trial”) of a Dayton, Tennessee, high-school teacher, John T. Scopes, charged with violating state law by teaching Charles Darwin’s theory of evolution. In March 1925 the Tennessee legislature had declared unlawful the teaching of any doctrine denying the divine creation of man as taught by the Bible. World attention focused on the trial proceedings, which promised confrontation between fundamentalist literal belief and liberal interpretation of the Scriptures. William Jennings Bryan led for the prosecution and Clarence Darrow for the defense. The judge ruled out any test of the law’s constitutionality or argument on the validity of the theory, limiting the trial to the single question of whether John T. Scopes had taught evolution, which he admittedly had. He was convicted and fined $100. On appeal, the state Supreme Court upheld the constitutionality of the 1925 law but acquitted Scopes on the technicality that he had been fined excessively. The law was repealed in 1967.  \nIn 1967!!! Some right-thinking good religious Americans are still struggling with the decision while the rest of the Catholic world moves on!\n\n","date":"February 16, 2013 at 3:33 am","url":"https://shroudstory.com/2013/02/13/ash-wednesday-2013/","cat":"event","id":"comment-24414","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Ash Wednesday 2013","post":"1967 wasn’t anything like the end of legislative fundamentalism. There was Arkansas in 1981, when Stephen J. Gould was one of the scientific witnesses, and then Louisiana in 1987, when 72 Nobel Laureates (Crick and Watson, for example, and Linus Pauling, Luis Alvarez and Murray Gell-Mann) weighed in against creationism, and I believe the most recent was in 2005, when a Pennsylvanian School Board insisted that Intelligent Design be taught alongside evolution in biology classes. I wouldn’t bet on having seen the last of it yet!\n\n","date":"February 16, 2013 at 7:13 am","url":"https://shroudstory.com/2013/02/13/ash-wednesday-2013/","cat":"event","id":"comment-24428","author":"Hugh Farey","site":"shroudstory"}]
