[{"title":"Shroud Exhibit in Small Town, Rural Canada","post":"I think that you know what are the known Hessdalen lights.\n>The presence of strange balls of light hovering over a valley in central Norway has baffled scientists for years.\n>Known as the Hessdalen Phenomenon, the flashing orbs can be as large as cars and have even attracted attention from ufologists.\n>But now scientists think the unusual lights could be formed by a natural ‘battery’ buried deep underground, created by metallic minerals reacting with a sulphurous river running through it.   … … … …\n>Some of the lights drift gently through the sky for up to two hours, while others flash white or blue and streak through the valley, disappearing in seconds, New Scientist reported.\nLink:\nhttp://www.dailymail.co.uk/sciencetech/article-2632650/Has-mystery-glowing-Norwegian-orbs-solved-Expert-claims-underground-battery-creates-amazing-light-show.html#ixzz3HdOqBsWL \nI am curious to know whether similar phenomena occur in Canada .. \nThe idea of being able to use that energy to get fingerprints intrigues me.\nTo capture the electric charge (or “the energy of the plasma”) perhaps you could use a ball (perhaps suitably shaped) coated linen …\nThis balloon would be to position a few meters above the river (River Hesja, in the case of Hessdalen).\nWhat do you think?\nMaybe the ball will break … and you will not get anything?\n— —\nHere the explanation about the energy produced:\n>Jader Monari (of the Institute of Radio Astronomy in Medicina, Italy) found that rocks in the valley are rich in zinc and iron on one side of the river running through it, and rich in copper on the other side.\n>Monari then used rock samples from the site in Oslo to create a miniature valley and dunked them in river sediment.\n>He found that electricity flowed between the two rocks and that this could light a lamp.\nDr Monari believes bubbles of ionised gas are created when sulphurous fumes from the River Hesja react with the humid air of the valley.\n>The geology also forms electromagnetic field lines in the valley, which could explain why the orbs of light move around.\nHow to capture that energy without danger?\nI have some doubts about my previous hypothesis ball covered with linen…\n— — —\nAurora borealis.\nI have just found a map for the best places in Canada to view the northern lights:\nhttp://www.canadiangeographic.ca/magazine/jf13/map/\nPerhaps there are no rocks in the canadiain valleys rich in zinc and iron on one side of the river running through it, and rich in copper on the other side (with the sulphurous water in the river creates a giant battery!)…\nSo …\nWhere can we look for the best site?\n\n","date":"October 30, 2014 at 9:49 am","url":"https://shroudstory.com/2014/10/30/shroud-exhibit-in-small-town-rural-canada/","cat":"exhibition","id":"comment-166900","author":"piero","site":"shroudstory"},{"title":"Shroud Exhibit in Small Town, Rural Canada","post":"Errata corrige.\nInstead of:\n>I have some doubts about my previous hypothesis ball covered with linen…\nCorrection:\n>I have some doubts about my previous hypothesis : a ball covered with linen…\nInstead of:\n>canadiain valleys\nCorrection:\ncanadian valleys\n—————–\nProbably the search for particular geological conditions in Canada (zinc and iron on one side of the river running through it, and rich in copper on the other side ) make long the waiting time for the working hypothesis…\nIn other words: the geological nature of the Norwegian valley\nmight have a decisive bearing on the origin of the phenomenon.\nAndif you want to read up well then consider the study:\nHessdalen a Perfect “Natural Battery”\nby\nJader Monar, Stelio Montebugnoli and Romano Serra\nLink:\nhttp://www.itacomm.net/PH/2013_Monari_et-al-en.pdf\nThe missing piece to support the “natural battery model” was identified in\n2012, with the re-discovery of the local sulphur mines (active until 1933)…\nand the cold plasmas/ion bubbles in Hessdalen are ionised aerosols\noccurring when the sulphur gaseous emissions (= H2S, SO2, SO3,\nfrom the subsoil) meet the persistent humidity of the valley.\n— —\nHere few words about the use of advanced microscopies :\nperhaps scientists could now be on the verge of solving riddles\nof Image Formation for the Shroud of Turin.\nBut they must check with the most modern technology what are\nthe results from the experiments on Image Formation.\n— — —\nHessdalen’s atmosphere as source for electric esperiments on linen.\nHow to use the energy coming from the electric field?\nPerhaps we can try to do something using an helium filled balloon\n(and then there are also some safety problems to take into account!).\nThe balloon can be flown from the neighborhood of the river Hesjia\nin order to reach the ionized cloud …\nIn my opinion the idea of the work “with the ball coated flax”\n(and see also : covering the ball with treated linen or not…) can be seen as\na working hypothesis for the development of a physical model to test.\nNow I want to know which are your interesting objections to the practical control\nof the working hypothesis (about BIF [= Body Image Formation] on linen)…\n\n","date":"October 31, 2014 at 9:57 am","url":"https://shroudstory.com/2014/10/30/shroud-exhibit-in-small-town-rural-canada/","cat":"exhibition","id":"comment-167237","author":"piero","site":"shroudstory"}]
