[{"title":"Ash Wednesday","post":"Beautiful.\n\n","date":"February 22, 2012 at 2:16 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8643","author":"Maria","site":"shroudstory"},{"title":"Ash Wednesday","post":"The Anglican (= Episcopalian) and Roman Catholic Bishops of NZ have directed that wherever possible the Lenten ashes be administered in a joint Liturgy of the Word service (excludes Holy Communion).  We’ve done this for a few years now, and are getting better at each time.  Last evening I attended the service at our nearby St Christopher’s Anglican church which was well-supported by both our local congregations.  I was asked to deliver one of the readings which was taken from 2 Cor 5.\n\n","date":"February 22, 2012 at 3:32 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8644","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Ash Wednesday","post":"TURIN SHROUD: AN ARCHAEOPERCEPTIVE GAME FOR CHILDREN?\nBTW, do you know the very name of “Christopher” comes from the Greek “kristos-phoros” and might well be understood in the light of the Turin  Shroud as a cryptic reference to “Christ[‘s burial Shroud] bearing [his flesh & blood image].\nCannot you ears hear?\nAll the more so as the legendary saint is described, in the late antique hagiographic key scene, as A GIANT IN MIDSTREAM carrying the INFANT JESUS on his shoulders.\nCannot your eye see?\n(To see the scene, first take a look at the whole front image on the Turin Shroud held in a vertical position. At scale 1/1, doesn’t the Shroud man look like a GIANT? Then just consider the zigzag weave patterned lengthy sheet.\nCannot it evoke the iconographic reduction of a river or ford? VVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVV\nVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVV\nNow, look at the back and front discontinuous images of the head and squint.\nCannot you find where the infant Yeshua is? Etc. ;-)\n\n","date":"February 23, 2012 at 9:10 am","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8649","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ash Wednesday","post":"Corrections: “and might well have to be understood”\n                    “flesh & blood image]?\n                    “Cannot your eyes see?”\n\n","date":"February 23, 2012 at 9:25 am","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8650","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ash Wednesday","post":"Fascinating piece of cryptic arcanery from Max! Tempting thought BUT:-\nLegend of St Christopher dates from the third century, possibly a little early to be a cryptic reference to the Shroud as I suspect it would not be adequately known about until the sixth century.  Though one of the most popular saints, there is no certainty that St Christopher existed historically (==> good cryptic argument). According to the Roman martyrology, he died in Lycia under the Roman emperor Decius (c. 250).  In 1969 his name was dropped from the calendar of the Roman Catholic church, and his feast day is no longer obligatory.  A pity, as some of my non-Catholic acquaintances have mentioned that he was one of the few saints they believed in.\n\n","date":"February 27, 2012 at 11:17 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8787","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Ash Wednesday","post":"Dave wrote: Tempting thought BUT:-Legend of St Christopher dates from the third century, possibly a little early to be a cryptic reference to the Shroud as I suspect it would not be adequately known about until the sixth century.\nDave,\nActually “Sindonocryptography” might well have started as early as the 3rd century and even before i.e. in parallel with cryptochristianism. My opinion is most if not all of late antique Christian hagiographic legends and apocalyptic visions have a sindonocryptographic substratum (I have done quite a research work on this.  E.g. John’s Revelation can be read in cryptic conjunction i.e. in “primary visualisation” with the Shroud image as oversized Rorschach. Too bad it was damaged in the 1532 fire (meaning a few of John’s visions “sindonocryptographically” are now lost on us).\n\n","date":"February 28, 2012 at 6:58 am","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8793","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ash Wednesday","post":"Max, If Shroud = Mandylion (Sorry, Yannick) then cloth disappeared between 57AD and 525AD and was forgotten, although I could concede it may have been known in Syria.  John the disciple saw the linen cloths in the tomb, but he may not be the writer of Revelations.  My understanding of Revelations (I’ve just spent the last year with my Study Group on this book) is that its purpose is an apocalyptic vision written to give hope to the persecuted Christian churches under Nero and his successors.  It is packed solid with OT allusions e.g. Ezekiel and Daniel.  I don’t see that it has any cryptic references to the Shroud image, but maybe you can drop a few hints about this. I do recall that the horseman (“Faithful and True”) of Rev 19:11-16 wore a cloak that was blood-stained BEFORE he went into battle and that the following army of horsemen dressed in linen of dazzling white.  Anything else?\n\n","date":"February 28, 2012 at 4:58 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8803","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Ash Wednesday","post":"In my opinion, the Book of Revelation can be read as a cryptic allusion to Yeshua’s Shroud not only as a substitute to the curtain or veil of separation that hung in the Tabernacle/Temple and divided the latter into the Holy and the Holy of Holies but also as a substitute to the Tabernacle/Temple itself as the symbolic place where G.d in His grace came down and met man.\nThe Temple/Tabernacle as “the dwelling-place of G.d” can be rendered in Hebrew by « Gar ‘El » (literally “G.d dwells” and “G.d shines forth” > old French « Graal ») and in latin by « Deus Habitet » (Tabernacle). In the eyes of early Christians, Yeshua’s Shroud might well have been the Tabernacle of Tabernacles as it had received the translucid flesh and blood\nimage of the High Priest of High Priests (see the Epistle to the Hebrews).\nFrom a Late Antique “archaeoperceptive” viewpoint, far from being an actual straightforward description of the Shroud image, YôHanan/John’s visions read more like something with “sindonocryptographic” undertones.\nAs an “archaeoperceptive starter”, what if I tell you that, in “primary visualisation”, you can see in the Shroud front image, Yeshua/Jesus wearing a garment soaked with blood (upper part of front image) while riding a white horse (lower part of front image)? Although this is the easiest apocalyptic key vision to detect on the Shroud, you still may have some hard time to see the front horse pareidoliac image from the pelvis-legs image area. A good trick if you want to see it is to squint through semi closed eyelids.\nI am perfectly aware this archaeoperceptive image goes against the dominant pseudo rationalistic  exegesis surrounding The Book of Revelation you advocate. I am perfectly aware it just will not fit with what many Christians wish to/can see. Eppure si può anche vederlo…\n\n","date":"February 29, 2012 at 9:10 am","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8823","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ash Wednesday","post":"Your accusation in your last paragraph is unnecessarily gratuitous, and unhappily we get to see quite a lot of such comment on this site, where one would expect a more Christian, tolerant and open approach.  So far, although tempted, I haven’t yet accused you of neo-Gnosticism arcanery.\nLike all the best literature, the books of the Bible operate at several levels, and rationalistic exegesis is only one of many legitimate approaches.  You have merely chosen to concentrate on what you call the archaeo-cryptic approach.  The more usual and religious approach is to explore what the Scriptures have to say on the spiritual level, and on human relationships, and how we should live our lives.  Others look for psychological inferences such as Jungian archeotypes, or they are more interested in archaeological or historical aspects, or perhaps the earliest texts.  I’m sure you must be aware of the many cross-references to the OT texts in the book of Revelations, and this is another legitimate approach.  In this highly literate age, the Bible will speak to each individual person according to their understanding, life experience, and cultural background.  I see a lot of this among the indigenous folk in my part of the world, both Pasifika and Maori.  We now have many Filipino folk here, and they also have their own understanding.\nWe tend to see on this site commentators with their own narrow specialised focus, complete with their own jargon calculated to intimidate others, which they claim is the only legitimate way, a product of an academic age perhaps, but there is a wider world out there.\nHopefully, being of a more open frame of mind, I shall look for the features you mention.  However I’m also aware that one too easily sees what one wants to see, a variant of cloud-gazing.\n\n","date":"February 29, 2012 at 4:20 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8831","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Ash Wednesday","post":"Dave whether you like it or not,I do think you are totally off-track with your “ready-to-think” exegesis of the Book of Revelation. Whether you look or not for the features I mentioned, I could not care less since I know you to be a “nihilistic illiteralist”. In Hebrew my family name means “Universe”, “Vast World” and I have lived and worked on four of the five continents, thank you to remind me “there is a wider world out there”! \nYour full sentence: “We tend to see on this site commentators with their own narrow specialised focus, complete with their own jargon calculated to intimidate others, which they claim is the only legitimate way, a product of an academic age perhaps, but there is a wider world out there.” Have I really to justify the reason why I find it more accurate to speak about  “sindonocryptographic substratum” and “archaeoperception” when it comes to describe my own specific  approach? Shall I feel guilty to be an archaeocryptologist? I m not here on this blog to use a jargon calculated to intimidate others but only to share and advocate a different viewpoint on the Shroud with those who care to hear it and be as synthetic as possible… I wish you REALLY had “a more open frame of mind” than you claim you have…\n\n","date":"February 29, 2012 at 7:27 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8835","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ash Wednesday","post":"I see that you’re still indulging in bad-tempered gratuitous abuse, which I might be able to accept if it had any validity, but you’re so off-track that it calls into question the total credibility of your whole approach.\nNhilism: (1) a complete denial of all established authority and institutions; (2) an extreme form of scepticism that systematically rejects all values, belief in existence, the possibility of communication, etc; (3) a revolutionary doctrine of destruction for its own sake; (4) the practice or promulgation of terrorism … etc (Collins)\nI don’t see that I qualify under any of those categories.\nIlliteralism:  No such word, you made it up!\nIf archaeocryptology is to rely on you for its future promulgation, I wouldn’t give much hope for its future success, as you have no sense of how to persuade or to make useful points in any kind of formal debate.\nGoodbye Max, you post-modernist proto-neo-Gnostic archaeocryptarcanist! Decrypt that one!\n\n","date":"February 29, 2012 at 9:48 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8841","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Ash Wednesday","post":"I am quite aware I go against the consensus, thak you. In terms of indulging in bad-tempered gratuitous abuse, you definitely are the best Dave!\n\n","date":"March 1, 2012 at 6:12 am","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8848","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ash Wednesday","post":"Is it a Christian virtue?\n\n","date":"March 1, 2012 at 8:52 am","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8855","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ash Wednesday","post":"I am definately not a biblical expert by any means and don’t claim to be. Although my simpleton mind tells me the Lord would definately not create his book so ‘cryptic’ as for only the studied few to understand, but ‘simple’ for all to understand!!…Maybe some take things too far, as in arhcaeocryptography or whatever you wan to call it, which to me sounds like a futile attempt to find something that is maybe not there. I think the Lord would be using the KISS system to be honest!…As for clues to the Shroud being in  the good book, maybe, but I wouldn’t be looking in Revelation for them….I’d look somewhere closer to the actual event for them….thats’ just my thoughts though, not meaning to put anyone down here . ;-)\nR\n\n","date":"March 1, 2012 at 1:52 am","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8846","author":"Ron","site":"shroudstory"},{"title":"Ash Wednesday","post":"In my eye, A MAN named YôHanan created the Book of Revelation. He wrote it while in deep mystical meditation in front of Rabbi Yeshua’s Shroud. Yôhanan was both a disciple of Yeshua and a former high priest (AD 36-37) sent in exile. His high priest name was Yônatan. He was one of the five sons of a former high priest named Hanan. In his book, the destruction of the Temple of Jerusalem is prophesised. The cryptic reference (666) is not so much to Nero as to “Herodotos” (a generic Greek name to refer to the Herodian dynasty). I must admit it may be futile to some Christians’ eyes to hear about it.\n\n","date":"March 1, 2012 at 6:37 am","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8849","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ash Wednesday","post":"Correction: “I must admit an archaeocryptologist’s opinion may sound futile to some Christian’ ears. All the more so as it goes against a Christian consensual ready-to-think”\n\n","date":"March 1, 2012 at 7:35 am","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8851","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ash Wednesday","post":"Ron you wrote: “my simpleton mind tells me the Lord would definately not create his book so ‘cryptic’ as for only the studied few to understand, but ‘simple’ for all to understand!!”\nHow then will you account for the Shroud being “an on-going mystery”? How will you account for the Book of Revelation not to be clearly readable by most Christians till today? Have you ever heard of cryptochristianism? Why don’t you or Dave, as Christians, recur to the Holy Spirit and give us the right way to read the Book of Revelation and solve the Shroud mystery?\n\n","date":"March 1, 2012 at 7:04 am","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8850","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ash Wednesday","post":"The Shroud is obviously and definately different then the written word. Not a well thought-out analogy Max, and it’s quite clear why it’s still a mystery; As in my understanding, God expects a leap of faith.\nIt sounds to me like you are trying to tell people you have the ‘true’ meaning to the Book of Revelation? …Maybe to your interpretation Max, just as all scriptures are interpreted differently by any and every person who reads them. But to state it is anything other then your own ‘personal’ interpretation I think would be an extreme showing of conceit, to be honest.\nR\n\n","date":"March 1, 2012 at 2:45 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8864","author":"Ron","site":"shroudstory"},{"title":"Ash Wednesday","post":"Allow me to disagree (once more) with you Ron.The Shroud of Turin might well be compared to/identified with a fifth Gospel written with the very flesh and blood of Rabbi Yeshua. Besides any genuine leap of faith cannot just rest on half-truths, received ideas and the like that litters the Turin Shroud topic.  \nAs an archaeological truth quester, I am just trying to give “my opinion” as a different viewpoint on the Shroud even if it may go against the Christian or non Christian “well thinking” conservative consensus. Not a very easy task with people like you or Dave all too ready to ad hominem attacks! No wonder if I strike back! I have welcomed many an opinion other than mine on the Shroud since I got interested in the issue but it does seem you, most unfairly, prefer to only retain the opinions I totally disagree with. Are you harbouring any personal rancour against me, Ron just because twice or thrice I told you I thought you were totally wrong?\n\n","date":"March 1, 2012 at 4:21 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8868","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ash Wednesday","post":"Correction: “Are you harbouring any ill-rancour”\n\n","date":"March 1, 2012 at 6:06 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8871","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ash Wednesday","post":"About careful discerment and the Christian’s duty to the truth: 1 Thessalonians 5:19-22 “Do not quench the Spirit; do not despise prophetic utterances. But examine everything carefully; hold fast to that which is good”.\n\n","date":"March 1, 2012 at 12:10 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8862","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ash Wednesday","post":"\nMax Patrick Hamon :Allow me to disagree (once more) with you Ron.The Shroud of Turin might well be compared to/identified with a fifth Gospel written with the very flesh and blood of Rabbi Yeshua. Besides any genuine leap of faith cannot just rest on half-truths, received ideas and the like that litters the Turin Shroud topic.\nAs an archaeological truth quester, I am just trying to give “my opinion” as a different viewpoint on the Shroud even if it may go against the Christian or non Christian “well thinking” conservative consensus. Not a very easy task with people like you or Dave all too ready to ad hominem attacks! No wonder if I strike back! I have welcomed many an opinion other than mine on the Shroud since I got interested in the issue but it does seem you, most unfairly, prefer to only retain the opinions I totally disagree with. Are you harbouring any personal rancour against me, Ron just because twice or thrice I told you I thought you were totally wrong?\nTo your final question; Absolutely not Max, as I’ve also told you twice or thrice I think your totally wrong and still believe so!….Actually Max, It’s not your viewpoint or what you say, it’s the way you say it, which is mostly in a very arrogant, condescending manner.\nR\n\n","date":"March 1, 2012 at 5:42 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8870","author":"Ron","site":"shroudstory"},{"title":"Ash Wednesday","post":"Ron, you just cannot help making ad hominen attacks. Another of your Christian virtues I guess. I do remember you telling me outright my exegesis of Rabbi Yeshua’s burial made no sense. Were you then arrogant, ignorant or both?\n\n","date":"March 1, 2012 at 6:16 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8872","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ash Wednesday","post":"Can you judge yourself with the same measure you judge me?\n\n","date":"March 1, 2012 at 6:24 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","id":"comment-8873","author":"Max Patrick Hamon","site":"shroudstory"}]
