[{"title":"Some thoughts on the St. Louis conference announcement","post":"The Bari conference may not have an agenda because there are non-Christian authorities who will be there. Not even CIS has authenticated the relic, preferring to wait till more studies are made.\n\n","date":"October 26, 2013 at 9:09 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48771","author":"Louis","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":" …his corpse gave off particle radiation while it was wrapped in his burial garment … \nDoes anyone know precisely what kind of particle radiation Mark Antonacci (“attorney and historian”) has in mind? Is it ionized atoms or molecules, as in corona discharges, or entire nuclei (e.g. alpha particles aka helium nuclei) or individual protons, neutrons or electrons? Or is the term particle radiation used loosely to include electromagnetic radiation? If so, what frequency range? Infrared? Visible? Ultraviolet? X-ray? Gamma ray?\nOne can hardly begin to evaluate a radiation model unless one knows the specifics.  A quick search has failed to turn up clues as to what kind of beam is envisaged (it would have to be a remarkable one to produce an image by self- or mysteriously-assisted collimation, i.e.travelling from body to linen in strictly parallel trajectories requiring no lens or other focusing system).\n\n","date":"October 26, 2013 at 9:34 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48772","author":"colinsberry","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"Sorry, Colin; in this particular case, I’m afraid “radiation” = “magic.”\n\n","date":"October 26, 2013 at 9:37 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48773","author":"Hugh Farey","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"Magic you say? How can you be so dismissive, Hugh, so uncharitable?\nIf you’re right, a possibility not to be lightly rejected, you being a physicist an’  all,  then it should perhaps have been planned as a magical mystery tour. That way the showman stays on the move, like the snake oil salesman, if only to keep one step ahead of disenchanted customers, enchantment being (in this instance) the commodity that is expected and demanded… ;-)\n\n","date":"October 26, 2013 at 9:53 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48777","author":"colinsberry","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"Have a look at the top photo on this page: http://www.resurrectionoftheshroud.com/research.html. it shows the shroud from end to end. Look what’s happened to the radiocarbon sample area. Magic!\n\n","date":"October 26, 2013 at 10:02 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48781","author":"Hugh Farey","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"But in all fairness, what other new developments have occured in recent years pertaining to the Shroud?\n\n","date":"October 26, 2013 at 9:44 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48774","author":"Giorgio","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"Hi Giorgio, you have asked the right question. There will be some news for you shortly, which will show that developments are difficult, and that there is a lot of speculation.\n\n","date":"October 26, 2013 at 9:56 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48779","author":"Louis","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"Thank you Louis, Keep me informed\n\n","date":"October 26, 2013 at 10:07 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48783","author":"Giorgio","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"Joe Marino who helped organize the 2008 Ohio conference will be very involved in refereeing the papers selected.  I am confident his involvement will make for a solid conference.\n\n","date":"October 26, 2013 at 9:46 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48775","author":"Russ Breault","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"You could not have anyone better than Joe Marino. Agree. But Joe is one person. Can he alone prevent the suspicion created by such unscientific Gobbledygook on the sponsorship sites. Look at the Bari site. Eighteen people are on the committee along with their associations. Who is behind St. Louis? You get the impression that it is really only Antonacci and his foundation. If they want to avoid suspicion they have to redesign this conference and fast. Joe did a great job with Ohio 2008 and could tell them how.\n\n","date":"October 26, 2013 at 10:49 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48791","author":"Dan","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"Since 2 of the committee members had websites and since a conference needs   sponsorship, it only seemed natural to have them co-sponsor.  Internally,   we haven’t put a lot of focus on that.  We’re just people who are   interested in the Shroud and interested in spreading information about it.   Ours is  a U.S. style conference and not similar to the higher-end   professionally-sponsored conference that many European conferences are.   who attended the  1991 St. Louis conference and the 2008 Columbus conference  seemed to enjoy  those and I’m confident that the 2014 St. Louis conference will  also be a  great experience.   Several STURP members, including Barrie Schwortz and John Jackson are   planning to attend.  We’re also hoping that Ken Stevenson, Tom D’Muhala,  and  John “Dee” German will come.  Bob Villarreal of the Los Alamos National   Laboratories will likely present.  Various other scientists have expressed   preliminary interest in coming.   There’s already too much politics in sindonology.  I wish it wasn’t  being  added to a conference barely off the ground.  We’re hoping to add  some new  blood to sindonology.  We would like to just share Shroud  information, see  old friends, meet new ones and feel that this conference  is a good way to  do that.  The sponsorship is an important issue, but  it should not be  overblown.\n\n","date":"October 26, 2013 at 11:24 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48796","author":"jmarino240","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"Further to # 1, now that Dallas 2005 has been mentioned again, one has to reiterate that the message of Benedict XVI read out by the Kevin Vann, Bishop of Fort Worth, Texas fell on deaf ears. It is better to not even approach Pope Francis, because, blunt-spoken as he is, he will say things that many will not like. Perhaps something like what was posted on this blog by an Oxford scholar who was forced to leave the scene, shocked with personal attacks? But then, even Shroudies admit that there are no Christians in the realm of Shroud studies….\n\n","date":"October 26, 2013 at 9:52 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48776","author":"Louis","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"Will they be filming real scientists giving talks, grabbing bites and making them look like they are part of some dematerialization dog and pony show?\n\n","date":"October 26, 2013 at 9:56 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48778","author":"Paulette","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"The sponsorship is a disaster for the conference.\n\n","date":"October 26, 2013 at 9:56 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48780","author":"Paulette","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"If people are looking to the TS to believe in the Resurrection, they are on the wrong track. For Christians it should be the other way round, as it is for many in various denominations.\n\n","date":"October 26, 2013 at 10:05 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48782","author":"Louis","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"I may be wrong about this, but I think Mark Antonacci is dismissive of the Benford-Marino-Rogers patch hypothesis. Therefore, one might expect that the presentations at the conference are not going to be in lock step with anyone’s particular agenda.\nIn doing some research this morning I ran across some interesting items that may even be of interest to Colin. \nOne of the items was a Randy Foundation report on its website of Michael Minor’s controversial press release of 2005-01-19 seeming to take credit by AMSTAR for Rogers’ work, What followed was criticism by the skeptical readers of the Randi forum which I would hope even Colin might find at least some absurd – including a plea for information from the redoubtable scientific genius Joe Nickell’s  – I kid you not!!!!\nSee for yourself. It begins with a complete copy of the Michael Minor press release on Rogers’ findings.\nhttp://forums.randi.org/archive/index.php/t-33828.html\n\n","date":"October 26, 2013 at 10:12 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48785","author":"John Klotz","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"In case anyone is interested, here’s the BBC report on Rogers:\nhttp://news.bbc.co.uk/2/hi/science/nature/4210369.stm\n\n","date":"October 26, 2013 at 10:21 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48786","author":"John Klotz","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"Giorgio, please wait for some days. One line of research has reached a dead end, but it would probably not help much because of late dating. As you know, one has to use filters to eliminate nonsense.  I have more hopes in another line, but it will take more than a year or so to publish something because I depend on permission from government authorities.\n\n","date":"October 26, 2013 at 10:23 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48787","author":"Louis","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"\nHugh Farey :\nHave a look at the top photo on this page: http://www.resurrectionoftheshroud.com/research.html. it shows the shroud from end to end. Look what’s happened to the radiocarbon sample area. Magic!\n\nYup, wonderful these photoediting clone tools. \nWhat concerns me more are the two references to “particle or neutron” irradiation (that magically or even non-magically produces the extra C-14 to confound 20th century radiocarbon dating). Why bother to make the distinction, given that a neutron is a particle with essentially the same mass as a hydrogen atom?\nIt hardly inspires confidence…\n\n","date":"October 26, 2013 at 10:24 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48788","author":"colinsberry","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"I think that Antonacci’s image is very confusing. There’s always a left-right mirror-non-mirror image problem when describing  the Shroud. I wonder if the cut-out portion at the bottom of the page is in fact the Raes-C14 sampling area. That would mean that the image is not a mirror image (or visa-versa). One of the problems with the 2002 “restoration” may have been the removal of the area altogether thereby arguably protecting the C14 results from further challenge, although I really believe the C14 is a dead issue for a host of reasons we need not discus in this thread.\nAs far as Antonacci’s theory, while I may differ from Rogers on the ultimate answer to image, realizing that the solution is still beyond the horizon (that’s a pun but I what explain it now) I am not ready to accept some people who insist on the truth of their various theories and express disdain for those who disagree. That’s different from disdain for a specific theory because it doesn’t work but the critic admits not having a lock on the image process himself. That actually Rogers position even as he criticizes others if you read him carefully. He knocks down other theories while admitting his is incomplete.\n We don’t have the theory that answer to  the mystery of image creation yet. However we may have a direction.\n\n","date":"October 26, 2013 at 11:37 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48799","author":"John Klotz","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"What can we ‘pseudo-skeptics’ usefully say that won’t be misrepresented and maligned as pursuit of an undeclared agenda?\nThere’s no point in striving for points of contact, far less agreement, if or when semantic hand grenades designed purely to rough up the opposition get tossed into the debate.\n\n","date":"October 26, 2013 at 11:58 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48803","author":"colinsberry","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"The St. Louis conference is actually after the Bari conference, not  before  and it’s almost 5 weeks difference, not 3.  Although it’s  unfortunate that  they’re close together, I think most Americans at least would  prefer to  attend a conference in the USA instead of Italy.   I’m not sure why there’s an impression that there is a focus on the   co-sponsors.  We simply announced who the co-sponsors are and links  were listed  as part of the basic information.   I’m also not sure why it’s felt there may be an agenda.  Although the   title points to the science/faith intersection of the Shroud, that’s always a   given, and it was announced that topics for papers are open to any major  aspect  of sindonology.   I was involved in planning both the 1991 St. Louis conference and the 2008   Columbus conference.  One of the reasons the Columbus conference was held   was that I was upset at the way the 2005 Dallas conference was held and also   because of some restrictions that were going to be in place for another   conference that was never actually held.  The Columbus conference had a   paper by a Spanish doctor who held that the Shroud image shows that the man in   the Shroud was not dead.   Although I am only one of 6 committee members for the 2014 St. Louis   conference, I intend to push for complete openness and fairness in terms of   papers that will be presented.  I can tell you that in our many conference   calls, other committee members expressed their willingness to have papers by   Shroud critics to be presented.   It’s unfortunate that this sort of cloud is being cast over the St. Louis   conference.\n\n","date":"October 26, 2013 at 10:28 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48789","author":"jmarino240","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"I wrote my initial response to Dan’s posting direct from the email I received before seeing the other posted commments.\nJohn wrote, “I may be wrong about this, but I think Mark Antonacci is dismissive of the Benford-Marino-Rogers patch hypothesis. Therefore, one might expect that the presentations at the conference are not going to be in lock step with anyone’s particular agenda.”\nYou are right John, Mark does not buy into the patch hypothesis.  The fact that 2 committee members do have conflicting views should be an indication there is no agenda.\nRuss wrote, “Joe Marino who helped organize the 2008 Ohio conference will be very involved in refereeing the papers selected. I am confident his involvement will make for a solid conference.”\nThanks for the support, Russ.\n\n","date":"October 26, 2013 at 10:43 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48790","author":"Joe Marino","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"I don’t envy you Joe. Good luck.\n\n","date":"October 26, 2013 at 11:17 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48794","author":"Giorgio","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"I think it is important that there be no “litmus test” that decides a priori what is acceptable and not acceptable as a hypothesis.  You only get a real dialogue going when the only rules are competency and honesty.  Investigators, especially investigating something as mysterious as the Shroud of Turin, will disagree and ought to be heard out and any decision made on the basis of the strength of the evidence.\nScience is always a work in progress and often what was accepted at one point in time proves to be unsatisfactory in the light of new evidence.  The conference in 2008 was a model of openness I thought and a very interesting conference.  I have every reason to believe that St. Louis will be as well.\nRegards, Ray\n\n","date":"October 26, 2013 at 1:19 pm","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48807","author":"rschneider42","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"One of the items was a Randy Foundation report on its website of Michael Minor’s controversial press release of 2005-01-19 seeming to take credit by AMSTAR for Rogers’ work, \nThere is some truth to that statement.\n\n","date":"October 26, 2013 at 11:19 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48795","author":"Giorgio","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"Why the emphasis on the sponsors? Because the links were provided as part of the conference announcement. The first thing Mark should do is revise his home page. And Paulette raises a good question about filming. Will a video in support of Mark’s hypothesis or his petition to the pope be prepared and include filmed clips from the conference. I wouldn’t want to part of that under any circumstance. You need a good conference website with links maybe in a contact page. And paper selection needs to be carefully explained.\n\n","date":"October 26, 2013 at 11:26 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48797","author":"Dan","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"One must wait to see the results both conferences will produce, only then will there be real grounds for judgements. Bari will have two authorities from Israel, in geological survey and textiles respectively, and one from Sri Lanka (Uppsala University, Sweden), who is an expert in lightning.\n\n","date":"October 26, 2013 at 11:33 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48798","author":"Louis","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"Who wouldn’t click on those URLs if interested in the conference and not be horrified. There is a big disconnect between Marino’s vision for a conference and what was announced by Schwartz.\n\n","date":"October 26, 2013 at 11:46 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48801","author":"Paulette","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"Paulette wrote:  “Who wouldn’t click on those URLs if interested in the conference and not be horrified. There is a big disconnect between Marino’s vision for a conference and what was announced by Schwartz.”\nI actually wrote the piece that was published by Schwortz.  Please focus on the vision as I expressed it in my comments and not your interpretation of the basic announcement.\n\n","date":"October 26, 2013 at 12:33 pm","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48806","author":"jmarino240","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"Dan wrote, “Will a video in support of Mark’s hypothesis or his petition to the pope be prepared and include filmed clips from the conference. I wouldn’t want to part of that under any circumstance. You need a good conference website with links maybe in a contact page. And paper selection needs to be carefully explained.\nMark is actually working on a Press Release right now to propose new testing, which includes a short video.  There is no video planned in the scenario you painted.  More information will be added to the conference site as we get off the ground.\nGoing back to Paulette’s comment about who wouldn’t be horrified regarding the links, there are other factors to consider besides who the official sponsors of the conference are.  If certain people don’t attend just because of those, we’ll just have to live with that.\n\n","date":"October 26, 2013 at 1:36 pm","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48810","author":"jmarino240","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"In my research, I am now at the Dallas 2005 conference disaster. What is clear to me is that no individual is so knowledgeable as to set either the agenda or the tone of the meeting. A conference to work as to be open to conflicting ideas. I trust Joe is, even though he is one of the authors patch hypothesis which even today is vigorously  disputed by some (like Antonacci) even though it is not incompatible with his thesis. If he’s right the patch is irrelevant.\nAs far as following so close on Bari, I suspect that if you fear control by people with an agenda then Bari will be less your cup of tea than St. Louis. Also, I suspect that St. Louis will be more economically feasible for many people. \nHey guys and gals, lighten up. Save your energy and your spleen for the conference.\n\n","date":"October 26, 2013 at 1:54 pm","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48812","author":"John Klotz","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"It’s not quite at the midway point between Bari and St.Louis, but I know a good pub in central London with an upstairs room for hire (we used to use it for monthly meetings of the London Lipid Club). It’s called the Museum Tavern, and is directly opposite the British Museum… Oops.\n\n","date":"October 26, 2013 at 2:38 pm","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48814","author":"colinsberry","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"that’s a great pub Colin, I had a pint there in April.\n\n","date":"October 26, 2013 at 6:54 pm","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48831","author":"matthias","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"Drinks and historical research don’t mix, unless one is invited to a pub and has to forget the latter for a while. There are two other good ones, one near St. James Palace and the other not from Embankment.\n\n","date":"October 26, 2013 at 2:50 pm","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48815","author":"Louis","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"Listening to a slide presentation while supping a pint (after hours), as I used to at the London Lipid Club, never hurt anyone’s mental faculties, probably the contrary in fact. Look where Watson and Crick made a bee line for as the venue for announcing “the secret of life” – the Eagle pub in Cambridge.  (It has a plaque on the wall, claiming – wrongly  – that ‘s where the two announced the “discovery of DNA”, overlooking to mention the double helix).\nAs for your suggestion that there are (only?) two other noteworthy pubs in London, words fail me. Once the shops and offices close up, London is one giant pub scene, lunchtimes too, with patrons overflowing onto the pavement outside, though maybe not this time of year, with a giant storm now heading in from the Atlantic.\n\n","date":"October 26, 2013 at 3:20 pm","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48819","author":"colinsberry","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"Fully agreed, it is only that I mentioned two pubs where I was invited to drink some beer, the rest had to be kept for the nights, with a dose of whisky to relax. By the way, with no offence intended, both invitations to sip at pubs were not after but during office hours and I heard a friend saying that the Germans were more hardworking then the English! The city is nice but expensive and real big shots can afford to eat at the best restaurants. Remember Lucian Freud, who always dined at the same table at the Wolseley?\n\n","date":"October 26, 2013 at 3:53 pm","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48823","author":"Louis","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"Sorry, I meant not far from Embankment, and close to the Thames…\n\n","date":"October 26, 2013 at 2:51 pm","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48817","author":"Louis","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"This will be the first US conference in 6 years.  Regardless of who is speaking, whether you agree with their particular paper or not, it will be a wonderful time for all involved to connect or connect again.  Some of my fondest memories dating all the way back to the Paris conference in 1989 are simply making new friends and then reconnecting at subsequent conferences.  It is a time of wonderful camaraderie and fellowship.  Stop worrying about the minutia.  There will be papers you agree with and those you won’t.  But the relationships you build and cultivate will be priceless.  Mealtime get togethers and late night cocktails  with old friends and new–that is what I look forward to.  With the right attitude, we can all help make this a great conference–even if we don’t all agree.\n\n","date":"October 26, 2013 at 6:39 pm","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48830","author":"Shroud Encounter","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"Russ you buying?\n\n","date":"October 27, 2013 at 9:10 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48893","author":"Giorgio","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"If Russ doesn’t I will! B)\n\n","date":"October 27, 2013 at 10:47 am","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48900","author":"rschneider42","site":"shroudstory"},{"title":"Some thoughts on the St. Louis conference announcement","post":"Looking forward to seeing old friends and making new ones!\n\n","date":"October 27, 2013 at 5:01 pm","url":"https://shroudstory.com/2013/10/26/some-thoughts-on-the-st-louis-conference-announcement/","cat":"event","id":"comment-48924","author":"Russ Breault","site":"shroudstory"}]
