[{"title":"Stories are rolling out now on the Exhibition of the Shroud of Turin","post":"I am not sure if the use of the word “icon” used by Pope Francis should indicate how he feels about the Shroud.  The word icon in Italian is often used when in English we might use “image”.  This is seen with past Pope Benedict who called the Shroud “an icon written in blood.”  In his book on the Passion of Christ he refers to the Shroud as a relic.\n\n","date":"March 30, 2013 at 8:00 pm","url":"https://shroudstory.com/2013/03/30/stories-are-rolling-out-now-on-the-exhibition-of-the-shroud-of-turin/","cat":"event","id":"comment-28897","author":"Russ Breault","site":"shroudstory"},{"title":"Stories are rolling out now on the Exhibition of the Shroud of Turin","post":"Of course the mention of Paul VI is a bit misplaced because at that time (1973) the Shroud was not owned by the living pope, but by King Umberto who bequeathed it at his death several years later.\nTo Russ ~ Icon is am image of something, whereas relic is something of the person or something the person wore or touched.  The Popes calling it an icon versus a relic means they are not pronouncing it as Jesus’ Shroud, but as an icon is is an image of Jesus’ Shroud, it still has great meaning even if one day one was able to scientifically prove it was not the burial Shroud of Jesus of Nazareth who was the Christ.  This is an important distinction.  But as Pope John Paul II said determining if this Shroud is the one that wrapped Jesus’ body is outside the competence of the Church, per say, but is rather left to the realm of science and the scientific study of this item because the Church’s realm, strictly speaking, is in regard to faith and morals, not science.\n\n","date":"April 1, 2013 at 7:50 pm","url":"https://shroudstory.com/2013/03/30/stories-are-rolling-out-now-on-the-exhibition-of-the-shroud-of-turin/","cat":"event","id":"comment-29035","author":"Andy Weiss","site":"shroudstory"},{"title":"Stories are rolling out now on the Exhibition of the Shroud of Turin","post":"The official position of the Church versus the Shroud is pretty much the same than it was during the time of Geoffroy de Charny in Lirey, France, which is this :  Until the Shroud can be proven by science to be genuine (will it be possible to reach that point one day?), it is considered as being a representation of Jesus’ Passion and death that can be venerated by the faithful (the same way someone can have a great veneration for the crucifix, for the way of the cross, for the rosary or other things like that).  And it’s also important to understand that the Church never declare the Shroud to be a fake or to be the burial cloth of another crucified man than Jesus but, because science is not able yet to prove who the Shroud man really is, the Church cannot officially declare it the authentic burial Shroud of Christ.\n\n","date":"April 1, 2013 at 7:58 pm","url":"https://shroudstory.com/2013/03/30/stories-are-rolling-out-now-on-the-exhibition-of-the-shroud-of-turin/","cat":"event","id":"comment-29036","author":"Yannick Clément","site":"shroudstory"}]
