[{"title":"Text of Pope Francis’ Remarks for the Televised Exhibition of the Shroud of Turin on Holy Saturday","post":"Hi Dan.  Happy Easter.  Where should this link be shared for all ?  Happy Eternity in Christ. :-)  \nThe Fabric of Time movie from youtube   http://www.youtube.com/watch?v=Xnw8oSPSY9w\n\n","date":"March 31, 2013 at 10:03 am","url":"https://shroudstory.com/2013/03/31/text-of-pope-francis-remarks-for-the-televised-exhibition-of-the-shroud-of-turin-on-holy-saturday/","cat":"event","id":"comment-28945","author":"godtools","site":"shroudstory"},{"title":"Text of Pope Francis’ Remarks for the Televised Exhibition of the Shroud of Turin on Holy Saturday","post":"This is a very clever discourse of Pope Francis !\nI would like to underline these quotes : “This face has eyes that are CLOSED, it is the face of ONE WHO IS DEAD, and yet mysteriously he is watching us, and in silence he speaks to us.”  Comment of mine: here on this blog, I mainly said the same thing over and over again to those who I call “the members of the supernatural fringe” !  The Shroud doesn’t show a glorious body of light but a dead man who suffered a great deal.  In other words, this is a relic of the Passion of Christ, not a relic of his Resurrection.\n“This image, impressed upon the cloth, speaks to our heart and moves us to climb the hill of Calvary, to look upon the wood of the Cross, and to immerse ourselves in the eloquent silence of love.”  Comment of mine:  Again, the Pope underline the fact that this is a relic of the Passion of Christ more than anything else and that it mainly show the extreme love of Christ for mankind, which is in fact, the most compelling revelation of the love of the Father for every one of his children!\n“By means of the Holy Shroud, the unique and supreme Word of God comes to us: Love made man, incarnate in our history; the merciful love of God who has taken upon himself all the evil of the world to free us from its power.”  Comment of mine:  This quote is extraordinary for me, because it’s one of the first time I hear a Pope doing a direct association between the Shroud and the Incarnation of God here on Earth, which is for me the most important thing the Shroud had to say to us!  Effectively, for me, the Shroud is not a relic of the Resurrection, even though it is possible to detect some signs of that event by looking at this cloth; and beside being evidently a relic of the Passion of the Christ, I truly believe that the Shroud is first and foremost a relic of the Incarnation of God in our humanity and, therefore, should be meditated under this great light, which is something often forgotten in the pro-Shroud world where people tend to always put the focus on the Passion, death and, more than anything else, on the Resurrection of Christ.  But the simple fact that God accepted to take a real body like anyone else and live here on Earth is very telling on who he really is, which is not the God of Talion that the Jews of Jesus time had in mind, but instead a God who is Love and Mercy AND NOTHING ELSE.\n“So, looking upon the Man of the Shroud, I make my own the prayer which Saint Francis of Assisi prayed before the Crucifix…”  Comment of mine: This link made by the Pope between the Shroud and the crucifix is also an evident sign that, for him, this relic is mainly a relic of the Passion of Christ instead of being a relic of the Resurrection of Christ, and as he said earlier when he mention the peaceful aspect of the face of the Shroud man, we can see something of the confidence of Jesus for his Father, even during this very painful event up until the moment of his death.\nIn my mind, this is a great discourse of the Pope because he kept his feet on the ground, while focusing on the most important aspects of that relic!\n\n","date":"March 31, 2013 at 9:43 pm","url":"https://shroudstory.com/2013/03/31/text-of-pope-francis-remarks-for-the-televised-exhibition-of-the-shroud-of-turin-on-holy-saturday/","cat":"event","id":"comment-28982","author":"Yannick Clément","site":"shroudstory"}]
