[{"title":"The evidence of things not seen","post":"There are none so blind as those who will not see. The Shroud is a Revelation. Note the caps.\n\n","date":"November 23, 2013 at 3:44 pm","url":"https://shroudstory.com/2013/11/23/the-evidence-of-things-not-seen/","cat":"event","id":"comment-52537","author":"John Klotz","site":"shroudstory"},{"title":"The evidence of things not seen","post":"In the realm of Shroud studies, at least, it is said to be the opposite, and whoever “touches” the relic gets a bundle of problems. If that is true for each and every one, then the message seems to be “Take up your cross…”\n\n","date":"November 23, 2013 at 6:57 pm","url":"https://shroudstory.com/2013/11/23/the-evidence-of-things-not-seen/","cat":"event","id":"comment-52567","author":"Louis","site":"shroudstory"},{"title":"The evidence of things not seen","post":"There is a well known phrase applied to some Catholic converts: “more Catholic than the Pope”.  There ought to be another: more Christian than Jesus.  The miracles Jesus performed, as reported by presumed eyewitnesses, were not as-if affairs.  For instance, note in the healing of the blind man the care to report that the man had been born blind.  Jesus knew the power of really miraculous acts as signs conducive to faith–yes, granted that he did not discount faith without having seen, to the contrary, yet I fear we are all getting too comfortable with rationalizing substitutes, with edification rather than action, with stories rather than history.  From a Kierkegaardian perspective, maybe we’re all just getting too comfortable period.  Facts matter because matter matters.  Jiddu Krishnamurti once remarked that it is perfectly possible to induce a transcendent experience by chanting “Coca Cola”.  He was being sarcastic.  Down to earth sarcasm trumps gaseous piety.\n\n","date":"November 26, 2013 at 7:45 pm","url":"https://shroudstory.com/2013/11/23/the-evidence-of-things-not-seen/","cat":"event","id":"comment-52865","author":"R. H. Cahall","site":"shroudstory"},{"title":"The evidence of things not seen","post":"Is it because the Shroud is less mystical, that miracles are not associated with it? Or is it because the Shroud is apart from all of them, or above and beyond all other relics? \nIt is one thing to worship before a saint. The saint is obviously a lesser being than Christ Himself, and actually so is the miracle. Works done in the flesh of mankind are of less value than those done in the spirit of mankind. And most documented miracles are healings of some kind. \nJohn 6:63 “The Spirit gives life; the flesh counts for nothing.” \nThe Shroud represents a spiritual work. Nobody can truly understand why the Cross of Christ is as significant as it is, or even why it was so necessary: this is something we accept by faith. In accepting it, we acknowledge God’s greater wisdom that exists in the plan of Redemption – and accept that by faith too. \nSince the Shroud represents this great work of Redemption, something that can’t be understood but is the essential core of our Faith in Christ: then why in the world would we expect the Shroud to be associated with something of the flesh – such as a miraculous healing? Because that’s what most saintly miracles are about is healing of physical problems.  The Shroud does not represent that kind of healing. It represents a far more significant healing and a far more significant power and a far more significant wisdom than looking after the cares of this earth. \nI didn’t know that the Shroud was not associated with any known miracles, but it didn’t surprise me when I read that. In fact, for me, this news is actually a possible validation that the Shroud may indeed be the real thing.\n\n","date":"November 27, 2013 at 5:19 am","url":"https://shroudstory.com/2013/11/23/the-evidence-of-things-not-seen/","cat":"event","id":"comment-52908","author":"AnnieCee","site":"shroudstory"},{"title":"The evidence of things not seen","post":"Things not seen? A good book to read is “Return to the Centre” by the English monk Dom Bede Griffiths. Not everything needs to be accepted, in fact we differed publicly in a weekly many years ago. Yet, he draws attention to avenues that may not have crossed many minds.\n\n","date":"November 27, 2013 at 9:29 am","url":"https://shroudstory.com/2013/11/23/the-evidence-of-things-not-seen/","cat":"event","id":"comment-52927","author":"Louis","site":"shroudstory"},{"title":"The evidence of things not seen","post":"The Shroud augments the faith of many Christians for the simple fact that everything recorded in the Old and New Testaments about the suffering and death of the Messiah can be seen in the image on the cloth.  That goes far beyond the scientific study of the Shroud and always will.  Christians of faith are not looking for any help from any expert whatever in that regard.  Scientific study of the Shroud is important, not for the believer, but for those who doubt and for other experts.  So there are two issues here: faith and science.  Neither one is exclusive of the other nor do these two, faith and science, contradict one another.  They rather support one another and work together to give us a union of the Divine and the human.\n\n","date":"December 1, 2013 at 10:57 am","url":"https://shroudstory.com/2013/11/23/the-evidence-of-things-not-seen/","cat":"event","id":"comment-54300","author":"Andy Weiss","site":"shroudstory"},{"title":"The evidence of things not seen","post":"That’s a very good observation, thank you.  I realize the science is important, and I’m glad that so many are interested in it – because there are some who have come to faith because of studying the Shroud. \nFor me, the science is unnecessary and even a bit tedious at times. I do think it’s fascinating that the Shroud tantalizes the atheists the way it does. This is amusing, IMO. God seems to be mocking the mockers. While at the same time, God in His mercy reaches out to them through the message that’s imprinted on that ancient piece of cloth.\n\n","date":"December 2, 2013 at 6:48 pm","url":"https://shroudstory.com/2013/11/23/the-evidence-of-things-not-seen/","cat":"event","id":"comment-55243","author":"AnnieCee","site":"shroudstory"}]
