[{"title":"The face Jesus left us","post":"The shoudS (the Turin Shroud, Oviedo Sudarium, Cahors Headdress and Manoppello Veil) are sign(s). In Greek the word othonia for ‘shrouds’ plays with the Hebrew phrase ‘oth yonah’ i.e. “sign of Jonah/Jonas. Ring a bell?\n\n","date":"March 1, 2013 at 8:10 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26008","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"(it is called a regressive xenometathesis by the purists)\n\n","date":"March 1, 2013 at 8:34 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26012","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Typo: a PROgressive xenometathesis\n\n","date":"March 1, 2013 at 8:37 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26014","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"“The Shroud is a sign”.  EXACTLY !!!  And to decode it, sorry but someone needs the EYES OF FAITH and not the eyes of science (which very often, don’t see very far and very deep, spiritually speaking).\n“The Shroud is a sign”.  Please read my numerous comments on that page : https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/#comments\nI DIDN’T SAID ANYTHING ELSE THAN THAT, except that I add this important truth :  It is a sign and not a physical proof !  Sorry for John Jackson and cie. but it will never be.\n\n","date":"March 1, 2013 at 11:43 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26056","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"I just want to add this :  The Shroud is a sign, just like the empty tomb was a sign for the people in Jerusalem after Easter morning!  That’s why I love to call it “the empty Shroud”…\n\n","date":"March 1, 2013 at 11:45 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26057","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"The Holy of Holies of the Jerusalem Temple also struck Roman Emperors as an empty place hidden away/separated from the rest of the Temple by a LINEN veil with TWO FIGURES of cherubim (angels) embroidered onto it. Ring another bell? If none just see the Book of reVELation…\n\n","date":"March 1, 2013 at 12:15 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26064","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"or see the Letter to the Hebrews.\n\n","date":"March 1, 2013 at 12:16 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26065","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"or see the Letter to the Hebrews……..whose author, by the way has been recently scientifically  identififed\nhttp://www.plosone.org/article/info%3Adoi%2F10.1371%2Fjournal.pone.0054998\n\n","date":"March 1, 2013 at 1:11 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26071","author":"Gabriel","site":"shroudstory"},{"title":"The face Jesus left us","post":"Is it possible for you to give us the name of this most certainly Jewish author?\n\n","date":"March 1, 2013 at 2:00 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26077","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"Yannick, in the link I provide above corresponding to a peer-reviewed journal the authors use state-of-the-art machine learning algorithms to identify the author of the letter to the Hebrews. Their conclusion is that most probably Paul wrote an aramaic/hebrew version and Luke wrote the final Greek text.\n\n","date":"March 1, 2013 at 2:39 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26080","author":"Gabriel","site":"shroudstory"},{"title":"The face Jesus left us","post":"Thanks a lot !  This is truly possible since this particular letter focus a lot on the “infamous” sacrificial aspect of Jesus’ Passion (I say infamous because I truly think this theology is far away from the idea of a God who is love) and we know very well that this theological theme was popular in St Paul’s predication.  And can we be surprise?  No !  The theology of the sacrifice was all the Jews (and most pagan people) of that time knew and, of course, while St Paul desperately wanted that his Jewish brothers and sisters to recognize Jesus as the Messiah, he evidently choose that well-known theme for his predication and applied it to Jesus’ death on the cross.  St John and most of the Jewish writers of the first century A.D. did the same simply because they wanted to make us believe that the scandal of the cross was already predicted by the prophets, which is far from being sure!!!  For me, the only purpose of Jesus’ death was to fully accomplish his mission (and never backed up from it), which was “simply” to present the true face of the Father who is Love and Mercy (and nothing else)…\n\n","date":"March 1, 2013 at 4:51 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26099","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"Why, Yannick, would God, who is love and mercy only, torture his son on the cross, if it wasn’t as a sacrificial act?\n\n","date":"March 1, 2013 at 5:10 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26100","author":"ChrisB","site":"shroudstory"},{"title":"The face Jesus left us","post":"It wasn’t God who tortured his own son (what a gruesome, crazy and ridiculous idea by the way!) on the cross, it was the fury of mankind!\n\n","date":"March 1, 2013 at 5:36 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26104","author":"twister7","site":"shroudstory"},{"title":"The face Jesus left us","post":"Sorry for the “twister7” name !  It is my nickname and I wrote it too fast… ;-)\n\n","date":"March 1, 2013 at 5:39 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26105","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"God did not tortured his own son on the cross!  What a gruesome, ridiculous and crazy idea, by the way.  Those who tortured and killed Jesus were us!!!  And Jesus only accept that kind of death for one reason: to show us where true love can go and also, as a side effect, to show us that suffering and death will never have the last word.  Every living creature created by God is Eternal.\n\n","date":"March 1, 2013 at 5:42 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26107","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"Jesus glorified the Father by his death on the cross (John 17). Unless what John has written is wrong, then God the Father must have demanded this sacrifice. Do you believe in Hell and that people can be condemned? If so, how would you reconcile this with God who is only loving and merciful. Surely God is to be feared in equal measure?\n\n","date":"March 1, 2013 at 6:44 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26117","author":"ChrisB","site":"shroudstory"},{"title":"The face Jesus left us","post":"I will use the words of Ste. Therese of Lisieux (a Doctor of the Church) to answer your question, because one day, someone ask her if she believed in hell (because she was always talking about the Mercy of God who’s name is Love) and here’s what she said (remember that she was named Doctor of the Church by John Paul II and was also named the greatest saint of modern time by Pius X) :  “Yes, I believe that there is a hell because that’s what the Church is teaching, but I’m convinced that it is empty!”\nOnce you have experimented the Love and Mercy of God, you cannot believe no more that God will let one single of his children go into darkness for eternity.  As the parable of the lost sheep in St Luke teach us, the Father will always go searching the lost sheep (who is everyone of us) UNTIL HE FOUND US and HE WILL BRING US BACK HOME ON HIS BACK!  When your name is Love, that’s how you act!\nAnd when your name is Love, you don’t force your own son to die on a cross in horrible pain in order to, only then, be able to forgive the poor humans that we are!  What a wrong way to see the God presented by Jesus Christ.  The best way to understand the Passion and death of Jesus can be found in St. John’s Gospel when he said to Pilatus: “In fact, the reason I was born and came into the world (note: we can also understand: and agree to die on the cross) is to testify to the truth. Everyone on the side of truth listens to me.”\nThe Mission of Jesus was to show us the real face of the Father, which is a face of Love and Mercy for  ALL MANKIND and that mission was never more clearly successful than during his Passion when he forgive everyone, even those who just nailed him to the cross…  That show us that the Universal Salvation plan of God is on the way and he will succeed to get it done at the end of time.  That’s my belief, based on the life and teaching of Jesus Christ and based also on my own personal spiritual experience of God.\n\n","date":"March 2, 2013 at 7:36 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26194","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"The seers of Fatima described a vision of hell in which souls are dropping in like snow flakes. Jesus told his disciples not to be afraid of those who can kill the body but not the soul, but fear the one who can kill both body and soul in hell.\nThe Good Shepherd knows his flock and they know him. I think you know the rest.\n\n","date":"March 3, 2013 at 7:28 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26310","author":"ChrisB","site":"shroudstory"},{"title":"The face Jesus left us","post":"Chris, God is Love.  Whenever there is a stern warning which is given by the Father, Jesus or Mary, it is simply a powerful call to the convertion and it is there because God knows very well that it is only by walking with him that a human being can really find true happiness on earth.  Unversal Salvation is on the way because that’s what God has planed for all eternity.  And if that would not be the case, be sure we would not be here today !  He would simply not created anything.  The God of Jesus Christ is call Love and Mercy and he will never accept that one single of his children can be lost forever.  That’s the profound meaning of the lost sheep parable and I think that, with the eyes of faith, we can see this truth on the Shroud!  Peace my friend!  YOU ARE SAVED.\n\n","date":"March 3, 2013 at 7:40 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26312","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"If Universal Salvation is accepted, then I think it will be a marker that the Church really has been infiltrated. It is a dangerous doctrine which gives a false sense of freedom.\n\n","date":"March 3, 2013 at 8:02 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26318","author":"ChrisB","site":"shroudstory"},{"title":"The face Jesus left us","post":"Believe what you want, I don’t care.  One thing’s for sure:  your God is not my God and also not the God of Ste Therese of Lisieux (a doctor of the Church) and a bunch of other saints during history.\n\n","date":"March 3, 2013 at 8:14 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26324","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"Paul dictated it while Luke translated it in written form.\n\n","date":"March 1, 2013 at 2:54 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26083","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Rephrasin Paulus/Shaul dictated it in Aramaic/Hebrew while Lukas/Yair translated it into written Greek.\n\n","date":"March 1, 2013 at 2:58 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26084","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"(sent to hellenised Judeans)\n\n","date":"March 1, 2013 at 3:00 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26085","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"(most likely)\n\n","date":"March 1, 2013 at 3:01 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26086","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Typo: I meant (most UNlikely)\n\n","date":"March 1, 2013 at 3:57 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26093","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"My impression is that in only a few years, we will be able to see similar identification of autorship not only with texts but also applied to images or paintings. The same type of algorithms if applied to medieval paintings of well known and undisputed autorships will be a most valuable tool to compare the Shroud.\n\n","date":"March 1, 2013 at 3:13 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26088","author":"Gabriel","site":"shroudstory"},{"title":"The face Jesus left us","post":"New comparative imagery techniques will surely help eventually to back-up Paul Vignon’s conclusion concerning his study of many ancient representations of Christ that were most probably based directly or indirectly on the Shroud.  Among these representations, we found the Holy Mandylion of Edessa…\n\n","date":"March 1, 2013 at 4:43 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26097","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"Aunque no tiene relación con el post, creo muy interesante este vídeo que muestra la actitud de los cardenales alemanes con el Papa Benedicto XVI……..\n¡Vaya “basura” de cardenales!\n\nCarlos Otal\n\n","date":"March 1, 2013 at 3:35 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26089","author":"corneliotel","site":"shroudstory"},{"title":"The face Jesus left us","post":"(or else the reverse: since Paulus/Shaul was a Judean who was Hellenised and also a Roman citizen, he could have dictated the letter in Greek and had Lukas/Yair translated into written Hebrew/Aramic)\n\n","date":"March 1, 2013 at 3:49 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26091","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"typo: translated it\n\n","date":"March 1, 2013 at 3:49 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26092","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"I am sceptical of the Letter to Hebrews being written by Paul, notwithstanding an early tradition that he was the author.  It is clearly directed at a Jewish Christian community (hellenised or not), whereas Paul’s main missionary interests were Gentiles. The particular theological emphasis in Hebrews is quite unlike anything else that Paul is known to have written.  This may indicate some limitation in the method developed by the paper’s authors.  Paul was fluent in Greek and needed no translator.  Luke himself was more comfortable in Greek than in Hebrew.\n\n","date":"March 1, 2013 at 4:46 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26098","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The face Jesus left us","post":"“Paul was fluent in Greek and needed no translator. Luke himself was more comfortable in Greek than in Hebrew”. Indeed? What exactly makes you think so? Question for Dave: how come then Paulus/Shaul first took YoHanan/John as HIS personal translator and scribe/secretary on his first travels?\n\n","date":"March 1, 2013 at 5:39 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26106","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Extract from Encyclopeda Britannica:\n“In the time of Paul, Tarsus, the home of famous Stoic philosophers, was on the main trade route between East and West. Like many of the Jews there Paul inherited Roman citizenship, probably granted by the Romans as a reward for mercenary service in the previous century. This fact explains his two names. He used his Jewish name, Saul, within the Jewish community and his Roman surname, Paul, when speaking Greek. Though he had a strict Jewish upbringing, he also grew up with a good command of idiomatic Greek and the experience of a cosmopolitan city, which fitted him for his special vocation to bring the gospel to the Gentiles (non-Jews). At some stage he became an enthusiastic member of the Pharisees, a Jewish sect that promoted purity and fidelity to the Law of Moses. According to Acts, he received training as a rabbi in Jerusalem under Gamaliel I. His knowledge of the Law and of rabbinic methods of interpreting it is evident in his letters.”\nNot only did Tarsus have a Stoic academy, Paul knows enough Greek philosophy to draw on the Cretan Liar paradox.  Elsewhere Encyc Brit observes that it is likely Paul used an amanuensis in the dictation of his letters.  His need for John Mark as a translator is an assumption.  He may very well have been needed to carry the bags, but then fell out of Paul’s favour.\n\n","date":"March 1, 2013 at 10:27 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26124","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The face Jesus left us","post":"Dave you wrote: \n“His need for John Mark as a translator is an assumption. He may very well have been needed to carry the bags.” \n100% wrong. BTW do you know the Greek word for translator? Ring any bell when rereading the Greek version of the Acts of the Apostles? Come on!\n\n","date":"March 2, 2013 at 7:57 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26154","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Max, the word in Acts 13:5 for Jon Mark’s role in several Greek texts transliterates as “upereten” as near as I can figure it (1st and 3rd ‘e’ is eta, 2nd ‘e’ is epsilon).  Most English translations have it as ‘assistant’ or ‘minister’ and this Greek word is included in Woodhouse’s English-Greek dictionary for ‘minister’.  Woodhouse does not include the word as a Greek option for “translate”.  John Mark was evidently a cousin of Barnabas, and his apparent desertion in Pamphylia was the cause of a violent quarrel between Paul & Barnabas.  Later it seems that John Mark & Paul were reconciled – he is mentioned in Philemon & Colossians, as well as in I Peter. \nIf John Mark was also the author of the Marcan Gospel, then JB introduction to synoptics describes the Greek as fairly rudimentary with errors, and I would surmise that a citizen of Tarsus would likely have better Greek, than is apparently the case in Mark’s gospel.\n\n","date":"March 2, 2013 at 8:49 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26201","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The face Jesus left us","post":"Once again Dave you got it all wrong (as received idea). John Mark/YoHanan Maqqaba was faithfully JUST word for word translating Peter/Kêpha Galilean Aramaic into koinê Greek (if you see what I mean). John Mark  was the translator (the hermeneutes i.e. translator, stenographer) of  not only Kêpha/Peter but ALSO Pauls/Shaul. Is Encyclopedia Britannica your ‘sole reference’ in terms of palæochristian  philological analysis/textual archaeology?\n\n","date":"March 2, 2013 at 9:48 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26206","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"I thought it evident that I had consulted a number of sources on the matter.  My personal preference is to refer to authoritative sources in such matters than to take refuge in unsubstantiated assertions couched in obscure circumlocuitous arcanery.  Notwithstanding the recent attempt at a scientific method to identify the unknown authors of ancient scriptures, the case for the Letter to the Hebrews being written by Paul, or for that matter Luke, appears to be very weak indeed.\n\n","date":"March 3, 2013 at 7:13 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26237","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The face Jesus left us","post":"The/your case is very weak indeed.\n\n","date":"March 3, 2013 at 8:12 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26245","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Dave, BTW in which year was your Encyclopedia published? Given research work on the Hebrew/Aramaic substratum of the NT started nearly a century ago, just guess how many scholarly research works on the NT you are totally ignoring.\n\n","date":"March 3, 2013 at 8:27 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26247","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Typo: really started HALF a century ago\n\n","date":"March 3, 2013 at 8:28 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26248","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Reminder: I don’t share Maryam Ebrahimpour et al’s paper solution. In my opinion it is non conclusive.\n\n","date":"March 3, 2013 at 8:34 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26250","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Regarding previous comments above, and those in the previous post on the meaning of B XVI’s remarks and intentions: Is it unreasonable that both science and faith may be used to “decode” certain mysteries of the Shroud?  This announcement is made under the banner of “The Year of Faith”.  Many are naturally drawn to the Shroud because of the importance that faith plays in their life.  The rational scientist is able to effectively realize that faith and science speak to different types of understanding. Is it necessary to declare the foolishness of all others who don’t agree with a personal viewpoint? \nThe Shroud image may have been formed by a natural process(es) currently defined in a science textbook, that has been sitting on the shelf for years.  If so, the answer is sitting there waiting for someone to connect the dots-maybe.  Maybe there are a lot of unknowns that still remain.  The image may have been formed through the transformation of a dead body into a living one by an unknown process; after all, the resurrection of Christ is a cornerstone of the Christian faith.  Some believe that the Shroud is a testament to this event.  Will science be irreversibly corrupted by considering/exploring this possibility? I don’t think so.  Why be threatened by it? Science can speak very well for itself-if such ideas are total folly, then the data will be also-eventually all interpretations reach a consensus.   \nThe Church as stated in the Catechism, declares that “methodical research in all branches of knowledge, provided it is carried out in a truly scientific manner and does not override moral laws, can never conflict with the faith, because the things of the world and the things of faith derive from the same God.”  I am a firm believer in the laws of science.  I am not convinced, though, that we have exhaustively delineated all of the scientific principles that may exist. I would suggest considering the possibility that we have only just begun to scratch the surface.   Cell phones and modern aircraft would have been unthinkable several hundred years ago-beyond laughable to most. Perhaps there is more scientific knowledge to come?  Or maybe we’ve peaked in 2013?  I sure hope not…\n\n","date":"March 1, 2013 at 6:31 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26115","author":"Kelly Kearse","site":"shroudstory"},{"title":"The face Jesus left us","post":"Quote: “The image may have been formed through the transformation of a dead body into a living one by an unknown process.”\nIn the present state of our knowledge, there is absolutely nothing to suggest such an extravagant scenario except the wild religiously biased imagination of some (which sadly count among them some so-called “scientist”).\nMay I remember you that this kind of thinking (i.e. the image formation process is unknown, then it can really be due to a miracle event) represent a religiously biased extrapolation from the original conclusion of the STURP team?  Such a wild extrapolation should not have his place in a real quest that call itself “scientific”.  \nThe ONLY thing we can deduce of STURP’s conclusion is that the process (or processes) that has lead to the formation of this very subtle body image on the cloth is still undetermined, that it surely comes from the interraction between a real body (most probably a fresh corpse that never stained the cloth with liquids of putrefaction) and the surface fibers of the linen cloth and that it is surely a very mild process because the color never penetrated deep into the cloth (it is event possible that the color only reside on a thin layer of impurities without having colored the fibers themselves) and the bloodstains were not denatured by it in any way.\nThat’s the only honest things we can extrapolate from STURP’s conclusion… NOTHING MORE, NOTHING LESS.  Does that allow a real competent and honest scientist that got no religious bias to start searching for some supernatural process like a burst of light or a burst of another form of energy coming out of the dead body to only color the most superficial fibers?  NOT AT ALL!  Ask any atheist, Muslim, Buddhist or Hindoo scientists to analyse the data about the Shroud and then, ask them to tell you the most probable image formation process they think concerning the Shroud’s image and you’ll see that no one will think about any supernatural event!  If you got some non-christian colleagues, please do the test and you’ll see!\nIf a scientist is searching elsewhere than in a natural image formation process, you can be certain that this particular scientist is religiously biased in his scientific quest for truth and, sorry but when that happen, I don’t think we can call this a real competent and honest scientific quest no more…\nThat’s why I’m truly disgusted to see that, these days, almost every scientists who enter the Shroud world is religiously biased (name me one modern scientist who is not christian believer and who is passionate about finding the truth about the Shroud!!! The list must be very small) and that is looking to find some kind of physical traces of the Resurrection on the cloth, which is totally against the official teaching of the Catholic Church for whom the Resurrection should not have left any kind of physical proofs of it that could force or influence the freedom of people to believe in it or not.\n\n","date":"March 2, 2013 at 7:46 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26196","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"Concerning image formation I think most of the dots are in Ray Rogers’ work.\nConnecting them and finding the missing ones are the next challenges (which seem largely underestimated), requiring a multidisciplinary team, modern science and recent textbooks.\n\n","date":"March 3, 2013 at 5:11 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26227","author":"anoxie","site":"shroudstory"},{"title":"The face Jesus left us","post":"And since the image is most certainly the result of a very complex and probably very rare natural process involving some chemical interraction between a fresh beaten and crucified corpse and an ancient linen fabric, I think it will take a great deal of luck for a scientist to came up with what I call “the right chemical recipe” that can allow the exact reproduction of the image in all its physico-chemical aspects.  There are just too many unknown factors related to the dead body, the linen cloth, the temperature, humidity, resting place, the possible presence of burial product (on the cloth and/or on the body and/or next to it), etc., etc.  The best thing that could be done in my mind is to reproduce a small image of a body part on a linen sample that will present all the known characteristic of the image and I don’t expect someone will be able to do so until a new series of direct test can be performed on the cloth.  And even then, I’m not sure.\n\n","date":"March 4, 2013 at 11:41 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26405","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"I don’t feel it’s necessary to defend my or anyone else’s competency or honesty in science.\nI see it more as being objective, clearly there’s a difference of opinion, I’ll just leave it at that\n\n","date":"March 2, 2013 at 8:33 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26199","author":"Kelly Kearse","site":"shroudstory"},{"title":"The face Jesus left us","post":"I agree to leaves to not start a long and useless debate with you.  You are obviously looking at the Shroud with a different perspective than me and I don’t think the world will stop turning because of that.\n\n","date":"March 2, 2013 at 8:48 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26200","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"Yannick escribe: “…….. a burst of light or a burst of another form of energy …..”\nBurst!\nBurst?\nPor qué “a burst”?\n¿quizás para intentar DESACREDITAR a los que creen en la posibilidad de una energía física?\nCarlos Otal\n\n","date":"March 3, 2013 at 5:37 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26229","author":"corneliotel","site":"shroudstory"},{"title":"The face Jesus left us","post":"Por qué “a burst”?  Because that’s what Jackson, Moran, Rinaudo, Fanti and all the other religiously biased scientists out there are trying to make us believe regarding the formation of the image on the Shroud.\nOn that subject, I think I have summarized very well the situation in my previous comment to Mr. Kearse.  Here it is again for you Carlos :  \nThe ONLY thing we can deduce of STURP’s conclusion is that the process (or processes) that has lead to the formation of this very subtle body image on the cloth is still undetermined, that it surely comes from the interraction between a real body (most probably a fresh corpse that never stained the cloth with liquids of putrefaction) and the surface fibers of the linen cloth and that it is surely a very mild process because the color never penetrated deep into the cloth (it is event possible that the color only reside on a thin layer of impurities without having colored the fibers themselves) and the bloodstains were not denatured by it in any way.\nThat’s the only honest things we can extrapolate from STURP’s conclusion… NOTHING MORE, NOTHING LESS. Does that allow a real competent and honest scientist that got no religious bias to start searching for some supernatural process like a burst of light or a burst of another form of energy coming out of the dead body to only color the most superficial fibers? NOT AT ALL! Ask any atheist, Muslim, Buddhist or Hindoo scientists to analyse the data about the Shroud and then, ask them to tell you the most probable image formation process they think concerning the Shroud’s image and you’ll see that no one will think about any supernatural event! If you got some non-christian colleagues, please do the test and you’ll see!\nLet me ask you this Carlos: Don’t you realize that the ONLY ONES who are believing that the image is the result of some supernatural event are also believer in the Resurrection of Christ?  If that’s not an evident proof of a biased scientific quest, I don’t know what it is!  We saw the same kind of biased science in the 30s and during World War II in Germany when a bunch of Nazi’s scientists were using science in order to “prove” the superiority of the arian blood and the inferiority of the Jewish blood !  Why can’t you realize that this is the same kind of bullshit that his going on in the Shroud world since STURP published their conclusion in the 1980s?  On that subject, I would like to say this:  The fact that the STURP team was unable to find a proper mechanism that can account for the image on the Shroud DON’T MEAN FOR ONE SECOND that this image will never be explainable by science or that this prove (or even just suggest) that a miraculous event must be at the origin of that image.  Thinking otherwise is UNSCIENTIFIC (and by implication, religiously biased), PERIOD.\n\n","date":"March 3, 2013 at 6:59 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26302","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"It’s always disconcerting to a scientist when his or her colleagues become so convinced of their convictions that they declare them so unequivocally as fact (or FACT!!! in some cases).\nTake the assertion (forgive me Gabriel), that the author of the Letter to the Hebrews has been scientifically identified. The section of the quoted paper which is devoted to Hebrews is entirely uncertain about the identity of the author. One of their research methods makes it closest to Paul, but well outside the range of certainty of the rest of his letters, and another method makes it closest to Luke, but again, with minimal certainty. Their conclusion is: “This would appear to favour the traditional belief that Paul is the author. However, the corresponding Mahalanobis distance is longer than the furthest distance between any of Paul’s known texts and their stylometric average, suggesting the link between Paul and the Letter to the Hebrews is weak.” This is emphatically not a ‘scientific identification.’ The authors then pose two questions: Was Luke involved in a translation? and, Was the letter written by somebody else entirely? These are not ‘conclusions,’ which mark the end of an investigation; they are questions which they hope somebody will use as the beginning of an investigation.\nThe body of texts used to try to identify Paul’s writing style are in Greek. The letter to the Hebrews is in Greek. If Paul normally wrote in Greek, then he didn’t need a translator. If he normally wrote in Hebrew (or Aramaic), then the rest of his work also needed a translator, and the discrepancy between the ‘main corpus’ and Hebrews could simply be a matter of changing translators (John Mark to Luke?). If he normally wrote in Greek, but needed a translator into Hebrew especially for the letter to the Hebrews, then our text (in Greek), if not his original, must be a retranslation back into Greek again. By another translator? Weird. Whatever the solution, Maryam Ebrahimpour et al’s paper does not claim to provide it.\nNow, moving on to (sorry Yannick) the assertion that the “official teaching of the Catholic Church” is that “the Resurrection should not have left any kind of physical proofs.” Is there any substance for this assertion? As a Catholic myself, I would find it very difficult to accept that the Resurrection didn’t happen at all, although as a scientist I’m personally inclined towards a more metaphorical than literal interpretation of that word. However, if the resurrection was a physical event, then something scientifically explicable but at present unknown must have occurred, and whatever it was may have left traces. Whether Jesus just woke up, pushed off the shroud and walked out, or suddenly dematerialised and rematerialised elsewhere, or exploded in a shower of rainbows, some evidence of what occurred would have remained, and may still be evident today. I would agree with Yannick if he said that the church does not require proof, but to suggest that it positively rejects proof is I think misinformed.\n\n","date":"March 3, 2013 at 6:55 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26235","author":"Hugh Farey","site":"shroudstory"},{"title":"The face Jesus left us","post":"The Resurrection left only some SIGNS my friend, because that’s the way God (who is Love, don’t forget that important fact) is acting to respect our freedom ! Love NEVER force anyone… And if there would be some clear and undisputable physical traces of that event (on the Shroud or elsewhere), then how in the world someone could remain free to believe or not?\nAnd here’s the best question for you Hugh:  What real and unquestionable proof can you bring me in order to prove that event?  You CAN’T and THAT’S NORMAL!  That’s how it goes.  By definition, if someone could find a proof, he would not needs faith no more!  This is basic logic…\nAnd St John is the Evangelist who understand that aspect the best because he’s the only one who don’t call the mightly deeds of Jesus “miracle” but instead, he call them “signs” (as it should be!).   \nAnd here’s the most important signs of the Ressurection (for me at least):\n1- The testimonies of the disciples after the apparitions of the resurrected Christ.\n2- The empty tomb (don’t forget that the empty tomb is a real historical FACT because even the ennemies of Jesus never denied it but instead, they explain it differently).\n3- The empty Shroud (which I put on the same level than the empty tomb).\nIn EVERY ONE of these cases, note that someone needs FAITH in order to believe in the Resurrection of Jesus because, each one of these things can be rationally explained without the need to call for a miraculous event.  And that’s precisely why most of the Jews of the first century never convert to Christianity!\nIn the end, the most important thing for anyone’s faith is the spiritual experience of God (through the Eucharist, the prayer, charity, etc.) he is living inside of him and the small experience of personal resurrection he also live in his life.\nSince God is a SPIRIT, the best way to get close to him is through SPIRITUALITY and not through a scientific or a purely human philosophical analysis!  In other words, the best way to find God is to look into your heart and not by analysing some colored linen fibers through a microscope (even though I must admit that an honest scientific quest for truth can also get someone closer to God, but it’s not the best way in my mind)!\n\n","date":"March 3, 2013 at 6:45 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26298","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"I think the Catholic Church is rather more pragmatic than you suggest. Faith is an admirable virtue when physical evidence is missing, but as a substitute for logical proof it comes a poor second when adherence to a religion is concerned. As it happens, I feel that even if it were credibly demonstrated exactly how a dead body came back to life, it would not convince the faithless that Jesus was God. It might do just the opposite, and “prove” that since the Resurrection was an ‘ordinary’ event, Jesus was not God. Still, as I ended before, the Church does not require proof, but to suggest that its official teaching is to reject physical evidence, or proof if it were possible, is misinformed.\n\n","date":"March 3, 2013 at 7:43 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26313","author":"Hugh Farey","site":"shroudstory"},{"title":"The face Jesus left us","post":"Where do you see the Church focussing on physical evidence of God or physical proofs of the Resurrection in his official teaching???  I would love to see that!\n\n","date":"March 3, 2013 at 8:01 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26317","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"Dear me. One of the classic fallacies. Contraposition, if I’m not much mistaken. I say, “The church does not object to proof of its beliefs;’ you say, “Where does the church focus on proof of its beliefs?”\n“Not objecting to” is not the same thing at as “Focussing on.”\nYou say the Church’s “official teaching” (your words) is that “the Resurrection should not have left any kind of physical proof.” Can you substantiate this assertion?\nBut wait! Before leaping to your keyboard, I wonder if I could suggest a few guidelines – \nAn opinion does not become a fact:\na) by repeating it several times.\nb) by writing it in capital letters.\nc) by following it with several exclamation marks.\nd) by being sincerely believed in\ne) by being quoted by ‘experts’\nf) by being replaced with a different opinion.\nI hope this helps…\n\n","date":"March 4, 2013 at 9:11 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26388","author":"Hugh Farey","site":"shroudstory"},{"title":"The face Jesus left us","post":"The Church has NEVER claimed that there is any kind of physical trace of the Resurrection on the Shroud.  Only those that I call “the modern religious integrists who use science to back-up their ideology” does…\n\n","date":"March 4, 2013 at 11:44 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26406","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"And concerning my use of CAPITAL LETTER, let me be clear once and for all:  I use this technic just to emphasize what I consider the most important arguments I present.  I cannot use the bold characters on this blog, so I use the CAPITAL LETTER method instead.  That’s all.  I don’t understand why people get upset because of this…  That’s completely ridiculous.  Are we living in a free world or what?\n\n","date":"March 4, 2013 at 11:46 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26407","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"No, no, no, you’ve fallen at (f), “trying to substantiate an opinion by replacing it with a different opinion.”\nHas the Church actively sought proof of the resurrection? – No. I never said it had.\nHas the Church claimed that there is a trace of the resurrection on the Shroud – No. I never said it had.\nIs the Church’s “official teaching” that “the Resurrection should not have left any kind of physical proof”? That’s what I want substantiated (if you still hold to that view).\n\n","date":"March 4, 2013 at 12:04 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26412","author":"Hugh Farey","site":"shroudstory"},{"title":"The face Jesus left us","post":"To Dave: Most likely YoHanan (later to be called Maqqaba)/John (Mark) was formerly a High Priest servant (Hebrew ebed/eved/Gr. huperethen). The Hebrew word  sophereth (assistant secretary, scribe) can be rendered in Greek by huperethen, “assistant’. Most likely John (Mark) was ‘the (High Priest) servant’ that let Kêpha/Peter in the High Priest house the night before the Passion. Most likely, as stenographer, he was also the one who registered the dialogue between ‘Yeshua and High Priest Hanan on that very night. Most likely too Yeshua’s gave his Sindon to John (Mark) (or Joseph  of A. his uncle as first/second best candidate)… (this is my opinion. My claim is definitely NOT ‘unsubstantiated assertions couched in obscure circumlocuitous arcanery’ as you most ignorantly put it).\n\n","date":"March 3, 2013 at 12:03 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26262","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"John (Mark) as hermeneutes, Greek for ‘translator, stenographer’ (first Peter’s) + huperethen, Greek for ‘assistant, servant’ (then Paul’s) = ‘sophereth, Hebrew for ‘assistant secretary’  as High Priest/Chief Rabbi’s translator and stenographer.\n\n","date":"March 3, 2013 at 3:09 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26281","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"John (Mark) also was  Kêpha/Peter’s hermeneutes (translator, stenographer).\n\n","date":"March 3, 2013 at 12:05 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26263","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Most likely, as Paulus/Shaul’s huperethen/assistant/servant, John (Mark) was his personal assistant secretary. Got it?\n\n","date":"March 3, 2013 at 12:10 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26264","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Dave you claimed: “He (YoHana Maqqaba/John Mark) may very well have been needed to carry the bags (and nothing else)”. What a blatant ignorance of Greek-Hebrew language translation entropy!\n\n","date":"March 3, 2013 at 12:20 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26265","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Typo: Hebrew-to-Greek language translation entropy\n\n","date":"March 3, 2013 at 12:31 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26268","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Hugh Farey’s comprehensive comment on the authorship of Letter to the Hebrews is in my opinion sound and rational.  It is not known who wrote the Letter, but Paul usually identifies himself as author in his own writings, and the theological emphasis in Hebrews is quite different from Paul’s usual style.  There is no shortage of potential candidates.  For all anyone knows, it may have been written by Apollos [Acts 18:24-28], an Alexandrian Jew, “an eloquent man with a sound knowledge of the scriptures”, “… helped the believers considerably by the energetic way he refuted the Jews in public and demonstrated from the scriptures that Jesus was the Christ.”  Letter to Hebrews does much the same, but Apollos is only one of many possible conjectures. \nPaul’s towering intellect and cosmopolitan background is equally at home among both Jews and Gentiles, he would seem to have little need for a translator, the multilingual capabilities of such people of those times is easily under-rated, although it is evident that he often had recourse to an amanuensis when writing his epistles. \nI have less quarrel with Max than he imagines. We seem to be of a mind on the paper by Maryam Ebrahimpour et al; John Mark’s possible role as the High Priest’s servant, as the trial recorder, and provider of his temple garment as the burial cloth are quite credible speculations for a number of reasons, such as the possible healing of his wounded ear, if indeed it was Mark. However his assistance on the mission with Paul & Barnabas was cut short by his apparent desertion, although he later seems to have redeemed himself. \nI should point out to Max that I have done him the courtesy of providing at least one or more of my reference sources, which in the case of Encyc Brit was as recent as 2006, and which by my math wasn’t 50 years ago.  I consider that arguments from a recognised established authoritative sourced reference are to be preferred, and I believe more persuasive, than any unsubstantiated, uncited assertions, regardless of any claims to some expertise in such matters.\n\n","date":"March 3, 2013 at 5:05 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26289","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The face Jesus left us","post":"I say it again (just in case): John (Mark) as hermeneutes, Greek for ‘translator, stenographer’ (first Peter’s) + huperethen, Greek for ‘assistant, servant’ (then Paul’s) = ‘sophereth, Hebrew for ‘assistant secretary’ as High Priest/Chief Rabbi’s translator and stenographer.\nThis would explain many things Dave (and even his Bible-like Ency. Brit. companion as prompter) would be quite at a loss to REALLY account for.\nIf you really think John Mark was “Paul’s bags carrier”, good to you. However you must be reminded your opinion is even FAR MORE “unsubstantiated” than mine as far as Hebrew, Greek and Translation entropy is concerned. Besides you cheap hypothesis is “based on uncited assertions, regardless of any claims to some expertise in (such a) matter (…)” as you would put it against me. \nYou also mentioned “the possible healing of his wounded ear, if indeed it was Mark”. What a funny idea of yours. I never claimed John Mark was/could be identified with Malchus (a High Priest Servant in arms)?!  You are totally off the ‘mark’ (pun intended).\n\n","date":"March 3, 2013 at 6:11 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26294","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"A number of points:\nMark places the two incidents of the young man running off naked, and the ear-cutting episode juxtaposed, so that it’s if Mark who runs off naked, then clearly it’s not Mark who has his ear cut.  Both Matthew & Luke also mention the ear incident, but without naming the servant. Only John names him as Malchus and there’s no good reason to think otherwise, unless naming of the servant is merely a means of lending credit to the gospel being an eyewitness account.    \nThe tradition that Mark assisted Peter in Rome may be based on the closing lines of I Peter, but who the author of I Peter is may still be argued.  Nevertheless Peter was generally considered to be the guarantor of Mark’s gospel.  Paul in two epistles generally accredited to him also says that Mark is assisting him.  \nIt would seem that the only really good reason for asserting that Mark was the Sanhedrin’s secretary, was that all other three gospel accounts of the trial adhere to Mark’s version fairly closely, albeit with some minor additions.  But both Nicodemus & Joseph of Arimathaea could also have provided oral accounts which all four gospels could have then followed. \nMy designation of Mark as “bag carrier” was merely to make the point that whatever his intended role in the Pamphylia mission might have been, it was short-lived, amd I think you read more into it than I intended. Luke asserts that the ensuing quarrel between Paul & Barnabas (Mark’s cousin) was “violent” and clearly Paul was not at all pleased with Mark in this episode.  But if Paul & Mark can be reconciled, then hopefully so can Max & Dave be allowed their different perspectives!\n\n","date":"March 3, 2013 at 8:10 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26323","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The face Jesus left us","post":"BTW as a professional cryptologist, I am used to proceed to cryptogenetic analyses applied to texts whose author(s) or persons mentioned in it have apparently no evident identification or are apparently of unknown identity. I do think I have some expertise in this most specific field.\n\n","date":"March 3, 2013 at 6:26 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26296","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Typo: applied to texts whose author(s) or persons mentioned in THEM have apparently no evident identification or are apparently of unknown identity.\n\n","date":"March 3, 2013 at 6:27 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26297","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"In response # 49 above, Yannick Clement makes the analogy between scientists who believe in the Resurrection and Nazi scientists in World War II…utterly amazing-it is difficult to put into words how extremely offensive this is\n\n","date":"March 3, 2013 at 10:12 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26330","author":"Kelly Kearse","site":"shroudstory"},{"title":"The face Jesus left us","post":"The contributions that Dr Kearse has made to this web-site are outstanding, always a delight to read, with remarkable insights, clearly and scientifically expressed, generously sharing his all too rare expertise, but always with a professional prudence matched by the admirable Christian forbearance of his previous comment.  They are an utter contrast to the amateur verbal ramblings of the Quebecois master of the inapt and outrageous, whose arrogant confidence in his own narrow vision is only matched by his intolerance of any other viewpoint except his own, and which can no longer claim my slightest interest.\n\n","date":"March 4, 2013 at 3:36 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26360","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The face Jesus left us","post":"May I suggest you look at yourself in a mirror Daveb ???  Hank Williams had a good song that can fits very well with you :  BE CAREFUL AT STONES THAT YOU THROW !  Remember Jesus teaching about that? ;-)\n\n","date":"March 4, 2013 at 11:49 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26409","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"Just to make things clearer to Daveb: I really don’t remember having made personal attacks the way you often do with me.  I never call you (or anyone else on this blog) “idiot”, “inapt” or anything like that…  I just use strong arguments to defend my ideas but it’s very different than cheap personal attacks that I often “endured” on this blog from you and from many others.\nThe only “accusations” you can see me doing here concern those that I consider totally “religiously biased” or “dishonest”.  That’s very different than calling someone “cretin” or something like that, don’t you think?\n\n","date":"March 4, 2013 at 12:16 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26415","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"¡Muy bien, Kelly y Daveb!\nCarlos Otal\n\n","date":"March 4, 2013 at 3:45 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26362","author":"corneliotel","site":"shroudstory"},{"title":"The face Jesus left us","post":"Yannick, when among reasonable people you become the subject of the argument, you must take the time to ponder why. I have a mental picture of you trying to carve the fine delicate details of an important statue in fragile marble with a pick ax and a sledge hammer when a small chisel and light wooden mallet is called for. Yannick,my friend,  the analogy was unfortunate.\n\n","date":"March 4, 2013 at 5:48 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26371","author":"Dan","site":"shroudstory"},{"title":"The face Jesus left us","post":"No.  The analogy I made was right on the target.  I was only refeering to the PRINCIPLE of using science in order to push some political, philosophical or religious IDEOLOGY.  My analogy imply the Nazi but I could have choose many other examples, like the scientists who use science to back-up the creationist ideology…  There are a bunch of examples like that unfortunatelly !\nIf Mr. Kearse thinks that he fits into that category, it’s not my problem.  He was not among the persons I had in mind while making my analogy.  The persons I had in mind are those who use the Shroud to try to physically prove the Resurrection.\n\n","date":"March 4, 2013 at 9:33 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26393","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"I don’t see any problem in Yannick’s analogy, I thought it was a good one – both cases have pseudo science trying to reinforce a particular belief system.\nOf course there is an almighty difference in the ‘end’ if not the ‘means’. Obviously the Nazi example was for sinister ends, the Shroud example is not for sinister ends at all. Misguided ends, potentially, but not sinister.\n\n","date":"March 4, 2013 at 6:43 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26376","author":"Matthias","site":"shroudstory"},{"title":"The face Jesus left us","post":"Matthias, it seems that the only ones who have a problem with my analogy are those who are fitting into that category of people who are willing to use science to back-up their ideology, which in the case of the Shroud is religious…\n\n","date":"March 4, 2013 at 11:51 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26411","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"Dave,\nyou wrote: “… so that it’s if Mark who runs off naked, then clearly it’s not Mark who has his ear cut” as if I had ever claimed the contrary?! This is pretty obvious and was NOT the real issue under discussion! What I don’t really get is the reason why you had the ear cut incident come into the debate.\nyou also wrote: “It would seem that the only really good reason for asserting that Mark was the Sanhedrin’s secretary, was that all other three gospel accounts of the trial adhere to Mark’s version fairly closely, albeit with some minor additions. But both Nicodemus & Joseph of Arimathaea could also have provided oral accounts which all four gospels could have then followed.”\nReminder 1: According to Papias: ‘the Elder’ (Presbyter) used to say this, ‘Mark became Peter’s interpreter [hermeneutes, Greek that can also be rendered by ‘translator’ and/or ‘stenographer’] and wrote accurately (Peter’s memoirs).\nReminder 2: from a close scrutiny of the High Priest House nightly episode and knowledge of Sanhedrin procedures, the Sanhedrin could only be composed of 3 members.Thus the odds  for “Nicodemus & Joseph of Arimathaea” to be both in attendance that very night are very weak. Now if we base our deduction from Hebrew-to-Greek translation entropy (Gr. hemeneutes + Gr. huperethen (applied to the same person namely John Mark) < Heb. sophereth, 'assistant secretary/assistant scribe = a young man), John  (Mark) as High Priest Hanan's assistant/servant secretary (stenographer) does make more sense. Most likely he was the one to let Kêpha/Peter in and reported the dialogue between Yeshua and Hanan. Maybe we can go as far as deducing 'the young man who runs off naked' was John (later to be called) Mark. Maybe. The fact is this crypto-exegesis is totally consistent with our knowledge of Second Temple period Sanhedrin procedures, Aramaic/Hebrew-to-Greek translation entropy and NT Greek Version.\n\n","date":"March 4, 2013 at 9:24 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26390","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Ear incident: My comment was intended merely to illuminate my momentary lapse in confusing the two juxtaposed incidents.  You correctly reminded me that John’s gospel identified the wounded servant as Malchus, not Mark. The error was mine.  \nTrial witnesses: Mark 14:53-56: “They led Jesus off to the high priest; and ALL THE CHIEF PRIESTS AND THE ELDERS AND THE SCRIBES ASSEMBLED THERE. [Peter warms himself at fire] THE CHIEF PRIESTS AND THE WHOLE SANHEDRIN were looking for evidence against Jesus on which they might pass the death-sentence. SEVERAL indeed brought false evidence against him, but their evidence was conflicting. …” It is plain from Mark that there were rather more present than the three rostered members of the Sanhedrin.  As both Joseph and Nicodemus were both secret followers of Jesus, and would both have access to the proceedings, the case for their presence is not so weak as you state.  \nPapias: I am well aware of Papias claims, but Eusebius considered him an unreliable source: “Papias (died c. 130), a bishop of Hieropolis, in Asia Minor, was said by Irenaeus (died c. 200), a bishop of Lugdunum (now Lyon, France) to have been an eyewitness of the Apostle John. Papias had said, “For I did not suppose that the things from the books would aid me so much as the things from the living and continuing voice.” Eusebius (c. 260-c. 340), a church historian, reported these comments in his Ecclesiastical History and pointed out inconsistencies in Papias’ recollections, doubted his understanding, and called him “a man of exceedingly small intelligence.” ”  Papias’ claim that Mark wrote accurately Peter’s “memoirs” would refer to the gospel known as Mark, as “memoirs” was the word then commonly used to describe these scriptures.   \nMark may well have been Peter’s amunuensis in Rome, and it is supported by I Peter for what that is worth.  His possible role as official trial recorder is a credible conjecture, but I certainly can’t see it as an indisputable fact.  There were several other eye-witnesses to the trial, and I think it equally likely that their oral reports of the trial could just as well have been the source of the original gospel account.  We are too far removed in time for any kind of factual certainty, and credible conjectures cannot exclude other possible explanations.  \nI think I must adhere to the view that Paul would have been competent in at least koine Greek (Tarsus), Aramaic and classical Hebrew (under Gamaliel I), certainly without the need for a translator in his preaching, although he apparently found it convenient to dictate to an amenuensis for his epistles. I think it unlikely he was the author of Hebrews, but could concede it is just barely possible as Jewish recipients would require a different approach and Paul would certainly have adequate capability to have adjusted to this. But it is unlike other Pauline writings.\n\n","date":"March 4, 2013 at 5:01 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26436","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The face Jesus left us","post":"Reminder 3: Mark’s Gospel is totally based on Peter’s memoirs NOT Nicodemus & Joseph of Arimathaea’s.\n\n","date":"March 4, 2013 at 9:26 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26391","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"The two direct witnesses on that night (The High Priest Hanan House scene) were Peter AND John Mark.\n\n","date":"March 4, 2013 at 9:31 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26392","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Most likely.\n\n","date":"March 4, 2013 at 9:37 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26394","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Yannick you wrote:\nAnd here’s the most important signs of the Ressurection (for me at least):\n“1- The testimonies of the disciples after the apparitions of the resurrected Christ.\n2- The empty tomb (don’t forget that the empty tomb is a real historical FACT because even the ennemies of Jesus never denied it but instead, they explain it differently).\n3- (which I put on the same level than the empty tomb).”\nOK for the first sign but what about the two other alleged ‘signs’? \n1/ Neither Maria of Magdalene long with the other women nor Peter or even John himself (if we can read Church Doctor Augustine of Hippo) considered the empty tomb in se as a ‘Resurrection sign’.\n2/ Was the Shroud lying ‘empty’ in the empty tomb? The true fact is John only mentioned shroudS not THE shroud. Thus it is not even a proven fact the long inner burial sheet still was lying in the empty tomb along with the other smaller shrouds. Reminder: on the morning of the first day of the Judean week, Yeshua appeared first to Mary Magdalene. Was he dressed or naked? What did a Second Temple period gardener look like? Just have a guess…\n.\n\n","date":"March 4, 2013 at 11:24 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26403","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"For me Max, the #2 and #3 signs are really signs of the Resurrection BUT ONLY in the light of the apparition of the Resurrected Christ!  I should have made that precision and that’s why I put the apparitions in #1 place!\nWithout a faith in the testimonies of the disciples concerning these apparitions, the empty tomb and the empty shroud would be just that: empty things !  And they could surely be explained rationally by people who don’t believe in Christ…  But once someone believes in the apparitions of the Resurrected Christ, then these 2 material things that are the empty tomb and the empty shroud can be understand in a completely different way (i.e. as 2 great signs – not proofs –  of the Resurrection of Christ).\nIs it good for you?\n\n","date":"March 4, 2013 at 2:02 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26418","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"As long as it is good for you, it’s ok. However there is something quite ‘missing beyond faith’, I mean true facts.\n\n","date":"March 4, 2013 at 2:39 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26423","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Mary Magadalene mistook Yeshua for a gardener and not for an angel (a messenger). This clearly implies he could be mistaken for an everyday man.\n-Can now a Christian clearly answer these two very simple questions in conjunction with the empty tomb and the funerary linen: \n1/ Was Yeshua dressed or naked when he appeared to Mary Magdalene?\n2/What did a Second Temple period gardener look like? \n(Of course I have my own idea about the most likely answers to both questions. Still I’d like to know how you Christians interpret Yeshua’s first apparition)\n\n","date":"March 4, 2013 at 2:53 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26425","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"I will talk only for myself (a catholic liberal who doesn’t follow every dogmas of the Church and who prefer to think by himself):\nFirst question: Of course he was dressed!  Have you ever seen a gardener naked?  By the way, the fact that she doesn’t recognize his master is very telling about the fact that Jesus chose to appear to his disciples with a different body appearence than he had before his death (the one we see on the Shroud) and I’m pretty sure this was done for one single purpose: TO RESPECT THE LIBERTY OF HIS DISCIPLE AND NOT FORCE THEM TO BELIEVE IN THE RESURRECTION!  If you read carefully the texts, the disciples always needed some SIGNS to recognize Jesus in the man they had in front of them.  That’s very telling on who God really is, i.e. LOVE.\nSecond question: I have no idea. I guess pretty much like any normal Jew who did a manual work for a living. Don’t forget that the tomb (as well as the place of crucifixion) was located in a garden (or near a garden).  In that context, I think Mary Magdalen mistook the man she had in front of her as a gardener not because of his dressing but more likely just as a logical deduction determined by the location of the tomb and the time of the day.  Who else than a gardener can you expect to see in a garden very early in the morning?\n\n","date":"March 4, 2013 at 4:43 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26434","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"Yannick, you wrote: \n“Of course he was dressed! Have you ever seen a gardener naked?”\n “In that context, I think Mary Magdalen mistook the man she had in front of her as a gardener not because of his dressing but more likely just as a logical deduction determined by the location of the tomb and the time of the day. Who else than a gardener can you expect to see in a garden very early in the morning?”\n1/Re your “logical deduction”, do you expect to see ‘angels’ too? \n2/Re “a logical deduction” while your having ‘no idea’, ever thought Second Temple period gardeners could be easily recognisable?\n\n","date":"March 4, 2013 at 5:23 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26438","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"0/ How can Mary Magdalene discriminate between an angel and a gardener?\n\n","date":"March 4, 2013 at 5:32 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26439","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"4/Don’t you think he might as well be the owner of the cavetomb (Yossef Ha-Ramathaym?\n\n","date":"March 4, 2013 at 5:38 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26440","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"…or a guard?\n\n","date":"March 4, 2013 at 5:38 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26442","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Typo: he might as well have been\n\n","date":"March 4, 2013 at 5:43 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26443","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"5/How can Mary Magdalene discriminate between an angel and a gardener and still not being able to recognise her own Rabbi?\n\n","date":"March 4, 2013 at 5:52 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26444","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"6/How can Mary Magdalene discriminate between an angel a gardener, the landlord, a gard and still not being able to recognise her own Rabbi?\n\n","date":"March 4, 2013 at 5:54 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26447","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Max, the answer to your last question is easy:  Mary Magdalen never saw an angel with her own eyes!  You surely know that the ancient Jewish writers were often using images in order to express spiritual realities.  And a lot of time, the expression “angel of the Lord” was in fact, a way to talk about God…  And if Mary was not able to recognize someone that she loved so much, it’s easy to understand that this could only mean two things: 1- it was not Jesus at all. or 2- it was the Resurrected Jesus but his body appearence was different than the one he had before his death.  That mean that the Resurrection of Jesus was not a re-animation of a corpse like it was in the case of Lazarus.  It was a completely different thing which goes well beyond our space-time universe.\nI believe in the second scenario…\n\n","date":"March 4, 2013 at 6:00 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26448","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"Yannick, Ddon’t you think Yeshua’s first apparition  to Mary Magdalene is a far cry from “the resurrected Christ in all his glory package” most Christians try to sell us?\n\n","date":"March 4, 2013 at 6:59 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26452","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"It sure does in my mind Max! I’m certain that this apparition (and all the others) were not done by a Jesus who was showing some kind of a “Glorious body”.  Mary’s reaction by considering this unknown person as the gardener is very telling about the fact that the body of Jesus during this apparition was most certainly normal (I mean that it was like any normal human body).  We must see these apparitions of the Resurrected Christ has “physical apparitions” and we must be very prudent and not extrapolate them into eternity and think that this is a proof that Jesus still has this particular physical body in the Kingdom of God (or thinking that we will still have a physical body after death).  These are two very different realities (the physical world and the spiritual world) and it’s certain that there will be no more “physical” matter on the other side.  But to come back on these appearence of Jesus, he was somewhat “obliged” to take again a physical appearence in a normal body because he did not wanted them to take him for a ghost.  And the fact that he physically appeared to them is also a SIGN that it is not just the soul who will resurrected after death but all the person (body and soul).  But again, let’s not think that this resurrected body that everyone will get will be the same nature as our physical body.  As Jesus said in the Gospel: “You will be like angels”.  That’s very telling !  That mean that we will live a totally different sort of life in a “spiritualized” body (St Paul talks about that in one of his letter) that will not be bound no more to our present physical needs and that will never suffer or die again.\n\n","date":"March 5, 2013 at 11:36 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26524","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"Typo: YC wrote: “3- The empty Shroud (which I put on the same level than the empty tomb).”\n\n","date":"March 4, 2013 at 11:29 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26404","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Dear all,\nJust some thoughts in haste.\nAlthough I agree with most of Yannick’s theological points of views, I completely disagree with his behavior.\nHugh and others are honest researchers.\nYannick, The “Nazi” reference is absolutely revolting (whatever your explanations).\nPeace.\nThibault.\n\n","date":"March 4, 2013 at 5:10 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26437","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"The face Jesus left us","post":"This comment proves that Thibault has not understand ANYTHING about the meaning of my point!!!  INCREDIBLE.  It’s like someone who don’t want to understand.  In french, we call this “être bouché des deux bouts”.\nThibault, first of all, my comment was not directed toward anyone specifically.  Read the explanation I gave to Dan please: https://shroudstory.com/2013/03/01/the-face-jesus-left-us/#comment-26393\nOf course, you know me enough to know who are the guys I was thinking while I was making my analogy and I can ensure you that Mr. Kearse and Mr. Hugh Farey are not among the list…  As I know, these 2 persons doesn’t defend any supernatural hypothesis of image formation, no more than you by the way.\nI made this analogy for one single purpose: to expose the pathetic act of some researchers who use and deform science in the single dishonest purpose to push their religious ideology, which is something we saw with the Nazi regime and which is something we often see today concerning many philosophical, religious or atheist ideologies.\nThe point I wanted to make is this: Once someone is using science in order to back-up an ideology (whatever it is a Nazi, communist, religious or an atheist ideology), I’m sorry but it’s not science no more.  And sorry but it’s a fact:  In the Shroud world, especially since STURP came up empty of a complete explanation for the image, we saw a bunch of so-called “scientists” using their “science” on the Shroud’s image for the sole purpose of “proving” the Resurrection.  Sorry again but on the PRINCIPLE, I don’t see any difference between this kind of acting and the kind of acting of the Nazi regime. \nDon’t you realize that this was just an ANALOGY my friend?  My goal was not to call anyone a nazi or something like that!  My goal was to denunciate the acting of many so-called “scientists” who are not doing Shroud science for the right motive, which should be to find the TRUTH and nothing else.  In fact, these persons are doing exactly the opposite: they use their “science” in order to fool the general public and make them believe that we really can find a physical trace of the Resurrection on the Shroud, which is a LIE. \nFinally, I’m sorry again but when someone mix “science” and “lies” (or even just “biased conclusions and observations”, I don’t think we can call this “science” no more.\nI HOPE YOU UNDERSTAND MY COMMENT BETTER NOW!\n\n","date":"March 4, 2013 at 5:52 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26445","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"Yannick,\nObviously you think that I am stupid man.\nWhen I wrote ” whatever your explanations” any intelligent man should have understood that I perfectly understood that you were using an analogy.\nBut they are different kinds of analogy.\nI repeat: comparing “biased science” of the Nazis with “biased science” of some Shroud researchers you hate is not only an insult but, above all, a non-sense. There is an enormous difference and science has nothing to do with that.\nWhat difference ? In the first case (the Nazis) killed thousands of people to “prove” their racist theories. With the Shroud, we are dealing with a linen sheet.\nBe careful.\n\n","date":"March 5, 2013 at 4:35 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26540","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"The face Jesus left us","post":"Thibault, it’s incredible how you don’t want to understand and that’s why I’m not interested no more to keep on talking with you.  This is a pure waste of time.\nBefore I go elsewhere, I would like you to answer the question I asked this morning :\nAre you naive enough to believe that there are no Shroud researches done these days that are driven by a religious ideology instead of a real and authentic quest for truth (whatever that is)?\n\n","date":"March 5, 2013 at 4:52 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26543","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"Here’s a complementary note for Thibault :  In my previous comment, I use strong words but that was only done to wake you up concerning the fact that you completely pass by the real meaning of my analogy betweenthe nazi scientists and some modern Shroud “scientists”, which is this: both are using science in order to back up their preconceive notions and their ideological concepts (concerning the Shroud, the concept his evidently religious).  I sure hope you won’t get upset by this comment.  Instead, I hope you will finally realize the real intention I had when I first wrote my analogy.\n\n","date":"March 5, 2013 at 9:33 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26508","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"Dave you wrote: Mark 14:53-56: “They led Jesus off to the high priest; and ALL THE CHIEF PRIESTS AND THE ELDERS AND THE SCRIBES ASSEMBLED THERE. [Peter warms himself at fire] THE CHIEF PRIESTS AND THE WHOLE SANHEDRIN were looking for evidence against Jesus on which they might pass the death-sentence. SEVERAL indeed brought false evidence against him, but their evidence was conflicting. …” \nAnd you comment: “It is plain from Mark that there were rather more present than the three rostered members of the Sanhedrin.”\nThe TRUE fact is this is ONLY PLAIN FROM the above CURRENT TRANSLATION. Is the CURRENT TRANSLATION from the ancient koine Greek version accurate?  I very much doubt so. What about the most likely Galilean Aramaic substratum? The same text can be understood in a quite different way, it just depends of the translation strategy (word-for-word translation vs. sense-for-sense translation/source-oriented translation vs. target-oriented translation, direct translation vs. oblique translation (by Vinay & Darbelnet), adequacy vs. acceptability, formal equivalence vs. dynamic equivalence (by Eugene Nida), semantic translation vs. communicative translation (by Peter Newmark), overt translation vs. covert translation (by Juliane House), documentary vs. instrumental translation (by Christiane Nord), foreignization vs. domestication (by Lawrence Venuti), etc. While these binary oppositions have much in common, they reflect different perspectives and emphasize different translation aims and effects). \nThe TRUE fact is the same text can be translated according to a time-perspective more consistent with the real chronology in terms of Yeshua’s trial by the Sanhedrin. The same sentences can be read as follows:\n1-They led Jesus off to the high priest\n2- And It was there all the chief priests and elders and the scribe WOULD assemble\n(…)\n3- The chief priests and the whole Sanhedrin HAD BEEN looking for evidence against Jesus on which they might pass the death-sentence. Several (witnesses) indeed HAD BROUGHT false evidence against him, but their evidence was conflicting.\nReminder for Dave: Yeshua has  ALREADY been judged and sentenced to death in absentia. To confirm a death sentence in presentia ONLY 3 Sanhedrin members were needed.\n\n","date":"March 4, 2013 at 7:27 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26454","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Typo: Reminder for Dave: Yeshua HAD ALREADY BEEN judged and sentenced to death in absentia.\n\n","date":"March 4, 2013 at 8:03 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26461","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"The assertion that only three Sanhedrin members were present at the trial of Jesus seems to rely on an assumption that the original text was set down using the pluperfect tense.  This is not the impression that any of the gospel accounts that I know create for me, but rather there is more of a sense of immediacy.  It also seems to rely on the unproved assumption of an underlying “Galilean Aramaic sub-stratum”. The Greek texts that we have are those received into the canon by the early church fathers.  As far as I know, there is no or little evidence of much in the way of a prior text, Aramaic or otherwise, that would substantiate the assertion, but is only an inference made by a few exegetes who are certainly not unanimous in their opinions.  \nMy Greek does not extend to its case sensitive aspects, but my Latin certainly does, and Jerome’s Vulgate does not use the pluperfect, but rather the perfect and imperfect (continous) past tenses in describing the trial scene.  If you’re not aware of it already, a useful web-site for parallel texts, including five various Greek versions, Latin Vulgate, and assorted English translations can be found at:\nhttp://www.greeknewtestament.com/B41C014.htm\nI suspect however that you may not find that any of the five Greek versions there use the pluperfect, but would be intrigued to be advised otherwise.  \nI imagine that the Chief priests and others were plotting beforehand to see how they might pass the death sentence – the gospel acoounts certainly say as much – but I don’t see how this can be seen as any formal sentencing in absentia.  A gospel account records that the Chief Priest tore his robe at an alleged blasphemy. The exclamation “What need have we of witnesses now?” gives a sense of a present trial and interrogation of witnesses, and someone clearly saw this occur to record it. \nNevertheless, I do not think it necessary to go to these extreme lengths of argument to concede that John Mark may have been the trial recorder or not as the case might be.  I should think that the proceedings were likely conducted in either Aramaic or Hebrew, more likely Aramaic the native language of any prisoner brought to trial, and the record would be in that language.  It is equally likely that Mark wrote the gospel memoir from what Peter knew of it and various other oral accounts.\n\n","date":"March 4, 2013 at 9:24 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26467","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The face Jesus left us","post":"PS The only sb-nag is you just cannot find it in Encyc. Brit. (this my opinion. Reminder: I took part at the creation of the CELT in the faculty of Arts of the University of Riyadh. CELT is the acronym for Centre for European Languages and Translation)\n\n","date":"March 4, 2013 at 7:47 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26458","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Max, I’m truly sorry I have to say this, but in my view Riyadh in Islamic Saudi Arabia is more culturally remote from European Languages, let alone Christian scriptural texts even than New Zealand.  I could have no reason to suppose that any Saudi would be overawed by an Auckland or Wellington faculty established for the study of the Qu’ran or for that matter the works of Omar Khayyam.  I myself have given lectures on ancient Egyptian and Babylonian and medieval Arab mathematics and my brother has taught English to several Chinese students preparing for study at Auckland University.  (In fact hundreds, possibly a thousand Asian students study in assorted faculties throughout our NZ universities.)  I have studied assorted ancient Mesopotamian myths as translated from the original cuneiform and Phoenician at Massey University NZ, and presented seminar papers on them.  But by no means could I claim to be an expert in any of those topics.  They are merely part of my portfolio of background knowledge.  I do have some acquaintance with the limitations of certain knowledge attainable in academia.\n\n","date":"March 5, 2013 at 4:13 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26489","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The face Jesus left us","post":"Reminder for Dave about translation strategies: researchers agree on a few defining characteristics of a translation strategy: 1) it is goal-oriented; 2) it is problem-centered; 3) it requires making coordinated decisions; 4) it is potentially conscious; and 5) it involves text manipulation.\n\n","date":"March 4, 2013 at 9:03 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26464","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"In order to make myself more clear in the mind of all of you who have criticize me recently, I just have one question for you : Are you naive enough to believe that there are no Shroud researches done these days that are driven by a religious ideology instead of a real and authentic quest for truth (whatever that is)?  Since the obvious answer to that question is yes, what is the problem with what I said lately on the blog?  I just used an easy example taken from the history of the 20th century to remind you that, sometimes (and sadly), science can be used for the wrong motives, i.e. to push an ideological and a biased point of view, and that it is obviously the case for some Shroud researches, especially since the end of the STURP adventure. I didn’t intend to say anything else than this.\n\n","date":"March 5, 2013 at 9:29 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26507","author":"Yannick Clément","site":"shroudstory"},{"title":"The face Jesus left us","post":"Reminder 1 for Dave:\nI am a professional cryptologist who he used to apply cryptology to historically/archaeologically enigmatic/ ‘non evident’, inscriptions, images AND TEXTS. \nReminder 2: when I wrote “I took part at the creation of the CELT in the faculty of Arts of the University of Riyadh”, I implied I had developed translation skills from Semitic languages (e.g. Modern Standard Arabic and Syrian Aramaic) into European languages (e.g. French)\nReminder 3: The earliest piece of external, direct evidence for the Marcian tradition comes to us from Papias, bishop of Hierapolis, (c. 60-130) via Eusebius. It seems trustworthy, because it is an old tradition quoted by a usually reliable anthologist and it agrees with the internal evidence.\nReminder 4: The TRUE fact is Semitic syntactical features influence the form of Kepha/Peter’s memoirs. It does show off through John Mark’s word-for-word/accurate translation and transcription of Peter’s (oral) memoirs as eyewitness accounts. Immediacy is one of Peter’s (oral) memoirs features in translation koine Greek (as opposed to ‘mediacy’). You should keep in mind that Kepha/Peter was a Galilean Aramaic native speaker. He did not have enough facility in Greek to write in a higly literay style (e.g. in terms use of the pluperfect). When he was in Rome, his Greek was most likely aramaicised with the related loss of subtleties in his Greek spoken skills. How long will you keep ignoring it?\nReminder 5: Neither Nicodemus nor Joseph took a hand in Yeshua being sentenced to death. What do you make of it?\nReminder 6: I say it once I say it twice (just in case you did not quite get the real purport of it): \n  Yeshua HAD ALREADY BEEN judged and sentenced to death IN ABSENTIA. To confirm a death sentence IN PRESENTIA ONLY 3 Sanhedrin members were needed. \nHaven’t you checked out in the Gospels and the Talmudic/Rabbinic literature?  Had you, you should have been aware my point is quite substantiated and has valid ground. What do you make of it? Just nothing because it just doesn’t fit into your ‘Ency. Brit. ready-to-think’ picture of the event.\n(First check out and then constructively criticize ONLY IF NEED BE, PLEASE! Thank you to refrain from gratuitous critiques)\n\n","date":"March 5, 2013 at 10:02 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26510","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Addendum: you’d better read books  on Yeshua’s trialS (with an S), before passing comments.\n\n","date":"March 5, 2013 at 11:00 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26517","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Addendum 2: Just forgot to tell you both Aramaic and Hebrew do not have a specific way of communicating a pluperfect tense.\n\n","date":"March 5, 2013 at 11:30 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26521","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"E.g. Hebrew/Aramaic students would translate the “vav-consecutive-preterite” verb as a pluperfect. This is exactly what we have with Mark 14:53-56.\n\n","date":"March 5, 2013 at 11:35 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26523","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"what do you make of Galilean Aramaic-to-Ancient koine Greek translation entropy? Nothing I guess since you are not even aware of it!\n\n","date":"March 5, 2013 at 11:45 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26525","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Addendum 3: The intended readers of the Gospel of Mark were Roman gentile Christians. This account for the ‘Hanan House and Yeshu’s trial in absentia’ two sentences as informative interpolate clauses aimed at non-Jews.\n\n","date":"March 5, 2013 at 3:25 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26536","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Typo: This accounts for the sentence about the ‘Hanan House’ and that about ‘Yeshua’s trial in absentia’  as informative interpolate clauses aimed at non-Jews.\n\n","date":"March 5, 2013 at 3:29 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26537","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The face Jesus left us","post":"Max, Thank you for your detailed exposition of your point of view.  I have enjoyed the challenge of this extended dialogue, even though we have not come to an agreed consensus.  Are you able to say that nowhere in the gospel of Mark is the pluperfect ever used?  In that case it would be a telling piece of evidence supporting your assertions – I may pursue this enquiry myself.  I take it that the translation entropy you mention is merely an inter-disciplinary borrowing of a technical term to account for the inevitable loss of meaning in all translations from one language to another.  Such entropy is only too evident in all forms of communication irrespective of translation, and regularly appears even in the normal exchanges on this web-site. \nIf Mark’s gospel was only intended for Roman Gentile Christians, why then was it not written in Latin?  Surely Peter in Rome would have access to a Latin-literate amenuensis.  The fact that it was written in Greek suggests that a more universal audience was intended.  Do you know of any other Greek literature written in Rome at this time? As far as I am aware any such tendency for Roman writers to write in Greek did not occur until after Hadrian.  \nI should think that the Peter-Mark collaboration would not occur in a vacuum of dialogue.  Any linguistic ambiguities arising from Peter’s Galilean background would surely have been sorted in their discussions.  Such considerations persuade me to prefer the conservative viewpoint of the majority of exegetes. \nYou may be interested to know that barbarism continues to be alive and well in southern Arabia.  A news report this morning advises that seven young Saudis are to be executed by crucifying them for three days and finished off by firing squad.  Their crime revealed by confessions extorted under torture, is that as juveniles they were alleged to be part of a ring of jewellery store thieves.  But mainly one suspects, this terrible punishment is because they are from the despised southern states.\n\n","date":"March 5, 2013 at 5:59 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26548","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The face Jesus left us","post":"Dave you wrote: “Are you able to say that nowhere in the gospel of Mark is the pluperfect ever used? In that case it would be a telling piece of evidence supporting your assertions”. I confirm as far as Mark’s original Gospel ancient koine Greek version is concerned.\nThe pluperfect use issue is crucial to correctly put the Mark’s gospel events in a more consistent narratological perspective.\nReminder 4bis: we can distinguish three categories of pluperfect in Hebrew narrative (Genesis through Kings): that expressed by a perfect verb form; that expressed by a wayyiqtol verb form consequent on a perfect (= imbedded storyline); and that expressed by a wayyiqtol form without previous signals. The same goes with Galilean Aramaic and Judean Aramaic. \nDave you also wrote:” If Mark’s gospel was only intended for Roman Gentile Christians, why then was it not written in Latin?” \nGreek was widely spoken in Rome in the first century CE ( see Juvenal, Sat., 3.60-61; 6.187-99) and Martial, Epig., 14.58). Absent the fact Mark was thinking that a Greek gospel would be more useful in the Roman world than a Latin one, \n Greek was the most common language spoken in the Roman empire. It was also widely spoken in Rome in the first century CE ( see e.g. Juvenal, and Martial). Hence most likely/naturally Mark thought Greek could be more useful as written medium in the Roman world than Latin. \nThank you for ‘pushing me’ to spell it out for you (and for me). Do hope a few more than the two of us got hooked on the issue.\n\n","date":"March 5, 2013 at 8:05 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","id":"comment-26558","author":"Max Patrick Hamon","site":"shroudstory"}]
