[{"title":"Awaiting Live Stream from RAI Uno","post":"This is very wrong of them to block this from the general public!!  We live in Iowa, United States and we woke up deliberately at 5AM just to see the shroud.  My mother started crying because she wasn’t able to actually see it.  It is just WRONG!  Why are they blocking it?  Why?\n\n","date":"March 30, 2013 at 6:40 am","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","id":"comment-28818","author":"vera","site":"shroudstory"},{"title":"Awaiting Live Stream from RAI Uno","post":"What copyright restrictions????  Is Jesus himself going to come down and challenge the copyright restrictions????  Give me a break!!!!  So, only the elite can see the shroud live??  How much $$$$ changed hands so the 300 people can actually see it ?\n\n","date":"March 30, 2013 at 6:42 am","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","id":"comment-28819","author":"vera","site":"shroudstory"},{"title":"Awaiting Live Stream from RAI Uno","post":"And the Shroud custodians chose Italy’s supposed ‘public service broadcaster’ for this momentous occasion. What’s the Italian for ‘damp squib’?\n\n","date":"March 30, 2013 at 7:00 am","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","id":"comment-28821","author":"colinsberry","site":"shroudstory"},{"title":"Awaiting Live Stream from RAI Uno","post":"Vera,\nFrom http://www.sindology.org, \n“The TV broadcast of the exposition of the Shroud of Turin will be on Saturday, March 30, from RAI Uno at 5:15 pm, Turin time, which will be early morning in America. Pope Francis will open the exposition. It will last about 45 minutes. Consult the Web site of RAI TV for more details and specially the RAI TV Guide”.\nPerhaps it is only the earlier program that is blocked?  I am on the east coast, got up early as well-I was unable to tell from the titles of the programs, which might be which.  “Waiting for the Exhibition” has taken on a literal meaning…Hope everything works out.\n\n","date":"March 30, 2013 at 7:34 am","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","id":"comment-28826","author":"Kelly Kearse","site":"shroudstory"},{"title":"Awaiting Live Stream from RAI Uno","post":"The Shroud of Turin will be exhibited at 12:15pm EDT.  That is around noon, NOT early in the morning.  The east coast of the U.S. is 5 hours earlier than Italy.  For instance, as I write this it is 7:42 am in Indiana.  It is 12:40pm in the afternoon in Italy.  Current Italian time can be checked at http://www.worldtimeserver.com/current_time_in_IT.aspx    I too hope we are able to view the actual exhibition.\n\n","date":"March 30, 2013 at 7:45 am","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","id":"comment-28828","author":"Donna Ward","site":"shroudstory"},{"title":"Awaiting Live Stream from RAI Uno","post":"What is wrong with these people? The Archdiocese of Turin doesn’t care or doesn’t know what they are doing. \nI went to look at the video stream. I get this message that reads, “We apologize. The content is not available due to copyright restrictions.” THANKS A LOT FOR NOTHING\nWondering what is going on, I log onto http://www.sindone.org,  the official Holy Shroud web site run by the Archdiocese of Turin. There are a couple of pages in Italian that say nothing meaningful. If I click on the English tab, the pages that come up are leftovers from the 2010 exhibition. THEY HAVEN’T UPDATED THE OFFICIAL HOLY SHROUD WEBSITE IN THREE YEARS.\nI then tried the much ballyhooed iPhone app.  It is one of the worst apps I have ever downloaded from the Apple iTunes store. It is free but you have to pay the Apple store $3.99 for the data. %he app they are pushing questionable science and history in awful English. For instance, “Some sources seem to consider the possibility that these linens would also guard the image of God. The relics are certified in Jerusalem and Constantinople. Whereas the hypothesis connecting the Shroud to the Knights Templar is to be rejected, since there are no evidences.” YOU WOULD HAVE THOUGHT THEY WOULD HAVE GOTTEN SOMEONE WHO KNOWS ENGLISH TO READ THROUGH THE TRANSLATED TEXT.\n\n","date":"March 30, 2013 at 7:48 am","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","id":"comment-28829","author":"John in Pelham","site":"shroudstory"},{"title":"Awaiting Live Stream from RAI Uno","post":"Talk about a screw up. A couple of press releases written by someone who knows how to do PR would have helped as well. My high school students could have done a better job in a couple of afternoons after school.\n\n","date":"March 30, 2013 at 9:44 am","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","id":"comment-28837","author":"Paulette","site":"shroudstory"},{"title":"Awaiting Live Stream from RAI Uno","post":"Unfortunately, or fortunately, I am unable to respond directly to other comments, because numerous weeks ago I decided to give this up for Lent.  As one may politely refuse chocolate or a nice dark beer when offered throughout these forty days, I would add that for someone who is convinced the cloth is pure fakery, it seems odd that so much time would be devoted to being involved.  Freedom of choice, certainly, but for an event like this, why bother?\n\n","date":"March 30, 2013 at 7:53 am","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","id":"comment-28830","author":"Kelly Kearse","site":"shroudstory"},{"title":"Awaiting Live Stream from RAI Uno","post":"It’s not clear if the second half of the comment from Kelly Kearse is directed to me or not – though one has to assume it is. I don’t have to justify my interest in any science-related topic to him or anyone else, but if he cares to check the banner of my sciencebuzz site that has been running much longer than my Shroud ones, then he may gain a clue as to what makes this blogger tick – and it’s nothing to do with religion in general, or Catholicism  in particular – and in any case this site says nothing in its name or presentation that says it’s for devout Catholics only. Indeed the host used to use ‘episcopalian’ as his username.\nAs for today’s exhibition, there’s a strong sense of deja vu. The first HD image that I ever encountered was one that David Rolfe had briefly used on his Enigma site, showing detail and resolution I had never seen previously, but there were difficulties in getting him speedily to release more of the same. Once Mario Latendresse’s Shroud Scope came along, it became clear to me at least that the rib-congregated bloodstains were hardly what one might expect from ordinary runny blood (try it), and from that, and the blood anomalies reported by the late Alan D. Adler,  has evolved my hunch that it was in fact the contents of one or more well-digested meals of human blood from the gut of the medicinal leech that was used as a treacly paint. Thus my interest in today’s proceedings, to see whether photographs or video footage of even higher-resolution might be released, if only to see on precisely which parts of the herring-bone weave the pigment has congregated to give that dense caked appearance (and far too homogeneously one would think ever to be a “serum exudate of retracted blood clots”).\n\n","date":"March 30, 2013 at 8:24 am","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","id":"comment-28832","author":"colinsberry","site":"shroudstory"},{"title":"Awaiting Live Stream from RAI Uno","post":"I don’t know who talked about blood clots.\nIt could simply be a differential migration between serum and figurated elements/heavy protein.\nWas blood fluid ? viscous ? solid ?\nOne has to study pathological, post-mortem fibrinolysis/coagulation. This is done in routine for ICU patients, obviously it is less usefull after the death of the patient. But I don’t take for granted that the boold formed solid blood clots.\nThibault, have you got any reference on this issue ?\n\n","date":"March 30, 2013 at 12:54 pm","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","id":"comment-28861","author":"anoxie","site":"shroudstory"},{"title":"Awaiting Live Stream from RAI Uno","post":"Donna, \nThanks for your post-I was hoping to watch as much of the programming as possible, including the preliminary shows-that’s why I tuned in early-I thought they might be broadcast as well, as part of the total event.  I often get up early, even on weekends, so for me was not that different.\nI, too, downloaded the Shroud app yesterday-I appreciate the high resolution of the images, appears to be similar to ShroudScope, a little sharper imaging. The text/discussion content, John in Pelham, you raise a good point…\n\n","date":"March 30, 2013 at 8:33 am","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","id":"comment-28833","author":"Kelly Kearse","site":"shroudstory"},{"title":"Awaiting Live Stream from RAI Uno","post":"http://forum.hidemyass.com/index.php/topic/11551-rai-italy-unavailable/\nGo to above site. This is not the first time RAI had this problem.\n\n","date":"March 30, 2013 at 10:19 am","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","id":"comment-28840","author":"Donn Reile","site":"shroudstory"},{"title":"Awaiting Live Stream from RAI Uno","post":"My apologies for the site’s language. I used keywords to search sites and I did not notice the site’s address. But it does have some information on why this is happening. Unless it is resolved.\n\n","date":"March 30, 2013 at 10:35 am","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","id":"comment-28846","author":"Donn Reile","site":"shroudstory"},{"title":"Awaiting Live Stream from RAI Uno","post":"This isn’t a surprise. How on earth were they going to deal with potentially hundreds of millions of concurrent requests for the site?\n\n","date":"March 30, 2013 at 10:58 am","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","id":"comment-28847","author":"ChrisB","site":"shroudstory"},{"title":"Awaiting Live Stream from RAI Uno","post":"Dear Friends in Jesus:\nhere is the link you are seeking:\nhttp://www.calcion.tv/rai1.htm\nHave a very happy Holy Saturday!\n\n","date":"March 30, 2013 at 12:13 pm","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","id":"comment-28854","author":"Sister Yoka","site":"shroudstory"},{"title":"Awaiting Live Stream from RAI Uno","post":"Go to this site for live streaming:\nhttp://www.ktotv.com/\n\n","date":"March 30, 2013 at 12:25 pm","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","id":"comment-28855","author":"Randy","site":"shroudstory"},{"title":"Awaiting Live Stream from RAI Uno","post":"Thank You!\n\n","date":"March 30, 2013 at 12:36 pm","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","id":"comment-28859","author":"Donn Reile","site":"shroudstory"},{"title":"Awaiting Live Stream from RAI Uno","post":"March 30, 2013 at 12:54 pm | #10\nQuote\nI don’t know who talked about blood clots.\nIt could simply be a differential migration between serum and figurated elements/heavy protein.\nWas blood fluid ? viscous ? solid ?\nOne has to study pathological, post-mortem fibrinolysis/coagulation. This is done in routine for ICU patients, obviously it is less usefull after the death of the patient. But I don’t take for granted that the boold formed solid blood clots.\nThibault, have you got any reference on this issue ?\nBlood clots are a major feature of the Adler/Heller thesis, anoxie. The task that faced those and other investigators was to explain how dried and clotted blood, shed many hours before the arrival of the deceased individual at the tomb, could leave such striking bloodstains on the Shroud. Actually, there seem to be two rather than just one explanation, as alluded to in your comment. The first is that the clots retracted, exuding red serum, the soluble haemoglobin  having escaped from lysed red blood cells.That’s the theory I have set my sights on, given it seems incapable of explaining the intensity of the “bloodstains” if the latter are merely pigmented serum. \nThere is the other explanation, ie. that the clots were dissolved by fibrinolysis, presumably allowing fresh blood to escape. While that would allow for real blood as distinct from serum, fibrinolysis only makes sense as a means by which the internal blood vessels can be cleared of small blood clots that have formed in or around small tears etc before they have had a chance to break off, and then go and lodge in a coronary or other blood vessel producing an infarct. It would hardly make sense to have active fibrinolysis in an external blood clot, would it?  That rather defeat  the object of plugging a wound, and then protecting it further as the scab hardens (not softens!).  Intravascular fibrinolyisis on the other hand, apart from being of dubious relevance to post-crucifixional scenarios, is a highly time- regulated process, with plasminogen being incorporated into clots as they form, such that the latter contains the seeds of its own destruction hours or days later as the plasminogen is later converted to plasmin, the latter being a proteolytic enzyme that is specific for fibrin digestion, converting the latter to small fibrin degradation products (FDPs) that can be detected in the blood stream. (I once monitored FDPs in dietary fibre studies, so am in fact not totally unfamiliar with this area, apart from having had a world expert in fibrinolysis working in the very next lab who loved to talk shop on the ride or drive home along Philadelphia’s Main Line…\n\n","date":"March 30, 2013 at 1:31 pm","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","id":"comment-28865","author":"colinsberry","site":"shroudstory"},{"title":"Awaiting Live Stream from RAI Uno","post":"\ncolinsberry :\nIt would hardly make sense to have active fibrinolysis in an external blood clot, would it?\n\nWhen did the blood become external ?\n\n","date":"March 30, 2013 at 1:35 pm","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","id":"comment-28866","author":"anoxie","site":"shroudstory"},{"title":"Awaiting Live Stream from RAI Uno","post":"I’m beginning to wonder if we are not talking at cross-purposes, anoxie. I thought we were discussing how blood on the skin from torn vessels – capillaries, veins etc) had still managed to leave stains on linen long after the blood had clotted and dried. \n(The term “remoistening”  that we hear deployed occasionally is one that is definitely not in my vocabulary, by the way, being a cop-out unless there is an obvious source of wet liquid water, which in this instance there is not).\n\n","date":"March 30, 2013 at 1:44 pm","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","id":"comment-28868","author":"colinsberry","site":"shroudstory"},{"title":"Awaiting Live Stream from RAI Uno","post":"\ncolinsberry :\nlong after the blood had clotted and dried.\n\nThis is the tricky part…\nWe don’t know how long the blood was exposed to skin/air before it hit the cloth, we don’t know if it had clotted at all.\n\n","date":"March 31, 2013 at 4:08 am","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","id":"comment-28923","author":"anoxie","site":"shroudstory"},{"title":"Awaiting Live Stream from RAI Uno","post":"Apologies. I overlooked to properly close the italics format tag after ‘internal blood vessels’. Don’t be surprised if all new comment appear in italics!  I’ll enter a close tag now, but I don’t suppose it will help. \nWhen’s WordPress going to give us a proper format menu on comments as well as postings?\n\n","date":"March 30, 2013 at 1:35 pm","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","id":"comment-28867","author":"colinsberry","site":"shroudstory"},{"title":"Awaiting Live Stream from RAI Uno","post":"It’s available here..  God Bless.\nhttp://www.rai.tv/dl/replaytv/replaytv.html#ch=1&day=2013-03-30&v=196967&vd=2013-03-30&vc=1\n\n","date":"March 30, 2013 at 10:29 pm","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","id":"comment-28907","author":"Jesse","site":"shroudstory"}]
