[{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Examining the Tilma of Guadalupe has some advantages over the TS because we know the date of the event, the description of which is in the native language, and some of the studies are good, particularly the one made by the American scientist Calahan. Evidently more studies are needed, taking the present state of the relic into account, in order to determine how much more can be examined of the original image. Some time ago some clergymen at the basilica in Guadalupe expressed doubts about the authenticity of the image and since this sort of thing is not conducive to fresh examination one wonders what is the next step. A lot more is needed than just an Encounter to discuss details about which we are aware for a long time and not just what is given in the book by J.J.Benitez.\n\n","date":"June 7, 2013 at 11:17 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36378","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"There are some incredible claims made about the Tilma, many are accepted as fact by the various Catholic sites I’ve seen. Claims of images of people reflected in Mary’s eyes reminds me of our discussions here about coins (lions and leopards too). Other claims include the retina of Mary’s eye dilating in the light, doctors hearing heartbeats, etc. Spiritually it is a great artifact, but scientifically it needs a STURP, a Bud Rogers, a Yannick Clement (!)…before it can be in the same class as the Shroud.\n\n","date":"June 7, 2013 at 1:56 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36385","author":"David Goulet","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"It is obvious that only serious material has been considered by those who organised the Encounter and that it will also be the approach of those who attend it. Figments of wild imagination ruled out, the question that arises is: will it be possible to make another examination of the relic? The imprint seems to be intact and becoming more evident as time goes by because what was painted on top is falling away.\n\n","date":"June 7, 2013 at 2:46 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36389","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"How can anyone imagine that the science of STURP is applicable to the Tilma of St. Juan Diego bearing what is almost certainly a painting of Our Lady of Guadalupe? The goals of this conference make no sense. Two linens? The Tilma is hemp, not linen.\n\n","date":"June 7, 2013 at 3:52 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36393","author":"Fr. M.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"There are claims that the Tilma, while a painted image, has been made with unidentifiable compounds and an absence of brushstrokes – that it was made in one single ‘pressing’. And that the hemp has shown little sign of natural degradation. So there is a question about image formation and the hemp base. A STURP type team could design testing protocols to validate these claims or debunk them. In the event tests were sanctioned (which I’m doubtful of) there would at least be good protocols in place for them. That’s not unproductive.\nYou’re right though, there is massive difference between these two images in that the Shroud’s image formation may be proven, someday, to have been caused by a natural (if extraordinary) process. The Tilma can only have had, if ‘authentic’, a supernatural origin. There are no natural explanations for it — apart from direct human creation.\n\n","date":"June 7, 2013 at 4:12 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36395","author":"looneytombs","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"The stated objective says “in the light of Shroud science”, from which it can be assumed that the experience gained from this field can also be used to study the Tilma, not that the science of STURP will be used exclusively. Dr. Tonsmann, for instance, was not on the STURP team and it is now left to Guadalupe, perhaps after consulting Rome, to decide the methodology depending on what the interested scientists have to say.\n\n","date":"June 7, 2013 at 4:05 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36394","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"It does not seem that the Mexican “índio” Juan Diego learned from Gutenberg the art of printing by a single “pressing” and the composition of the “compounds” is also one of the big mysteries.\n\n","date":"June 7, 2013 at 4:47 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36399","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"The sole true exception to the rule of nature may be the Guadalupe Tilma Face (I saw it once as I lived nearly two years in Mexico). It has “living eyes” neither the Holy Face of the TS nor the Holy Face of The Manoppello Veil have (I personally made a macrographic study of the latter’s eyes. There are man made.  The difference is quite striking with the “living eyes” of the Virgen of Guadalupe).\n\n","date":"June 8, 2013 at 5:05 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36424","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Interesting comment, Max. Your description of the eyes corresponds to Dr. Tonsmann’s discovery and this is encouraging for those who will take part in the encounter in Jerusalem. Needless to say, no one could expect “living eyes” on the Holy Face of Shroud, except those created by the Kersten/Gruber duo with their sensationalism and agenda-based theory to claim that Jesus survived the crucifixion to live, die and be buried in Kashmir. Not even the Muslims in India, much less in Pakistan, believe that. And, as commented previously, the Manoppello veil needs a more close examination, although,of course, as you said, it has no “living eyes”.\nIn the course in Parapsychology I did, we were taught that mysterious phenomena could be divided into:\nParanormal\nExtranormal\nSupranormal\nThe first two are human and the third would be a force “from beyond acting in our world”, that is, a supernatural force. The events described in the documented case of the Tilma of Guadalupe therefore appear to correspond to Supranormal phenomena and explain how the “living eyes” were formed.\n\n","date":"June 8, 2013 at 9:39 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36435","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"\nMax Patrick Hamon :\n It has “living eyes” neither the Holy Face of the TS nor the Holy Face of The Manoppello Veil have (I personally made a macrographic study of the latter’s eyes. There are man made.\n\nSo are they painted, or simply someone tried to “improve” them?\n\n","date":"June 8, 2013 at 9:12 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36434","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"O.K., try to get macrophotographs of BOTH the Veil face an the Tilma face for a comparative study. \nNone of the eyes is painted. On February 26, 2013, I  wrote:\n“In 1997, I was allowed by the Friar Capuchin curator, to examine and study “face to face” the Holy Face of the Veil of Manoppello for more than an hour (both in naturally transmitted light outside the church and at macrographic level through the glass panes).\nI then jotted down as observations: « the presence of a “preparatory mordanting” as outline to be dyed in grey lead is noteworthy and is how an artist would have worked. Most likely the Veil is authentic (as burial face cloth placed over TS enshrouding the head and pressed and fastened via a skull-cap on top) but most likely affected by a Late Antique (much in the vein of the Fayum portraits) or High Medieval ‘micropointillistic-like touch-up’ » (my translation from French).”\nIn reply to Falcinelli’s question (“The Veil of Manoppello: work of art or authentic relic?”), I once wrote: “It is BOTH. My opinion actually is it is a mussel silk veil that most probably was ingeniously dyed with natural rust and grey lead very fine powder mixed with water + ammonia or vinagre. It was meant to complete/enhance/touch up pre-existing blood stains and facial pressure imprint left on a genuine burial relic of Yeshua: the marine byssus sudarium that was placed and pressed on top of the Sindon enshrouding his head on burial. (This “sudarium” shall not be mistaken for two other famous sudarii namely the pre-burial Sudarium of Oviedo and the Cahors skull cap/headdress).\nI challenge Falcinelli (and anybody) to try and demonstrate/convince any Art Historian worth his salt that the present official Veronica is the same relic that became popular in 1208 when Innocent III chose to have the Veronica processed in a reliquary of gold, silver and gems through the streets of Rome. The Veronica “Veil II” disappeared/was stolen during Charles V’s “sack” of Rome in 1527 CE and unofficially resurfaced in Manoppello in 1608 CE.\nFalcinelli claimed it is ‘a 16th c. painting’a and, what is more, the self-portrait which Dürer then gave to Raphael and « painted in water-colours, on byssus, so fine that it was transparent, and finished without using white lead, the fabric itself serving for the whites and the fine threads being used to represent the hairs of the beard/to form the lights of the picture, and when held up to the light it was transparent all over ». If so, could Falcinelli answer the following questions :\n0/How can the written source (Vasari) he relies on tells it is a self-portait by Dürer and then, « on Falcinelli’s personal careful iconographic analysis », the painting turned out to be a self-portrait by Raphael ? This is rather confusing if not suspect to say the least.\n1/Can he forensically and conclusively demonstrate the Durer’s and Manopello Veil Man’s features perfectly match ?\n2/ How could Dürer have “painted” it when already ca 1430 CE (i.e. more than a century and half beforehand), the Master of Flémalle had already painted the same Manoppello Veil aka Veronica on oakwood?\n4/How could Dürer have “painted” the Face “in” the Manoppello Byssus Veil when marine Byssus/mussel silk definitely just cannot be painted but only dyed?\n5/Does he know of any other similar piece of art be still extant?\nRe conclusive material identification of Manoppello Veil with pre-1527 Rome Veronica, true material facts are still to be fully cross-investigated namely\n– the very Veronica reliquary of the 1350 Jubilee, with its broken glass panes still preserved in St. Peter’s treasure as it was reported (by German Jesuit art historian, Joseph Wilpert) to still retain in its very frame a piece of transparent cloth.\n– the piece of glass (reported by Pfeiffer) to be still stuck on the veil.The risk though would be to open the Manoppello Veil monstrance as the latter has not been opened since the vey day it was put between the two glass panes i.e. since the first mid-17th C.E.,\nthe risk being the relic just turns into…dust.\n The Veil having been trimmed in the early 1600’s by the Capuchin monk, Father Clemente, is there any hope to recover the cut hanging threads in order to analyse and C14 date them? Were they kept or trashed? And if ever kept by whom and where?”\nAs far as the eyes of the “Virgen” are concerned, they are even more intriguing. Besides looking like “living eyes” with most tiny intriguing patterns, their colour do look as if made of “nothing”.\n\n","date":"June 8, 2013 at 11:20 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36438","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Thanks Max. I have read books of Badde, and Gaeta on the Manopello, as well as Falcinelli’s articles. I also have read Wilson’s “Holy Faces, Secret Places” where he presented a LOT of arguments in support of Manopello being Veronica (later picked up by Badde), and further in that book he DISREGARDED them in favor of a few 1620s copies which resembled the Shroud. Probably because he assumed IN ADVANCE, that Veronica must be nothing else than just a copy of the Shroud. Thanks to Wilson, no Anglophone wants to hear now about Veil of Manopello, which is a big shame.\nI asked just, when you claimed that the eyes on Manoppello are “man made” whether that meant that someone in the Middle Ages or Renaissance wanted to “correct” them with paint. Because Fanti and Jaworski claims that they are artifacts in 3D processing of the Veil, and also some minor traces of paint have been found on the veil.\n\n","date":"June 8, 2013 at 11:42 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36442","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"O.K., Methinks it is rust (dye) and the touch-up can be Late Antique or High Medieval. Fanti and Jaworski may have mistaken rust micro-traces for paint since no direct observation is possible only through the glass panes.\n\n","date":"June 8, 2013 at 12:16 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36444","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"I repeat marine Byssus just cannot be painted only dyed.\n\n","date":"June 8, 2013 at 12:18 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36445","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Max, it looks you are right when you say that the Manoppello veil is both, an authentic relic and a painting. The doubt arises because of the kind of cloth. How can you paint on byssus or mussel silk?\n\n","date":"June 8, 2013 at 11:48 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36443","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Louis, i didn’t said it was “a painting”. Most likely it is both ‘not man made’ in terms of genuine facial pressure imprint on a burial face cloth and ‘man-made’ in terms of grey-lid and rust dyed portrait.\n\n","date":"June 8, 2013 at 12:23 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36446","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Thanks Max. I’m trying to narrow the search and as far as I know there is a study which says that there is also paint on the veil. Further, Fr. Pfeiffer has said that the imprint was made on the way to Calvary and that the cloth was placed over the TS, that is, above the face area, in the tomb.\n\n","date":"June 8, 2013 at 12:38 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36447","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Louis: look at that page: http://manoppello.eu/eng/index.php?go=start\nMax: Maszloch writes his page (in Research section): “Traces of pigments were also found in other parts of the picture. Their presence may be explained by the custom of putting copies against the original in order to sanctify them. The analysis of the Image in infrared light did not show any sketch for the picture or any corrections whatsoever.”\nAlso Falcinelli claimed that he had found some traces of paint. Besides, can we say 100% that the Veil is made of byssus, since it has not been removed from behind the glass since 18th century?\nJaworski&Fanti paper can be found here: http://manoppello.eu/eng/pdf/research.pdf\n\n","date":"June 8, 2013 at 1:40 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36449","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"I 100% agree with Fr. Pfeiffer as far as the placing of the face cloth (aka Veil of Manoppello) over the TS is concerned. As a still extant symbolical/mimetical parallel presentation, “the Lateran palace image (…) was the image of an enthroned Christ with a crossed halo, featured as the Teacher holding the scroll of the Law in his left hand while his right is raised in benediction. The face completely changed when Pope Alexander III (1159–1181)  had the present one, painted on silk,  PLACED OVER the original WITH THE HEAD SOLE APPEARING as if in LANDSCAPED FRAME (2×1) the rest of the icon being covered with an embossed silver plate and precious stones.”\n\n","date":"June 8, 2013 at 2:13 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36452","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"In the twelfth c. CE, were there two different silk veils, one in Rome, another in Constantinople known as the Holy Face of the Holy Mandylion and then, from early thirteenth c. CE to 1527 CE, were the two in Rome?\n\n","date":"June 8, 2013 at 2:19 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36453","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"One “Holy Towel” from Constantinople was purchased by king Louis IX, transferred to Sainte Chapelle in France in 1247, destroyed in 1792 during French Revolution.\n\n","date":"June 8, 2013 at 2:23 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36454","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"So we have, if I remember correctly:\nA: The Shroud. B The Veil of Manoppello\nIn Byzantium there were TWO images considered as miraculous:\nA1 The Image of Edessa, known also as Mandylion or Tetradiplon AND B1 The Image of Camoulia, which was located near Edessa.\nThe Image of Edessa was rediscovered in 525, or 544 CE. The Image of Camoulia served as Imperial Banner already in 574.\nAccording to Pfeiffer, the Image of Camoulia was sent to Rome in 705, just before the first iconoclasm began. In 944 the Mandylion was brought to Constantinople. By 969 (letter of Emperor Constantine VII Porphyrogennetos to his troops) Byzantine Empire had also alleged shroud of Christ among its collection of relics. If Mandylion=Shroud, then the original Mandylion had to be replaced by a copy. In 1204 the shroud with the image of Christ was stolen from Constantinople, according to Robert de Clari. By this time, the tradition of Veronica in Rome began. In 1247 the “Holy Towel” (probably the copy of Mandylion, to replace the original) was sent by Latin Emperor Baldwin II to Louis IX. He sent him also a 30 cm strip from the shroud of Christ, part of which is now in Toledo, and we know it doesn’t come from the Shroud of Turin -it had to be another linen.\nIt complicates more and more…\n\n","date":"June 8, 2013 at 2:38 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36458","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"O.K. you wrote: “can we say 100% that the Veil is made of byssus, since it has not been removed from behind the glass since 18th century?” See Jaworski’s 2010 paper (“Properties of byssal thread, the chemical nature of their color and the Veil of Manopello”).\n\n","date":"June 8, 2013 at 2:36 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36456","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Yes, I have read this: http://www.acheiropoietos.info/proceedings/JaworskiWeb.pdf But Jaworski writes in Conclusions: “However, at present the results obtained by\nFanti point to the linen as a more probable material of\nthe Veil”\n\n","date":"June 8, 2013 at 2:45 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36459","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"O.K. thanks for the lead, but it is a pity that the interviews are in Polish. The doubts you also have raised about the byssus are indeed valid. In the last query of my interview with Fr.Pfeiffer on the HSG website he states that the imprint was made while Jesus was alive, on the way to Calvary, and it was Mary, his mother, who “cleaned” his face.\nMax: you agree with Fr. Pfeiffer that the Manoppello veil was placed over the TS, but you differ with him when it comes to how the imprint was made. Your contention is that the veil was pressed on the dead Jesus’ face, forming the imprint. Your research is appreciated, however there are gaps to fill: how can the wide open eyes on the veil be explained?\n\n","date":"June 8, 2013 at 3:02 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36462","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Louis:\n1. Don’t you miss Fr. Pfeiffer with Fr. Resch? The latter claimed that Manoppelo is the Veronica, as described in traditional story, imprinted during the way to Calvary. BTW: look at Resch’s paper: http://www.acheiropoietos.info/proceedings/ReschWeb.pdf \n2. About open eyes: proponents of Manopello usually maintain that imprint was made just after resurrection, when Jesus was alive, healthy safe and sound, opened His eyes, took His first breath in new life etc. Truly, we don’t know. But actually, we cannot be certain that eyes on the Shroud are really closed, since intensity of imaging depends on distance (and it is roughly the same with the eyes open and closed) +all the controversies about coins.\n\n","date":"June 8, 2013 at 3:12 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36463","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Don’t yoy mix, of course.\n\n","date":"June 8, 2013 at 3:15 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36465","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"O.K. I did read the paper last year and it is the same old problem: claims with almost nothing to substantiate them. It is hard to see how this problem can be solved if the doors of the Vatican are closed when it comes to researching relics, as stated in the HSG interview.\nThis thing about the Manoppello image formed an instant after the Resurrection sounds like rubbish. Look at the expression, with Jesus, if it really is him, looking kind of sleepy, not like someone who has just broken the bounds of death.\nThere are indeed button-like objects over the eyes, now whether these are Pontius Pilate coins or not will depend on more research. Did you read what Arie Kindler of the Kadman Numismatic Museum in Tel Aviv told Father Bulst, as given in one of the answers in the interview?\n\n","date":"June 8, 2013 at 3:57 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36466","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Louis; I agree, I am not a big fan of Resch research and his methodology, and I think if one can fit Manoppello to Good Shepherd, than probably he can fit it to anything.\n“Look at the expression, with Jesus, if it really is him, looking kind of sleepy, not like someone who has just broken the bounds of death.” Have you ever seen anyone just after breaking the bounds of death? ;-)\n“Did you read what Arie Kindler of the Kadman Numismatic Museum in Tel Aviv told Father Bulst, as given in one of the answers in the interview?” Even if I did, I don’t remember now, please remind me.\n\n","date":"June 8, 2013 at 4:10 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36467","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"An unusually interesting, fascinating, informative and intelligent discussion. It is amazing what can come to light when discussions are confined to the issues rather than personalities. But I fail to see the point of O.K’s. persistent Anglophone xenophobia, based on crass stereotyping. Or have the Europeans forgotten that they would all now be confined to speaking German if it were not for English-speaking Americans, British, Anzac, South African, and Canadian allies in 1944? [The Russians were there as well]\n\n","date":"June 8, 2013 at 4:34 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36470","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Dave: The Russians? NOOOOO….. Actually Poland, in 1939 had “luck” of being invaded by both Nazi Germany (1st September) and the Soviet Union (17th September). And in 1945 they installed communist there for over 40 years.Here you have some history lesson: http://www.youtube.com/watch?v=u2wVV5OnBVw \nAnglophone xenophobia? Truly I was once very symphatetic towards Anglophones, British and Americans. And I still try to be. However, after several discussions with Anglophones about various topics, I realised that Anglophones (not all, but unfortunately general) usually appreciate only THEIR POV. Simply they think, that if something is not written in English, than it doesn’t exist (and are not even aware of that!). That frustrated me much. For example, every child in Poland knows that Churchill (and especially that idiot FDR, who was nothing more than Stalin’s puppet) “traded” Poland to the Russian sphere of influence in Yalta in 1945, but how to explain it, to American or British? Their ignorance is sometimes tremendous, at least form the Pole’s point of view.\n\n","date":"June 8, 2013 at 4:51 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36471","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"I am fully aware of the Polish situation. NZ along with other Anglo countries provided refuge for very many Polish children soon after WWII, at the behest of a NZ Catholic priest, Fr Owen Sedden, later a renown bishop in Auckland. I was at College with many of these refugees, a few of them evidently badly ravaged from their experience in German concentration camps. A Polish architect served as an early mentor during my engineering cadetship, so I am informed of general Poish perceptions of the relative merits of both Russians and Germans. A few Polish ladies  have also informed me that my surname matches that of an evocative Jewish settlement ‘Belz’ which I believe is near Lvov (now in Ukraine). There is also a village of that same name near Saint Nazaire in Normandy, near where the allied landings occurred. I am also aware of the 1930s efforts by Polish code-breakers in providing the essential key to breaking the German Enigma code. However it now seems that many Europeans have forgotten the links with their past and instead prefer to welcome jihadists within their borders while those with other more sympathetic cultures are excluded. We may have saved you from being obliged to speak German, but I doubt if we can save you from being obliged to speak Arabic instead. In 1944, we were unable to find any Frenchman to show our pass-ports for entry!\n\n","date":"June 8, 2013 at 6:37 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36480","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Dave :”I am fully aware of the Polish situation. NZ along with other Anglo countries provided refuge for very many Polish children soon after WWII, at the behest of a NZ Catholic priest, Fr Owen Sedden, later a renown bishop in Auckland. I was at College with many of these refugees, a few of them evidently badly ravaged from their experience in German concentration camps. A Polish architect served as an early mentor during my engineering cadetship, so I am informed of general Poish perceptions of the relative merits of both Russians and Germans.”\nNice to hear it so!\n“A few Polish ladies  have also informed me that my surname matches that of an evocative Jewish settlement ‘Belz’ which I believe is near Lvov (now in Ukraine). ”\nYes. What is exactly your surname?\n“However it now seems that many Europeans have forgotten the links with their past and instead prefer to welcome jihadists within their borders while those with other more sympathetic cultures are excluded. We may have saved you from being obliged to speak German, but I doubt if we can save you from being obliged to speak Arabic instead.”\nDon’t worry, we are Poles. We haven’t gone crazy with the so called “tolerance” and political correctness, like many Western European countries have. We still keep our traditions in mind, and hardly believe we let the Arabs (who are still very few in Poland) dictate us their terms. Not that we are xenophobic, simply some things (like gay marriages) won’t pass in our country.\n\n","date":"June 8, 2013 at 7:12 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36486","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"O.K. RE # 29. Now would you tell me what kind of expression you would expect? Have you seen the paintings of the triumphant Jesus, after the Resurrection, by the great masters? They did not see anyone breaking the bounds of death. There is more in the box: how come the face on all those icons and paintings, beginning with the sixth-century encaustic icon preserved at Saint Catherine’s Monastery in the Sinai desert, correspond to the face on the TS and not to the one seen on the Manoppello veil?\nButton-like objects over the eyes: Have you seen what Professor Tamburelli produced?\n\n","date":"June 8, 2013 at 5:25 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36476","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Louis: “Now would you tell me what kind of expression you would expect? Have you seen the paintings of the triumphant Jesus, after the Resurrection, by the great masters?”\nI expect that the kind of expression would be COMPLETELY different than our expectations, like it usually turned to be. I have seen the paintings of triumphant Jesus, but they all just come from imaginations of great masters. When we finally come to the other side, we will be really surprised.\n“There is more in the box: how come the face on all those icons and paintings, beginning with the sixth-century encaustic icon preserved at Saint Catherine’s Monastery in the Sinai desert, correspond to the face on the TS and not to the one seen on the Manoppello veil?”\nI said something different. Resch fitted Manoppello Veil face proportions to the Good Shepherd, who is completely not Shroud-type. Some sceptics tried to ridicule this method trying to fit Shroud face to that of Leoanrdo or Buddha, see http://greatshroudofturinfaq.com/Crazy/leonardo.html \nDan: “The arguments continue: The face on the Shroud looks like Leonardo. Yes, it does, somewhat. It looks like many people sporting beards. Picknett and Prince go further. We are told that very precise comparative measurements to Leonardo’s face have been made. No they have not! Very precise measurements have been made to a drawing. Leonardo believed in ideal proportions. He wrote about them. He made drawings to demonstrate this. He used those proportions in his drawings and paintings. The best that can be said is that the face of the man on the shroud compares favorably to ideal proportions.”\nThe same can be said about Good Shepherd. That’s why I have second thoughts about Resch’s efforts. Besides, I have read his book, and found a lot of silly errors.\n“Button-like objects over the eyes: Have you seen what Professor Tamburelli produced?” \nYes. I think the coins are probably there, but theoretically speaking, we cannot rule out open eyes.\n\n","date":"June 8, 2013 at 6:53 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36482","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"O.K. Fair enough. One query: do you mean it is possible that Jesus was laid in the sepulchre with his eyes open or are you saying that because of the Manoppello veil?\n\n","date":"June 8, 2013 at 7:31 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36489","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"\nOr have the Europeans forgotten that they would all now be confined to speaking German if it were not for English-speaking Americans, British, Anzac, South African, and Canadian allies in 1944? [The Russians were there as well]\n\nthey all would be speaking Russian, not German\n\n","date":"June 8, 2013 at 6:59 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36483","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"now, gentleman, please, proceed with the discussion :-)\nLouis, which interview is in Polish? because I can’t find it\n\n","date":"June 8, 2013 at 7:00 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36484","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"The interviews? They are listed here: http://manoppello.eu/eng/index.php?go=wywiady They are all in Polish yet.\n\n","date":"June 8, 2013 at 7:19 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36487","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Hullo Jesterof, long time no see. Go to the link http://manoppello.eu/eng/index.php?go=start\nThe site is really good, with some nice photographs. The Interviews are in Polish.\n\n","date":"June 8, 2013 at 7:26 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36488","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"\nFor example, every child in Poland knows that Churchill (and especially that idiot FDR, who was nothing more than Stalin’s puppet) “traded” Poland to the Russian sphere of influence in Yalta in 1945, but how to explain it, to American or British? Their ignorance is sometimes tremendous, at least form the Pole’s point of view.\n\nThat is exactly the result of that Yalta trade – they have to justify it somehow, so that is the way indoctrination goes – almost like reds ;-) which they were – FDR and the likes.\nChurchill was very against the trade, but he did not have the support of the FDR\n\n","date":"June 8, 2013 at 7:04 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36485","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"\nLouis :\nHullo Jesterof, long time no see. Go to the link http://manoppello.eu/eng/index.php?go=start\nThe site is really good, with some nice photographs. The Interviews are in Polish.\n\nThanks, Louis\n\n","date":"June 8, 2013 at 9:31 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36490","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Jesterof, you’re welcome. Good for you that you know Polish, so perhaps you can tell us something about what the interviews say if you find them interesting.\n\n","date":"June 9, 2013 at 9:07 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36533","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"\nO.K. :\nThe interviews? They are listed here: http://manoppello.eu\n/eng/index.php?go=wywiady They are all in Polish yet.\n\nThank you, O.K. I am fluent in Polish.\n\n","date":"June 8, 2013 at 9:32 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36491","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"jesterof:Thank you, O.K. I am fluent in Polish.\nTo miło mi to słyszeć ;-)\n\n","date":"June 9, 2013 at 4:15 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36504","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Jesterof: “Thank you, O.K. I am fluent in Polish.”\nJeśli znasz język polski, to mogę Ci powiedzieć, że ostatnio napisałem kilka artykułów polemicznych z twierdzeniami z pewnego ateistycznego portalu.\nIf you know the Polish language, I can tell you that recently I have written several polemical articles l with the claims from a certain atheist website:\nhttp://ok.apologetyka.info/racjonalista/znienawidzona-tkanina-i-jej-wrogowie-czy-caun-turynski-nalezy-uznac-za-faszerstwo,429.htm\nhttp://ok.apologetyka.info/racjonalista/w-potrzasku-bredni-prawdy-i-poprawdy-na-temat-poplamionych-krwia-relikwii-pasyjnych,432.htm\nhttp://ok.apologetyka.info/racjonalista/jak-nie-zosta-zrobiony-caun-turynski,473.htm\nEven if you are not so fluent, the Google can translate it into English, sometimes better, sometimes worse.\n\n","date":"June 9, 2013 at 4:29 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36506","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Louis:” Fair enough. One query: do you mean it is possible that Jesus was laid in the sepulchre with his eyes open or are you saying that because of the Manoppello veil?”\nI think it is rather unlikely, that they left His eyes open. But knowing properties of the Shroud image, we could not determine if the eyes are really open or close. Just wanted to remind it. However the button-like objects suggest they were closed.\n\n","date":"June 9, 2013 at 4:54 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36507","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"O.K. I’m sure that you’ll agree that when one looks at the face on the TS no open eyes are seen and if you look closely at the button-like objects you will also notice that they stand out, there is no optical illusion there.\n\n","date":"June 9, 2013 at 9:03 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36532","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Louis: That no open eyes are seen, is  only our IMPRESSION, due to the fact that we are used to identify face features on normal pictures. But the Shroud isn’t normal monochromatic photo, in which the luminosity of each ponit depends reflectivity of the material. On the Shroud the relation is different, the intensity of image points is correlated with the distance of the cloth -and NEVERTHELESS WE SEE IT JUST LIKE THE NORMAL PHOTO! Very few people realize how MARVELOUS it is -were all points of the face in the SAME DISTANCE from the cloth, we would see nothing, but the blurred contours of the face, just like on this image: http://ok.apologetyka.info/upload/ap_upload/articles/15/2013/05/2_calun.jpg \nDo you understand it now?\n\n","date":"June 9, 2013 at 9:34 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36535","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"There’s been previous recent discussion about button-like objects. Check comments under Dan’s recent posting on Stephen Jones’ coins commentary assertions. Problem seems to be that buttons appear evident from 3-D (e.g. VP-8) pix BUT Is this merely a trick of the brightness or density plotting over the eyes, OR are there in fact true 3-D button-like objects? Can the objects be confirmed as clearly visible from enhanced 2-D negatives? Caution required! What you see in 3-D pix is not true 3-D but merely variations in brightness!\n\n","date":"June 9, 2013 at 5:21 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36509","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Here are the Conclusions of Prof. Jaworski Regarding Marine Byssus (Sea Silk) and the Veil of Manoppello:\n“The brown color of byssus threads originates from the pheomelanin pigments; its marker (BTCA) was detected by HPLC after degradation.\nDegradation of byssus threads (chemically by some oxidants in proper media) results in changes of the brown color: bleaching to pale straw-color, to colorless and to reddish.\nIt looks highly probable that the image on the Veil of Manoppello (at least in most parts) was formed by modifications of pheomelanin, natural pigment of byssus.\nThus, there is an additional similarity with the image on the Shroud of Turin, which was “created” by oxidation dehydration processes of cellulose of the linen. \nByssus properties are responsible for some unique properties of the Veil of Manoppello, like the transparency after strong illumination.\nFuture detailed investigations on byssus properties (including color changes) are desirable and they are possible even if the examination of the original Veil of Manoppello will not be available.”\n\n","date":"June 9, 2013 at 6:23 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36514","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Max: Here are the Conclusions of Prof. Jaworski Regarding Marine Byssus (Sea Silk) and the Veil of Manoppello:\n“The brown color of byssus threads originates from the pheomelanin pigments; its marker (BTCA) was detected by HPLC after degradation. […]\nFuture detailed investigations on byssus properties (including color changes) are desirable and they are possible even if the examination of the original Veil of Manoppello will not be available.”\nAre we refferring to the same paper http://www.acheiropoietos.info/proceedings/JaworskiWeb.pdf ? Becuase I can’t find those quotes there.\nBesides there is one probelm: if Marine Byssus cannot be painted, and there are some minor traces of pigment, especially in the eyes area (Saverio Gaeta shows them in his book on Illustrations 40-41-42), then we have contradiction. The word byssus can refer either to high-quality linen, or Sea Silk. Chiara Vigo considers Manopello as composed from the latter, but what about traces of paint?\n\n","date":"June 9, 2013 at 6:44 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36516","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"O.K., the true fact is the first time I saw the original MV, I did think myself it was linen Byssus. Now with Pr Jaworski’s studies, it might be marine Byssus as well (Pr Jaworski ‘almost’ convinced me). More independent research is needed though, I do agree. Grey-lead and rust as pigments can be dyed not just painted.\n\n","date":"June 9, 2013 at 7:15 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36519","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"O.K., the quote is from Jaworski’s paper as given at the Frascati Conference on the Scientific Approach to the images of Turin, Manoppello and Guadalupe held in May 2010.\n\n","date":"June 9, 2013 at 7:29 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36520","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"But I have read this paper: http://www.acheiropoietos.info/proceedings/JaworskiWeb.pdf and found quotes are a little bit different, to my confusion.\n\n","date":"June 9, 2013 at 7:38 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36525","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"It may be Jaworski’s paper first/intermediary version.\n\n","date":"June 9, 2013 at 8:09 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36530","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Reminder: The visual fact is, anyone observing the TS man’s face will (at first and maybe even second and third sight) see an ‘almost’ normal nose.\nHowever a very close examination of the face in terms of geometrical projection made from a life-size photograph tells us ‘a quite different story’:\nTo the sole exception of the bony areas of the eye-sockets and nasal septum, all the rest of the face shows irregular features and displacements.\nOnce carefully overlaid (at scale 1 :1), the two holy faces (Manoppello Veil and Turin Shroud) do reveal the face of a man with a ‘skewed nose’. This is confirmed by Byzantine numismatics in nearly a dozen of extant gold coin obverses featuring a ‘Shroud-Veil-like’ Christ Pantocrator.\n\n","date":"June 9, 2013 at 6:52 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36517","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"\nMax Patrick Hamon :\nO.K., the true fact is the first time I saw the original MV, I did think myself it was linen Byssus. Now with Pr Jaworski’s studies, it might be marine Byssus as well (Pr Jaworski ‘almost’ convinced me). More independent research is needed though, I do agree. Grey-lead and rust as pigments can be dyed not just painted.\n\nMax, but what about this: Uploaded with ImageShack.us\n\n","date":"June 9, 2013 at 7:30 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36521","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Sorry: http://img594.imageshack.us/img594/4078/59a08d7d5ad44215a54644a.jpg","date":"June 9, 2013 at 7:32 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36522","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Addendum: On October 24, 2012 at 3:04 pm (#3 Reply), I wrote:  \n“(…) Forensically speaking (and WELL EVEN BEFORE the Manopello Veil face was scientifically examined), the slight deviation of the fleshy tip of the TS man’s nose was detected (in the1970s).\nIconographically speaking, the same feature happens to be ALSO detectable on the MV face.\nIn the mortuary/morgue, corpses with “skewed nose tip” are a well known fact. It is mainly due to having a corpse fit in in a zipped up body bag that was originally too small and and has caused excessive pressure on the defuncted’s face. This is additional evidence the TS man was tightly wrapped up in his burial shrouds.\n.\n\n","date":"June 9, 2013 at 7:38 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36524","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"\nO.K. :\nJesterof: “Thank you, O.K. I am fluent in Polish.”\nJeśli znasz język polski, to mogę Ci powiedzieć, że ostatnio napisałem kilka artykułów\npolemicznych z twierdzeniami z pewnego ateistycznego portalu.\nIf you know the Polish language, I can tell you that recently I have written several polemical articles l with the claims from a certain atheist website:\nhttp://ok.apologetyka.info/racjonalista/znienawidzona-tkanina-i-jej-wrogowie-czy-caun-turynski-nalezy-uznac-za-faszerstwo,429.htm\nhttp://ok.apologetyka.info/racjonalista/w-potrzasku-bredni-prawdy-i-poprawdy-na-temat-poplamionych-krwia-relikwii-pasyjnych,432.htm\nhttp://ok.apologetyka.info/racjonalista/jak-nie-zosta-zrobiony-caun-turynski,473.htm\nEven if you are not so fluent, the Google can translate it into English, sometimes better, sometimes worse.\n\nDziękuję serdecznie\n\n","date":"June 9, 2013 at 8:01 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36528","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"A slight curve effect (e..g, along the nose) can also result from the sustaining medium (i.e., the very Byssus trellis) that has these curves sort of ‘printed in’ in the hypothesis the MV is a burial face cloth that originally was placed over and fastened at head level around the TS man. Almost the same curve effect can also be seen in Allen’s and Guaraschelli’s reconstructions (positive/negative face close-ups). Now the MV face is also sort of a reconstruction as most likely it was affected by a Late Antique (much in the vein of the Fayum portraits) or High Medieval (‘micropointillistic-like) touch-up’ »\n\n","date":"June 9, 2013 at 8:04 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36529","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"There can be no doubt that M. Chiara Vigo is the world-renowned expert in manufacturing, and perhaps also identifying, byssus, but together with O.K. one is bound to ask that some explanation is needed on how pigment can adhere to this kind of material.\nIf both the Tilma of Guadalupe and the Manoppello veil are imprints generated by a supernatural force then it would seem that in both case humans sought to teach God how to generate more striking images.\n\n","date":"June 9, 2013 at 9:16 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36534","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Iron water/rust solution + vinagre or ammonia can be used to dye marine byssus.\n\n","date":"June 9, 2013 at 10:09 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36538","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"But is that pigment?\n\n","date":"June 9, 2013 at 10:19 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36539","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Rust (and grey lead) are real pigments.\n\n","date":"June 9, 2013 at 10:39 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36540","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"O.K., you wrote: “According to Pfeiffer, the Image of Camoulia was sent to Rome in 705, just before the first iconoclasm began”.\nMethinks (as far I can reconstruct their history) TWO PAINTED COPIES ON CLOTH (one full length on linen, another with just a face painted on silk) each one known as “the Image of Camoulia” were sent to Rome in 705 and were  known as “The Uronica” and “The Veronica (I)”. Reminder:  “Pope Alexander III (1159–1181) had the present face, PAINTED ON SILK, PLACED OVER the original Lateran palace image on fine fabric, probably  LINEN of an enthroned Christ with a crossed halo, featured as the Teacher holding the scroll of the Law in his left hand while his right is raised in benediction. THE HEAD SOLE APPEARING as if in LANDSCAPED FRAME (2×1) the rest of the icon being covered with an embossed silver plate and precious stones”.\nRespectively, they were painted ‘copies’ on cloth of the original Holy Himation/Sindon tetradiplon and the Holy Face of the Holy Mandylion. \nDon’t you forget about a third Byzantine ‘miraculous’ image of Christ: The Holy Face of the Holy Keramydion/Keramion.\nMost likely the Keramydion/Keramion was a ‘negative copy’ (of the Himation face) on brick known afterward as the Holy Brick and the Mandylion a ‘positive copy’ (of the same Himation face) dyed on a marine byssus face cloth known afterward as the Holy Mandylion.\nYou wrote: “One “Holy Towel” from Constantinople was purchased by king Louis IX, transferred to Sainte Chapelle in France in 1247, destroyed in 1792 during French Revolution.”\nOn June 26, 2012 at 10:50 am (#44 Reply) I wrote:\n “I wrote:  Holy Face of The Holy Mandylion’s precious empty reliquary/casket being housed in the Holy Chapel at Paris as:\n“San(c)tam toellam/trellam tabule insertam” (“La sainte Treille [d’argent surdoré]/une bouette, de vingt deux pouces de long sur quinze de large, […] couverte de lames d’argent et garnye de quelques pierres précieuses […] insérée à la table[-reliquaire] ; au dedans de lad[ite] boîte, le fond est revêtu de lames d’or dans tout le contour, et dans le milieu […] est l’apparence/la représentation d’une effigie/la sainte face de N.S.J.C ou la Véronique ; lad[ite] trelle comme consommée contre lad[ite] table[-reliquaire], autour, environ et dans lad[ite] effigie/face”)…\nToellam/Trellam = Trelle. In 14th-17th c. CE gothic script, the “r “& “o” letters are absolutely identical. Hence the good lesson here in descriptive context is “the Sainte TRelle” (not “the SainteTOelle”). This was a precious empty flat box/reliquary-table.The Holy Face of the Holy Mandylion as real sweat-towel WAS NOT WITHIN THE BOX, just a representaion of it…\nBesides, on June 26, 2012 at 5:48 am  (#32 Reply) I wrote:\n“Most likely the “relic” known as the “Sainte TRelle/Véronique/Mandylion” once kept in the Paris Sainte Chapelle Treasure was THE EMPTY RELIQUARY (a silver gilt treillised flat box shaped reliquary  with a portrait painted inside on a board). It looked like the Holy Face of The Holy Veronica then in Rome aka the Holy Face of the Veil (shortened in size) now kept in Manoppello aka most likely the Holy Face of the Holy Mandylion once kept in Constantinople.\nOn June 25, 2012 at 10:44 am (#36 Reply), I also wrote:\n“The MV face does appear desembodied as the Holy Mandylion faces of Laon, Novgorod etc The Holy Mandylion faces are either looking straight in front or on the left or the right. This is a tel-tale detail. I went twice to Manopello. The first time (in May 1997), I was allowed to proceed to a very close examination of the Holy Veil for more than an hour. No matter how close and wherever I stood looking at “the face in it”, IT was looking back at me straight in the eyes… It was a quite strange and unforgettable experience. The visual effect of always looking at me/you whatever position you adopt to see the Holy Veil face is actually due to the MV man’s eyes’ slightly convergent strabismus.\n\n","date":"June 9, 2013 at 10:06 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36536","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Yes, I knew that the relic send to Louis IX was the frame, but what was within it?\nThere are more questions:\n1. When exactly Veronica/Manoppello arrived in Rome?\n2. When it left Constantinople?\n3. What was the Abgar Image? The TS or MV?\n4. In Constantinople, there were AT LEAST two alleged shrouds of Jesus. One with the imprint of Jesus, that Robert de Clari saw (presumably our TS) and another one, from which 30 cm strip was sent to Louis IX, part of which is in Toledo now, and as César Barta pointed (http://www.shroud.com/pdfs/n56part5.pdf) was DISTINCT from the TS.\n5. If the Abgar cloth is MV, and MV is Image of Camoulia, how it arrived there from Edessa?\n6. There are TWO alleged dates of the discovery of the Mandylion: 525 CE and 544 CE. Why?\n7. What about another alleged shroud of Christ, venerated in Jerusalem in 670 CE, according to Arkulf’s relation?\n8. What about Shroud of Besancon?\n9. What about alleged Templars Mandylion?\nEtc.\nI can understand the negative attitude towards Manoppello among some Shroud scholars. It solves some problems, and create a multitude of others! Remember, the Manopello Veil is SMALL CLOTH. That’s what was a major problem for many opponents of the Wilson’s hypothesis (Yannick Clement for example).What’s more MV is COLORFUL cloth (just like in the earliest versions of the Abgar’s legend). Weren’t the two (MV and TS) confused sometimes?\n\n","date":"June 9, 2013 at 11:03 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36542","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"O.K. Many of the questions you raised are good ones and the gaps can be filled to a certain extent, which means you will have to get hold of a couple of books on the topic, or if that is not possible, see what is available over the Internet, selecting what you judge to be more reliable.\nThere are also papers and books on the possible TS-Templar connection. The people who made the “Jesus family tomb” alleged that the knights were the ones who re-arranged some bones in the tomb, but this is absolute rubbish. The knights built their churches with a Round, modeled on Jerusalem’s Church of the Holy Sepulchre, probably the site of the Resurrection. Most of the Israeli archaeologists ( also heavyweights like Kloner, Bahat etc.) believe that that is the place where Jesus was buried. (See the article “Jesus was not buried in Talpiot, Part II, on the HSG website).\nSome years ago I was obliged to tell the editors of a top magazine that a series of articles on the topic of biblical archaeology they had been publishing contained a number of mistakes and that the author was agenda-driven, distorting some points. He claimed that Templar churches were based on Solomon’s temple. When they were told that this was not the case they stopped publishing the series.\n\n","date":"June 9, 2013 at 12:59 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36555","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"O.K.re # 49, It is easy to understand what you mean, but as said earlier most people take the photograph of the face as someone with his eyes closed and that is the way it has been understood in all (serious) Shroud books. There is another problem there:if this kind of methodology is used, soon people will begin to see even the mouth open.\nWe all like to see what Jesus looked like while on earth and it seems that the TS face is the image that is most used for this purpose, much beyond the world of Shroud studies. Even Sai Baba, in India, used the Shroud face to “reproduce” what he felt Jesus looked like. Go to the link nhne.com/articles/safaceofjesus.html.\n\n","date":"June 9, 2013 at 10:07 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36537","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"O.K. Could you please translate the above in one or two lines so that one can understand what is meant?\n\n","date":"June 9, 2013 at 11:03 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36541","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"What do you want to translate?\n\n","date":"June 9, 2013 at 11:04 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36543","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Sorry O.K. re. 66 was meant as a response to # 67 and should have appeared as # 68 and is in the wrong place.\n\n","date":"June 9, 2013 at 11:07 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36544","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"What exactly do you want to translate? San(c)tam toellam/trellam tabule insertam” (“La sainte Treille [d’argent surdoré]/une bouette and so on is a mix of Latin and French, and I won’t help here. Ask Max.\n\n","date":"June 9, 2013 at 11:11 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36546","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"O.K. Something is wrong with the automatic system in the blog and the comments are getting mixed up. I am referring to #70\n\n","date":"June 9, 2013 at 11:09 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36545","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"O.K. the confusion continues, see the link http://img594.imageshack.us/img594/4078/59a08d7d5ad44215a54644a.jpg you posted.\n\n","date":"June 9, 2013 at 11:13 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36547","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"“The magnification of Manopello cloth.\nHigh resolution images of professors Giulio Fanti and Doanto Vittore allowed for confirmation of the lack of pigment in the ares between threads.\nThe shine of the threads led the expert Chiara Vigo to bring a hypothesis that the threads are composed of byssus.\nEspecially the right eye of The Face shows traces of colour of one pupil, perhaps from the initiative of Someone who wished to give more strenght to the glance”\n\n","date":"June 9, 2013 at 11:21 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36548","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"# 73 Thanks, but this complicates the situation even further, making the examination mind boggling. How could Chiara Vigo judge that it is byssus just because of the shine? It does not seem right to establish that it is byssus this way.\n\n","date":"June 9, 2013 at 11:28 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36550","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Louis, you asked “How could Chiara Vigo judge that it is byssus just because of the shine?”\nChiara Vigo can discriminate between marine and linen byssus. Most likely she is referring to the famous golden shine of sea-silk as a crucial discriminating characteristic.\n\n","date":"June 9, 2013 at 12:05 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36553","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"So much so, in full day light, the face cloth with the Christic face in it can…shine as gold!\n\n","date":"June 9, 2013 at 12:15 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36554","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Thanks Max, your comments are appreciated. But, again, with your on-site research both in Guadalupe and Manoppello why don’t you write some papers and make them available on this blog in pdf format? It would be much better to read them this way rather than put together bits and pieces of comments.\n\n","date":"June 9, 2013 at 1:33 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36557","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"I think studies comparing the two cloths are interesting.  What will it show?  Who knows?  All the more reason to look at it.  They both have amazing images on each cloth.\n\n","date":"June 9, 2013 at 6:16 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36578","author":"Andy Weiss","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"The saint Padre Pio had both spiritual and psychic abilities, he had forty of the latter. There are dozens of kerchiefs he left behind with his image on them. He had used them to wipe his face.\n\n","date":"June 9, 2013 at 6:33 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36579","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"O.K., you wrote: “One “Holy Towel” from Constantinople was purchased by king Louis IX, transferred to Sainte Chapelle in France in 1247, destroyed in 1792 during French Revolution.”\nThe true fact is various medieval reliquaries, including the grande châsse, were despoiled of all their gems and/or pearls and then were melted down. Only one or two Byzantine reliquaries were spared. None of the relics were destroyed.\n\n","date":"June 9, 2013 at 8:35 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36586","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"\nLouis :\nThe saint Padre Pio had both spiritual and psychic abilities, he had forty of the latter. There are dozens of kerchiefs he left behind with his image on them. He had used them to\nwipe his face.\n\ndozens? that is interesting. the web tells only about one http://translate.google.com/translate?hl=en&sl=it&u=http://www.zenit.org/it/articles/la-sindone-di-padre-pio&prev=/search%3Fq%3DSindone%2Bof%2BConegliano%26num%3D100\n\n","date":"June 9, 2013 at 10:05 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36596","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Jesterof, I will try to find the book where it is said that there are two hundred of them, however the point is not the quantity but the phenomenon.\n\n","date":"June 10, 2013 at 10:33 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36620","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"#69 Louis: There is 99.9% chance that the Church of the Holy Sepulchre is the correct place. There are several good arguments for it (paradoxically some of them were once used by critics of it).\nBesides: There is a very interesting album about relics of Passion, by Grzegorz Górny and Janusz Rosikoń, called Świadkowie Tajemnicy (Witnesses to Mystery). http://en.rosikonpress.com/dzial_51/towar_karta_150/Swiadkowie_Tajemnicy.html It covers most relics: The Shroud, The Manopello, The Oviedo, Trier, Argenteuil, True Cross, Holy Nails, and so on. It has a lot of good info, but unfortunately is uncritical at times, and I found a few errors, and can sense strong dependency on Hesemann’s “Silent Witnesses of Golgotha”.\nThey claim that there will be English edition. We will see. But it may be interesting to jesterof, who knows polish.\n\n","date":"June 10, 2013 at 6:32 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36610","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"O.K. It is a pity that no English translation is available and since he depends on another author (who also has a strong belief in UFOs) one wonders whether it is worthwhile.\n\n","date":"June 10, 2013 at 10:39 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36622","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"It is not clear whether Michael Hesemann, the author of the books about UFO is the same Michael Hesemann who is author of books about religion, besides, even if was in his youth,  Hesemann is considered as reliable author, who is often an expert on various TV documentaries about religion and relics, just example: http://www.youtube.com/watch?v=421ndxgRjeE\n\n","date":"June 10, 2013 at 10:49 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36623","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Barrie Schwortz thinks it is worthwhile: http://www.shroud.com/books.htm\n\n","date":"June 10, 2013 at 10:53 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36624","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"O.K. One has to make independent judgments on what is worthwhile reading and the author, no doubt, has made the most complete study of all the known relics. My interest in relics has more to do with Parapsychology than with faith (see comment #3 on “Pounding the square peg into the round hole” today) and, as you know, the TS is not an article of faith in the Church.\nBy the way, last week you commented that you also knew Polish,  so would you be able to tell us in a few lines what Górny and Rosikon are trying to convey? Thanks.\n\n","date":"June 10, 2013 at 11:36 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36625","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"\nLouis :\nJesterof, I will try to find the book where it is said that there are two hundred of them, however the point is not the quantity but the phenomenon.\n\nI agree, I was simply surprised, becasue the site of St. Padre Pio mentiones only this one.\n\nO.K :\nBut it may be interesting to jesterof, who knows polish..\n\nDziękuję\n\n","date":"June 10, 2013 at 12:41 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36629","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"It will take some time. As for the last word in your comment, nothing can be read, but I can post something in three other languages\n\n","date":"June 10, 2013 at 1:42 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36635","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"\nLouis :\nO.K. It is a pity that no English translation is available and since he depends on another author (who also has a strong belief in UFOs) one wonders whether it is worthwhile.\n\nIt’s in English\n\n","date":"June 10, 2013 at 12:43 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36630","author":"jesterof","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Thanks, I’ll have a look when I can\n\n","date":"June 10, 2013 at 1:45 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36636","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Louis:”By the way, last week you commented that you also knew Polish,  so would you be able to tell us in a few lines what Górny and Rosikon are trying to convey? Thanks.”\nI am a native Pole. You have a short description and table of contents (in english) on their page: http://en.rosikonpress.com/dzial_51/towar_karta_150/Swiadkowie_Tajemnicy.html \nGórny is a catholic journalist. He created a catholic-conservative magazine Fronda in the 90s and also writes articles for other similar magazines. So he is definetly pro-authenticity, but not too zealous. He depends on others (as I said, some fragments look like rewritten from Hesemann, and the chapter about Tunic of Argenteuil is simply a shortened version of Marion and Luccotte’s Le Linceul de Turin et la tunique d’Argenteuil), and there are some mistakes I was able to find also in other books (for example he wrote that Eusebius first mentioned the Image of Edessa, which is obviously not true). Remember, he is just a journalist. It is a good book, but one should take it with some care. Plus many very good pictures.\nAnd here you have a picture of Schwortz with that book in hand: http://www.idziemy.com.pl/wiara/calun-przywrocil-mi-wiare/ ;-)\n\n","date":"June 10, 2013 at 1:32 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36632","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"O.K. Thanks for the link, and they seem to be serious people, so some allowance must be made about the conservative approach, not forgetting that they have published books by two popes.\n\n","date":"June 10, 2013 at 1:56 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36639","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"There is also an excellent Canadian TV series “In Search of Holy Treasure” :http://www.youtube.com/watch?v=I8QslQbZY5U \nIt contains 13 episodes:\n1. Shroud of Turin\n2. Holy Grail\n3. Tomb of Jesus\n4. Holy Spear\n5. Holy Cross\n6. Sudarium of Oviedo +Veil of Veronica (unfortunately nothing about Manopello)\n7. Crown of Thorns\n8. Marian Apparitions\n9. Noah’s Ark\n10. Holy Coat of Trier, Holy Tunic of Argenteuil, Holy Cap of Cahors, and something else I don’t remember.\n11. Ark of Covenant\n12. The Blood Miracle of Saint Januarius\n13. Summary.\nIt was run on one polish TV channel devoted to religion last year. Very well and balanced.\nWhy do I write this? Because of my alleged Anglophone xenophobia. Simply found that most of the English world simply doesn’t know anything about many other relics besides the Shroud and Oviedo (the latter thanks only to Guscin and Benett), which have sometimes very interesting connections to the Shroud. I found this ignorance terrible.\n\n","date":"June 10, 2013 at 1:53 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36638","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"O.K. Never guided by complexes, particularly those related to cultural backgrounds, I knew about these relics donkey’s years ago, however these documentaries can serve as guides for those who know little about them not for those who want to go deeper into the subject\n\n","date":"June 11, 2013 at 8:10 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36691","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"O.K.: “Simply found that most of the English world simply doesn’t know anything about many other relics besides the Shroud and Oviedo (the latter thanks only to Guscin and Benett), which have sometimes very interesting connections to the Shroud. I found this ignorance terrible.”\nI think you have to understand that there are very good reasons for this. Poland has of course remained an intensely Catholic country, even conservatively so, but this is not so much the case in Western Europe, except perhaps for the Latin Mediterranean. In the Anglophone countries, the situation is again quite different, where there has developed a strong Protestant tradition, stemming from intense persecutions during the Elizabethan age and subsequently. In England for example the anti-Catholic Penal Laws survived well into the 19th century. The era of nationalism also played a significant part in shaping these cultures and their religious allegiances. In Ireland, Catholicism survived, but the education constraints imposed by the English establishment meant I think that it was an intellectually impoverished Catholicism, but there were of course exceptions. \nIn the Anglophone countries it was inevitable that Protestantism had some impact on the Catholic outlook. Most of these countries, especially of the “New World” were remote from the religious conflicts of Old Europe, and the settlers were for the most part glad to have left them behind, more so their descendants. \nThe European interest in relics was often seen as a commercially  driven enterprise, heightened by stories of Tetzel’s provocative sale of indulgences, the underlying quest for “religious tourist attractions” and so on. It led to some scepticism in the value of relics as testament to religious history. Such stories as there being enough relics of the True Cross to build a navy flotilla of ships gained provenance. The religious expression in these countries became more focused on biblical events, with the Protestant emphasis on scriptural authority. \nIn both Australia and New Zealand the Catholic ethos was strongly influenced by traditional Irish pieties: the rosary, the Sacred Heart, and with our French Marist tradition, developments in Mariology. During my college days in the 1950s there was a strong focus, certainly in NZ, on the Fatima apparitions. My own parish church in Tawa, Wellington is dedicated to Our Lady of Fatima, along with about six other churches in NZ. Many NZ Catholics, and even some of my Protestant connections include a pilgrimage to Lourdes in their overseas tourist excursions. Other acquaintances, including our Wellington archbishop have walked the way of St James in northern Spain. \nIn 2003, I did discover in my local public library a copy of “The Quest For The True Cross” by Carsten Peter Thiede and Matthew D’Ancona. I found it an excellent and informative work and included a long review of the book in the church magazine I edit. There are small pockets of local interest in such matters, but they are rare. My own first real encounter with the Shroud was about 1960, when our University Dominican chaplain presented a slide-show at my Engineering School hostel. A few devout families, including my own, occasionally had depictions of the Shroud facial image in their homes. \nHowever, the suspicion surrounding the authenticity of alleged relics remains, and is not helped by the poverty of adequate evidence in most such cases, which fuel the doubts raised by sceptics. It is perhaps seen as a European preoccupation, while we carry on with our own local religious preoccupations, which are quite different, particularly with the multi-cultural immigration that has since occurred. The world is very much wider and more complex than Old Europe may perceive.\n\n","date":"June 10, 2013 at 5:57 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36656","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Dave:Yes, I can fully agree with what you wrote.\n“The world is very much wider and more complex than Old Europe may perceive.”\nAnd I can say also that “the world is very much wider and more complex than Anglosphere may perceive.” Just both sides should not ignore themselves, and listen what interesting the other has to say.\n\n","date":"June 10, 2013 at 7:07 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36659","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin & Our Lady of Guadalupe Tilma","post":"Part of the problem is that history is no longer a core subject in our education systems, the focus being more on technology and indigenous cultures, rather than the inherited European traditions. Our decendants, not having any history will be condemned to repeating the errors of their forbears.\nMeanwhile the religious focus is on building the church of the future, with its multi-cultural dimensions, rather than looking back to the past. Few of our priests are younger than 70 years of age, and in Wellington archdiocese there are no current candidates for the priesthood. There will need to be major parish amalgamations, as has extensively happened in the Netherlands (at least two of our local priests are Dutch). We have to accomodate a mix of immigrant cultures, Filipino, Samoan, SE Asian, and include our own indigenous Maori and South Pacific cultures. It is more complex in the African and Asian countries. In the meantime, the gospel must be proclaimed, charitable works undertaken in the social option for the poor. All this creates its own religious focus different from the past. You will see Anglophone tourists, including those from NZ and Australia in Western Europe, fewer in Poland. But our main tourist clientele comes from China and Japan, not so many from Europe, occasionally a few Swedes and Germans. It is a different world!\n\n","date":"June 10, 2013 at 7:36 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","id":"comment-36661","author":"daveb of wellington nz","site":"shroudstory"}]
