[{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Yesterday I have read a message sent by Nicola Antonio de Liso (who claim himself to be a brother of Giovanna de Liso) … That message is dated 1 september 2014 at 16:53.\nThe “golden dust” (monoatomic gold) is one of the questions that appeared in that long message addressed to the italian journalist Sylvie Coyaud …\nI am curious about the possible answer from the “Trimurti” about that strange question (= monoatomic Gold and Image Formation).\nI also remember the past claims (but… silver-based, if I well remember) by Norma Weller\n(a deceased researcher) about a strange oil “Unguentum Apostolorum”… (but, in my idea, an oil cannot be compatible with bloodstains resolution = smear…).\nThen I hope in the answer from (at least) one of these researchers …\n— —\nGold, Frankincense, and Myrrh, were the gifts given to the Son of God.\nThe white powder gold, monoatomic gold, is an alchemic thing (…and not for know-nothing…). There are even medicines online devoted to mono atomic, white powder gold as a cure all for various health problems!\nBut claims on “monoatomic gold” as connected with the Holy Shroud seem to be in the realm of pseudoscience (… but try also to see what is the percentage for that element found by Adler … In any case I know another explanation for that presence, but [now] I am curious to find the truth)…\nUnder the address:\nhttp://www.bibliotecapleyades.net/biblianazar/esp_biblianazar_4.htm\nI have found the following strange description:\n>The truly astonishing fact about the enigmatic white powder of high-spin gold and platinum group metals is that it is not actually a new discovery. The ancient Mesopotamians called it shem-an-na and the Egyptians described it as mfkzt (vowels are omitted in the hieroglyph translation), while the Alexandrians venerated it as a gift from Paradise and later chemists such as Nicolas Flamel called it the Philosophers’ Stone. …\n[… and this was an excerpt extracted from “Nexus Magazine”, Volume 10, Number 2 (February-March 2003)]\n— —\nWhat are the results obtained from the experiments (= Corona Discharge, vacuum VUV, etc.) with linens treated with monoatomic gold ? Perhaps the Image Resolution is greatly enhanced with that monoatomic gold.\n— —\nWhat is your opinion ?\n\n","date":"September 5, 2014 at 12:43 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-148812","author":"piero","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Here an idea :\nTry to apply Local Nano-Thermal Analysis with an AFM [= Nano heating probes allow for rapid heating and cooling and precise temperature control] on linen samples (previously) treated with monoatomic gold and submitted (or not !) to the BIF simulations (= CD, vacuum VUV, etc.) !\nAre these (complex) controls too difficult as lab works?\n— —\nAFM-Raman analyses are more simple…\n\n","date":"September 5, 2014 at 12:54 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-148814","author":"piero","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Piero, for those of us who have not been trained in ancient alchemic wisdom, would you explain the difference between monoatomic gold, biatomic gold, triatomic gold etc.?\n\n","date":"September 5, 2014 at 1:45 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-148828","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"“What is your opinion?”\nHi Piero. In this context the term monoatomic (or monatomic) gold is wholly meaningless.\nThere is no such stuff, and it is consequently impossible to treat anything with it. The most honest description of it I can find on ebay (uk) is from Healing Mountain, where 20g costs £25. That compares well, does it not, with ordinary gold bullion, where 20g costs about £550? Being a nutritional supplement, Healing Mountain is obliged to list the ‘ingredients’ of its “MONATOMIC WHITE POWDER GOLD M-State ORMUS 20g most POTENT Form.” This is what it says: Nutritional Information. Each gram contains: Silicon dioxide 100mg. Magnesium hydroxide 900mg.” Yup; each 1000mg of pure monatomic white powder gold contains 1000mg of sandy magnesia, and not a trace of gold at all. (Healing Mountain sells a variety of quantities and shapes of bottle, and the ‘Nutritional Information’ is not always given, and is not always honest where it is given (70% monatomic gold, 30% magnesium hydroxide, for example), but I believe the more credible versions!)\nSomewhere on the internet I found the entertaining comment that monatomic gold was such bad pseudo-science that it even discredited other forms of pseudo-science.\nBut wait – are not Scientists at reputable research universities investigating the properties of monatomic gold, so it must be true? Well, no, they’re not. They are exploring what happens when a sheet of gold is treated in such a way that a fine thread of single gold atoms (sadly no more than half a dozen or so, so far) is pulled off like a string of beads, and predicting the electrical properties of such a ‘wire.’ This is nothing to do with the mumbo-jumbo peddled by pseudo-mystic metaphysicians.\n\n","date":"September 5, 2014 at 3:54 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-148869","author":"Hugh Farey","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Well he did say it was alchemy. Not science. :)\n\n","date":"September 5, 2014 at 4:00 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-148871","author":"David Goulet","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"By the way, the only thing worse than pseudo-science is pseudo-alchemy!\n\n","date":"September 5, 2014 at 4:39 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-148881","author":"David Goulet","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"What has this to do with the Trimurti?\nIt would be nice if Rome, Turin and Padua could get together and thrash out differences in a friendly way at a meeting during which Turin could produce the microphotographs. This would help in discussing the results over here with more interesting material to refer to, and less speculation.\n\n","date":"September 5, 2014 at 5:36 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-148894","author":"Louis","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Louis, it is not up to Rome or Turin to trash out anything, and they have already clearly said so. At Bari, the IEEE has ultimately taken a step back, leaving the Italian Trimurti on its own.\n\n","date":"September 6, 2014 at 4:23 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-148998","author":"anoxie","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Hi Anoxie\nWhat I meant was the Italian Shroud group collegamento pro-Sindone in Rome, who have differences with the group in Turin, the closest to the relic’s papal custodian, who, in turn, have isolated Padua. .\nI do not know why IEEE made changes in the programme, but I suspect that they did not want to come under attack as propounding pseudoscience.\n\n","date":"September 6, 2014 at 6:31 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-149154","author":"Louis","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"I don’t believe in alchemy.\nI simply indicated a system to control the material using local thermal analysis…\n(and not pseudo-science).\nI repeat :\nNano-TA thermal probe is a local thermal analysis technique which combines the high spatial resolution imaging capabilities of AFM (= atomic force microscopy) with the ability to obtain understanding of the thermal behaviour of materials.\n— —\nI believe that heating rate (with Nano-TA thermal probe…)\nis an important question to investigate …\n— —\nNow I have found the following reference:\nhttp://www.healthcenterinternationalresearch.com/apps/blog/show/26262712-monoatomic-gold-or-withe-powder-gold\nI agree about the fact that :\n>Monoatomic Gold is the non-metallic, non-toxic zero-valence form of Gold. …\nBut I don’t know “Quantum Integrative Medicine” … (etc., …, etc.)!\nSorry…\n\n","date":"September 6, 2014 at 9:00 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-149041","author":"piero","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"“I agree about the fact that :\n>Monoatomic Gold is the non-metallic, non-toxic zero-valence form of Gold. …”\nNo.\nNo. No.\nNo. No. No.\nThere is no such stuff. There never was any such stuff. The sentence above is literally meaningless.\nFrom the website…\n“Monoatomic Gold is the non-metallic, non-toxic zero-valence form of Gold.” – Nonsense.\n“It can be manufactured alchemically out of 24carat metallic gold.” – No it can’t.\n“It also occurs naturally in volcanic soils, seawater and in minute amounts in the purple or violet skins of fruits and vegetables and some medicinal plants such as red grapes, eggplant and violets.” – No it doesn’t.\n“In recent years, some researchers have erroneously equated monoatomic gold with the Philosopher’s stone, which it definitely is not” – it might as well be.\n“There is a reason why the American public fool system does not teach American youth metaphysics and ancient arts, crafts, and sciences.” – Quite so, and a very good reason if this is an example of it.\n“Mono-atomic Gold is made by taking 99.98% gold and changing its atomic structure. The end product is a white powder consisting of trillions of single gold atoms, each one literally lighter than the element “air.” – Nonsense. If it were at all meaningful it would mean that all your precious powder would escape from the bottle and float off into the sky the moment you unscrewed the cap!\n\n","date":"September 6, 2014 at 9:51 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-149050","author":"Hugh Farey","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"I beg your pardon.\nI was in a hurry…\n— —\nMonoatomic Gold. \nWhat is monoatomic gold?\nMonoatomic elements, such as monoatomic gold,\nare made of single atoms not bound to one another.\nIs it right now ?\n— —\nIn my previous message I didn’t have time to write that\nNicola Antonio de Liso conjectured that the corpse of Jesus\nwas stolen following a plan studied by Claudia Procula (wife of Pontius Pilatus)…. \nSome idea of ours are testable.\nInstead that particular (heretic) claim seems to be unverifiable\n[Where is our own lie detector ?]…\n\n","date":"September 7, 2014 at 8:33 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-149236","author":"piero","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Gold is dissolved in seawater, but measurements of its actual concentration has been extremely controversial, and is complicated by several issues. particularly attempts prior to 1980.  In 1985 Lucas obtained values of between 5 to 50 ppt (parts per trillion) with an average of about 13 ppt.  It appears to be higher around the Bering Sea due to washing of alluvial deposits from Alaska and Siberia.  There is no known means yet of extracting it from the sea on any commercial scale, but it is possible that certain thermal bacteria may provide a means in the distant future.  There is no known means of synthesising gold through nuclear reactions.  Gold most commonly occurs in its natural state or as tellurides.  It is the most malleable of all metals and it is possible to draw it in very fine wires or sheets perhaps as thin as 10 nm.  It is believed that most of the gold extracted on earth has been deposited by meteorites, particularly in the Wirwaterstrand which accounts for over 50% of the earth’s gold production.  \nThere are several myths about the substance and it has frequently been an avenue of confidence tricksters.  In medieval times gold dust was sometimes added to foods for culinary decoration, and also to certain expensive liqueurs.  It has no nutritional value whatsoever and passes through the digestive system with no beneficial or adverse effects whatsoever.\n\n","date":"September 6, 2014 at 11:15 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-149181","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Factoid alert:  No need to get gold from the sea — there is plenty in mines in Colorado; it’s just not economical to get it out of there, any more.  So they told me in Cripple Creek.\n\n","date":"September 13, 2014 at 10:12 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-150710","author":"Nabber","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Have you got the hang about the modified AFM with nano-thermal analysis probes?\n— —\nAll these questions are far from the interventions of the meeting in Bari.\nPerhaps the lack of “technical papers” … (What a bore!) was the origin for the wild discussion.\nHow to get over ?\n— —\nSorry…\n\n","date":"September 7, 2014 at 8:36 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-149239","author":"piero","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Only yesterday I have read the message sent by TH :\n>… The more I study the Shroud, the more I think that the image\ncome from some kind of low-temperature chemical reactions\nin the PCW or surface impurities on the fibers. …\n…\nbut, after that, TH also wrote :\n>… my third and last PDF about the “scorch hypothesis” needs more experiments. …\n— —\nApart that apparent contradiction by TH and the fact that my little “nano-TA” remarks\nwere not directly considered by him (… perhaps… also because they have to be improved),\nI think as impossible to avoid the question (if we want to observe in a careful manner\nwhat happens on linen fibrils)…\nSee also : the cellulose degradation and the ‘Lab on a chip’ capabilities of AFM (= an interesting thing).\nThen there are (at least) two problems to consider:\n– heating rate control\n– measurements about indentation depth on TLs\n(= thin layers obtained from the experiments)…\n— — —\nIn the book (of Chemistry) by Adler, a “Shroud Spectrum\nInternational Special Issue” edited by Dorothy Crispino\n(recently passed away) and published by Effatà Ed.,\nthere is the paper :\n“Further spectroscopic investigations of samples of the Shroud of Turin.”\nby Alan Adler, Russel Selzer, and Frank DeBlase (2000)\nwhere we can read what was the quantity of gold discovered:\n0.5 per cent (warp)\n0.9 per cent (weft) …\nSo… we have to avoid to start with strange speculations about “monoatomic gold treatments”, etc.\nInstead we know the Past of the relic : folding and unfolding the Shroud … and that mechanical action transported loose materials from one area to another…\nThat study clearly indicated a presence of microdebris identifiable as\nparticle of gold, etc.\nThis was the past analytical truth.\n— —\nI want to add that I never indicated presumed “monoatomic gold treatments”\nin my past attempts to present some study about linen fibrils and the Shroud.\nI was only curious abut that particular idea and I admit that I wrote in a bad and\nfast manner, with a copy-paste of words taken from the Web (= a goofy-Google work\nor a self-kidnapping!)…\n— —\nIn any case I remember that Ray Rogers submitted some linen sample to ESCA.\nDo you know ESCA?\nTen years ago I have read the following description:\n>ESCA involves characterization of 1- 5nm surface depth and is mainly helpful\nin quantitative elemental analysis\nUnfortunately I have not read the book by RR and then I don’t know what\nwas the result from this control.\nHere another very short technical note :\nAngle resolved X-ray photoelectron spectroscopy is a non-destructive method\nto investigate the distribution of elements or functional groups\nin the depth of the sample surface …\n— — —\nThis is the situation.\nI hope in your comments.\n\n","date":"September 8, 2014 at 8:57 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-149436","author":"Piero","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Pierro, may be referencing the following:\n“Analysis of m-state elements has disclosed that their physical weight can be decreased to a negative value at specific high temperatures. Incredible as it seems, these elements actually levitate! What’s more, they can also be coaxed into becoming superconductive…”\nThese transition elements are explained in Z P Tech Science\nhttp://zptech.net/science.html\nORMUS or “M-State”\n” The electrons in monatomic minerals exist in what is called a “high spin state.”\nhttp://www.americanbluegreen.com/ormus.html\nSee also\nWhat Are Natural Monatomic Minerals\nhttps://www.experts123.com/q/what-are-monatomic-minerals.html\nPerhaps monoatomic gold made it possible for Jesus to levitate out of the shroud.    :)\nBest,\n\n","date":"September 12, 2014 at 11:46 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-150602","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"edit first line:  Piero\n\n","date":"September 12, 2014 at 11:50 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-150603","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"No. None of the alleged science on the websites above enjoys a shred of respectability among physicists, chemists or biologists. It is, quite literally, meaningless non-sense.\n\n","date":"September 13, 2014 at 3:01 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-150639","author":"Hugh Farey","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"The above discussion led me to a brief check on anti-matter.  Much of the theory seems to relate merely to opposite charged particles, e.g. the positron and anti-proton.  Anti-hydrogen has been produced in 1995 by CERN, but of course was almost immediately annihilated.  It is possible that antimatter may exist in the form of galaxies, but would be separated from matter at a scale of the distance between galaxy clusters.  The amount of antimatter in the Milky way galaxy cannot be more than 1 in 10^7.  \nSoon after the discovery of the antiproton the question was raised as to whether antimatter would be subject to gravitational attraction or repulsion from ordinary matter. This question is of extreme importance because gravitational repulsion between matter and antimatter is inconsistent with the theory of general relativity.  Observation of the interference phenomena between K01 and K02 mesons led to the conclusion, by M.L. Good, that the gravitational interaction between matter and antimatter is identical to that between matter and matter.  \nThis would seem to discredit the prospects of levitation of any form of any kind of particulate.\n\n","date":"September 13, 2014 at 8:04 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-150685","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"“This question is of extreme importance because gravitational repulsion between matter and antimatter is inconsistent with the theory of general relativity.”\n***Angel says:  Faster than light speed is also inconsistent with Einstein’s theory of relativity; however, the universe continues to expand and galaxies are moving away from us at a rate that is faster than the speed of light.  Correct?\nBest,\n\n","date":"September 14, 2014 at 6:36 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151014","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Wise words, Mr B., wise words…\n\n","date":"September 13, 2014 at 8:50 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-150692","author":"Hugh Farey","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"I stated Piero was probably referencing the articles in the links I provided.\nYet, with respect to chemistry – See this link: http://skeptics.stackexchange.com/questions/5963/what-is-monoatomic-gold \nQuote from link:\nJournal articles from the Cornell Library\nElectronic structure and dimerization of a single monatomic gold wire\nL. De Maria (1 and 2), M. Springborg (1) ((1) Universitaet Konstanz, Konstanz, Germany, (2) Centro Internacional de Fisica, Bogota, Colombia)\nhttp://arxiv.org/abs/cond-mat/9904181\nThe Puzzling Stability of Monatomic Gold Wires\nJ. A. Torres, E. Tosatti, A. Dal Corso, F. Ercolessi, J. J. Kohanoff, F. D. Di Tolla, J. M. Soler\nhttp://arxiv.org/abs/cond-mat/9812369\nStiff monatomic gold wires with a spinning zigzag geometry\nDaniel Sanchez-Portal, Emilio Artacho, Javier Junquera, Pablo Ordejon, Alberto Garcia, Jose M. Soler\nhttp://arxiv.org/abs/cond-mat/9905225\n\n","date":"September 14, 2014 at 1:24 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-150872","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"The monoatomic gold wire from another site references atomic gold bonded to Carbon and this is, more than likely, the same as the Cornell library abstracts.\nQuote:\nThe Au–Au spacing at breakage can be as long as ∼4.5 and 6 Å for the wires incorporating atomic (Au–C) and molecular carbon (Au–C2), respectively.\n\n","date":"September 14, 2014 at 2:16 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-150880","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Hi Angel,\nYou may have dropped in on this post halfway through, so missed my earlier comment. I hope other readers will forgive my reposting a paragraph.\n“But wait – are not Scientists at reputable research universities investigating the properties of monatomic gold, so it must be true? Well, no, they’re not. They are exploring what happens when a sheet of gold is treated in such a way that a fine thread of single gold atoms (sadly no more than half a dozen or so, so far) is pulled off like a string of beads, and predicting the electrical properties of such a ‘wire.’ This is nothing to do with the mumbo-jumbo peddled by pseudo-mystic metaphysicians.”\nIt is not enough simply to Google ‘monatomic gold’ or any other buzz-phrase (especially ones involving the words quantum, holographic or biophoton) and give links to the titles of papers that appear on the internet. I’m afraid that to carry any kind of credibility you have to read them and make sure you understand them, and then apply them to your own ideas.\n\n","date":"September 14, 2014 at 3:55 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-150889","author":"Hugh Farey","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Hi Hugh,\nThanks for the advice, but there’s an alternate scenario. \nScientists at reputable research universities stated it was impossible to obtain anything from dinosaur fossils, since they were merely rock and when one crushes rock, he or she obtains only dust.  :)\nYet, Dr. Mary Schweitzer, was able to isolate soft tissue and heme from dinosaur fossils by merely dissolving the bones in vinegar (softening them). \nEven Hawking referred to one of the particle pairs (referencing the annhilation of a positron-electron) as a twin, when, in fact, they have opposite charges.  Hardly a twin.\n Scientists have often been wrong.\nPiero only asked if it were possible to use a nano heating probe to test the white powder (heating and cooling).  This experiment would take less than an hour.\nYes, monoatomic gold, as I’ve further researched, is mystical, yet it could easily be tested.  http://www.halexandria.org/dward469.htm \nMy personal belief is Jesus walked on water and resurrected using the elements of nature.\nThe levitation would had to have involved a natural process or some type of metal acting as a superconductor and a current that would generate a magnetic field? \nPerhaps lightning striking the the earth vertically during the storm produced a magnetic field that allowed Jesus to walk on water.  \nLightning was never mentioned in the bible, with respect to the storm or the resurrection.  The tomb guards may have been placed in a coma by Jesus.\nWith regard to anti-gravity, is your belief Lockheed’s anti-gravity unmanned spacecraft, X-22A, with onboard laser weaponry, also an untruth?  Or is the anti-gravity, Boeing and Grumman, collaboration on a warp drive false, as well.?  Nothing is believable on the internet anymore.\nThanks again!\nBest,\n\n","date":"September 14, 2014 at 6:14 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151009","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"It would require a miracle, see later posting,  ‘Mystery never proof of anything’.  Seeking a natural explanation for a mystery may not always provide an answer, notwithstanding Conan Doyle.\n\n","date":"September 13, 2014 at 5:39 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-150796","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"[Refers to the idea of anti-gravity levitation postulated in preceding paragraphs above]\n\n","date":"September 14, 2014 at 7:38 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-150911","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Angel, the fact that scentists are sometimes wrong is not evidence that apparently non-sensical scientific speculation is more likely to be right. White monatomic gold powder has not been shown to exist at all; scientists being wrong about dinosaur protein does not make its existence more probable. Nor is there any evidence that being struck by lightning means that water becomes impermeable to people, nor that there is any anti-gravity physics incolved in any aerospacial research by Lockheed, Grumman or Boeing.\nI may be wrong, but my ignorance is not evidence for the existence for any of these unscientific ideas; they will have to argue for themselves.\n\n","date":"September 14, 2014 at 6:59 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151017","author":"Hugh Farey","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Hugh, I value your judgment. \nI have just located David Hudson’s patent on monoatomic gold, but it’s too late to read it entirely.  I’ll read it tomorrow.  \nThe article details the following:  \n “Process of forming a non-metallic, orbitally rearranged monoatomic form of an element selected from the group consisting of cobalt, nickel, copper, silver, gold, palladium, platinum, ruthenium, rhodium, iridium, and osmium from the corresponding element in metal form comprising treating said metal form by forming a salt thereof, exhaustively solubilizing and evaporating said salt in an aqueous medium until a diatom of said metal form is obtained; and thereafter treating said diatom with an alkali metal in the presence of water to form said orbitally rearranged, stable monoatomic form of said element.”\nAccording to Hudson’s patent he was able to isolate a stable form of monoatomic gold.\nhttp://www.subtleenergies.com/ORMUS/patents/Ozpatent.htm\nDon’t shoot the messenger!\nBest,\n\n","date":"September 15, 2014 at 12:24 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151070","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Angel commented on universe expansion exceeding the speed of light.  There were I think a few months when scientists at CERN involved with the LHC, were puzzled by a problem which they originally could seem only to explain by ‘c’ being exceeded.  But I believe on closer examination, another explanation was found, and the original report was found to be in error.  On the other hand, we have the mysteries of quantum entanglement.  Einstein went to his grave trying to unravel the mysteries of inconsistencies between relativity and quantum theory in his search for a G.U.T. but no-one else has ever succeeded in resolving it. \nWisely at the outset, the Bard has Hamlet saying:\n“There are more things in heaven and earth, Horatio,\nThan are dreamt of in your philosophy.”\n– Hamlet (1.5.167-8), Hamlet to Horatio\n\n","date":"September 14, 2014 at 7:50 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151022","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"daveb of wellington nz, \nYes, daveb, you are correct.   Initially CERN found neutrinos traveled faster than light’s speed, but at a later date, after having carefully measured their speed, concluded they did not travel faster than light.\nYet, have you ever wondered what lit the earth, prior to the formation of the sun and moon, enabling plant life to exist on the planet?\nWell it is my belief it was the Holy Spirit (Ruach HaKodesh), responsible for the light.\nThe first force was God the Father (Genesis 1:1 and 1:3) and the second force was the Holy Spirit, (light), Genesis 1:2.  \nAnd it may very well be the Holy Spirit traveled faster than the speed of light, since there was an expansion of the universe.  God did not create the sun, moon and stars until Genesis 1:14, yet abundant plant life carpeted the earth’s land mass. \nHugh will probably not agree. \nAlthough I have been called an heretic for this hypothesis,  I believe the following:\nThe Trinity ( 3 separate or interchangeable entities under on Godhead) is similar to Einstein’s theory, E = mc^2\nE = Energy (God the Father)\nm = mass (Jesus Christ, the Son)\nc =  speed of light ^2 (Holy Spirit, the Mother)  \nc in that formula is determined by the speed of the Holy Spirit (perhaps the speed of the Holy Spirit is equal to or faster than the speed of light, and is dependent on the circumstance. Expansion of the universe, as an example, would require the speed of the Holy Spirit to be faster than light’s speed.\nFather, Mother, and Son are a family unit.  God’s desire was for mankind to propagate the earth and to be representative of a family.\nAs well, God stated, Let US make man in OUR image, after OUR likeness in Genesis 1:26.\nThe reference is to God, the Father and the Holy Spirit, the Mother. This is the reason for the “us” and “our.”   And the dove is representative of the feminine, so it was the Holy Spirit (the Mother) who stated, as Jesus was being baptized by John, “This is my beloved son, in whom I am well-pleased.”  A mother can speak of her son, as well as a father.  And further, the Ruach HaKodesh is the femine gender in Hebrew, but was translated to “it” and “he” in the Latin and Greek.\nMy conclusion is the Holy Spirit is the Mother and the Holy Ghost is the resurrected Jesus.  I believe there was no way to distinguish between spirit (soul or breath) and ghost (apparition) in the Greek, so the words (spirit and ghost) were interchanged erroneously.\nReferencing the white powder referred to as monoatomic gold, I still believe there is no harm in testing Piero’s theory.   I wonder what the molecular structure and the chemical formula of this white powder might be or if a nuclear magnetic spectrum (NMR), or an Infrared spectrum (IR) is available.  It would be interesting to find out what this powder really is through chemical analyses.  I wonder if there’s an article on the chemistry?\nBest,\n\n","date":"September 14, 2014 at 11:46 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151065","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Dear Angel:  I think your rendering of Genesis 1 can only be considered at the poetic level, which is admissible as such, but not at the exegetical level.  There is an excellent commentary on Gn 1 at the USCCB web-site which I think you might find extremely interesting.  \nThe older original creation story composed by the Jahwist source is actually chapter 2 where God is seen as more of an anthropomorphic being – he talks, walks in the garden, he searches for Adam who is hiding from him, he asks questions “Who told you that you were naked?’ and there is a talking snake. \nWhen the Jews were taken into exile, about 540 BC they were exposed to Babylonian science, and to the Babylonian cosmogony.  It was during this time that the Priestly source wrote the progressive story of creation we now read in chapter 1, but they still kept the older story.  The “us” in chapter 1 reflects the idea of God presiding over a heavenly realm of beings, and although some have argued an implicit trinity from it, that is too much of a stretch.  \nMaterial creation is bound by the Laws of nature, which as far as we now know includes the limits imposed by the speed of light.  Neither the Creator, nor spiritual creation is so bound.  They exist outside of Nature.  An example of this would be the reported miracles of bilocation, such as those said to have been enjoyed by Padre Pio, and other saints, as directed by God.  \nVerse 1 reflects the ancient understanding of the universe, earth below, a dome above, and a heavenly realm beyond.  It ought not to be understood as a literal explanation. \nThere is far more on the USCCB site which I recommend you check out, as there is much more.\nhttp://www.usccb.org/bible/genesis/1  My wife is now demanding I come to the dinner table. immediately.\n\n","date":"September 15, 2014 at 2:24 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151087","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"daveb, I look forward to reading the article from you link, but I have had many of my own personal experiences, referencing Jesus, that appear to be directing me to find the truth.  \nEnjoy your dinner!\nWhen I was researching the relationship between science and evolution, God’s voice came to me and stated, “It is similar to the Einstein equation.”\nI had always believed the Holy Spirit was male, but I was given a dream, where the Holy Spirit was walking through the trees in the Garden and I heard a swishing sound as the Spirit walked by, stating to Adam and Eve, “Who told you you were naked.”\nWhat I saw moving through the trees was a long skirt, similar to a stiff silk that had an elongated (east to west), ivory colored, brocade “V” at the top (waistband of the skirt).  Yet, the waistband of the gown was at sky level and I was standing on the ground.  And no matter how far up I looked, I was never able to see the face of the Holy Spirit, only the waistband of the gown, the black shoes (similar to a penny loafer, without the penny slots) and the beige cotton stockings that were slightly rolled at the ankles.  \nThe entire top half of the Holy Spirit was above sky level.  And she moved in a manner that was quite awkward, as if there were too much height or weight for her frame.  Scaliing down to the size of an average woman, I  would say her size was about a woman’s 14. The gown (skirt) was almost Victorian in style.\nAt this point, after having this dream, I researched to find the Holy Spirit was female gender, according to the Hebrew, Ruach Ha Kodesh.\nhttp://www.wattpad.com/1096411-who-what-is-the-ruach-hakodesh\nAnd then the dove (feminine representation) made sense, and the statement, “This is my beloved son, in whom I am well pleased” represented the mother speaking of her son, and not the father.  I don’t know if this is antithetical to Catholic doctrine, but my dream was confirmed by finding “Ruach HaKodesh.”  This may be considered heretical, I’m not certain.\nI then started bleeding from a mole that suddenly manifested on my right side, ironically the same area where Jesus was pierced with the sword.   The bleeding wouldn’t stop, so I visited my physician.   My doctor sent me to a specialist and the dermatologist took a biopsy of the mole and told me to leave the band-aid on for 24 hours.  The next day, when I removed the band-aid the complete facial image of Jesus was detailed, including the “3” on the forehead.  The image was sharp and detailed; however, I waited a week and the blood had oxidized slightly.\nAt that time, I placed the band-aid in a cellophane bag and scanned it next to the Barrie Schwortz facial image.  The only difference is in my image the head is turned about 10 degrees to the left. \nAfter that the nail marks appeared on both my feet.  They were raised, red, and about a centimeter in diameter.  I took a picture of these as well.  \nAnd the last incident was another mole that started bleeding on the inner side of my left knee.  After the biopsy, the scar healed in the shape of a perfect cross.  I also took a picture of that.  The scar has almost healed at this point, but luckily I took a photo.\nI would like to post my blood Shroud image that is positioned next to Barrie’s shroud image (for comparison) on this thread.\nNext to the “3” on the forehead, on my image there is also a “6” and the Hebrew for “6” is vav, which means a connection, similar to our word “and” in English.  The explanation of vav is shown on the website below.\nhttp://webpages.charter.net/yarahministries/alphabet.html\nIf Dan would allow me to post the image, I will send it from my gmail account, since it allows the receiver to scan the image, thereby preventing viruses or malware attachments on photos.\nAs well, I was researching whether or not Jesus died in 33 AD or 36 AD.  Both had Friday passovers, but most scholars dictate 33 AD for His death, forgetting that 36 AD would also qualify.  If Jesus was born April 17th 6 BC and died in 36 AD his age would be 42.\nThis makes sense, since the Pharisee stated to Him, “You are not yet 50 years old, but you have seen Abraham.”\nIf Jesus was died in 33 AD His age would be 39, so the statement made by the Pharisee, would not make sense.  The Pharisee would have said, “You are not yet 40.”\n\n","date":"September 15, 2014 at 3:48 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151234","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"“It would be interesting to find out what this powder really is through chemical analyses.” Most of the monatomic gold on ebay is from a UK source in the county of Cumbria called Healing Mountain. It consists of 90% magnesium hydroxide (Milk of Magnesia powder) and 10% silicon dioxide (fine sand). As it contains no gold at all, it is remarkably cheap for a quack medicine. The molecular structure, formulae and spectra are readily available from standard chemistry and physics references.\n\n","date":"September 15, 2014 at 2:43 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151092","author":"Hugh Farey","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Fool’s gold = Iron pyrites = FeS2 (Iron sulfide)\nWhite gold = Magnesium hydroxide Mg(OH)2,\nBrown gold is brewed from hops and malt.\nNone have any Au !\n\n","date":"September 15, 2014 at 3:48 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151104","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"daveb of wellington nz,\nWhat is sold on ebay is NOTmonoatmic gold.  I’ve read half of the experimental procedure on the patent.  Hudson’s final compound has no inorganics, as you’ve detailed above. \nHudson removed all salts and inorganics.  If any remained in his final product, the purification had to be repeated from\nstep 1 in the synthesis.\nWhat ebay is selling is a fake.  A mere Infrared spectrum would determine if ebay’s product was authentic as there should be a doublet (two splits) in the 1450 cm^-1 region.\nThis would be similar to having an isopropy group on a compound and seeing the isopropyl split on the NMR (Nuclear Magnetic Resonance).  This split confirms one has the isopropyl group.\nI’ve only read to page 21 on the patent, but Hudson appears to be extremely intelligent.  Similar to two of the professors\nI did independent research for as an undergraduate on Nitrogen and Phosphorus chemistry.\nHudson spoke of d-orbital overlapping and I doubt those selling the product on ebay would even understand d- and s-orbitals.\nPlease don’t make a decision on monoatomic gold until you have read Hudson’s patent.\nhttp://www.subtleenergies.com/ORMUS/patents/Ozpatent.htm\nBest,\n\n","date":"September 15, 2014 at 2:47 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151223","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Hudson’s so-called patent application is anything but.\nTry reading some real patent applications, ones that focus on the practical patentable detail, which don’t try to bamboozle with superfluous so-called electron orbital theory (the latter padding-out being meticulously-contrived bullsh*t designed to overawe the gullible with pretentious waffle).\n\n","date":"September 15, 2014 at 3:08 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151228","author":"Colin Berry","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Hugh, I’m not certain if you saw my reply to you in a post above. \n I found the original patent by David Hudson on monoatomic gold, with the experimental procedure (extremely difficult).  \nThe IR spectra detailed two splits at approximately 1429 and 1490 cm^-1.  \nI doubt what is being sold on ebay is the same as that synthesized by Hudson.\nTake a look, if you have the time.  I’ve read up to page 21, and there are about 45 pages.  The experimental procedure is extremely complicated, working, at times, under an inert atmosphere and using extremely corrosive compounds, some that will oxidize right down to the bone.  \nThe glassware set-up alone, in Figure 2, leads me to believe those on ebay are not selling what was synthesized by Hudson as his produce was free from all inorganics.\nWhat’s sad is Hudson did not have access to the latest spectroscopic methods of testing we have today.  I would have like to see a Nuclear Magnetic Spectrum (NMR) of his product.\nRead the experimental section.  I’m certain what is sold on ebay is not monoatomic gold, as prepared by Hudson.\nPatent –\nhttp://www.subtleenergies.com/ORMUS/patents/Ozpatent.htm\n\n","date":"September 15, 2014 at 2:32 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151217","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Hugh, I don’t believe what is being sold on ebay is the same white powder prepared by Hudson.  The experimental procedure is extremely cumbersome and quite detailed.\nThis experiment was also performed on other metals, such as, cobalt, nickel, silver, palladium, platinum, ruthenium, rhodium, iridium, and osmium \nDATED this 19th day of June 1989.\nObviously, Hudson has worked many years on this project.  \nOne must first reproduce the experiment, before claiming the results are fraudulent.  Looking at the temperatures alone and the glassware set-up, I would conclude only one or two people have ever made an attempt at the synthesis.  \nBest,\n\n","date":"September 15, 2014 at 4:27 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151245","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Colin Berrys says:\n“Hudson’s so-called patent application is anything but.\nTry reading some real patent applications, ones that focus on the practical patentable detail, which don’t try to bamboozle with superfluous so-called electron orbital theory (the latter padding-out being meticulously-contrived bullsh*t designed to overawe the gullible with pretentious waffle).”\n***Angel says:  Hi, Colin.  T\nThere is no reply link next to your name, so I’ve included your statement.\nDid you notice the year of the patent?  Over 5 decades ago.\n(COMMONWEALTH OF AUSTRALIA\nPatents Act 1952-1969) \nYou may be comparing his patent with the more modernized versions of today, and further you are probably accustomed to reading patents detailing organic chemistry, not inorganic chemistry, which focuses more heavily on molecular orbitals.  \nBest,\n\n","date":"September 15, 2014 at 3:57 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151235","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"The date on the patent application was 1989, 20 years after the dates you quote, the latter relating to the earlier enabling legislation.\nWe do not know from the photocopy of the application whether or not it was approved.  I suspect not. \nForget about differences between organic v inorganic chemistry where patent applications are concerned. There is no role for abstruse mechanistic chemical theory in either, unless needed to make the case for the novelty of the process for which patent protection is sought. But there was no substantive link between the somewhat mundane chemical detail and the (over) interpretation at the electronic level. Indeed, there was a yawning chasm between the two… In fact, the practical detail looks somewhat laboured and suspect (I’ll spare you the detail).\n\n","date":"September 15, 2014 at 4:33 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151246","author":"Colin Berry","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Colin, I quoted that 1989 date in my reply to Hugh.  \nI know from my own inorganic chemistry courses, the professors spent a significant amount of time on molecular orbitals.  I found this to be the case with Advanced Physical Chemistry, as well.\nWhat you find boring is extremely exiciting to inorganic chemists, especially with respect to those metals whose electrons share or fill the d and f orbitals. \nInorganic chemists concentrate on both Molecular Orbital Theory and Crystal Field Theory.\nSince many inorganic compounds are highly colored, a great deal of time is also spent on where these compounds absorb and transmit light on the color spectrum, crystal field splitting, high spin, low spin and the filling of d and f orbitals.  These compounds absorb anywhere from 300nm to 700nm on the electromagnetic spectrum.  The site details 400-700 nm; however, in truth, it is 300 to 700 nm.\nNotice on the color of inorganic compounds link, how the d-orbitals are featured.\nhttp://chemwiki.ucdavis.edu/Inorganic_Chemistry/Crystal_Field_Theory/Colors_of_Coordination_Complexes\nWith that in mind, Hudson would naturally write about filling\nd orbitals, since his research is specifically targeting metals or metal compexes (inorganic compounds).\nHudson’s experimental section is very detailed.\nBest,\n\n","date":"September 15, 2014 at 7:49 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151277","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"I too learned about transition elements, degenerate d orbitals and crystal field field theory in Prof Ron Belcher’s inorganic chemistry department, University of Birmingham, England, 1963-66, while studying for a first degree in biochemistry.\nBefore and after that, I also learned to spot deliberate deceit by snake-oil merchants, albeit cleverly and laboriously disguised as “science”  (University of Life, 1944-present).\nNuff said.\n\n","date":"September 16, 2014 at 1:05 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151334","author":"Colin Berry","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"edit: Colin Berry says:\n***Angel says:  Hi, Colin.\n\n","date":"September 15, 2014 at 4:00 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151238","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Sadly, both the alleged Australian Patent you link to and a British Patent (GB 2,219,995 A), which is identical and can be found at http://www.rexresearch.com/ormes/ormes.htm, do not appear to be registered with either patent office. I do not believe they exist. \nNevertheless, I suppose we have to have a look at it. The first 17 pages are a Chemistry lesson and not patentable. On page 18 we begin a 21-step guide to preparing G-ORME. The first 5 steps, involving dissolving gold in acids and then boiling them away results in “substantially pure” Gold Chloride. It would be easier and cheaper to buy it commercially, or to pass chlorine gas over gold powder. Next we add salt and nitric acid and eventually achieve Sodium-Gold-Nitrate. Why not just buy some Gold Nitrate to start with? We are told that this is monoatomic Sodium-Gold-Nitrate. There is no justification for this at all, and it does not seem to mean anything anyway. It might mean that we now have more or less pure Sodium Nitrate, with the odd single gold atom relacing the sodium here and there. At least it explains the white colour. Boiling gold powder in Sodium Nitrate solution might have a similar effect anyway. We have reached step 12, and could have saved ourselves the trouble. At step 13 we make sure there is no acid still present, and at step 14 we add water and the pH immediately becomes 1. Not in my laboratory it doesn’t, but in this one the Nitrate disassociates from the Sodium Nitrate leaving… er… Sodium? in water?  Bash on, regardless of the chemistry. We now have pure Sodium-Gold which immediately becomes hydrolises to Hydrogen-Gold. This is white? I don’t think so. Wash off the acid, decompose off the Hydrogen and what have you got? No, not monatomic white gold powder, but exactly the same elemental gold powder you started with.\nWe have reached page 21 and embark on pure alchemy. First we check that a pile of dirt contains no gold. How? Then we mix it with salt, bromide, sulphuric acid and anything else handy and electrolyse it. The result is gold. \nSorry Angel, but this is utter tosh. If gold could be extracted that easily there would be huge factories bubbling away all over Arizona grinding out bullion like gravel.\nThere is no such stuff as monoatomic gold. David Hudson was a fraud through and through. His patents don’t exist, his gold doesn’t exist.\n\n","date":"September 15, 2014 at 5:41 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151259","author":"Hugh Farey","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Hugh, yes, gold nitrate is currently sold by “American Elements,” but may not have been available years ago.\nYou stated, “It might mean that we now have more or less pure Sodium Nitrate, with the odd single gold atom relacing the sodium here and there. At least it explains the white colour.  We have reached page 21 and embark on pure alchemy. First we check that a pile of dirt contains no gold. How? Then we mix it with salt, bromide, sulphuric acid and anything else handy and electrolyse it. The result is gold. \n***Angel says: Hugh, Hudson’s starting material WAS Gold Chloride (AuCl3).  With respect to Sodium Nitrate, it is highly soluble in water; therefore, Hudson would have rid the crude product of Sodium Nitrate.  As a result, some form of gold should still have remained.\nHudson’s experimental procedure states, “Thereafter, the just dry material is diluted to 80 ml with deionized water. The solution will have a pH of approximately 1. This step causes the nitrate to dissociate to obtain NaAu in water with a small amount of HNO3 remaining.\n***Angel says:  Yes, the pH would be 1, because the nitrate is still attached prior to the addition of water.  Nitrates are very acidic.  So, this step, adding water, dissociates the nitrate  and it is indicated a small amount of nitric acid still remains.  Therefore, the solution should still be acidic to some degree.  And Hudson increased the pH of this acidic solution to neutral pH with Sodium Hydroxide.  That is correct..\nAnd then Hudson states, “The NaAu hydrolyzes with the water and dissociates to form HAu.\nThis is also correct, since if NaAu was replaced with NaCl, after hydrolysis you woud isolate HCl and Hudson isolated HAu.  This step is correct.  And then he specifies getting a light grey precipitate of the gold that is hygroscopic (HAuXH2O).  He did not mention how many molecules of water were attached, meaning it varies.  \nThe last step  Hudson describes,”The monoatomic gold is placed in a porcelain ignition boat and annealed at 300C under an inert gas to remove hydrogen and to form a very chemically and thermally stable white gold monomer.”.\nI fail to see where you are getting a pile of dirt on page 21.  This is the purification procedure,  There is no dirt and there should be at least a gold atom, since Hudson started with gold.\nThere is no alchemy, since Hudson is not creating gold.  Hudson started with gold and ended with gold of some form or another (monoatomic gold).\nThe remaining pages in the experimental section are where Hudson performed the exact experiment with different metals, Palladium, Platinum, etc.\nYou are able to buy these compounds from chemical supply companies today, but they weren’t available during the time he began his research.\nUnless I’m missing something, the experimental procedure appears to be correct.  One would have to repeat the experiment to see if the final product is obtained.  \nBest,\n\n","date":"September 15, 2014 at 8:47 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151291","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"PS  I don’t believe Hudson was practicing alchemy, because he worked with cobalt, iridium, as well as many of the other transition metals.\n\n","date":"September 15, 2014 at 9:01 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151295","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Hugh,  I see why you believe Hudson’s work to be alchemy.  You believed Hudson was attempting to isolate pure gold from a gold complex and after reading his personal story, I see why you mentioned “dirt.”  Hudson hired chemists to perform the tests on a black compound he initially found in dirt, I don’t believe he is a chemist himself.\nWith regard to his patent, he states the following:\n“Any patent involving superconductivity has to be approved by the Department of Defense before it can be issued….. So it was sent to the Department of Defense. They refused to let me file world wide.” \nHe speaks of the Middle East and the Egyptians and this monoatomic gold powder that is  a superconductor and may have been how Jesus levitated.\nAt any rate, Piero might be out of luck, if what is sold on ebay is not what Hudson isolated.\nBest,\n\n","date":"September 15, 2014 at 10:29 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151308","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Oh, dear, here we go again…\n-“Gold nitrate is currently sold by “American Elements,” but may not have been available years ago”  –  A quick search of “nitrate of gold” at archive.com shows that it has been readily available since at least the middle of the 19th century.\n– “Hudson’s starting material WAS Gold Chloride (AuCl3).”  –  In his “patent” Hudson’s material was not Gold Chloride. The Instructructions specifically begin with 50mg of pure gold.\n– “With respect to Sodium Nitrate, it is highly soluble in water; therefore, Hudson would have rid the crude product of Sodium Nitrate.”  –  Both Gold Chloride and Gold Nitrate are highly soluble in water. Water to a dry mixture of both will create a solution of both; some unreacted gold might remain.\n– “Yes, the pH would be 1, because the nitrate is still attached prior to the addition of water. Nitrates are very acidic.”  –  No, nitrates are common salts. When dissolved in water they do not produce acidic solutions.\n – “So, this step, adding water, dissociates the nitrate and it is indicated a small amount of nitric acid still remains.”  –  What does this mean? There was no acid to start with, and there will be no acid remaining.\n– “Therefore, the solution should still be acidic to some degree.”  –  No, it isn’t. Most common garden fertilizers contain nitrates. Why not dissove some and test it with a pH tester?\n– “The NaAu hydrolyzes with the water and dissociates to form HAu.”  –  No, it doesn’t. No, it won’t. Evn if it did no light-grey HAu will be formed as HAu is extremely unstable and decomposes to gold at the drop of a hat.\nThere is nothing in any of the above to suggest that monoatomic gold is formed.\n– “I fail to see where you are getting a pile of dirt on page 21.”  –  A frivolous way of saying “300g of dried material” which is what Hudson starts his electroylsis with.\n– “There is no dirt and there should be at least a gold atom, since Hudson started with gold.”  –  No, I have moved on to the Electrolysis Experiment, which specifically starts with “material assayed by conventional techniques to show no gold present.”\n– “Unless I’m missing something, the experimental procedure appears to be correct. One would have to repeat the experiment to see if the final product is obtained.”  –  You can indeed carry out all the steps in the experimental procedure. What you can’t do is interpret the results of he chemical procedure in the manner described. A flick through YouTube shows lots of people churning out ‘mono-atomic gold’ in their kitchens. None of their final products is anything of the kind.\n– “Any patent involving superconductivity has to be approved by the Department of Defense before it can be issued….. So it was sent to the Department of Defense. They refused to let me file world wide.”  –  This is flim-flam. Hudson doesn’t claim a US patent, but he does claim an Australian and a British one, both of which do not exist. US Patents are regularly granted for advances in superconductivity which work. Any rejection of Hudson’s applications was not for some implied secret defence reason, but because it is nonsense.\n– “He speaks of the Middle East and the Egyptians and this monoatomic gold powder that is a superconductor and may have been how Jesus levitated.”  –  So he does, and so do dozens of similar people with mystical ideas and no evidence.\nEnough already. I have diverted further from the Shroud than I would have wished, although following my credo that if flim-flam is not discredited, its adherents claim that the very lack of discreditation is some form of acknowledgement.\nBut I wish us all joy, anyway!\n\n","date":"September 16, 2014 at 3:09 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151361","author":"Hugh Farey","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Hugh, I was speaking of transition metal nitrates, when I stated all nitrates are acidic.  The entire Hudson paper was referencing the different transition metals and d orbitals.  And all the nitrates of these metals would be acidic. \nThe reason is the transition metal ion acts like a bronsted acid, and it is for this reason the nitrates are acidic.\nCopper Nitrate has a pH of 4.\nCommon garden fertilizers do not contain transition metals.\nI said, “So, this step, adding water, dissociates the nitrate and it is indicated a small amount of nitric acid still remains.” – \nYou replied:  What does this mean? There was no acid to start with, and there will be no acid remaining.\nMy response:   Yes, there was nitric acid.\n ” 5 ml concentrated nitric acid are added to the crystals and again boiled to where the solution goes to just dry. Again it is essential not to overheat or bake. Steps (11) and (12) provide a complete conversion of the product to a sodium-gold nitrate. No chlorides are present.”\nAt any rate, I do not wish to continue further, but the thread started with a question on monoatomic gold, a superconductor, and so my reply was with reference to piero’s question.\nDon’t let me divert you from you shroud study, but always keep in mind \n“With God, anything is possilbe.”   :)\nPeace!\n\n","date":"September 16, 2014 at 2:35 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-151512","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Colin Berry says:\n“I too learned about transition elements, degenerate d orbitals and crystal field field theory in Prof Ron Belcher’s inorganic chemistry department, University of Birmingham, England, 1963-66, while studying for a first degree in biochemistry.”\n***Angel’s response: Sorry, I missed your post, Colin.\nWell, I must say that disclosure is impressive.  Dr. Belcher was also the mentor of T.S. West.\nI have also worked for a few giants in the chemistry field.  One was the late Dr. Ross C. Terrell (anesthetic pioneer).  Ross was our Vice President for 10 1/2 years, although my research project was the synthesis of novel and innovative neuromuscular blocking drugs. (neuromuscular junction -nicotinic receptors).\nDr. Ross C. Terrell\nhttp://journals.lww.com/anesthesia-analgesia/pages/articleviewer.aspx?year=2011&issue=08000&article=00029&type=Fulltext\nColin Berry says:\n“Before and after that, I also learned to spot deliberate deceit by snake-oil merchants, albeit cleverly and laboriously disguised as “science” (University of Life, 1944-present).\nNuff said.”\n***Angel’s response:\nColin, it may be the fact you view everything with a jaundiced eye that you either overlook the obvious or disregard, without hesitation, some process that may or may not be feasible: Meissner effect, Cooper pairs, etc., referencing monoatomic gold.\nI’m actually surprised you haven’t researched out Kerala’s red rain (#4 on the link), in support of  your own “Blood on the Shroud Theory.  Yet, I digress.   :)\nhttp://www.oddee.com/item_91568.aspx\nWith respect to the Shroud of Turin, all avenues, for and against, should be investigated, including those of Piero.  IMHO!\nBest,\n\n","date":"September 20, 2014 at 12:54 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-152743","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"“Colin, it may be the fact you view everything with a jaundiced eye…”\nReally? Even part-time trolls need to do their homework.\nhttps://shroudstory.com/2014/06/05/good-3d-from-a-conventional-photograph/\n\n","date":"September 20, 2014 at 1:31 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-152757","author":"Colin Berry","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Colin, I’ve seen your images previously, including that of nutella.  I am not stating you haven’t spent an enormous amount of time and energy attempting to recreate a likeness that would disprove the Shroud image.  That is commendable, although antithetical to Christian belief. Yet, it is your right, as a scrutinizing scientist. The viewing, on your part, with a jaundiced eye  referred to *everything* that might prove the Shroud authentic.\nWith regard to trolls, most of the posters on this forum (according to the definition of internet trolling,) would fall into that category, including you.  And some posters go far beyond what I would consider civil behavior.  I’ve not called anyone derrogatory names on this thread.\nArguing a point is not trolling, just because others (who are of a different opinion) disagree.   Actually, this is human nature and it is a characteristic of anyone who thinks outside the box. Why should posters feel that any form of intense questioning, beyond what is considered the norm, is ignorance or to be taken as insult to their intelligence?  \nSpeaking of the Shroud, iron and strontium were found in trace amounts.  See link below:   \nMore on the Dirt of the Shroud of Turin | Shroud of Turin Blog\nIn fact analysis of particles of limestone also found adhering to the Shroud … found particles of aragonite with small amounts of strontium and iron on the Shroud …\nhttps://shroudstory.com/2011/09/16/more-on-the-dirt-of-the-shroud-of-turin/\nWell, iron-based systems containing strontium and other elements (as new research details) are also found to be superconductors.  \nCheck out “Magnetism in Fe-based superconductors” \nAnd Jesus’ feet would have picked up iron from the soil on the path to the cross; therefore, since iron too is a superconductor, this element may have contributed to His levitation at the resurrection.   Don’t shoot the messenger!\nBest,\n\n","date":"September 20, 2014 at 6:32 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-152814","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Angel: there’s nothing “antithetical to Christian belief” in being a sceptic where the TS is concerned. Ask the Vatican if you don’t believe me.\nI’ll be spending the rest of today reviewing the totality of my evidence (presented in some half dozen postings spread over 30 months or more) regarding one tiny detail of the TS image. I refer to the transverse twin-track imaging of a crease in the linen at chin/neck level.  I believe my observations on the fine structure of that crease, captured as some kind of scorch, constitutes prima facie evidence for the TS body image having been imprinted  via physical contact between linen under applied tension and/or pressure and a heated template, probably metal. It’s based as experimental hands-on science  always is – on patient, detailed model construction and testing.\nWhat models will you be testing today, Angel, you being a scientist an’ all, or so you would have us believe?  Superconductor-aided levitation?  Good luck with getting your feet off the ground. My advice, for what it’s worth, would be to concentrate on keeping your firmly feet on the ground… Occasional blue sky thinking is fine, provided you then return to terra firma.\nAs regards your description of me having a ‘jaundiced eye’ for “all” authenticity-supporting research: wrong. That’s troll-speak whether you realize it or not.  My ridicule and contempt is reserved  for jargon-laden pseudo-science that postures as real science, invariably deployed by sad, mind-control fanatics to promote their obsessional pet theories or agendas (political, philosophical, theological, ideological etc etc). These people, with their easy access to the media, risk damaging the brand (real, model-testing science, that is) in the public’s perception, especially when they preface their soundbites with “speaking as a scientist”.\n\n","date":"September 21, 2014 at 3:15 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-153029","author":"Colin Berry","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Colin, I don’t begrudge your research, mainly because I know for a fact the man who is featured on the Shroud (Yehoshua) is authentic.  And if you eventually find a method to reproduce the image you would have to subject your creation to the same chemical testing the Shroud underwent.\nI’m a free radical, Colin; therefore, terra firma is meaningless in my world.  :)\nWith reference to science and levitation, how was it possible for St. Joseph to levitate? \nTransition Metals – Superconductivity – Meisner Feild  –\nZero Point Energy Field (ZPE).   \nThere is increasing scientific research into the area of anti-gravity, including NASA, and it is not beyond what would have been available to Jesus at the resurrection, aside from warp drives.\nHuman Levitation to Anti-Gravity\nhttp://curezone.com/forums/fm.asp?i=276210\n\n","date":"September 22, 2014 at 6:47 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-153797","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Colin, thought you might like this article,.\n“Scientists find economic process for creating gold from base metals”\n“LIVERMORE, California — Scientists at the Lawrence Livermore National Laboratory have discovered a process for inexpensively converting base metals into gold, the lab announced Tuesday night at a hastily called news conference.\nPidasso said the lab, a division of the U.S. Department of Energy, first achieved the transformation by borrowing protons from copper and nickel and adding them to bars of iron. But when copper and nickel supplies ran out, the lab began using protons from calcium, which is abundant in seashells along the nearby California coastline.\nAccording to Pidasso, using proton borrowing and high-quality varnishes, the lab will be able to manufacture about 1,500 metric tonnes of gold per year…”\nhttp://www.gata.org/node/5272\n\n","date":"September 28, 2014 at 1:59 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-157371","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Fantastic! Well spotted, Angel. Would you like to follow it up? I see the article was published in 2007, so I’m hoping gold production has really got going by now, and that the Lab Director Stewpid Asso (to spell his name correctly) is now a multi-billionaire. Incidentally, I note that the report you mention was in that highly reputable journal, the San Francisco Comical, by the eminent journalist Bend Over (to spell his name correctly). Ever been had?\n\n","date":"September 28, 2014 at 3:30 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-157389","author":"Hugh Farey","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"edit:  \nderogatory\ntaken as an insult\n\n","date":"September 20, 2014 at 6:53 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-152819","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Maybe the factual basis of some of these gold issues that Angel has been mentioning, could be related to nanoporous gold which Lawrence Livermore Nat Lab does seem to have been working on.  See:\nhttps://www.llnl.gov/news/aroundthelab/2012/Aug/ATL-082212_gold.html\nwhich does seem to be a valid posting from LLNL.  Maybe after that, it’s all “Chinese Whispers” and the stories get out of control and embroidered.\n\n","date":"September 28, 2014 at 4:19 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-157398","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Hugh, I was reading the book on “The Rise of the Alchemist” and it was reported a team of researchers at Harvard transmuted lead to gold; however the three gold isotopes obtained were radioactive and would, more than likely, decay back to lead, due to instability.\nLooking for that specific Harvard link, I found the article from Dept. of Energy story, didn’t read the byline or the details.\nThat aside, the transmutation of lead to gold has already been done.\nLink:\nTransmutation of lead into gold isn’t just theoretically possible – it has been achieved! There are reports that Glenn Seaborg, 1951 Nobel Laureate in Chemistry, succeeded in transmuting a minute quantity of lead (possibly en route from bismuth, in 1980) into gold.\nThere is an earlier report (1972) in which Soviet physicists at a nuclear research facility near Lake Baikal in Siberia accidentally discovered a reaction for turning lead into gold when they found the lead shielding of an experimental reactor had changed to gold.\nToday particle accelerators routinely transmute elements. A charged particle is accelerated using electrical and/or magnetic fields\nhttp://chemistry.about.com/cs/generalchemistry/a/aa050601a.htm\n\n","date":"September 28, 2014 at 5:38 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-157417","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"daveb, I did see that link article previously, but I bought the book “The Rise of the Alchemist,” and there were two references on transmuting lead to gold.\nThe first was the team of researchers at Harvard, mentioned in the reply to Hugh.\nAnd there was another that stated, the German, Johann F. Bottgher, worked for “Augustus the Strong of Saxony” and he was able to produce what was referred to as two button-like “reguli,” one of nearly pure gold and the other nearly pure silver.  Supposedly they are on exhibit at the Dresden Porcelain Museum.  There is a picture of both in the book.\nBottcher started making gold, but ended making beautiful porcelain for Augustus.\nYet, if this is a true account, his procedure was similar to that of David Hudson, since he used 1 grain of a tincture, along with lead and copper.\nBest,\n\n","date":"September 28, 2014 at 6:06 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-157420","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"edit:  Johann F. Bottger.\n\n","date":"September 28, 2014 at 6:07 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-157421","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Transmutation of Pb to Au:\nAtomic numbers:  Pb – 82;  Au – 79;\nAtomic weights:  Pb – 207.21;  Au – 197.2;\nElectron shells:  Both complete and full to 5d shell;  Pb – 2e- at 6s, 2e- at 6p;  Au – 1e- at 6s. \nTransmutation required:  From Pb nucleus, knock out 3 protons + about 7 neutrons;  From Pb electron shells, knock out 2e- from 6p and 1e- from 6s.  \nHow does one target nuclei in such a particular manner, or is it haphazard, and is it merely luck?\nAs far as I know, it’s never been done.  Most received formal literature seems to say there is no know nuclear process.  Sounds expensive.  Probably cheaper to try and capture meteorites, reputed source of most of earth’s accessible gold.\n\n","date":"September 28, 2014 at 6:37 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-157426","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"daveb, thank you for your reply!  \nYes, it sounds difficult, but transmutation of metals was accomplished by Glen Seaborg, the Nobel Prize winning chemist who worked on the “Manhattan Project.”  Seaborg was also the “Chairman of the Atomic Energy Commission and it was he who developed Americium, Curium and Berkelium (Periodic Table).\nThe Wiki article confirms Seaborg succeeded in the transmutation.\n“In 1980, he transmuted several thousand atoms of bismuth into gold at the Lawrence Berkeley Laboratory. His experimental technique, using nuclear physics, was able to remove protons and neutrons from the bismuth atoms. Seaborg’s technique would have been far too expensive to enable routine manufacturing of gold, but his work was close to the mythical Philosopher’s Stone.”\nhttp://en.wikipedia.org/wiki/Glenn_T._Seaborg\nMy wish is for some scientist (any scientist) to finally confirm the authenticity of the Shroud and the method for Jesus’ levitation at the resurrection.\nBest,\n\n","date":"September 28, 2014 at 1:59 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-157492","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"My paternal grandmother and her two brothers were born or brought up across Cook Strait around the 1870s in the town of Nelson, which is now quite a city.  I believe they had a young school-mate there by the name of Ernie Rutherford.  Precocious kid.  Seemed to know something about the topic.\n\n","date":"September 28, 2014 at 4:11 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-157513","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"daveb, that is quite the story.  \nErnest Rutherford (another Nobel prize winner) was a giant in the field of radiochemistry, although he was trained as a physicist.  We studied his discoveries of alpha and beta rays, as well as radioactive decay as undergrads.  He, along with\nJ. J. Thompson and Marie Curie were admired for their contributions to the field.of nuclear chemistry.\nMany years ago, I was exposed to alpha, beta and gamma rays, while working with positron emitters.  This was one of the reasons I decided to pursue a pharmaceutical career instead. Yet, I’ve been away from chemistry for almost two decades now.\nDid you grandmother have a picture of Rutherford?\nBest,\n\n","date":"September 28, 2014 at 8:16 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-157552","author":"Angel","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"Sir Ernest Rutherford, knighted Baron of Nelson, features on the NZ $50 note, Kate Sheppard, NZ pioneer of women’s rights (she secured the women’s franchise in NZ ahead of all other countries) on the NZ $10 note, and Sir Edmund Hillary, conqueror of Mount Everest on the NZ $5 note.  We have a reputation for pulling beyond our weight. \nRutherford is credited with claiming that all science is either physics or stamp collecting; he had a reputation for frequently intoning the hymn ‘Onward Christian Soldiers’ in his laboratory. \nSorry to hear about your exposure to radiation.  A brilliant class-mate of mine went into nuclear medicine at Auckland Hospital but died of radiation exposure in his early 40s,  Mme Curie liked to keep radium night lights in her bed-room which also resulted in her premature death.  You’ve survived 20 years and are therefore fortunate.\n\n","date":"September 29, 2014 at 12:18 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-157575","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Trimurti of the Italian scientific-experimental studies on the Shroud","post":"daveb of wellington nz, thank you for the information.\nWhat an honor to be featured on either a stamp or paper currency.  Your country contributed significantly to those giants in the field of science who are now deceased.\nI’m afraid to offer links anymore for fear they may be bogus, but I just found an archaeology site where it was stated a glass plate from the 4th century was found in Spain and it featured one of the earliest images of Jesus.  Strangely, He is beardless and according to the report He is wearing a philosopher’s toga.\n3 October 2014\nBeardless Jesus’ found in Spain\n“The plate is believed to have been used to hold Eucharistic bread as it was consecrated in early Christian rituals. It measures 22cm in diameter and fragments of it were unearthed outside the southern Spanish city of Linares, ABC newspaper reports.”\nhttp://www.bbc.com/news/blogs-news-from-elsewhere-29480874\nI’ve not looked through the articles on this site, so you may already be aware of this plate if, in fact, it is authentic.\nBest,\n\n","date":"October 4, 2014 at 11:35 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","id":"comment-159254","author":"Angel","site":"shroudstory"}]
