[{"title":"This is one very good way the story is being told","post":"I had not come across the N D Wilson ‘Shadow Shroud’ experiments previously, even though they were way back in 2005, and I have to say I found them intriguing.  The results were I thought better than some other poorer attempts to create an image that I’ve seen.  For those not familiar with them, I can recommend checking out the link, which opens at an interviews on FAQs, including responses to some of Dan’s criticisms at the time. You can check out by other links the images there and some background overview on the method.  Briefly the idea as I understood it is that a picture is painted on a glass sheet (seems that oil paints were used), and the glass with cloth underneath is exposed to sunlight for several hours, forming an image on the cloth. It is argued that the relative motion of the sun eliminates traces of the brush strokes, and that controlled variations in brightness also give a 3-D effect. I saw no comment there concerning any pre-treatment of the cloth.\nAssuming this is not a leg-pull, and that the claims made are in fact kosher, then there are a few technical objections: 1) Could sheets of glass be made large enough? Wilson argues that with “cylindrical glass blowing” in the 11th century it would be feasible to do it with two separate sheets for the ventral and dorsal images;  2) Forgers seldom do one-offs, and no other attempts are known; But, such large sheets of glass would have been extremly expensive at the time; 3) The realism of the Shroud image fits into no medieval artistic category, and I think this might be the key objection; 4) The forger did not inform anyone else of the method; why would he want to produce a negative image? why are there no smaller, less expensive medieval examples of this process? \nHowever one additional thought did occur to me.  If in fact the method as described is genuine, does it say anything about the potential credibility of Giulio Fanti’s hypotheses about the Shroud image being formed by some laser-like light process?\n\n","date":"September 23, 2013 at 6:16 am","url":"https://shroudstory.com/2013/09/23/this-is-one-very-good-way-the-story-is-being-told/","cat":"event","id":"comment-45174","author":"daveb of wellington nz","site":"shroudstory"},{"title":"This is one very good way the story is being told","post":"Dave, the Nathan Wilson’s results are very poor, and have most of the faults of painting hypothesis. You can see 3D reconstruction on his page, poor quality, but it is obvious that 3D fails. And N. Wilson admitted himself that he made no microscopic examination of his results.\n\n","date":"September 23, 2013 at 6:23 am","url":"https://shroudstory.com/2013/09/23/this-is-one-very-good-way-the-story-is-being-told/","cat":"event","id":"comment-45176","author":"O.K.","site":"shroudstory"},{"title":"This is one very good way the story is being told","post":"gee I ‘d never seen that and agree that’s the most convincing attempt at replication in terms of the appearance of the image. It has some of the image subtlety that the shroud image has unlike other attempts at recreation which have come across as very crude.\nStill seems fanciful as a credible method of creation however\n\n","date":"September 23, 2013 at 7:25 am","url":"https://shroudstory.com/2013/09/23/this-is-one-very-good-way-the-story-is-being-told/","cat":"event","id":"comment-45185","author":"Matthias","site":"shroudstory"},{"title":"This is one very good way the story is being told","post":"I don’t think it’s credible either but it could give insight into the actual formation process.\n\n","date":"September 23, 2013 at 10:40 am","url":"https://shroudstory.com/2013/09/23/this-is-one-very-good-way-the-story-is-being-told/","cat":"event","id":"comment-45199","author":"David Goulet","site":"shroudstory"}]
