[{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"Have they a speakers’ list and abstracts yet? It will be interesting to see what the ‘advances’ are. I shall be especially interested to see if Professor Fanti can get any wider scientific support for his dating procedures.\n\n","date":"July 14, 2014 at 10:08 am","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138115","author":"Charles Freeman","site":"shroudstory"},{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"Ancient textiles, “lignocellulosic investigations” and cellulosic chains…\nHere two old and boring questions :\nQuestion Number 1\n– What is your idea about the measurements of cellulosic DP of linen fibrils ?\nIn the past ( August 20, 2012 at 10:45 am), on this blog,\nI wrote:\n>In order to show what is the true age we have to control the linen fibrils.\n>Perhaps we can think to do something about the Viscoelastic Measurements\nof cellulosic chains (see also : the single cellulosic chains and the hydrogen bonds) by Driven Oscillation of an Atomic Force Microscope Cantilever… or similar works.\n>Is it too difficult that control ?\n— —\nHere an excerpt from another message [dated  August 21, 2012 at 8:25 am]\nwhere I wrote:\n>The title of an old work :\n>Surface structure of native cellulose microcrystals by AFM\nA.A. Baker, W. Helbert, J. Sugiyama and M.J. Miles\n>Applied Physics A: Materials Science & Processing\nVolume 66, Supplement 1 (1998), S559-S563, DOI: 10.1007/s003399870002\n>The most significant finding in this work is that it has been possible\nto image the cellobiose repeat along the chain because of\ntopographic differences associated with the asymmetric glucose unit,\nand thus identify triclinic structure on the microcrystal surface. …\n— —\nIn a message dated :  August 24, 2012 at 10:43 am\nI wrote:\n>… In my idea the problem to solve is the following :\n>How to find the length of a single chain ?\n>You can think that a cellulosic chain can be a vibrating string…\n>… … You can also remember Lord Kelvin and the dissipation\nof the mechanical energy, the mechanical damping, etc.\n>These things are more interesting at level of fibres, for the characterisation\nof mechanical behaviour of deformations (or stresses) below the level of destruction.\n>See also : the damping coefficient (and the viscous damping ratio, etc.) and the inherent equations.\n>… …Which types of playing techniques for the molecular chain ? … …\n— — — —\nQuestion Number 2\n– What is your idea about the viscoelastic properties of linen fibrils ?\nToday\nI have found a “vague study”:\n“Microrheology to explore protein and cell dynamics”\nby\nWarren, Rebecca Louisa (2012)\nMicrorheology to explore protein and cell dynamics.\nPhD thesis, University of Glasgow.\n[a Ph.D. thesis submitted to the Division of Biomedical Engineering,\nSchool of Engineering, University of Glasgow, 2012.\nThesis (Ph.D.) — University of Glasgow, 2012. ]\nLink:\nhttp://theses.gla.ac.uk/3344/\nHere an excerpt from the abstract:\n>… I explore the applications of optical tweezers and passive video particle tracking microrheology for bioanalytical applications … …\n>… …we have developed two new self-consistent procedures for measuring the linear viscoelastic properties of materials across the widest frequency range achievable with optical tweezers (Phys.Review E. (2010) 81:2, and J. Optics (2011) 13:4). Furthermore, we present a straightforward procedure for measuring the in vivo linear viscoelastic properties of single cells via passive video particle tracking microrheology of single beads attached to the cells’ exterior. Notably, the procedure presented here represents an alternative methodology that can be extended to many experimental formats and provides a simple addition to existing cellular physiology studies. In addition, we introduce new methodologies for deriving the concentration scaling laws of polymer and biopolymer solutions from microrheological measurements carried out with optical tweezers. These methods have been adopted to investigate the concentration scaling laws of in vitro reconstituted actin solutions and actin/myosin solutions.\n— —\nPerhaps you can develop a particular variant of quartz crystal microbalance (QCM) called QCM-with dissipation monitoring (QCM-D) that allows simultaneous and simple measurements of changes in adsorbed mass as well as the viscoelastic property (D-factor) … …\nOr other interesting tools (and nano-tools)…\n— —\nNow I ask:\nWhat is your interesting idea ?\n\n","date":"July 14, 2014 at 12:55 pm","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138186","author":"piero","site":"shroudstory"},{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"Which are the best quantum dots to use\nin “passive video particle tracking microrheology” ?\nCheers …\n\n","date":"July 14, 2014 at 12:59 pm","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138188","author":"piero","site":"shroudstory"},{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"Although I am opposed to the idea of dyeing the linen fibrils with quantum dots (QDs), my curiosity leads me to propose some question regarding the works on linen fibrils…\nPerhaps it’s possible to work using a nanoscale mechanochemical method to deliver fluorescent quantum dots (QDs) into linen fibrils, using a membrane-penetrating nanoneedle …\nIs that a feasible operation?\nIn any case I would prefer to use Not Destructive Tests (= NDT) and Not Manipulative Controls (NMC) with AFM, etc.  In short, we should “wash out” quantum dots …\nWell…\nWhat is your opinion about the right AFM controls?\n\n","date":"July 15, 2014 at 8:46 am","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138472","author":"Piero","site":"shroudstory"},{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"There will be two Israeli scholars who will talk on ancient textiles (controversial area, of course) and one professor from Sri Lanka (Uppsala University, Sweden) who will have something to say about lightning, which should be interesting to Fanti.\n\n","date":"July 14, 2014 at 10:29 am","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138121","author":"Louis","site":"shroudstory"},{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"I am glad to hear that there will be something on textiles as this is an area where little research seems to have been done while new ancient textiles are being discovered by the day, so potentially there is room for ‘advance’ here.\nFirst earthquakes, now lightning- sounds interesting.\n\n","date":"July 14, 2014 at 10:34 am","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138124","author":"Charles Freeman","site":"shroudstory"},{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"That is true, and one must presume that the fact that the textile experts are Israeli should bring some advances. You should find something here:\nhttp://dee.poliba.it/atsi2014/index.htm\n\n","date":"July 14, 2014 at 10:41 am","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138126","author":"Louis","site":"shroudstory"},{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"Thanks, Louis. It is good that contributors have to highlight  the way in which their papers contain ‘advances’ as this will avoid the repetition of material that has already been published.\n\n","date":"July 14, 2014 at 10:47 am","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138129","author":"Charles Freeman","site":"shroudstory"},{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"You’re welcome, Charles. I trust the two Israelis and one Sri Lankan, Professor Vernon Cooray:\nhttp://www.iclp-centre.org/cooray.html\nwill have something interesting to say, on textiles and lightning, respectively.\n\n","date":"July 14, 2014 at 10:57 am","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138132","author":"Louis","site":"shroudstory"},{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"I submitted a paper to this conference that argued the Holy Shroud was not authentic because it contains an image, and images are always created by human beings. One of the reviewers rejected my paper because it did not promote the authenticity of the Shroud. This is against the code of ethics of the IEEE because it is like publishing an article about evolutionary biology that promotes the theory of intelligent design. I intend to file a complaint against the conference organizers with the IEEE. Papers accepted and presented at IEEE conferences are published in the IEEE Xplore Digital Library. I think the IEEE would be perfectly justified in stripping the conference of its IEEE logo and all the benefits of such an association. I told Dario Petrie that I would not proceed with this complaint if the conference repudiated the reviewer’s comments and reasons for rejecting my paper.\n\n","date":"July 14, 2014 at 1:15 pm","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138192","author":"David Roemer","site":"shroudstory"},{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"I make it a point to stress fair play. There must be something wrong with your paper if it was not accepted for both the Saint Louis and Bari conferences. Perhaps you should change some things and rewrite it to make it more acceptable?\nYou have written for Catholic Truth – Scotland.\n\n","date":"July 14, 2014 at 6:51 pm","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138275","author":"Louis","site":"shroudstory"},{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"I can’t say because no one is willing to discuss my slideshow/lecture (http://www.holyshroud.info) and the supportive papers I submitted to the St. Louis and Bari conferences. I have no way of knowing what the shortcomings are of my presentation. I got only one invitation to give my lecture. I arrived at the parish in Manhattan with my slides and the pastor told me he decided to cancel my presentation because I was not promoting the authenticity of the Holy Shroud. I complained to the Vicar General, who told me that it was a matter than concerned only me and the pastor. I said there was no way the pastor and me could resolve our disagreement and asked to give a presentation to  the pastor with other knowledgeable Catholics to discuss the disagreement. Cardinal Dolan told me I was “debunking” the Shroud, and I filed charges against him with the Congregation for the Doctrine of Faith. So far no attempt has been made to resolve the conflict between me and Cardinal Dolan.\n\n","date":"July 14, 2014 at 10:53 pm","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138345","author":"David Roemer","site":"shroudstory"},{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"Filed charges against him with the CDF? Good luck with that. We’ve had thousands of clergy abuse cases disappear into the Vatican abyss over the last few decades. And you expect quick action against a prominent Cardinal who is merely trying to ‘protect’ the faith? \nYour case amounts to little more than a petty triviality…to be honest. Move on.\n\n","date":"July 15, 2014 at 9:46 am","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138485","author":"David Goulet","site":"shroudstory"},{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"Effect of lightning in association with earthquake may be an interesting avenue of research to explore.  D L Henshaw has carried out fundamental research showing tendency of radon molecules to be attracted to domestic electrical wiring operating at 50 Hz.  This has been picked up by a few local authorities in UK concerning their building planning regimes near high voltage transmission lines, because of increased cancer risks with radon, and I spotted a Youtube video on it.  There’s also other material generally available.  Henshaw’s research paper might be found at:\nhttp://www.researchgate.net/publication/262792866_Enhanced_deposition_of_radon_daughter_nuclei_in_the_vicinity_of_power_frequency_electromagnetic_fields  \nSynoptic gospel accounts refer to earthquake at crucifixion and Matthew suggests that it was another earthquake that hurled the stone from the tomb entrance.  There’s no mention of lightning, but there is reference to a darkness, sometimes interpreted as a wind-driven dust cloud.  I guess that even dust clouds could be charged with static electricity so that you could then get lightning strikes.  So the earthquake would give emission of radon, together with its other effects, and a concurrent lightning strike would result in a very powerful electric current and strong magnetic field surges, maybe concentrating the radon.  Lightning of course doesn’t operate at 50 Hz, but maybe that’s not such a significant factor, and it merely happens that only 50 Hz power lines were tested because it’s the standard.   \nIf both radon and electricity (lightning type) were both involved in producing the TS image, then it’s not so surprising that the imaging process has remained so elusive.  Could this be a new avenue of future research?\n\n","date":"July 14, 2014 at 5:32 pm","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138257","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"Professsor Giulio Fanti’s corona discharge hypothesis is based on ball lightning.\n\n","date":"July 14, 2014 at 6:54 pm","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138277","author":"Louis","site":"shroudstory"},{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"Not.\nLouis, ball lightning is an external source of energy ! …\nProfesssor Giulio Fanti’s corona discharge hypothesis indicates an emanation of energy from the Corpse/Body of Man (= internal source of energy) and instead it seems to me that the idea is of the lightning was reported only in relation to a particular view (a vision of Emmerich or Valtorta) …\nAm I wrong in my correction?\nI hope in your comments…\n\n","date":"July 15, 2014 at 6:27 am","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138440","author":"Piero","site":"shroudstory"},{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"Piero, in the interview that was published Professor Giulio Fanti told me that the corona discharge was possibly connected to ball lightning.\nThis interview-article was posted on the Holy Shroud Guild website but at my request my folder was deleted, for reasons that will soon be made known by me. I am sending it to Dan in pdf format, who can upload it if he wishes to do so. I can understand the pressure he faces. Welcome to the world of Shroud studies!\n\n","date":"July 15, 2014 at 9:06 am","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138474","author":"Louis","site":"shroudstory"},{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"Louis, I remembered that Alan Adler indicated that idea (If I am right he expressed this idea before Giulio Fanti).\nSearching, looking through the countless books about the shroud, we can see that Dr. Fred Zugibe indicated that Igor Benson suggested that ball lightning might have been the culprit, striking the body during an electrical storm… \nBut ball lightning is an extremely rare and poorly understood atmospheric phenomenon that accompanies electrical storms (and see also the “earthquake lights” !…).\nIt manifests as a glowing ball about the size of a basketball or, sometimes, as small as a golf ball or as large as a small car…\nBut …\nYou are right, because I have read your paper:\nhttps://shroudofturin.files.wordpress.com/2014/07/louis-science_and_religion_meet_in_shroud_research-1.pdf\nand\nthen there is the phrase:\n>Still others, and I am among them, suppose that corona discharge explains the image formation. But this phenomenon was caused by a particular fact such as ball lightning, which does not exclude another fact, correlated to what is described in the Gospels as having happened on that Sunday morning.\nThis seems to be a contradiction because Eng. G. Fanti supposed an internal source of energy and not an external source …\nWhat a strange confusion !\nSo… it’s just a point of view expressed in an interview\nand IMHO this is not true Science!\nIn any case I believe that you have not well understood the idea by prof. Fanti.\nSo, try to read all the papers written by prof. Giulio Fanti … or ask to him because\nI am not responsible for what other researchers have spoken in an interview…\nGood luck!   \nPerhaps the best solution is a direct answer by Fanti on that particular and controversial argument…\nIf the Shroud is scientifically proven to be Christ’s burial cloth then it would be the physical evidence of Jesus Christ’s death.\nThe glorious Resurrection  is the Great Mystery of Faith.\nIn my opinion , until now, there is not yet a true scientific proof about the Resurrection of Jesus Christ.\nWhat is your idea ?\n\n","date":"July 16, 2014 at 6:33 am","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138680","author":"Piero","site":"shroudstory"},{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"David Roemer certainly should be given ‘academic’ reasons for the rejection of his paper. If, as he asserts, he has been told that it has been rejected on the grounds that it does not promote the authenticity of the Shroud, then the participation of a body such as the  IEEE does seem strange.\nOne would hope that the organisers and the IEEE would clarify the situation as it does need to made clear what the status of the conference is. If only those committed to the authenticity of the Shroud can submit papers, we need to know that.\n\n","date":"July 15, 2014 at 3:05 am","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138391","author":"Charles Freeman","site":"shroudstory"},{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"I see that according to the blurb on the IEEE website attendance is only scheduled at 25 but the conference is open to ALL those interested in scientific research on the Shroud with no mention of any prior commitment to its authenticity.\n\n","date":"July 15, 2014 at 3:33 am","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138395","author":"Charles Freeman","site":"shroudstory"},{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"Hi David, why not publish your paper on your website and give us a link here. Nowhere in the world is there a wider diversity of experts on the shroud than among the commenters here. Although individually we may have quite strong convictions, together we represent as fair-minded a collection of advisors as you can find. Surprisingly, considering some other websites I have browsed in the past, we even read the research submitted, and investigate its references, its evidence, its relevance and its ramifications in quite exhaustive detail.\nI ought to say, to be fair, that your previous incursions (see: Russ Breault and Pastor Caspar McCloud Discuss the Shroud, February 8, 2014) have not withstood critical assessment well. There are several of us here who also tend towards non-authenticity, but we do not uncritically support non-authentic ideas. It may be that there were other reasons for the rejection of your paper by the Bari Conference reviewers, such as a lack of references for your statements, or the presentation of premises as axiomatic when they are no such thing. Your statement above, for instance, “it contains an image, and images are always created by human beings,” needs both explanation and justification before it can be built upon as evidence.\n\n","date":"July 15, 2014 at 3:47 am","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138400","author":"Hugh Farey","site":"shroudstory"},{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"David has sent me his paper and the letter of rejection. The abstract reads, “Abstract—This paper examines the differences between the methods of inquiry called science, metaphysics, philosophy, theology, and history in the context of investigations of the Shroud of Turin.” The paper is 1400 words in length. \nUnfortunately, as I read David’s cover email, he sent these only because I might be interested in them. If he gives me permission I will show the paper here.  If David obtains permission from the Bari organizers I will also publish the letter of rejection. Frankly, without being able to see these documents in the light of day, it is difficult to discuss this topic further.\n\n","date":"July 15, 2014 at 6:20 am","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138439","author":"Dan","site":"shroudstory"},{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"@David Goulet\nI initially filed the complaint with the Pontifical Council for the Promotion of the New Evangelization. The Under-Secretary of that group advised me to file the complaint with the Congregation for the Doctrine of Faith, which I did on February 24, 2014, in a registered letter. On July 7, 2014, I advised the CDF of Bruno Barberis’s roll in rejecting my presentations at the St. Louis and Bari conferences. Barberis is the science consultant to the Papal Custodian of the Shroud. [edited to remove an unsubstantiated accusation]\n\n","date":"July 16, 2014 at 8:42 am","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138710","author":"David Roemer","site":"shroudstory"},{"title":"Bari Conference:  A scientific event unprecedented in Puglia","post":"Bottom line, David, your paper should not be presented at either conference. I think Hugh Farey has very effectively summarized why. Moreover, I think that any official who controls the use of presentation venues in the Catholic Church or any church has the right to not allow you to make your presentations in those places. You may have the right to complain but I think your complaints have no merit. Why not find your own venue in a non-Catholic church or secular place and make your presentations. \nI published your paper.  What it contains is the issue if anyone wishes to discuss this. I can’t see why because it has nothing to do with the shroud. Your unhappiness with church officials is not the issue here. Unsubstantiated accusations are not welcome. Period.\n\n","date":"July 16, 2014 at 9:46 am","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","id":"comment-138719","author":"Dan","site":"shroudstory"}]
