[{"title":"Upcoming, exciting exhibition on the Shroud of Turin in Málaga, Spain","post":"Oh, it will travel the WORLD?? That really is exciting!  I thought the exhibit was only in Spain. I don’t suppose there’s any chance the Shroud itself will be there? \nI really REALLY like what the scholar in South Africa said about the Shroud being “The Sign of Jonah” for our generation. That made a whole lot of sense, to me. How amazing that God would push it to the forefront in these final days, to more or less shove it in the face of those who blaspheme Him. \nThis is an unbelieving generation. I know that every age has had it’s full share of sin and trials, but I really do think the blasphemers have ramped up to a new level. And just as they ramp it up, so does God. This Shroud of Turin shows His mercy, actually. God is reaching out to those who are the most blatantly skeptical. \nTo enter the Kingdom of Heaven, we must have the faith and trust of a little child. That’s not a copout actually: it’s very difficult for intelligent, capable adults to let go and trust God. It’s a daily exercise, a daily discipline, a daily effort in prayer and Bible study. As well as being an enormous privilege: that we can lean on God to such a degree and find our comfort in Him.\n\n","date":"February 11, 2012 at 6:25 am","url":"https://shroudstory.com/2012/02/11/upcoming-exciting-exhibition-on-the-shroud-of-turin-in-mlaga-spain/","cat":"event","id":"comment-8139","author":"AnnieCee","site":"shroudstory"},{"title":"Upcoming, exciting exhibition on the Shroud of Turin in Málaga, Spain","post":"“To enter the Kingdom of Heaven, we must have the faith and trust of a little child.” I see this as the fundamental basis of all Faith. Your points along these lines are excellent.\n\n","date":"February 11, 2012 at 10:57 am","url":"https://shroudstory.com/2012/02/11/upcoming-exciting-exhibition-on-the-shroud-of-turin-in-mlaga-spain/","cat":"event","id":"comment-8141","author":"Chris","site":"shroudstory"},{"title":"Upcoming, exciting exhibition on the Shroud of Turin in Málaga, Spain","post":"Annie, very nice comment! but I don’t think the ‘real’ Shroud will be going along, just a copy, as the Shroud never leaves it’s place, or very very rarely anyways. If the exhibit is anything like their promotional film it should be something to see. That promo film was pretty powerful, especially it’s epilogue, …well done.\nR\n\n","date":"February 11, 2012 at 1:15 pm","url":"https://shroudstory.com/2012/02/11/upcoming-exciting-exhibition-on-the-shroud-of-turin-in-mlaga-spain/","cat":"event","id":"comment-8145","author":"Ron","site":"shroudstory"}]
