[{"title":"Upcoming Presentation by John C. Iannone in Winter Park","post":"Attention was drawn to the Tilma of Guadalupe by the Archdiocese of New York at the end of last year:\n http://www.ny-archdiocese.org/news/archdiocese-of-new-york-launches-new-celebrations-of-our-lady-of-guadalupe-and-saint-juan-diego\n\n","date":"February 25, 2015 at 5:32 am","url":"https://shroudstory.com/2015/02/25/upcoming-presentation-by-john-c-iannone-in-winter-park/","cat":"presentation","id":"comment-191789","author":"Louis","site":"shroudstory"},{"title":"Upcoming Presentation by John C. Iannone in Winter Park","post":"was watching Barry Schwortz  on EWTN earlier this year..funny how he seemed to dismiss the Tilma..based on some secondhand comments he had heard………\nI smiled and thought he was possibly making the same rush to judgment that others have made on his beloved shroud\nthanks for the link Louis\n\n","date":"February 25, 2015 at 10:44 am","url":"https://shroudstory.com/2015/02/25/upcoming-presentation-by-john-c-iannone-in-winter-park/","cat":"presentation","id":"comment-191808","author":"rick","site":"shroudstory"},{"title":"Upcoming Presentation by John C. Iannone in Winter Park","post":"Hi Rick. Unfortunately, there are two major errors in your posting. ONE: I did not DISMISS the Tilma but simply stated that I did not believe it would withstand the same scientific scrutiny as the Shroud. TWO: My comment was NOT based on “secondhand comments I had heard…” but on all the scientific data presented by three experts on the Tilma from Mexico City who presented it to a group of Shroud scholars at a conference held in Jerusalem over a period of 5 days in 2013.  Here’s a link to an article about that conference with the details and the names of all the experts in attendance: http://www.shroud.com/late13.htm#3rd3. No rush to judgment here. Just my personal opinion based on that data.\n\n","date":"February 25, 2015 at 10:18 pm","url":"https://shroudstory.com/2015/02/25/upcoming-presentation-by-john-c-iannone-in-winter-park/","cat":"presentation","id":"comment-191849","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Upcoming Presentation by John C. Iannone in Winter Park","post":"Hi Rick\nMy professor of Parapsychology was one of those who studied the tilma in Mexico as part of his research into “supranormal” phenomena, defined as a power from beyond acting in our world. He believed it was “supranormal” and we discussed the topic for a while. It seems the original image will have to await better analysis when what was painted over it is turned into flakes. That merely confirms what Dr. Phil Calahan said after his study.\n\n","date":"February 26, 2015 at 7:00 am","url":"https://shroudstory.com/2015/02/25/upcoming-presentation-by-john-c-iannone-in-winter-park/","cat":"presentation","id":"comment-191875","author":"Louis","site":"shroudstory"}]
