[{"title":"Barrie on EWTN, Live–and again in repeats","post":"Watching Barrie on EWTN right now.  I’ve been meaning to comment on something I learned in engineering school decades ago (Northwestern).   When test results give a gradient, such as the C-14 dates of the four sample pieces, any engineer worth his salt would agree the test is incomplete.  The C-14 dates smoothly rise with linear location, i.e, C-14 content is a function of vertical location.  More tests need to be done beyond the boundary where the sequence ends, or the results are invalid. Because if C-14 is a linear function, the samples are not randomly chosen. (We all know why they were chosen there anyway.)\n\n","date":"November 6, 2013 at 9:34 pm","url":"https://shroudstory.com/2013/11/06/barrie-on-ewtn-liveand-again-in-repeats/","cat":"event","id":"comment-50247","author":"Matt Kowalski","site":"shroudstory"},{"title":"Barrie on EWTN, Live–and again in repeats","post":"Agreed, Matt, but are you aware that it’s the same Barrie Schwortz who is counselling against a repeat of the radiocarbon dating until doubts are addressed re contamination issues, notably those centred on thymol?\nhttps://shroudstory.com/2013/11/05/overheard-behind-us-during-barries-talk-thats-only-listerine/\nWhat if anything is being done to draw up new revised protocols that address specific contamination issues? Or is radiocarbon dating to be left permanently on the back burner (or at the bottom of the freezer) as being “too problematical”?\nDon’t feel you have to reply, but if you do, perhaps you could explain that last sentence in a bit more detail. Are you suggesting there was some deliberate attempt to deceive, and if so, by whom?\n\n","date":"November 7, 2013 at 4:55 am","url":"https://shroudstory.com/2013/11/06/barrie-on-ewtn-liveand-again-in-repeats/","cat":"event","id":"comment-50274","author":"colinsberry","site":"shroudstory"},{"title":"Barrie on EWTN, Live–and again in repeats","post":"Colin, when you agree with Matt, on which point(s) specifically do you agree :\n-do you think the test is incomplete ?\n-do you think the C-14 content is a function of vertical location ?\n-do you think the samples were not randomly chosen ?\n-do you think more tests had to be done beyond the boundary ?\n\n","date":"November 7, 2013 at 10:13 am","url":"https://shroudstory.com/2013/11/06/barrie-on-ewtn-liveand-again-in-repeats/","cat":"event","id":"comment-50300","author":"anoxie","site":"shroudstory"},{"title":"Barrie on EWTN, Live–and again in repeats","post":"Hi there anoxie.\nDo you think the test is incomplete ?</b?\nWell yes. that much is self-evident, though I could understand the dating labs being cajoled into accepting a corner sample \"just for starters\" and even agreeing to that, not wishing to be accused of defacing a \"Holy Relic\". What I don't understand is the 89 Nature report claiming to have dated the Shroud. It didn't – it only dated the corner they were given (see also below re the way that was subdivided).\n-do you think the C-14 content is a function of vertical location?\nNo, not being at all persuaded by claims for invisible reweaving that would have returned a data in error by 1300 years. Two to three hundred maybe, not 1300. The trend cannot be statistically significant because the snipping and subdividing was non-random, and different clean-up procedures were used. \n-do you think the samples were not randomly chosen?\nNo, of course they weren’t. There was essentially one sampling site only, and because there was only one, all kinds of considerations, objective and possibly subjective, influenced the final decision as to where to snip. That was NON-RANDOM SAMPLING which makes a nonsense of any subsequent  analysis of variance, significance testing or trend analysis. One cannot even do a rigorous trend analysis across the three sub-strips\n(except by those fancy “rigorous” methods provided later by the LSE that I don’t pretend to understand which  attempt to computer-model all possible combinations) because as I say the three labs were using non-identical clean up procedures that could introduce systematic, i.e. non random,. errors. \n-do you think more tests had to be done beyond the boundary.\nOf course. Even then it won’t be entirely random for obvious reasons, at least not with strip-sampling, since there are sampling sites that are obviously forbidden\nWhat one could do is place a grid over the Shroud, maybe the less-iconic dorsal side only, and decide which squares cannot be removed (image-bearing, blood bearing obviously).  One then takes random samples (but what if they are all clumped together, purely by chance?) say 5. Even then, one does not report one’s results as pertaining to the Shroud, but to less-sensitive parts of the Shroud.\nSorry if you got more than you reckoned for.  Are you by any chance a professional Shroud researcher, anoxie? Colorado-based?\n\n","date":"November 7, 2013 at 10:40 am","url":"https://shroudstory.com/2013/11/06/barrie-on-ewtn-liveand-again-in-repeats/","cat":"event","id":"comment-50302","author":"colinsberry","site":"shroudstory"},{"title":"Barrie on EWTN, Live–and again in repeats","post":"Thank you for this comprehensive answer.\nNo, i’m not a professional Shroud researcher, and i’m not Colodaro-based.\n\n","date":"November 7, 2013 at 10:46 am","url":"https://shroudstory.com/2013/11/06/barrie-on-ewtn-liveand-again-in-repeats/","cat":"event","id":"comment-50306","author":"anoxie","site":"shroudstory"},{"title":"Barrie on EWTN, Live–and again in repeats","post":"Great job, as always, Barrie.  Thanks for sharing the personal details of your life before and after you became involved with the Shroud.\n\n","date":"November 7, 2013 at 10:43 am","url":"https://shroudstory.com/2013/11/06/barrie-on-ewtn-liveand-again-in-repeats/","cat":"event","id":"comment-50303","author":"Kelly Kearse","site":"shroudstory"},{"title":"Barrie on EWTN, Live–and again in repeats","post":"Barrie, this was a clear and concise interview. Thoroughly enjoyable in each and every aspect.  Thank You!\n\n","date":"November 7, 2013 at 9:41 pm","url":"https://shroudstory.com/2013/11/06/barrie-on-ewtn-liveand-again-in-repeats/","cat":"event","id":"comment-50379","author":"Annette Cloutier","site":"shroudstory"},{"title":"Barrie on EWTN, Live–and again in repeats","post":"I just happen upon Barrie’s interview on EWTN right at the beginning.  It was a great interview with just the right amount of humor and a perfect mix of up to date status as well as a reflection of his personal, hands-on experience of being on the scene.  I tried to call in during the whole hour, but couldn’t connect.  Ray Downing phoned in and made it!\nPerfect job Barrie,\nRichard Orareo\n\n","date":"November 8, 2013 at 11:17 am","url":"https://shroudstory.com/2013/11/06/barrie-on-ewtn-liveand-again-in-repeats/","cat":"event","id":"comment-50436","author":"Richard Orareo","site":"shroudstory"},{"title":"Barrie on EWTN, Live–and again in repeats","post":"Here’s the link to see this program on Youtube: http://www.youtube.com/watch?v=wIUDaMatODM\nI watched it yesterday and I must say that I think Barrie’s answers to tough questions about the Shroud are getting better and better…\n\n","date":"November 11, 2013 at 12:19 pm","url":"https://shroudstory.com/2013/11/06/barrie-on-ewtn-liveand-again-in-repeats/","cat":"event","id":"comment-50789","author":"Anonymous","site":"shroudstory"},{"title":"Barrie on EWTN, Live–and again in repeats","post":"I had a suspicion he’d been practising…\n\n","date":"November 11, 2013 at 12:30 pm","url":"https://shroudstory.com/2013/11/06/barrie-on-ewtn-liveand-again-in-repeats/","cat":"event","id":"comment-50790","author":"colinsberry","site":"shroudstory"}]
