[{"title":"Barrie Schwortz at St. John’s:  From Skepticism to Belief","post":"I was honored to be there and actually, finally, press the flesh with Barrie after two years of extended contact via the web and telephone.  But someone in attendance was an echo of the Shroud’s past history that was totally unexpected, It was a wisp of the Shroud in history that I had already referenced in my manuscript  citing in John Walsh’s book on the Shroud published after WWII.. She introduced herself to Barrie.  She had, like others at the presentation, corresponded with Barrie  but never met him personally. \nShe identified herself as the grand-niece of Rev. Peter R. Beecher. Beecher was an Irish cleric who wrote the first Shroud book in English. Vignon’s 1902 book had been translated into English from French  circa 1902, but Beecher’s was written in English circa 1930. He sallied forth to do battle with English Jesuit Herbert Thurston and Beecher was a lively presence to the branch of his family who were in the US  (as was his antipathy to Thurston).\nWe are in the study and debate about the Shroud dealing with cosmic issues. By some “accident” of history, Barrie has become the leading of voice for the authenticity of the Shroud. The packed presentation at St. John’s attests to that. There is something distinctively Jewish in his presentation, particularly in is world-wise humor which makes it so lively. (Let us mourn the passing of Sid Caesar).\nDid I write “accident.” Make that providence.  Or better Divine Providence.\n\n","date":"February 27, 2014 at 7:34 am","url":"https://shroudstory.com/2014/02/27/barrie-schwortz-at-st-johns-from-skepticism-to-belief/","cat":"event","id":"comment-83033","author":"John Klotz","site":"shroudstory"},{"title":"Barrie Schwortz at St. John’s:  From Skepticism to Belief","post":"John, lucky you!  I can’t wait to meet Barrie myself having corresponded with him for two years, like yourself, and spoken to him from time to time over the phone… He’s very accessible and informative… which is totally unexpected for the only surviving key photographer of STURP together with his friendship providing the important liaison between Ray Rogers, Joe Marino (and Joe’s wife Sue Benford) who cracked the mystery of the skewed 1988 C14 dating.  When I was at Harvard, I studied under a Jesuit confrere of Thurston’s, the then Charles Chauncey Stillman Professor of Roman Catholic Studies… the Rev. Prof. George Windsor MacRae, S.J.  He informed me in 1978 that the Shroud was “a painting”.  When I asked him who made such a statement, he said the late Herbert Thurston, S.J. Of course I didn’t accept his statement, because intuitively, even in 1978, despite no one else stating it then, I felt the Shroud gave the impetus and inspiration, i.e., was the Source, for the NT.  Too bad the late Rev. Peter R. Beecher never came to Harvard.\n\n","date":"February 27, 2014 at 11:44 am","url":"https://shroudstory.com/2014/02/27/barrie-schwortz-at-st-johns-from-skepticism-to-belief/","cat":"event","id":"comment-83090","author":"Annette Cloutier","site":"shroudstory"},{"title":"Barrie Schwortz at St. John’s:  From Skepticism to Belief","post":"Annette,\nIf everybody Barrie has helped in the past twnety years attended, they wold have needed Madison Square Garden.\n\n","date":"February 27, 2014 at 12:09 pm","url":"https://shroudstory.com/2014/02/27/barrie-schwortz-at-st-johns-from-skepticism-to-belief/","cat":"event","id":"comment-83095","author":"John Klotz","site":"shroudstory"},{"title":"Barrie Schwortz at St. John’s:  From Skepticism to Belief","post":"Hi John,\nWe have Carnesecca Hall at St. Johns that holds 6,000, we can squeeze everyone into that building! \nGreat meeting you at the presentation, it was an amazing evening and I was honored to introduce Barrie at the event.\nTake care,\nBill Lauto\n\n","date":"February 28, 2014 at 11:03 pm","url":"https://shroudstory.com/2014/02/27/barrie-schwortz-at-st-johns-from-skepticism-to-belief/","cat":"event","id":"comment-83628","author":"Bill Lauto","site":"shroudstory"}]
