[{"title":"Final Program for Bari Conference","post":"Here few rough notes…\n1 – I am curious about the intervention by prof. Bruno Barberis\n(Director of the International Center of Sindonology)\nThe title of his speech includes three of the same words\n(= past, present and future) used in the past Symposium\nof Villa Gualino (Turin, March 2000).\nBut, despite the years (14 years !), there is not yet the right level\nof analyses (= AFM, CFM, SNOM and Raman).\nOnly Giulio Fanti was able to do something with Raman\nand ATR-FTIR. But this is not enough ! …\nI believed that advanced microscopies can solve several problems and\npoints remained obscure (f.e. : identificaion of the exact composition\nfor TLs [= thin layers] on linen fibrils involved in BIF = Body Image Formation).\nBut I was not able to persuade / convince anyone to analyze\nthe treated linens (experiments).\n2 – We can see that interesting problems about Oviedo’s Cloth\nare investigated by large patrol of spanish researchers\n(= “Shroud of Turin and Sudarium of Oviedo”).\nTwenty years ago I was happy to see the points of congruence\nbetween the Shroud and Sudarium, and now…\nWhat is the “New Coincidence between Shroud of Turin and Sudarium of Oviedo” ?\nWhat is your opinion ?\n3 – Pollen on the Shroud of Turin The trace left by anointing and embalming\nby M. Boi (University of the Balearic Islands), that is an expert in Palynology,\nwhich is the science that studies pollen.\nThat could be a great intervention, we have to pay attention…\nbecause this study can be an extremely interesting work.\n— —\nThe pollen exine, which is the outer layer of the grain,\nis composed of sporopollenin…\nUsing the AFM techniques we can control the pollen adhesion to linen\n(and oil of embalming, etc.), etc.,\nand AFM observations can reveal the level of pollen erosion.\nUnder :\nhttp://www2.le.ac.uk/departments/biology/people/twell/lab/pollenis/wall\nI have found an interesting explanation :\n>In addition to the purely mechanical function of the exine\nin protecting the reproductive cells from environmental injury,\nexine sculpturing plays an important role in attachment\nto insect pollinators and adhesion to the stigmatic surfaces;\nwhile wind pollinated species including many grasses and\ntree species often lack elaborate structure and appear smooth. … …\nAnd what is the difference about exine and intine ?\n>Beneath the exine, which is defined by the presence of one\nor two basal nexine layers, a second major wall layer surrounds\nthe pollen grain protoplasm termed the intine. While the exine\nis composed of sporopollenin, a complex and highly resistant\nbiopolymer containing fatty acids, phenylpropanoids, phenolics\nand carotenoids, the intine is largely composed of pectin and cellulose. …\n— —\nNow the problem :\nHow can change over the centuries the material of pollen?\n— —\nA previous Boi’s report (Valencia 2012) clearly highlights that the pollen\nis proof that the shroud, which is kept in Turin, was a winding-sheet and was used according to rituals common in the Middle East over a thousand years ago.\nB.T.W. : Under the address :\nhttp://extension.uned.es/actividad/7018\nI have found another work by Marzia Boi (Universitat de les Illes Balears),\nhere the title : “Sábana Santa de Turín y Sudario de Oviedo: pruebas científicas\ndel crimen de Jesús de Nazaret”.\nSo …\nIf Max Frei made no attempt to distinguish between anemophilous and\nentomophilous pollen material, meanwhile, forensic science has progressed.\nIn my previous intervention I remembered that is important to record the nature of pollen grains, the we were not able to deepen the question…\nIf the pollen grains are powdery, dust like, this is an indication about wind pollination.\nUsually pollen grains are sticky in insect pollinated flowers.\nSo we have to control what are the levels of viscoelasticity and adhesion …\nI have several doubts about the precision of that control,\nafter the centuries and aging…\nIn my opinion that work is not a nonsensical control and\nI am still curious about that unsolved question.\n4 – In my opinion Giulio Fanti author of the intervention :\nOptical features of flax fibers coming from the Turin Shroud\nwas able to do something using PLM (= Polarized Light Microscopy)\nand not with SPM …\nBut I am still curious to follow what are the interesting observations.\nFor now we can imagine something.\nFor example:\nit is possible to show something about the ancient treatment\n= the beaten linen fibrils observed in optical field (PLM) …\nor :\nWas he able to measure the Viscoelastic Properties\nthrough “calibrated optical observations” ?\nNow remains a curiosity for what we still need to know…\n5 – At the end there are the studies about the strange EQLs\nand Earthquakes …\n= Sky Darkening during Strong Earthquakes as Hypothesis of\nEarth’s Crust Emission in Holy Shroud Image Study.\nSee, for example, what wrote Fidani :\n>A seven-month collection of testimonials about the 6 April 2009 earthquake in Aquila, Abruzzo region, Italy, was compiled into a catalogue of non-seismic phenomena. Luminous phenomena were often reported starting about nine months before the strong shock and continued until about five months after the shock. …\nLink:\nhttp://www.academia.edu/5586287/The_earthquake_lights_EQL_of_the_6_April_2009_Aquila_earthquake_in_Central_Italy\n— —\nAnother interesting study (with Giovanna De Liso and Andrea Viotto):\nMulti-Parametric Monitoring System of Associated Seismic Phenomenology\nand Unusual Animal Behaviour in Western Piedmont.\nHere an excerpt from the Abstract:\n> Earthquakes have been seldom associated with reported non-seismic phenomena\nobserved weeks before and after shocks. Non-seismic phenomena are characterized by\nunusual sounds and light emissions as well as degassing of vast areas near the epicentre\nwith chemical alterations of shallow geosphere (aquifers, soils) and the troposphere.\nMany animals are sensitive to even the weakest changes in the environment, typically\nresponding with behavioural and physiological changes. … … …\nLink:\nhttp://www.researchgate.net/publication/263075541_Multi-Parametric_Monitoring_System_of_Associated_Seismic_Phenomenology_and_Unusual_Animal_Behaviour_in_Western_Piedmont\n— — —\nFor now I’ll stop here…\nPerhaps I “drank” too much knowledge with you.\nBut the thirst for knowledge is never satisfied!\nIn fact I think it is not enough to write, instead\nit is necessary to work in proper laboratories…\n\n","date":"August 12, 2014 at 6:55 am","url":"https://shroudstory.com/2014/08/11/final-program-for-bari-conference/","cat":"event","id":"comment-143516","author":"piero","site":"shroudstory"},{"title":"Final Program for Bari Conference","post":"PALINOLOGY…\nThe term palynology was introduced by Hyde and Williams in 1944\n(see also under : http://en.wikipedia.org/wiki/Palynology).\nDifferent forms of the exine surface.\nLink:\nhttp://www.botany.unibe.ch/paleo/pollen_e/surface.htm\n>The sculpturing of the pollen grain is the ornamentation of\nthe exine surface which can be psilate, foveolate, areolate (frustillate),\ngemmate, clavate, verrucate, baculate, echinate, rugulate, striate or reticulate.\n— —\nPollen grains consist of three substances…\nSee also under :\nhttp://www.botany.unibe.ch/paleo/pollen_e/morphology.htm\n>The outer cell wall, the exine, consists mainly of sporopollenin,\nan N-free polymeric substance belonging to the terpenes.\n>Sporopollenin is chemically unsaturated and is corroded by\nOxygen (oxidation), but is otherwise resistant even to strongly\nalkaline substances and organic acids. Sporopollenin is thus one\nof the most resistant substances in the plant world.\n>Thanks to the considerable chemical resistance of sporopollenin,\npollen grains and spores can be preserved under anoxic conditions\n in lakes and fens for thousands to millions of years …\n>The outer layer, which often “peels off” is the perispore.\nPerispore = perisporium\nExospore = exosporium.\nThen the question to solve can be the following:\nWhat happens on sporopollenin (see also : AFM/CFM surface controls!)\nwith different BIF simulations (and/or treatments with\nmyrrhoaloetic oils … !?!?) ?\nWhere are the possible micro-observations about the Kirlian effect ?\nWhat happens with ageing rate experiments\n(= different kind of morphology for sporopolleninic wall)?\n— —\nPollen Analysis and other problems:\nFungi and bacteria can breakdown the pollen.\nLimit for degradation :\nwith pH over 6 pollen degradation can start (chemical corrosion).\n— —\nPollen and Spore Identification Literature:\nhttp://www.geo.arizona.edu/palynology/polident.html\n\n","date":"August 12, 2014 at 10:32 am","url":"https://shroudstory.com/2014/08/11/final-program-for-bari-conference/","cat":"event","id":"comment-143549","author":"piero","site":"shroudstory"}]
