[{"title":"Barrie Schwortz Speaking in Ave Maria University, March 7 and 8, 2014","post":"Have you seen “Particle Fever” ?  I have read that :\nThis\n>Mark Levinson’s mind-blowing new documentary must grapple with some issues of scale.\nSo …\nIt’s an interesting movie …\n>about the largest imaginable subject: the structure of the cosmos. It tells the story of an enormous project, involving decades of labor, hundreds of millions of dollars and miles of Swiss real estate, devoted to finding something almost immeasurably small: the Higgs boson, a subatomic morsel believed by physicists to hold the key to understanding the universe …\nWe have to try to be able to work using AFM controls on cellulosic chains and AFM measurements of elastic modulus (with feeble forces … perhaps … also less than 20 nN, roughly ten times the force needed to break a single atomic bond !) …\nAfter 15 – 16 year there are not these answers (… but I have not yet read the new book by Giulio Fanti …) !\nI beg pardon about my technical (and vague) remark on “nanoscale mechanical properties and AFM controls” …\nand then\nI am curious about the discussions in that private Catholic university …\nI hope to read some future reaction …\n\n","date":"March 5, 2014 at 11:55 am","url":"https://shroudstory.com/2014/03/05/barrie-schwortz-speaking-in-ave-maria-university-march-7-and-8-2014/","cat":"event","id":"comment-85180","author":"Piero","site":"shroudstory"},{"title":"Barrie Schwortz Speaking in Ave Maria University, March 7 and 8, 2014","post":"Here the possible differences (“Particle Fever” versus “Turin Shroud research”) :\n– Physicists are on the cusp of the greatest scientific discovery of all time — or perhaps their greatest failure …\nThen … is it possible to write :\n– Christians are on the cusp of the greatest scientific discovery of all time — or perhaps their greatest failure ???\nSorry …\nBut I am bittered about the fact that we are not yet able to do the AFM controls …\nOne of reasons seems to be the fact that :\nThe Shroud seems to be less important than other questions …\nWhy ?\n— —\nI have read that :\n“Particle Fever” is a fascinating movie about science, and an exciting, revealing and sometimes poignant movie about scientists …\nSo …\nUntil now we have not seen yet a “similar movie” on SPM laboratories\n(with the controls on linen fibrils coming from the Holy Shroud\n… and inherent researches) …\nThe film (on new Shroud research) can be “a tribute to the creativity and curiosity that drive scientific research” …\nDo you agree ?\n\n","date":"March 6, 2014 at 9:57 am","url":"https://shroudstory.com/2014/03/05/barrie-schwortz-speaking-in-ave-maria-university-march-7-and-8-2014/","cat":"event","id":"comment-85503","author":"piero","site":"shroudstory"},{"title":"Barrie Schwortz Speaking in Ave Maria University, March 7 and 8, 2014","post":"I beg your pardon about my errors …\n— —\nI want to add a remark about another information :\nAFM is  a powerful tool for investigating linen fibrils.\nAnd the acquisition of high-speed AFM images permits to see the AFM movie …\nUsing the adequate AFM instrument (the high-speed AFM), we can conduct structural studies on linen fibrils.\nMechanical behavior of ancient linen fibrils is an interesting question to investigate. Do you agree ?\n… But, until now we have not yet seen an interesting AFM movie on linen fibrils (and their behavior under load) …\n\n","date":"March 6, 2014 at 10:13 am","url":"https://shroudstory.com/2014/03/05/barrie-schwortz-speaking-in-ave-maria-university-march-7-and-8-2014/","cat":"event","id":"comment-85514","author":"piero","site":"shroudstory"},{"title":"Barrie Schwortz Speaking in Ave Maria University, March 7 and 8, 2014","post":"There is the useful textbook by Alberto Carpinteri\n(Department of Structural Engineering Politecnico di Torino) :\n“Structural Mechanics. A Unified Approach”\nE & FN SPON, first edition : 1997.\nThen I believe that (at least) we have to read this textbook …\nwhen we want to speak about bending tests, etc.\nDo you agree ?\n\n","date":"March 6, 2014 at 1:49 pm","url":"https://shroudstory.com/2014/03/05/barrie-schwortz-speaking-in-ave-maria-university-march-7-and-8-2014/","cat":"event","id":"comment-85570","author":"piero","site":"shroudstory"},{"title":"Barrie Schwortz Speaking in Ave Maria University, March 7 and 8, 2014","post":"Saturday I have bought the book by Fanti and Malfi …\nHere the italian title :\n“Sindone. Primo secolo dopo Cristo !”\nI hope you are able to translate the title …\nThe content of that new book is very interesting and\nI hope you have the possibility to read the text in future …\nI was curious about the numismatic investigations and I have found several images of ancient coins …\nB.T.W. :\nDo you know Hyperpyron and Tremissis ?\nLinks :\nhttp://en.wikipedia.org/wiki/Hyperpyron\nhttp://en.wikipedia.org/wiki/Tremissis","date":"March 10, 2014 at 10:59 am","url":"https://shroudstory.com/2014/03/05/barrie-schwortz-speaking-in-ave-maria-university-march-7-and-8-2014/","cat":"event","id":"comment-86949","author":"Piero","site":"shroudstory"}]
