[{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Windsor is right across the river from Detroit Michigan, there are two ways to get there from Detroit.  The Bridge and the Tunnel.  This means that it is not that hard a drive from Michigan or Ohio or even Indiana.\n\n","date":"March 16, 2015 at 3:44 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193469","author":"ekmcmahon","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"“It was not a painting, it was [not] a photograph, it was not a scorch, it’s not a rubbing.” On the evidence available to STuRP, I can understand this conclusion. However, it would only be fair to say that after all the experiments since, one could also conclude that it is not a vaporograph, and not the result of electrical or sub-atomic discharge.\nBack to Square One.\na) It was formed by one of the mechanisms above, and the data leading to the conclusion that is wasn’t has been incorrectly interpreted.\nb) It was formed by a mechanism not yet thought of.\nc) It was formed by a miracle.\n\n","date":"March 16, 2015 at 5:18 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193476","author":"Hugh Farey","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"C\n\n","date":"March 17, 2015 at 2:25 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193576","author":"Thomas","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"The STURP team did a good job and much of the research today is based on the team’s published papers.\nWhat is good science? What kind of unknown mechanism? What kind of miracle?\n https://www.academia.edu/11355553/Dr._Paolo_Di_Lazzaro_explains_his_research_on_image_formation_on_the_Shroud_of_Turin\n\n","date":"March 16, 2015 at 5:35 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193478","author":"Louis","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Hugh,\nI do not believe in miracles, I believe there are  things we don’t understand. The Shroud attests to the FACT that within three days of his crucifixion, the body of Jesus Christs parted company with his burial cloth. Science will some day explain that. The sum of the evidence for that fact is overwhelming. All that stands in the way is the blind faith that accepts the results of the carbon dating which Thomas de Wesselow  tabbed a “fiasco”  in “The Sign.”  But de Wesselow than fantasizes that ALL the reported appearances of Christ post Resurrection were  observations of the Shroud because his agnosticism can not accept the Resurrection. .\nSome scientists are already discovering that in quantum phenomenon there is an explanation of eternal life. Concepts such  Teilhard’s noosphere and Jung’s collective unconsciousness are getting rolled into the concept of the quantum information of the universe. Stuart Hameroff  and Nobelist Sir Roger Penrose hypothesize that the brain is quantum computer functioning through quantum entanglement – action at a distance. Einstein originally rejected entanglement as “spookie.”\nAs predicted by Teilhard, science and faith are now converging and will run on parallel paths. Each will educate the other.\nSome are more comfortable with a blind faith. I prefer faith with eyes wide open.\nThese are exciting times and right in the middle of it is the Shroud of Turin.\nI will blog on the carbon tests in  a few days.”Do you have eyes, and not see, and do you have ears, and not hear?” Mark 8:18\n\n","date":"March 16, 2015 at 5:58 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193479","author":"John Klotz","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"John.\nMay I ask you one thing?\nHave you ever made any single college or University course on quantum mechanics?\nJust asking.\n\n","date":"March 16, 2015 at 6:05 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193480","author":"O.K.","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"I have taken a lecture course on Quantum mechanics in preparation for writing this book but have had a life long interest in science which includes the Quantum. In the past four years my library expanded by about 125 books, many of them many of them on science and several of them on the quantum. AT 17, I learned how to make a tesseract (a four dimensional analog of three dimensional cube). My interest in science is is more than seven decades old. Did you ever experiment with vinegar and baking powder in a corked bottle as a child?  I got my first chemistry kit age 8 or thereabouts. Did you ever hear of Boltzman Brains? Just asking.\nBy the way, there is no impertinence about asking for qualifications. But like the Shroud, Quantum Christ speaks for itself. \nI will post a piece on my blog in the next few days critiquing CNN’s Finding Jesus episode on the Shroud. \nHere’s a brief preview:\n“Teilhard de Chardin in The Phenomenon of Man anticipated a convergence of science and religion leading to a scientific analysis of the actions and direction of God in creating the existence that we know. Nowhere is that convergence more evident than in the study of the Shroud of Turin. There are a trio of intellectual disciplines that must be included in any analysis: Science, History and Theology. Any one who attempts to address the issue of the Shroud’s authenticity who doesn’t understand this trio is akin to one of the blind men describing an elephant: It’s a snake, no it’s a tree, no it’s a wall.  \n“Anyone seeking to comment on the Shroud must not just nod to the trio, he or she must develop some understanding of each as it relates to the Shroud. Unfortunately, the first episode of CNN’s “Finding Jesus” broadcast Sunday, March 1, addressed the issue of the authenticity of the Shroud of Turin was a concoction of largely blind men (and women) defining an elephant.”\n\n","date":"March 16, 2015 at 8:39 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193500","author":"John Klotz","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Fine, John. Simply there are many people who misuse the term ‘quantum’ while actually having no knowledge whatsoever about quantum mechanics. That’s why I am asking. \nAnother thing is that my experience teaches me that the long speeches using a lot of rhetorics usually indicate that the guy has little meaningful to say about the subject, and simply wants to make impression on his audience. This style is maybe more suitable for lawyers than scientists who usually use shorter and more specific style of expressing their views.\nThis is nothing personal. Just general thoughts. I am sure the basic terms like self-adjoint operator, eigenvalues and eigenvectors are not strange to you.\n\n","date":"March 16, 2015 at 9:14 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193501","author":"O.K.","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"John\nI don’t believe you need a formal education in a field to research it and have an opinion. I made a name for myself in a field outside of my own with just a few months research. That does mean I don’t give a lot more weight to an expert in that field, I just don’t dismiss something because he’s not a expert. If they did they research and they are well reasoned I consider it.\nHaving said that Penrose and Hameroff’s Orch-OR  theory has been harshly criticized by those in  mathematics and science. Max Tegmark in just one of them. In his book, “Our Mathematical Universe” ( I’m a bookworn also) he argues that it’s killed by decoherences.\nHe also wrote a paper on it.\nhttp://arxiv.org/abs/quant-ph/9907009\n\n","date":"March 16, 2015 at 9:55 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193504","author":"John Green","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"John Green,\nThe nature of out consciousness is one of the great frontiers and relates  directly to religious issues. One of the places where it becomes relevant is in the issue of what are commonly referred to as paranormal phenomena. The scientists who study these phenomena are often derided by the main stream but the pehenomena are real. \nOne example. During the Vietnam war,  woman awoke in the middle of the night to the sound of a rifle shot. It was inexplicable in he normal course of events where she lived. She later learned that her husband had been killed in Vietnam and when she received details discovered that it happened by a rifle shot at the precise time she had been awakened in the night.\nI have a coleaugue who had been married but divorced. His ex-wife moved to Florida. They had a dog who had passed away. \nOne night he had dream about the dog had died. He came to him in the dream barking as if he should wake-up and do something. His sense was that it involved his exwife. It was totally inexplicable. He called his ex-wife the next day and asked if she was okay. She told him she was getting married that day. That marriage didn’t turn out well.. \nThen there is the  case of Hans Berger Berger which I discuss in Chapter 15 of Quantum Christ:  Consciousness, Evolution and the Genesis of Good and Evil\n—————————————————————————————————————\nWho is right about human consciousness: the neo-Newtonians or those who find consciousness to be a quantum phenomenon? Perhaps we should begin with the “incredible,” and ultimately tragic, saga of Hans Berger.\n C.Hans Berger and his magic machine\nHans Berger was born May 21, 1873 in Neuses, a small Bavarian town that was eventually absorbed by the City of Coburg. He was the son of a well to do physician.  His father’s wealth freed Berger from the day to day struggle of the less fortunate to just survive. He had interests, but no extraordinary ambition. Hans was not interested in pursuing a career in medicine and settled, initially, on a career in Astronomy.\nHe enrolled as a mathematics student at the Fredrich Schiller University of Jena to prepare him for that career, but the pace of life in the city held no allure. He left college and began a year of military training to sort things out. It was while in the cavalry, that an incident occurred, that not only changed the course of his life, but the course of what we call neuroscience, the study of the nervous system, including the brain.\nOne morning, he was thrown from his horse during a training exercise. He landed on the road in the path of a fast approaching team of horses pulling a heavy gun carriage. His thought was quite explicit: “I’m going to die.” Fortunately, the drivers of the gun carriage were able to rein-in their team of horses and it stopped short of Berger. Shaken, but not injured, he returned to his exercise and his duties.\nThat evening, when he returned to his quarters, he found a telegram from his father inquiring about his welfare. That morning, his sister had become quite hysterical because she felt that Hans had been in an accident and died. His father inquired anxiously if he was all right. Berger promptly responded but he was amazed that his sister had an attack of hysteria at the moment of his grave peril when he consciously thought he was about to die.\nIt was a life changing moment for Hans Berger. His attention turned to neuroscience. He concluded that the brain must in some way think and process electromagnetic waves and that in some way his thought of his impending death had been transmitted to his sister with whom he had a close relationship. Needless to say, as he advanced in his study of neuroscience, contemporary colleagues were quite dubious and treated his ideas with derision. Undeterred, he developed a machine to measure “brain waves.” More derision, but in 1924, his machine began to achieve acceptance. It was dubbed the Electroencephalograph, the EEG, which was a breakthrough in the analysis and treatment of brain disorders.\nBerger’s life continued on a troubled plane. He never received what he regarded as his proper recognition. The next two decades would see the rise of Adolph Hitler and the Nazi party. There is some controversy about whether Berger was a Nazi collaborator. In any event, he retired from the University of Jena in 1939. In 1940, plagued by ill health and his failure to achieve what he regarded as his proper place in the scientific pantheon, he committed suicide. Today, there are research organizations in neuroscience that have either adopted his name or sponsor conferences in his name.\nThe EEG, which was a scientific breakthrough of the first order, has been in some respects replaced by the magnetic resonance imaging (MRI) which allows analysis not only of the brain but the entire body or selected parts of it. Professors Bruce Rosenbaum and Fred Kuttner, of the University of California Santa Cruz, writing in The Quantum Enigma: Physics encounters Consciousness, claim that “One third of our economy” involves products based upon quantum mechanics and go on to describe four of them: the laser; CCDs (charge coupled devices that, among other things record images in digital cameras); the transistor; and the MRI. \nThe scope of these four devices that use quantum mechanical methods indicates the distinction between the reflective consciousness of humanity and the consciousness of all other life on earth. Mastering quantum mechanics is one of the greatest accomplishments of humanity’s reflective consciousness. Most importantly, that reflective consciousness is the reason we, as distinguished from all other forms of life on earth, are constrained in our actions by ethics and morality. All other living creatures answer to unfettered instinct. The natural world is a violent, nasty place.  \nIs humanity different? If so, why?\n—————————————————————————————–\nThere will be those who find precursor attributes in the animal kingdom such as empathy and perhaps even a kind of ethics. Also, animals clearly have access to quantum phenomena. The migration of birds is alleged to guided by access to the quantum. That is a debate that would lead us to far from the issue at hand. Some might argue about my description of Neo-Newtonians as deterministic, This is probably not the place to debate those issues. There are others devoted to philosophy who made resent the intrusion of hard science into philosophical issues.\nI would also direct attention to the hypotheses  of consciousness being advanced by former Astronaut Dr. Edgar Mitchell who once co-authored a piece with – gasp – Sue Benford.\nI do not adopt or advocate any of these necessarily. But there is a direction and of  both science and religion and we are being pulled in that direction. I guess when push comes to shove I am a “Chardinist” (as in Teilhard de Chardin). (I was so labeled in private correspondence by a contributor to this blog who as a degree from the Harvard Divinity School and thought my ideas Chardinian).\n\n","date":"March 16, 2015 at 11:05 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193511","author":"John Klotz","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Dear Mr. Klotz\nI am agreeing with you regarding consciousness and quantum information of the universe.\nOne of my Irish friend who was living in Canberra had a twin brother in Ireland. One day while he was practicing for church choir he got a feeling that his brother died. As soon as he went home after the practice he got a call from Ireland informing his brother died at the same moment he got that feeling.\nBut unlike you I do believe in miracles and guardian angels as I have experience in that areas.\nRegarding image on the Shroud I agree with Mr. Barrie Schwortz. The image printed on the Shroud is a miracle and no one including Quantum mecahanics or Quantum Energy experts can explain the formation of that image.\nSampath\n\n","date":"March 16, 2015 at 5:51 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193541","author":"Sampath Fernando","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Sampath,\nHuman history is replete with things that were “miraculous” and later explained. The volcano did not explode because Tiki god was hungry for human sacrifice. \nI believe it may very well have been providential that the Shroud survived until the time when science could unlock its mysteries. We have now the face of Jesus and the scientific investigation has given us more knowledge and awareness of how he suffered than ever before. And, I believe that ultimately we will  understand the process of image formation and when we do we will understand more deeply the Resurrection.\nThat lies in the future. Probably not in my lifetime but maybe in yours. \nThe march of science, whether those scientists who are atheists understand it or not, is the march of humanity to its creator.\n\n","date":"March 16, 2015 at 6:17 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193545","author":"John Klotz","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Jesus did many miracles and I believe those. Jesus resurrected and it is another miracle which I believe. According to history he is the only one got resurrected and no one knows how it happen. \nSo it is very difficult for scientists explain that resurrection process. To do that scientists have to resurrect someone from the death. If they do so then they can find that process and can explain how the image on Shroud got printed. \nYes some sort of external energy (quantum) may have involved in that process. (or may be some divine energy).\n\n","date":"March 16, 2015 at 6:56 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193549","author":"Sampath Fernando","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"John Klotz wrote:\n>… Some scientists are already discovering that\nin quantum phenomenon there is an explanation of eternal life. …\nWho ??\nI want to understand in a better way your claim;\nbecause in my opinion, this idea, seems to be a bit far from the ordinary Science.\nI don’t know what was the level of knowledge on “quantum phenomena” by Teilhard de Chardin and Carl Gustav Jung, but the claim that Eternal Life\ncan be explained by quantum phenomena seems to be  a strange speculation because we cannot confuse this material/quantistic world with the Eternal Life…\nRemember what strange things wrote the physicist Frank Tipler about the Resurrection (and also on XX, XY, etc.chromosomes  = …Genetics of the Resurrection?)…\nFrankly, this is the peril…  \nSee also the strange book: “Physics of Christianity” (Doubleday, 2007), (Link:\nhttp://www.amazon.com/Physics-Christianity-Frank-J-Tipler/dp/B003D7JZC6/ref=sr_1_1?s=books&ie=UTF8&qid=1324817611&sr=1-1 )\nby\nProf. Frank J. Tipler and the Omega Point cosmology\n(and our past discussions in August , 2012   Link: https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/   ).\nTipler has authored books and papers on the Omega Point, which he claims is a mechanism for the resurrection of the dead.\nHis theological and scientific theorizing are controversial, but Christian theologian Wolfhart Pannenberg has defended his theology,\nand physicist David Deutsch has incorporated Tipler’s idea of an Omega Point…\n— —\nHere I do not discuss about the interesting Anthropic Principle…  Although I have read that were present some apparent contradictions in the work of exposure of that concept:\n>Since Carter’s 1973 paper, the term “anthropic principle” has been extended to cover a number of ideas which differ in important ways from those he espoused. Particular confusion was caused in 1986 by the book The Anthropic Cosmological Principle by John D. Barrow and Frank Tipler, published that year which distinguished between “weak” and “strong” anthropic principle in a way very different from Carter’s, as discussed in the next section. …\nLink:\nhttp://en.wikipedia.org/wiki/Anthropic_principle\nWhile Tipler has a detailed knowledge of Physics, probably he has failed as a scientist in “Physics of Christianity” because he has gone far beyond what the evidence warrants and engages in wild speculations…\n— —\nThe Brain Awareness Week (BAW) is the global campaign to increase public awareness of the progress and benefits of brain research…\nWhat is the true connection about brain research and Sheldrake?\nI don’t know.\nI have only found\nthe following link:\nhttps://philosophynow.org/issues/93/The_Science_Delusion_by_Rupert_Sheldrake  \nWhat puzzles me are some strange statements that we can read in the Web …\nSee for example the following words by Sheldrake: \n>Morphic resonance involves the transfer of information across space and time.  It might be possible to develop information-transfer systems, with a global memory, which would work without all the normal paraphernalia of satellites, wires, booster stations etc.  I have already designed experiments in which a pin code could be transmitted from London to New York without any conventional means of communication.\nSource, the article :\nScientific Heretic Rupert Sheldrake on Morphic Fields, Psychic Dogs and Other Mysteries\nby\nJohn Horgan, July 14, 2014\nLink:\nhttp://blogs.scientificamerican.com/cross-check/2014/07/14/scientific-heretic-rupert-sheldrake-on-morphic-fields-psychic-dogs-and-other-mysteries/\n>Morphic resonance is not accepted by the scientific community as a real phenomenon and Sheldrake’s proposals relating to it have been characterized as pseudoscience. Critics cite a lack of evidence for morphic resonance and an inconsistency of the idea with data from genetics and embryology, and also express concern that popular attention from Sheldrake’s books and public appearances undermines the public’s understanding of science\nhttp://en.wikipedia.org/wiki/Rupert_Sheldrake\nIf I am right in my readings, Sheldrake is scientific – at least in many respects – but his theory is wrong.\nThen Sheldrake has clearly abandoned conventional science in favor of magical thinking…\n— — *** — —\nThis week is dedicated to the Brain (the presumed main see for the\nConsciousness) and its nutrition, then I have found interesting the story about Berger,\nthe humanity’s reflective consciousness, the quantum information of our Universe (taking aside\nthe possible/xpected others, if they do exist), etc. …\nBut mastering Quantum Consciousness seem to be (at present)\nvery far from our true scientific abilities.\nYou mentioned Penrose, so…\nI can write few lines about a known book by Penrose.\nI have found the description of Quanglement, alias quantistic information,\nand the parametric conversion for the couple of entangled photons\n(If I am right Sciama [1926-1999] has strongly influenced Roger Penrose, who dedicated his book\n“The Road to Reality” to Sciama’s memory). …\nThat phenomenon happens when a photon (produced by a laser) enters in\na particular crystal (= non linear) and there is a conversion in a couple of photons.\nThis couple of photons is entangled in several ways and the sum of their moments must be equal to\nthe moment of the incident photon and also their polarizations are connected (in EPR manner)…\nPenrose described a phenomenon that happens in a particular experiment…\nand illustrated the transmission of an image through quantistic effects…\nI don’t know where (exactly) this can lead if in the case of the speculations\n(about the origin of the Image on the Shroud) if you also add the concept of\nSuperworld (see for example what was able to sketch prof. Zichichi), etc. …\nA planet in another Galaxy?\nor … In the Paradise?\nor … into the Hell?\nI prefer to observe what is the level of degradation reached in cellulosic chains\n(on material coming from linen fibrils of the experiments, before to touch linen fibrils coming from the TS).\nBut (often) this “simple way” to proceed is disregarded.\nWhy?\n— — —\nBibliographic references:\n– R. Penrose.\n“The Road to Reality. A complete Guide to the Laws of the Universe”, 2004.  \n– “Analysis of degraded papers by non-destructivespectroscopic techniques”,\nby\nMarina Bicchieri, Armida Sodo,\nGiovanna Piantanida and Carlo Coluzza\nJournal of Raman Spectroscopy\nJ. Raman Spectrosc. 2006; 37: 1186–1192\nPublished online in Wiley InterScience\nCopyright @ 2006 John Wiley & Sons,Ltd\nIn that study about the problems of “Scientific approach to cultural heritage conservation”, the AFM (= Atomic Force Microscope) instrument was an assembled SNOM/AFM operating in air (using a quartz fibre probe with a conical tip).\nThe inherent work was based on micron-scale space resolved Raman microscopy, InfraRed reflectance spectroscopy and atomic force microscopy, of differently degraded samples of paper…\nLink:\nhttp://www.google.it/url?url=http://www.researchgate.net/profile/Marina_Bicchieri/publication/227743194_Analysis_of_degraded_papers_by_nondestructive_spectroscopic_techniques/links/0fcfd50b72748806f2000000.pdf&rct=j&frm=1&q=&esrc=s&sa=U&ei=c5cJVbOfHdLOaLivgrAL&ved=0CCUQFjAC&usg=AFQjCNGnBkDn7H2orGv7FdaSle2wAMFxdQ\n— — —\nIn other studies AFM was also reported to be a valuable technique to measure mechanical properties and interactions…\n\n","date":"March 18, 2015 at 10:47 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193686","author":"piero","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"My statement is based upon the work of Nobelist Sir Roger Penrose and Stuart Abramoff.\nTo keep it short, I suggest you see my positing at\n Michael Redux: Quantum mechanics, consciousness and love\nhttp://johnklotz.blogspot.com/2012_08_01_archive.html\nThere is a video that you can review cited. The URL which is in the post is\nhttp://vimeo.com/39982578.\nDo serious scientists dispute their claim. Yes. Do they adhere to it yes.\nHameroff probably goes  further than Penrose in connecting consciousness through the quantum to “paranormal” phenomena.\nThere is link in that post to an October 2007 post. That was before I began to delve more deeply into the quantum.\n\n","date":"March 18, 2015 at 5:10 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193707","author":"John Klotz","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Not really interested in defending Orch-OR… But Tegmark’s approach was mediocre at best. You don’t try to refute a model by creating your own counter model and then dismantling it; which is exactly what he did. Not only that, but his 10-13 calculation was incompatible with the activity that we *do* know exists and which can be measured with an electroencephalogram.\nWhile Orch-OR still has a long way to go, the truth is that the two most parroted arguments against it (impossibility of quantum function in warm temperature and decoherence) have been challenged by people independent of Penrose/Hammeroff. The first by the emerging field of quantum biology, which was non-existent ten years ago, and the second by Bandyopadhyay’s team. There are other objections that have been ignored\n because explaining them is harder that hand waving and saying “the brain is too warm”, but they seem to hold more water than these two.\nOf course, I can’t blame Tegmark. He did try to make an attempt (nevermind how feeble) to challenge an elite name and in the process carve one for himself. On the other hand, despite all his mingling with Chopra, Hammeroff did propose the fMRI treatment for Alzheimer’s that Queensland just got into the media a couple of years ago. So he may be more that just “eccentric” after all.\n\n","date":"March 19, 2015 at 3:31 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193790","author":"Eric","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Our congratulations to Dr. Barrie Schwortz for his exccelent task.\nAs a person with scientific background I could not find any scientific theory that can fit with every aspects of the Shroud Image.-THE SHROUD IMAGE IS UNIQUE.\nAs a Christian the only expanation from a spiritual and theological point of view is tha the Shroud is the living testimony of the Passion and why not say the material proof that something impossible happened in that that dark toumb about 2000 years ago I mean the Ressurection of Christ.\nI’m not ashamed to assume that the image on the Shroud is a miracle granted by God to mankind. (although I cannot state that from a scientific standpoint)\n                                                                             regards\n                                                              Antero de Frias Moreira\n                                                 Centro Português de Sindonologia\n\n","date":"March 16, 2015 at 6:29 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193482","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"I wonder if the reporter mis-heard Barrie Schwortz regarding, “…it was a photograph…” or if it was a typo.\n\n","date":"March 16, 2015 at 6:45 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193485","author":"Julian Stroh","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"It was a typo, otherwise it makes no sense. It was a specious claim that the Shroud was a photograph created by DaVinci that was one factor that caused Barrie to found shroud.com\n\n","date":"March 16, 2015 at 7:04 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193490","author":"John Klotz","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"I’m wondering if the reporter saw the CNN show on the Shroud, assumed that the proto-photograph hypothesis was the most likely explanation, and then thought that he heard Barrie say that it was a photograph.\n\n","date":"March 16, 2015 at 11:15 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193561","author":"Julian Stroh","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Barrie would never say that because the evidence disproves it.\n\n","date":"March 16, 2015 at 7:21 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193492","author":"Andy","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"For me if there is real human blood found on the Shroud it would be a game changer. I don’t believe the evidence shows that now. \nMaybe someone should contact Dr. Henry Lee and ask him if one of his classes would take it on as a class project. I can’t do that right now, but it would be interesting to see what experts in forenic science have to say.\n\n","date":"March 16, 2015 at 6:46 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193486","author":"John Green","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"I forgot this \nhttps://www.facebook.com/UNHDrLee\nhttp://www.henryleeinstitute.com/\n\n","date":"March 16, 2015 at 6:55 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193488","author":"John Green","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"” if there is real human blood found on the Shroud it would be a game changer .” \n Why would it be a game changer ? Anyone could have  put some blood on the shroud in order to make it look more realistic.\n\n","date":"March 16, 2015 at 7:54 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193494","author":"PHPL","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Hi Philippe\nThere is more to it. Have you read about the flow of blood?\n\n","date":"March 16, 2015 at 7:56 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193496","author":"Louis","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Thanks for your comments Louis . My name is  Patrick (not Philippe). \nCordialement.\n\n","date":"March 16, 2015 at 9:26 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193502","author":"PHPL","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Why would they use a human blood? Why not a goat or a sheep or just paint? Do you think he/she/they was thinking, Well I/we can’t do this because 700 years from now they will finds a way to tell if it’s real human blood (or paint for that matter).\n\n","date":"March 16, 2015 at 8:12 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193497","author":"John Green","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Sorry, but I don’t follow your logic.\n\n","date":"March 16, 2015 at 11:18 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193562","author":"PHPL","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"So true.  Right on, Barrie!\n\n","date":"March 16, 2015 at 7:18 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193491","author":"Andy","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Actually it was Ian Wilson who speculated about the Shroud image being a “snapshot” of the Resurrection in his first Shroud book published in 1978. He of course had another idea in mind.\nLeonardo da Vinci had no Hasselblad or Nikon, much less shutter speed.\n\n","date":"March 16, 2015 at 7:54 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193495","author":"Louis","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Louis,\nWilson may have noted the photographic quality of the Shroud but not that it was an actual medieval photograph in the way that others have claimed it be.\nIt was a telephone call from a friend that had seen in a news magazine sold in a supermarket that the Shroud was a photograph created by Leonardo DaVinci that convinced Barrie that he needed to create the web page that became Shroud.com.\nThere is a remembrance of that by Barrie that was published by the BSTS and I do not have the time to dig it out right now. It’s on shroud.com My yellow lab Bogie needs a walking and I have struggling with how to cram a thirteen page paper on Finding Jesus into a web posting and retain its formatting and several great images. \nAnd occasionally actually practice law.\n\n","date":"March 17, 2015 at 6:55 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193595","author":"John Klotz","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Hi John\nThat’s right, and the reason why I said that he had another idea in mind. As an expert in photography Barrie understands the difference between photograph and photographic quality and that led to shroud.com and to this blog and countless websites.\nYour lab Bogie deserves a nice, long walk, whether in Bronx or Fifth Avenue…. You have to show off a lovely dog like him!\n\n","date":"March 20, 2015 at 5:51 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193903","author":"Louis","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"The tapes taken by STURP are the only significant set of samples from the Shroud to exist outside Turin. ( If they do by any chance have the blood of Christ on them they would be ,of course, be  extraordinarily important relics, of equal importance to the Shroud itself.) Even though, as merely the recipients of surface material, they are limited in what they can tell us, I wonder whether they could be made available to a world class laboratory for testing with microscopes that will be vastly more powerful than those of 1978.\nAnyone who has read both McCrone and STURP must come to the conclusion that, at the very least, there is conflicting evidence of whether there were originally pigments on the Shroud surface or not.\nTo ask for further tests is only common sense so long as a representative set of the original 1978 tapes have been properly conserved and not contaminated by inappropriate handling or storage. It is normal for ancient objects to be retested as more sophisticated methods of testing became available.\n\n","date":"March 16, 2015 at 11:12 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193513","author":"Charles Freeman","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Charles\nThings like blood and DNA break down over time. Water and heat causes a faster break down and the Shroud was subject to both so we may never know if it’s human blood.\n\n","date":"March 16, 2015 at 11:21 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193515","author":"John Green","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"John Green. Well let’s just hope that those tapes were given to professionals to conserve. Even though the tests on them were done over thirty- five years ago at least we know how to conserve such materials  and so there should have been no further deterioration since then if they have been taken proper care of. Any museum with a large collection of textiles would have been able to give advice.\nThere would have been serious deterioration of the Shroud before then as there was no proper understanding of conservation and the Shroud was frequently exposed in the open air and seems to have been handled witch bare hands. The problem of knowing what has deteriorated on the Shroud over the centuries is, of course, the key one but is still to be addressed.\n\n","date":"March 16, 2015 at 12:31 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193518","author":"Charles Freeman","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"All of Rogers’ blood tape samples were in Alan Adler’s possession when he died and shortly thereafter, the Adler family packaged all of Adler’s Shroud materials, including the Rogers tape samples, and returned them to the Archdiocese of Turin. When Rogers discovered this, he wrote to the Archdiocese on five different occasions and asked for their return, but he never received any response. Rogers considered them “lost.” Their current status and how they were preserved is unknown.\n\n","date":"March 16, 2015 at 1:42 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193529","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"The trouble with this blog is that people are constantly discovering the wheel or claiming what has been demonstrated hasn’t been demonstrated. The findings of STURP were peer reviewed and published. For, let say, an art historian to cast doubt n those peer reviewed scientific findings without anything but his own in credulousness is an exercise in navel gazing. I believe that Richard Dawkins may have coined the phrase “argument from incredulity” to describe fundamentalists who reject evolution because they can’t believe it. He certainly used it.\nBlood was discovered on the Shroud. One of the processes used was multi-spectral analysis. Initially it was identified as primate blood but further investigation it was determined to be human. As important to its identification as blood were invisible serum halos around the major stains, particularly the spear wound were detected. It would not have been possible or conceivable for a forger to do this without the use of real human blood. Heller asked medieval art experts whether they were aware of any artists who used blood and the universal answer was no. Perhaps Charles could enlighten us as to any medieval artist who used human blood and where we might find EXISTING examples that have survived from Medieval times. The blood on the Shroud exists today. \nMcCrone came up with serial explanations for the “painting” of the blood all of which were conclusively rebutted buy the scientific analysis. This is one of the areas where science and history merge. The conclusions to be drawn have theological impact. It’s a triple header\nIf there are any of the skeptics who refuse give credibility to the peer reviewed findings of STURP and the facts documented by photographs and other scientific devices and not just in their written reports, you’ll excuse me if my patience is exhausted. After Lee’s great blunder at Gettysburg resulted in the Confederate debacle of Picket’s charge he was heard to lament, Too Bad, Oh too bad!\nGod forgive me but my response to the pseudo-skeptics who populate this site is “Too f*** bad.” Now I have to make a Novena. Anyone know the Catholic joke about making a novena. It’s language is pristine.\n\n","date":"March 16, 2015 at 2:06 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193530","author":"John Klotz","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Let’s hope the Turin authorities do keep them in proper conservation conditions. Adler’s family was quite correct to return them as in case of further scientific  analysis everything needs to be in the same place, not scattered around the world, so that proper comparisons can be made between the materials that were once on the Shroud and those that still remain there. It beggars belief that no one thought of this at the time. For obvious reasons it is not acceptable  academic practice to scatter around pieces of an ancient object without insisting that they must be properly conserved and can be reunited with the original from which they were taken. I have every right to be frustrated with what appears to have happened with the scattering of evidence as anyone else studying the Shroud.\nI assume John would rule out any further tests on the tapes wherever they may be on the grounds that science has not advanced since 1978 so there is no point in having a new analysis of the tapes.\nJohn. While a professor of physiology who read for me all the papers I could find on the STURP blood findings declared them totally unconvincing, anyone who has read Caroline Walker Bynum’s Wonderful Blood will know the fascination with blood relics in the fourteenth century. There was a lot of Christ’s blood around, some of it dried, some liquid, many with stories of who collected it- Mary Magdalene was a favourite.\nSome of it fell from consecrated hosts (e.g. The Bolsena miracle) and under the  doctrine of transubstantiation was, of course, authentic, the real blood of Christ. To rule out the possibility that blood was added to the Shroud, either in the belief that it was the real blood of Christ, or to make it more awesome, is wrong.\nHowever as an expert in criminal investigations who had seen dried blood over thirty-five years told me when looking at close-ups of e blood stains. ‘ I can tell you for certain that that is not dried blood’ and when I asked him whether the blood of a terrified man differed from that of anyone else, he said that he had seen many blood stains from murdered bodies and there was no distinction.\nI may only be a historian who is a specialist in relic cults but I do at least seek independent expertise in areas that I have no specialist knowledge in and it would seem that the experts are not convinced by the STURP findings. But that is their expertise, not mine, which is more to do with the actual blood cults on which I have written a chapter in my relics book.\n\n","date":"March 16, 2015 at 2:40 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193531","author":"Charles Freeman","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Am I the only one sick and tired of Charles referring to the opinions of so called experts without them being named/quoted?\nit means jack,  Chuck,  jack\n\n","date":"March 17, 2015 at 2:34 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193579","author":"Thomas","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"P.S. Excuse my own frustration. I believe that the Shroud was made in the fourteenth century and is probably the only survivor of the Quem Queritis Easter ceremony. As such, quite beyond its spiritual significance ,I believe that it is very valuable as a lone survivor from what was once an important medieval liturgy and the birth of medieval drama. So it is saddening to think of  bits and pieces of it having been taken off and lost either in Turin or in the US. It deserves veneration in its own right.\nHowever, if it is authentic then each and every part of it has,under the Catholic doctrine of relics, established as early as the fourth century, the same power as the rest ( which is why you can cut up  saints’ bodies). So those tapes have for Catholics an immense importance, equal to that of the Shroud itself. I am surprised that you have not had Catholics who believe that the Shroud is authentic trying to get hold of them for their own churches. Perhaps you have- I recollect Joe Marino saying somewhere that he though he had a piece from the Shroud.\n\n","date":"March 16, 2015 at 3:03 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193532","author":"Charles Freeman","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"I fear that the mere invocation of experts is insufficient to make any argument on this site convincing. Although I understand that Charles’s expert “can tell you for certain that that is not dried blood” I would rather he explained in detail why he disagrees with Heller and Adler, whose alternative conclusion (“The presence of whole blood was established by detection of heme derivatives, bile pigments, and proteins”) is supported by a detailed description of their tests. They may be completely wrong, but the mere say-so of a pathologist is not enough to demonstrate that. On this site, we want to know why.\nMeanwhile, may I recommend “A Liquid History. Blood and Animation in Medieval Art”, which can be found on academia.edu.\n\n","date":"March 16, 2015 at 3:59 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193535","author":"Hugh Farey","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Well the professor of physiology did read their papers in detail! and  I doubt whether Adler or Heller had thirty- five years of experience with bloodstains.\nWhat matters in the end is getting a mass of evidence from different disciplines that coheres to give a convincing narrative for the origin of the Shroud. As STURP and its followers freely admit they themselves have not got such a narrative as they cannot provide any interpretation of the images nor have they any sustainable evidence that dates the Shroud earlier than the medieval period. So the way is open for others to  make their own narrative as I have done with my History Today article.\nWho will decide who has the best case? In the end it may be for instance, someone who is an expert in ancient and medieval weaves who can tell definitively that the Shroud was woven on a loom not known before 100O AD. It may be a specialist in medieval painted linens who can find comparative examples of linens whose images have disintegrated leaving shadows very similar to those in the Shroud. It may be an expert on medieval iconography who concentrates on the all- over scourge marks and sees parallels with other fourteenth century examples.\nSTURP and their supporters are just as entitled to seek expert opinion as I am but they seem to stay within a 1978 context as if there were no contemporary experts in these issues around or as if science had stood still. This has never been the way that knowledge progresses.\n\n","date":"March 16, 2015 at 4:46 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193537","author":"Charles Freeman","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Charles wrote “I recollect Joe Marino saying somewhere that he thought he had a piece from the Shroud.”  The very minute piece I had came with a certificate that gave the impression that it was from the Shroud but both Adler and Jackson looked at under the microscope and determined it was not 3-1 herringbone twill..\n\n","date":"March 16, 2015 at 5:34 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193540","author":"Joe Marino","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"It’s interesting Joe. Maybe it was from some other purported burial cloths. Remember, in Constantinople there were three alleged burial cloths of Jesus, as I have shown here: https://shroudstory.com/2014/05/11/the-three-byzantine-burial-cloths-of-jesus/ \nMaybe it was a piece of one of them -and there is still a chance that this may be authentic piece of Jesus other burial cloths (even if not coming from the Shroud of Turin)…\n\n","date":"March 16, 2015 at 6:16 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193543","author":"O.K.","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"John Klotz wrote: “Blood was discovered on the Shroud. One of the processes used was multi-spectral analysis. Initially it was identified as primate blood but further investigation it was determined to be human.”\nRemind me again what specific experiments conclusively determined the blood was human.\n\n","date":"March 16, 2015 at 6:21 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193546","author":"Kelly Kearse","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Several of the comments raised by correspondents are covered in a 2002 paper, “SCIENTIFIC METHOD APPLIED TO THE SHROUD OF TURIN: A REVIEW” By Raymond N. Rogers and Anna Arnoldi, and which can be found at: http://www.shroud.com/pdfs/rogers2.pdf     \n1)A detailed outline of the Scientific Method when applied to Shroud Studies, p.1; \n2)Effect of 1532 fire on paint products:  Hematite expected, heating tests had shown that hematite was reduced to magnetite, no such effect observed on Shroud; Tests had shown that all paint materials were changed by heat and pyrolysis products, some becoming water soluble, and would have diffused through the cloth,  1978 observations showed that nothing had moved with the water to douse the fire, p.4.  My conclusion – if the image had ever been painted, there was no sign of any paint residues in 1532. \n3)“Bands of different-colored yarn can be observed in the weave of the cloth (figure 3). Where darker bands intersect image areas, the image is darker. This proves that the image color is not solely a result of reactions in the cellulose of the linen. Something on the surface of the different batches of yarn produced color and/or accelerated color formation. The observations of bands of color agree with historical reports on the methods used to produce ancient linen. They indicate a very mild bleaching technique, unlike that used after the last crusade in AD 1291” – p.5.  Observation would imply that manufacture of cloth predates 1291.  \n4)“The warp of ancient linen was protected with starch during weaving and the finished cloth was washed in Saponaria officinalis suds. Saponaria is hemolytic, which could explain why the old blood stains on the cloth are still red. Diane Soran (deceased) of Los Alamos, tested hemolysis on Saponaria-washed cloth before we went to Turin. The blood is still red on those 25-year-old samples. Controls are black.” – p.5.  Explanation of why blood stains have retained their red color. \n5)“Saponaria is toxic, and it is a potent preservative. A textile conservator told us that old cloths tend to be better preserved than newer ones. Comparison samples loaned to us by the amazing Museum of Egyptology in Turin were still supple, and several dated to several thousand years BC” – pp 5-6.  Charles F has noted that no other examples of Quem Quaeritis artefacts are known to survive.  Presumably they all post-date the abandonment of the saponaria method. \n6)Image color does not appear under the blood-stains, resides only on the surface of the fibres, could be decolorized with diimide, leaving colorless cellulose fibres – p.7. \n7)Image not produced by scorch, nor by radiation, other methods also excluded – pp 8-12. \n8)Discussion of 1988 Radiocarbon date, Raes samples, cotton content, varying lignin, – pp 12-16.  \n9)Extensive discussion on contaminants observed on Raes samples, encrustations, dyes and lakes, gums, splicing, with several micrographs; – pp 17-23. \n10)“Conclusion on the association between the radiocarbon date and the time at which the Shroud was produced: The combined evidence from chemistry, cotton content, technology, photography, and residual lignin proves that the material of the main part of the Shroud is significantly different from the radiocarbon sampling area. The validity of the radiocarbon sample must be questioned with regard to dating the production of the main part of the cloth. A rigorous application of Scientific Method would demand a confirmation of the date with a better selection of samples.” – pp 23-24. \n11)Various other related discussion – pp 24-29;  “A logical hypothesis for image formation must accept the laws of physics and chemistry and explain all of the STURP observations, as follows:- [A list of 13 points of observations follow].  “The requirements make it apparent that no single, simple hypothesis will be adequate to explain all of the observations made on the Shroud”.  – pp 29-30. \n12)Discussion of Maillard reaction hypothesis, including ammonia test on Edgerton linen – pp 31-37.\n\n","date":"March 16, 2015 at 10:34 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193558","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"I am only replying to the mention of my name. In his review of Mark Antonacci’s The Resurrection of the Shroud, (2001) Rogers says that there was little evidence of any Saponaria on the Shroud. In any case Saponaria (soapwort) is used to this day as a cleansing agent so if there was any originally on the Shroud it could have been applied at any time.\nMost medieval textiles have disappeared from natural causes or deliberate destruction. It was never because they abandoned using Saponaria or we would have examples of earlier survivals when it was used. The Egyptian survivals result from the unique arid climate of Egypt.\nJust because there are mentions of it in Pliny’s Natural History and in the works of Greek writers means nothing as it was precisely these works that were used as manuals In the Middle Ages.\nSo let’s find the Saponaria first before speculating further.\n\n","date":"March 17, 2015 at 1:25 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193571","author":"Charles Freeman","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"The mantra “peer reviewed = true” is one of the most absurd sindonist  mantras. Therefore, the simple fact that Adler and Heller have published an article in a review is not a warranty of the truth of its content. \nAdler and Heller’s methods were never replicated by independent researchers in Archaeometry and forensic science. Validity of a method depends of its contrast by successive experiences. \nAdler and Heller’s diagrams have been contested in this forum and elsewhere by some experts. \nAdler and Heller’s conclusions have some important holes, such as the red colour of the Turin blood. \nBaima Bollone’s asserts are similar but worse. If I remember well he never presented his enquiries in a formal scientific way and some of his conclusions (blood type) are contradicted by similar experiences of reputed sindonists as Rogers. \nFor these and other reasons you can say that there is not a formal evidence of the nature of the red stains of the Shroud.\n\n","date":"March 17, 2015 at 2:32 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193578","author":"David Mo","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Yes but being published in a peer reviewed journal is a good start, if not bullet proof.\nBetter than the anonymous views of Charles’ so called experts\n\n","date":"March 17, 2015 at 2:39 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193580","author":"Thomas","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Rogers’s paper quoted by daveb above contains too many inconsistencies to be acceptable at face value, and it would be so useful if somebody who followed his work closely could explain them. To take a couple:\n1) (from daveb above) “Effect of 1532 fire on paint products: Hematite expected, heating tests had shown that hematite was reduced to magnetite, no such effect observed on Shroud.” Rogers’s experiments, and the accompanying photos, show a piece of linen sandwiched between two steel plates and heated at the centre. I would like to know whereabouts, on the cloth, the hematite was reduced to magnetite, and whether there were concomittant effects on the cloth at the same point. Presumably there was some gradient. Rogers says that, “all paints were changed by heat and/or the chemically reducing and reactive pyrolysis products (formaldehyde, furfural, organic acids, CO, etc.). Some Medieval painting materials become water soluble and they would have moved with the water that diffused through parts of the cloth at the time of the AD 1532 fire. Observations of the Shroud in 1978 showed that nothing in the image moved with the water.” But he does not say what temperatures are needed to achieve these effects, and whether those temperatures also cause any discolouration of linen fibres. The temperature gradient is very important. Either there was one, in which case we would expect different effects on different parts of he Shroud, or there wasn’t, in which case we would observe uniform effects.\n2) (from Rogers’ paper) Compare Figures 3 and 18. They are both claimed to be UV images but are completely different. Figure 18 shows that the Holland cloth fluoresces (if it is fluorescence) intensely at the place from which the Raes sample was taken, but not elsewhere, but Rogers does not account for this. Being covered with the Shroud would have had minimal effect on the oxygenation or temperature of that area compared to the rest.\n3) (from Rogers’ paper)  “Diane Soran (deceased) of Los Alamos, tested hemolysis on Saponaria-washed cloth before we went to Turin. The blood is still red on those 25-year-old samples. Controls are black.” I have grown Saponaria, produced soap from it and soaked cloths in it. It has had no effect on the preservation of blood colour. It is a pity that in a heavily illustrated paper Diane Soran’s experiments could not be shown.\nI mention these not to prove that Rogers was a poor scientist, agenda driven (neither of which I believe) or even wrong, but merely to show that even the most careful of papers can have inconsistencies and anomalies which it is not rude or arrogant to want cleared up before being accepted as gospel.\n\n","date":"March 17, 2015 at 3:21 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193581","author":"Hugh Farey","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"A significant question is: “To whom was the paper by Rogers & Arnoldi directed at?”  To other chemists? Unlikely!  To non-involved scientists in other fields?  Only maybe!  For the benefit of his non-chemistry STURP colleagues?  Very possibly!  For the benefit of adequately informed persons interested in the Shroud, who might have some broad understanding of science?  Most likely! \nI am not a chemist.  I am a retired civil engineer, who succeeded in passing his necessary Chemistry Intermediate quallification, so that I might have some practical use for the subject in such fields as industrial painting technology, and materials engineering.  Nevertheless I find much of Roger’s general writing so chemistry dense, that I often find him a difficult read which I can seldom manage to persevere with.  By way of contrast I found the 2002 paper by Rogers and his co-author, a welcome and informing relief.  I did not find it inconsistent, perhaps some minor errors and omissions of little consequence – the man is human.  Despite its 30 pages, I did not have to baffled by a welter of over-whelming and unnecessarily insignificant technical detail. \nSo Hugh Farey might carp and nit-pick that the full details of the pre-tests of the pyrolysis effects on medieval paints are not included.  It is sufficient for me that a chemist of Rogers’ competence reports that he carried out such tests, but found no evidence of pyrolytic paint products on the Shroud.  Nor, if one excepts the loose cannon McCrone, did any other member of the STURP team.  That has to be significant, in that there were no detectable pyrolytic paint residues remaining as the result of the 1532 fire. I see it as dealing a death blow to the Quem Quaeritis hypothesis.  If the image was painted say in the 13th century for this purpose, then there ought to have been sufficient paint residues remaining in 1532 to have been affected by the fire and so be detectable in 1978. But there were not!\nRogers noted that saponaria is highly reactive, and gives some comprehensive details on this matter.  The banding persuaded him that the weave was of ancient manufacture, involving saponaria.  The superficiality of the image, persuaded him that the image resided on the coating, and this was reinforced by the fact that the image could be decolorised leaving intact cellulose fibres at the surface.  A colleague Diane Soran is reported as having shown that haemolysis products remain red when affected by saponaria, and this effect persisted.  Hugh Farey was unable to replicate this result, so perhaps he was using the wrong recipe. \nRogers also gave considerable attention to the detailed reasons why the 1988 radiocarbon sample was anomalous and therefore unrepresentative of the whole.  Nevertheless despite demonstrating this fact, Hugh Farey credulously maintains without good reason that the dating should stand.  \nIt certainly seems curious that if the Shroud is a sample of the Quem Quaeritis cloths, that it should be the only one to survive, and the likely conclusion would have to be that it is not one such, but dates from a much earlier period when cloth manufacture produced more durable linen. \nThe testy agnostic chemist Raymond Rogers could believe that the Shroud wrapped a crucified human body dating from ancient times.  The agnostic anatomist Yves De Lage believed that it wrapped the body of Jesus Christ.  The initially skeptical Orthodox Jew Barrie Schwortz is convinced that it is the burial cloth of Jesus of Nazareth.  But the Catholic science teacher, editor of the BSTS newsletter, cannot believe that his Lord and Master has left him the tangible material means by which he may advocate the reality and truth of His death and resurrection.\n\n","date":"March 17, 2015 at 3:35 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193632","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"… but considers it as no more than a toy for his intellectual recreation and amusement, content to give to dogs that which is sacred [Matt 6:7]\n\n","date":"March 17, 2015 at 4:53 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193640","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"I think that’s fair enough. “I know nothing about science, so I’m prepared to accept the authority of someone who does,” is a reasonable attitude. I, on the other other hand, understand enough of Rogers’s paper to find it scattered with inconsistencies of sufficient weight to cast doubt on many of his conclusions. I think that’s fair enough too.\nWhat is not fair, if I may cavill for a moment, is bickering like this: “Nevertheless despite demonstrating this fact, Hugh Farey credulously maintains without good reason that the dating should stand.” You may not agree with my demonstrations, but to deny that I have argued them, consistently, with evidence, more or since since my first posting on this site, is simply petty.\nSo is this, if I may say so: “But the Catholic science teacher, editor of the BSTS newsletter, cannot believe that his Lord and Master has left him the tangible material means by which he may advocate the reality and truth of His death and resurrection.” \nBut never mind. I agree with this: “It certainly seems curious that if the Shroud is a sample of the Quem Quaeritis cloths, that it should be the only one to survive.” I believe this to be a major objection to the Quem Quaeritis hypothesis, and there are several others, many of which I have clearly set out on this site. There are objections to the stability of the C14 dating, and there is some evidence in favour of both a 1st century date and a Middle Eastern provenance, which I have also acknowledged in detail.\nOn balance, as I have said and explained why, before, I believe that the Shroud is medieval, and for this conclusion I have been personally abused by most of the authenticists who comment on this site. I, on the other hand, quite understand why they have come to a contrary opinion, and sincerely wish them well in their efforts to substantiate their view. I believe that this attitude makes me a particularly good choice as editor of a Shroud newsletter, and hope that I may maintain the BSTS’s editorial impartiality for as long as required.\nBless us all.\n\n","date":"March 17, 2015 at 5:20 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193643","author":"Hugh Farey","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"perhaps some of us need to step back here and look at  ourselves, if we call ourselves good Catholics who follow Jesus’s way to love others…rather than being bitter and nasty\nCome on guys it’s Lent…\nAnd faith can and should stand without any need of the Shroud\nGood on you Hugh, you hold your views and that’s your God-given right\n\n","date":"March 17, 2015 at 7:18 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193645","author":"Thomas","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Part of it may be due to differences in vocational temperament.  It seems to be in the nature of the scientist that he is willing to take forever in coming to the truth, developing his hypotheses, testing them, revising, retesting, and so on.  The engineer never has that luxury.  He needs to come to a decision, no matter how difficult or intractable the problem, on time, inevitably a solution which he knows will at least satisfy.  He may take the advice of experts, and depending on his assessment of their reliability will factor in margins of safety. \nRogers does it for me, no matter how imperfect his work may be.regarded by purists, and at present he is the best that I can see.  His work is one among many other reasons that I regard the Shroud as the authentic burial cloth of Christ, and as such I consider it is the most precious relic we have of Him.  Most certainly it is potentially that, and so should be approached with proper reverence by the faithful.  It cannot be regarded as a mere toy for the mere purpose of a mental exercise.  \nJesus was no stranger to righteous anger, and I make little apology if I occasionally show a similar zeal in my comments. \nA Wellington man has just been sentenced to two and a half years jail for insulting the Buddha in Myanmar, despite his apologies to the judge.  His crime was merely for depicting a psychedelic Buddha wearing headphones, as part of an advertisement for his downtown bar.  In Burma, those who insult any religion may face up to two years jail, plus another two years if it is in writing.  \nDespite what one might think of any drawbacks of the Burmese military regime, they apparently still retain some sympathy for others’ religious sensitivities, a value utterly lacking in the once-Christian West.  Or to paraphrase Pope Francis “Je ne suis pas Charlie!”\n\n","date":"March 18, 2015 at 4:58 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193673","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"For me the Shroud is deserving of veneration  for several reasons\nIt was originally created for a spiritual reason- to commemorate the Resurrection of Christ at Easter and was the central focus of worship in the Quem Queritis ceremony during which it was carried in procession and laid on the altar,\nIt has attracted veneration for almost seven hundred years and this gives it spiritual aura and,as the Church has stated, it is a symbol of the Passion of Christ and deserves respect as such.\nFor those interested in the birth of medieval drama it may be a lone survivor of the re-enactment of  Easter morning, the forerunner of the Passion Plays and thus of great importance for this reason.\nI remain frustrated by those who claim it was a deliberate fake. Who would have been taken in by a cloth with images on it?\n\n","date":"March 18, 2015 at 7:48 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193683","author":"Charles Freeman","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"But Thomas is perfectly correct. Opinions by themselves count for very little.I wish Charles could entice his contacts to open up a little, even if anonymously. It is not their authority we care about, but the observations that lead them to their conclusions.\n\n","date":"March 17, 2015 at 3:24 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193582","author":"Hugh Farey","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"I seek out experts to reassure myself that I am on firm ground on specific issues before, in my case, publishing my own articles. These are informal contacts but In these cases are highly regarded people. My article in H T is open to refutation as a public paper but HT tell me that they have had lots of hits, that it was among the most  hit articles of the year but they had virtually no hostile responses. I have had some very positive responses from medievists with supportive material I might be able to use publicly in future work with full accreditation to this who support my interpretations.\n\n","date":"March 17, 2015 at 5:31 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193588","author":"Charles Freeman","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Charles,\nYour personal reassurance isn’t an issue. I suspect you are very self-assured (or deluded) as the case may be. No where in any place or position that I can think of it is anyone going to make a decision based upon your personal reassurance when on the other side of the scale are thousands of hours of documented, publicly available research and apparently none of your reassuring experts have the confidence to place their names on their advice.\nIn law, we have what’s called a “curbstone opinion.” A lawyer comments on something gratuitously and is free to say what he thinks because the individual is not a client. In law, a curbstone opinion is worthless. A person who relies on a curbstone opinion can in some circumstances end-up in jail.\nAn expert who will not place his name or reasoning in the public arena so that it may be weighed and evaluated  is essentially doing the same thing: giving a curbstone opinion, and as with lawyers the opinion is essentially worthless.\nYou have no idea how little personal assurance from anonymous experts means so little to the mass of humanity or any identifiable fraction thereof.\nOr to quote a commercial for a hamburger chain in the US some years ago:  “Where’s the beef?”\n\n","date":"March 17, 2015 at 6:08 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193591","author":"John Klotz","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"John – you talk as if the academic community as a whole believes in the authenticity of the the Shroud. So long as the 1978 tests cannot be replicated and the evidence is not provided by STURP or their representatives for it to be replicated, these tests have almost no scientific validity and are quickly dismissed by those who take the bother to read them.\nMy focus is on convincing the academic community that there are alternative ways of looking at the Shroud. I have begin the process with my HT article and the feedback has been good. So far I have had no serious opposition to my ideas and some good support for them so that eventually I hope to be able to work up another article. However, it will be specialists in areas of weaving, iconography, painting on linen who will be the ultimate judges of whether I am relight or not.\n\n","date":"March 17, 2015 at 7:52 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193597","author":"Charles Freeman","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"I think we have got a little further than the “my expert is better than your expert” kind of argument.\n1) Heller and Adler say that they dissolved suspected blood particles in 97% hydrazine and it fluoresced red under long wave UV. They think this is indicative of the presence of methemoglobin. \n2) Heller and Adler say that when suspected blood particles were microspotted with a thin layer of hydrazine they slowly dissolve and the solution turns pink. They think this is indicative of the presence of hemochromagen.\n3) Heller and Adler say that when suspected blood particles are treated with 1M Ammonium hydroxide solution saturated with KCN, a colour characteristic of cyanmethemoglobin slowly develops on the surface. They think this is indicative of the presence of cyanmethemoglobin.\nFor each of these, does your expert think:\na) Heller and Adler did not carry out the test or observe the results they claimed.\nb) They did carry out the test but the observed results do not indicate the presence of the chemical quoted.\nc) The observed results do indicate the presence of the chemical quoted, but that chemical is  not an indicator of the presence of blood.\nd) The results do indicate the presence of blood, but the test can indicate other non-blood related chemicals as well.\ne) Other?\n\n","date":"March 17, 2015 at 8:12 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193599","author":"Hugh Farey","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"The main reason that I call on experts is that I don’t make a fool of myself particularly when talking of scientific issues. I have a professional reputation to defend, it has taken me years to build up and I am not going to risk it by publishing anything that will be ridiculed within the academic community, university presses and others who pay me money for my ‘expertise’.\nSo writing on the Shroud, I made sure that I had a respectable journal but one where my article would be widely read, as it has been. I knew I could rely on HT to check it out for themselves but I had the whole read by an Oxford professor in medieval Christianity to make sure that it was academically respectable.\nI was warned that I might get hostile feedback from Shroudies for the article but the editor tells me that there has been virtually none. I have had one single letter forwarded to me unopened by HT and it was simply the face of the Shroud with a written caption offering me blessings. Instead I have had responses from many academics who have been supportive and I would be able to use material from some of them in future articles.\nAs to blood, I have made it clear here that it would not surprise me in the least if there were blood human or otherwise on the Shroud. From the thirteenth century onwards there was a much greater emphasis on the sufferings of Christ and these were shown in various ways, by showing the Crown of Thorns still in place not only on the Cross but also in the deposition and burial, by emphasising blood stains and showing blood flowing along the arms, and by emphasising scourge  marks that covered the whole of Christ’s body. As often happened, many people jumped on the bandwagon and began producing relics of the blood of Christ, some of which were enormously popular. So it was that the monastery at Hailes was able to build their major building on the proceeds. So there was a lot of ‘Christ’s blood’ around and one would not be surprised to find some blood added to the Shroud.\nI had the following checked out :\n1) the tests for blood at the forensic laboratory at Modena. The tests done there should have shown up human blood if there had been any but they did not. Apparently it would be extraordinary but not totally impossible for the laboratory to have missed it.\n2) the articles by Heller and Adler and other supporting articles I could track down. These were read by a professor emeritus in physiology and were found totally unconvincing. For me this is quite sufficient and the fact that no one has taken the tapes and replicated the tests backs up his opinion. The professor noted that they probably mistook animal proteins. He offered to pass on the papers to a haematologist but could not believe there would be a difference of opinion.\n3) the same professor remarked that this was too red for dried blood and this has been confirmed by someone who has dealt over many years with bloodstains.\nI am quite happy on the basis of this to risk my reputation in the academic community within which I work by saying that, while human blood on the Shroud would hardly be surprising in the fourteenth century, no significant replicated evidence has been found to support that there was.  I shall just have to live with the contrary opinion of the lawyer John Klotz and I will try not to lose sleep over it.\n\n","date":"March 17, 2015 at 12:09 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193614","author":"Charles Freeman","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"“while human blood on the Shroud would hardly be surprising in the fourteenth century, no significant replicated evidence has been found to support that there was.”\nThat’s another minor detail that piques my curiosity. If blood was added to the Shroud in the medieval era, why is it so degraded that we can only claim, with some certainty, that it is primate blood? I would expect the blood, if it is ‘only’ 600 years old, to still be more useful forensically. Perhaps Dr. Kearse can provide some insight on that question.\n\n","date":"March 17, 2015 at 12:36 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193616","author":"David Goulet","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"David Goulet wrote: “while human blood on the Shroud would hardly be surprising in the fourteenth century, no significant replicated evidence has been found to support that there was.”\nThat’s another minor detail that piques my curiosity. If blood was added to the Shroud in the medieval era, why is it so degraded that we can only claim, with some certainty, that it is primate blood? I would expect the blood, if it is ‘only’ 600 years old, to still be more useful forensically. Perhaps Dr. Kearse can provide some insight on that question.\nHi David,\nMy comments:\n1. The main issue regarding the primate vs. human issue is not related to the relative age of the blood older: 2,000 yrs. versus relatively newer-600 yrs. blood. Rather, it stems from the fact that the antibodies in use at the time were not capable of distinguishing human blood versus that of closely related non-human primates.  This would have been the case even if freshly drawn samples were evaluated.  Monoclonal antibodies that effectively distinguish human blood from closely related primate blood were only recently developed (2010).  \nThe likelihood of a forger using non-human primate blood versus human blood?  I’ll leave that to others to speculate.  I don’t believe it should conclusively be referred to as “human” without scientific clarification-it stretches the data past where it should go.  Adler was well aware of cross-reactivity and was cautious in his interpretation.  \n2. It remains to be determined if blood from species other than primate/human might also be present-this is a blind spot in the previous studies.  The one exception is rabbit blood, which serendipitously, due to the experimental design used secondary anti-rabbit antibodies  in the system.\n3. It’s easy to write it off as not being blood when you’re willing to ignore certain data-how does one explain the immunological detection of blood constituents: hemoglobin, albumin, immunoglobulin?  These are signature proteins for detection of blood components.  Such studies are apart from the chemical & spectroscopic data, but of course, others will simply say all of these tests were botched or misinterpreted.  Every single one of them: botched!  By different investigators, still botched!  \n4. “The stains don’t look like bloodstains should”  Even many rabid-authenticists would agree.  The premise of any such argument fails to take into account the effect a treated textile might have on bloodstain appearance. This is an important consideration.\nAnyone who is interested in finding more information on the studies of the bloodstains of the Shroud must be willing to consider all of the data.  It can require some digging.  And the willingness to translate manuscripts/proceedings/book chapters from other languages, such as Italian, even if it requires typing much of this in by hand. And corresponding with someone who is fluent in the language.  But you have to consider all of it.  Chemical studies.  Spectroscopy studies.  Immunological studies.\n\n","date":"March 17, 2015 at 5:12 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193642","author":"Kelly Kearse","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Thanks for the  Blood 101 lesson. Very helpful. Is there a way to test/discern age of blood stains? Does blood degrade at a known rate? Simply put, is there any modern test to establish if the blood on the Shroud is older than 600 yrs?\n\n","date":"March 17, 2015 at 7:40 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193648","author":"David Goulet","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"David Goulet wrote: “Thanks for the Blood 101 lesson. Very helpful. Is there a way to test/discern age of blood stains? Does blood degrade at a known rate? Simply put, is there any modern test to establish if the blood on the Shroud is older than 600 yrs?”\nAs far as I am aware, in this age range, C-14 dating would be the best for this, but I am unsure how much sample would be required-would guess much more than just a few threads\n\n","date":"March 17, 2015 at 8:23 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193652","author":"Kelly Kearse","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Here is the last incredible claim of Lombatti:\nLa parola fine al dibattito sulla Sindone.\nÈ stata scritta da Andrea Nicolotti.\nSpietata la sua analisi documentale. Inappellabile il giudizio che la storia dà di questa reliquia medievale e fraudolenta. Il suo ultimo libro è uscito in questi giorni. Ma da gustare c’è anche la recensione che ha scritto Paolo Mieli sul Corriere della Sera. Buona lettura. (metto qui anche l’originale, non si sa mail che il link sparisca tra qualche tempo)\nLink:\nhttp://www.antoniolombatti.it/B/Blog01-15/Voci/2015/3/17_La_parola_fine_allautenticita_sulla_Sindone.html\nRough translation:\n“An end to the debate on Holy Shroud was written by Andrea Nicolotti.\n is fierce his documentary analysis. Unappealable judgment that history gives this medieval relic and fraudulent.\n His latest book is released these days. But there is also enjoyed by the review that Paolo Mieli wrote in the Corriere della Sera. Happy reading.”\n (I put here even the original, do not know that the email link disappear in some time)\n— —\nSo…\nWhat is your reaction in front of that claim?\n\n","date":"March 18, 2015 at 10:58 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193687","author":"piero","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"… And in a very short “insert” placed in the article (published yesterday in the newspaper “Corriere della Sera”) by Paolo Mieli also appears the caption on the Pope Achille Ratti (1857-1939) who was elected Pope in 1922 under the name of Pius XI (and who also wrote an encyclical against Nazism … ).\n After noting that under his pontificate was resolved the Roman Question, with the Lateran Treaty of 1929; it is emphasized that he was among the most enthusiastic supporters of the cult of the Shroud of Turin, which he called “a still mysterious object, but certainly not that of men”…\nSo one might also ask:\nBut what he wanted to attack in that article? …\n\n","date":"March 18, 2015 at 11:16 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193691","author":"piero","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Piero,\nDid the article mention that as a young priest Pious XI climbed the Alps with Paul Vignon who was the “father” of Shroud Silence. Vignon was the first to apply scientific principles to Pia’s photographs. He published a book in 1902 which was translated into English. Among other things he found the image was created by some kind of action at a distance although his theory of a “vapor graph” has been largely discounted.\n\n","date":"March 18, 2015 at 11:49 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193692","author":"John Klotz","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"I’ve read the first intervention about the topic “Vignon”, then I must speak… because I do not think\nyou have well understood the true meaning of my question about Vignon …\nIn fact I knew who was the famous Vignon!\nI think you can understand the meaning of my question about Vignon only if you are able to read the whole article by Paolo Mieli (but, now, I do not have a translation).\nIn fact, he argues that the interest of Shroudies (fans of the Shroud) emerged with the exhibition of 1973 …\nMieli also indicates the work of the Committee of Cardinal Pellegrino without questioning what really had done at that time, without making a comparison with the subsequent analyses (for example: the discoveries of Professor. PL BaimaBollone … until the three datings by prof. Fanti).\nHowever the gist of Mieli is the paradox of the Shroud: the Church in the Middle Ages it limited the cult which was later revived by the Savoy. Another important point is the thousand-year silence on the relic.\nShort Chronology :\n1969 – (16 – 18 June) Cardinal Michele Pellegrino appointed a Commission of experts to examine the Shroud. During this private showing the Shroud was photographed again (also in colour), this time by Giovanni Battista Judica Cordiglia.\n1973 – (23 November) The first television exposition took place\n— — —\nSurfing the Web I have also found:\nZwinglius Redivivus    =  Speaking of Things Bible Related You Already Knew (Unless You’re Ignorant or Insane)…\nLink:\nhttps://zwingliusredivivus.wordpress.com/2015/03/17/speaking-of-things-bible-related-you-already-knew-unless-youre-ignorant-or-insane/\n\n","date":"March 19, 2015 at 7:59 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193752","author":"piero","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Vignon: it was an irony!\n … So my question on Vignon was placed in an ironic way, because the journalist (and expert on History) Mieli seemed to have completely ignored this aspect of the intricate “question Shroud”.\n Unfortunately I was in a hurry and I could not write well stating this meaning …\nBut, now, I hope that is well explained.\n— — — —\nInstead “Zwinglius Redivivus” has been quoted only to indicate what is the result of the spreading about gossips/rumors, or false or inaccurate writings…\n— — —\nTowards the end of its two pages appeared March 17, 2015 (“BBC”), the well-known journalist Paolo Mieli went to pull out the not so original objection (which dealt with the thousand and more years of silence), the biblical scholar Joseph Blinzler that, I believe, died in 1970.\nIt seems to me that no one seemed to have first memory of this biblical scholar …\nSo: why not put it in comparison to all other biblical scholars?\n… Obviously Mieli is not (to my knowledge) a biblical scholar and therefore not obliged to make such a job of comparison …\nNext, as regards the recognitions of 1973 does not seem to me that Mieli is accurate in his record.\nThat is, there is little detail (… always remembering that: “devil is in the details”) about the analyses conducted and what really produced the Commission of Cardinal Pellegrino …\nAnd on that old analytical material you could calmly discuss, without forgetting that there are now solving techniques (ATR-FTIR, AFM, CFM and [perhaps] TERS-AFM) at the disposal of all highly qualified laboratory. The rational use of those techniques would solve definitely the long “controversy” …\n— — —\n>Direct examination of the Shroud by scientific means began in 1969-73 with the appointment of an 11-member Turin Commission (1976) to advise on the preservation of the relic and on specific testing which might be undertaken. Five of its members were scientists, and preliminary studies of samples of the cloth were conducted by them in 1973.\n>McCrone’s claims have been convincingly refuted in several STURP technical reports (Pellicori and Evans 1980:42; Pellicori 1980:1918; Heller and Adler 1981:91-94; Schwalbe and Rogers 1982:11-24). The results of previous work by the Italian commission also run totally counter to those claims (Filogamo and Zina 1976:35-37; Brandone and Borroni 1978:205-14; Frei 1982:5). Undaunted, McCrone (personal communication, 1982) continues to stake his reputation on the interpretation of the Shroud image as “an easel painting . . . as a very dilute water color in a tempera medium.”\nLink:\nhttps://www.shroud.com/meacham2.htm\n— — — —\nSo … If we follow the opinion indicated by Mieli (and Andrea Nicolotti) would still be valid the verdict of McCrone, despite all these years of research …\nIs that opinion a credible idea?\n\n","date":"March 19, 2015 at 8:31 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193753","author":"piero","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"https://www.academia.edu/7447446/Was_there_a_link_between_the_Knights_Templar_and_the_Turin_Shroud_An_interview_with_Dr._Barbara_Frale\n\n","date":"March 19, 2015 at 8:38 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193755","author":"Louis","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"I do not know what will serve the interview with Frale when instead we talk about the article by Paolo Mieli around the book written by Nicolotti about the Shroud of Turin (and now I have not read that interview)…\nIn any case there is an address where you can read the entire italian text written by Paolo Mieli…\nLink:\nhttp://www.antoniolombatti.it/SindoneMieli.pdf\n\n","date":"March 20, 2015 at 8:44 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193857","author":"piero","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Today (March 21, 2015) in the newspaper “il Giornale” appeared a letter (sent by e-mail) sent by Maria Gabriella di Savoia (a well known Princess) about the article in the “Corriere della Sera” by Paolo Mieli (about the book Nicolotti), this letter is addressed to the journalist Paolo Granzottto.\n The title is the following : “Casa Savoia, la Sindone e\nun gesto regale “(= the House of Savoy, the Shroud and a regal gesture) …\n Among other things in the letter Princess Maria Gabriella says:\n “… It seems (almost) that Mieli afraid that the exposition subtract visitors to more secular Expo in Milan. Unless his considerations are part of the grand design aimed to debase by any means the Christian roots of our civilization.. .. ”\nand\nthen Princess Maria Gabriella remembered the thirty anniversary of the death of his father King Umberto, the last king of Italy …\nWhat is your opinon ?\n\n","date":"March 21, 2015 at 10:35 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193951","author":"piero","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Barbet, in his Preface to “Doctor at Calvary” recalls that Dr Pasteau, President of the St Luke Society of Catholic Doctors of France, was explaining Barbet’s researches to a gathering of high dignitaries at he Vatican.  The then Cardinal Pacelli (later Pope Pius XII) along with others went pale with grief and compassion, exclaiming, “We did not know; nobody ever told us.”\n\n","date":"March 18, 2015 at 1:53 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193699","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Here are a few words about two different issues:\n1) Mechanical Properties of Linen\n2) KK particles\nI write because I want to clarify things to the reader of this blog about what I mentioned …\n1)You can read what I wrote in the previous messages about Young’s Modulus,\nAFM techniques and “thre-point bending test” , etc. …\nRecently I have found a Webpage:\nhttps://sites.google.com/site/haoranwangsresearch/individual-project/mechanical-properties-\nstudies-of-chinese-linen-flax-and-their-composites\nYou can observe the “Schematic of flax fiber tensile testing”…\nand it is interesting the following claim:\n>FEA (= Finite Elements Analysis) was also performed to gain the knowledge of how the spirally organized layer structure affects the mechanical performace\nI do not believe in rough controls and then\nI think that controls more refined, without going to the break, are possible\n2) If I am right in my readings the KK masses are below the Planck scale (= MD)…\nI have also read that\n>The light KK gravitons could be copiously produced in stars,\ncarrying away energy… Unfortunately I do not know the exact mechanism of\nKK particles decay (into photons).\nPerhaps we can know something more when we try to study the Early Universe and the KK gravitons (that [we presume] were produced copiously).\nThere is also a decay rate equation for graviton into two photons.\nBut I believe this an argument of Astrophysics where there is not my ability to correct explain\nthe scientific problem…\nHave you an useful comment?\n\n","date":"March 19, 2015 at 8:59 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193756","author":"piero","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Here I insert some more news about the KK (= Kaluza-Klein) particles:\n>…The ATIC collaboration, led by John Wefel of Louisiana State University, found that data from circumpolar flights in 2000-2003 showed a surprising anomaly: a substantial surplus of electrons at a particular, potentially significant, energy range. …\n>One type of WIMP, known as a Kaluza-Klein (KK) particle and predicted by theories involving extra dimensions, has properties that could explain the ATIC data.\n>When two KK particles interact, they are expected to annihilate and create an electron-positron pair. (Positrons are the antimatter counterpart of electrons.)\n>Each electron produced would have an energy equivalent to the mass of the KK particle. Interesting, a 620 GeV KK particle would produce an annihilation “signature” that would closely match the electron-energy anomaly detected by ATIC. …\nLink:\nhttp://cosmicray.umd.edu/cmns2/cosmicrays/topic4.htm\nand, reading another website,\nI have found the following words:\n>An example of a class of particles arising from compactified dimensions are `pyrgons’.\n>Pyrgon is the Greek word for ladder or tower, which characterises the particles,in general called KK-particles. …\nI have seen a presentation: “Kaluza-Klein Dark Matter: a review”\n(by Géraldine Servant – Service de Physique Théorique- CEA/Saclay)\nunder the address:\nhttp://conferences.fnal.gov/aspen05/talks/servant.pdf\nbut … I don’t know what is the effect of magnetic fields\n(see also: Earth’s Magnetic field!) on KK particles…\nand these are issues that can bind to strange speculations\nrelated to possible ideas on Body Image Formation (=BIF).\nWhat is your idea about the (possible or impossible) influence\nof the Earth’s magnetic field on these KK particles?\n— —\nIn any case, here an excerpt about the: \nKaluza-Klein Burst: a New Mechanism for Generating\nUltrahigh-Energy Cosmic Rays (2008)\nby\nJe-an Gu \n>The KK burst is a violent energy transfer from extra dimensions\nto ordinary dimensions through the collision between two\nKaluza-Klein (KK) modes. In this scenario, the size of extra dimensions\nis required to be in the range 10 −27 –10 −25 cm in order\nto account for the observed spectrum.\nLink:\nhttp://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.337.6750\nHere the last paper about Kaluza-Klein\n(and hence [if I am right], the KK particles):\nProbing the Nature of Compactification with Kaluza-Klein Excitations at the Large Hadron Collider\nby\nPran Natha, Youichi Yamadab, and Masahiro Yamaguchi\nHere an excerpt from the Abstract:\n>It is shown that the nature of compactification of extra dimensions in theories oflarge radius compactification can be explored in several processes at the Large Hadron Collider (LHC). Specifically it is shown that the characteristics of the Kaluza-Klein(KK) excitations encode information on the nature of compactification, i.e., on the number of compactified dimensions as well as on the type of compactification, e.g.,of the specific orbifold compactification. … … etc. … ….\n— — —\nDo you like these “variations” (from Web surfing) on KK particles?\nI would like to know where they are discordant notes…\nI think I need a concealer,\nexpert in the field of Astrophysics! …\n\n","date":"March 20, 2015 at 10:42 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193868","author":"piero","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"Eric\nYeah Penrose and Hameroff wrote a rebuttal of Max Tegmark alone the same line as you and Tegmark has not as of yet replied. Now a research group in Japan says that they discovered warm temperature quantum vibrations in microtubules that would seem to help P & H in part of they theory, but I don’t believe it was confirmed yet by others.      \nAnd as I wrote he is just one that has problems with it there are many others that disagree with P & H.  \nPenrose and Hameroff are very smart guys, but so is Tegmark. His book, “Our Mathematical Universe” has been well received by people like Brian Greene and Michio Kaku, in fact Kalu wrote this about his book;\n“Daring, Radical. Innovative. A game changer. If Dr. Tegmark is correct, this represents a paradigm shift in the relationship between physics and mathematics, forcing us to rewrite our textbooks. A must read for anyone deeply concerned about our universe.” —Prof. Michio Kaku, author of Physics of the Future \nThe back cover of his books says that he is the author or coauthor of more than 200 technical papers, twelve of which have been cited more than 500 times. He is also a well respected professor at MIT. He may be right or wrong, but he’s no idiot.    \nWhat I see is that Penrose and Hameroff are saying that consciousness just a normal physical property of the brain not unlike V. S. Ramachandran and other has claimed.\nAs far as “elite name” go, didn’t Newton believe he could turn metal into gold?\nBut let me tell you a story of an my dealing with a elite name, \nIn the 1980’s I had a beloved dog that came down with cancer. I took her all over trying to cure her and one day I was in a book store and found a book by Linus Pauling(Nobel Prizes) about using vitamin c for cancer. In the book he explained how vitamin c cures cancer and gave many cases where he said it work, but also cases that failed. Well he made excuse after excuse about why it didn’t work and that set off a flag, but I continued to believe in Pauling. I called his research lab in CA and I get this doctor with a heavy German accent. I explain my dog’s problem and he says to me, “Maybe it’s time for the Final Solution.” I was a little in shock, seems I heard that somewhere before, but he agrees to tell me how to treat my dog. \nLong story short, the dog died and Pauling continued claiming vitamin c cures cancer, then his wife died (of cancer) and then he died (of cancer). \nSo I respect the works of Penrose and Hameroff (I have their books) but I also respect the opinions of others. Now I’m going to go wait for the last snow of this year (I hope).\n\n","date":"March 20, 2015 at 10:14 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193865","author":"John Green","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"I am curious about the exact source of the rebuttal of Max Tegmark,\nbecause I have just found the following words\non Roger Penrose and Stuart Hameroff: \n>Roger Penrose and Stuart Hameroff (Hameroff & Penrose, 1996) have proposed a quantum theory of consciousness that brings together three exciting but controversial ideas. The first pertains to the still-to-be-worked-out quantum theory of gravity. The second involves the famousincompleteness theorem of Gödel. The third rests upon the fairly recently discoveredmicrotubular structure of neurons. … …  etc. … …\nand \n>… … A serious objection to the Penrose-Hameroff theory has been raised by Max Tegmark (2000).The Penrose-Hameroff theory requires that the critical microtubular state be a coherent quantumstate that extends over a macroscopic region in the brain. Normally one expects any macroscopiccoherence of a quantum state in a warm wet brain to be destroyed almost immediately. … …\nand\n>… … Hagen, Hameroff, and Tuszynski(2002) have claimed that\nTegmark’s assumptions should be amended …\n[Hagen, S., S. R. Hameroff, and J. A. Tuszynski 2002:\nQuantum computation in brain microtules:decoherence and biological feasibility. Physical Review E65,061901-1 – 061901-11]\n— —\nSource :\n“On Quantum Consciousness Mechanics”\nby\nCebrail H. Oktar\nJournal of Consciousness Exploration & Research\nOctober 2012,  Volume 3 – Issue 9 – pp. 1052-1063 \nAbstract:\nQuantum Consciousness Mechanics is based on physics and metaphysical intensity states. Theaim of this paper is to attempt to combine physical and metaphysical intensity states forconsciousness. It is shown that widening of parapsychology to the solution of quantumconsciousness can be important in the explanation of paranormal phenomena. I have appliedequations in quantum mechanics to quantum consciousness. These equations can have twosolutions, one of which describes waves, energy and matter propagating from the past to thefuture and the other describes waves, energy and matter propagating from the future to the past. Working on the mathematical properties of the advanced solutions, mathematician LuigiFantappiè discovered in 1941 that they coincide with the qualities of living systems what theyare concentration of energy, differentiation, structures and order, thus arriving at the conclusionthat life, more than being effected by causes placed in the past, is attracted by causes placed inthe future. Therefore, the parameters of the autonomic nervous system, which supports vitalprocesses, should show anticipated reactions to future stimuli\nSee also in Wikipedia:\n>…  … This more developed version of their ideas was also widely attacked, and notably by the physicist Max Tegmark, who calculated that quantum states in microtubules would survive for only 10−13 seconds, too brief to be of any significance for neural processes.[6] Hameroff and the physicists Scott Hagan and Jack Tuszynski replied to Tegmark arguing that microtubules could be shielded against the environment of the brain. To date, there is no experimental confirmation of these proposed methods of shielding, but Hameroff has proposed tests that could falsify the theory… …\nLink:\nhttp://en.wikipedia.org/wiki/Stuart_Hameroff\nThank you in advance.\n\n","date":"March 20, 2015 at 10:59 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193871","author":"piero","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"“Tegmark [161] published a critique of Orch OR based on his calculated decoherence times for microtubules of 10−1310−13 seconds at biological temperature, far too brief for physiological effects. However Tegmark didn’t include Orch OR stipulations and in essence created, and then refuted his own   quantum microtubule model. He assumed superpositions of solitons separated from themselves by a distance of 24 nanometers along the length of the microtubule. As previously described, superposition separation in Orch OR is at the Fermi length level of atomic nuclei, i.e. 7 orders of magnitude smaller than Tegmark’s separation value, thus underestimating decoherence time by 7 orders of magnitude, i.e. from 10−13 s10−13 s to microseconds at 10−610−6 seconds. Hagan et al. [162] used Tegmark’s same formula and recalculated microtubule decoherence times using Orch OR stipulations, finding 10−410−4 to 10−310−3 seconds, or longer. In any case, experimentally, Bandyopadhyay’s group has found 10 kHz resonance, i.e. 10−410−4 seconds coherence times. Also, as stated earlier, there are versions of the beat-frequency scheme that would require much shorter decoherence times, though at the expense of correspondingly larger bodies of material being involved in the quantum-coherent states.”\nhttp://ac.els-cdn.com/S1571064513001188/1-s2.0-S1571064513001188-main.pdf?_tid=da8a9dd0-cf03-11e4-b214-00000aacb35f&acdnat=1426857798_1ba0f14847f4296ee65c9d4ccaa1a6e2\n\n","date":"March 20, 2015 at 11:23 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193874","author":"John Green","site":"shroudstory"},{"title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing","post":"I have only found:\nDiscovery of Quantum Vibrations in “Microtubules” Inside Brain Neurons Corroborates Controversial 20-Year-Old Theory of Consciousness\nLink:\nhttp://www.elsevier.com/about/press-releases/research-and-journals/discovery-of-quantum-vibrations-in-microtubules-inside-brain-neurons-corroborates-controversial-20-year-old-theory-of-consciousness\n-*-*-*-*-\nand reading about “Quantum Mind”…\nunder the address:\nhttp://en.wikipedia.org/wiki/Quantum_mind\nWe have the following words:\n>The main argument against the quantum mind proposition is that quantum states in the brain would decohere before they reached a spatial or temporal scale at which they could be useful for neural processing, although in photosynthetic organisms quantum coherence is involved in the efficient transfer of energy, within the timescales calculated by Quantum biology.\n[See also: Engel, G. (2007). “Evidence for wavelike energy transfer through quantum coherence in photosynthetic systems”. Nature 446 (7137): 782–786]\n>This argument was elaborated by the physicist, Max Tegmark.\n>Based on his calculations, Tegmark concluded that quantum systems in the brain decohere at sub-picosecond timescales commonly assumed to be too short to control brain function.\n— —\nSo…\nWhere are the othercalculations?\n\n","date":"March 20, 2015 at 11:18 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","id":"comment-193872","author":"piero","site":"shroudstory"}]
