[{"title":"BSTS Meeting Reminder","post":"I am totally mystified by the Challenge unless David Rolfe can provide Richard Dawkins and his assembled team of textile experts with a scientific laboratory at the Challenge’s own expense and  permission to take the Shroud there for a full examination. Otherwise it is like asking a doctor to diagnose an illness of a patient without seeing the patient.\n\n","date":"October 10, 2012 at 6:34 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17399","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Charles, This doesn’t seem necessary as all the significant image characteristics are available to him as they have been to others, Garlaschelli (Italy) and Allen (South Africa) being only two of them. It is thus evident that these characteristics have been accepted even by people, scientists included, who have not made a full examination. The ball, therefore, seems to be in Dawkins’ court.\n\n","date":"October 10, 2012 at 8:04 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17406","author":"Louis","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Louis, And you think that science has not advanced since these studies were made? Modern methods would achieve a vastly more sophisticated analysis of the Shroud and it would be right for Dawkins to refuse to accept the challenge on these grounds alone.\n\n","date":"October 10, 2012 at 9:26 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17409","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Charles, While there is no doubt that there have been significant advances in science, ruling out as outdated what qualified scientists  — some of them with no link to Christianity  — have done does not appear to be justified. The relic is not part of the deposit of faith and the Creed does not say “… and was buried wrapped in the Turin Shroud.” John Paul II left the question to science and it is probable that if nothing has been done so far it is particularly due to the fact that carbon dating is not infallible, as demonstrated with sound argumentation in some Shroud books, papers and articles.\nGiven the situation, one sees no reason to demand a fresh C14 test and destroy another piece of the relic. Even if the Church does agree — with Oxford employing a thorough cleaning process — and no first century date is obtained this will only give rise to more theories, which the laboratory will not accept. There are several theories today about why the carbon dating results can be skewed. After reading the late John Tyrer’s paper, for instance, one wonders if a thorough cleaning process is really possible.\nA more sophisticated analysis seems to be the best option and, given what Benedict XVI has said, as read out by Bishop Vann in Dallas, the Church will need to be convinced that progress has been made.\n\n","date":"October 10, 2012 at 3:06 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17428","author":"Louis","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"At the very leas , advances in radio-carbon 14 dating since 1988 require another testing of the Shroud.\n\n","date":"October 10, 2012 at 9:28 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17410","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"The same is also true for the Sudarium of Oviedo, which was unofficially tested with C14 2 different time and gave 2 results roughly similar of around 700 A.D.\nI don’t understand the Church to reject at least the idea of a new series of C14 dating (done properly this time with at least 3 samples of each cloth taken from 3 different areas of the cloth) for both the Shroud and the Sudarium. No doubt that these tests would improve greatly our quest for truth concerning both relics.\n\n","date":"October 10, 2012 at 1:02 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17420","author":"Yannick Clément","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"I put myself on the Church’s shoes and if I had all the material available and a large amount of Catholic universities, research institutions and experts you can trust 100%, what would I do? I wouldn’t be surprised at all if the Vatican had carried out a whole set of experiments at not made results public. With all we know now C14 would be the least relevant of all candidate tests.\nBut for the Catholic church, her most important error in 1988 was that she lost control of the tests and the way they were made public. Now they have the chance of conducting tests without the pressure of public opinion and release little by little all the information, at their own rythm and for their own religious purposes (not for example to promote C14 labs). The design of the (unexpected) 2010 exhibition in Turin and the current exhibition in Malaga are clearly pro-authenticity and use this not as a stand-alone scientific fact, but in the frame of the Church’s evangelization purposes. That is exactly the management I would expect, if the Church had carried out additional tests on her own devices. Additionally, they must have noticed the never ending stream of books, ENEA reports and long etc and in my view, this is more than enough for them not allowing any additional test.\n\n","date":"October 10, 2012 at 5:16 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17445","author":"Gabriel","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Before asking for a new radio-carbon dating, the 3 labs involved in the 1988 dating should agree on what went wrong, if they consider anything went wrong. \nPr Christopher Ramsey thinks more testing is needed. Maybe the first test should be done on the reserve sample of the 1988 dating. Or maybe he considers Rogers’ and LANL’s work answered the question.\n\n","date":"October 10, 2012 at 1:23 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17422","author":"anoxie","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"I disagree with your vision Anoxie.  There are well enough evidence that this whole corner of the cloth (including the reserve piece) where the sample was taken in 1988 is non representative in many ways with the main body of the Shroud.  Why losing time with another C14 test in this same anomalous zone ?  3 more samples should be taken in 3 different zones of the cloth with a preliminary check-up of the zones chosen to be sure there is not anything wrong with these area and a following microscopic and chemistry verification of the samples to make sure again that they really represent the main body of the cloth.  And if I was the Church, I would avoid to choose the charred material that was removed during the 2002 restoration as one of the three sample.  Way too much dangers of contaminations there…  Each sample (much smaller than the big one that was cut in 1988) should not be divided in three like the other time but each one should be given to three different top-notch C14 labs with a clear, complete and proper protocol to avoid at the max the risk of anomalous results.  That’s what I think and I also think the same for the Sudarium.\n\n","date":"October 10, 2012 at 3:49 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17433","author":"Yannick Clément","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"I didn’t mean another datation, but another independant analysis to characterize the reserve sample.\nThe three labs were responsible for the datation, they should feel concerned by this issue.\nIt’s an easy way out to claim that “more testing is needed”.\nEither they think there has been a sampling problem or not.\n\n","date":"October 10, 2012 at 4:45 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17439","author":"anoxie","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Surely this would be a completely independent test by laboratories that had nothing to do with the original 1988 test. As I understand it , Ramsey does support more testing but still believes a date will be found within the medieval range. ( I think that this was in an interview for a documentary.)\nAs there is some continuing debate over whether the 1988 sample was representative of the whole, it would make no sense to retest part of this again. Samples from other areas of the cloth need to be chosen.\nDid Rogers and LANL ever come up with a secure date? I thought Rogers proposed a very wide date range that was worse than useless in pinning down a specific date for the making of the Shroud.\nA doctor friend was telling me of the immense strides in diagnostic blood analysis in the last ten years. When were the last tests done on the blood? This is certainly another area where the latest techniques need to be used.\nI still believe that this challenge is flawed unless access to the Shroud is granted. With the rate of scientific advance even if we do not solve the mystery of the Shroud image now, we certainly should in the next ten years but we can’t if there is no access to it.\nFinal question. As there are samples from the Shroud outside the control of the Vatican (e.g. from the 1978 examination) , would these be offered to Professor Dawkins by those who control them?\n\n","date":"October 10, 2012 at 2:08 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17423","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"I was talking of Roger finding cotton in the C14 threads and the FTIR spectroscopy made by the LANL on C14 threads.\nDoes Pr Ramsey see these tests conclsive or not to invalid the 1988 dating ?\n\n","date":"October 10, 2012 at 2:20 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17426","author":"anoxie","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Freeman; “Did Rogers and LANL ever come up with a secure date? I thought Rogers proposed a very wide date range that was worse than useless in pinning down a specific date for the making of the Shroud.”  -Rogers proposed dating was from his observations of the lack of vanillin found on the main fibrels of the Shroud. It is not a precise dating method but a guide, and in essence from the lack of vanillin found on the Shroud and comparing too amounts found on other ancient linens, he calculated that the age of the cloth was “atleast” 1300 years old. Bringing it’s most recent probable age to the year 700 AD approximately and centuries older then the 1988 radiocarbon dating suggested….No mystery there.\nR\n\n","date":"October 10, 2012 at 2:55 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17427","author":"Ron","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"So you agree that Rogers offered no precise date. As I am arguing for a new Carbon-14 dating, the 1988 test result is irrelevant. We would start again from scratch with the immense advantage of the more sophisticated methods that have been developed to deal with earlier problems of Carbon 14 dating. There have been real advances here while no one has,apparently, ever been able to use Rogers’ approach to achieve a date for cloth.\n\n","date":"October 10, 2012 at 4:12 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17437","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Ron, we agree on this. But is the question of the 1988 datation solved ?\nWe could think so, in 2008, after LANL FTIR spectroscopy analysis and Rogers’ article. But Philip Ball woke up and wrote in an editorial in Nature that ” the status of the Shroud of Turin is murkier than ever'”, at the precise moment we could think the question of the 1988 datation was solved.\nMy conclusion is he did not give much credit to Rogers’ and LANL’s works.\n\n","date":"October 10, 2012 at 3:40 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17432","author":"anoxie","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"In all seriousness, I don’t need Phillip Ball to tell me if, or if not, the 1988 radiocarbon dating was flawed. The facts speak for themselfs, the 1988 c14 dating is immaterial now, as far as I’m concerned. With all we know of the dating in question, it seriously baffles the mind, that anyone puts any emphasis on it anymore. Furthermore, I could care less what Ball thinks of Rogers works, has he done any scientific research or study that can oppose Roger’s vanillin findings?\n\n","date":"October 10, 2012 at 3:59 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17436","author":"Ron","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"I care what Pr Ramsey thinks of Rogers’ and LANL’s works.\n\n","date":"October 10, 2012 at 4:48 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17440","author":"anoxie","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"I think the lot of you obviously didn’t catch any of my previous posts pertaining to issues with radiocarbon dating. The MAIN issue is contamination and secondly provenance!!\nEven with new minor advancements in AMS, they still cannot be absolutely sure about contamination. Remember we are talkng a fabric here, which is by far the most difficult of artifacts to radiocarbon date. Just think of the contaminants this cloth has picked up! Centuries of candle and incense smoke, experiencing extreme heat and smoke from atleast two fires, proximity to other numerous other material etc; etc;…It would be a complete waste of time, at the moment, to radiocarbon date this cloth any further….\nAnd I definately would suggest, it not be handed to ANY of the previous labs involved in the 1988 tests. That would be just plain stupidity.\nR\n\n","date":"October 10, 2012 at 2:08 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17424","author":"Ron","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Forgot to mention, as I stated way back when this challenge was first brought forth; That I doubted Dawkins would respond, as he “barely acknowledges the Shroud” with any importance whatsoever!…Why would he bother?\nR\n\n","date":"October 10, 2012 at 2:19 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17425","author":"Ron","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Yes,it is a marginal issue. We know that there was once a burial shroud so It should make no difference to anyone’s faith as to whether it happened to survive or not. I doubt that it did but I would be intrigued if it were proved that it had. As the only surviving cloth of this size from this region,it would certainly deserve better care than it gets in Turin.\n I am sure the stone that closed the tomb must be still around as it would take some moving away from Jerusalem!  No doubt James Tabor will find it in time for his next documentary.\n\n","date":"October 10, 2012 at 4:21 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17438","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"M. Freeman, don’t forget that the Shroud IS REALLY a real burial cloth of a real crucified man (whether it be Jesus of Nazareth or another criminal).  Science has proven this since the STURP team examination of the cloth in 1978.  Did you read my paper on the subject ?  Here’s the link : http://shroudnm.com/docs/2012-07-26-Yannick-Clément-The-evidence-of-the-bloodstains.pdf\nI think you should read this.  Once you’ll be convinced (I hope so !) by the evidences I present that this is really a true burial cloth of a real crucified man who bears all the stigmata of Jesus of Nazareth as reported by the Gospels, then I will ask you this simple question :  WHY THIS SHROUD CANNOT BE THE REAL SHROUD USED FOR TO COVER THE CORPSE OF JESUS ON FRIDAY EVENING ???  Or even more than this, I think it’s even better to ask yourself the question I wrote at the end of my paper :  If the man of the Shroud is not Jesus, than who is it ??? \nOne thing’s for sure :  there was a real crucified man under that cloth and some undetermined interactions between the corpse and the cloth produced a body image on the top-surface of it.  That’s what science can tell for the moment…  Starting from this solid conclusion, I truly don’t think there is one better option than to the one that consider the Shroud as the genuine Shroud of Jesus of Nazareth…  I’m currently working very hard on a paper about this particular (and complicated) question and right now, the only other “plausible” option I found is the one that would involve a “natural” kind of forgery done after the finding of the True Cross by Constantine’s mother and before the apparition of the first known Pantocrator-like face of Christ (the Christ in Majesty mosaic in Ravenna) at the very beginning of the 6th century by someone who would have tortured and crucified himself (with maybe the help of some collaborators) an unwilling victim in order to reproduce the burial Shroud of Christ.\nIn front of all the known data and facts about the Shroud that we know, this is, to me, the only alternative scenario available, but I have to say that it is much more unlikely than the one that consider the Shroud has what tradition report it to be, i.e. the authentic burial Shroud of Jesus.  That’s where I stand right now after a very long reflection…\n\n","date":"October 10, 2012 at 4:51 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17441","author":"Yannick Clément","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"When I said “or another criminal” in the first line of my previous comment, I think I should have written “another victim” instead (because of the only plausible alternative scenario that I’ve described).  This term would be much better in my mind and I wanted to set the record straight versus my previous comment.\n\n","date":"October 10, 2012 at 4:53 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17442","author":"Yannick Clément","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"It is only a ‘marginal issue’ to those that are blind too or cannot comprehend the meaning of this Shroud. \nYou may be right about the next Tabor documentary though ;-)\nR\n\n","date":"October 10, 2012 at 5:15 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17444","author":"Ron","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Yannick. In my book Holy Bones, Holy Dust, How Relics Shaped the History of Medieval Europe, just out now in paperback, I fail to find a single medieval relic that dates back to the first century, although all the artefacts, cloths, etc listed in the gospels  certainly existed at some point. There is no record that early Christians collected relics before the fourth century, having a very similar attitude to them that most Protestants have today, and most must have perished due to natural causes in the humid atmosphere of Jerusalem.\nHowever I would stand to gain immensely if the Shroud is ever proved to be authentic as it would enable me to write a revised edition of my book with a sensational new cover that would probably earn me good money.\nMy own feeling is that if retested the Shroud would come back with a medieval date, possibly a bit earlier.  With modern methods of removing contamination,it is impossible for so much contamination to remain that it would skew a 1350 (say) date back to the first century. The first century date is what matters,any other date, say AD 500, just confirms that this is a later creation. We know of many relics that first appear in the ninth century ,for instance, and you know of two separate tests on the Oviedo sudarium that took it back only to AD 700 (I only knew of one of these tests so it is useful to know that there is a second that confirms the first).\nIf you are looking for large cloths the size of the Shroud, the best examples are the cloths made in Islamic workshops in the ninth to eleventh centuries. Several of these were brought back to Europe by Crusaders- notably the shroud of Cadouin.I have had one useful conversation with a textile expert who thinks this is a possible source for the Shroud and would explain why there may be traces of plants, etc, from the Middle East on the Shroud. Unfortunately I have been unable to make contact with the French expert on Islamic cloth whose name i was given to explore this further. I don’t know how the Islamic cloths were woven and the first step would be to see if they used the same methods as shown on the Shroud.\nThe Romans were cruel in their methods of execution , later generations no less so and it is not impossible that ,taking the gospels as a source, someone recreated an actual crucifixion of some unfortunate man and then wrapped him up so as to sell the bloodstained cloth to a gullible crusader.\nFurther testing of the blood on the Shroud is essential. if an AB blood-grouping is confirmed this has to be squared with the evidence that this grouping is not known before AD 900.\nI am sticking to a medieval date as the best fit without ruling out the small possibility that the cloth is a lone survivor of an earlier period. I promise you ,Yannick, that if the Shroud is proved to be authentic I shall acknowledge you by name in the new edition of my book! (But I won’t promise to share any royalties with you!)\n\n","date":"October 11, 2012 at 3:39 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17461","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"\nCharles Freeman :So you agree that Rogers offered no precise date. As I am arguing for a new Carbon-14 dating, the 1988 test result is irrelevant. We would start again from scratch with the immense advantage of the more sophisticated methods that have been developed to deal with earlier problems of Carbon 14 dating. There have been real advances here while no one has,apparently, ever been able to use Rogers’ approach to achieve a date for cloth.\nRogers never claimed to give a ‘precise’ date. A precise date cannot be achieved, presently, using the lignin/vanillin method. You should read his paper again. Rogers states clearly it is a GUIDE only. But this guide has, even with it’s wide range, shown the 1988 dating of 1325, to be way out of whack and by centuries. This is very clear.\nI agree the 1988 test is irrelevant, and I would add it is immaterial aswell. I tend to disagree that any serious advances have been made in AMS or especially in contamination issues, which from what I understand are still a huge thorn in the sides of radiocarbon technicians. There is a myriad of issues with RCD that still prevail, and still make it an unreliable method for testing ‘accurately’ items of no provenance and undetermined contamination, such as the Shroud. I don’t blame the Vatican for not even contemplating any further C14 testing, cause they’re right on, on that issue.\nR\n\n","date":"October 10, 2012 at 5:03 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17443","author":"Ron","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"\nanoxie :I care what Pr Ramsey thinks of Rogers’ and LANL’s works.\nAnd why would that be? …He still will not admit to all the ‘seriously’ incompetent procedures and errors done back in 1988, and still believes any new tests would point the Shroud to the middle ages!….He is simply biased in favour of their early results,  hense against any notion the Shroud could be older or authentic…This is clear from his statements…Personally, I wouldn’t trust him or his lab to do another Shroud C14 testing, if it ever happens. Remember, his name is on the original Nature paper.\nR\n\n","date":"October 10, 2012 at 8:34 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17453","author":"Ron","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Rogers’ did a great work, but with the limited means he had.\nLANL’s did the work, but unofficially, and did not publish the results.\nThen why can Philip Ball write in Nature that “the future of the shroud is merkier than ever” ?\nPartly because the very labs which did the dating refuse to look at the evidence and to characterize independantly what they dated (the reserve sample is still there).\nNow is this merely political or does Pr Ramsey genuinely think the level of proof is not good enough to justify tests on the reserve sample ?\nI don’t know.\n\n","date":"October 11, 2012 at 2:59 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17460","author":"anoxie","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Sorry Anoxie, it would seem I misunderstood your earlier comments. As to your question pertaining to Ramsey; I don’t know the answer either. Maybe you can write him for an answer.\nR\n\n","date":"October 11, 2012 at 6:34 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17463","author":"Ron","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"I think Barrie Schwortz, Ray Rogers or Robert Villereal may have done so.\nWe often hear that the Church is reluctant to allow new tests, this is the main argument of Philip Ball, but isn’t it up to the labs in charge of the datation to allow a critical examination of the reserve sample ?\nAs Rogers put it :\n\nA gum/dye/mordant coating is easy to observe on Raes and radiocarbon yarns. No other part of the shroud shows such a coating.","date":"October 11, 2012 at 7:11 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17469","author":"anoxie","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"\nCharles Freeman :Further testing of the blood on the Shroud is essential. if an AB blood-grouping is confirmed this has to be squared with the evidence that this grouping is not known before AD 900.\nCharles, can you provide any reference regarding this point?\n\n","date":"October 11, 2012 at 9:41 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17481","author":"Gabriel","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Gabriel. I think the AB blood grouping of the Shroud  is well reported.I have argued that this test should be done again with the latest techniques of blood analysis to confirm this result – and,of course, find out very much more about the blood and genetic inheritance of the person wrapped in the Shroud.\nIn an earlier posting on this site I cited the Hungarian evidence that showed how AB grouping first appeared quite late, post 900. This was done from careful analysis of burials in an area where the mingling of Mongoloid and Caucasian groups took place which led to the emergence of an AB grouping from what were previously blood groupings of B and A.\nI am sorry I have not the time to find which posting it was on but perhaps someone else remembers it. If I find it I will repost it here, of course.\nIf anyone else has conclusive evidence of any AB blood grouping from before AD 900 it would be good to know as i have never seen one. The mingling of Mongoloid and Caucasian groups took place in the areas where they came into contact  and there are several of these including the Far East which are perhaps earlier. One can still see the major concentrations of AB, always a small percentage of the whole, from a map of blood groupings.\n\n","date":"October 11, 2012 at 12:45 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17491","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Charles, well, you have the Sudarium of Oviedo which has been dated using C14 as belonging to AD 700 and also bearing AB type blood.\nNeverthelss ,it seems to me quite strange that throughout the History of Mankind only after AD900 there has been this mingling you mention….but perhaps I am wrong. That’s why I asked you for a scientific reference.\n\n","date":"October 11, 2012 at 12:52 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17497","author":"Gabriel","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Yannick Clement seems to know most about the carbon-14 dating of the Oviedo Sudarium. We need to know whether just the cloth was dated or the blood stains as well. if the blood stains are shown to be AB and are dated to AD 700 then we do indeed have the earliest reference to an AB blood grouping that I have ever heard of and this would be significant. As the mingling of A and B groups as a result of documented migrations from the east are rare this early this might also give a clue as to where the ‘donor’ of the blood on the Sudarium came from. There would be very few places indeed where the emergence of AB groupings would have been possible. I have been told that although one might find examples fo AB from AD 900 it was not until more extensive minglings of A and B blood groups between 1000 and 1100 that it becomes more common.\nAs said in another post, the evidence comes from the plains of Hungary where the first recording mingling of A and B blood groups which led to the emergence of the AB blood grouping seems to have taken place in the ninth and tenth centuries. As i understand it, analysis of bones from earlier burials have shown no trace of AB before this.\n I am lucky to have a Hungarian friend who lectures on medical history and I have asked him for help on this as I suspect that much of the research is in Hungarian.\nSuppose the Shroud was AD 1350 there would be no problem about the AB blood grouping as , even though it was carried only by a small minority of the population and most prominent in areas where A and B groups intermarried, there were still a significant number with this blood-grouping around.\nIf the blood on the Shroud is shown to be much earlier it becomes, to me, a much more interesting question so I look forward to hearing more from the experts on this.\nI leave it to others to discuss the theological problems arising from the analysis of the blood of a man who is assumed to have had a human mother and a divine father. If we have an authentic shroud then conservative theologians would presumably be forced to admit that we have the DNA of God. I leave it to them to sort this one out.\nLet us await on more expert input\n\n","date":"October 12, 2012 at 3:38 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17532","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Here’s my reply to comment #24 of M. Feeman :\nM. Freeman, I understand perfectly your historian point of view and at first sight, it’s far from being stupid.  But I would really like if you can read my paper (see the link to it in my previous comment).  I think after reading it, you would have no choice than to accept the FACT that the Shroud is a real burial shroud of a real crucified person. From your comment, I can detect that you already think that way to some extend but I wonder if you still think that it can also be the work of an artist.  If we could at least agree on this FACT that the Shroud is a real burial cloth of someone who’ve been crucified and who shows all the stigmata of Christ, then that would be a very good thing.  Once we accept that fact, the possibilities to explain the Shroud drop drastically !  See my paper…  From my perspective, because of that FACT, there are only 2 possible scenarios that doesn’t involve Jesus Christ and that still can pretend to explain the Shroud rationally : 1- It is a “natural” forgery involving the use of a real crucified corpse (something like what you describe in your comment) or 2- It is the Shroud of an anonymous criminal that have been crucified by the Romans and the body image and the bloodstains are showing a purely accidental ressemblance with the Jesus of the Gospels.\nMy upcoming paper on the subject will focus on this second hypothesis and I will show in details that the chances for this scenario to be correct are almost unexisting.  So, because of this conclusion that I get after a long analysis, all we’re left with his the first scenario involving a “natural” forgery.  But this forgery, in my opinion, cannot have been done after the beginning of the 6th century because of the Vignon’s study that have clearly show a great congruence between the Ravenna mosaic and the facial image on the Shroud. Because of this important conclusion of Vignon, I don’t see how the Shroud and his natural body image could have been forged “naturally” after the creation of this mosaic between 500 and 547 A.D. !!!  From the minute you understand that the image on the Shroud is not the product of an artistic forgery, you have to conclude that this image MUST have been present prior to the creation of this mosaic (which is the most ancient artwork that show such a high degree of similitude with the facial image on the Shroud).  Effectively, how in the world a forger that would have used a real crucified corpse to do his false relic could have create it after the apparition of this mosaic ???  It’s totally irrational !  Imagine the stroke of luck he must have had in order to find an unwilling victim that would have look so much like the depiction of Jesus on this mosaic !!!  First of all, if we still want to believe in such a scenario, we have to assume that this forger was aware of that particular artwork or another similar artwork (like the Pantocrator icons or the Image of Edessa) and we have to assume that he was lucky enough to find someone with a big beard and long hair that look pretty much the same !!!!  Or, alternatively, we have to assume that the forger wasn’t aware of these artworks and was so lucky that the victim he choose was looking like these depictions !  In both cases, I estimate the probability to be almost 0 %.  Also, we must never forget that some of the Vignon’s marking include particular features visible on the linen cloth itself !  In that context, how in the world the artists who did these artworks could have reproduced such particularities if they were not working with a model of Jesus face that would have been made directly from the Shroud ?  It’s almost impossible to think they would have create such particularities just from their imagination without any model from the Shroud…\nBecause of all this, I estimate that if such a “natural” forgery really occurred, it must have been made BEFORE the beginning of the 6th century and most probably after the Edict of Milan in 313 and also most probably after the discovery of the True Cross by Helena (ca. 326).\nTo me, that’s the only possible range of dates for this kind of “natural” forgery scenario.  And because of that, I’m truly convinced that if a new C14 dating would be done properly with samples coming from the main body of the Shroud, the result would be prior to the 6th century and I’m truly confident that it would be around the first century A.D.  for the simple and good reason that I presently estimate the probability for such a “natural” forgery to have really occurred to be highly unlikely for a number of good reason that would be too long to describe here and that I intent to describe in a future paper.  In my mind, it’s much easier to believe that the Shroud is the real Shroud of Jesus than to believe in such an improbable scenario involving a “natural” forgery…\n\n","date":"October 11, 2012 at 1:01 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17499","author":"Yannick Clément","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"One last complementary comment versus my previous one :  If a new official and proper C14 dating of both the Shroud and the Sudarium would give a similar result of, let’s say 4th or 5th century, then I have to admit that the “natural” forgery scenario would greatly gain in credibility and the idea that the Shroud could be the real Shroud of Jesus of Nazareth would greatly lose on the probabilistic scale…  That’s a true possibility, even though I still favored greatly the hypothesis that the Shroud and possibly also the Sudarium (I have to admit that I’m less convinced of the authenticity of this particular relic) could be the genuine burial cloths of Jesus.  But to know the truth once and for all about the identity of the Shroud man, the Vatican MUST allowed a new C14 dating of both the Shroud and the Sudarium of Oviedo.  No doubt that if this could be done (properly done this time!!!), that would be awesome for our knowledge concerning these 2 cloths.\n\n","date":"October 11, 2012 at 2:40 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17514","author":"Yannick Clément","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Yannick, I have now read your paper with interest. I have seen so many conflicting discussions by scientists and pseudo-scientists on the Shroud and, as I am not a scientist myself , I am quite happy to accept as a good possibility  that the Shroud contains an image of  a man who has been crucified , either Jesus himself , or someone tortured to death by someone who had the gospel description of his death.\nThe real question then is the date of this occurrence.  I am simply not convinced by the argument based on the Vignon markings that the Byzantine images of Christ are derived from the Turin Shroud. I have recently been writing the third edition of my Egypt, Greece and Rome that includes art. I argue there , conventionally (it is a conventional book based on standard sources designed for beginner students in universities) , that the fully frontal faces of Christ are derived from imperial art. You can see this in the San Pudenziana mosaic in Rome of c. 390 ( some say later, possibly 420) where Christ is shown in full, front on and with a beard,as an imperial magistrate. In the Ravenna mosaic,where I follow scholars such as Robert Cormack in dating it to probably AD 500, this point is made even clearer as Christ is draped in imperial purple. So the model for the Byzantine Christs seems to be the emperors, not a burial cloth.\n This ‘liberates’ the Turin Shroud and means that it can be of any date, from the first century AD up to its first mention in the fourteenth century.So then we need to apply other tests and here we seem to agree on a new carbon-14 dating. I still think that this is by far the most likely way of settling the issue. Even taking a worst case scenario if another date well after AD 30 is achieved I think this will be adequate proof for me that the Shroud is not authentic.\nI also want to get to the bottom of two other issues.\n1) If the bloodstains are AB, then we need to square this with the evidence that AB only appears in the historical record after AD 900. The best evidence for this comes from Hungary and , in reply to another post from Gabriel,I am now waiting for a Hungarian doctor friend of mine who lectures in the history of medicine in Hungary to give me his views on AB. I am not able to comment on how accurate the AB testing is although I am assured that it is. Even so I would argue for another testing of the blood using the latest techniques which are miles ahead, apparently, of even those of ten years ago, As I have said elsewhere we need to know everything we can about the blood group and genetic inheritance of the blood (however many theological problems that arise from it -would it show the DNA of God the Father?)\n2) Although I think it is unlikely to lead anywhere, i would like to do a comparative study of the Shroud with the linen cloths of similar size that were woven in the caliphs’ Egyptian workshops between the 9th and 11th centuries. We know of two that came to Europe from these looms that still survive and there were were probably many more in view of the heavy traffic of crusaders and pilgrims going to and from the Holy Land. Many were very gullible and brought back fakes believing that they were the genuine relics found on the sites where they have been used. There would have born evidence of these ‘relics” origins, possibly in the shape of pollen,etc, that can be traced back to Middle East sources. It is argued that the Shroud also bears such evidence and so a Middle East origin at the time of the Crusades is a possibility that, at the very least, needs to be ruled out.\nHowever, you and i stand together on the issue that first brought me into this discussion, the  impossibility of Wilson’s arguments ,all of which fail as soon as they are analysed. I note that even Stephen Jones has now abandoned his attempts to discredit my original article on the subject.\n\n","date":"October 11, 2012 at 4:11 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17517","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"M. Freeman, here’s just a very rapid reply :  Once you understand that the Shroud is an authentic burial Shroud of a real crucified man and once you come to the conclusion that there is only 2 rational way to explain the Shroud  (i.e., 1- It is the authentic burial cloth of Jesus of Nazareth or 2- It is a “natural” forgery involving the use of a real crucified man), then how in the world can you still believe that a forger could have found a person with a big beard and long hair that would look almost exactly like the Pantocrator-styled depictions of Christ from the 6th century onwards ????  I found this idea totally ludicrous…  The level of congruence between the facial image of the Shroud and these artworks analyzed by Vignon is simply too high to believe in such an irrational scenario.  The Pantocrator-styled Jesus and the face of the Shroud man is much too similar, sorry.  And concerning these other few depictions of Jesus that you mention and that were done prior to the 6th century (there are some also in the catacombs of Rome : did you noticed that all these early depictions of Jesus with long hair and a beard ALL seems to have been done in Rome ?  Strange isn’t it ?), have you noticed that the face of Jesus is far less similar to the facial image on the Shroud than what was found by Vignon concerning the artworks he analyzed that were dated from the 6th to the 12th century ?  To me, that’s a clear indication that you’re right about the fact that these early Roman depictions of a bearded Christ with long hair that were done between the end of the 3rd century until the 6th century maybe, were most probably influenced by the Greco-Roman Gods like Zeus, Jupiter and others or by the traditional depiction of the classical philosopher, instead of being influenced by the Shroud or by a model made directly from the Shroud.  So, in my opinion, from the history of art, I think we can only say with a very good level of confidence that the Shroud had some kind of influence on the depictions of Christ ONLY from the beginning of the 6th century onwards and probably not before.  So, because of this, we can only conclude that the Shroud and his image was most probably already existing around 500 A.D., which is, by the way, a date that fits right into the alternative dating (1000 B.C.-700 A.D.) given by Ray Rogers from the lack of vanillin in the linen fibers of the Shroud.  So, from a pure scientific point of view, and when we analyze all the data and facts from the Shroud, I think this is the most honest conclusion we can get for the moment, i.e. that the Shroud of Turin and his image was most probably present at the very beginning of the 6th century and that it had some kind of influence (direct or most probably indirect) on the apparition of the Pantocrator-style depiction of Jesus and on the so-called miraculous imprints of Jesus face that surfaced during the second half of the 6th century.  In the end, all these artworks influenced by the facial image on the Shroud have greatly contributed to fix the image of Jesus in the mind of the faithful until this day.\nNote :  There is one particular fresco that was found in the St Marcellinus and Peter catacombs in Rome and which date from the second half of the 4th century that I consider to have been potentially influenced by the facial image on the Shroud.  It’s not a definitive conclusion from me, but this particular depiction of a bearded Christ with long hair is much more similar with the Shroud’s facial image than all the other Zeus-like Christ that were made in Rome from the end of the 3rd century until the 6th century or maybe later…  In my mind, I think we should leave the door open from the possibility that this particular artwork of Jesus (which is, by the way, the first known Christ in Majesty artwork ever to be found !) could have been influenced directly (or most probably indirectly) by the Shroud’s facial image and if that’s correct (this is just a possibility for the moment), then that would mean the Shroud and his image was most probably already existing around 350 A.D. or so., which is a time right after the discovery of the True Cross by Helena…  Does that mean that the Shroud could be a “natural” forgery done in the footsteps of that great “discovery” ?  Who knows ???  That’s possible, even though, as I said before, I consider this hypothesis highly unlikely for the moment.  But as I also said, if another C14 test on the Shroud would give a 4th century result (the “if” is important because we’re very far from there), then I would agree to raise the level of probability for such a scenario…  And I have to admit that there’s nothing in all the data and facts we have from the Shroud that can really and scientifically discard the possibility that the Shroud could have been a “natural” forgery done between 313 and 500 A.D., not even Rogers alternative dating !  And we also have to remember that this particular era saw the apparition of a great number of Christian relics (some of them associated directly with the Passion of Christ, like the Sudarium, the Spear, the Sponge, etc., etc.).  That’s why I leave the door open for this particular hypothesis, even if I favor much more the scenario which considers the Shroud to be the authentic burial cloth of Jesus, because it’s also important to understand that there is absolutely nothing in all the solid data and facts coming from the Shroud (I don’t mean the 1988 C14 dating, which was scientifically showed to be non-representative of the main body of the cloth) that really can discard the idea that this burial cloth of a real crucified man could not be the authentic Shroud of Jesus !  \nThat’s where I stand right now after a very long reflection.  I think we’re stuck with these 2 very different hypotheses and only a proper dating of the cloth would help to settle this issue once and for all.  I think me and you, we both agree on that !!!!\n\n","date":"October 11, 2012 at 5:05 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17519","author":"Yannick Clément","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Last thing :  I never heard the story before about the fact that AB blood only appeared around 900 A.D. !!!  Where did you get that ?  I’m certain that this point of view is not shared at all by an expert like Kelly Kearse.  I will ask him about that in a near future and I hope to give you his point of view…\n\n","date":"October 11, 2012 at 5:11 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17520","author":"Yannick Clément","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Yannick. There is clearly some confusion over the dating of the Sudarium although it is interesting that the same date recurs that correlates with the first mention of the Sudarium.\nWhen i researched the Sudarium for my book on relics, I understood that the Sudarium was not first seen until the chest was opened in 1075. It was the CHEST (unopened) not the Sudarium that dated back to the seventh century. The sources were often later than the opening of the Chest. As I have said before, the chest was said to have contained many more prestigious relics of the Passion. I wonder where they got to. At the time they were higher in the hierarchy of relics that shrouds or sudaria were.\nI am sorry if I have missed this in your many postings  but where do you think the Shroud was when it was first copied and can you confirm the date when you feel it was copied. Thanks. That will help us explore the context in which the Vignon markings may or may not have spread.\n\n","date":"October 12, 2012 at 4:18 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17534","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Another message for M. Feeeman and all the others who might be interested by the 2 C14 dating of the Sudarium of Oviedo that were done in 1990 and 1992.  Here’s a page from Stephen E. Jones in which you can find the whole story surrounding these 2 unofficial dating that gave 2 results not far from each other with a global average date of 708 A.D. :  http://members.iinet.net.au/~sejones/quotes/TSoT/stuc1201.html\nGo read that !  It’s a very good summary of the situation…\n\n","date":"October 11, 2012 at 5:13 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17521","author":"Yannick Clément","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Yannick:\nLas propuestas de  tiempo de origen de los tipos  O, A, B y AB  del NATURISTA Peter J. D´Adamo NO SON ACEPTADAS en el mundo científico.\nNo tiene base científica y es una ESPECULACIÓN que ha generado  UN GRAN NEGOCIO para D´Adamo inventando distintas dietas alimenticias para cada grupo sangíneo.\n“His belief that O, A, B, and AB blood types originated 30,000, 20,000, 10,000, and 1,000 years ago, respectively, does not fit with the current theory of the evolution of the ABO gene, either.” Fumiichiro Yamamoto, Ph.D\nSe lo conté a Freeman, pero no ha querido entenderlo\nCarlos Otal.\n\n","date":"October 11, 2012 at 6:12 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17522","author":"Carlos Otal","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Thank you . I am quite open to correction but  leaving aside the chap who links blood groups to ideal diets, it is commonly said that AB is only a thousand years old. I look forward to hearing what is now the revised account with details of the earliest recorded case of an AB blood grouping.\nDr. Yamamoto needs to say in what specific ways that those dates do not fit with ‘ the  current theory’ of evolution. Does he specifically deny the 1000 year date for AB?\nYes, we all need scientific backing for the emergence of AB from whomever is qualified to give it. I spent two hours in the internet some time ago on the issue and only found references to the circa a thousand years ago date for the emergence of AB but nothing to an earlier date. I now have a Hungarian medical historian ( sadly he is in the States lecturing at the moment so there may be a delay) working on it as most of the work done on this still seems to be in Hungarian as it was on the plains of Hungary that the mingling of A and B groups that led to AB seems first to have taken place in the ninth and tenth centuries.\nWell, that seems to have been the view until now but our knowledge of blood samples is always increasing day by day!\n\n","date":"October 12, 2012 at 3:21 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17531","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Adamo’s suggestion that AB blood only developed in the last 1000 years has to be a nonsense.  This is shown by the widely scattered universal distribution of the various blood types.  Even such a basic quick search on Wikipedia points to it: Check: http://en.wikipedia.org/wiki/ABO_blood_group_system#Distribution_and_evolutionary_history\nThere are several other web-sites showing the universal distribution of blood types, and very likely more authoritative than Wikipedia.  Here’s a few sample percentages on the frequency of AB+, roughly 8 times more prevalent than AB-:\nAustria 6.0%; China 5.0%; Czech Rep 7.0%; Finland 7.0%; France 3.0%; Hong Kong 6.35%; Poland 7.0%; Ireland 2.0%; Israel 7.0%; Korea 9.0%; Saudi Arabia 4.0%: Turkey 7.0%.  \nNotes from Encyc Brit: [Blood groups follow laws of Mendelian heredity:]\n[Comments on racial inheritance:] “By the 1960s and ’70s, scientists were writing about racial groups as populations that differed from one another not in absolute features but in the frequencies of expression of genes that all populations share. It was expected that each race, and each population within each race, would have frequencies of certain ascertainable genes that would mark them off from other races.”\n“Information on blood groups was taken from large numbers of populations, but when scientists tried to show a correlation of blood group patterns with the conventional races, they found none. While populations differed in their blood group patterns, in such features as the frequencies of A, B, and O types, no evidence was found to document race distinctions.”\n“The internal variations within races have proved to be greater than those between races. ”\nIf AB originated in Hungary only 1000 years ago, we would expect to see this reflected in the geographical distribution of AB with higher percentages being clustered around central Europe and tailing off into the Middle East and Asia.  In actual fact we see significant percentages occuring in such widely scattered locations as: Korea, China, Turkey, Finland and Poland.  Adamo’s theory is clearly a nonsense, which seems to be the consensus of most geneticists.  AB blood group clearly occurred at some earlier stage of human development.\n\n","date":"October 12, 2012 at 6:41 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17539","author":"daveb of wellington nz","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Yes, i agree that we should ignore Adamo =he had an axe to grind. My preliminary research is focussing on the Hungarian evidence that seems to be the best for the emergence of AB in Europe. (As said earlier i am liaising with a Hungarian friend who is a surgeon/medical historian in the hope of pinning this down further.) There were other areas ,of course, where Mongoloids and Caucasians intermarried- in China , Korea, southern India and across central Europe from Finland Poland, Czechoslovakia,  Hungary, Turkey etc..\nObviously AB has nothing to do with race because it arises from a mixture of different racial groups.That was always a non-starter.\nSince 1000 there have been further migrations of AB and  so there are populations of AB  blood groupings in areas of migration, especially from central Europe. It would be interesting to know how many of the Israeli AB population had their origins in Jewish migrations from central Europe.\nStill no evidence of any AB grouping before AD 900 – apparently when it was first found in Hungary- we need to keep searching for evidence. I shall stay with the emergence of AB 1000 to 1100  years ago until i see clear evidence of an earlier dating of the emergence which I shall be happy to accept. No one that I can find seems to be able to challenge this date but there could always be a first!\n\n","date":"October 12, 2012 at 7:08 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17541","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Dave B. You left Hungary out of your table where the incidence of AB is the highest in Europe at 8 per cent. This is precisely why studies of the emergence of AB have been concentrated here. It is clear from the incidence that there was a swathe of central Europe from Finland in the north to Turkey in the south where Mongoloid B people met with Caucasian A people and that eventually sexual mingling took place leading to the new AB grouping. This why you have ,second to Hungary, Turkey at 7.2 per cent, and Czechoslovakia and Poland at 7 per cent AB. ( In contrast if you go further west, France and the UK are only 3 per cent ,Spain 2.5 per cent, Ireland 2 per cent AB)\nIt was the occupation of the Carpathian Plain by the Magyars in 895 that is seen by some as the crucible where the mingling took place which is why a date of c. AD 900 is often given as the start of AB groupings with these becoming more intensive  between 1000 and 1100 (which is why some accounts talk of a thousand years since the emergence of  significant AB groupings). \nOne genetic website states as follows:’The blood group AB represents less than 5% of the world’s population. Resulting from unions of European populations of group A and of Mongol population of group B, this group is very “young”, since it has been in existence for only 10 to 15 centuries. The first traces of group AB go back to just about the year 900. Research undertaken in Hungary, from a necropolis dating from the IVth and VIIth century to this date, did not placed any individuals belonging to the AB blood group.’\nI am trying to track down this research but, as I have said before, I am open to any AB dating of blood groups before 900. I just haven’t found any.. It would be good to settle this issue one way or the other as it is of crucial significance for deciding on the authenticity of the Shroud , although I would like further blood testing to make absolutely sure that the blood on the Shroud/Sudarium really is AB\n\n","date":"October 12, 2012 at 11:02 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17547","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Encyc Brit states that blood grouping follows laws of Mendelian inheritance, which seems reasonable.  Tables of ethnic groupings suggest to me that there were very likely rather more blendings of A and B groupings resulting in AB progeny than just the Magyar said to have occurred around 950 AD.\nCheck and unhide ethnic groups table on web-site: http://en.wikipedia.org/wiki/Blood_type\nContent is tagged “factual accuracy is disputed”, but nature of dispute is not elucidated. \nBut sample figures for AB (without Rh tags) show:\nAustralian aborigine & NZ Maori 0%; Ainu (Japan) 18%, but Japanese 10%; Arabs & Armenians 6%; Hungarians 5%, but Gypsy (Hungarian) 10%; Hindus (Bombay) 11%; Kalmuks 11%; Koreans 10%; Persians 7%; Tatars 13%; Papuans (New Guinea) 9%; Etc  Both North and South American Indian populations show extremely low figures, 0% to 1%. \nIt seems fairly obvious that whenever a B dominant encountered an A dominant, progeny could result in AB, and this appears to have occurred sporadically on a number of occasions, not just in 950 AD.  One would expect Isolated populations to have stayed stable at either A, B or O, but this seems belied by the Ainu, Papuan, Kalmuk and other figures, even the Persian.  \nKelly Kearse posted an excellent article on Shroud’s blood group as AB several months ago on this site.  The Sudarium of Oviedo is also AB, and this is known to have been dated at least a few hundred years before 950 AD.  It seems drawing a long bow to dismiss the Shroud on the basis that the blood group of AB did not emerge before 950 AD.  Someone else can look into the business of whether there are any earlier examples.  We have seen on this site allegations that “all old blood degrades to AB” which has been disproved.  Are the Shroud sceptics really that desperate to discredit it by such a means?\n\n","date":"October 12, 2012 at 5:56 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17564","author":"daveb of wellington nz","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Concerning Kelly Kearse’s comprehensive posting on AB Blood Group on Shroud and Sudarium:  Posting can be found at:\nhttps://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/\nSeveral comments,, including support from, would you believe, Colin Berry!\n\n","date":"October 12, 2012 at 6:11 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17566","author":"daveb of wellington nz","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Concerning ancient Jewish blood types:  There is a known source of 1st century Jewish blood samples, which is regularly washed down the drains of the Israeli Antiquities Authority. Whenever a cemetery is discovered as a result of Israeli building development,the ossuaries are recovered, the bones are buried in a common grave, and the ossuaries cleaned with no scientific analysis of the contents.  This is noted in Jacobovici’s book on “The Jesus Family Tomb”  Bet you can’t get a responsible or coherent reaction out of the IAA on blood types distribution of 1st century Jews, although the data is potentially available there if anyone is prepared to do the work!\n\n","date":"October 12, 2012 at 6:25 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17567","author":"daveb of wellington nz","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Quote from M. Freeman that is addressed to me : I am sorry if I have missed this in your many postings but where do you think the Shroud was when it was first copied and can you confirm the date when you feel it was copied. Thanks. That will help us explore the context in which the Vignon markings may or may not have spread.\nMy answer :  I have no precise idea !  Nevertheless, I would assume that this artistic depiction of Jesus face that served as a model for the Pantocrator-like artworks of the 6th century onwards was most probably made shortly prior to the first depiction of that kind and presently, the first known depiction is the one in the Ravenna Basilica.  So, I guess this artistic model would have been made around 500 A.D.\nOf course, this is just a wild guess from me and have no historical value.  Honestly, I don’t think we’ll ever know the truth about that but for me, I don’t see any other rational explanation for the Pantocrator-like artworks of the 6th century onwards than to think they were made from an original artistic model of Jesus face that was done by an artist who had the chance to look very closely at the body image on the Shroud…  Since we know for a fact that the Shroud is not an artwork of any kind, this is the only rational way to explain the apparition of all these Pantocrator-like images that present a so high level of similarity with the facial image on the Shroud (far more than what we can expect from pure hazard).  Again, the idea that a forger could have been lucky enough to find an unwilling victim for his natural forgery that would have look almost perfectly like the Pantocrator images is just totally irrational and doesn’t get a great score on a probabilistic scale…  That mean one important thing :  the Shroud and his image MUST have been already existing ca. 500 !\nThat’s why I’m truly confident that if a new and proper C14 dating could be done on the main body of the Shroud of Turin, the result would most certainly give a middle date that would be prior to 500 A.D. \nAnd like I said, in my mind, this middle date would probably be around the first century A.D. since the very best (and most rational) hypothesis to explain the Shroud in face of all the known data that come from the Shroud is what tradition have always report it to be : the authentic Shroud of Jesus of Nazareth.  That’s where I stand in my reflection about that particular relic.  Nevetheless, I can’t say the same thing for all the other relics associated with Christ…  My level of confidence concerning their potential authenticity is in general much lower than for the Shroud and in the particular case of the Sudarium, I would say that I don’t know what to think for the moment (it looks like a 50/50 kind of thing !!!).\n\n","date":"October 12, 2012 at 5:02 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17559","author":"Yannick Clément","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Thanks for yours , Yannick. I think that the first thing to do is to assemble all the  examples pre-AD 800 of faces of Christ that are assumed  to have Vignon markings and place them on a map with colour-coding by date ( e.g. to 50 years).  You will have to accept than many will have decayed with time and others destroyed by iconoclasts but you may have a big enough sample to begin work. As I understand it Stephen Jones accepts the earliest Vignon markings as being of a Christ in the Catacomb of Marcellinus in Rome. Does one include the San Pudenziana Christ in Rome of c 390-420 as having Vignon markings?  It seems generally assumed that the Ravenna Christ of c. 500 also has Vignon markings. Can you see the point I am making – that the earliest examples of Vignon markings may be not far from each other in Italy and thus, if the Shroud was the source, this would suggest it was in Italy that early. e.g, before 500.\nThe earliest examples that Wilson can come up with are post 550. Of course, with the fall of the Roman empire the west was partly cut off from the east but our study might show conclusively that Vignon markings appeared in Italy before they did in the east and this would be significant.\nI don’t understand Vignon markings because i cannot see them in the Turin Shroud but others obviously can spot them without difficulty so perhaps they can work together to compile the images that they believe contain the markings and let us have the result on a map.\n\n","date":"October 14, 2012 at 11:10 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17628","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Charles,\nfor once we may well agree. Shroud reseachers should investigate the possibility for the TS to have been in Italy (Rome then Ravenna) before 500 just before it reached Edessa (the Parthian Rome).\n\n","date":"October 14, 2012 at 11:40 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17630","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Addition: before it reached Edessa via Cyprus.\n\n","date":"October 14, 2012 at 11:42 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17631","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Response to Max : THERE IS ABSOLUTELY NO HISTORICAL INDICATION THAT THE SHROUD OF TURIN EVER SPENT ONE DAY IN EDESSA…\nResponse to M. Freeman :  Read again my comment #37 above (https://shroudstory.com/2012/10/10/bsts-meeting-reminder/#comment-17519).  You’ll see that I was already referring to the fresco in the St Marcellinus and Peter catacombs as an artwork (which would be the most ancient if that’s true) that could possibly have been influenced by the Shroud of Turin directly OR BY AN ARTISTIC MODEL made from it (which is the hypothesis I favored the most).  \nI agree with you that, because all the first Shroud-like depictions of Christ are located in Italy, we can think that the Shroud could have been present there at the time, but I think this is far from being proven because of the other hypothesis I just raised.  Effectively, we can think that only an artistic model of Jesus face made directly from the Shroud was able to reach Italy before 500 A.D. (and maybe as soon as the second half of the 4th century if the fresco from the St Marcellinus and Peter Catacombs really was influenced by this possible model).\nOne thing’s for sure in my head : the Shroud and his image was certainly already existing in 500 A.D. and at least one artist was able to make a depiction of Jesus face from the facial image that is present on the cloth.\n\n","date":"October 14, 2012 at 8:11 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17639","author":"Yannick Clément","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Reply to YC: \nThe latter wrote: ‘THERE IS ABSOLUTELY NO HISTORICAL INDICATION THAT THE SHROUD OF TURIN EVER SPENT ONE DAY IN EDESSA…” \nMy PERSONAL research and studies on the TS allowed me to identify the partial decal of a Syriac text in Nestorian style just below theTSM’s beard. My finding is in keeping with the very first version of the Abgar legend. I shall further investigate the fragment to know whether it may be or not referable to Yeshua’s apocryphal letter to the Parthian king. \nThis is a palaeographic piece of evidence/”indication” the TS could have been  in the Parthian Rome namely Edessa…\nTo this is should be added, I aslo found archaeopareidolias of infant, child adolescent faces in conjunction with the TSM’s face. The second finding is ALSO in keeping with the Image of Edessa connection re a most secret Nestorian Easter liturgical ritual (see my flash illustrated paper).\nThe vast nimbus-like discoloration surrounding the TSM’s face, is also consistent with the Image of Edessa Christological iconography not to mention the latter designation both as a “rakos tetradiplon”,  (an old piece of stained/soiled cloth/rag with holes) and a “himation” (a long rectangular cloth). The very Greek word himation can translate the Hebrew Tallith and is also a synonym of the Greek Sindon, a term referable to a bed sheet, a night wear AND a …burial cloth.\nTHUS THERE ARE AN ARCHAEOCRYPTOLOGICAL, PALAEOGRAPHICAL LITERARY, ICONOGRAPHIC  & PHILOLOGICAL PIECES OF EVIDENCE INDICATING THE SHROUD OF TURIN COULD HAVE SPENT MORE THAN ONE DAY IN EDESSA.\n\n","date":"October 17, 2012 at 4:03 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17757","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Mistyping: Therefore WHEN PUT TO-GETHER, THERE ARE ENOUGH ARCHAEOCRYPTOLOGICAL, PALAEOGRAPHICAL LITERARY, ICONOGRAPHIC & PHILOLOGICAL PIECES OF EVIDENCE TO MAKE A CRUCIAL EVIDENCE:  IN ALL LIKELIHOOD, THE SHROUD OF TURIN  WAS ONCE KNOWN AS THE IMAGE OF EDESSA.\n\n","date":"October 17, 2012 at 4:16 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17759","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Yannick, there is no guarantee that C14 will date the Shroud correctly and, if the test is conducted and something goes wrong again, you can be sure that there will be more hypotheses and more papers. Take the question of a thorough cleaning of the sample prior to C14. One is lead to read the paper by the late John Tyrer in the professional journal “Textile Horizons”, 1989. To grasp what Tyrer meant in a better way, go to the link http://www.mospat.ru/en/2010/05/18 news 18357  and you will see Metropolitan Hilarion of the (Russian Orthodox Church) Moscow Patriarchate incensing the Shroud, but, naturally, from a distance, because he could not get closer. You will also see lots of candles around.\nif this was done recently you can be sure it was done centuries ago, right in front of the Shroud, with smoke from incense and candles impregnating the Shroud. Tyrer’s point becomes crystal clear.\n\n","date":"October 12, 2012 at 6:03 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17565","author":"Louis","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Contamination is a problem well understood by radiocarbon laboratories and there are increasingly sophisticated ways of dealing with it. It is not such a problem with the Shroud as seems to be assumed as the massive amount of contamination needed to give a first century sample a fourteenth century date would now be spotted well before the sample was tested.It was simply be too prominent to be missed by modern methods. As i understand it a modern laboratory would be able to assess the degree to which contamination might affect their readings and include this in their report on the variation in date. If the question was ‘Is the Shroud fourteenth century rather than fifteenth century?’ contamination might be an issue but hardly if it is a question of whether the Shroud is first century or fourteenth century.\nI am now on the fringes of archaeology but have had some contacts with radio-carbon dating of objects that i have been interested in for my books- especially the dating of the Thera eruption..  I am amused by the assumption in some of these posts that scientists working full time over many years in radio-carbon laboratories whose reputations depend on getting dates right are treated as if they were unaware of the remaining problems in radio-carbon dating -unlike some experts on the Shroud who may never even have visited a r-c laboratory!\n\n","date":"October 14, 2012 at 11:24 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17629","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"The topic is blood types and it has led to the Talpiot tomb. Professor Amos Kloner (Bar Ilan), who was for many years Jerusalem’s District Archaeologist, wrote in his report that the remains of around 36 (thirty six)  people were in the Talpiot tomb. That means that scraping the ossuaries to reach Jesus and Mary Magdalene, as Jacobovici wanted, would be pointless. Again, Kloner is highly qualified, and has no dog in the fight; Jacobovici is agenda-driven and is not really qualified to justify his allegations in the “Jesus Family Tomb”.\n\n","date":"October 12, 2012 at 6:46 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17568","author":"Louis","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"And even with the remains of 36 people available to him, your friend Professor Amos couldn’t even say if the blood types of A, B, AB or O were present or not!  What does he do to earn his money as District Archaeologist, index ossuaries?\n\n","date":"October 12, 2012 at 10:06 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17573","author":"daveb of wellington nz","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Addressed to the blog readers in general:\nRegarding the Talpiot tomb, or the so-called “Jesus Family Tomb” read the serious literature on the subject, and for some entertainment to go along, see the Discovery Channel’s second documentary where Ted Koppel, pressured by serious scholars upset with the sensationalism — called “archaeoporn” by Professor Jonathan Reed —- put things in the correct perspective.\n\n","date":"October 13, 2012 at 7:06 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17610","author":"Louis","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Re: Contamination. Any laboratory, whatever sophisticated means it may employ, will have to prove that, in the case of the Shroud, it has not done something like throwing the baby out with the bath water. John Tyrer was a Manchester textile expert, wrote in a professional journal, and his contention is still valid. Anyone who reads the relevant literature will find even more possible sources of contamination.\n\n","date":"October 14, 2012 at 11:58 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17632","author":"Louis","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"No one denies the problem of contamination. It is perhaps the major issue that labs deal with because of its potential to skew dates. That is precisely why so much effort is put into assessing its impact in specific cases.\nThe key issues for the Shroud  are first, authenticity – does a r-c test rule out a date as early as the first century?. If it does we then come on to the most probable alternative date or range of dates.\n\n","date":"October 14, 2012 at 4:41 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17634","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"I’m afraid Chearles you have a dilusional idea of radiodcarbon dating. For one RCDating on its own, would never, ever be taken as proof to any age. RCDating must be compared to and with all other relevant information. I have a friend that works at a prestigious RC lab here in Toronto, with over 20 years experience in the lab. I am not abliged to give out the name of this person, but he has told me he believes when it comes to the Shroud a proper dating would be extremely difficult to achieve and he points to the issue of provenance, as being number one and contamination equally as important in problem area in the testing. Materials such as linen are extremely difficult to date as they can absorb c14 isotopes from various sources and these can inpregnate right into the fibrels making them next to impossible or impossible to be sure all contamination has been removed. He has stated to me and I have read this many times in my own research of RCDating, that contamination is the main cause of numerous erroneous and odd dating that has occurred and STILL occurs on a regular basis. These anomalies are not fully understood in many cases but are usually blamed on contamination…Point is; They are still not at the stage of understanding where they can RCdate a sample such as from the SHroud with any certainty whatsoever…This is fact.\nR\n\n","date":"October 14, 2012 at 5:59 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17637","author":"Ron","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"The contamination problem is certainly an important issue regarding a possible new series of test but it certainly not a reason to avoid doing it!!!!  And so far, concerning the test of 1988, the only confirmed problem is a probable medieval repair that was done in that particular corner of the cloth.  All the rest of the potential contaminations factors have never been proven to have had any influence whatsoever on the result obtained by the C14 labs…  I’m pretty confident that if a new dating would be made with 3 threads taken in 3 different parts of the main body of the cloth and if the labs would make a very intense verification and cleaning of these samples (more intense than what was done in 1988), then we would probably obtain an age for the cloth that would be pretty close to the reality.  Don’t forget that an unauthorized and preliminary C14 test was done before the 1988 official dating of the Shroud on one single thread and it gave 2 different results (200 A.D. and 1000 A.D.) for each ends of the thread.  If this was due to a splice or something like that (that’s possible because I think this thread came from the Raes sample), then it’s truly possible that the rough date of 200 A.D. could be very close from the true age of that cloth (which is probably around 30 A.D.).\nAnyway, I think the Church should allowed a new series of C14 dating for both the Shroud and the Sudarium (and maybe also the Tunic of Argenteuil in France).  It’s about time that we know if these relics have good chances to be true or false…  I’m sure this will be done someday.\n\n","date":"October 14, 2012 at 8:25 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17640","author":"Yannick Clément","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"What British Museum scientist Dr.Sheridan Bowman — no “Shroudie” — wrote on the problem of contamination could also explain why the 1988 radio carbon dating went wrong and raises doubts about whether the 1988 carbon dating did in fact rule out a first century date. (One needs to use the word “also” because there are several other hypotheses in Shroud literature about how the results may have been skewed.) So how is it possible to believe in a probable alternative date or range of dates (with fresh carbon dating) if the problem of contamination has still not been resolved? \nExcavations in Sanliurfa are likely to bring new findings   — the mosaic is just one — that will certainly throw more light on the topic. As for new techniques in studying the relic preserved in Turin, Benedict XVI is Bavarian, speaks his mind (when he is allowed to do so) and will need a lot of convincing to decide who exactly in the realm of Shroud studies should supervise a future project.\n\n","date":"October 14, 2012 at 5:43 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17636","author":"Louis","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Well, you have to ask the experts to show you the recent work on correlating dates so as to provide ever more secure  radio-carbon 14 dating. It is radio-carbon 14 dating in 2012 that is important and goodness knows how much more sophisticated the procedures for dealing with the biggest problem of all, contamination, have become since 1988. There are full-time scientific professionals working over many years dealing with just this problem of contamination. One big leap forward has been in dealing with waterlogged material where the water dissolved the C-14 do leading to a false, older, reading. This can apparently,according to the section on radio-carbon14 dating in Bahn and Renfrew’s Archaeology ( 2012) now be dealt with.\nI have seen several papers on the 1988 testing that suggest the impact of contamination may have skewed the result but no one seems agreed on what specifically the contamination was and no one has been able to show that, after the cleaning process undertaken by the three different laboratories, so much contamination remained that it brought a 1350 reading to a first century cloth. More than this, even though the anti-contamination programmes in the three labs were different ,all still ended up with dates in the medieval era, long,long past the first century.\nI assume that some evidence of contamination would show up on the  photos of the Shroud if it were significant- does it?\nIt is isn’t a question of whether someone is a Shroudie or not because this is a purely scientific question. A first century shroud did exist – is the Turin Shroud it or not? No one’s faith is going to be changed if it is not as the Vatican has always made clear.\n\n","date":"October 15, 2012 at 4:47 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17651","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Remi van Haelst wrote some papers on the results of the three laboratories. The Shroud fibres are surely impregnated with smoke from incense and candles and that will not show up in photographs and what makes John Tyrer’s paper important. Regarding faith,yes,as I said several times previously, the relic is not part of the Church’s deposit of faith.\n\n","date":"October 15, 2012 at 7:40 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17654","author":"Louis","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Despite all the problems with -r-c carbon14 dating, especially contamination, which all the experts acknowledge and work hard to overcome, have you a single incidence of a r-c dating so way out that produces a result only a third of the true age e.g. 1350 rather than AD 30? The contamination alone, if of 2010, would have to be twice the quantity of the first century cloth and if the contamination was earlier  it would have to be even more than that. Yet one of the points John Tyrer makes is that the blood was the only liquid that seeped further down into the cloth, suggesting that contamination further into the cloth is limited. For me, it does not add up.\nI agree with Ron that a precise date of the Shroud might be difficult to achieve but we are not primarily interested in precision, we are first and foremost concerned whether imprecise date ranges rule out anything as early as the first century.That’s what I am interested in for starters and then, if so, one needs to follow up other leads. I still think the large cloths from the Middle Eastern workshops of the caliphs (ninth to eleventh centuries0 are important to rule out too before we go further. Many of them were brought back by Crusaders thinking that they were first century relics so a comparative study between the weave of the Turin Shroud and the weave of these cloths is important but it never seems to have been done.\n\n","date":"October 15, 2012 at 8:15 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17655","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"As far as I understood Tyrer, he said that no amount of cleaning would help and that was not in reference to the blood and there are many reports where r-c dating has gone far beyond the correct date.\nMme. Mechthild Flury-Lemberg made some good work on the Masada cloth and we could go further with the ninth- to eleventh-century cloths from the Middle East. Where are they preserved?\n\n","date":"October 15, 2012 at 9:35 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17658","author":"Louis","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Louis, I agree that there are cases where r-c carbon 14 dating has gone beyond what other evidence suggests is the ‘correct’ date. \nI have had to study the issue with the dating of the Thera eruption because it is one of the case studies for my introductory ‘textbook’ to the ancient Mediterranean, Egypt, Greece and Rome.  \nHere  radio-carbon and other forms of dating come to the late seventeenth century BC  but this conflicted with the Egyptian chronology of c 1500 BC. This is a classic study case for students of archaeology especially of ancient chronology because several different dating methods are being used against each other. There has been an immense amount of new radio-carbon dating in Egypt  to try and sort this out. As Bahn and Renfrew state  in their Archaeology, p. 155, ‘A major new programme of radiocarbon determination using well-stratified finds associated with specific pharaohs has recently yielded dates  earlier than previous historical estimates . . . and makes more likely the early date of around 1610 BC for the eruption’. So gradually thanks to the ever greater sophistication of radio-carbon14 dating, its application to a wide range of materials and its correlation with other dating methods – tephra studies, ice core studies, dendrochronology, (which, of course, help confirm that the radio-carbon14 dating is accurate) are producing a consensus for the later seventeenth century for the eruption.\nBut the discrepancy in an event that took place 3,600 years ago was only 125 years at the most- enough to be a worry and require intense extra investigation (because of the threat to traditional Egyptian chronology) but nothing compared to the 1350 AD versus AD 30 discrepancy claimed for a much more recent piece of material.  (Remember that r-c dating is used back to 50,000 years ago and so a lot of the problems that seem to be raised by disputants here are with the extreme age of the samples. Compared to these, the problems of dating a piece of cloth only  600-2,000 years old are elementary.)\nOn the Islamic cloths,  two examples we have in Europe (brought back from the Middle East by Crusaders) are the Veil of Anne at Vaucluse (dated to c. 1095) and the Cadouin Shroud, both are similar in size to the Turin Shroud (which is why they are of immediate interest) but, so far, I have had no information on how they were woven or how Islamic cloth in general was woven in these workshops. I have recently been in istanbul at the Museum of Islamic Art and they have a wonderful collection of Ottoman weaving but i didn’t see anything earlier than the thirteenth century.(Of course the Ottomans had nothing to do with the Crusades but ‘Turkish ‘rugs were common in Europe after the sixteenth century as their great quality was recognised and the Museum has examples of them in Renaissance paintings)\n\n","date":"October 16, 2012 at 6:42 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17680","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"On Islamic cloth- this is from the Qantara website on textile production post the sixth century AD. The issues that any serious researcher on the Shroud,and there are many who claim to be such, need to be aware of are 1) That good-sized cloths (Cadouin Shroud 281 cms by 113 cms). the Veil of Anne at Apt ( 310 cm by 152 cms) were being brought back as relics by Crusaders- both these cloths are now dated to c.1095.They are obviously only a tiny proportion of what was being produced in linen, wool and silk as the paragraph below makes clear. 2) The apparent presence of pollen,etc, from the Middle East on the Shroud is another potential link to these workshops.\nSo far as I can see no one in Shroud studies has seriously researched this area. The only textile expert I have talked, in the Victoria and Albert Museum textile department, thought there was a lot of potential here.\n“Faced with a technically weakened West after the Barbarian invasions and the protectionist silk trade of Byzantium, Muslim lands developed their own textile art and to a very high degree that matched their vibrant interest for the art. The circumstances were ripe: The conquests of the first centuries had joined in one block Spain, the Maghreb, the Byzantium Near East and the Sassanid Empire. A vigorous manufacturing activity thus fell into the hands of the Arabs—in Alexandria, Tyre and Antioch with their trade in twill—and that of the Fayums who specialised in linen cloth used as a ground weave in tapestries. This area of the trade thus opened up; natural resources circulated freely and a flourishing exchange of repertories and procedures ensued, along with the cultivation of textile fibres and plants used in dyeing.  Egypt and North Africa developed a culture of indigo and Spain saffron. Traditional textiles such as wool and linen began to evolve as new textiles entered into the picture such as cotton and silk, which propagated from East to West. Silkworm breeding in Byzantine Syria, launched by Justinian (6th c.), was acclimatised in the Spanish Levant and in the North of Sicily. In Andalusia it gave birth to an industry of luxury goods based in Almeria. The weaving of lampas, which appeared in Baghdad in the eleventh century, slowly entered the textile trade in Syria, Egypt and Spain and replaced that of the Samit. The Latin West followed suit. With the vibrant growth of cities following the Muslim expansion, the luxury of the courts and the needs of the army and the navy, textile production expanded rapidly. The new capitals of Fustat, Kairouan, Raqqada, Sabra Mansuriyya, Mahdia, Fez, Madinat al-Zahra, Cairo—and much later Marrakech—were among the centres that consumed and created textiles, having also the highest concentration of specialised labour.  In the markets, the muhtasib (the controller), his manual always handy, would keep a close watch on the quality of the textile goods in an effort to stabilise prices. His large lexicon of fabrics covered information from procedures, the places of fabrication and sales to details about decorative motifs. And while these terms are not exhaustive when it comes to identifying all of the techniques employed, they do reveal the impact and importance of this art in Muslim culture, a civilisation that is sometimes referred to as the civilisation of textiles.”\n\n","date":"October 17, 2012 at 4:39 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17734","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Charles and all,\nI have achieved the palaeographic dating of the Turin Sindon image and even succeeded in accurately reconstructing via numismatic eidomatics,  two Pilate coin obverses from partial faint tiny (brown to carmin brown) hematic coin decals left on the TS man’s eye areas.\n\n","date":"October 15, 2012 at 12:53 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17663","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Professor Freeman (#36) wrote: “I am simply not convinced by the argument based on the Vignon markings that the Byzantine images of Christ are derived from the Turin Shroud…. the fully frontal faces of Christ are derived from imperial art.”  He refers to the Santa Pudenziana apse mosaic in Rome “where Christ is shown in full, front on and with a beard,as an imperial magistrate.”\nI support the authenticity of the Shroud of Turin as the cloth that wrapped the body of Christ in the sepulcher.  Yet I agree with you that the Vignon markings and other features of Byzantine Christological iconography cannot credibly be attributed to features of the Shroud facial image.  In several papers, I have shown that these various features are found as standard motifs in Graeco-Roman portraiture.  One such motif, the so-called “topless box,” I also observed on two statues of Sesostris III (12th Dynasty, †1818 BCE).\nThe earliest depictions of Christ drew upon pagan themes and forms (e.g., Christ Helios).  But it is not necessary to point to one area alone of Hellenistic imagery – whether to imperial portraiture, to pagan religious art, or to an often-posited “philosophical,” type – as the inspiration for Christian iconography.  Rather, motifs and conventions of the entire gamut of Hellenistic and Classical portraiture – pagan, imperial and private – provided the foundation for the development of the great body of Christian art.\nThe standard media for paintings from this period were encaustic on wood panel, and thus, unfortunately, few have survived.  (Imperial magistrates?)  Yet  a treasure from the Fayum necropolis – more than one thousand portraits of ordinary upper-class persons of Graeco-Roman Egypt – attests to these frequency of these motifs.\nI deplore wilshful claims which unwittingly undermine credibility for the Shroud’s authenticity, which is supported by an abundance of valid evidence.  \nRegarding your comment, “If the bloodstains are AB, then we need to square this with the evidence that AB only appears in the historical record after AD 900.”\nRecently on this blog, Dr. Kelly Kearse posted information concerning when the AB blood type first appeared in history.  He reports, “AB blood type has been reported in skeletal remains that are approximately 1,600-2,000 years old.”\nUsually a different objection is raised – that all very old blood will type AB, which Dr. Kearse has refuted, pointing out that the blood of Tutankhamen (18th dynasty, 1322 BCE) was typed A.  You might also want to read his paper, “Blood on the Shroud of Turin: An Immunological Review,” available at http://www.shroud.com/pdfs/kearse.pdf.\n\n","date":"October 15, 2012 at 11:20 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17673","author":"Diana Fulbright","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Thanks, Diana. I have always been amazed by the Vignon markings issue. I came to Christian art via ‘pagan’ art so the development from one to the other was always natural to me and understandable. In my recent article ‘Tetradiplon-The Mystery Solved?’ I reproduce one of the Fayum portraits.\n I am afraid I cannot claim to be a Professor, except in Italy where  the local guides whom I employ for support when I am taking a study group there insist on addressing me as ‘Professore’! I am a freelance but my work tends to be published by university presses (OUP and Yale).\nI am open minded on the earliest date of AB. Obviously as soon as you had distinct A and B groups, AB was possible. I am sorry that the very high AB finding in the sample Kelly Kearse reports in Israel from 1977 does not appear to have been replicated. These samples from 35 years ago need to be retested. I am surprised that so high a percentage has not been the subject of further investigation as it is out of line with any other percentage for AB in a population, although i assume that in this case the skeletons may have been related to each other.\n\n","date":"October 16, 2012 at 6:53 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17681","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"With thanks also to this recent (what a nice surprise !) paper by Kelly Kearse on the bloodstains on the Shroud. I had been cautious about accepting the AB grouping as it did not seem to have been replicated but Dr. Kearse has now provided an acceptable imprimatur for AB.\nSo we are now back to the first emergence of AB in Europe. In summary.  A general view for which there seems to have be some evidence from Hungary, the area where the highest incidence of AB ( 8 per cent) is reported today, is AD 900 or AD 1000. There is the single 1977 report of a very high incidence, over fifty per cent, of AB in a very small sample of skeletons tested in Israel in 1977. There has been so much excavation in the Jerusalem area that it is amazing that there is nothing supporting this very early AB finding since 1977 and no other report of AB from before AD 900  (assuming that the one report of AB  from Egypt has now been discredited) unless contributors to this blog can provide one. .\n\n","date":"October 16, 2012 at 10:44 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17701","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"When it comes to  pre-10th Roman and Byzantine Christological iconography, one shall be able to discriminate between true and false accidental characteristics (ACh) all the more so as no mre than 2-3 clearly copied true ACh can work as tiny pieces of evidence,  which once put together make a crucial evidence much akin to fingerprints.\n\n","date":"October 16, 2012 at 6:39 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17679","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"I deplore too many Shroud scholars non qualified in the 4 relevant fields of expertise  (namely Roman and Byzantine Art History, archaeological image analysis and cryptanalysis) tackled the pre-10th c. CE Roman and Byzantine Christological iconography issue and imposed their biased views.\n\n","date":"October 16, 2012 at 6:55 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17682","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Mistyping: “non qualified in AT LEAST ONE of the 4 relevant fields of expertise”\n\n","date":"October 16, 2012 at 7:03 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17683","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Mistyping: “pre-6th c. CE Roman and pre-12th c. CE Byzantine Christological iconography”\n\n","date":"October 16, 2012 at 7:14 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17685","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Charles, there are many things you say about c-d that are not difficult to agree with, however Shroud history appears to point to the fact that there is just too much contamination involved, not least because of the smoke, and that is what distinguishes it from other objects that can be carbon dated. In fact, the question of whether it is suitable at all to be subjected to c-d has also been raised.\nRegarding the two cloths you mention, that is a good lead. Yet, given that the Shroud is so widely known, someone who saw similarity in weave or some other detail would have brought the fact to light. But, of course, this requires further research.\n\n","date":"October 16, 2012 at 7:17 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17686","author":"Louis","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Not to mention 11th-12th c. CE Benedictine Christological iconography. (Pray codex miniatures).\n\n","date":"October 16, 2012 at 7:20 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17687","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"… or Civate wall frecoes)\n\n","date":"October 16, 2012 at 7:22 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17688","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Most curiously, no one has ever seriously considered the possibility for a specific burial ritual to (also?) contaminate the TS…\n\n","date":"October 16, 2012 at 7:36 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17689","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Here’s a message to M. Charles Freeman :  Yesterday evening, I had the pleasure to read your newest paper “Tetradiplon – The Mystery Solved?” and I want to congratulate you for this excellent description of your hypothesis, along with a direct, simple and clear rebuttal of Wilson’s wild hypothesis !!!  1000 times congratulation for this great paper !!!  \nAfter the reading, I said to myself : If someone read this paper with no preconceive notion about the Shroud’s obscure past, it’s impossible for this person to still favored Wilson’s hypothesis as the best possible explanation for the lack of reference to a Shroud of Christ with an image on it prior to 1204 !!!  IMPOSSIBLE…  Your demonstration of Wilson’s weakest points is very easy to understand, even for someone who have almost no notion in history. And if this person complete his reading with my own paper about all the problematic facts related to Wilson’s hypothesis (here’s the link to it: https://shroudofturin.files.wordpress.com/2012/06/clc3a9ment_questions-about-the-mandylion-hypothesis-of-wilson_2012-06-28.pdf), I think such a person will never favored this weak hypothesis again… \nI particularly appreciated the example you gave of a great pro-Shroud bias we can find in the Shroud World versus Wilson’s hypothesis when you shed lights on what Scavone has sadly and wrongly written concerning the use of the word “sindon” in the Acts of Thaddeus.  Many months ago, I had the pleasure to write on this blog a direct reply to Scavone’s trial to destroy the credibility of my critics concerning Wilson’s fantasies. It was a pure pleasure for me to noticed that you were as critical as me versus Scavone’s totally erroneous (and evidently biased) way to interpret the use of the word “sindon” in the context of the Acts of Thaddeus !  I said to myself : “Gee !  Finally, M. Freeman’s comment versus Scavone is a great proof that I surely wasn’t off-track in my own critics of his personal interpretation concerning the expression “sindon tetradiplon” in particular (among other erroneous interpretations he made concerning other ancient manuscripts related to the Mandylion) !  \nSo again, bravo for this critical paper that clearly shows how much disgusting bias is going on in the pro-Shroud world versus Wilson’s fantasies.  I would add this :  Such evident bias just served well all the anti-Shroud skeptics on the planet by giving them all the ammunitions they need to look at the pro-Shroud researchers as a bunch of religious fanatics full of bias, not worthy of being called “scientists” and consequently without any credibility whatsoever…  It’s sad because I’m truly convinced that there are still some scientists in the Shroud world who are really doing an honest quest for truth, but unfortunately, it’s rarely these persons that are on the frontline of Shroud research and gets much of the attention of the public. Consequently, the international scientific community have a great tendency to consider sindonology as a joke without any sense of credibility.   \nOn this particular subject, I really appreciate this comment you wrote in your paper: “Sadly, his account (Wilson’s hypothesis) has been accepted uncritically by many of his readers and even now if you put ‘tetradiplon’ into a search engine, you will find accounts suggesting that the Image of Edessa, with its face of a living Christ, was actually part of the folded burial shroud of Jesus that, it is claimed, still exists today as the Turin Shroud.” THIS IS SO TRUE and that’s the main reason why I’ve started my own crusade against this hypothesis of Wilson because after having done my homework, I’m now 100% convinced that this hypothesis is completely wrong and should be set aside. Unfortunately, and that’s one thing you forget to mention in this part of your paper, Wilson’s account concerning the Mandylion has not only been accepted by a good portion of the English speaking shroudies but sadly and this is much worst, it has been accepted blindly by a good portion of the sindonologists themselves (most of them having no historian formation) !!!  That’s the saddest thing that’s going on for years in the pro-Shroud world and it’s completely disgusting to see.  All this look to me as a big propaganda operation that his in fact a very big joke for anyone who know how to do a proper and unbiased historical research on the subject…  And the only way this bad joke could end would be for the sindonologist community to publicly acknowledge that Wilson’s idea is most probably false and that we should look elsewhere in order to find the TRUTH about the Shroud’s obscure years. Unfortunately, these days, this is exactly the opposite that’s going on !  Just look at the pro-Shroud persons like Jones and Marinelli who have recently tried hard to defend Wilson’s hypothesis AT ALL COST, even though they are not historians ! These sad examples make me think that this big joke is not going to end soon in the Shroud world and it’s very sad to note because it shows that the authentic quest for truth is not what drives the majority of the sindonologists…\nI dream of the day when all these biased scholars will get out of the way in order to gives more space to all the Shroud researchers who simply wants to find the truth versus the Shroud (people like you M. Freeman, and I must give thanks to Dan and his blog for giving you the opportunity to share your work with the pro-Shroud world). And that mean seeking the real truth, whatever this could be, including the possibility that still exist for this cloth to simply be the product of a “natural” forgery done by someone who would have used a real crucified body in order to reproduced the burial cloth of Christ. Note that if this hypothesis is true, it’s most probable that this gruesome creation would have been done shortly after the finding of the True Cross by Helena and the beginning of what we can call the “Christian false relic business” in the Middle Eastern Church (which is an historical fact)…  \nOf course, this is just a possible hypothesis, along with the other one that claim the Shroud to be the genuine burial cloth of Christ and I don’t want to give the impression that I support it.  But because I only seek the truth regarding this relic, I MUST keep the door open for that possible scenario, along with the other one that consider the Shroud to be no more than the burial cloth of someone else than Christ who would have been executed by the Romans in the same manner… Acting like this is a proof of unbiased reflection and it’s sad to note that it’s far from being the norm in the pro-Shroud world !\nFinally, concerning your own hypothesis to explain the use of the word tetradiplon, I think the fact that the word was used ONLY BEFORE the cloth was given to Jesus in order that he could wash his face with it (you underline it many times in your papers, as it should) is one good point in favor of your hypothesis because historically, this is exactly what was going on in some Pagan or Christian ceremonial rituals.  Of course, unless there would be new discoveries in some Syriac or Greek manuscripts related to the story of Abgar and the Image of Edessa, I doubt that your idea would reach one day the level of a confirmed theory, but at least, I have to say that I never read before a more rational hypothesis concerning the use of this particular word. And in the end, the most important thing to note in your paper is your very good hypothesis concerning the question of why the author of the Acts of Thaddeus used this unknown and very odd expression to talk about the Mandylion, i.e. because he simply wanted to gives this miraculous cloth a “special status”.  Honestly, this is by far the best explanation I’ve read concerning this question, because it’s the most simple and rational that exist once you put yourself in the historical context of this anonymous author. \nSo, in conclusion, I have nothing else to say, except : Bravo and keep on your good work !!!  In the Shroud world, we need more people like you who are honest enough to seek the truth and not their own little truth (which is far from being the same thing) !!!  It’s only when most Shroud researchers will act as you do (i.e. with integrity, honesty and an open-mind that has no fear to seek the real truth, even if this truth can be something else than you first thought and could consequently force you to change your mind) that we will get closer to the truth regarding this relic and his potentially authentic status.\nYannick\nP.S.: At the beginning of your paper, you wrote this : “Why did these acheiropoieton images first appear in the sixth century? It seems possible that there were the first intimations of iconoclasm and there was a powerful need for evidence that Jesus had ‘authorised’ images of himself by transferring the image of his face onto a cloth (see Hans Belting, Likeness and Presence, Chicago, 1994, p. 56). In order for this idea to have any credibility a legend had to be created to give the sixth century image a history in Edessa that took it back over five hundred years to the time of Jesus.”\nEven though I also raised the same possible explanation during my own research, there is another possible answer that I tend to put alongside this “anti-iconoclast” explanation and it is the historical fact that, during the second half of the 6th century in Edessa (which is the most probable time when the Image surfaced in the city), there was at least 3 different Christian groups, i.e. the Orthodox, the Nestorians and the Monophysits (who were an heretic group who denied the dogma of the 2 natures of Christ: human and divine, related with the whole orthodox concept of the Incarnation). I first encountered this hypothesis in the very good paper of Maurus Green about the Shroud’s obscure years (here’s the link for this paper: http://www.monlib.org.uk/papers/aj/aj1969green.htm) and he said that it was Vignon’s own hypothesis to explain the apparition of the Image of Edessa during that time. In short, this hypothesis maintain that this image of the face of the living Christ would have been created in order to back-up the dogma of the 2 natures of Christ against heretic groups like the Monophysits who were well established in Edessa. So M. Freeman, have you ever consider this alternative possibility to explain the apparition of the Image in Edessa at that particular moment, which was well before the official beginning of the Iconoclastic period in 726…  What do you think of this possible solution?  Note that what’s the most interesting thing about this hypothesis is the fact that later on (during the 7th century I think), there are some texts who states that the Monophysites themselves desperately wanted to put their hands on the relic. In fact, they would have finally succeed and they would have put it in their chapel to venerated it !  It’s possible that the original plan of the Orthodox Church by creating this relic and insert it in the Abgar legend as a miraculous imprint of Christ would have finally return against them !  Effectively, if this is true that the Monophysits wanted to get and venerated this relic, it’s probably because for them, it wasn’t at all a proof of the 2 natures of Christ but instead a proof of their own heretical dogma which pretended that Christ only had one single divine nature…  \nInteresting hypothesis isn’t it ?  I really wonder what you think of this.  Personally, I think it’s truly possible that these 2 different reasons (both linked with the historical context of the time in Edessa) could be correct in the end and both could have had an important influenced on the decision of the Orthodox Church to create this co-called “miraculous” imprint of the face of the living Christ.\n\n","date":"October 17, 2012 at 10:43 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17746","author":"Yannick Clément","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Yannick, Thank you for your supportive comment. I don’t think I need as much praise as that – the Wilson hypothesis was always a hopeless one. It was simply remembering another depiction of a cloth and then being lucky enough to discover that it was folded in a way that could be called, without hesitation, tetradiplon that allowed me to put two and two together. I don’t claim that my hypothesis is right, only that Wilson’s is clearly a non-starter so one must begin to look elsewhere for the reason why the author of the Acts of thaddeus chose to use this rare word.\nAlas, I am just preparing for another lecture tour and won’t be back until 31st October – I may not be able to consider your other ideas before I go.\nWould it not be good if the meeting of the the British Shroud enthusiasts could come up with some genuine new material that we can all consider?\n\n","date":"October 17, 2012 at 1:36 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17754","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"What would be even greater is if one day in the pro-Shroud world, most people could forgot about Wilson’s fantasies and start proposing other possible hypotheses that could explain the lack of ancient written or artistic references concerning a Shroud of Christ that would bear his body image and bloodstains until ca. 1200 in Constantinople…  That would be awesome, especially if that would be done by credible historians and not a journalist like Wilson who only publish his “work” in the books about the Shroud that he sell in popular libraries !!!\n\n","date":"October 17, 2012 at 4:40 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17762","author":"Yannick Clément","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Yes,Yannick,  I could not agree more with you. The Wilson/Scavone/Guscin deadwood has to be cleared away – perhaps leaving a few splinters where there they have raised relevant points that deserve further discussion. Goodness knows what a breath of fresh air would come into Shroud studies ( which to my mind are only one small part of my own field,the wider world of medieval relic cults) if everyone could start again with a clean drawing board.\nYou have done a good job in showing up the hopelessness and misleading nature of much of Wilson’s work ( I leave the explanation for his motives alone- does he really believe what he writes?- I simply don’t know- does he really not know about the parts of the texts he uses to support his claims that directly conflict with them or has he suppressed them thinking that no one would check up on him?).\nYou have also made the important point again and again that Wilson has long been discarded and derided by the conventional world of Byzantine scholarship. Perhaps the penny will drop and Shroud researchers will start finding effective NEW avenues to explore.\nWill Sunday’s meeting simply be a repetition of the ‘Wilson is right’ scenario? I don’t hold up much hope when de Wessleow who seems to have swallowed Wilson’s claims  uncritically is a key note speaker! I hope that someone challenges him to say what new original findings he came across in the six years research he claims to have done on the Shroud- he must have found SOMETHING new to tell his audience beyond the fact that he doesn’t think it is a fourteenth century painting!\nI shall be out and away lecturing in Italy until the 31st so I shall wait and see what happened.\n\n","date":"October 18, 2012 at 4:50 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17774","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Just in case Yannick Clément missed my last post:\nYC wrote: ‘THERE IS ABSOLUTELY NO HISTORICAL INDICATION THAT THE SHROUD OF TURIN EVER SPENT ONE DAY IN EDESSA…”\nThe facts is my PERSONAL research and studies on the TS allowed me to discover several pieces of evidence implyng the TS image could have been known as the image of Edessa:\n1/ I dentified the partial decal of a Syriac text in Nestorian script just below theTSM’s beard. I shall further investigate the fragment to know whether it may be or not referable to Yeshua’s apocryphal letter to king Abgar (see the earliest version of the Abgar legend)\n2/I detected archaeopareidolias of infant, child adolescent faces in conjunction with the TSM’s face. This is also in keeping with the Image of Edessa connection re a most secret Nestorian Easter liturgical ritual (see my flash illustrated paper).\n3/ I also detected a vast nimbus-like discoloration surrounding the TSM’s face. This is also consistent with the Image of Edessa Christological iconography.\n4/ The Image of Edessa’ is described both as a “rakos tetradiplon”, (i.e. an old piece of stained/soiled cloth/rag with holes folded/doubled in four) and a “himation” (a long rectangular cloth about 420cm long and 140cm wide for a man 5ft 8″-6ft2″ tall like the TS Man). Now the very Greek word himation can translate the Hebrew Tallith and is also a synonym of the Greek sindon,; a term referable in turn to a bed sheet, a night wear AND a …burial cloth.\nAlthough my findings still need some refinement and extension, a fact remains: WHEN PUT TO-GETHER, THERE ARE ENOUGH ARCHAEOCRYPTOLOGICAL, PALAEOGRAPHICAL LITERARY, ICONOGRAPHIC & PHILOLOGICAL PIECES OF EVIDENCE TO MAKE A CRUCIAL EVIDENCE TO WIT IN ALL LIKELIHOOD THE SHROUD OF TURIN WAS ONCE KNOWN AS THE IMAGE OF EDESSA.\n\n","date":"October 17, 2012 at 5:28 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17765","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Yes Max, I saw your post.  You must acknowledge one simple thing :  In all the ancient manuscripts, there is NO mention at all that a Shroud of Christ was ever present in Edessa.  That’s what I ment.  Now, if you want to speculate, it’s up to you and you will not be the first and probably not the last !!!  But that’s not the proper way to do history.\n\n","date":"October 18, 2012 at 8:30 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17793","author":"Yannick Clément","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"I mean ArchaeoCRYPTOlogy (hence CRYPTOhistory). \nIn this light, philological, iconographic  epigraphical, literary, perceptive archaeological facts are NOT speculations!\nREMINDER for a close-minded Geographer tackling History:\nThe latter CAN/DID/DOES RECEIVE LIGHT from archaeology. \nDo your home work, try to think by yourself and stop parroting Green and set-minded pro-domo Art historians…\n\n","date":"October 18, 2012 at 9:00 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17796","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"…ease off the pathologic speed pedal about Wilson’s mistakes too (Although the matter may have been 75% wrong, he also was quite insightful once or twice).\n\n","date":"October 18, 2012 at 9:14 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17797","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Nobody’s perfect.\n“Miiss Typing”: pleadse read “the latter” (instead of the matter)\n\n","date":"October 18, 2012 at 9:17 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17798","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"BTW, how can you tell my dectection of the partial decal of a Syriac text in Nestorian script is a speculation? Why don’t you ask instead a specialist of Semitic languages and especially Syriac? He could tell you. You cannot.\nWhat do you REALLY know about epigraphy?\nWhat do you REALLY know about philology?\nWhat do tou REALLY about Late Antique & Medieval iconology?\nWhat do you REALLY know about Late Antique & Medieval legendary literature?\nWhat do you REALLY know about Late Antique & Medieval image/text archaeological analysis and cryptanalysis?\nWho’s speculating?\n\n","date":"October 18, 2012 at 9:36 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17800","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"You cannot even recognize a himation when you see one in a wall fesco or a mosaic!\n\n","date":"October 18, 2012 at 9:42 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17802","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Mistyping: please read “EPIGRAPHICAL” (instead of “PALAEOGRAPHICAL”)\n\n","date":"October 18, 2012 at 7:26 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17784","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Mistyping: IN ALL LIKELIHOOD, AT SOME POINT OF ITS HISTORY, THE TSI WAS\nKNOWN AS THE IMAGE OF EDESSA.\n\n","date":"October 18, 2012 at 7:33 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17786","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"This  says SOMEthing. Unless you ask British & Italian Art historians respectively Davor Aslanovki & Andrea Nicoletti, Birish historian Charles Freeman, French Canadian Geographer Yannick Clément etc\n\n","date":"October 18, 2012 at 8:20 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17791","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"M. Freeman, it would be very interesting if you could verify for yourself the possibility that the Image of Edessa was created by the Orthodox clergy of that city during the second half of the 6th century to fight against the Monophysit heresy that was pretty strong there.\nIn the paper written by Maurus Green in 1969 about the Shroud’s obscure years, here’s 2 quotes where he described this particular hypothesis (you’ll see that some important historians agreed with this scenario) :\n1-“Eastern politics being so intermingled with theology, the Edessan Icon was inevitably dragged into both. Dobschiitz and Runciman believe that it was used in the sixth century by the Orthodox clergy of the city to oppose the monophysites who tended to deny the reality of Christ’s human nature. The “self-portrait” of Christ was a convincing weapon against such views, despite the fact that later the monophysites made sure of their own copy of the Image.”\n2-“A special feature of this iconographic evidence is the evident likeness of the isolated head of the Shroud to the Mandytions. With long hair, staring eyes and absence of neck, it almost seems to be their negative. Could this similarity, coupled with the anomalies common to both, give us the moral certainty that the Shroud was the unique acheiropoietos, kept, as Vignon believed, in some monastery easily accessible to the theologians and artists of Edessa? For centuries it was a holy, but mysterious and embarrassing relic; suddenly, under pressure from the Monophysites, the Orthodox Clergy realise the role that could be played by a copy of the Face of the Shroud, if turned into a living portrait of Christ. The climate was right in the sixth century with the decline of relics in favour of icons. The Abgar legend with Ananias5 role as painter was to hand. All that had to be done was to have a copy made on cloth, “process” it by incubation, give it a plausible miraculous origin and the desired weapon was there to confound the Monophysites, put the Persians to flight and become in course of time the most holy Mandylion. Have we here then the unique source of all “true likenesses”, Veronicas, Epitaphioi and the “figured shrouds” of the West?”\nThis potential explanation for the origin of the Image of Edessa deserves to be verified more deeply by credible historians of the present day.  So, I really hope you’ll be one of them !!!  Who knows what your research about this hypothesis could uncover ?  Personally, because of the probable fact that the Image surfaced in Edessa after the middle of the 6th century (well before the official start of the Iconoclastic period), I have a tendency to favored this hypothesis over the one you proposed in your last paper (the one linked with the idea that the Image of Edessa could have been created to fight against some early Iconoclasts in the Orthodox Church).  As I said in my previous comment, it’s truly possible that both hypothesis could be correct to some extent, but I tend to favored the one that his based on the theological battle that was ragging on in Edessa during the second half of the 6th century between the Orthodox Church of that city and his dogma of the 2 natures of Christ and the Monophysits and their idea that Christ only had a divine nature and his human nature was just an appearance of humanity and nothing else.  In reality, this particular Christian philosophy was part of a more general philosophy called Gnostic philosophy who always tend to denied the human nature of Jesus Christ…  \nFinally, as I said before on this blog and in my paper against Wilson’s hypothesis (see fact #20 in my paper: https://shroudofturin.files.wordpress.com/2012/06/clc3a9ment_questions-about-the-mandylion-hypothesis-of-wilson_2012-06-28.pdf), if the Image of Edessa would have really showed the Shroud’s bloody face, there’s absolutely no doubt at all that the Monophysits would never have tried to get this Image and venerated it, because the gruesome and bloody aspect of the facial image on the Shroud show in great details the human nature of Christ, which goes completely against their philosophy !!!  No doubt that if the Monophysits of Edessa would have put their hands on such a relic of Christ, they would have destroyed it !  And on the contrary, there are some historical evidence that they have venerated it !!!!  This is another very good indication that the Image of Edessa was nothing more than an image of only the face of the living Christ.  Of course, you will never find anything concerning this fact in Wilson’s books about the Shroud and the Mandylion !\nSo, it’s up to you M. Freeman but if I was you, I would certainly do some research about this very promising hypothesis…  In the end, I can say that such a scenario is truly promising and I favored it because it is grounded in the historical context of the second half of the 6th century in Edessa.\nNote: As I said in the description of the fact #20 you’ll find in my paper, the information concerning the fact that the Monophysits once kept and venerated the Image of Edessa during the 8th century come from an ancient manuscript entitled “Chronicle” written by Michael the Syriac (A.K.A. Michael the Great). I think this would be a very good starting point for you M. Freeman if you ever decided to make some researches concerning the possibility that the creation of the Image of Edessa was mainly due to a theological fight between the Orthodox Church of Edessa and the Monophysit community living in that city.\nAlso, here’s another interesting suggestion for you:  I think it would be very nice if you could analyze in deep the recent presentation that Wilson did this summer at the Shroud congress of Valencia in Spain about his Mandylion hypothesis versus the Shroud’s early history. If you didn’t download this presentation yet, here’s the link to the paper : http://www.shroud.com/pdfs/wilsonvtxt.pdf.  And here’s the link to the Powerpoint presentation: http://www.shroud.com/pdfs/wilsonvppt.pdf.  I’ve read the paper and found an incredible number of wild speculations, extrapolations and very special assumptions link with other things not related necessarily to the sindon tetradiplon expression !  It’s important to note that the sindon tetradiplon expression is only one aspect of Wilson’s argument in favor of his hypothesis concerning the Mandylion… In sum, I really think that if you could make a proper analysis of this whole presentation of Wilson, it would be a nice critical exercise that would show all the erroneous things that’s in there.  People interested in the Shroud (whether they are pro-Shroud or not) DESERVE to know how wild and sometimes ridiculous the hypothesis of Wilson really is and only a real historian like you can do this with credibility.  Of course, I could did this kind of critical analysis myself, but since it would be me, people around here will only throw me tomatoes and some will even not listen at all !!! ;-)\n\n","date":"October 18, 2012 at 8:28 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17792","author":"Yannick Clément","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"You might have noted Maurus Green advanced this hypothesis in support of Ian Wilson’s “attractive theory that the Turin Shroud was the Image of  Edessa.” (“Enshrouded in Silence,” p. 343.)\n\n","date":"October 19, 2012 at 11:02 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17904","author":"Diana Fulbright","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Ha ha ha !!!!  Increble how pro-Shroud people are biased toward Wilson’s fantasy.  IT IS PATHETIC and do not deserve more comment from me.  I’m just sick and tired to lose my time versus close-minded persons who don’t want to see what is as obvious as the nose in anyone’s face for any unbiased Byzantine scholars, i.e. that Wilson’s hypothesis is completelly false AND YOU KNOW IT VERY WELL (but will never admit it for whatever reason that I still don’t understand perfectly well).  Welcome to the Pro-Shroud’s clique…\n\n","date":"October 21, 2012 at 7:15 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17999","author":"Yannick Clément","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"By the way, one last precision:  It is COMPLETELY FALSE to pretend that Maurus Green was supporting Wilson’s hypothesis, at least from what we can read in his 1969 paper !  Sadly, it’s true that he left the door open for this wild hypothesis (he must have turned around in his grave since ! He he !) but that’s not the only possible hypothesis he mentioned in his paper…  Pretending that this particular article offer a real support to Wilson’s hypothesis would be wrong, completely wrong.\n\n","date":"October 21, 2012 at 7:52 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-18004","author":"Yannick Clément","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Charles – Your explanation of the tetradiplon by the peplos is not very convincing.  First, I doubt a Christian writer of the sixth century would imagine the luster of a pagan festival would somehow increase the glory of Christ.  This is a dubious proposition, if not utterly absurd.  Then I ask if, indeed, the author of the Acts of Thaddeus really meant to imbue his cloth with the aura of the Panathenaea, why would he use tetradiplon, an obscure word with no connection to the peplos.  Clearly, this word tetradiplon, not listed in the unabridged LSJ, was never used to refer to the peplos.  Moreover, in my opinion it is unlikely that a Christian writing in the sixth century would have been so familiar with the Panathenaea, which was banned along with the Olympic games by the Roman Emperor Theodosius in 393.\nBTW, tetradiplon means 4 x 2, or “four doubled,” not “four doublings.”  Thus, a cloth folded three times yields eight layers, as shown in Wilson’s sketch.  (No doubt you obtained copyright permission.)\n\n","date":"October 19, 2012 at 10:10 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17902","author":"Diana Fulbright","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"I found his explanation to be very convincing.  So it’s 1-1.\n\n","date":"October 21, 2012 at 7:15 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-18000","author":"Yannick Clément","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"That’s right, and as the focus was on the face there was no need to show the shoulders.\n\n","date":"October 20, 2012 at 1:05 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17910","author":"Louis","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Diana , I look forward to your detailed refutation of my argument as you have not yet addressed the central points I made.Your posting seems to be somewhat impressionistic.\nI have used Wilson’s illustration because it is all over the internet- it was from one of these uses that I was referred back to his book.\nMy approach is speculative but only because Wilson’s is impossible for the reasons I have point out. I do actually provide an example of a cloth fold four times while he can only manage three to produce a cloth divided not into four (see further below) but into eight.\nEarly Christianity (one of my fields) is littered with examples of austere Christians complaining of less austere Christians following pagan customs especially in celebrations. Pope Leo I complains of Christians worshipping the sun from the steps of St. Peter’s, others complain of the continuing pagan festival feasts around the tombs of the martyrs (see Ramsey MacMullen’s The Second Church on this), there are complaints of ‘pagan’ candles being lit at martyrs’ shrines, the whole idea of transferring vast quantities of money , gold and mosaic into church buildings is essentially pagan- certainly not Christian – as Jerome complained!! What about the Esquiline treasure =, a Christian marriage chest with a naked Venus on the top!! So the overlap is greater than you seem to imply, but , as you will have seen, I raised the question of whether the pallium, which has been described as folded, is another ceremony transferred from a pagan precedent. So my argument is not ‘utterly absurd’. A pagan world becoming Christian still lived in pagan mindsets- just as much of modern Christmas celebrations have absolutely nothing to do with the Christian story.\nWe may not have another record of tetradiplon , but if you have studied your lexicon you will know that using tetra- as a prefix was very common. i still work from my great-grandfather’s 1865 lexicon but I gave up counting after I had read through eighty examples – I think there must be some 150 as i was only half-way through. i am surprised that no one, so far as i know, has been through this before so that some comparisons between tetradiplon and other ‘tetras’ can be made.\nSo if you take tetra together with some action you get tetraelix, ‘four times wound or twisted round’,  tetrapalinon, ‘ a fourfold lace or string; or tetrapalos ‘ploughed four times’, There are many examples of tetra being used of objects divided into four  but as Wilson has a cloth divided into eight this does not help him- he should have stuck to two foldings!. I leave it to the Greek scholars to take this on further (none that I referred my article to have suggested my translation is wrong) but there are certainly enough examples to suggest that tetradiplon is likely to refer to four ACTS of doubling and we have the Parthenon example to show that cloth was actually subject to such acts of doubling in a major ceremony.\nI have to close now as I am on the road lecturing in Italy – on site with a group of 25 at the early Christian mosaics at Aquileia next Wednesday!-until the middle of November.\n\n","date":"October 20, 2012 at 4:43 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17916","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"P.S. One of the scholars of Byzantine literature who knows the original texts in Greek replied to me as follows:\n‘It is still not clear to me if tetradiplon means “folded four times” or “folded in fourths.” The latter would imply folding only twice. Wilson’s theory involves three foldings,  resulting in eight sheets. The only explanation I can think of how this explains the word tetradiplon is that he’s referring only to the third folding in which 4 sheets are folded over to form 8. In other words, 4 X 2 = 8.’\nBut I don’t think Wilson says anything about referring to ONLY the third folding. One must remember that Wilson is not a scholar of ancient Greek and one must refer to those who are on these matters. He seems to have been caught in an impossible position, neither folded into fours, nor folded four times (as the Parthenon cloth was).\nI can only repeat what I have said, and more eloquently than I , Yannick Clement, that until one clears away the deadwood of Wilson/Scavone and Guscin one is never going to make any further progress in Shroud studies.\n\n","date":"October 20, 2012 at 5:41 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17919","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Charles I thought the consensus is that tetradiplon simply means; Tetra (four) diplon (doubled)…Four-doubled. Which would mean; one would double a long sheet four times. I don’t think ‘folded’ was or is the right translation in there.\nR\n\n","date":"October 20, 2012 at 6:17 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17922","author":"Ron","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Ron: ‘Four-doubled. Which would mean; one would double a long sheet four times.’\nYes, this is the basic argument in my article (contra Wilson’s three doublings)  although there is no reason why the cloth should be long , I use the example of a napkin tho show that tetradiplon could apply to quite a small cloth. Folding is, of course, implied and perhaps my source was concentrating on the example of an actual cloth.\n\n","date":"October 20, 2012 at 8:36 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17927","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Ron- if you look in your Greek lexicon ( at least if it is similar to my exhaustive 1865 edition) you find that ‘diploe’ is actually translated as a ‘fold’ or  ‘doubling’ so my highly erudite informer may have been thinking of this. There seems to be an awful lot of work as yet undone on ‘tetra’ prefixes which will help  a fuller understanding of tetradiplon. But as there is an example of a cloth folded double four times, we know that such foldings of cloth did take place in ceremonies. That is incontrovertible from the relief. Whether this links in with the use of the word in the Acts of Thaddeus is, of course, speculative. We just have to start from the failure of the Wilson hypothesis and play around with alternative possibilities.\n\n","date":"October 20, 2012 at 10:50 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17929","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"La hipótesis de Ian Wilson desata PARANOIAS.\nMoïse de Khorène (ca 410-490) en “History of Armenia”, termina el CH XXXIII del Libro II con la frase siguiente:\n“Anan, courrier d’Abgar, lui apporta cette lettre, ainsi que l’image du Sauveur qui se trouve encore à présent à Edesse.”\n¿Conocen esta imagen del Mandylion de Edessa?\nhttp://lasabanaylosescepticos.blogspot.com.es/2012/10/sobre-el-mandylion-de-edessa.html\nCarlos Otal\n\n","date":"October 20, 2012 at 5:51 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17921","author":"Carlos Otal","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Moise of Khorene account refers most probably to a painted portrait of Jesus face and this account was most probably based on the Doctrine of Addai which clearly refers to a painted portrait of Christ !  Wilson’s hypothesis about the Mandylion is wrong. Period.  No credible Byzantine scholar has ever agreed with Wilson’s fantasies to sell books and this fact speaks louder than anything else…\n\n","date":"October 21, 2012 at 7:19 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-18001","author":"Yannick Clément","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Debe decir:\n“… termina el CH XXXII del Libro II ….”\nCarlos Otal\n\n","date":"October 20, 2012 at 6:57 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17925","author":"Carlos Otal","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"\nCharles Freeman :Ron: ‘Four-doubled. Which would mean; one would double a long sheet four times.’Yes, this is the basic argument in my article (contra Wilson’s three doublings)  I use the example of a napkin tho show that tetradiplon could apply to quite a small cloth. Folding is, of course, implied and perhaps my source was concentrating on the example of an actual cloth.\nCharles; “although there is no reason why the cloth should be long,” – To you maybe, but it seems to me, the use of the term tetradiplon or any term whatsoever, would logically suggest a much larger cloth being used, as opposed to a small cloth. Why would a small towel or napkin need to be doubled in four, or folded at all? I agree with you that four-doubled would require four foldings. Furthermore this type folding would produce seven fold marks on the cloth.\nR\n\n","date":"October 20, 2012 at 10:53 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17930","author":"Ron","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Ron. I assume you have read  my article so that you know what we are talking about.\nI am pleased to find something we agree on because if tetradiplon is translated as ‘four doubled’ as you suggest this rules out Wilson’s hypothesis that only describes a three doubled cloth. – tridiplon, I suppose.\nLet’s take it gently.\n1) If you have a handkerchief to hand , lie it flat and then fold it double four times. You will be able to do it. So tetradiplon, if translated as ‘four doublings’ , is possible for even a small cloth. So unless we have some other information we would not know the unfolded size of any cloth described as tetradiplon.\n2) We have a LEGENDARY account of Jesus wiping his face with a cloth that was described as tetradiplon before he wiped his face with him with no reference to it being folded tetradoplon afterwards. It is legendary because it describes an event taking place in the first century BC before the death of Jesus, so before AD 30, when there is no evidence for Christianity in Edessa before the end of the second century. So like all legends this is imagined. If this was simply a face cloth ,the writer of Acts of Thaddeus must have imagined it as small when folded but big enough to contain an image of a face when unfolded. We know nothing more about his imagination other than that he lists the burial cloths of Jesus separately later in his account and here he seems to have drawn on the gospel accounts to supplement his legendary account.\n3) We have an ACTUAL illustration of a cloth that is folded tetradiplon from the relief on the Parthenon so we know that such foldings did happen.\nThat is what we have to go on.\n\n","date":"October 20, 2012 at 4:44 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17945","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"110  3) continued:   In this case we can see what the original cloth would be in size by working out, in relation to the characters on the frieze, the size of the cloth as shown and then working from there to calculate  its full size when unfolded. The peplos would, in this instance, be quite large. The interest is, of course, that this shows a cloth folded tetradiplon BEFORE being used in a ceremonial role and the Acts of Thaddeus also describe a cloth that is tetradiplon BEFORE it plays a part in the ceremony of wiping Christ’s face.\nI am not saying that I am right in this case , although i have had strong support for my thesis from those I circulated it to before publishing it,  but as soon as one rejects the Wilson hypothesis as being a non-starter there are lots of avenues to explore.\nBut, and this is the topic at hand, will the British Shroud meeting be a place when anyone opens up new avenues of research or will it be one when the old arguments are simply recycled and everyone pats themselves on the back. Will the impossibility of Dawkins accepting the challenge until he is given access to the Shroud be raised? Will there be any agreement even on what scientific facts about the Shroud there are for him to go on?\n\n","date":"October 21, 2012 at 5:05 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17965","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Meeting Reminder","post":"Sorry, first century AD!\n\n","date":"October 20, 2012 at 4:46 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","id":"comment-17946","author":"Charles Freeman","site":"shroudstory"}]
