[{"title":"A kind of witness?","post":"Dan,\nThe most evocative use of the the”silent witness” phrase was in the title of David Rolfe’s film released on Easter Monday 1978. Rolfe’s film  that ubdoubtedly paved the way for the STURP team to Rome. An Italian version was issued a few weeks later. The movie was written by Rolfe, Ian Wilson and Harry Lincoln. Perhaps David or Ian might enlighten us who the idea for the movie name came from. Perhaps not, it is what it is.  \nSmall plug: you can get a copy of Silent Witness and two subsequent Rolfe films about the Shroud on DVD from Amazon. Silent Witness was the first and the best. Five stars. ***** Anyone who is interested in the Shroud who hasn’t seen it, must see it. Really.\n\n","date":"May 23, 2013 at 4:59 am","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","id":"comment-34408","author":"John Klotz","site":"shroudstory"},{"title":"A kind of witness?","post":"This ‘witness principle’ is very important indeed. Look it up in John: two witnesses are required (Joh.8:16-18). In Joh.19:38-42 there are two men that put Jesus in the grave. In John 20:1-11, there are again two men verifying that the grave was empty.\nThereafter, in John 20:11-20, things take a more spiritual turn. There are now two angels in the grave. These angels are a spiritual reflection, of the double image on the Shroud. Have a look at the text. These angels were white, as the Shroud was. They were where the body of Christ was, each at one end of that place. And what they speak out is the logical conclusion, that must have been formed ,bit by bit and very gradually, in the head of Maria M., when she saw the image on the Shroud.  These two angels are at the same time a representation of the Shroud, and those who speak out what the Shroud means as a witness. Tom Tracy is right. Note that this ‘two witnesses’ principle continues, in a very surprising way, in John 20:19-29, where Thomas the Twin speaks out.\n\n","date":"May 23, 2013 at 5:07 am","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","id":"comment-34412","author":"Jos Verhulst","site":"shroudstory"},{"title":"A kind of witness?","post":"As important as the shroud would be, or seem to be, would we not expect it to be alluded to in some fashion in the old testament as were other significant events surrounding Yeshua and the Passion narrative? Behold:\n“When Elisha came into the house, behold the lad was dead and laid on his bed. So he entered and shut the door behind them both and prayed to the LORD. And he went up and lay on the child, and put his mouth on his mouth and his eyes on his eyes and his hands on his hands, and he stretched himself on him; and the flesh of the child became warm. Then he returned and walked in the house once back and forth, and went up and stretched himself on him; and the lad sneezed seven times and the lad opened his eyes. He called Gehazi and said, “Call this Shunammite.” So he called her. And when she came in to him, he said, “Take up your son.” –2 Kings 4.32-36 (NAS)\nMouth to mouth, eyes to eyes, hands to hands: analogous to a mirror image and associated with a death and resurrection. Is not the shroud as a mirror image associated with a death and resurrection?\n“But we all, with unveiled face, beholding as in a mirror the glory of the Lord, are being transformed into the same image from glory to glory, just as from the Lord, the Spirit. […] And even if our gospel is veiled, it is veiled to those who are perishing, in whose case the god of this world has blinded the minds of the unbelieving so that they might not see the light of the gospel of the glory of Christ, who is the image of God. […] For God, who said, “Light shall shine out of darkness,” is the One who has shone in our hearts to give the Light of the knowledge of the glory of God in the face of Christ. But we have this treasure in earthen vessels [“a fragile vase of clay” per Weymouth; “a vase of earth” per Etheridge; “an earthen vessel” per Murdock], so that the surpassing greatness of the power will be of God and not from ourselves”  –2Corinthians 3.18; 4.3-4, 6-7 (NAS)\n\n","date":"May 23, 2013 at 8:49 am","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","id":"comment-34451","author":"EGM","site":"shroudstory"},{"title":"A kind of witness?","post":"I think the witness issue is very important.  It is a biblical principle established in Deuteronomy 19:15 that the truth of a matter is established by the testimony of two or three witnesses.  There must be some significance as to why there were no human witnesses to the most important miracle of Christianity.  God does not violate his own rules therefore there must be two or three witnesses…and there are!  The linen cloth “lying there” was the first piece of evidence that Jesus had risen from the dead.  There was also the “napkin” that was about his head folded next to the linen.  This we believe is the Sudarium of Oviedo (Spain). And lastly the empty tomb itself–all three are witnesses to Christ’s resurrection today.  Any one of them can be seen today, examined today, and venerated for their meaning today.  The eye witnesses to his post resurrection appearances are significant but they are all dead–all we have is their written testimony two thousand years later.  The Shroud, the Sudarium and the empty tomb all testify today and for all generations and fulfill the mandate laid down in Deuteronomy.\n\n","date":"May 23, 2013 at 6:49 am","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","id":"comment-34433","author":"Russ Breault","site":"shroudstory"},{"title":"A kind of witness?","post":"In criminology “the silent witness” is the dead (not the resurrected).\n\n","date":"May 23, 2013 at 7:08 am","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","id":"comment-34436","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A kind of witness?","post":"Russ why don’t you ask Augustine of Hippo about the empty tomb scene? Was Yeshua’ naked when he appeared to Maria Magdalene?\n\n","date":"May 23, 2013 at 7:19 am","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","id":"comment-34437","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A kind of witness?","post":"Most Christians rely on a totally biased exegesis of the empty tomb scene.\n\n","date":"May 23, 2013 at 7:22 am","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","id":"comment-34438","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A kind of witness?","post":"When it comes to witnesses of the Resurrection, the interesting fact is that the Gospels posit the first witness as a woman: Mary Magadalin. In Corinthians, St. Paul only writes of male withnesses. St. Petter and then 500 brothers.\nSeveral writers including N.T. Wright have concluded that the fact that the Gosples have a woman as the first witness is evidence that the Gospel traditions pre-date Corinthians. Woman were not even allowed to be witnesses in court in most circumstances. If you want to know the status of women at the time of Christ, think Taliban.\n\n","date":"May 23, 2013 at 10:58 am","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","id":"comment-34470","author":"John Klotz","site":"shroudstory"},{"title":"A kind of witness?","post":"John, I agree that it is significant that it was women who first communicated the message of Christ’s resurrection.  It hugely elevated the status of women. If the story was made up, they would have never casted women as the messengers.  The numerous eye witness accounts of his post resurrection appearances are also huge because he didn’t just “appear” like some kind of UFO sighting but he sat and talked with them about the Kingdom.  My point however was that there we no eyewitnesses to the actual resurrection event itself.  Yet we DO have three witnesses to fulfill the mandate of Deuteronomy 19:15—an empty tomb, a vacant shroud, and a napkin lying next to it.\n\n","date":"May 23, 2013 at 6:03 pm","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","id":"comment-34515","author":"Shroud Encounter","site":"shroudstory"},{"title":"A kind of witness?","post":"There are two witnesses in the Apocalypse 11:1-14.\nPerhaps the Shroud has an end times role?\n\n","date":"May 23, 2013 at 11:21 am","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","id":"comment-34473","author":"ChrisB","site":"shroudstory"},{"title":"A kind of witness?","post":"Maybe that is the whole point – there were numerous witnesses to the miracles, performed by Jesus Christ, including resurrecting others  from death, but there are no human witnessess to testify on His Resurrection in order to be based on Faith only?\nFrom the practical stainpoint – maybe it was just unsurvivable for humans to witness Resurrection of  God?\n\n","date":"May 23, 2013 at 1:19 pm","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","id":"comment-34485","author":"jesterof","site":"shroudstory"},{"title":"A kind of witness?","post":"I like your last statement that perhaps it was an event that mortal humans could not endure.  He wouldn’t allow Mary to touch him that morning…yet that evening in the upper room everyone touched him.  Regarding faith, Jesus made at least six post resurrection appearances specifically to bolster their faith.  In fact Acts 1:3 says “After his suffering he showed himself to be alive through many convincing proofs.”  Those proofs were the post resurrection appearances…but perhaps the Shroud is left behind as a convincing proof for the generations that would follow…especially this one where knowledge of the  Shroud is communicated around the world instantly just like this blog.  Maybe?\n\n","date":"May 23, 2013 at 5:53 pm","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","id":"comment-34514","author":"Russ Breault","site":"shroudstory"},{"title":"A kind of witness?","post":"EGM: “As important as the shroud would be, or seem to be, would we not expect it to be alluded to in some fashion in the old testament as were other significant events surrounding Yeshua and the Passion narrative?” \nExodus 26:31-33: “You are to make a veil of purple stuffs, VIOLET SHADE AND RED, [colour of blood??] of crimson stuffs, and of FINE TWISTED LINEN; you are to have it finely embroidered with cherubs. … You must hang the veil from the clasps and there behind the veil you must place the ark of the Testimony, and the veil will serve you to separate the Holy Place from the Holy of Holies.” cf. I Kings 6:16, the same arrangment in the Temple of Solomon. It seems a similar arrangement was in the Temple of Herod. \nMatthew 27:50-51: “… But Jesus, again crying out in a loud voice, yielded up his spirit. At that, the veil of the Temple was torn in two from top to bottom; the earth quaked; the rocks were split; …” \nThe Temple veil separated the mundane from the Holy. The Shroud serves to reveal the suffering and death of the Saviour, and might be seen as the boundary wherein the mystery of the Resurrected Christ may be discovered.\n\n","date":"May 23, 2013 at 5:12 pm","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","id":"comment-34510","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A kind of witness?","post":"There are layers of meaning in Paul’s use of a veil in 2Cor 3.18, the most obvious reference perhaps being the glory of Moses’ face from being in the presence of the glory of God’s face (from glory to glory):\nExodus 34:29-35 (NAS) “It came about when Moses was coming down from Mount Sinai (and the two tablets of the testimony were in Moses’ hand as he was coming down from the mountain), that Moses did not know that the skin of his face shone because of his speaking with Him. So when Aaron and all the sons of Israel saw Moses, behold, the skin of his face shone, and they were afraid to come near him. Then Moses called to them, and Aaron and all the rulers in the congregation returned to him; and Moses spoke to them. Afterward all the sons of Israel came near, and he commanded them to do everything that the LORD had spoken to him on Mount Sinai. When Moses had finished speaking with them, he put a veil over his face. But whenever Moses went in before the LORD to speak with Him, he would take off the veil until he came out; and whenever he came out and spoke to the sons of Israel what he had been commanded, the sons of Israel would see the face of Moses, that the skin of Moses’ face shone. So Moses would replace the veil over his face until he went in to speak with Him.”\nThere’s also the veil the bride wears over her face until she becomes the wife. The wife of Christ does not wear a veil and is exposed to the glory of God. (“Did I not say to you that if you believe, you will see the glory of God?” John 11.40)\nThe veil can also be referencing the Sudarium (or a darkness) placed over the face of the dead, to be removed in the resurrection, when they are to put on the glory of God. (“Beloved, now we are children of God, and it has not appeared as yet what we will be. We know that when He appears, we will be like Him, because we will see Him just as He is.” 1John 3.2) (Wherefore he saith, Awake thou that sleepest, and arise from the dead, and Christ shall give thee light. Ephesians 5.14) (As for me, I will behold thy face in righteousness: I shall be satisfied, when I awake, with thy likeness. Psalm 17.15)\nThe veil of the most holy place also applies. The image in the most holy place was the covering cherubim on opposite ends of the mercy seat representing where God’s glory resided on earth, just as the image of the shroud represents Christ’s glory and the tomb where it was found had two angels on opposite ends of where he was laid. (“and she saw two angels in white sitting, one at the head and one at the feet, where the body of Jesus had been lying.” John 20.12)\nPaul was a top tier proto-rabbi (Pharisee of the Hillel school) and was well aware of all these interconnections and multidimensional streams of thought and more which we (I) entrained to the western mode of thinking can barely scratch the surface of, except by the Spirit. It’s a shame his Hebrew poetic genius isn’t clear in the Greek translations as shown in the Aramaic.\n\n","date":"May 23, 2013 at 11:15 pm","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","id":"comment-34559","author":"EGM","site":"shroudstory"},{"title":"A kind of witness?","post":"Reminder for Russ (which was also adressed to Jason): Second Temple period gardeners used to wear a sindon (or achiton/hemation) next to the skin as workwear… Hence Yeshua’ long (inner) burial or sindon was not even left behind in the cave tomb as most likely he was draped in it when he appeared to Mary of Magdalene. Augustine of Hippo’s exegesis is also a clue to a better understanding of the famous scene. Unfortunately, the exegesis bias came in with John Chrysostom who most probably saw the shroud and included it into the empty tomb scene for liturgical purpose.\nFor additional clues, you should also study Yeshua’s hemation/sindon Byzantine and Medieval iconography in conjunction with the empty tomb scene, his apparition to Mary Magdalene on ‘that morning’, descension to hell to free those held captive by sin and ascension to heaven.\n+ of course.\n\n","date":"May 24, 2013 at 1:53 pm","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","id":"comment-34652","author":"Max Patrick Hamon","site":"shroudstory"}]
